{
  "title": "Zach Bitter: Ultramarathon Running | Lex Fridman Podcast #205",
  "id": "0RTWSJAqTPg",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.600\n The following is a conversation with Zach Bitter, ultramarathon runner and coach who held multiple\n\n00:05.600 --> 00:12.240\n world records in the 100 mile run and other ultra endurance events. He is currently training for a\n\n00:12.240 --> 00:18.720\n run across America, which for now is planned for September this year. Like many of the things Zach\n\n00:18.720 --> 00:24.960\n has done in the past, this is a big, fascinating challenge. Quick mention of our sponsors,\n\n00:24.960 --> 00:31.520\n Ladder, Valcampo, Noom, and BetterHelp. Check them out in the description to support this podcast.\n\n00:32.080 --> 00:36.480\n As a side note, let me say that Zach has been advising and coaching me on my own\n\n00:36.480 --> 00:41.120\n running journey. I want to mention that Zach sent me some running shoes from Ultra,\n\n00:41.120 --> 00:46.160\n which I think is a company that sponsors him. When I put those shoes on, I feel like Zach is\n\n00:46.160 --> 00:52.320\n watching me, and I get that extra motivation to make him proud. And by that, I mean I want to put\n\n00:52.320 --> 00:57.120\n a lot of miles on those shoes. Running is something that has always been difficult for me,\n\n00:57.120 --> 01:03.120\n but I love it because it is difficult. The hardest part is I'm left alone with my thoughts\n\n01:03.120 --> 01:09.680\n for one or two hours. Some thoughts are dark, like thinking about mortality, my own and that of\n\n01:09.680 --> 01:16.960\n others. Some are self critical, like personal weaknesses or dreams not realized. Some are simply\n\n01:16.960 --> 01:23.760\n human feelings of loneliness, personal and existential. And yet, there are the moments\n\n01:23.760 --> 01:30.240\n during a run when all that fades and I'm left empty of negative thoughts and full of appreciation\n\n01:30.240 --> 01:36.640\n for the beauty of experience, of nature, life, the whole thing. This is why I return to running.\n\n01:37.440 --> 01:43.280\n Not to get in shape, but to face myself and to run through it. That's why I'm inspired by people\n\n01:43.280 --> 01:50.080\n like Zach and by David Goggins and others like them who seek to find the limits of their body\n\n01:50.080 --> 01:56.720\n and mind. This is the Lex Friedman podcast and here is my conversation with Zach Bitter.\n\n01:58.080 --> 02:03.360\n Where does your mind go when you're running an ultra marathon? Are there a lot of positive\n\n02:03.360 --> 02:09.200\n thoughts, negative thoughts, demons, inspirational things, maybe no thoughts at all? Yeah, that's the\n\n02:09.200 --> 02:13.680\n really interesting part of the sport, I think, because you can essentially what it is when we're\n\n02:13.680 --> 02:18.160\n looking at like the hundred mile distance or anything that's like all day long is you're\n\n02:18.160 --> 02:24.000\n going to have the full range of the full spectrum of emotions of mental processes, both kind of\n\n02:24.000 --> 02:31.120\n positive, negative and in between. So it almost feels like you've lived multiple, multiple lives\n\n02:31.120 --> 02:36.240\n or full life, maybe it was way to say it in that one time period. So it's like a it's almost like\n\n02:36.240 --> 02:40.880\n assimilation of what you may experience in a long period of time in a very condensed period of time.\n\n02:40.880 --> 02:45.520\n And I think that's just a weird mental process to reflect upon. And that's what kind of draws people\n\n02:45.520 --> 02:50.560\n back to it. But I mean, it's a battle, too, because if you're looking at it from a performance\n\n02:50.560 --> 02:55.440\n standpoint versus an experience, you obviously want to minimize the negative mindset stuff.\n\n02:55.440 --> 03:01.920\n You want to try to keep those emotions and those thought processes at a low. And I think when you\n\n03:01.920 --> 03:08.400\n can keep yourself from letting those thoughts creep in, they you end up having better races\n\n03:08.400 --> 03:12.960\n and it's it can spiral in either direction. Like I notice like there's there's kind of like this\n\n03:12.960 --> 03:17.280\n scenario that occurs where in the beginning, like a negative thing creeps in your mind. It's like\n\n03:17.280 --> 03:21.280\n super easy just to slap it down and say, like, get out of here. You know, I did the training,\n\n03:21.280 --> 03:25.120\n I'm fit, I'm feeling fresh still. You know, everything's going well at this point in time.\n\n03:26.080 --> 03:31.120\n You get a little further along in the race and you're starting to feel a bit of the fatigue,\n\n03:31.120 --> 03:34.480\n I mean, a little bit of self doubt creeps in. You start asking yourself, well, you know,\n\n03:34.480 --> 03:38.960\n maybe I should have done one more long run or did I did I not quite taper long enough? And those\n\n03:38.960 --> 03:44.320\n things can kind of spiral into a negative way. And if if you let it keep going, it keeps going\n\n03:44.320 --> 03:51.920\n all the way to like, why am I here? Why am I doing this? This is stupid. All the way to like,\n\n03:51.920 --> 03:54.960\n there's another one of these two weeks from now, I'm going to drop out of this one and sign up for\n\n03:54.960 --> 03:59.280\n that one instead. And then you just find yourself in the exact same situation. So you kind of have\n\n03:59.280 --> 04:06.000\n to go through the process, I think is why I think there's kind of a I won't say it's a rule of thumb\n\n04:06.000 --> 04:11.440\n necessarily, but something I think is fairly valuable is if you do a hundred mile or the first\n\n04:11.440 --> 04:17.840\n time, make sure you get it done, even if it means like, you know, death marching is what they'll\n\n04:17.840 --> 04:22.480\n call it in the alternate community at the end of the race. Just to say, like, you got that full\n\n04:22.480 --> 04:26.640\n experience, you experience the highs, the lows, the full thing, the starting, the crossing the\n\n04:26.640 --> 04:32.400\n finish line, that release of emotion when you're done and all that stuff. So that when you go back\n\n04:32.400 --> 04:37.600\n to do it again, you have like a template to build off of, then you know, or you just have some data\n\n04:37.600 --> 04:41.440\n to pull from about how your mind is going to work as well as your body so that you can start\n\n04:41.440 --> 04:45.680\n practicing Well, what do I have to do to kind of keep my mind from spiraling in a negative direction?\n\n04:45.680 --> 04:51.120\n Or how do I catch some positive momentum and kind of keep sending it that way, and things like that.\n\n04:51.120 --> 04:57.360\n And that just I think, you just add to that over a career of running them or a series of running\n\n04:57.360 --> 05:02.080\n them and it sharpens. It's kind of like any sport with that where, you know, you always have this\n\n05:02.080 --> 05:07.120\n balance between the youthfulness that you may have earlier in your career versus the wise\n\n05:07.120 --> 05:11.920\n intelligence that you have maybe near the end of your career. So in terms of wisdom, is there\n\n05:11.920 --> 05:18.160\n mechanisms by which you kind of observe the negative thoughts and let them go? So you have\n\n05:18.160 --> 05:25.040\n a people like the David Goggins is who kind of this, he seems to almost like separate his mind\n\n05:25.040 --> 05:32.640\n into there's the weak David that he hates. And then there's this strong, strong one. I mean,\n\n05:32.640 --> 05:38.400\n there's like a very contentious relationship there. So he basically says, like, I refuse to\n\n05:38.400 --> 05:42.480\n be that person. And he's almost like angry at that person. It's almost like sometimes\n\n05:42.480 --> 05:47.440\n literally yelling at that person, the weak version of themselves. And then there's another more sort\n\n05:47.440 --> 05:56.720\n of Sam Harris the approach, which is like, just observe the thought and let it go. Maybe knowing\n\n05:56.720 --> 06:02.480\n that this too shall pass, like no matter what it, this moment will not last forever. And kind of\n\n06:02.480 --> 06:07.840\n sort of accepting the natural flow of things and taking one step at a time and allowing whatever\n\n06:07.840 --> 06:12.720\n the negativity, whatever the pain you're experiencing just to pass, even if it means a\n\n06:12.720 --> 06:18.160\n death march, which one is more effective for you? Which one, like, would you say generally speaking\n\n06:18.160 --> 06:24.080\n to the population is more effective? Yeah, that's a really good question. It's probably unique to\n\n06:24.080 --> 06:29.280\n the individual. I wouldn't argue that, you know, David is finding success with his approach.\n\n06:30.880 --> 06:35.600\n Some may argue it's an extreme version. You know, Sam has obviously thought about these things and\n\n06:37.360 --> 06:42.320\n really probably, you know, I see those guys as kind of two ends of the spectrum in just the\n\n06:42.320 --> 06:47.440\n way that they kind of come across in general, where like David's like really at your kind of\n\n06:47.440 --> 06:52.320\n high energy and Sam's kind of this calming, soft presence and he's just going to slowly,\n\n06:52.320 --> 06:57.760\n methodically lay it all out there. And I think there's value on in both of those. I think\n\n06:57.760 --> 07:03.120\n most people are probably going to get a benefit from pulling some from each. I mean, there's\n\n07:03.120 --> 07:08.000\n times where, where I need a kick in the ass and then it's like, have the strong Zach, tell the\n\n07:08.000 --> 07:13.120\n weak Zach to get moving. But there's also times where, you know, it's just like, you know, a\n\n07:13.120 --> 07:17.680\n subtle voice entering my head about, you know, I don't know if I feel quite right now. Should I\n\n07:18.400 --> 07:24.320\n maybe pull back on the pace? And I think that little subtle voice is best approached with a\n\n07:24.320 --> 07:29.040\n subtle positive voice where it's more like, okay, well let's think this through here for a second.\n\n07:29.040 --> 07:33.360\n You're 40 miles into a hundred mile race. You spent four months preparing for it.\n\n07:33.360 --> 07:37.440\n Uh, you know, from the workouts you did that you're ready for this, there really isn't any\n\n07:38.160 --> 07:44.080\n real reason for you to slow down or to fall off your goal or your pace or, you know, reassess\n\n07:44.080 --> 07:50.240\n what you're doing. Let's just give this another mile or two. And then we can reassess if we need\n\n07:50.240 --> 07:54.960\n to, and in order to kind of figure out if I'm doing the right things or not. And I think like\n\n07:54.960 --> 08:00.000\n in that situation, um, you definitely probably want to lean more towards the Sam Harris approach\n\n08:00.000 --> 08:03.920\n with that because there's really no reason to, it's almost like the same thing you see with like\n\n08:04.640 --> 08:10.080\n just training and even nutrition to a degree where like some folks, they just want to be like,\n\n08:10.080 --> 08:15.360\n kind of like drilled. They want to be like yelled at and said, like, get going, get doing this. And\n\n08:15.360 --> 08:19.760\n that helps and that motivates them. That helps them stay accountable. Other people need some\n\n08:19.760 --> 08:24.160\n softer love with it where it's like, you know, this isn't necessarily your thought, your, your\n\n08:24.160 --> 08:29.440\n fault. You were put in this environment that kind of created an atmosphere of lethargy and\n\n08:29.440 --> 08:35.280\n lethargy and maybe poor nutritional choices and things like that. And, and like, so, but it's,\n\n08:35.280 --> 08:39.360\n it's correctable. So we need to, we need to step away from that and we need to kind of start\n\n08:39.360 --> 08:43.360\n heading in the direction that we know is going to bear fruit down the road. And that person may\n\n08:43.360 --> 08:48.480\n respond better to that. So I think both those guys have great value with their approaches.\n\n08:48.480 --> 08:52.800\n They're just probably polar ends of that, of the spectrum. And I think most people are probably\n\n08:52.800 --> 08:56.400\n going to benefit like anything, right? You get the polarizing ones and those are going to work\n\n08:56.400 --> 08:59.600\n right for the polarizing people. But then most people are going to fit somewhere in the middle.\n\n08:59.600 --> 09:03.920\n So they're probably going to be able to kind of pull from both of those if they're able to sit\n\n09:03.920 --> 09:08.320\n down and kind of like assess which one's going to work better in which situation. So the quitting\n\n09:08.320 --> 09:13.360\n thing that you mentioned, the, like the final stage, which actually I get to much quicker\n\n09:13.360 --> 09:19.120\n than you seem to, which is like, why am I doing this? I get there with basically anything I do.\n\n09:19.920 --> 09:26.000\n It's like, this is, this is probably the stupidest thing I've ever done is the feeling I get often.\n\n09:26.000 --> 09:30.880\n And then immediately you have these excuses that are like, there's all these other better things\n\n09:30.880 --> 09:37.440\n you should be doing. Or, or the other alternative of that, like you said, I'm not prepared enough\n\n09:37.440 --> 09:42.560\n for this moment. I'll be much more prepared in two weeks for the next event. So like,\n\n09:42.560 --> 09:46.720\n why let's try this again. Let's start over. Let's start over in two weeks.\n\n09:47.600 --> 09:54.800\n How do you deal with that quit? Like, so maybe do you still go through that process and\n\n09:54.800 --> 10:01.360\n and by way of advice for people that are more sort of amateurish like me, how to deal with\n\n10:01.360 --> 10:06.160\n that quitting voice? I think a lot of times when the quitting voice kind of comes in,\n\n10:06.960 --> 10:13.680\n it, what it does is it kind of just, it comes in with the added disadvantage, I guess,\n\n10:13.680 --> 10:17.520\n in this situation of being kind of a narrow scoped view where you're looking at like,\n\n10:19.680 --> 10:23.840\n what it's doing to you in the moment or how you're feeling in the moment versus how\n\n10:23.840 --> 10:30.720\n are you feeling about the whole process? So one thing that I started doing in 2019, and I think,\n\n10:30.720 --> 10:37.600\n I don't think it's necessarily, I think, I think, I think this was a big reason why I had one of\n\n10:37.600 --> 10:43.680\n my best racing seasons in 2019 that I'd had to that date. It was part of it was I started, I\n\n10:43.680 --> 10:49.040\n think, putting a little more emphasis on the big picture versus putting emphasis on like,\n\n10:49.040 --> 10:56.320\n this is one opportunity or one day of work. And this is one, one emotional kind of flare up.\n\n10:57.040 --> 11:03.120\n But how does that actually relate to my general broader picture? So when I decide to do a race\n\n11:03.120 --> 11:08.000\n or an event or something like that, it's often four, six months out ahead of time,\n\n11:08.000 --> 11:12.640\n you're planning to like kind of do a series of workouts and a flow of things where you're going\n\n11:12.640 --> 11:16.000\n through the process of getting fit, getting ready, preparing for the specifics of the day\n\n11:16.000 --> 11:19.840\n and all that stuff. And then you get to the race itself or the event itself. And\n\n11:20.480 --> 11:26.960\n it's very easy to look at that and think that's an isolation. Like I'm going to run 12 hours today,\n\n11:26.960 --> 11:31.360\n or I'm going to run a hundred miles today or whatever it ends up being. And it's a lot easier\n\n11:31.360 --> 11:38.160\n to quit when you think to yourself, I'm 40 miles into a hundred mile race. You know, that's just a\n\n11:38.160 --> 11:43.440\n 40 mile run, which sounds kind of silly to most people, but in perspective, then we're talking\n\n11:43.440 --> 11:47.200\n about the ultra marathon running community. You know, it's a lot easier just to say like, well,\n\n11:47.200 --> 11:52.720\n you know, I'll scrap this 40 miles and try again. It's a lot harder to say I'm going to scrap the\n\n11:52.720 --> 11:58.320\n entire last four months, the entire reason why I was doing it, the countless hours I spent in there.\n\n11:58.320 --> 12:02.240\n So I think I just try to reposition it of like, I'm in a bad place right now,\n\n12:02.240 --> 12:08.560\n maybe in my head or I'm not, I'm hitting a low point here, but I'm 99% of the way towards the\n\n12:08.560 --> 12:12.080\n goal I set out four months ago when I add in all the work I did leading up to that.\n\n12:12.080 --> 12:18.720\n So I think it's important to ask yourself why, because, I mean, there are times when you're\n\n12:18.720 --> 12:23.120\n doing something and you ask yourself why, and you don't have a good reason. And then maybe it is\n\n12:23.120 --> 12:27.760\n advantageous to step back and really reflect on that and decide, is this something I actually want\n\n12:27.760 --> 12:34.000\n to invest time and energy into? Because, you know, someone like yourself who is very much\n\n12:34.000 --> 12:40.320\n into a variety of different things, it can be easy probably to overextend and get, I mean,\n\n12:40.320 --> 12:44.160\n I'm a very curious person. So there's like a hundred things I would love to do if I wasn't\n\n12:44.160 --> 12:49.280\n doing what I'm doing. And I know how to enjoy all of them. So at a certain point though,\n\n12:49.280 --> 12:53.360\n you have to say, okay, which one is going to be the most meaningful for me? And if the answer\n\n12:53.360 --> 12:56.960\n keeps coming back to saying, I guess this is still the most meaningful to me out of that\n\n12:56.960 --> 13:02.240\n a hundred things that I could otherwise be doing, then I know that I'm in it for the right reason.\n\n13:02.240 --> 13:07.040\n Then I just need to identify some of those things like, well, why did this one take the top spot out\n\n13:07.040 --> 13:11.840\n of the hundred things that I could have picked from? And keeping like a list of those in your\n\n13:11.840 --> 13:16.640\n head so that when you get to that point where you start saying, why am I doing this? Why am I here?\n\n13:16.640 --> 13:20.640\n You just have those kind of ready loaded in your head to say, well, I already took inventory on\n\n13:20.640 --> 13:23.840\n that before I started this. And I knew this voice was going to come at some point, whether it's\n\n13:23.840 --> 13:28.800\n early, middle or late. And then you just remind yourself kind of what you were thinking when you\n\n13:28.800 --> 13:32.160\n had a little more of a level head. Well, there's something about the thing you mentioned when you\n\n13:32.160 --> 13:39.600\n mentioned the death march. It seems extremely valuable to just never quitting. Like in the\n\n13:39.600 --> 13:47.280\n moment, if you decide to do something, like never quitting, even if you do go through the process\n\n13:47.280 --> 13:53.120\n and realize that it's not the wisest thing to be doing within the full context of your life.\n\n13:53.120 --> 14:00.080\n Like once you decide to do it, it seems like never quitting prevents you from sort of having that\n\n14:00.080 --> 14:06.400\n escape clause from other things in your life. So I've quit on a few things in my life. And\n\n14:06.400 --> 14:14.080\n I think I still, I deeply regret that because it opened that door. It's almost like a muscle.\n\n14:14.080 --> 14:20.800\n I don't know. So I think I'm, I don't know, maybe everyone is, but I think I'm kind of a quitter.\n\n14:21.600 --> 14:27.440\n You know what I mean? Like I'm really good at coming up with reasons to quit.\n\n14:27.440 --> 14:33.840\n My mind is really good at that. And I, it feels like I have to come up with, like really work\n\n14:33.840 --> 14:39.840\n hard to make sure that there's no quit. That I never allow myself to quit no matter how stupid\n\n14:39.840 --> 14:45.120\n the thing I'm doing is. I don't know if that any of that makes sense, but it just, maybe to\n\n14:45.120 --> 14:52.960\n rephrase this whole thing. Do you think it's good to live life by the ethos of never quit?\n\n14:52.960 --> 14:57.760\n Yeah, that's a really interesting thing. And I think it actually resonates with a lot of\n\n14:57.760 --> 15:03.680\n ultra marathon runners because there seems to be a trend when you have someone who's been in the\n\n15:03.680 --> 15:08.160\n sport for a long time where there's a point where they start the sport, right? And they're like,\n\n15:08.720 --> 15:13.680\n super excited about everything. Everything's new. It's very easy not to quit because you're like,\n\n15:13.680 --> 15:16.960\n Oh, this is the first time I've ever run a 50 case. The first time I ever run a 50 miles,\n\n15:16.960 --> 15:20.720\n the first time I ever in a hundred case, first time I ever in a hundred miles and so on and so forth.\n\n15:20.720 --> 15:27.360\n And when you're doing that for the first time, I think there's a heightened motivation to not quit\n\n15:27.360 --> 15:33.440\n because you don't want your first attempt to be a failure. And then you get a little further along\n\n15:34.000 --> 15:38.480\n and you start reflecting on the landscape and all the opportunities that are out there and you find\n\n15:38.480 --> 15:44.720\n yourself quitting on an event. And there does seem to be a trend where once you do that once,\n\n15:44.720 --> 15:50.800\n now all of a sudden, like you, like you described perfectly that quit pops up in your head maybe a\n\n15:50.800 --> 15:54.960\n little sooner than next time or maybe a little bit before. And I've certainly had these experiences\n\n15:54.960 --> 16:01.440\n in my career as well. And what happens, I think if you stick with it, again, I think it is important\n\n16:01.440 --> 16:06.720\n to assess whether you really want to be doing what you're doing. But if you start recognizing that\n\n16:06.720 --> 16:10.240\n about yourself in a certain activity where it's like, I think I might be pulling the plug early on\n\n16:10.240 --> 16:16.560\n some of this stuff. I think you just need to kind of get into a position where you just at that point,\n\n16:16.560 --> 16:20.640\n you need to make a decision. Do I want to keep doing this? If the answer is yes, you hold yourself\n\n16:20.640 --> 16:25.280\n accountable to not quitting. And eventually what will happen is you'll find yourself in a position\n\n16:25.280 --> 16:29.440\n where I'll use ultra marathons, for example, where you're just clicking on all cylinders for that day.\n\n16:30.000 --> 16:35.120\n And you still get those scenarios where doubt creeps in your mind. You have these low points,\n\n16:35.120 --> 16:39.440\n but for whatever reason, when those low points are high, you're going to find yourself in a\n\n16:39.440 --> 16:43.200\n reason when those low points come, you're able to push through them better than you would have in\n\n16:43.200 --> 16:48.400\n the past. And then you push through maybe two or three more than you did after you had quit the\n\n16:48.400 --> 16:53.920\n time before. Then it's accountability time, right? Because then you have to look back at that and say,\n\n16:54.560 --> 17:02.480\n well, why did this time, was I able to be mentally more strong and kind of push through those extra\n\n17:02.480 --> 17:07.280\n opportunities to quit when I wasn't before? And it can be easy to look back and say,\n\n17:07.280 --> 17:12.640\n and live kind of retroactively in the sense where you're regretting, well, why did I drop out of\n\n17:12.640 --> 17:16.640\n those races? Why did I do this wrong there? And I just think that's where you have to kind of\n\n17:16.640 --> 17:21.680\n catch yourself and say, no, those things happened to me in order to put me in a position where I\n\n17:21.680 --> 17:27.360\n decided, well, this time I'm not going to quit no matter what, minus my leg falling off. I'm not\n\n17:27.360 --> 17:31.840\n going to quit. And then you put yourself in a position to have that day where you push through\n\n17:31.840 --> 17:35.840\n more times than you ever have before. And you just redefine what you're capable of. And then once I\n\n17:35.840 --> 17:41.680\n think you do that, you start looking at those earlier lessons as, as lessons, you know, were\n\n17:41.680 --> 17:47.520\n they failures on paper at the time? Probably. But can you pull things from them to learn as to like,\n\n17:47.520 --> 17:52.000\n well, where is your actual threshold? Where is the limit actually for you? And then kind of start\n\n17:52.000 --> 17:59.840\n redefining that stuff. Um, so I think like the never quit mentality can be good in certain\n\n17:59.840 --> 18:05.920\n situations, but I don't think it's necessarily like a, like a holistic thing where you need to be in\n\n18:05.920 --> 18:09.840\n something where it's never quit, always do more. Cause then you end up in a situation where you\n\n18:09.840 --> 18:13.440\n find this like margin of diminishing returns, especially when it comes to training and workouts\n\n18:13.440 --> 18:18.720\n and things like that, where there are times where often there are times where you want to actually\n\n18:18.720 --> 18:23.760\n quit a little bit before you would have to, because the stress that was required to elicit a, a growth\n\n18:23.760 --> 18:27.680\n response has already occurred. And then just to do more is just going to require more recovery time\n\n18:27.680 --> 18:33.760\n to get back and do it again. Yeah. This is the tricky trade off living by the never quit mentality.\n\n18:33.760 --> 18:36.720\n You're not going to achieve optimal performance in your head. You might.\n\n18:39.600 --> 18:44.000\n It seems like when you look at the full arc of human history,\n\n18:45.440 --> 18:53.440\n the people who do great things are more leaning towards the never quit. Like, uh, I feel like at\n\n18:53.440 --> 19:00.720\n any one moment you're more in danger of quitting than you are being suboptimal. So like, um, in\n\n19:00.720 --> 19:09.040\n terms of advice, it just feels like never quitting is always the right advice. Unless you deeply know\n\n19:09.040 --> 19:15.040\n the person, maybe this is like wrestling mentality. I've seen too many, and because I'm annoyed with\n\n19:15.040 --> 19:19.680\n the current culture telling me to relax and, and, uh, have a work life balance and all those kinds\n\n19:19.680 --> 19:27.680\n of things, uh, which all have a deep, deep truth to them. But the reality is like, there's not enough\n\n19:27.680 --> 19:35.440\n people that walk up to me and like slap me and say, get your shit together. Like don't quit,\n\n19:35.440 --> 19:42.480\n work harder. I think we need to hear that more. I, and like, I remember that, um, from the wrestling\n\n19:42.480 --> 19:48.960\n rooms, like that when you're pushed that way, when you're forced to the very limit and you don't quit,\n\n19:48.960 --> 19:55.200\n that makes better humans. I think people need to get that in their life. I think they need to have\n\n19:55.200 --> 20:01.360\n situations where that becomes kind of the reality for them so they can see that avenue, experience\n\n20:01.360 --> 20:08.480\n that avenue, um, where I think it's maybe to the extreme as if it becomes like your entire life\n\n20:08.480 --> 20:15.520\n philosophy where like every little thing you do is never quit. But life is short, Zach. Like why? I\n\n20:15.520 --> 20:21.520\n mean, this is the problem I have. This is probably the programming thing too is over optimization\n\n20:21.520 --> 20:28.560\n is dangerous. Uh, it's like every once in a while, I mean, you're, you do this kind of stuff.\n\n20:28.560 --> 20:32.560\n You're not, for example, with a hundred mile run, you're, I mean, you could just be doing that for\n\n20:32.560 --> 20:38.000\n the rest of your life and do like the most optimal hundred mile run ever, but you keep taking on like\n\n20:38.000 --> 20:44.240\n new challenges and there's a lot more chaos in that. And there it feels like the muscle of never\n\n20:44.240 --> 20:48.560\n quit will be much more important than the optimality of your training. Yeah. So there's\n\n20:48.560 --> 20:54.480\n probably a couple sides to me with that kind of a thing where for one, I think when we talked about\n\n20:54.480 --> 21:01.280\n the why, so like, I think the why can kind of shift a bit and it probably will if you do something\n\n21:01.280 --> 21:07.840\n long enough or evolve maybe is a better way to call it, to put it. And for me, like one of my\n\n21:07.840 --> 21:15.120\n my big drives and one of my big passions within ultra running is to first of all, find an event\n\n21:15.120 --> 21:18.960\n that I really, really love to train for and participate in. So for me, I feel like I've\n\n21:18.960 --> 21:24.720\n kind of identified that to a degree and that's kind of runnable hundred milers. So once I found\n\n21:24.720 --> 21:31.280\n that it became more of a driver for me to see like, well, how fast can I run a hundred miles in\n\n21:31.280 --> 21:36.640\n a very controlled environment? So let's eliminate weather, let's eliminate, you know, elevation,\n\n21:36.640 --> 21:41.760\n let's eliminate like having to wait extra long to get crew or support and that sort of thing.\n\n21:41.760 --> 21:46.720\n And that's how you find yourself on a 400 meter track running a hundred miles. But for me, like\n\n21:46.720 --> 21:51.760\n the important part of that is that I can control the environment enough where if I come back year\n\n21:51.760 --> 21:58.560\n after year, I can retest myself and have a decent ability to kind of say I improved or I regressed\n\n21:58.560 --> 22:03.600\n or I stayed stagnant. And I think that's a big driver for me. But one thing I've recognized\n\n22:03.600 --> 22:10.880\n within that is if you just keep doing that, like if I could probably pick three flat runnable hundred\n\n22:10.880 --> 22:17.440\n milers a year and optimally prepare, race, recover and repeat without like burning myself out.\n\n22:18.160 --> 22:26.480\n But one thing I think I learned also in 2019 was that sometimes you kind of need to step away from\n\n22:26.480 --> 22:32.720\n some of these really, really kind of important markers in your like your performance or in\n\n22:32.720 --> 22:35.920\n whatever you're trying to do and take a step away from it and try to do something a little different\n\n22:37.360 --> 22:42.400\n in order to kind of hit the reset button on just like what I would call just like your mental\n\n22:42.400 --> 22:48.400\n energy to be able to continue to do it at a high level. So almost like happiness. Exactly. Well,\n\n22:48.400 --> 22:52.720\n here's the example. Like, I mean, I love running in trails to most people would consider me a flat\n\n22:52.720 --> 22:58.400\n road track runner, runnable ultra runner. But I like to do trail runs too. So and at the end of\n\n22:58.400 --> 23:06.240\n two thousand and eighteen, I recognized that I had been kind of pushing the gas pedal on trying to\n\n23:06.240 --> 23:10.720\n run fast hundred milers for quite a while without really a break in that where it was like, OK,\n\n23:10.720 --> 23:15.200\n I did one. Now I'm going to take a brief off season, but then I'm going to ultimately build\n\n23:15.200 --> 23:19.280\n up and peak for another one. I might introduce some fun trail races in the context, but they're\n\n23:19.280 --> 23:23.040\n going to be races are going to be training races, time on feet type of stuff that are going to kind\n\n23:23.040 --> 23:28.560\n of mimic like a long run, essentially. And but the main focus always in the back of my mind was\n\n23:28.560 --> 23:32.640\n like getting on the track and seeing how much faster I can run a hundred miles. And that just\n\n23:32.640 --> 23:38.160\n kind of that energy that it takes to continually think by that, that I think the motivation to\n\n23:38.160 --> 23:43.920\n keep that stoke high enough to really meet your full potential fades if you don't step away from\n\n23:43.920 --> 23:49.680\n it for a little bit. So I took essentially half a year away from runnable stuff and just decided\n\n23:49.680 --> 23:54.800\n I'm going to prepare for the San Diego hundred mile, which is like a much more elevation,\n\n23:55.840 --> 24:01.760\n technical trail type of an event. Is that a trail run or no? Yeah. It's a trail hundred miler\n\n24:02.320 --> 24:08.480\n actually just kind of just outside of San Diego. And yeah, it goes through it goes over part of\n\n24:08.480 --> 24:13.200\n the Pacific Crest Trail and stuff. So it's very different than running on a runnable surface. So\n\n24:13.200 --> 24:18.000\n to give you some context, like I ran was I think just under 17 hours for that race,\n\n24:18.000 --> 24:24.160\n whereas on a flat surface I can run 11 hours and 19 minutes. So just the environment alone added\n\n24:24.160 --> 24:30.240\n an extra, you know, five plus hours to the day. So it's just a different experience, different\n\n24:30.240 --> 24:36.640\n skill set. And what it did is it allowed me to kind of step away from kind of focusing on like\n\n24:36.640 --> 24:42.400\n splits on a track, running flat stuff, like preparing for things specifically for a flat\n\n24:42.400 --> 24:46.720\n environment and start training for something that's more climbing and descending, more technical\n\n24:46.720 --> 24:52.560\n running skill sets and things like that. And the cool part about it was, first of all, you know,\n\n24:52.560 --> 24:55.840\n when you step away from something and after something a lot different, I mean, it's still\n\n24:55.840 --> 25:00.160\n running. There's still a huge advantage I had from the running I'd done in the past that was\n\n25:00.160 --> 25:06.800\n going to put me in a good position to be successful. But there was a much higher or a much bigger range\n\n25:06.800 --> 25:12.560\n of potential improvement for me. So through the like four plus months I spent preparing for that\n\n25:12.560 --> 25:17.280\n race, you know, I noticed, oh wow, I'm getting faster on this climb or I'm getting better at\n\n25:17.280 --> 25:21.200\n descending this technical trail. It was one of the most fun races I've run actually. So it was kind\n\n25:21.200 --> 25:27.040\n of a cool experience. I ended up taking the lead at like 93 miles. So you were racing, racing,\n\n25:27.040 --> 25:31.920\n like you were trying to get first. So it's still a race. Yeah. So what was the enjoyable aspect of\n\n25:31.920 --> 25:36.800\n it? I don't think I've recognized it so much while I was doing it actually. It surfaced afterwards. I\n\n25:36.800 --> 25:39.920\n mean, the enjoyment of the race itself is like when you find yourself in a position where you're\n\n25:39.920 --> 25:44.400\n sitting in basically second place all day long and then you take the lead at 90, I think it was like\n\n25:44.400 --> 25:52.000\n 91 or 92 miles. It's like, yeah, that's kind of a cool way to race. But afterwards I recognized a\n\n25:52.000 --> 25:57.840\n few things just about kind of pacing and you know, how to maybe pace the first half of a hundred\n\n25:57.840 --> 26:04.400\n miler versus a second half. I also recognized shortly thereafter once I finished or covered\n\n26:04.400 --> 26:10.480\n and decided my next event was going to be a flat runnable race that, wow, I really was way more\n\n26:10.480 --> 26:15.280\n excited to do the workouts that I needed to do to get ready to run a fast, flat hundred miler.\n\n26:15.280 --> 26:19.120\n And I don't think that would have been the case had I just tried to do another flat, fast hundred\n\n26:19.120 --> 26:26.080\n miler earlier or during that year and end up in a situation where like I maybe had like normalized\n\n26:26.080 --> 26:32.000\n a suboptimal like outlook on like something that I had just done so many times already.\n\n26:32.000 --> 26:36.640\n Yeah. And I recognize that it was just every workout I did. I was like, I did this workout\n\n26:36.640 --> 26:41.600\n a year ago and it was not nearly this much fun. And our, you know, the interesting thing about\n\n26:41.600 --> 26:45.600\n these track hundreds too, is like you find yourself doing like your peaking phase where\n\n26:45.600 --> 26:49.760\n you're running your long runs, which for me are usually like, you know, around 30 miles or so,\n\n26:49.760 --> 26:54.160\n and I'll do them on back to back days. And you know, I try to replicate the environment I'm\n\n26:54.160 --> 26:59.120\n going to race on. So I'm finding myself on a 400 meter track. And it's like when I started doing\n\n26:59.120 --> 27:02.480\n that again, I just felt like I was super motivated to go out there Saturday and Sunday and do those\n\n27:02.480 --> 27:06.800\n back to back long runs and see the progress and then head out again the next week and do it again.\n\n27:06.800 --> 27:10.880\n So I had some of my more enjoyable long runs, which are going to be the most specific to the\n\n27:10.880 --> 27:15.680\n race day environment that I had in quite some time. And I think that was really beneficial\n\n27:15.680 --> 27:19.200\n and kind of putting me in the right spot to be able to push through barriers on race day\n\n27:19.200 --> 27:23.680\n and put me in a position where quitting was going to be much less of a likelihood,\n\n27:23.680 --> 27:26.640\n given the enjoyment I had in the months leading into the race itself.\n\n27:26.640 --> 27:30.800\n Yeah, even the thought of quitting. Yeah. Yeah. So you mentioned the track,\n\n27:31.360 --> 27:38.000\n you've also ran 100 miles on the treadmill, and the trail 100 mile. Broadly, if we zoom out,\n\n27:38.000 --> 27:45.760\n what does it take to run 100 miles? For most of the world, that seems like a crazy distance to run.\n\n27:46.560 --> 27:50.640\n So maybe it's interesting to ask, not only is just setting the world record, but\n\n27:50.640 --> 27:56.240\n purely running, what does it take to run that far? Yeah, I mean, I think people probably\n\n27:56.240 --> 28:02.160\n overestimate what it takes in terms of just getting it done. I think this is consistent in\n\n28:02.720 --> 28:06.720\n just running in general. I think the marathon was always a big one with that where people thought\n\n28:06.720 --> 28:12.000\n like, well, you have to do this training, or you just literally won't physically be able to complete\n\n28:12.000 --> 28:17.200\n a marathon. And then we got into an era of kind of like, running as more of an enjoyment thing\n\n28:17.200 --> 28:21.120\n versus a performance thing. And then you'd have people running, granted much slower. I think if\n\n28:21.120 --> 28:25.680\n you look at the Boston Marathon average finishing times, it goes from like, or maybe it wasn't the\n\n28:25.680 --> 28:29.520\n Boston Marathon, it might have been marathons in general, went from like three hours to five hours\n\n28:29.520 --> 28:35.440\n or something like that. So it's like, people, I think got past the fact that you can only do it\n\n28:35.440 --> 28:39.600\n if you're optimally prepared to, well, I can do it and maybe not meet my full potential if I'm\n\n28:39.600 --> 28:45.360\n going to like, not do much training, which I wouldn't necessarily advise. But I mean, I've\n\n28:45.360 --> 28:50.240\n I've talked to people who basically run 100 miles, sometimes almost off the couch. And it's like,\n\n28:50.240 --> 28:54.640\n it's, to me, what that says is just the human body is incredible, and what it can tolerate\n\n28:54.640 --> 28:58.400\n above and beyond what it's been exposed to, if it has to, or if it feels like it has to.\n\n28:58.400 --> 29:04.400\n So that's the basic sort of getting from point A, from the start to the finish. It's the human body\n\n29:04.400 --> 29:09.920\n and the human mind is capable of doing it without much preparation. But then you start to increase\n\n29:09.920 --> 29:16.480\n the goal of performance, and you try to get actually a good, like, the most out of your body\n\n29:16.480 --> 29:22.480\n that you can. How does that start to change then? Yeah, going from fun to performance? Yeah, I think\n\n29:23.200 --> 29:27.440\n once you start putting marks or goals on outside of just finishing, that's where it starts getting\n\n29:27.440 --> 29:31.680\n interesting. Because now you could maybe go on with multiple goals where like, if one falls off\n\n29:31.680 --> 29:35.600\n due to something that you didn't expect, then you have another one to target. But you can always\n\n29:35.600 --> 29:39.440\n build those up and try to think like, well, I want to run faster than last time, or I want to, you\n\n29:39.440 --> 29:46.000\n know, break a course record or an age group record or something like that. And that that I think is\n\n29:46.000 --> 29:50.240\n just going to be a little bit of a different mindset. Because now you're looking at every\n\n29:50.240 --> 29:55.200\n little thing from what do I need to do to prepare as well as what I need to do to be efficient on\n\n29:55.200 --> 30:01.600\n the day itself. So like transitioning aid stations and things like that, or do I want a pacer or not?\n\n30:01.600 --> 30:07.120\n Or does this race allow someone to like hand me a bottle at a certain spot? Or do I have to be in\n\n30:07.120 --> 30:12.640\n specific areas to get that type of stuff? And it what ends up doing is it ends up bringing a lot\n\n30:12.640 --> 30:17.440\n more variables to the table. And I think it's interesting, because there's always going to be\n\n30:17.440 --> 30:24.560\n more variables on the day than you are able to account for. So at a certain degree, you have to\n\n30:24.560 --> 30:28.400\n kind of find yourself in a position where I'm going to make sure I take care of the big ones,\n\n30:28.400 --> 30:33.200\n or the ones that are like, obviously, I need to be ready for like, my fueling strategy, my hydration\n\n30:33.200 --> 30:38.560\n strategy, my pacing strategy, what workouts are going to put me in a position to physiologically\n\n30:38.560 --> 30:43.840\n have this process go as well as possible? How am I going to like, you know, hold myself accountable\n\n30:43.840 --> 30:49.840\n in aid station transition, so I'm not like having a ton of non moving time versus moving time and\n\n30:49.840 --> 30:54.240\n things like that. So there's these like, big variables that you're aware of, and you're trying\n\n30:54.240 --> 30:58.960\n to optimize over the space of variables. Yep. So you get to start to play with that. When you're\n\n30:58.960 --> 31:03.520\n looking for performance, it's almost like moving from checkers to chess, right? You have like, or\n\n31:03.520 --> 31:08.720\n maybe even like connect for something like that, where it goes from just kind of like, well, one\n\n31:08.720 --> 31:12.000\n foot in front of the other, and when I get to the next station, I'll just eat whatever looks good,\n\n31:12.000 --> 31:16.560\n drink whatever, you know, quenches my thirst, and then move on to the next one to like, well,\n\n31:16.560 --> 31:19.760\n which one of these food products is actually going to make me move a little faster to the next\n\n31:19.760 --> 31:24.320\n aid station? Or, you know, which one of these pacing strategies is going to get me to the\n\n31:24.320 --> 31:30.800\n finish line faster than the other one and that sort of stuff. So it gets more complicated,\n\n31:30.800 --> 31:35.680\n more interesting, and in my opinion, anyway, also, there's I mean, but there's a breaking point with\n\n31:35.680 --> 31:40.880\n that too, because, like I said, there's an endless number of variables you could account for. And\n\n31:40.880 --> 31:45.600\n there's a distance gets longer, that list gets longer too. So you find yourself in this position\n\n31:45.600 --> 31:50.080\n where, where you have to at some point say, okay, I've accounted for everything I can reasonably\n\n31:50.080 --> 31:54.720\n account for. Now I need to be in a mental space where when something happens that I wasn't able\n\n31:54.720 --> 32:00.240\n to account for, I'm able to respond to it with the right decision and keep going and not dwell on it.\n\n32:00.240 --> 32:03.120\n Because that's another thing. I mean, you're running slow enough when you're doing 100 miles,\n\n32:03.120 --> 32:08.560\n where if you make a mistake, you can sit there and just fixate on that mistake and say, why did I do\n\n32:08.560 --> 32:12.320\n that? That cost me 10 minutes, blah, blah, blah, blah. When in reality, what you need to do is that\n\n32:12.320 --> 32:16.160\n happened. Everyone else out here is gonna have a situation like that at some point. Mine happened\n\n32:16.160 --> 32:22.640\n now. I need to figure out how I can move forward at the fastest sustainable pace and not think about\n\n32:22.640 --> 32:28.320\n what happened back there. And that's where I think it gets really interesting. What would you say it\n\n32:28.320 --> 32:34.720\n takes to set a world record in the 100 miler? First of all, I think you probably have to focus on that\n\n32:34.720 --> 32:40.480\n specific event. I mean, there's the interesting thing about ultra running where it maybe deviates\n\n32:40.480 --> 32:45.280\n a bit from just other endurance sports is there's such a wide range. I mean, we talked about a little\n\n32:45.280 --> 32:50.240\n bit when I talked about the San Diego 100 versus kind of flat runnable stuff. So can you maybe\n\n32:50.240 --> 32:54.720\n paint a picture of what are there's a huge range of different kinds of ultra marathon events?\n\n32:55.280 --> 33:00.960\n What are like, the big ones in your mind? So marathon, we know the distance for a marathon.\n\n33:01.520 --> 33:07.360\n There's 50k, what are different kinds of there's 100 mile that in your mind, like kind of these\n\n33:07.360 --> 33:13.840\n islands where, where people gather off? Yep. Yeah. So there's a few that really stand out. I would\n\n33:13.840 --> 33:18.240\n say the three biggest ultra marathons right now, even from a historic, maybe not necessarily a\n\n33:18.240 --> 33:23.440\n historical standpoint, but in modern day ultra running is going to be the Western States 100.\n\n33:24.160 --> 33:29.120\n That's the biggest, most competitive 100 miler. It's on the trail side of things in the United\n\n33:29.120 --> 33:33.680\n States. Then there's ultra trail Mount Blanc, which is probably the most competitive 100 miler on the\n\n33:33.680 --> 33:37.920\n planet right now. In previous years, it's been debatable as whether Western States or ultra trail\n\n33:37.920 --> 33:41.600\n Mount Blanc is more competitive. I think in the most recent few years, you're just seeing a lot\n\n33:41.600 --> 33:47.440\n more like of the bulk of international talent on the trail side of the sport heading over that way.\n\n33:47.440 --> 33:52.080\n And then you have the road running side of things where the comrades marathon,\n\n33:52.080 --> 33:55.440\n which is technically 56 miles, but they call it the comrades marathon,\n\n33:56.720 --> 34:01.840\n is going to generally be the most competitive ultra marathon. The weird thing is the distance\n\n34:01.840 --> 34:04.400\n thing, right? Cause most people in the think of endurance sports, they're thinking about\n\n34:04.400 --> 34:08.400\n precise distances, like five kilometers, 10 kilometers and all that stuff. And then,\n\n34:08.400 --> 34:12.000\n then you get into the ultra running world and it's like, sometimes it's the event. So like\n\n34:12.000 --> 34:15.680\n the Western course itself is much more important than the distance, right? Yeah. So the Western\n\n34:15.680 --> 34:20.480\n States 100 is actually 100.2 miles, which isn't that big of a deviation when you think about it,\n\n34:20.480 --> 34:24.000\n especially when you figure like tangents are going to probably account for more than 0.2 miles on a\n\n34:24.000 --> 34:29.120\n hundred mile race. But the ultra trail Mount Blanc, you know, that's listed as a hundred\n\n34:29.120 --> 34:34.400\n mile, but it's actually, I think like 104, 105 miles. So, you know, it's more, there's different\n\n34:34.400 --> 34:39.520\n cultures too. So the United States is definitely more motivated, I think, to try to get as close\n\n34:39.520 --> 34:42.400\n to the exact distance. You're going to hear maybe a little more grumbling. If someone says,\n\n34:42.400 --> 34:47.760\n I signed up for this hundred mile and it turned out to be 103 miles versus like over in Europe,\n\n34:47.760 --> 34:50.400\n they don't really care too much about the distance. They're more interested in like a\n\n34:50.400 --> 34:55.440\n specific route or a loop. Is consistency important in terms of the exact length of the,\n\n34:55.440 --> 34:58.800\n of the route? So like you can compare performances from previous years,\n\n34:58.800 --> 35:03.360\n or are they a little bit more flexible? Like they redefine the trail from year to year.\n\n35:03.360 --> 35:08.640\n Yeah. I mean, it's definitely hard to compare. I mean, there's events that take, for example,\n\n35:09.520 --> 35:15.360\n I would say the best ultra marathoner in the world today on the men's side is Jim Walmsley.\n\n35:16.080 --> 35:20.400\n The reason I think Jim Walmsley is the best is because he is the most versatile\n\n35:20.400 --> 35:25.520\n and not only the most versatile, but he's arguably the best at almost everything up to a hundred\n\n35:25.520 --> 35:31.920\n miles. So there's a race called the Angela's crest hundred miler. They, the trail has drastically\n\n35:31.920 --> 35:36.320\n changed from when they originally had that event and it's a different time of year. So it's much\n\n35:36.320 --> 35:42.720\n warmer on that course. And Jim's not the kind of guy who would sit back and say like, I can't\n\n35:42.720 --> 35:46.240\n chase that record. But I think Angela crest, when he looks at the segments and the pacing for that\n\n35:46.240 --> 35:51.120\n one, he's like, that one is maybe not even the same event anymore. So you have that, you have\n\n35:51.120 --> 35:55.360\n some that are a little more controlled and a little more kind of like preserved, I guess you\n\n35:55.360 --> 35:59.600\n would say, but I think it gets really rare on the trail side. I mean, comrades is going to be very\n\n35:59.600 --> 36:03.440\n comparable from one year to the next because that's a road race. And that's where you get,\n\n36:03.440 --> 36:07.600\n you maybe get like the split in the sport from people who really want that kind of like,\n\n36:07.600 --> 36:14.240\n I want to compare myself to someone who ran this course in 1970 versus like someone who just says,\n\n36:14.240 --> 36:19.920\n I want to be competitive today. And you know, maybe the weather is going to be 30 degrees\n\n36:19.920 --> 36:23.040\n different from one year to the next on this course. But if I beat everyone on this day,\n\n36:23.040 --> 36:26.640\n then I'm the champion of that big name race, like ultra trail Montblanc or Western States,\n\n36:26.640 --> 36:31.200\n 100. And my legacy will be cemented because I won that big race. And it doesn't matter when\n\n36:31.200 --> 36:35.280\n or how the course was or what the time even was to some degree. When you were optimizing\n\n36:35.280 --> 36:43.760\n for trying to set the world record in the hundred miler, were you doing like analysis of maybe like\n\n36:43.760 --> 36:49.600\n what were the variables you were looking at? Is it more in the realm of the actual race day,\n\n36:49.600 --> 36:56.000\n the track, what it looks like versus like the variables of the training leading up to the,\n\n36:56.480 --> 37:01.200\n to the race? I mean, it evolved a bit. Like, I think the, as I learned more about just like,\n\n37:01.200 --> 37:07.280\n what is required to kind of really do that stuff. So there's some variables you can control for,\n\n37:07.280 --> 37:11.360\n you know, I try to control for as many as I can. The big one that kind of stands out that you can't\n\n37:11.360 --> 37:15.920\n necessarily control for is it's pretty rare where you get an event where they're just doing a hundred\n\n37:15.920 --> 37:21.440\n miles on a track. It's usually like a, like an event of like a series of different events where\n\n37:21.440 --> 37:26.080\n they might be like some people out there doing 50 K, some people out there doing 24 or something\n\n37:26.080 --> 37:28.800\n like the event I did at, there was six day folks out there. They're trying to see how far they\n\n37:28.800 --> 37:34.320\n could get in six days. So you have like this much wider range of pacing just due to like the\n\n37:34.320 --> 37:41.760\n distance. So, you know, track protocol is always like you pass on the outside. So if you're running\n\n37:41.760 --> 37:47.520\n one of the faster paces of the day, which when you go on up to six days, you're going to, and you're\n\n37:47.520 --> 37:50.480\n doing a hundred miles, you're probably going to be running faster than most people out there.\n\n37:50.480 --> 37:54.480\n Then, you know, you just end up running more because you end up running in lane two around\n\n37:54.480 --> 37:57.840\n the turns and then sometimes lane three around the turns. So it's down to those little details\n\n37:57.840 --> 38:01.920\n that have a big impact. Yep. So I had to build that into my pacing strategy. I also have to build\n\n38:01.920 --> 38:08.320\n into the pacing strategy, like relative nonmoving time. You know, I did a race just recently,\n\n38:08.320 --> 38:13.120\n it was the US track and field hundred mile road championships. And I did not stop once other than\n\n38:13.120 --> 38:17.680\n like, I guess I technically stopped like in the aid station for like a few seconds to like grab\n\n38:17.680 --> 38:23.200\n bottles and get myself wet. Cause it was like 94 degrees that day, but I didn't like stop at all\n\n38:23.200 --> 38:28.640\n during that race from like what I would say is like a long period of time where we're getting\n\n38:28.640 --> 38:33.680\n up to like a minute, but that's pretty rare. Even on the track, like when I ran 11 hours and 19\n\n38:33.680 --> 38:38.880\n minutes, I think I stopped three times for maybe a total of like, I believe I have to look back for\n\n38:38.880 --> 38:41.600\n sure, but I think it was like three to four minutes or something like that. So you got to,\n\n38:41.600 --> 38:45.920\n you got to figure that into your pacing strategy, especially if you're chasing a specific time.\n\n38:46.480 --> 38:51.760\n Cause you know, if I'm pacing for, you know, at the time the world record was 1128. So if I'm\n\n38:51.760 --> 38:58.320\n pacing for say 1127, 30 or something like that, and I don't account for that three minutes of\n\n38:58.320 --> 39:02.320\n stoppage, then I might run the exact pace I had planned on, but then I'm a minute off of the world\n\n39:02.320 --> 39:07.840\n record. So 1128, we're talking about 11 hours, we're talking about a hundred miles. Can you\n\n39:07.840 --> 39:14.000\n mention what the world record was? What kind of world record you set? Can you tell your own story\n\n39:14.000 --> 39:18.800\n here of what you were able to accomplish that world record that I broke actually just recently\n\n39:18.800 --> 39:28.080\n got rebroke by a guy over in Lithuania, Alex Sorkin, phenomenal race. I mean, he's won the 24\n\n39:28.080 --> 39:32.480\n hour world championships. He's won the Spartathlon, which is another big historic ultra marathon\n\n39:32.480 --> 39:35.760\n rates, 153 miles. So it's getting a little more lengthy than some of the stuff that I've\n\n39:35.760 --> 39:44.080\n traditionally done. He ran 1114, I believe it was 56 or 57. So his pace was 645 per mile. Mine was\n\n39:44.080 --> 39:49.680\n 647 and a half in terms of just like the pacing strategy. I mean, it's, it's just really cool\n\n39:49.680 --> 39:58.320\n because for me, the motivation with chasing the world record was, it was multifaceted. I think\n\n39:58.320 --> 40:02.480\n there was, as I kind of moved through, cause I mean, it took me almost six years from the day\n\n40:02.480 --> 40:09.760\n I decided I wanted to chase that time to the day I actually did it. And through that five to six\n\n40:09.760 --> 40:16.080\n years, I think I merged from just like my number one goal was to try to break the world record to\n\n40:16.080 --> 40:22.160\n my number one goal is how fast can I run this thing? And then ultimately what needs to be done\n\n40:22.160 --> 40:25.760\n for a human to break 11 hours in a hundred miles. Cause I think that's going to be, I think that's\n\n40:25.760 --> 40:30.560\n going to happen soon. I think it's going to happen in the next few years. What pace would that be?\n\n40:31.360 --> 40:37.280\n Sub 11 would be, I think like, I think it's like 635 right about per mile. You're moving quick,\n\n40:37.280 --> 40:43.120\n but not so quick that like you're, you're, you know, void of being able to think about everything\n\n40:43.120 --> 40:50.320\n as it's happening. So what's the pace in terms of, if you look for each of the one mile segments for\n\n40:50.320 --> 40:57.040\n the hundred miles, is it pretty steady six, like in order to break 11 hours, would it be pretty\n\n40:57.040 --> 41:03.920\n steady 635? Does it go up and down? Do you speed up at the very end? Like what's, what's the pacing?\n\n41:03.920 --> 41:09.200\n If you were to maybe how much variability is there in the pacing for an optimal performance here?\n\n41:09.200 --> 41:12.240\n Yeah. So if you're talking about someone, let's say that there was someone, well,\n\n41:12.240 --> 41:16.720\n let's just take me for example, let's say that we could just like, we had this infinite knowledge\n\n41:16.720 --> 41:21.920\n and we knew for a fact, a perfect performance for me would produce a 10 59, but I'm not going\n\n41:21.920 --> 41:29.280\n a second faster and I need to do everything right in order to run a 10 59. Uh, I would definitely\n\n41:29.280 --> 41:36.400\n want to either have a slight negative or slight positive split. So when, um, and I think there's,\n\n41:36.400 --> 41:41.680\n I think there's a, there's a range in there where like being a little bit faster the first half\n\n41:41.680 --> 41:47.280\n and the second half isn't going to necessarily change your outcome or being a little bit slower\n\n41:47.280 --> 41:52.000\n the first half and a little bit faster. The second half isn't going to drastically change your outcome.\n\n41:52.560 --> 41:55.920\n So that's what you're referring to. The split is you're looking at the first 50 miles and\n\n41:55.920 --> 42:00.160\n the second 50 miles. And you can break it down as tiny as you want. Like I think, uh,\n\n42:00.160 --> 42:03.680\n when you take out the outlier laps where I stopped to use the bathroom, which would have been that\n\n42:03.680 --> 42:08.720\n like three to four minute nonmoving time that I talked about before, my splits were really tight.\n\n42:08.720 --> 42:13.840\n Um, I had a couple that were, um, it was weird cause that, that track that I did that on was\n\n42:13.840 --> 42:19.920\n actually like 400 and some weird number, like 400 and like 38 meters or something like that. So I\n\n42:19.920 --> 42:24.720\n actually like ran like my numbers based on that. So they're there normally I'm dealing with 400\n\n42:24.720 --> 42:29.120\n meters and then it's a little more like clean as to like what my lap splits are going to range from\n\n42:29.120 --> 42:32.880\n one event to the next. So we're talking about running a hundred miles on a track. Yeah.\n\n42:32.880 --> 42:40.160\n And so that you can be really scientific about getting the, the, this, the, um, the pacing,\n\n42:40.160 --> 42:45.280\n right. And, uh, you're, you're running on the inside lane or is there some kind of tricks to\n\n42:45.280 --> 42:51.920\n this? Like, are you alternating directions? Yeah. They'll switch directions at most events every\n\n42:51.920 --> 42:57.920\n four hours. So you'll do four hours one way and then they usually put a cone out. And once it hits\n\n42:57.920 --> 43:02.880\n like, like, let's say it hits four hours, you finish the lap you're on and then you do a loop\n\n43:02.880 --> 43:06.960\n around and then you start the next, your next lap. Would you say you take the exact same number of\n\n43:06.960 --> 43:12.880\n steps? Like when you're really in the groove, when you take in the pacing, are we talking about that\n\n43:12.880 --> 43:18.080\n level of precision or is it a little bit more feel? You mean like foot strike frequency? Yeah.\n\n43:18.080 --> 43:23.920\n Like frequency then over the distance to the lap. Would you say it's so precise that you're like,\n\n43:23.920 --> 43:28.480\n you get in this groove where it's like, gosh, you're making me wish I would have strapped more\n\n43:28.480 --> 43:34.160\n like a foot pod to my head. But like, yeah, so I think like my guess is it's pretty precise.\n\n43:34.160 --> 43:37.760\n Like is there a video of this? Sorry. I keep interrupting. Is there a video of this? Cause\n\n43:37.760 --> 43:44.400\n I, I've actually, this is now three years ago, build a computer vision algorithm that counts\n\n43:44.400 --> 43:50.720\n foot strikes. Oh, really? Yeah. For fun. Yeah. I was trying to understand, uh, we'll talk about\n\n43:50.720 --> 43:55.760\n this later. We have the same definition of fun when I got my, find myself on a track for all day\n\n43:55.760 --> 44:00.800\n and you find yourself counting foot strikes. I was trying to understand if, if there's how much\n\n44:00.800 --> 44:08.160\n variability there's in a extreme, like elite performers within a particular race, but also\n\n44:08.160 --> 44:14.960\n across races. It was just interesting to me from a robotics perspective, if like how much variability\n\n44:14.960 --> 44:20.560\n there is in the human body and in the way they use legs to move quickly. I think my guess would be\n\n44:21.120 --> 44:25.760\n that at the individual level, it's going to be pretty precise, assuming the pacing\n\n44:25.760 --> 44:32.560\n is consistent. So you get, so my pacing on that day, I ran two minutes faster the second 50 miles\n\n44:32.560 --> 44:36.640\n than I did the first 50 miles. So my splits were very even most of the day. I actually ran some of\n\n44:36.640 --> 44:42.320\n my fastest miles at the end. Uh, so there's going to be probably a slight variance from my fastest\n\n44:42.320 --> 44:47.760\n miles to my slowest mile in like your cadence or your foot strike. Uh, but probably not by a huge\n\n44:47.760 --> 44:52.560\n margin, but you might have a pretty big variance from one person to the next. So you get someone\n\n44:52.560 --> 44:57.920\n whose gate is just a little bit different. So like for me, I supinate, which means I kind of come down\n\n44:57.920 --> 45:02.560\n on the outside of my foot and I'm kind of more of a mid forefoot striker. So that's going to kind of\n\n45:02.560 --> 45:09.280\n impact my cadence to a degree. Whereas you might have someone who is kind of more mid to rear their\n\n45:09.280 --> 45:13.840\n foot or heel striker and they might pronate where their foot kind of rolls in. Uh, so that person\n\n45:13.840 --> 45:18.400\n may have a little bit of a different cadence as well. So you get someone, and I think you see this\n\n45:18.400 --> 45:23.280\n in elite marathoning too, which is going to probably just be a much larger data pool, uh,\n\n45:23.280 --> 45:29.200\n much, much more probably precise from just like a number of opportunities to study this.\n\n45:29.200 --> 45:34.080\n And I think even their ranges from one person to the next can be, I wouldn't say drastic, but,\n\n45:34.080 --> 45:38.960\n you know, to the degree of like 10 to maybe even 20 steps per minute or something like that from\n\n45:38.960 --> 45:43.280\n one person to the next. But most people, the faster they go, the higher their cadence is\n\n45:43.280 --> 45:46.320\n going to be. The slower they go, the lower their cadence is going to be, but there's going to be\n\n45:46.320 --> 45:54.000\n probably a range of optimal lowness and I don't know, probably optimal highness too than that.\n\n45:54.000 --> 45:59.440\n If you can just linger on the 11 hours, the person, first of all, would you like to be the\n\n45:59.440 --> 46:05.440\n person that breaks 11 hours? And second of all, the person that does break 11 hours, like what would,\n\n46:05.440 --> 46:10.800\n what would it take? And third question is, is it even possible in your intuition?\n\n46:10.800 --> 46:15.120\n Yeah. I mean, I would def I would be lying to you if I said I didn't want to be the first person\n\n46:15.120 --> 46:20.720\n to break 11 hours and a hundred miles. I think that'll be, um, would be a cool like barrier to\n\n46:20.720 --> 46:26.400\n be the one to usher that in. But with that said, I think I'm much more motivated in seeing it done\n\n46:27.280 --> 46:33.680\n from the sense that like, I think when we're talking about records, it's something that\n\n46:33.680 --> 46:37.600\n is inevitable that it's going to get broken. So, I mean, we were talking about happiness before\n\n46:37.600 --> 46:43.280\n this, right? So I've contemplated this in the past, um, where I was thinking to myself, like,\n\n46:44.080 --> 46:49.040\n uh, if my motivation is to break a world record or any record for that matter, course record\n\n46:49.600 --> 46:55.920\n and have that be my defining reason or my defining motivator, I probably need to do\n\n46:56.640 --> 47:01.760\n an assessment of what I'm kind of where my mind is at and where my focus is at.\n\n47:01.760 --> 47:09.120\n Uh, and just reflect on how I'm behaving in life because it's going to get broken, right? I mean,\n\n47:09.120 --> 47:16.800\n I could run 10 50 tomorrow and in 10 years, chances are that's no longer going to be my\n\n47:16.800 --> 47:22.400\n world record anymore. Someone's going to run faster than that. So if you're living to hold\n\n47:22.400 --> 47:28.080\n on to a record versus living to try to move the sport forward, which anytime you break a world\n\n47:28.080 --> 47:32.800\n record, you're moving the sport forward, then, then you have to look at that as like, that was\n\n47:32.800 --> 47:39.440\n my contribution. And whether I contribute again or not is kind of besides the point. What you want\n\n47:39.440 --> 47:44.400\n is that your performance, your contribution brings new people into the sport who are excited,\n\n47:44.400 --> 47:49.280\n motivated, and they can make their contribution. And then we can ultimately see, well, how fast\n\n47:49.280 --> 47:53.520\n can someone run a controlled environment, a hundred miler. And that's what I really want to\n\n47:53.520 --> 47:57.920\n see. Uh, cause I think I've gotten so much enjoyment from the sport. I mean, I've gotten so much\n\n47:57.920 --> 48:02.400\n enjoyment from the sport. I've been able to turn it into a career. And I think there's, there's\n\n48:02.400 --> 48:06.320\n other people who can do the same thing and it's not necessarily going to come at the expense of\n\n48:06.320 --> 48:10.640\n my career. Uh, but it's going to bring more attention to the sport. It's going to bring more\n\n48:10.640 --> 48:13.360\n interest in the sport. It's going to open the sport up to people who maybe otherwise would have\n\n48:13.360 --> 48:19.840\n never thought about it, seen it, considered it. And to me, I think that's like a much more rewarding\n\n48:19.840 --> 48:25.680\n goal than saying I want to break this record and I want to hold it for decades or I want to die\n\n48:25.680 --> 48:29.760\n with this record. So I never have to see someone go faster than me. Well, that's the progress of\n\n48:29.760 --> 48:34.080\n human civilization was down on the shoulders of giants and we keep creating cool stuff. Well,\n\n48:34.080 --> 48:38.400\n and it's, it's the other thing is just like, if you're honest with yourself too, it's, uh, I mean,\n\n48:38.400 --> 48:42.080\n we're seeing this right now in the running world where, you know, new innovations come in, new\n\n48:42.080 --> 48:47.360\n technologies come in, new nutritional approaches come in. And then we see like the new crop of\n\n48:47.360 --> 48:51.680\n folks have advantages that the old crop didn't have. And it can be easy to look back on that and\n\n48:51.680 --> 48:56.560\n say like, Hey, well, um, you know, if I would have had that product or if I would have done that,\n\n48:56.560 --> 49:00.560\n I would have run this. But then you're getting into that negative, you know, thought process again,\n\n49:00.560 --> 49:05.920\n which I generally try to stay off of. It's like the caveman. If I had fire, I would have done\n\n49:05.920 --> 49:10.000\n right. But with this, look at these idiots up there with their cars. If I would have had a car\n\n49:10.000 --> 49:18.240\n back then, I would have been ruled the world. Um, let me just zoom up briefly and ask you about\n\n49:18.240 --> 49:24.960\n kind of beauty and love. What's the most beautiful thing about running to you? Why do you love it?\n\n49:24.960 --> 49:29.680\n I think, uh, there's kind of a couple of directions to look at it through our lenses,\n\n49:29.680 --> 49:32.800\n look at it through. There's like the, in the moment, right? There's always going to be that\n\n49:32.800 --> 49:38.480\n run where, uh, you're clicking along and things just feel great. You get some endorphins and you\n\n49:38.480 --> 49:42.640\n get the, the, you know, the, the quote unquote runner's high and that sort of stuff. And that's\n\n49:42.640 --> 49:47.120\n like just like this great feeling that you can kind of tap into on the like the real, like,\n\n49:47.920 --> 49:53.040\n like in the moment type of level. Uh, you know, you've, my wife and I talk about this because\n\n49:53.040 --> 49:58.560\n she's a competitive ultra runner as well. And, um, you will, you'll, we'll have a day where,\n\n49:58.560 --> 50:02.880\n you know, we'll take a forced day off or something like that. And it's necessary, right? It's going to\n\n50:02.880 --> 50:08.480\n allow the enjoyment to continue. But you get into this like routine of, I wake up in the morning,\n\n50:08.480 --> 50:12.880\n I do this run and that kind of gets my day started. That gets my energies up. I get that\n\n50:12.880 --> 50:17.360\n runner's high afterwards. You remove that from the equation for a rest day. And you just start\n\n50:17.360 --> 50:21.440\n like, oh man, I don't feel like I never got started today. Like, you know, it's just this\n\n50:21.440 --> 50:25.840\n weird thing. It's almost, I think it's, it's funny because non runners don't always like\n\n50:26.480 --> 50:29.280\n necessarily recognize it because for them it's the complete opposite. They're like,\n\n50:29.280 --> 50:35.040\n if I can get away from not having to run today, that's going to be a good day versus. But it's\n\n50:35.040 --> 50:38.880\n one of those things that I think gets more addictive the more you do it. So, uh, so that's\n\n50:38.880 --> 50:44.160\n purely from the running perspective. There's this joy of, uh, of the runner's high of the post after\n\n50:44.160 --> 50:48.240\n the run. You feel like you can take on the world, that kind of thing. Yes. And I think that's one\n\n50:48.240 --> 50:53.600\n of the drivers from just the quality of life standpoint. Uh, just, uh, you know, and in the\n\n50:53.600 --> 50:57.760\n moment, immediate gratification, uh, standpoint. But then there's like, I think the bigger picture\n\n50:57.760 --> 51:05.600\n stuff or the longer term stuff. And for me, that enjoyment is like just the process like of, uh,\n\n51:05.600 --> 51:11.600\n okay, I'm starting at this fitness level and I'm going to do these workouts and by doing these\n\n51:11.600 --> 51:15.600\n workouts, I'm going to see incremental progress from them. And then that's another kind of like,\n\n51:15.600 --> 51:19.440\n kind of short term gratification. That's maybe a little longer than the day to day, but,\n\n51:19.440 --> 51:24.880\n um, still like shorter than like a career or a, or a buildup for a particular race\n\n51:24.880 --> 51:28.480\n where you're saying you're seeing yourself like, okay, maybe I'm focusing on short intervals right\n\n51:28.480 --> 51:34.400\n now. And on week one, I covered this much distance in three minutes, but by week four, I'm covering\n\n51:34.400 --> 51:39.440\n this much distance and you can just see that progress is almost like, uh, in elementary\n\n51:39.440 --> 51:42.880\n school when you get the gold star for reading a book, it's like, did that gold star really mean\n\n51:42.880 --> 51:48.160\n anything? I don't know, but I felt great when they gave it to me. There's something about just\n\n51:48.160 --> 51:53.360\n finding improvement and people love to see improvement, I think. So that's where, uh,\n\n51:53.360 --> 51:56.800\n I think you can also get some value in it saying like I started here and I got there.\n\n51:57.440 --> 52:02.960\n Um, and then I think there's also just like, uh, I would call this maybe more the cherry on top,\n\n52:02.960 --> 52:07.440\n which is like where you express your work, which is the race itself, where that's going to be kind\n\n52:07.440 --> 52:13.440\n of the thing that kind of like, uh, shows up on the end result and where it kind of identifies\n\n52:13.440 --> 52:18.080\n whether you did things right or wrong. Yeah. So there's a sense which, in which training is a kind\n\n52:18.080 --> 52:25.840\n of, uh, preparation towards race day and race day being the thing where you get to be the artist.\n\n52:25.840 --> 52:31.440\n You get to create this, this piece of art and they might suck, it might be beautiful. Uh, I mean,\n\n52:31.440 --> 52:36.400\n I, I, I see in the grappling world, I see competition in that same way when I feel the best\n\n52:36.400 --> 52:43.040\n about it, which is like, sounds pretentious to say, but like, I'm trying to be the best version of\n\n52:43.040 --> 52:51.280\n myself in this particular day of competition and to do something that I'll be proud of in, in, uh,\n\n52:51.280 --> 52:58.560\n in an artist way, not in a kind of some kind of numerical way, but like as a holistic sense, like\n\n52:59.120 --> 53:03.920\n do something cool. Like in grappling, that means for me, that means like not stalling,\n\n53:04.720 --> 53:10.880\n like taking big risks and trying to dominate another person in the, in the context of grappling\n\n53:10.880 --> 53:18.320\n and, and do it, like push myself to the limit, both cardio wise and technique wise, and just play,\n\n53:18.320 --> 53:22.480\n play beautifully. I mean, you see this in kind of chess, there's systematic chess players and\n\n53:22.480 --> 53:28.000\n there's people that allow themselves to have those moments of genius where they take the big risk\n\n53:28.000 --> 53:34.000\n that eventually pays off or doesn't. And that to me is art that, I mean, there's art within running,\n\n53:34.000 --> 53:38.400\n there's art within chess, there's art within grappling. And you got a chance, like all the\n\n53:38.400 --> 53:44.640\n training is more like science. And then it feels like the competition days art. Yeah. I think that\n\n53:44.640 --> 53:49.280\n that that's a really cool, cool way to look at. And I think it's when you really open up the\n\n53:49.280 --> 53:53.840\n perspective of that too, it's like even, uh, obviously, you know, having a great day,\n\n53:53.840 --> 53:57.120\n like winning the tournament or, you know, getting further than you were expected to,\n\n53:57.120 --> 54:00.960\n or beating someone who you've never beaten before or something like that. Uh, or in the running\n\n54:00.960 --> 54:05.680\n perspective, like achieving that goal time, uh, that sort of stuff. Obviously those are kind of\n\n54:05.680 --> 54:09.520\n like the ones you, if, when you're honest with yourself, you really want, and you're going to\n\n54:09.520 --> 54:13.840\n probably get the most satisfaction out of, but even when they don't go wrong, like maybe like\n\n54:13.840 --> 54:19.200\n with your grappling tournament, uh, analogy, the, you know, maybe the guy you're grappling against\n\n54:19.200 --> 54:23.360\n does a move on you and you're like, I was not prepared for that move. So now the enjoyment\n\n54:23.360 --> 54:28.720\n becomes, okay, back to the drawing board. Now I need to find out what do I do when that happens\n\n54:28.720 --> 54:33.280\n to me next time. And that's where the, I think the why comes in again, same thing with running.\n\n54:33.280 --> 54:39.200\n Like maybe I make a mistake and, you know, like eat something I didn't really want to eat or,\n\n54:39.200 --> 54:43.280\n or thought was going to work, but didn't work. And it costs me more time than I gained by having it\n\n54:43.280 --> 54:45.760\n or something like that. And then I go back to the drawing board and say, okay, well,\n\n54:46.640 --> 54:50.480\n I can't do that. That didn't work. Or if I'm going to do that, I need to be more prepared to\n\n54:50.480 --> 54:56.800\n be able to do it. And I love that part of the sport. Um, just the rearranging of things and\n\n54:56.800 --> 55:01.280\n adjusting and tinkering. There's some sense in which the mistakes and like the flaws give us\n\n55:01.280 --> 55:07.920\n meaning. Cause like if, if everything, um, if you weren't able to find mistakes and something you've\n\n55:07.920 --> 55:15.920\n done, it feels like the life would be void of meaning. It's a lost opportunity too. Like if,\n\n55:15.920 --> 55:24.240\n I mean, like when I look at even my a hundred mile race of 11, 19, I can find spots in there\n\n55:24.240 --> 55:27.680\n where I was like, Oh, you know what? I could clean that up a little bit. Maybe if I do this\n\n55:27.680 --> 55:33.840\n differently. And I mean, that's going to get me, you know, a little bit faster. If I sat back and\n\n55:33.840 --> 55:37.920\n said, Hey, well things went great that day. Cool. Let's see if we can replicate it. Then, you know,\n\n55:37.920 --> 55:45.280\n I probably run 11, 19 again. So can we talk about training a little bit? What does your training\n\n55:45.280 --> 55:53.520\n look like year round day to day, hour to hour, like optimal? Maybe, uh, maybe you want to pick a\n\n55:53.520 --> 55:58.080\n race in the context of what you want to discuss that, but, and also people should follow you on\n\n55:58.080 --> 56:05.760\n Instagram. You have a lot of kind of interesting, um, like little glances into your training process\n\n56:05.760 --> 56:10.560\n and into your training thinking, which is quite fascinating. But if you look at an optimal training\n\n56:10.560 --> 56:15.840\n process, what does that look like? Yeah. So I think, uh, the, if we were looking at it from\n\n56:15.840 --> 56:20.240\n like a philosophical level or like an approach level, I think there's some things that carry over\n\n56:20.240 --> 56:27.760\n from regardless of the distance. So I think working on your weaknesses and things that are least\n\n56:27.760 --> 56:32.960\n specific to what you're going to do on race day, but are still going to be important things in\n\n56:32.960 --> 56:39.440\n terms of improving your ability to perform on race day or maximizing your potential, uh,\n\n56:39.440 --> 56:46.240\n with the things that are specific you do first. I say that, but there's a caveat with endurance\n\n56:46.240 --> 56:49.600\n sport. I think maybe even more specifically with things like our ultra marathons or a hundred\n\n56:49.600 --> 56:56.720\n miles where you want a really strong aerobic foundation or like a base before you really start,\n\n56:56.720 --> 57:03.200\n I think, structuring things towards a specific one. So for me, I think like a target for me is\n\n57:03.200 --> 57:10.480\n oftentimes like, uh, you know, getting really fit at like what my pace would be at like my aerobic\n\n57:10.480 --> 57:14.720\n threshold or what a lot of people may be called like a maximum aerobic function. Um, I mean,\n\n57:14.720 --> 57:17.440\n the running world is kind of weird where we have like these terminologies where there's\n\n57:17.440 --> 57:21.360\n sometimes multiple words that essentially mean the same thing, but one is from like, uh,\n\n57:21.360 --> 57:25.840\n just an actual physiological reaction and one is just like a feeling and stuff like that. So\n\n57:25.840 --> 57:33.120\n you mentioned time on feet versus time in optimal physiological state. Like how important is it just\n\n57:33.120 --> 57:40.160\n to get like running done versus like running in a particular pace that would depend on the event.\n\n57:40.160 --> 57:46.320\n I would say to a degree and there's contradicting ideas about like kind of how to structure it. I\n\n57:46.320 --> 57:52.160\n think a lot of times like, uh, you do want to like time on feet in most cases is just going to be\n\n57:52.160 --> 57:56.320\n like I'm running easy, whatever feels easy that day. And that can be different from one day to\n\n57:56.320 --> 58:01.440\n the next. Like I might feel great and you know, that produces a much faster pace than if I feel\n\n58:01.440 --> 58:06.480\n really miserable or something like that. Um, so that's why I think a lot of times running,\n\n58:06.480 --> 58:10.560\n well they'll, they'll do the whole perceived, perceived effort or perceived exertion.\n\n58:10.560 --> 58:18.480\n And there you're looking at kind of understanding the response your body has to a certain effort\n\n58:18.480 --> 58:22.080\n level and you're supposed to target a certain effort level in order to like get a certain\n\n58:22.080 --> 58:27.920\n response. So to maybe simplify that a little bit or make it a little clearer, like I think I focus\n\n58:27.920 --> 58:35.840\n on essentially like short intervals. I focus on longer intervals or tempo runs. Uh, I focus on,\n\n58:35.840 --> 58:42.240\n um, like race pace intensity, which is a lot of times what I'll build my long run around. Um,\n\n58:42.240 --> 58:46.640\n but I'll also like, those are kind of like the small pieces to the puzzle. Those are the options\n\n58:46.640 --> 58:51.520\n you're working with. Yeah, but I'm going to always try to work with those options on top of a massive\n\n58:51.520 --> 58:55.440\n aerobic base, which is going to probably be like 80% of the work. So how do you build that massive\n\n58:55.440 --> 59:00.560\n aerobic base? What are we talking about? Just distance? Distance and essentially, so I like\n\n59:00.560 --> 59:03.440\n to call it microstressing because you're going to always start at a different spot depending\n\n59:03.440 --> 59:07.200\n on where your fitness level is at and depending on where you're at as an individual. I'm going\n\n59:07.200 --> 59:11.600\n to be targeting my aerobic threshold. I'm going to get right up to it, but not necessarily cross\n\n59:11.600 --> 59:16.560\n over it. Um, it's, it, you know, it's, it's been popularized as maximum aerobic function as kind\n\n59:16.560 --> 59:22.400\n of a training philosophy. That philosophy in itself, I think maybe is a little more like\n\n59:22.400 --> 59:28.240\n holistic where they're saying, do this basically all the time. And by doing so, you're going to,\n\n59:28.240 --> 59:34.000\n like, you're going to raise your aerobic potential by so much that, you know, you can kind of like\n\n59:34.000 --> 59:37.840\n race yourself into shape at that point. And this would be maybe more specific for like shorter\n\n59:37.840 --> 59:41.360\n distance or endurance runs where you're not going to really race yourself in the shape of a hundred\n\n59:41.360 --> 59:46.560\n milers. But for five Ks, you might, you might do like a huge base building phase where you're going\n\n59:46.560 --> 59:53.760\n up to that maximum aerobic function or that aerobic threshold and you're watching your pace come down\n\n59:53.760 --> 59:58.800\n at that. So the rule there is basically like if you're seeing improvement, that's the sign\n\n59:58.800 --> 1:00:02.400\n you're looking for, or which would just be your pace dropping at that heart rate or at that\n\n1:00:02.400 --> 1:00:06.720\n intensity. And, uh, if you're seeing that continually go down, you're heading in the\n\n1:00:06.720 --> 1:00:11.520\n right direction. If you start seeing it go the opposite way, you're, you're probably overreaching\n\n1:00:11.520 --> 1:00:15.360\n where you're trying to do too much of it. So that's kind of dictates how much the dose,\n\n1:00:15.360 --> 1:00:19.520\n I guess you'd say, when we talk about max aerobic function, we're talking about heart rate as the\n\n1:00:19.520 --> 1:00:24.240\n ultimate, as the really important metric here. So maintaining a particular heart rate during the run.\n\n1:00:25.200 --> 1:00:29.200\n Uh, is that the measure that, like, how do you know you're in the right place? Yeah. Yeah. And\n\n1:00:29.200 --> 1:00:32.800\n then that's where it gets a little tricky because like, unless you go into a lab and get your aerobic\n\n1:00:32.800 --> 1:00:37.600\n threshold tested, it's really hard to have like an exact number on it. Um, you know, Dr. Phil\n\n1:00:37.600 --> 1:00:42.640\n Maffetone with the maximum function process, he'll say 180 minus your age is going to give you your.\n\n1:00:42.640 --> 1:00:47.200\n Yeah. That's the MAF 180 formula that I thought was fascinating for, it's like, uh, in the same\n\n1:00:47.200 --> 1:00:52.480\n way E equals E equals MC squared is fascinating that there could be a formula that captures like\n\n1:00:52.480 --> 1:00:59.200\n optimal running. So that for people who don't know that's 180 minus your age, if you train at that\n\n1:00:59.200 --> 1:01:02.720\n heart rate, if you run at that heart rate, you're going to progress a lot. And here's the advantage\n\n1:01:02.720 --> 1:01:07.360\n of that. I think like with any of these things, you want to look at it through where are the\n\n1:01:07.360 --> 1:01:11.440\n advantages here and I need to account for those. And then where are the potential disadvantages\n\n1:01:11.440 --> 1:01:16.320\n and then decide for me as an individual, do these advantages outweigh the disadvantages\n\n1:01:16.320 --> 1:01:20.080\n on what's the alternative approach and is that going to produce more advantages or less?\n\n1:01:20.080 --> 1:01:26.160\n So with, with maximum function, uh, here's some advantages. Like it is low enough intensity\n\n1:01:26.160 --> 1:01:33.360\n where you can train pretty consistently at a fairly high volume with a very low injury risk\n\n1:01:33.920 --> 1:01:38.640\n with a very low, like things that are going to maybe lower your quality of life, like muscle\n\n1:01:38.640 --> 1:01:43.280\n damage and things like that. Um, it's a more efficient way in the sense that you're going to\n\n1:01:43.280 --> 1:01:48.160\n be like prioritizing like fat metabolization, which, um, I mean, if you're looking at like\n\n1:01:48.160 --> 1:01:53.360\n Jeff Follick and Dr. Jeff Follick and Dr. Dominic DiAgostino, some of their research and things like\n\n1:01:53.360 --> 1:01:57.360\n that, like they're going to show that, you know, that's going to be a little cleaner way to go\n\n1:01:57.360 --> 1:02:02.240\n about things from just a recovery standpoint, a breakdown standpoint. So they could be like a,\n\n1:02:02.240 --> 1:02:08.720\n what they call like a fat adapted athlete. So you can go to your fat stores for energy if you're\n\n1:02:08.720 --> 1:02:14.800\n applying this math. What is it called by the way? Math 180. Is that a good, what are your thoughts\n\n1:02:14.800 --> 1:02:21.760\n about in general for yourself and for the broader population? I think the math 180 formula is about\n\n1:02:21.760 --> 1:02:27.120\n as good of a formula as you're going to find in terms of capturing as many people as you can get\n\n1:02:27.120 --> 1:02:31.280\n away with capturing with a kind of a universal thing. Uh, like any of these things, I mean,\n\n1:02:31.840 --> 1:02:37.520\n it's, it's more likely kind of on a bell curve where like the bulk of that 180 minus their age\n\n1:02:37.520 --> 1:02:41.200\n is probably going to be a pretty good, at least starting point to kind of figure out where that is.\n\n1:02:41.200 --> 1:02:46.640\n There's some other things you can like maybe use to kind of check it that I like to do. If I'm,\n\n1:02:46.640 --> 1:02:50.480\n let's say I just, I did 180 minus my age and I went out and I started running and it was like,\n\n1:02:51.040 --> 1:02:56.640\n I'm running along and I'm just like, my, my breathing is labored. I'm, you know, I'm struggling\n\n1:02:56.640 --> 1:03:01.360\n to get a sentence out without gasping for breath. Well, that's my body telling me I'm probably not\n\n1:03:01.360 --> 1:03:06.960\n actually at my true like math number or my true, like underneath my true aerobic threshold, like\n\n1:03:06.960 --> 1:03:10.320\n aerobic threshold and maximum function, you should be able to do that for hours and you should be\n\n1:03:10.320 --> 1:03:15.600\n able to breathe pretty efficiently and talk. Yep. Carry a conversation. Um, other people will say,\n\n1:03:15.600 --> 1:03:19.600\n like you, another way to kind of gauge it, if you can breathe in your nose and out your mouth,\n\n1:03:19.600 --> 1:03:23.760\n that's not necessarily the best way to do on a, from a performance standpoint, but it can be a\n\n1:03:23.760 --> 1:03:28.480\n good kind of governor that will allow you to, like, if you can, if you can no longer breathe\n\n1:03:28.480 --> 1:03:31.760\n in your nose and out your mouth, you're probably going too fast to actually technically be at your\n\n1:03:31.760 --> 1:03:36.960\n math pace or under your math pace. Yeah. I had, uh, actually when I was in, in better shape,\n\n1:03:36.960 --> 1:03:43.920\n I had trouble getting to that math number. I found myself like that I would be doing way too much\n\n1:03:43.920 --> 1:03:49.280\n work. Like it was too hard to do. It was too hard to get to that number. I was running a much lower\n\n1:03:49.280 --> 1:03:55.920\n heart rate, like 10 to 20, what do you call that beats lower. And that's, I was still for myself,\n\n1:03:55.920 --> 1:04:01.040\n happy with the pace. It was a good pace and, and I was, felt good. I was smiling and enjoying life\n\n1:04:01.040 --> 1:04:07.840\n and, uh, I did. And the moment I take myself to that, uh, level of like the, the math 180 level,\n\n1:04:08.480 --> 1:04:13.600\n that's like, that felt like a real workout. Yeah. And it felt like I can't do that for five, 10,\n\n1:04:13.600 --> 1:04:18.240\n 15 miles. Like I, I started feeling it like this is a one or two mile thing.\n\n1:04:18.240 --> 1:04:26.320\n No, but I think his answer to that, uh, Phil Meftone's answer is maybe you're supposed to like,\n\n1:04:26.320 --> 1:04:32.000\n uh, what, maybe do some more sprints or something like that, or build up your, maybe like I'm too\n\n1:04:32.000 --> 1:04:37.520\n weak. Yeah. Musculature wise to like, uh, yeah, like that, that's a sign that you need to work\n\n1:04:37.520 --> 1:04:40.720\n on some stuff. You can't just keep enjoying life. There's, there's two ways to look at that,\n\n1:04:40.720 --> 1:04:45.840\n I think. And I think you're, you're, you're right on. I think that what the advice from that, from\n\n1:04:45.840 --> 1:04:52.080\n that kind of a process would say is either you, you're doing too much of it. So it's getting too\n\n1:04:52.080 --> 1:04:56.800\n hard for where your skeletal muscle system is currently at for that particular activity. So\n\n1:04:56.800 --> 1:05:00.960\n like, it can be different too. Like if you're cycling versus running, you know, that's a little\n\n1:05:00.960 --> 1:05:06.240\n bit of different mechanic where it can be different where you could take a super fit cyclist and then\n\n1:05:06.240 --> 1:05:10.480\n put them on, you know, the, the volume, the volume they're going to be able to tolerate relative to\n\n1:05:10.480 --> 1:05:14.160\n what you're going to do when you remove like impact forces and things like that is going to be\n\n1:05:14.160 --> 1:05:18.000\n lower if they haven't been practicing that activity. So for you, like, you know, you're prioritizing,\n\n1:05:18.000 --> 1:05:23.520\n like, uh, uh, wrestling and mixed martial arts or not mixed martial arts, but jujitsu type stuff. So,\n\n1:05:24.080 --> 1:05:30.400\n uh, you know, running is maybe kind of that, that, uh, that secondary activity versus the primary\n\n1:05:30.400 --> 1:05:35.680\n activity. But yeah, so what they would say is probably like, maybe instead of doing that at,\n\n1:05:35.680 --> 1:05:39.680\n let's say you were doing that for like 30 miles a week or something like that, and it was getting\n\n1:05:39.680 --> 1:05:44.880\n too hard to continue there, they'd say, you know, come back to 20, get used to 20, get comfortable\n\n1:05:44.880 --> 1:05:49.440\n with 20, then let's get you up to 25 and 30 and kind of just like inch you along.\n\n1:05:50.000 --> 1:05:56.560\n One of the intuitions I had about the ways I was failing at running is the form was probably not\n\n1:05:56.560 --> 1:06:04.560\n great. Like the way to get to those 30, 40 miles is to get the form right. Maybe I was doing too\n\n1:06:04.560 --> 1:06:10.080\n big of steps, not so like playing with a different gate, playing with a different kind of, um, the\n\n1:06:10.080 --> 1:06:15.200\n form of your form, the economy, the efficiency. Yeah. So that was, that was the intuition. Like\n\n1:06:15.200 --> 1:06:19.040\n I was doing something wrong, but I suppose that's the benefit of these kind of formulas. It\n\n1:06:19.040 --> 1:06:24.160\n challenges you to think like, how can I improve this kind of stuff? Well, and it also, it simplifies\n\n1:06:24.160 --> 1:06:29.280\n it so much that you're forced to, right? You're forced to optimize within that real strict\n\n1:06:29.280 --> 1:06:35.760\n parameter versus am I doing my short intervals right, but my long runs wrong? Or am I doing my\n\n1:06:35.760 --> 1:06:39.920\n like long intervals right, but my short intervals, and then you just, it kind of complicates things\n\n1:06:39.920 --> 1:06:43.440\n when you start throwing a lot of stuff there. And for most people, especially when they're first\n\n1:06:43.440 --> 1:06:48.320\n getting started, you know, you're, you can't overcomplicate it or you're just going to like,\n\n1:06:48.320 --> 1:06:52.640\n you're going to do like a bunch of half right, half wrong things and then not really know where\n\n1:06:52.640 --> 1:06:58.560\n your progress or your deficits are necessarily at. So I do think this is an amazing approach,\n\n1:06:58.560 --> 1:07:04.560\n especially for people who are just getting into it and building that, that foundation, um, where,\n\n1:07:04.560 --> 1:07:08.160\n where I think maybe you want to deviate from that a little bit, especially when you start getting\n\n1:07:08.160 --> 1:07:14.560\n to these events that are operating well outside that intensity. So you take something like, um,\n\n1:07:14.560 --> 1:07:19.120\n you know, let's say it's a race that takes you in the neighborhood of around like 12 minutes or\n\n1:07:19.120 --> 1:07:23.120\n something like that, then you're going to be running significantly faster than your, your\n\n1:07:23.120 --> 1:07:28.880\n maximum function pace. So most of the research is going to say at some point in time, you need to\n\n1:07:28.880 --> 1:07:33.200\n get around to practicing the pace at which you're going to perform at and really fine tuning the\n\n1:07:33.200 --> 1:07:40.160\n mechanics, uh, the efficiencies, uh, how it feels, how to judge it, how to pace it at the pace you're\n\n1:07:40.160 --> 1:07:43.760\n going to try to compete at. So there's obviously like a large range of targets there when we're\n\n1:07:43.760 --> 1:07:47.120\n talking about the endurance world in general, where, you know, you have these shorter events,\n\n1:07:47.120 --> 1:07:50.800\n like five kilometers, and then you also have a hundred mile races, which are going to typically\n\n1:07:50.800 --> 1:07:54.720\n be quite a bit below your maximum heroic function in, especially on these trail races.\n\n1:07:54.720 --> 1:08:01.280\n I need to admit something. So I don't measure the runs at all in terms of, uh, time, uh,\n\n1:08:01.280 --> 1:08:07.360\n because I get competitive with myself. So I kind of decided that running for me is going to be this\n\n1:08:07.360 --> 1:08:13.040\n thing where I just go by feel. Is it possible to be that kind of runner and, you know, still have\n\n1:08:13.040 --> 1:08:17.680\n running as part of your life and be a good performer in running? I actually think that's,\n\n1:08:17.680 --> 1:08:22.800\n that's where you want to get to. The problem is most people have a hard time getting to that\n\n1:08:22.800 --> 1:08:27.520\n because they'll go out and they'll run with a friend and match their pace. Or they'll go out\n\n1:08:27.520 --> 1:08:32.080\n and they'll say, well, I want to run this pace. So they'll target that pace or target a specific\n\n1:08:32.080 --> 1:08:38.240\n heart rate, which is, you know, not necessarily how they maybe feel good doing it. So I think\n\n1:08:38.240 --> 1:08:43.280\n like once you, I mean, obviously I think when you put a race on the calendar, if your goal is\n\n1:08:43.280 --> 1:08:47.280\n performance, it's a little harder to just say like, well, I'm going to run whatever feels good today\n\n1:08:47.280 --> 1:08:51.200\n because eventually you have to get around to doing what's specific. But from just a fitness\n\n1:08:51.200 --> 1:08:56.080\n standpoint, health standpoint, enjoyment standpoint, um, I think it's totally fine to go out and say,\n\n1:08:56.080 --> 1:08:59.120\n I'm going to run what feels good today. And you know, maybe someday you will feel like at\n\n1:08:59.120 --> 1:09:02.000\n the end of the run, I'm going to do a couple of sprints just to get some, you know, that,\n\n1:09:02.000 --> 1:09:06.480\n because it does, that one's a hard one to kind of jumpstart, but once you do it and you realize how\n\n1:09:06.480 --> 1:09:10.160\n kind of good it feels, maybe to throw in a few accelerations at the end of a run. And then you,\n\n1:09:10.160 --> 1:09:13.200\n you say, oh wow, that feels pretty good to do that. I feel a little more accomplished.\n\n1:09:13.200 --> 1:09:17.200\n That's right. That's a forcing function, but I like to finish runs with sprints anyway.\n\n1:09:17.200 --> 1:09:21.440\n Okay. Because you're already there without, right. You don't need to the timing. I'm afraid\n\n1:09:21.440 --> 1:09:27.120\n of the time becoming a drug, but the flip side of that, it's a useful tool to get you to learn\n\n1:09:27.120 --> 1:09:32.640\n the right form, the right feel, like what it feels like to have to be in good shape.\n\n1:09:32.640 --> 1:09:36.320\n And then you can throw out the time. Well, I think too with, with feel running. And what\n\n1:09:36.320 --> 1:09:39.520\n I mean by that is that kind of back to that perceived effort thing where like you do enough\n\n1:09:39.520 --> 1:09:44.880\n of it and you start being able to recognize, like I can go out and if you said, okay, run,\n\n1:09:45.440 --> 1:09:51.120\n you know, 60 minutes at your aerobic threshold, I could go, I could know where that is on my\n\n1:09:51.120 --> 1:09:54.640\n heart rate. And I could go out there and just say like, okay, I know what that feels like and go\n\n1:09:54.640 --> 1:09:59.360\n out and run that feel. And I'm going to hit that spot. Like I bet you if we looked at my heart\n\n1:09:59.360 --> 1:10:02.000\n rate data after that, it'd be right in there. And I wouldn't have to look at some of that's\n\n1:10:02.000 --> 1:10:07.920\n just experience. Someone's just understanding like when like noticing the physiological responses,\n\n1:10:07.920 --> 1:10:12.400\n when you cross over versus step a little bit too below it, uh, you can get yourself daydreaming\n\n1:10:12.400 --> 1:10:15.920\n and forget. I'll do this sometimes too, where I'll be tart. Cause I'm kind of like you too,\n\n1:10:15.920 --> 1:10:20.880\n where when I'm getting really fit, uh, especially with my foundation, like I gotta, you know,\n\n1:10:20.880 --> 1:10:25.280\n I'm moving pretty quick at my aerobic threshold. So like if I start daydreaming too much, I can\n\n1:10:25.280 --> 1:10:27.760\n notice, Oh, I'm drifting back a little bit. I looked down at my heart rate matter. Oh yeah,\n\n1:10:27.760 --> 1:10:33.040\n I'm 10 beats under, you know, so you do it. It does take a little bit of, I think just awareness.\n\n1:10:33.040 --> 1:10:38.800\n Um, but it's also not necessarily something where you have to be so exact that you're hitting things,\n\n1:10:38.800 --> 1:10:43.200\n you know, an exact heart rate all the time. There's usually a range and there's even like\n\n1:10:43.200 --> 1:10:47.760\n some fluctuations where like if you've been healthy for a year or two without any injuries\n\n1:10:47.760 --> 1:10:51.680\n and you've been fit that you can probably add five beats to your maximum aerobic function.\n\n1:10:51.680 --> 1:10:55.440\n If you're using that as kind of your, your target from the 180 minus your age formula.\n\n1:10:55.440 --> 1:11:01.120\n So let's try this, lay this out for yourself, but for others, you, you offer readymade plans\n\n1:11:01.120 --> 1:11:06.720\n for people, you know, depending on their, I think the key thing there is the distance.\n\n1:11:06.720 --> 1:11:13.040\n Maybe you can elaborate, but what does that plan look like? Usually what are the key\n\n1:11:13.040 --> 1:11:19.520\n options as you've already kind of mentioned? And how does your week look like? How do a lot of\n\n1:11:19.520 --> 1:11:25.280\n people's week look like in terms of splits? Are we talking about, um, you know, in terms of rest\n\n1:11:25.280 --> 1:11:31.840\n days, in terms of how often do you do speed work versus longer distance? You mentioned long runs.\n\n1:11:31.840 --> 1:11:38.480\n Like, is there something you could say that's generally applicable about the, the structure\n\n1:11:38.480 --> 1:11:43.360\n of these plans? The readymade plans, I definitely follow like a philosophy, um, and it's going to\n\n1:11:43.360 --> 1:11:48.560\n be like kind of like lockstep in that. Um, so for those, like there's always going to be a sacrifice\n\n1:11:48.560 --> 1:11:52.880\n when you do like a readymade plan because there's, you're removing the individual context there.\n\n1:11:52.880 --> 1:11:56.320\n So for folks who are like really want to get into the weeds, I usually do like a personalized\n\n1:11:56.320 --> 1:11:59.760\n coaching plan with them where we sit down and we actually look at their strengths, their weaknesses\n\n1:12:00.320 --> 1:12:06.800\n and really kind of go in from that perspective and fine tune it. And it also like it avoids\n\n1:12:06.800 --> 1:12:12.480\n it avoids a situation where, Oh, my readymade plan says I'm supposed to do this run today,\n\n1:12:12.480 --> 1:12:15.760\n but I don't feel great today. So what do I do? I mean, some people are fine with that because\n\n1:12:15.760 --> 1:12:21.120\n they're, they're, they're aware enough of like the process that they can adjust it themselves.\n\n1:12:21.120 --> 1:12:24.880\n Other folks just need a little more support. So, um, that's kind of the difference there,\n\n1:12:24.880 --> 1:12:29.040\n but in terms of the structure of it, it kind of goes with an approach where\n\n1:12:29.040 --> 1:12:33.440\n ogre saying you build this foundation, you're going to spend, you know, usually anywhere\n\n1:12:33.440 --> 1:12:38.000\n between eight to 12 weeks just building up your, your aerobic foundation. You're going to be doing\n\n1:12:38.000 --> 1:12:42.400\n a lot of stuff that are kind of at, I call them base runs, but they're basically your maximum\n\n1:12:42.400 --> 1:12:46.320\n aerobic function or you're up to your aerobic threshold type stuff. And they're really going\n\n1:12:46.320 --> 1:12:50.480\n to get really fit with that. And once they kind of have that foundation laid, then it's time to\n\n1:12:50.480 --> 1:12:55.120\n get into the specifics of whatever distance they're doing. So if it, where it will differ will\n\n1:12:55.120 --> 1:12:59.680\n be like if they're doing a right now on those plans, I think I've got 5k half marathon marathon,\n\n1:12:59.680 --> 1:13:05.280\n 50k, 80 to a hundred K and then a hundred miles. So if they pick a 5k plan, the order of operations\n\n1:13:05.280 --> 1:13:08.160\n is going to be different than if they pick the a hundred mile plan, you're going to see\n\n1:13:09.200 --> 1:13:14.320\n some of the same workouts show up in that plan. It just going to be different areas of it. So once\n\n1:13:14.320 --> 1:13:19.840\n they're really fit at that, uh, you know, that foundational level, then, you know, if they're\n\n1:13:19.840 --> 1:13:24.080\n doing say a hundred mile plan, they might start doing some short intervals, which I would, on my\n\n1:13:24.080 --> 1:13:28.080\n plans, I usually range between 30 seconds up to four minutes. It's kind of that short interval\n\n1:13:28.080 --> 1:13:33.440\n range. Can you describe what you mean by short interval? It's like a sprint and then a rest.\n\n1:13:33.440 --> 1:13:39.040\n Yeah. Yeah. So I'll use basically like, I'll use like a, basically a 12 minute time trial\n\n1:13:39.600 --> 1:13:43.440\n and that's going to kind of like dictate for them what the intensity and the pace is going to be\n\n1:13:43.440 --> 1:13:48.480\n for some of those. When they're under a minute, they'll push past that a little bit. Um, but\n\n1:13:48.480 --> 1:13:53.040\n usually when we're up to like above a minute and certainly up to four minutes, like whatever pace\n\n1:13:53.040 --> 1:13:57.040\n or intensity that they get for that kind of 12 minute time trial, where they're just seeing how\n\n1:13:57.040 --> 1:14:02.560\n far they can go in 12 minutes is going to be, um, kind of like about where they're going to target\n\n1:14:02.560 --> 1:14:05.920\n for those intervals. So then those intervals are going to be structured. Let's say we were doing\n\n1:14:05.920 --> 1:14:09.840\n two minute intervals. They're going to do two minutes at that intensity that they could do for\n\n1:14:09.840 --> 1:14:14.080\n 12 minutes at a time trial. Then they're going to do a two minute real easy jog, or maybe even walk\n\n1:14:14.080 --> 1:14:18.240\n just to kind of bounce back. And they're going to repeat it. How do you figure out how far you can\n\n1:14:18.240 --> 1:14:23.280\n go in 12 minutes? Is that just a trial and error you build up to it? There's formulas with,\n\n1:14:23.280 --> 1:14:29.760\n yeah, there's some newer formulas that are probably a little less, uh, um, brutal, uh,\n\n1:14:29.760 --> 1:14:34.960\n where you kind of, uh, I haven't really dove into these that that in depth yet. I know like, um,\n\n1:14:35.920 --> 1:14:40.640\n that you can kind of replicate it by doing like a short, a very short interval and then a slightly\n\n1:14:40.640 --> 1:14:45.920\n longer one. Um, and then like another one where like at the end one, that last one will kind of\n\n1:14:45.920 --> 1:14:50.560\n indicate what it is. Uh, and so you're doing less of it to get the same answer to the question.\n\n1:14:50.560 --> 1:14:56.240\n But sometimes I think when it's someone who's new, I'd rather them just do a 12 minute time trial\n\n1:14:56.240 --> 1:15:01.680\n because it's easy for them to execute in the sense that it's pretty clear. You do a warm up,\n\n1:15:01.680 --> 1:15:06.000\n you do some strides, maybe some dynamic stretches, and you just run as hard as you can for 12 minutes\n\n1:15:06.000 --> 1:15:11.680\n as evenly paced as you can manage. And, uh, I mean, if the, if it's going to produce the data\n\n1:15:11.680 --> 1:15:17.040\n I'm looking for, uh, and I mean, it's also no matter what happens, they'll produce the data.\n\n1:15:17.040 --> 1:15:21.040\n Yeah. I mean, you can, you can screw it up. I guess you can go way too fast. Then you have this\n\n1:15:21.040 --> 1:15:24.480\n scenario where like, Oh, it looks like your, you know, your first two minutes were drastically\n\n1:15:24.480 --> 1:15:28.800\n faster than your last two. And then it's like, Oh, we maybe screwed that one up. But, um,\n\n1:15:28.800 --> 1:15:34.160\n but I mean really like you don't even need to do the time trial technically. Um, a lot of times\n\n1:15:34.160 --> 1:15:41.040\n you can go off of feel like what we described with, um, the threshold stuff and, and, you know,\n\n1:15:41.040 --> 1:15:47.280\n it's a high enough intensity where, where like you can start to kind of like your, your body's\n\n1:15:47.280 --> 1:15:51.760\n going to kind of limit you to a degree where, um, if I said we didn't do the time trial and just\n\n1:15:51.760 --> 1:15:56.640\n started doing the intervals, we could figure out that, you know, if they're doing them right or\n\n1:15:56.640 --> 1:16:00.320\n not, if we see a scenario where, Oh, it looks like these first two intervals were significantly\n\n1:16:00.320 --> 1:16:05.120\n slower than the last two chances are, we're still not quite dialed in in terms of what the intensity\n\n1:16:05.120 --> 1:16:08.720\n is that you should be targeting for those. And as you do a few of them, you just get to know\n\n1:16:08.720 --> 1:16:12.640\n the pacing of it a little better. And then you start seeing more even split. So like, you know,\n\n1:16:12.640 --> 1:16:16.240\n their first two minute intervals pretty close within a couple seconds of their second, or,\n\n1:16:16.240 --> 1:16:19.920\n you know, I guess we'd be looking at distance if we're doing time. So like you went approximately\n\n1:16:19.920 --> 1:16:23.680\n the same distance on that last one as you did the first one. And then we're just looking for\n\n1:16:23.680 --> 1:16:29.200\n improvement over time. So, you know, we might spend four, six weeks kind of focusing on improving\n\n1:16:29.200 --> 1:16:33.680\n that we're going to still include kind of foundational running volume where you're going\n\n1:16:33.680 --> 1:16:37.200\n to be running like an easy pace and enjoyable pace kind of in the interim. And then there's going to\n\n1:16:37.200 --> 1:16:41.520\n be some rest days and that's going to be where the levels come in. My like level one plans are\n\n1:16:41.520 --> 1:16:45.680\n going to be like four day a week training plans. Level two are going to be five day level three\n\n1:16:45.680 --> 1:16:50.480\n are going to be six day with one day off. Um, and you can obviously operate outside of those,\n\n1:16:50.480 --> 1:16:53.520\n those, those are just the ones that I put up for the readymade when I'm coaching people kind of\n\n1:16:53.520 --> 1:16:57.680\n personalized. We just, we look at like what their history is with running their schedule,\n\n1:16:57.680 --> 1:17:01.840\n all sorts of stuff. Cause oftentimes people get hung up on like, well, what are the elites doing?\n\n1:17:01.840 --> 1:17:05.280\n What are the professionals doing? What are the Olympians doing? It's like, well, it's like what\n\n1:17:05.280 --> 1:17:08.880\n the Olympians are doing is they're waking up and they're living and breathing everything around\n\n1:17:08.880 --> 1:17:13.520\n this one race that they're going to do in four years. Or so it's like, we need to step away from\n\n1:17:13.520 --> 1:17:17.440\n that. If you're working, you know, 10 hours a day and you got kids and all this other stuff too. So,\n\n1:17:17.440 --> 1:17:22.160\n um, there's a lot of variables that make it more interesting to coach someone who's actually like\n\n1:17:22.160 --> 1:17:28.240\n not an elite athlete or someone who's a professional athlete, I should say, uh, the, but,\n\n1:17:28.240 --> 1:17:33.600\n but yeah, so they're, they're going to do that stuff. Those, those shorter intervals, um, for\n\n1:17:33.600 --> 1:17:37.920\n probably about like four to six weeks. If they're doing, if they're doing a longer race, like a\n\n1:17:37.920 --> 1:17:42.080\n hundred miles, if they were doing say a 5k, we'd start bringing those workouts in near the end of\n\n1:17:42.080 --> 1:17:45.280\n their plan. Cause that's going to be specific to their race pace. That's going to be the intensity\n\n1:17:45.280 --> 1:17:49.120\n that maybe they're doing for, you know, like a three K or a five K or something like that. So\n\n1:17:49.120 --> 1:17:53.360\n it's going to be more relative to what they're going to use. So it follows that philosophy.\n\n1:17:53.360 --> 1:17:58.640\n The plans follow that philosophy of weaknesses and least specific stuff early. And then we start\n\n1:17:58.640 --> 1:18:04.480\n phasing closer to most specific stuff and strengths as you get kind of near to the end of\n\n1:18:04.480 --> 1:18:09.200\n the plan. And then the distance of, or the time that you're going to spend out doing whatever event\n\n1:18:09.200 --> 1:18:13.040\n it is, is going to dictate how those kind of get ordered in there. I wonder if I could ask you for\n\n1:18:13.040 --> 1:18:21.600\n some sort of advice, maybe almost, uh, maybe look at me as a case study of a particular runner and\n\n1:18:21.600 --> 1:18:30.240\n runner and then see how we can plan stuff out. So which context to give. Okay. So I have been,\n\n1:18:30.240 --> 1:18:34.640\n first, let me say how much we're currently in Austin. I want to say how much I love Austin for\n\n1:18:34.640 --> 1:18:41.760\n many reasons. Uh, first and foremost, people are super kind and just like, there's so much love\n\n1:18:41.760 --> 1:18:46.640\n that I've experienced immediately when I came to the city versus many of the other cities I've been\n\n1:18:46.640 --> 1:18:53.920\n in. It's, uh, it's not quite as welcoming and full of kindness immediately. I mean, I really love,\n\n1:18:53.920 --> 1:18:57.680\n love it here in Austin. And because I've been going through a bunch of stressful stuff,\n\n1:18:58.240 --> 1:19:04.720\n I just kind of gave myself a chance to say, okay, I'm going to stick to a diet of carnivore, keto,\n\n1:19:05.280 --> 1:19:13.680\n but I'm going to eat as much as I want because, uh, primarily because just barbecue was part of\n\n1:19:13.680 --> 1:19:17.920\n the love I was getting here. And I was like, either I resist or just give in. And I decided\n\n1:19:17.920 --> 1:19:22.320\n to give in and actually use this as an opportunity to relax and have fun for the past three, four\n\n1:19:22.320 --> 1:19:27.280\n months, plus whiskey and so on. And then the training kind of all, I also let go of the\n\n1:19:27.280 --> 1:19:32.240\n training a little bit, just to relax, to really focus on the work, focus on the love I've been\n\n1:19:32.240 --> 1:19:37.600\n getting all those kinds of things. But now I just kind of want to set a goal for myself to get back\n\n1:19:37.600 --> 1:19:44.720\n into both competing and grappling, but also doing a, um, hanging out with David Goggins and, uh,\n\n1:19:44.720 --> 1:19:48.880\n doing a conversation with him, but almost this is my own personal kind of race that I'm looking\n\n1:19:48.880 --> 1:19:56.720\n forward to. And in terms of distance, that means running with David, uh, something like a marathon\n\n1:19:57.360 --> 1:20:05.120\n plus plus it's like, it's unclear what plus. So my goal would be to, uh, continue eating carnivore,\n\n1:20:05.120 --> 1:20:10.240\n which is a whole nother topic that I'd love to talk to you about. I feel great psychologically,\n\n1:20:10.240 --> 1:20:14.880\n sort of in terms of mental performance in my work when I eat carnivore and physically,\n\n1:20:14.880 --> 1:20:22.560\n I love it. I've never felt any kind of need for carbs to, uh, to improve performance in my running\n\n1:20:22.560 --> 1:20:26.880\n or anything else. Combine that with fasting, intermittent fasting, or eating once a day.\n\n1:20:26.880 --> 1:20:33.600\n I just, that's when I, uh, feel the best. What else? I also feel best. And this is something\n\n1:20:33.600 --> 1:20:39.520\n you can push back on. I feel best when I just run every day, like no breaks ever,\n\n1:20:40.320 --> 1:20:48.400\n and usually the same way every day. So like, I know this is suboptimal. It'd be interesting\n\n1:20:48.400 --> 1:20:53.680\n to hear your opinion of just how suboptimal that is. Uh, so I think that actually lays\n\n1:20:53.680 --> 1:20:58.880\n out like where my mind is. I'm happy eating carnivore once a day. I like running every day.\n\n1:20:58.880 --> 1:21:06.080\n Uh, the goal is to run a marathon in two months ish, two months plus, and then about three months\n\n1:21:06.080 --> 1:21:11.600\n to do a bunch of competitions and grappling. Okay. With those parameters, I think like you\n\n1:21:11.600 --> 1:21:15.600\n actually probably would be a great candidate for maximum heroic function training strategy.\n\n1:21:15.600 --> 1:21:20.640\n Like you want that consistency where I'm going to do the same thing each day. Uh, you don't want to\n\n1:21:20.640 --> 1:21:24.480\n beat yourself up so much any one day that you can't get out and do it the next one. That's the\n\n1:21:24.480 --> 1:21:30.240\n sweet spot with maximum heroic function is the, the, the trademark there is that you,\n\n1:21:30.240 --> 1:21:35.680\n you can keep going and keep doing it again and again and again, because as long as you're not,\n\n1:21:35.680 --> 1:21:39.040\n you know, going out one day and trying to do twice as much as what you're ready for, for that\n\n1:21:39.040 --> 1:21:43.040\n one specific, the key for you is going to be picking the right starting point and then building\n\n1:21:43.040 --> 1:21:50.560\n from there on what that day kind of entails in terms of how much running you do. So, um,\n\n1:21:50.560 --> 1:21:56.480\n where you could maybe get creative would be if you decided that it's a hard, fast rule that you run\n\n1:21:56.480 --> 1:22:02.720\n an hour every day, seven days a week. But we find out that to run your maximum robot function means\n\n1:22:02.720 --> 1:22:07.360\n you probably are better off sticking to 30 minutes. Then what you would maybe do is you would run\n\n1:22:07.920 --> 1:22:13.440\n underneath your maximum aerobic function for the first 15 minutes in the last 15 minutes,\n\n1:22:13.440 --> 1:22:17.360\n maybe throw some of those strides in there if you want to do that at the very end. Uh, and then that\n\n1:22:17.360 --> 1:22:23.120\n middle 30 minutes is going to be maximum road function target. And then maybe after, you know,\n\n1:22:23.120 --> 1:22:27.280\n four weeks, you start noticing, you know what, this 30 minutes isn't wearing me out near as much as\n\n1:22:27.280 --> 1:22:31.520\n it used to. Um, I feel like I could easily push past that. Well, let's up that to 40 minutes. So\n\n1:22:31.520 --> 1:22:35.760\n that 60, you're always staying within that 60 minute parameter that keeps your, your schedule\n\n1:22:35.760 --> 1:22:41.120\n consistent, your routine consistent. I'm wearing a heart rate monitor to sort of as I run to monitor\n\n1:22:41.120 --> 1:22:47.280\n it. Sure. You could do that. You could go perceived effort. Um, I like to use them in tandem in the\n\n1:22:47.280 --> 1:22:52.240\n sense that like early on, I'll maybe look at my heart rate a little more often, especially for\n\n1:22:52.240 --> 1:22:58.480\n shorter length. There is heart rate can get messy the longer you go. So I, I end up kind of maybe\n\n1:22:58.480 --> 1:23:03.680\n stepping away from heart rate a little more than some will at a certain point because I'm ultimately\n\n1:23:03.680 --> 1:23:07.840\n I'm going to be usually training or working with someone to run like, you know, a race that's really\n\n1:23:07.840 --> 1:23:12.560\n long and they get cardiac drift, dehydration, heat and things that are going to make the heart rate\n\n1:23:12.560 --> 1:23:18.240\n super messy. Yeah. But you're probably your ability to measure perceived effort is exceptionally good.\n\n1:23:18.240 --> 1:23:22.240\n Mine is actually really weak. Okay. Heart rate then I need to do the, still the work of connecting\n\n1:23:22.240 --> 1:23:26.640\n heart rate to the perceived effort. Yep. And that's exactly what I would use heart rate for then. And\n\n1:23:26.640 --> 1:23:32.320\n you'll get to a point probably by like in the first couple of months where you, you can still\n\n1:23:32.320 --> 1:23:36.080\n lean on heart rate if you want, but it'll be kind of one of those things where you keep\n\n1:23:36.080 --> 1:23:39.440\n looking at, you're like, Oh wow, I can guess it. And you play a game with yourself too. And you\n\n1:23:39.440 --> 1:23:44.560\n say, well, how close can I guess? You'll get it. So like for me, what I'll do is I'll do the run\n\n1:23:44.560 --> 1:23:47.840\n and then I'll look at the heart rate afterwards and be like, Oh cool. I was right there. Or I\n\n1:23:47.840 --> 1:23:51.200\n remember feeling like I was speeding up a little bit there and their show is right there on the\n\n1:23:51.200 --> 1:23:56.960\n heart rate or. I also love sort of something we haven't talked about. I love pushups and pull ups\n\n1:23:56.960 --> 1:24:02.320\n of like body weight workouts. Again, it's mostly mental. I just enjoy the mental challenge of it.\n\n1:24:02.320 --> 1:24:09.200\n I also like, it makes me feel like if all I'm doing is running, it makes me feel I'm not like.\n\n1:24:09.920 --> 1:24:10.880\n One dimensional.\n\n1:24:10.880 --> 1:24:16.640\n Yeah. One dimensional. I mean, there's some aspect to running that's not to be like hippie\n\n1:24:16.640 --> 1:24:20.880\n about it, but like, you know, you're, you're with nature, you're running in the, it's like,\n\n1:24:20.880 --> 1:24:25.360\n we're born to do this thing. And that same way, I feel like when I'm doing pushups and pull ups,\n\n1:24:25.840 --> 1:24:30.960\n I feel like I was born to do that kind of stuff. Like it's like this body weight exercise that\n\n1:24:30.960 --> 1:24:36.320\n is, body weight exercises have that way about them. It's, it doesn't have that dumbbell feel\n\n1:24:36.320 --> 1:24:41.440\n or doing bench press or squats, squats with weight. When you're just doing squats,\n\n1:24:42.720 --> 1:24:47.920\n body weight, we do pushups and pull ups, body weight, even just basic ab stuff, core stuff,\n\n1:24:47.920 --> 1:24:52.240\n body weight. I don't know. I just love the way I feel doing that. So it's usually,\n\n1:24:52.240 --> 1:24:55.520\n I forgot to mention that part. I combine that with the running afterwards,\n\n1:24:55.520 --> 1:24:57.120\n doing some basic body weight stuff.\n\n1:24:57.120 --> 1:25:02.160\n Yeah. And I think like you're going to get from, if we're not looking at it from like specifically,\n\n1:25:02.160 --> 1:25:09.360\n like training at a pace in order to get both the skeletal muscle adaptations, as well as the\n\n1:25:09.360 --> 1:25:13.520\n cardiovascular benefits, you're probably tapping into some of the higher intensity stuff with that\n\n1:25:13.520 --> 1:25:19.120\n body weight. So this, and unless you're doing, I guess no rest. Okay. So is it,\n\n1:25:19.120 --> 1:25:23.280\n you get pretty high heart rate from that. Yeah. Very hard. Okay. Higher than running. Yep.\n\n1:25:23.280 --> 1:25:28.960\n So you're checking that box there from just like a lifestyle, enjoyment, fitness,\n\n1:25:28.960 --> 1:25:34.240\n overall fitness standpoint. I think you want to keep your running more aerobic then because\n\n1:25:34.240 --> 1:25:37.920\n you're getting that and you're probably getting it from like your grappling workouts too,\n\n1:25:37.920 --> 1:25:44.720\n I would guess. So there's just not as big of a need for you from a big picture standpoint to be\n\n1:25:44.720 --> 1:25:50.480\n doubling down on that stuff with your runs as well. And it sounds like you prefer not to.\n\n1:25:50.480 --> 1:25:57.280\n Yeah. That's right. So I mean, what about the distance of marathon versus a hundred miles?\n\n1:25:57.280 --> 1:26:03.760\n Is that a big difference? What's a good goal to work towards? Is it marathon and the rest of it\n\n1:26:03.760 --> 1:26:08.880\n just takes care of itself? Yeah. So you want to do a marathon and then ultimately do a\n\n1:26:08.880 --> 1:26:13.680\n hundred mile after that? Is that what you're saying? I have no idea what the guy. Oh, so he's\n\n1:26:13.680 --> 1:26:17.360\n going to tell you spot on what you're doing. So you have to be ready for anything. For anything.\n\n1:26:17.360 --> 1:26:24.320\n Right. My own personal goal is to feel somewhat challenged, but comfortable running a marathon.\n\n1:26:24.320 --> 1:26:30.320\n The longest I've ever run is 22 miles, but there's been many stretches of my life where I would\n\n1:26:30.320 --> 1:26:37.120\n regularly run. Like the long run would be close to 20 miles. And then I was comfortably running 10\n\n1:26:37.120 --> 1:26:44.800\n miles four months ago. Feels like forever ago. Until I injured myself a little bit by running\n\n1:26:44.800 --> 1:26:49.680\n in the snow and stubbing my toe to where it was like, you don't realize how much you appreciate\n\n1:26:49.680 --> 1:26:57.360\n your toes until you stub them. That big toes where all that power comes off. And so it was surprising\n\n1:26:57.360 --> 1:27:03.200\n how long it took to heal and how essential it was and how unpleasant running, how much I hated\n\n1:27:03.200 --> 1:27:07.840\n running with it. And then I kept like coming, trying to get back out there to run to think,\n\n1:27:07.840 --> 1:27:13.120\n I think it's okay. And no, it's not okay. You really need to let it fully heal. At least that\n\n1:27:13.120 --> 1:27:17.600\n was my experience. I couldn't like just suck it up. It was making it worse every time. And one of\n\n1:27:17.600 --> 1:27:23.440\n those injuries that could really feel, even though it's so small, but it's essential. So is there any\n\n1:27:23.440 --> 1:27:28.720\n difference between the goal of marathon or a hundred miles? Would you say, should I be prepping\n\n1:27:28.720 --> 1:27:33.520\n for a hundred miles if that's at all a possibility? The big difference is going to be like you're\n\n1:27:33.520 --> 1:27:38.080\n dropping intensity significantly by going up to a hundred miles versus the marathon. So\n\n1:27:38.640 --> 1:27:42.400\n the maximum aerobic function I think is actually going to feed into that maybe a little bit better.\n\n1:27:42.400 --> 1:27:49.920\n It's probably gonna be a little closer. It all varies a bit because people will focus on specific\n\n1:27:49.920 --> 1:27:58.160\n distances and they'll get very efficient and very adapted to that. So it's what makes running kind\n\n1:27:58.160 --> 1:28:04.480\n of messy where you'll get, for example, the average person can hit their lactate threshold\n\n1:28:04.480 --> 1:28:08.400\n for probably about 60 minutes or something like that. Whereas you get these elite marathoners\n\n1:28:08.400 --> 1:28:12.880\n who've been basically spending their entire life preparing for a marathon race. They can push\n\n1:28:13.440 --> 1:28:18.080\n almost up to their lactate threshold and after lactate threshold for almost like two hours.\n\n1:28:18.080 --> 1:28:23.520\n So it gets a little messy when you start looking at it from that lens, but you're,\n\n1:28:23.520 --> 1:28:27.120\n you don't really have to worry about that too much because you're not really focusing on being\n\n1:28:27.120 --> 1:28:31.280\n the best possible hundred mile or the best possible marathon. Or you could be, you want\n\n1:28:31.280 --> 1:28:36.320\n enough overall fitness that you can just do either one of them without absolute misery because you\n\n1:28:36.320 --> 1:28:42.400\n did the couch to a hundred miles. So I think like for a hundred miles, the biggest difference I think\n\n1:28:42.400 --> 1:28:47.040\n given your context is just like the more physical things you are doing, the better prepared you're\n\n1:28:47.040 --> 1:28:53.200\n going to be for the hundred mile. So it's almost given your context. I wouldn't say irrelevant.\n\n1:28:53.200 --> 1:28:56.320\n You want to be doing running, but you're going to be doing that. Once you put it in your program,\n\n1:28:56.320 --> 1:29:04.800\n it sounds like it's going to be pretty locked in. If you view it this way, it's probably going to\n\n1:29:04.800 --> 1:29:10.800\n be more mentally beneficial to where, Hey, today I did my run. I did my body weight exercises. I\n\n1:29:10.800 --> 1:29:16.000\n did some grappling practice. You know, I spent three hours working out today. If you think of\n\n1:29:16.000 --> 1:29:21.760\n it like that, then you know, you're, you're moving your body, you're doing things that are active for\n\n1:29:21.760 --> 1:29:27.120\n a good chunk of the day, especially relative to most people. So that's going to actually be very\n\n1:29:27.120 --> 1:29:32.560\n helpful for you. Uh, the, the problem or the, the, the battle to get over is going to just be like\n\n1:29:32.560 --> 1:29:37.040\n the, you know, you're going to break down physically running a hundred miles and you're\n\n1:29:37.040 --> 1:29:42.560\n gonna break down physically running a marathon too. So like the, you might just have to push\n\n1:29:42.560 --> 1:29:47.040\n through a little more discomfort, like from a physical standpoint compared to be a few decided\n\n1:29:47.040 --> 1:29:53.440\n I'm gonna do everything I can in these next like 24 weeks to be able to run a, a full hundred,\n\n1:29:54.160 --> 1:30:00.400\n a hundred miler. Would you say it's physical or is it mental discomfort? Like, uh, I mean,\n\n1:30:00.400 --> 1:30:05.600\n isn't everything physically uncomfortable? Like what, uh, do you train for if you're training for\n\n1:30:06.800 --> 1:30:11.120\n the chaos of, uh, so it's not necessarily the hundred miles. It's the chaos of the unexpected,\n\n1:30:11.120 --> 1:30:15.840\n which might include a hundred miles, but it might also include a thousand pushups in my case. So\n\n1:30:15.840 --> 1:30:19.680\n like, you need a bit jack of all trades is what you need to be. But also like building up the\n\n1:30:19.680 --> 1:30:27.200\n confidence or maybe not. I don't know. How do you survive a thousand pushups? It's combination of\n\n1:30:27.200 --> 1:30:32.240\n confidence that you have to know that you can do that kind of thing. Not necessarily the actual\n\n1:30:32.240 --> 1:30:42.160\n number, but like doing crazy stuff. And the, the second is probably the base strength and endurance\n\n1:30:43.120 --> 1:30:49.360\n and also just the practicing that process of not quitting. I feel like that's one of the things I\n\n1:30:49.360 --> 1:30:53.840\n really need to do in the running space is like doing slightly unpleasant things where I'm\n\n1:30:53.840 --> 1:30:59.840\n yeah, practicing that, like bringing my mind back and saying, Nope, uh, I'm going to keep doing it.\n\n1:30:59.840 --> 1:31:04.880\n And part of the running every day has that benefit because some days you really don't want to feel,\n\n1:31:04.880 --> 1:31:08.480\n don't feel like running and doing that. Then you're practicing that muscle of,\n\n1:31:08.480 --> 1:31:14.400\n um, of doing it anyway. Um, I don't know if there's something you can say in terms of advice,\n\n1:31:14.400 --> 1:31:21.040\n how to practice the, like doing something unpleasant every day frequently. Yeah. What\n\n1:31:21.040 --> 1:31:27.840\n I would do with that is I would try to make the unpleasant thing be different from one day to the\n\n1:31:27.840 --> 1:31:34.480\n next if you can. So the fear I would have with making running unpleasant every time would be,\n\n1:31:35.200 --> 1:31:41.760\n it becomes like a negative feedback loop in your physiologically potentially as well as mentally,\n\n1:31:41.760 --> 1:31:48.000\n where if the entire running process is miserable, you're going to be miserable when you step on that\n\n1:31:48.000 --> 1:31:51.920\n starting line, whether it's a marathon or a hundred miles. So you've trained yourself that\n\n1:31:51.920 --> 1:31:56.240\n running equals miserable. Well, and here's the thing. Like if you look at just like,\n\n1:31:56.240 --> 1:32:01.840\n here's where the literature says on paper are like the dozen workouts you should do in a training\n\n1:32:01.840 --> 1:32:06.240\n plan. And this is how you should structure them right down to the minute. And you just say,\n\n1:32:06.240 --> 1:32:10.320\n like, I'm going to give everyone this schedule and they're going to do this every time rinse\n\n1:32:10.320 --> 1:32:16.800\n and repeat. My biggest concern with that approach is you are potentially putting them in a position\n\n1:32:16.800 --> 1:32:23.600\n where the training is so boring and so monotonous that like if they hit a roadblock mentally,\n\n1:32:23.600 --> 1:32:27.360\n they're going to fall apart very quick because they've already exhausted themselves mentally,\n\n1:32:27.360 --> 1:32:32.400\n just trying to do the same old interval every time doing the same old workout. And it doesn't\n\n1:32:32.400 --> 1:32:37.520\n necessarily have to be like one specific plan in its entirety could just be like,\n\n1:32:37.520 --> 1:32:41.840\n like the, the mix of things within it. So like, rather than like, if I just said, do,\n\n1:32:41.840 --> 1:32:46.000\n oh, we're going to do three minute intervals, this entire short interval process or two minute\n\n1:32:46.000 --> 1:32:51.360\n intervals or four minute intervals or 62nd intervals, you know, by that sixth week,\n\n1:32:51.360 --> 1:32:54.960\n they might be so sick of that, that they're not actually maximizing their potential within that\n\n1:32:54.960 --> 1:32:59.680\n because there's no flavor there. And, and then they're also actually getting less out of themselves\n\n1:32:59.680 --> 1:33:03.680\n than they would if we just got a little more creative and said, okay, let's mix this up and\n\n1:33:03.680 --> 1:33:09.120\n let's do, uh, you know, for one minute intervals, then take a little bit of a break and then we'll\n\n1:33:09.120 --> 1:33:12.800\n do three minute intervals or at least changing it up from week to week so that they have something\n\n1:33:12.800 --> 1:33:16.320\n different showing up, even though we're addressing the same kind of physiological adaptation.\n\n1:33:17.040 --> 1:33:22.240\n Uh, so like, I think what you want to do is you want to introduce the misery. You want to be able\n\n1:33:22.240 --> 1:33:26.240\n to test yourself to the degree where like, when you can recognize these points of, I don't want\n\n1:33:26.240 --> 1:33:33.360\n to be here, but I can do it and push through it, but recognize that like, there's not necessarily\n\n1:33:33.360 --> 1:33:37.360\n going to be one event that you want to lean on to get that from because you won't want to make that\n\n1:33:37.360 --> 1:33:41.440\n one event so miserable that you don't want to do it when it comes time for the challenge. So\n\n1:33:41.440 --> 1:33:48.480\n if you can possibly say like, okay, on Tuesdays, the pushup workout, I'm going to go 10 pushups\n\n1:33:48.480 --> 1:33:51.520\n more than I want to. I'm going to get to that point where I'm like, there's no more. And then\n\n1:33:51.520 --> 1:33:56.320\n I'm going to do 10 more and you're going to make that one miserable. And then maybe on, uh, you\n\n1:33:56.320 --> 1:34:01.120\n know, Thursdays you decide to do like some of those sprints or something at the end where\n\n1:34:01.680 --> 1:34:05.040\n you do a few of them and you're like, okay, this is where I'd be comfortable to stop. Like, well,\n\n1:34:05.040 --> 1:34:07.280\n I'm going to do two more of them because I know I don't want to do two more of them,\n\n1:34:07.280 --> 1:34:12.800\n um, but mix that up. So you're not, so at least you're getting enjoyment from some of it and not\n\n1:34:12.800 --> 1:34:17.840\n just getting complete disgust from the entire process. There's actually quite a lot of ways\n\n1:34:17.840 --> 1:34:23.840\n that I can introduce misery into the running, get creative, including, um, you know, even just like\n\n1:34:23.840 --> 1:34:27.280\n stuff outside of the running, like taking a freezing cold showers, those kinds of things,\n\n1:34:27.280 --> 1:34:33.760\n just introducing random kind of chaos into the, into the system, um, or having conversations with\n\n1:34:33.760 --> 1:34:43.200\n people as an introvert. It's terrifying. More podcasts. So, um, now starting, uh, the training\n\n1:34:43.200 --> 1:34:48.560\n and, uh, Zach, you've been kind enough to also kind of, um, be willing to help me out throughout\n\n1:34:48.560 --> 1:34:53.520\n this process. So I look forward to where that goes. It's kind of, uh, fascinating. Um, on the\n\n1:34:53.520 --> 1:35:00.640\n diet side, you're, uh, one of, one of the many things that, uh, make you fascinating is, uh,\n\n1:35:00.640 --> 1:35:06.000\n you've played with diet as well and you're, um, somewhat famous, I would say, for doing low carb\n\n1:35:06.000 --> 1:35:11.360\n or playing with low carb or meat based diets. Can you describe the potential, like how you're\n\n1:35:11.360 --> 1:35:17.760\n thinking about that has evolved and the potential beneficial role of a carnivore diet or keto diet\n\n1:35:17.760 --> 1:35:22.400\n or a meat based diet in training as an ultra marathon runner? Yeah. And I think like where\n\n1:35:22.400 --> 1:35:26.720\n a lot of times things get confusing for people here is the context of it too, where it's like,\n\n1:35:26.720 --> 1:35:32.320\n they want an answer as to what do I eat for endurance sport? And it's like, well, endurance\n\n1:35:32.320 --> 1:35:36.720\n sport is quite wide ranging as we've talked about many, many times here. So there's going to be\n\n1:35:36.720 --> 1:35:42.640\n differences, I think, in just like what you want to maybe necessarily prioritize, uh, both for the\n\n1:35:42.640 --> 1:35:46.400\n event you're doing and the intensity that's required for it, the training that's required\n\n1:35:46.400 --> 1:35:50.080\n for that event. And then also the individual component too, where I think this one often\n\n1:35:50.080 --> 1:35:55.840\n gets overlooked, where we tend to say like, well, we've got all these Olympic medalists\n\n1:35:55.840 --> 1:36:01.920\n at the marathon and below distance who are, you know, eating a moderate to high carbohydrate diet.\n\n1:36:01.920 --> 1:36:06.400\n So everyone needs to do that if they want to reach their potential in, you know,\n\n1:36:06.400 --> 1:36:11.840\n say the three K to the marathon. And, you know, in a perfect world, maybe that would be true,\n\n1:36:12.400 --> 1:36:17.520\n but there's a lot of other variables that often get forgotten then that could positively or\n\n1:36:17.520 --> 1:36:22.560\n negatively impact that decision choice. So I think Dr. Jeff Volk has done a great job of kind of\n\n1:36:22.560 --> 1:36:26.320\n highlighting this in the sense that, you know, when he works with people, he works with people\n\n1:36:26.320 --> 1:36:30.560\n in the health sphere as well as the performance sphere. And, you know, he's one of the main guys\n\n1:36:30.560 --> 1:36:36.160\n at Virta health who's, uh, they've got like a 60% success rate with working with folks with the\n\n1:36:36.160 --> 1:36:42.960\n type two diabetes to, um, reverse their type two diabetes. Uh, and I mean, that's an astounding,\n\n1:36:42.960 --> 1:36:47.200\n when you, when you think of just any nutritional protocol, its success rate, they're all incredibly\n\n1:36:47.200 --> 1:36:52.480\n low. They're very, very low. And the big difference with his is the coaching aspect of it. Like the\n\n1:36:52.480 --> 1:36:56.320\n give support. So these people like have someone to turn to when they make a mistake, or if they're\n\n1:36:56.320 --> 1:37:00.160\n thinking about doing something differently, or they don't know what to do rather than just kind\n\n1:37:00.160 --> 1:37:04.560\n of throwing, throwing it all up in the air and quitting. They, they, they have a resource there.\n\n1:37:04.560 --> 1:37:07.520\n And that's probably a big reason why that's the success rate that they have with that,\n\n1:37:07.520 --> 1:37:12.720\n is they put those support mechanisms in place. That picture needs to be carried into the\n\n1:37:12.720 --> 1:37:18.080\n performance world or the running world too, where, you know, we may have just been identifying\n\n1:37:18.080 --> 1:37:26.160\n that, uh, you know, Olympic distance athletes that can tolerate a very large portion of their diet\n\n1:37:26.160 --> 1:37:31.920\n coming from carbohydrate is going to just, it's going to filter those ones towards the Olympics\n\n1:37:31.920 --> 1:37:38.320\n filter those towards interesting. Yeah. And that doesn't mean that like, uh, if we would have taken\n\n1:37:38.320 --> 1:37:42.240\n say the gold medals in the five came, put them on a low carb diet, they'd run faster. They probably\n\n1:37:42.240 --> 1:37:45.840\n wouldn't, because we may have already selected that that person's thriving on carbohydrate.\n\n1:37:45.840 --> 1:37:50.640\n Uh, what I would be interested in is like, you have, let's say we have someone with equal talent,\n\n1:37:50.640 --> 1:37:56.400\n but got weeded out along the way potentially because for whatever reason, they just weren't\n\n1:37:56.400 --> 1:38:00.240\n able to tolerate like the, both the training and the nutrition requirements that they're being told\n\n1:38:00.240 --> 1:38:04.560\n to do. So the coaches can, there's a culture where the coaches would really push a carb heavy diet\n\n1:38:04.560 --> 1:38:11.600\n and that that would in itself would do the filtering process of people that are not,\n\n1:38:11.600 --> 1:38:16.160\n it would filter out the people that are not able to tolerate carbs as part of their training.\n\n1:38:16.160 --> 1:38:20.880\n I mean, I might be an example of this actually where, you know, you take someone where, uh,\n\n1:38:20.880 --> 1:38:24.560\n they, for whatever reason, the carbs aren't working for them. Like it's unsustainable for them to\n\n1:38:24.560 --> 1:38:27.920\n continue that path. Or if they do, they might have a shortened career, so they might be able to eke\n\n1:38:27.920 --> 1:38:30.560\n out a few really good years, but then, you know, they're not going to be the person they're like,\n\n1:38:30.560 --> 1:38:36.080\n wow, that person's 38 and they're still competing at the Olympics type of a person. Uh, and, you\n\n1:38:36.080 --> 1:38:41.760\n know, you, you, you put them on a low carb diet, uh, if you can control everything else, like their\n\n1:38:41.760 --> 1:38:49.120\n entire lifestyle is based around training and racing, then, uh, you know, they may still have\n\n1:38:49.120 --> 1:38:55.760\n better potential by introducing carbohydrates at a higher level. But if that's not going to,\n\n1:38:55.760 --> 1:38:59.920\n if that's not going to be sustainable for them as a person, then, you know,\n\n1:38:59.920 --> 1:39:04.800\n what's the point kind of at that, unless they want to be like a kind of a spark in the pan,\n\n1:39:04.800 --> 1:39:09.680\n so to speak. I just feel good eating meat performance wise. Well, I think there's that\n\n1:39:09.680 --> 1:39:14.480\n group too. And they may just not be the Olympians. Yeah. And so we're not talking,\n\n1:39:15.440 --> 1:39:20.640\n I guess this conversation has several layers. One is for the Olympics and one is for like,\n\n1:39:22.000 --> 1:39:28.000\n what is it? Active athletes that are like amateurs, whatever, whatever category I\n\n1:39:28.000 --> 1:39:33.760\n put myself into, like people that exercise regularly. And then, um, maybe people,\n\n1:39:33.760 --> 1:39:39.840\n and then there's people who like exercise rarely. So on all of those fronts, I mean,\n\n1:39:40.560 --> 1:39:47.840\n do you think it's possible to live a happy, uh, active life eating meat only or mostly meat?\n\n1:39:48.400 --> 1:39:52.560\n Yeah. What have you learned about this? Yeah. I think, uh, so for, for some context,\n\n1:39:52.560 --> 1:39:56.720\n like I followed what I would call a low carbohydrate diet for the last 10 years.\n\n1:39:56.720 --> 1:40:01.840\n And just like kind of the training, I periodize it to a degree where there are parts of my training\n\n1:40:01.840 --> 1:40:05.600\n where I do bring back a little more carbohydrate. And there's periods of my training, especially\n\n1:40:05.600 --> 1:40:09.920\n like the off season where I'm like very low and I might be like kind of in that ballpark of, uh,\n\n1:40:09.920 --> 1:40:14.800\n like, you know, ketogenic, strict ketogenic or no carbohydrates for, for periods of time.\n\n1:40:14.800 --> 1:40:18.880\n And what kind of food are we talking about? What's a strict low carb diet?\n\n1:40:18.880 --> 1:40:23.760\n I've ranged everywhere from like mostly plant based, low carb keto to like mostly animal based.\n\n1:40:23.760 --> 1:40:30.640\n I very rarely gone much more than like two weeks strict where it's like I'm strict carnivore or\n\n1:40:30.640 --> 1:40:34.640\n strict plant based or anything like that. Like we're talking probably more like 95%\n\n1:40:35.440 --> 1:40:42.320\n at the, at the peak. Um, in terms of any type of like, like longer lasting, uh, from my personal\n\n1:40:42.320 --> 1:40:47.440\n experience of like being like either in like the animal food camp or her, like the plant based camp\n\n1:40:47.440 --> 1:40:52.480\n kind of a, of a process. Um, so I've tried all of them, things that stayed consistent over the 10\n\n1:40:52.480 --> 1:40:56.400\n years as a kind of the macro nutrient profile that I've done throughout the course. So one\n\n1:40:56.400 --> 1:41:00.000\n didn't win over the other in terms of meat based versus plant based. Oh, for me, meat based,\n\n1:41:00.000 --> 1:41:04.640\n definitely. What was, I mean, I was, I was my highest meat consumption in 2019 and that was\n\n1:41:04.640 --> 1:41:08.960\n by far my best racing season. Yeah. We keep, we keep coming back to that year. That was a good\n\n1:41:08.960 --> 1:41:13.200\n year for many reasons, philosophically and nutritionally. Yeah. Well in 2020 happened and\n\n1:41:13.200 --> 1:41:18.400\n now I haven't had a really good chance to, to, uh, to improve. We'll see. Hopefully I've got some\n\n1:41:18.400 --> 1:41:23.520\n more, some more in the tank. That's strange. There's so most athletes that compete at your level\n\n1:41:23.520 --> 1:41:29.920\n have more carbs integrated into their diets. So what have you learned about using meat in a high\n\n1:41:29.920 --> 1:41:35.200\n performance? I think it's maybe less about the meat and it's more about like, what are you,\n\n1:41:35.200 --> 1:41:43.680\n what is it replacing? So if we go, if we step away from like me specifically and just like the people\n\n1:41:43.680 --> 1:41:47.280\n that, cause I mean, we're getting to the point where I get it's anecdotes, but like, like that's\n\n1:41:47.280 --> 1:41:51.040\n what we have at the moment. Cause there's, I mean, there is actually a study being done on, like,\n\n1:41:51.040 --> 1:41:55.600\n I think I guess they'd call it hypercarnivore where they're like, I think above 80% of their\n\n1:41:55.600 --> 1:42:01.040\n intake from meat. Um, and they're looking at a few different things there, but it's so weird\n\n1:42:01.040 --> 1:42:07.280\n and I keep interrupting, but it's so weird that it sounds unhealthy, uh, hypercarnivore. Yeah. But\n\n1:42:07.280 --> 1:42:14.080\n it makes me feel really good. So I, that's the individual thing, right? There's countless people\n\n1:42:14.080 --> 1:42:19.600\n now who like, and I'm not saying that they could not have found another route, myself included,\n\n1:42:19.600 --> 1:42:24.880\n like in 2011, when I switched from moderate to high carbohydrate to low carbohydrate and saw some\n\n1:42:24.880 --> 1:42:30.720\n very noticeable differences in the way I felt, the way I performed in all this stuff, that doesn't\n\n1:42:30.720 --> 1:42:38.080\n mean that there wasn't another path. I just did not find that path. And the, the, the fact that\n\n1:42:38.080 --> 1:42:42.320\n I found a path that was producing the results I was looking for is really all that matters in my\n\n1:42:42.320 --> 1:42:46.880\n mind. You know, like I don't really care if there was a parallel path that works just as well or,\n\n1:42:46.880 --> 1:42:52.480\n you know, something like that, because ultimately we only have one shot at everything we're doing.\n\n1:42:52.480 --> 1:42:55.840\n So like, it'd be great if I could go back and try four or five different things. Well,\n\n1:42:55.840 --> 1:43:00.640\n the annoying thing is that the body adjusts to whatever the heck you're doing. So you can't,\n\n1:43:00.640 --> 1:43:04.880\n it's hard to do good science even on yourself. Yeah. I've referenced my 2019 racing season a few\n\n1:43:04.880 --> 1:43:09.360\n times and it's like, it'd be silly for me to put all of the emphasis on my nutrition plan for that,\n\n1:43:09.360 --> 1:43:14.640\n because it's also comes with two decades of endurance training. So it's possible and it's\n\n1:43:14.640 --> 1:43:19.040\n it's possible. And it's very likely that a huge portion of that success was just the culmination\n\n1:43:19.040 --> 1:43:23.920\n of a lot of work over time from the training side of things. I just think like anytime you hyper\n\n1:43:23.920 --> 1:43:29.680\n focus on one area or pick a couple of variables and just target those, you find yourself in a\n\n1:43:29.680 --> 1:43:34.320\n position where you are, you're putting other things in the most uncharitable light possible.\n\n1:43:35.440 --> 1:43:40.160\n So, so then you have this situation where like, it's actually a combination of a variety of\n\n1:43:40.160 --> 1:43:45.600\n different things. So where are the big movers? And you know, for me, nutritional shift was pretty\n\n1:43:45.600 --> 1:43:51.600\n clear that that improved my sleep and my recovery. And I mean, people can say, well, there's the\n\n1:43:51.600 --> 1:43:56.800\n placebo effect, which is a very real concern. But you know, for me personally, a 10 year placebo\n\n1:43:56.800 --> 1:44:03.120\n effect would be a quite lengthy placebo effect. And I do think it's individual, though I emphasize\n\n1:44:03.120 --> 1:44:07.440\n that a lot because I mean, I've worked with tons of people with this and I do see a range from\n\n1:44:07.440 --> 1:44:13.360\n person to person. I've worked with people who come to me and they're like strict keto and we raise up\n\n1:44:13.360 --> 1:44:18.320\n their carbohydrates a bit. And they're like, okay, I feel way better doing it this way. And I've worked\n\n1:44:18.320 --> 1:44:22.000\n with people who they come to me moderate carbohydrate, but they're interested enough.\n\n1:44:23.200 --> 1:44:28.080\n They want to try a lower carb. So we, you know, we titrate them down and I've had clients where\n\n1:44:28.080 --> 1:44:32.080\n I'm like, okay, I'm gonna give them this workout. And they're gonna wish they brought back a little\n\n1:44:32.080 --> 1:44:36.400\n bit of carbohydrate. And then they go and they nail the workout. And I'm just like baffled that\n\n1:44:36.400 --> 1:44:39.440\n because because they're different from me. And every time, you know, when you have your own\n\n1:44:39.440 --> 1:44:45.280\n personal experience, the first guttural response is, oh, if I had done it, it would have gone this\n\n1:44:45.280 --> 1:44:48.960\n way. Why did it go the complete opposite way for them? And you kind of have to just kind of step\n\n1:44:48.960 --> 1:44:53.600\n out of your own perspective a bit and say like, okay, well they're different, you know, for\n\n1:44:53.600 --> 1:44:58.720\n whatever reason they're getting, getting along like this. I've had like several moments in my\n\n1:44:58.720 --> 1:45:04.880\n life where you kind of realize the body is weird and it's weirder than the average advice. Like\n\n1:45:04.880 --> 1:45:12.960\n one of them is how well I perform for my own standards when I fast. First of all, intellectually,\n\n1:45:12.960 --> 1:45:18.880\n but that's more known and understandable. But like physically, the fact that I could train,\n\n1:45:18.880 --> 1:45:26.160\n like not eat 20 hours, 24 hours, and then do a hard like jiu jitsu session for like two hours,\n\n1:45:26.800 --> 1:45:33.040\n like hard. It's incredible to me. Like this makes no sense. Cause I used to eat like many times a\n\n1:45:33.040 --> 1:45:37.280\n day. Of course you have to eat, like you don't want to eat too close to the training session\n\n1:45:37.280 --> 1:45:41.760\n was my thinking, but you definitely need to load up on carbs like three hours before they can,\n\n1:45:41.760 --> 1:45:47.680\n in order to have enough energy. The fact that I could not eat and have like incredible focus,\n\n1:45:47.680 --> 1:45:54.240\n but also athleticism, like both endurance and explosive. I mean, jiu jitsu is a special thing.\n\n1:45:54.240 --> 1:45:58.560\n It's like more like chess. It's not like powerlifting, no, not powerlifting, Olympic\n\n1:45:58.560 --> 1:46:04.000\n lifting, where it's like true explosiveness, but that's fascinating. And it makes me wonder like,\n\n1:46:04.000 --> 1:46:11.040\n what other things are there to discover about yourself? The annoying thing about food is it's\n\n1:46:11.040 --> 1:46:17.760\n delicious. And so it's hard to do good science on yourself, like to do, you know, for two weeks or\n\n1:46:17.760 --> 1:46:25.520\n a month to do like strict no carbs. And then maybe next month you add 20 grams or 40 grams of carbs\n\n1:46:25.520 --> 1:46:31.040\n and see how you actually feel. Not like in that moment, but over a period of several weeks and\n\n1:46:31.040 --> 1:46:36.800\n then doing everything else right with based on best available science, like with electrolytes\n\n1:46:36.800 --> 1:46:41.600\n and then vitamins, but then also like remove all the humans from your life that affect you\n\n1:46:41.600 --> 1:46:45.760\n positively or negatively. Cause you might feel amazing because you're hanging out with cool\n\n1:46:45.760 --> 1:46:51.680\n people and then, you know, like removing basically all the variables. It's kind of fascinating. And\n\n1:46:51.680 --> 1:46:57.200\n you kind of, all of us land in a place where we find something that worked for us. And then we\n\n1:46:57.200 --> 1:47:03.360\n maybe use some of the placebo effect to help us out, to stick in that place. And then I suppose\n\n1:47:03.360 --> 1:47:07.760\n that's the way to live life. I guess it's impossible to find the optimal for any of us,\n\n1:47:07.760 --> 1:47:16.240\n but carnivore is an interesting new kind of caveat, a new challenge to the nutritional community,\n\n1:47:16.240 --> 1:47:19.920\n because more and more people seem to be doing well under carnivore.\n\n1:47:19.920 --> 1:47:24.320\n Yeah. Well, the nutrition community is probably like, we just got done like dealing with the\n\n1:47:24.320 --> 1:47:28.720\n vegans and now we got this opposite end of the spectrum coming at us. But I think, well, I mean,\n\n1:47:28.720 --> 1:47:35.920\n what this all tells, what this all tells me is like, there is a, for one, like in our food\n\n1:47:35.920 --> 1:47:41.440\n environment, like the failure rate of any one approach at a population level is going to be\n\n1:47:41.440 --> 1:47:46.560\n incredibly high. I mean, it's why we have, you know, what is it like 88% of the population has\n\n1:47:46.560 --> 1:47:50.800\n some sort of like metabolic syndrome. And it's, it's like, you know, it's because there's an\n\n1:47:50.800 --> 1:47:56.240\n endless quantity of everything that you can get your hands on for relatively cheap. And I think\n\n1:47:56.240 --> 1:48:02.480\n that's, that, that presents a problem. If your mindset is going to be, we need this set of\n\n1:48:02.480 --> 1:48:07.760\n parameters for nutrition and everyone needs to adhere to that or you're wrong. And it's like,\n\n1:48:07.760 --> 1:48:13.280\n well tell that to the person who like went carnivore and cleared up some like crazy skin\n\n1:48:13.280 --> 1:48:18.960\n ailment or something like that. That's a weird one. Like where the carnivore seems to treat like,\n\n1:48:19.520 --> 1:48:24.640\n like depression, like mental stuff. It's fascinating. There's all these stories. Again,\n\n1:48:25.200 --> 1:48:31.440\n it's anecdotes, but it's like the mental one, I think may, I'm stepping out a bit on a limb here,\n\n1:48:31.440 --> 1:48:37.360\n but I want to say like some of the research of Dominic DiAgostino and Jeff Volokh was looking at\n\n1:48:37.360 --> 1:48:43.520\n the ketogenic diet, which of carnivore diet is basically going to be a part of a ketogenic. I\n\n1:48:43.520 --> 1:48:48.560\n mean, you could always go like way too high on the protein, I guess, but most people that I see\n\n1:48:48.560 --> 1:48:54.320\n doing carnivore, they're cognizant enough that at least if they're doing it for therapeutic reasons,\n\n1:48:54.320 --> 1:49:00.240\n they're not going like, you know, 50% protein, 50%. They're more like 70, 30, 80, 20, something\n\n1:49:00.240 --> 1:49:07.440\n like that. And, and I think like you, you do see some, some work with like the brain. So the mental\n\n1:49:07.440 --> 1:49:12.800\n stuff, I know some of the, I'm not sure if this was part of the DARPA funding that, that Dr.\n\n1:49:13.440 --> 1:49:18.240\n Dominic DiAgostino had where they were looking at things like mental stuff, like post traumatic\n\n1:49:18.240 --> 1:49:22.720\n stress disorder and that sort of stuff with, with like a strict ketogenic diet. So I wonder if some\n\n1:49:22.720 --> 1:49:26.960\n of that, like the depression related stuff has to do with that, where now like their body is just\n\n1:49:26.960 --> 1:49:31.600\n fueling their brain differently than maybe they were in the past, but that's just, you know,\n\n1:49:31.600 --> 1:49:36.800\n wild guesses on my part. And I'm deviating from the conversation, but like, no, that's brilliant.\n\n1:49:36.800 --> 1:49:42.800\n In terms of your own story on food, can you say something? I think we were kind of referring to\n\n1:49:42.800 --> 1:49:50.560\n diet broadly. Can you say something about how you like to fuel your like, whether it's race or great\n\n1:49:50.560 --> 1:49:58.400\n training sessions, like maybe the day before, let's go even that far during, and maybe a few\n\n1:49:58.400 --> 1:50:04.480\n hours after. Okay. It'll be a little different for racing than it will be for like a big workout,\n\n1:50:04.480 --> 1:50:08.400\n just because the interesting thing about ultra running is just like, you never do the race even\n\n1:50:08.400 --> 1:50:11.600\n like most endurance races, you're going to cover the distance. You're going to replicate the race\n\n1:50:11.600 --> 1:50:16.880\n almost up to it in training. Whereas with a hundred miles, you can't, you might replicate a\n\n1:50:16.880 --> 1:50:21.680\n third of it. So, so I'll do, I'll walk you through kind of my approach for, for like a hundred mile\n\n1:50:21.680 --> 1:50:26.480\n race. And I can tell you maybe what I would do differently on like a training day. But yeah, so\n\n1:50:26.480 --> 1:50:33.200\n for where, where the community is an agreement is that you do want to be very good at burning fat\n\n1:50:33.200 --> 1:50:38.400\n for ultra marathons. I mean, there's just like the intensity is low. If your, if your ratios are\n\n1:50:38.400 --> 1:50:47.040\n skewed very high towards carbohydrate metabolism, then you're going to have to defend your muscle\n\n1:50:47.040 --> 1:50:52.320\n glycogen through tons of carbohydrate consumption. And that's just going to be very hard to do over\n\n1:50:52.320 --> 1:50:56.960\n the course of an entire day, even at low intensities. So it's a fuel tank thing. I mean,\n\n1:50:56.960 --> 1:51:00.640\n it's like your, your leanest endurance athletes have way more fat than they do. Glycogen stores.\n\n1:51:01.360 --> 1:51:05.120\n When you're doing the low intensity performance, you want to be burning high levels of fat and\n\n1:51:05.120 --> 1:51:11.200\n sparing that muscle glycogen. What I tend to do is I want to start the race burning really high\n\n1:51:11.200 --> 1:51:15.520\n levels of fat. So I'm going to, I'll maybe have some carbohydrate the night before for dinner,\n\n1:51:15.520 --> 1:51:20.400\n but then I'm going to lean into the overnight fast breakfast the morning of I'm going to stay\n\n1:51:20.400 --> 1:51:24.800\n away from carbohydrates for a hundred mile or anyway. And I'm going to have something like\n\n1:51:25.280 --> 1:51:33.040\n something that's pretty like a high energy, low volume. So like I'll do like an S fuels, a life\n\n1:51:33.040 --> 1:51:38.480\n bar. They've got like, what's in an S fuel life bar? Are we talking about carbs or we're talking\n\n1:51:38.480 --> 1:51:45.040\n about protein fat and protein? Yeah. Fat protein bar. And then they make some awesome. Yeah. So\n\n1:51:45.040 --> 1:51:49.920\n it's, it's not as low carb. Yep. Yeah. They make S fuels makes a whole product line. That's like\n\n1:51:49.920 --> 1:51:55.600\n kind of positioned for a low carb athlete. So they have some products on their lineup that\n\n1:51:55.600 --> 1:51:59.360\n offers some carbohydrate, which is perfect for me because I do introduce some carbohydrate on\n\n1:51:59.360 --> 1:52:04.720\n racing and some of my bigger training sessions and things, but the majority of their products are\n\n1:52:04.720 --> 1:52:09.600\n low carb. So like they have like, you know how you get like the powders that you put into like your\n\n1:52:09.600 --> 1:52:13.920\n drinks that are like high carbohydrate, you know, sports products. They make a version of that.\n\n1:52:13.920 --> 1:52:19.600\n That's like fat based. Oh, cool. That you can mix in with water. Yep. Cool. Yeah. So they've got\n\n1:52:19.600 --> 1:52:23.200\n like a creamer version and then a fruity flavored version. So you can like replicate the taste and\n\n1:52:23.200 --> 1:52:27.600\n the feel of drinking like a, like, you know, a sports drink. Science is awesome. I know it is.\n\n1:52:27.600 --> 1:52:30.960\n Well, and that's so much of it too, cause people are always like, well, I don't know. I just,\n\n1:52:30.960 --> 1:52:35.280\n I just like to have my Gatorade or whatever. It's like, well, you can have it now. It just,\n\n1:52:35.280 --> 1:52:39.040\n it won't have all that. So you can bring that kind of thing with you. Yeah. So I'm leaning\n\n1:52:39.040 --> 1:52:45.120\n on a lot of those like kind of liquid calories, like those low volume, high energy fat protein\n\n1:52:45.120 --> 1:52:48.960\n stuff the morning of so that when I start the race, my body's going to be encouraged to start\n\n1:52:48.960 --> 1:52:55.200\n out burning high levels of fat. Once I get going probably about 45 minutes in, I'll start introducing\n\n1:52:55.200 --> 1:53:00.720\n small amounts of carbohydrate. So at that point, my body's been revving pretty high fat metabolism\n\n1:53:01.360 --> 1:53:06.880\n and by introducing some carbohydrate in the context of the, you know, let's say my a hundred\n\n1:53:06.880 --> 1:53:12.800\n mile, uh, personal record, you know, I'm, I'm running approximately nine miles every hour.\n\n1:53:12.800 --> 1:53:17.760\n So I'm probably going through about a thousand calories in an hour's time. Uh, I'm going to\n\n1:53:17.760 --> 1:53:23.360\n start just like defending muscle glycogen by burning super high levels of fat at the heart\n\n1:53:23.360 --> 1:53:28.000\n rate I would do for that. I'm probably burning somewhere between 80, 90% fat, you know, 12 hours\n\n1:53:28.000 --> 1:53:32.400\n of that you can chip away at your muscle glycogen, uh, to the point where you don't necessarily want\n\n1:53:32.400 --> 1:53:37.360\n to go zero carb. So I'm basically just trying to defend what I know I'm going to be burning from\n\n1:53:37.360 --> 1:53:44.720\n the carbohydrate side of that 80 to 90% fat, 10 to 20% carbohydrate by taking in like, usually,\n\n1:53:44.720 --> 1:53:49.120\n you know, I've gone as low as about 15 grams of carbohydrate per hour and as high as 40 grams.\n\n1:53:49.120 --> 1:53:54.000\n Um, and the reality is somewhere in between is probably the sweet spot, but 40, I can get away\n\n1:53:54.000 --> 1:53:59.520\n without any digestion issues. So I'm not really concerned pushing up to that during a race since\n\n1:53:59.520 --> 1:54:04.000\n I'm only concerned about performance on that day, the carbs, the problem, or is it fiber?\n\n1:54:05.440 --> 1:54:10.080\n Oh, from going above 40 grams or just cause you mentioned digestion issues. Like one of the things\n\n1:54:10.080 --> 1:54:16.640\n for me, like one of the cool things about fatty protein protein and fat is like my stomach just\n\n1:54:16.640 --> 1:54:22.800\n feels way better. So like carbs introduce like bloating and just not feeling great.\n\n1:54:22.800 --> 1:54:27.120\n Yeah. And I think the funny thing is like, if you look at the position paper for ultra marathon\n\n1:54:27.120 --> 1:54:31.680\n single day events and it's, you know, it's very limited in the sense that then it's not anyone's\n\n1:54:31.680 --> 1:54:34.880\n fault. It's just, we don't have a lot of great research on a hundred mile race. It's really hard\n\n1:54:34.880 --> 1:54:40.000\n to study what's going on when someone's running a hundred miles, but they'll say moderate carbohydrate\n\n1:54:40.000 --> 1:54:45.280\n diet is recommended, but they'll also say that it's like something like 60% of participants are\n\n1:54:45.280 --> 1:54:49.600\n going to report some sort of like digestion issue during the event. So then it kind of becomes an\n\n1:54:49.600 --> 1:54:53.280\n issue of, do you want to flip that coin? Do you want to flip that coin and be the 40%.\n\n1:54:53.280 --> 1:55:00.320\n Right. Exactly. So for me, what I found is like, I can push up to 40 grams without getting any\n\n1:55:00.320 --> 1:55:06.800\n digestion issues. Um, do I need 40 grams? Probably not, at least not based on kind of the numbers\n\n1:55:07.440 --> 1:55:12.080\n that would be like, uh, that, that I would see on, like if I went and actually got a,\n\n1:55:12.080 --> 1:55:15.760\n like a metabolic heart test or something like that. Um, but it's possible. I mean,\n\n1:55:15.760 --> 1:55:20.880\n if I had a really good race that I would get close to burning that per hour, um, most folks that are\n\n1:55:20.880 --> 1:55:24.880\n following a moderate high carbohydrate diet are going to be recommended to do like 50 to 70 grams\n\n1:55:24.880 --> 1:55:29.440\n during a single day ultra marathon events. And you'll see some, you know, some recommendations\n\n1:55:29.440 --> 1:55:34.240\n of up to like a hundred grams, uh, not so much for ultra marathons, but just in general, from\n\n1:55:34.240 --> 1:55:38.960\n like a performance standpoint, which I mean, it's one of those things where it's like application\n\n1:55:38.960 --> 1:55:43.280\n versus like what you can do in a lab for one hour is going to be a lot different, especially when\n\n1:55:43.280 --> 1:55:49.120\n you're stretching out distances well past that. And you, you, there's, there's, I'm diverting a\n\n1:55:49.120 --> 1:55:53.600\n little here, but I mean, there's like an approach of like training your gut so you can like be able\n\n1:55:53.600 --> 1:55:57.120\n to tolerate that much carbohydrate, which you can do, and you may have to, if you're going to follow\n\n1:55:57.120 --> 1:56:02.640\n a high carbohydrate diet. But again, we go back to that practicality standpoint of if you're a\n\n1:56:02.640 --> 1:56:08.960\n professional Olympian who's living and breathing performance and you're burning two to three times,\n\n1:56:08.960 --> 1:56:15.360\n you're messing, resting metabolic rate on some days, like you, you may be able to actually\n\n1:56:15.360 --> 1:56:20.080\n consume a hundred grams of carbohydrate per hour during your training sessions and, and just,\n\n1:56:20.080 --> 1:56:24.800\n you know, barely stay on top of your nutritional needs. Most people who are running ultra marathons\n\n1:56:24.800 --> 1:56:30.000\n aren't going to be, you know, probably training much past 10 hours per week. And they're probably\n\n1:56:30.000 --> 1:56:35.680\n not going to have the, I'll call it their, a dietary budget to tolerate a hundred grams of\n\n1:56:35.680 --> 1:56:40.560\n carbohydrate consumption during their workouts and still be able to stay healthy. And, you know,\n\n1:56:40.560 --> 1:56:46.720\n so I think that's kind of like a, a bit of a, of a non, a non starter for the majority of people,\n\n1:56:46.720 --> 1:56:51.360\n unless we want to talk about like a tiny percentage of the 1% of top performers.\n\n1:56:51.360 --> 1:56:55.120\n So maybe you can talk about the training, like fueling yourself during training as well.\n\n1:56:55.120 --> 1:57:01.120\n Is there, and also as part of that, is it possible to train mostly fasted?\n\n1:57:02.400 --> 1:57:10.080\n Because as a side comment, let me just say, I like, again, not anywhere, not even like one\n\n1:57:10.080 --> 1:57:15.440\n 10th of your level of performance, but you know, I, I try to push myself and I just feel much better\n\n1:57:15.440 --> 1:57:21.840\n when I'm fasted. So water and maybe some salt for longer runs for anything over like 10, 15 miles,\n\n1:57:21.840 --> 1:57:27.120\n but not no food. Yeah. I think, I mean, I like to train on an empty stomach. I do most of my,\n\n1:57:27.120 --> 1:57:30.640\n my biggest training session usually in the morning. And it usually what will determine\n\n1:57:30.640 --> 1:57:33.760\n whether I eat something or not before that is like, how much do I need to eat that day in order\n\n1:57:33.760 --> 1:57:38.320\n to stay on top of it, to build training in the next day. So I'll, I'll, I'll usually do something\n\n1:57:38.320 --> 1:57:42.080\n similar to what I do before a race. If I need to kind of stay on top of calories for the day. So\n\n1:57:42.080 --> 1:57:48.320\n I'm not like at noon with like no calorie intake and like 5,000 calories to try to consume before\n\n1:57:48.320 --> 1:57:54.880\n I go to bed that night and get out and do the same thing the next day. But yeah, I think if I were,\n\n1:57:54.880 --> 1:58:00.320\n if I were doing what you're doing, like if that were my lifestyle, I think I would do almost all\n\n1:58:00.320 --> 1:58:05.840\n my runs fasted. I don't see why I would be eating a lot before it because it's like I'm just\n\n1:58:05.840 --> 1:58:11.200\n introducing something that could, especially if you're noticing, like here's what I'd say.\n\n1:58:11.200 --> 1:58:15.840\n If I was doing that and I was like, wow, this run sucks. And then I introduced something beforehand\n\n1:58:15.840 --> 1:58:19.520\n and now my run was feeling great and my progress was getting better. That's when I would maybe\n\n1:58:19.520 --> 1:58:24.320\n consider having something before. But if you're running both of those, those like self experiments,\n\n1:58:24.320 --> 1:58:28.720\n you're noticing, yeah, if I eat something before I go on this workout, the workouts less enjoyable,\n\n1:58:28.720 --> 1:58:33.440\n I'm not noticing any, any increased improvements on it. Again, it's a little messy. Like we said\n\n1:58:33.440 --> 1:58:37.200\n before, it's hard to really, you can't go back and try it a different way on that specific day.\n\n1:58:37.840 --> 1:58:43.440\n But I think, I think most people, if they're just like, they go at it with like no bias in the sense\n\n1:58:43.440 --> 1:58:48.400\n that they're like trying to make one work versus the other, you can get at least a good enough look\n\n1:58:48.400 --> 1:58:55.680\n at it. And if absolute peak performance in one activity, one very specific activity isn't your\n\n1:58:55.680 --> 1:59:01.120\n goal, then it's like, do you really care if one has a 2% performance increase that you won't even\n\n1:59:01.120 --> 1:59:06.000\n probably notice because there's other variables that will clearly overpower that 2% one way or\n\n1:59:06.000 --> 1:59:11.440\n the other. And there's some benefit in terms of freedom and letting go of like having to think\n\n1:59:11.440 --> 1:59:17.040\n about some of these variables. I see sort of fasting as even if it's like a hit on the performance,\n\n1:59:17.040 --> 1:59:22.960\n it's worth it to just not think about it. There's some really nice aspect to just putting on shoes,\n\n1:59:23.920 --> 1:59:29.360\n not caring like what shorts you wear or like what your outfit is, like not being optimal\n\n1:59:29.360 --> 1:59:35.200\n in every way and just not caring and just enjoying the purity of just running no matter what.\n\n1:59:35.200 --> 1:59:40.960\n Just enjoying the natural aspect. There's a side to me that sometimes just like craves a lifestyle\n\n1:59:40.960 --> 1:59:48.160\n where it's like I have like such a small house and only what I need and just like a handful of\n\n1:59:48.160 --> 1:59:52.080\n food products I know I enjoy and work well for me and I don't even have the distraction of the other\n\n1:59:52.080 --> 1:59:58.240\n stuff. There's almost like a weight that comes off your shoulders when you think even just thinking\n\n1:59:58.240 --> 2:00:03.040\n about it like it's so simple. So the reason I'm mostly a minimalist like that, the reason I have\n\n2:00:03.040 --> 2:00:08.960\n stuff is I realize like you probably have to fit into society and if you want to have other people\n\n2:00:08.960 --> 2:00:13.840\n in your life you should probably get used to having stuff because most people like stuff.\n\n2:00:14.560 --> 2:00:20.080\n Right. Well yeah there's that side of it too and there's a whole, you don't want to ostracize\n\n2:00:20.080 --> 2:00:24.560\n yourself too much and I think anything you can kind of like you can manipulate that a little\n\n2:00:24.560 --> 2:00:30.640\n bit where there's things that are like not specific to, that's going to negatively impact\n\n2:00:30.640 --> 2:00:35.760\n the people around you or your experiences with them. So there's a balance like everything I guess.\n\n2:00:35.760 --> 2:00:39.520\n Yeah I mean that's why I drink, I think I mentioned you offline, drink vodka, whiskey,\n\n2:00:40.480 --> 2:00:48.560\n sort of alcohol because I don't feel good about it the day after or sometimes multiple days after\n\n2:00:49.120 --> 2:00:53.440\n so I know it's not good for me. So I do a lot of stuff that's good for me, everything we talked\n\n2:00:53.440 --> 2:00:57.600\n about exercise and diet and all those kinds of things but the alcohol almost symbolizes\n\n2:00:58.320 --> 2:01:03.920\n embracing the chaos of life, the wild and the amazing things that could happen and I think\n\n2:01:03.920 --> 2:01:09.280\n that's really important because if you optimize everything about life then you're going to miss\n\n2:01:10.080 --> 2:01:15.440\n most of the fun stuff that happens in life. So it's not all about the optimization, it's some of it\n\n2:01:16.400 --> 2:01:21.840\n like everyone has different things and what they, how they introduce that chaos in a controlled way.\n\n2:01:21.840 --> 2:01:28.480\n For me alcohol is that because I'm okay drinking not too much so I can control that aspect even\n\n2:01:28.480 --> 2:01:34.720\n though it's unhealthy it introduces just the right amount of fun that I embrace it.\n\n2:01:34.720 --> 2:01:38.640\n Yeah and I mean it is one of those things where it's like I'm going to benefit now and pay later\n\n2:01:38.640 --> 2:01:45.520\n a little bit too where like and hey if you go and you go out with some friends and drink and you\n\n2:01:45.520 --> 2:01:49.680\n have memories that last a lifetime from that experience and you paid for it for a couple\n\n2:01:49.680 --> 2:01:52.800\n days after then hey maybe that's a fair trade off from a life experience.\n\n2:01:52.800 --> 2:01:59.040\n And part of the vodka thing is I need to honor my ancestors so it's like you have to you know you\n\n2:01:59.040 --> 2:02:08.560\n can't you can't turn your back on your past. Let me ask about the 100 mile world record on the\n\n2:02:08.560 --> 2:02:16.240\n treadmill. So for most people running a treadmill is really boring so that's kind of their experience\n\n2:02:16.240 --> 2:02:20.000\n of it that's probably the first thing that would say that seems like really boring to run 100 miles\n\n2:02:20.000 --> 2:02:27.040\n in a treadmill. Would you say it's boring? Like what were some places your mind went to make that\n\n2:02:27.040 --> 2:02:33.920\n happen? So this one is interesting to me because I definitely recognized the boredom and the\n\n2:02:33.920 --> 2:02:39.520\n difference. The thing that the question I can't quite answer I think with it is like could I have\n\n2:02:39.520 --> 2:02:44.880\n remedied that with better preparation because the scenario that put me on a treadmill for 100 miles\n\n2:02:44.880 --> 2:02:51.120\n was you know it was March 2020 basically the cascade of every race on the planet got cancelled\n\n2:02:51.760 --> 2:02:58.480\n and I was in a position where I was going to be doing a runnable 100 miler on a track in\n\n2:02:59.280 --> 2:03:03.360\n mid to late April so I had like the majority of my training under my belt so I was like kind of\n\n2:03:03.360 --> 2:03:08.480\n putting the finishing touches on that and I was like oh great here we are like you know what do\n\n2:03:08.480 --> 2:03:13.760\n I do with this fitness? Do I just scale back and hope the events come back in fall and then peak\n\n2:03:13.760 --> 2:03:19.120\n again or do I find something to use this fitness for? And the treadmill was the closest thing to\n\n2:03:19.120 --> 2:03:23.280\n what I had been training for in terms of just like a mechanical like flat running essentially\n\n2:03:23.280 --> 2:03:31.760\n that I could think of and my thought was okay well I'll just live stream myself on a treadmill\n\n2:03:31.760 --> 2:03:36.080\n and see what happens. It ended up turning into like a quite a big event. So you don't usually\n\n2:03:36.080 --> 2:03:41.040\n incorporate treadmill running into your running into your training? I don't not incorporate it.\n\n2:03:41.040 --> 2:03:46.640\n I just don't incorporate it in the way that would be necessarily conducive to uh you know dealing\n\n2:03:46.640 --> 2:03:51.200\n with the mental aspects of being on a treadmill for 100 miles. Was it that different than running\n\n2:03:51.200 --> 2:03:55.840\n on a track? It was from the sense that here's the way I describe it is when I'm on a track it's a\n\n2:03:55.840 --> 2:04:02.480\n controlled environment and everything can be very uniform but there are tiny little micro adjustments\n\n2:04:02.480 --> 2:04:08.880\n and pace that that I'm doing subconsciously that give me the sense of control. Right. No I might\n\n2:04:08.880 --> 2:04:13.920\n run the exact same split but there's like a fraction of a second or you know a fraction\n\n2:04:13.920 --> 2:04:17.440\n second faster than a fraction of seconds slower that equals the same outcome. It gives you that\n\n2:04:17.440 --> 2:04:22.320\n sense of control. You're determining how fast you're going. On a treadmill you're responding\n\n2:04:22.320 --> 2:04:26.880\n to the belt so the advantage is you can set a pace and know you're hitting it. The disadvantage is\n\n2:04:27.440 --> 2:04:32.880\n you're being told what to do by that machine and that gets very frustrating. I've felt like I wanted\n\n2:04:32.880 --> 2:04:37.840\n to step off like you get to like certain points where you're just like like even stepping off\n\n2:04:37.840 --> 2:04:41.280\n what I noticed I learned this on the day of actually I noticed there's something where it\n\n2:04:41.280 --> 2:04:44.800\n didn't really matter how long I get off like I get off to use the bathroom and that was a little\n\n2:04:44.800 --> 2:04:52.160\n bit of a longer break. Then I had like a hiccup during my event where we ran so much power through\n\n2:04:52.160 --> 2:04:58.640\n one end of the house that the screen on the treadmill was blacking out. So I ended up jumping\n\n2:04:58.640 --> 2:05:03.120\n back and forth on treadmills for quite a bit in the beginning and I noticed even turning it off\n\n2:05:03.120 --> 2:05:06.400\n stepping on the other and starting the other one up gave me like you know a handful of seconds\n\n2:05:06.400 --> 2:05:12.480\n between was enough of a mental break of just like that release of being told what to do to reset.\n\n2:05:12.480 --> 2:05:17.280\n So maybe if you were in the future you would figure out what exactly how much is needed to\n\n2:05:17.280 --> 2:05:21.920\n have that mental break. I never actually thought about that that I mean obviously for you but also\n\n2:05:21.920 --> 2:05:26.960\n for people like me like amateur runners that that's a source of frustration with the treadmill\n\n2:05:26.960 --> 2:05:33.520\n that there's sometimes small adjustments in pace that we do running not on the treadmill on the\n\n2:05:33.520 --> 2:05:40.560\n ground that feel like essential. Just like you said that experience of control like\n\n2:05:41.280 --> 2:05:46.080\n feeling like you're in control somehow that's really I don't know that's somehow liberating\n\n2:05:46.080 --> 2:05:51.280\n in the way that a treadmill can be just the source of frustration. The funny thing though\n\n2:05:51.280 --> 2:05:57.040\n about the treadmill is I actually like to do faster workouts on the treadmill like long intervals or\n\n2:05:57.040 --> 2:06:02.560\n something like that or tempo runs because for that type of stuff sometimes for those I want\n\n2:06:02.560 --> 2:06:07.920\n to release the brainpower required to hit that pace and say you take care of that and for that\n\n2:06:07.920 --> 2:06:11.760\n it's fun but those are over quick so you don't really run into the times. Yeah that's fascinating\n\n2:06:11.760 --> 2:06:18.320\n for like precise control of pace. You've also during that stream got to interact one of the\n\n2:06:18.320 --> 2:06:22.960\n greatest athletes of all time, Berg Kreischer. What's your he's actually doing I don't know\n\n2:06:22.960 --> 2:06:27.280\n if you're paying attention to this but I guess he has a goal of running 2,000 miles this year. Yeah.\n\n2:06:27.280 --> 2:06:33.440\n I've got a chance to talk to Joe Rogan yesterday about this which is fascinating. I think he's a\n\n2:06:33.440 --> 2:06:40.320\n little bit doubtful of Bert's ability to be the ultra performer that he so naturally is. Yeah.\n\n2:06:41.120 --> 2:06:46.000\n What's your thoughts about Bert as a runner? What's your advice to him and what was your\n\n2:06:46.000 --> 2:06:50.880\n interaction like as part of this treadmill challenge with him? I love Bert because he's\n\n2:06:50.880 --> 2:06:57.280\n such a nice person. I mean as a guy who's just accelerated in popularity over the last few years\n\n2:06:57.280 --> 2:07:04.160\n like he is like super kind so for folks who are curious like I've met Bert a couple years earlier\n\n2:07:04.160 --> 2:07:08.880\n and I just randomly asked him like hey I'm doing this live stream thing we're doing it for fight\n\n2:07:08.880 --> 2:07:12.960\n for the forgotten we're trying to raise some funds for them would you want to come on the live\n\n2:07:12.960 --> 2:07:16.720\n stream for a bit and I thought maybe he'd come off like five or ten minutes and I thought that'd\n\n2:07:16.720 --> 2:07:20.880\n be amazing if he did that he ended up coming on for like over an hour he said he went past his slot\n\n2:07:20.880 --> 2:07:25.680\n sat in the next slot and just started talking with some of the other guests it's just he's just\n\n2:07:25.680 --> 2:07:32.320\n like Bert is definitely like I feel like he's as unchanged from like his popularity as one can get\n\n2:07:32.320 --> 2:07:40.960\n away with and it's just like his his lifestyle I think is very unpredictable in the sense that like\n\n2:07:40.960 --> 2:07:47.120\n if he wants to run like x time for a specific race that's going to pull away from his lifestyle so\n\n2:07:47.120 --> 2:07:53.120\n much to focus on that luckily for him he's actually a great athlete like you it's it's under that layer\n\n2:07:53.120 --> 2:07:58.080\n of uh of fat yeah so for people who are not familiar Bert Kresch is a comedian who takes off\n\n2:07:58.080 --> 2:08:06.400\n his shirt often has he's a uh uh elegant layer of fat around him he's also a party animal so he's a\n\n2:08:06.400 --> 2:08:14.080\n weird balance of like healthy and unhealthy yeah so he drinks a lot during I think there's some\n\n2:08:14.080 --> 2:08:20.480\n debate about that but certainly after his uh his performances but at the same time he's into kind of\n\n2:08:20.480 --> 2:08:25.920\n the running thing and he does quite a bit of treadmill running I think so and like I said\n\n2:08:25.920 --> 2:08:30.800\n has this challenge of running 2000 miles this year so it's fascinating to have somebody who\n\n2:08:30.800 --> 2:08:37.760\n so fully embraces life and the full joys of life as represented by the huge amounts of drinking and\n\n2:08:37.760 --> 2:08:45.360\n partying and just being a wild man but also at the same time like being at least curious about this\n\n2:08:45.360 --> 2:08:51.040\n challenging yourself in the physical realm it's kind of fascinating it reminds me of um one of\n\n2:08:51.040 --> 2:08:56.160\n my favorite comedians like Eddie Izzard who's been doing those challenges basically off the\n\n2:08:56.160 --> 2:09:04.080\n couch just running um a marathon a day kind of thing it's fascinating to see the purity of those\n\n2:09:04.080 --> 2:09:10.960\n challenges when like exercise hasn't necessarily been deeply ingrained in your life and you kind\n\n2:09:10.960 --> 2:09:16.000\n of just embrace the challenge anyway and take it on and that's another way of looking at it\n\n2:09:16.000 --> 2:09:22.240\n because we've been talking about running as a a performance like optimization thing where training\n\n2:09:22.240 --> 2:09:28.240\n is such a huge part of this process like race day is just the cherry on top but there's for some\n\n2:09:28.240 --> 2:09:33.760\n people where the race is the cake yeah it's like they just take it on as a pure challenge as the\n\n2:09:33.760 --> 2:09:38.800\n as the as the thing you haven't really trained for as the thing you haven't you don't understand\n\n2:09:38.800 --> 2:09:43.360\n the intricacies of but you take it on anyway and that that reveals something about the human spirit\n\n2:09:43.360 --> 2:09:48.160\n as well yeah and there's definitely like a switch that flips when you in your mind is saying\n\n2:09:48.160 --> 2:09:52.240\n i'm going to do this where then all of a sudden it goes from like you stop thinking about oh that's\n\n2:09:52.240 --> 2:09:56.320\n not possible to like well i'm just going to do it and i think Burt highlights that perfectly in a\n\n2:09:56.320 --> 2:10:01.200\n lot of cases where like he's he's maybe not even thinking it through enough to get to the point\n\n2:10:01.200 --> 2:10:05.280\n where it's like he gets the point where he thinks this is not possible where most people would look\n\n2:10:05.280 --> 2:10:09.760\n at it and think huh i don't know if i can actually physically accomplish that task Burt's just like\n\n2:10:09.760 --> 2:10:14.400\n oh yeah i'm gonna do it and my my thought with Burt was the 2000 mile thing where he's like\n\n2:10:14.400 --> 2:10:19.280\n yeah i'm gonna do it and my my thought with Burt was the 2000 mile thing is where are we gonna find\n\n2:10:19.280 --> 2:10:24.320\n him at the end of the year with like 36 hours to go on 100 miles and that's right that's right\n\n2:10:24.320 --> 2:10:31.680\n that's what's gonna happen and it's going to be hilarious uh so speaking of things that are insane\n\n2:10:31.680 --> 2:10:38.800\n and like taking on challenges that don't seem like you didn't you didn't think through uh\n\n2:10:38.800 --> 2:10:46.160\n uh you're thinking about running across the country in in a challenge you call the transcontinental\n\n2:10:46.160 --> 2:10:52.080\n run can you describe this challenge and what the heck you're thinking yeah yeah so this is uh you\n\n2:10:52.080 --> 2:10:56.560\n know one thing that is exciting about ultra marathons i think in a lot of places especially\n\n2:10:56.560 --> 2:11:01.600\n early in someone's ultra marathon adventure if they decide to do that as a you know part of their\n\n2:11:01.600 --> 2:11:05.920\n life is you have like these early years where you're doing things for the first time and it's\n\n2:11:05.920 --> 2:11:11.680\n like so cool and scary at the same time to think today i'm gonna run 100 miles and the first ever\n\n2:11:11.680 --> 2:11:15.600\n run before is 50 or something like that and you just know you're gonna do something that you've\n\n2:11:15.600 --> 2:11:18.560\n never done before you're gonna experience things you would have never been able to predict\n\n2:11:19.760 --> 2:11:26.000\n and it's like this really interesting unique like human experience i think so for me i've\n\n2:11:26.000 --> 2:11:30.480\n spent most of my career at this point like doing i got through that phase and a lot of the events\n\n2:11:30.480 --> 2:11:34.960\n i'm really interested in and then it was like now let's repeat it and see if we can do it better\n\n2:11:34.960 --> 2:11:39.840\n and you get into that mindset for a while which is also a fun mindset but there is that kind of\n\n2:11:39.840 --> 2:11:45.280\n like uh desire to kind of have that human experience again of like you know not knowing\n\n2:11:45.280 --> 2:11:49.600\n what could happen or is this doable type of a thing but still doing it and figuring it out\n\n2:11:49.600 --> 2:11:53.600\n along the way so i would describe the transcontinental project as something like that it's\n\n2:11:53.600 --> 2:11:56.800\n not anything unique to me or anything new there's been a lot of people who've done it before\n\n2:11:57.440 --> 2:12:01.360\n but essentially it's a route there's different routes there's one kind of main one that's done\n\n2:12:01.360 --> 2:12:06.320\n for like the that is used as the record route more or less that you go from san francisco to\n\n2:12:06.320 --> 2:12:11.440\n new york and essentially you live out of an rv uh while you're running so you run as much as you\n\n2:12:11.440 --> 2:12:16.240\n can during the day then you go to bed at night and then you get up and do it again and you're\n\n2:12:16.240 --> 2:12:22.320\n you're handling all the logistics and the process of trying to make sure you can get up the next day\n\n2:12:22.320 --> 2:12:26.320\n and do again what you did the day before which is going to be the biggest difference so for me\n\n2:12:26.320 --> 2:12:32.000\n i've done all single day ultra marathons where you're going to wring yourself dry at knowing the\n\n2:12:32.000 --> 2:12:35.520\n next day or week or however long you need you're going to be able to just kind of like shut\n\n2:12:35.520 --> 2:12:39.760\n everything down and let everything catch back up whereas with this like you know you're doing it\n\n2:12:39.760 --> 2:12:44.080\n again and again again yeah and you know the record is by a guy named p costa who averaged just over\n\n2:12:44.080 --> 2:12:50.960\n 72 miles a day finished in 42 days six hours and 30 minutes and i mean just like 72 miles 73 miles\n\n2:12:50.960 --> 2:12:55.920\n and then like next day again next day again just knowing every day when you finish you spend a whole\n\n2:12:55.920 --> 2:12:58.880\n day running and then okay i'm gonna go to bed i'm gonna wake up in the morning i'm gonna have to do\n\n2:12:58.880 --> 2:13:04.000\n this again and then you know have that happen for six weeks and that's if it goes very well\n\n2:13:04.000 --> 2:13:08.880\n so luck i assume is a big part of this yeah for sure i mean there's just so many variables that\n\n2:13:08.880 --> 2:13:12.960\n are uncontrollable on this type of an experience just because i mean you go over the sierras maybe\n\n2:13:12.960 --> 2:13:18.320\n you hit a storm you know you try to time it most people do it in sep start in september so you\n\n2:13:18.320 --> 2:13:23.920\n can get over the mountain passes without a big storm coming through uh but then also get to the\n\n2:13:23.920 --> 2:13:28.480\n east coast before it's like the middle of winter so like september early september start is kind\n\n2:13:28.480 --> 2:13:33.280\n of ideal but you can you know i mean pete was very fortunate from a weather standpoint i think\n\n2:13:33.280 --> 2:13:36.640\n he made one big mistake he got a little too aggressive beginning had to take a full day off\n\n2:13:36.640 --> 2:13:42.640\n so he actually averaged from a moving day standpoint closer to 75 miles per day um but\n\n2:13:42.640 --> 2:13:46.560\n yeah i mean there's going to be things that i can't prepare for won't know it's going to happen\n\n2:13:47.200 --> 2:13:51.680\n you know a lot of that will get a lot of the logistical stuff will get leaned on with the crew\n\n2:13:51.680 --> 2:13:56.000\n so that's i mean that's the hardest part right now is just like getting all that put together\n\n2:13:56.000 --> 2:14:00.400\n where it's like okay i need to have the rv ready i need to have all the stuff and we need to have\n\n2:14:00.400 --> 2:14:05.280\n the places figured out where we're going to stop and and the people that can you know dedicate\n\n2:14:05.280 --> 2:14:09.760\n that much time to an activity like that you know there's a lot of moving parts even before you\n\n2:14:09.760 --> 2:14:14.960\n start the adventure itself when are you see you're taking the san francisco to new york yeah and when\n\n2:14:14.960 --> 2:14:20.080\n are you doing the the run september 1st is when uh you know barring anything like catastrophic\n\n2:14:20.080 --> 2:14:24.160\n between now and then it's really exciting but i mean this is incredible so you you'll probably\n\n2:14:24.160 --> 2:14:28.320\n have a bunch of people just randomly running with you are people going to be tracking where you're\n\n2:14:28.320 --> 2:14:32.800\n located yeah so i'll be documenting everything because i mean my hope is that i'm doing it\n\n2:14:32.800 --> 2:14:37.840\n primarily to raise awareness for fight for the forgotten justin wren's charity uh but with that\n\n2:14:37.840 --> 2:14:44.080\n said i think i am capable of uh if i have a good experience uh you know chasing the record or going\n\n2:14:44.080 --> 2:14:49.600\n after the record or at least getting close to it so oh shit so you're gonna try to beat this record\n\n2:14:49.600 --> 2:14:54.720\n yeah i'm gonna i'm gonna go out with the i'm gonna structure the process in a way that leaves\n\n2:14:54.720 --> 2:14:59.360\n that door open is the way i would describe it i'm gonna try not to do anything that would potentially\n\n2:15:00.560 --> 2:15:04.800\n put it in a situation where that becomes the primary goal just because i want to make sure\n\n2:15:04.800 --> 2:15:08.720\n that the reason i decided to do in the first place was for fight for the forgotten so i want\n\n2:15:08.720 --> 2:15:13.040\n to make sure that i don't end up two thirds of the way across the country with a broken leg and i'm\n\n2:15:13.040 --> 2:15:20.800\n like hey guys uh i guess the donation button's turned off so focus on like don't sacrifice that\n\n2:15:20.800 --> 2:15:26.960\n right that goal but also there's a community aspect to it that i feel like are you going to\n\n2:15:27.920 --> 2:15:34.320\n i mean so you're going to document and post yeah but are you going to also is there a safety\n\n2:15:34.320 --> 2:15:39.520\n perspective here it's like the forest gum thing you might have large numbers of crowds that run\n\n2:15:39.520 --> 2:15:43.760\n along with you for a while yeah are you worried about that kind of thing i wouldn't say i'm\n\n2:15:43.760 --> 2:15:47.760\n worried about i mean i think there's probably there's remote enough spots along the way where\n\n2:15:47.760 --> 2:15:52.320\n you'll get some alone time more more likely i don't necessarily mind if people want to jump in\n\n2:15:52.320 --> 2:15:56.560\n there'll there'll be some people that will definitely want to do that and and they can come\n\n2:15:56.560 --> 2:16:01.200\n in and but the reality is like it's probably not going to be a scenario where there's like\n\n2:16:01.200 --> 2:16:06.960\n you know 40 people following me at all times you say that now yeah you never know just wait for\n\n2:16:06.960 --> 2:16:13.920\n this podcast yeah and then if joe finds out you're doing this then we're in trouble all right so um\n\n2:16:13.920 --> 2:16:18.800\n i mean what are the things that you think will be the hardest for you and also like how do you\n\n2:16:18.800 --> 2:16:25.360\n train for this kind of thing um and what yeah what are the hardest things you anticipate how do you\n\n2:16:25.360 --> 2:16:30.240\n train for them yeah so the way i'm looking at this is it's much less about performance from\n\n2:16:30.240 --> 2:16:37.680\n the traditional sense where i need to be able to be x fit i think i need to be injury proof that's\n\n2:16:37.680 --> 2:16:43.680\n what's going to be a detriment if you think about it like if i manage to average nine minute mile\n\n2:16:43.680 --> 2:16:51.520\n pace for a day that would be 80 miles in a 12 hour time frame so i'll easily have 12 hours\n\n2:16:51.520 --> 2:16:57.760\n of moving time per day um nine minute pace i think is slow enough that it's not an unreasonable clip\n\n2:16:57.760 --> 2:17:03.200\n so like when you i mean obviously there's things that slow you down or i'll probably take walking\n\n2:17:03.200 --> 2:17:07.520\n breaks you know stopping breaks you got to stay on top of nutrition that's the other big thing too i'm\n\n2:17:07.520 --> 2:17:11.920\n you know probably eating like anywhere between 10 to 15 000 calories a day which is you know i can\n\n2:17:11.920 --> 2:17:15.600\n probably count on my hand a couple of occasions where i've eaten that much in my life so now i\n\n2:17:15.600 --> 2:17:19.920\n got to do that for six plus weeks in a row and you don't want any having a stomach problem i'm\n\n2:17:19.920 --> 2:17:25.040\n trying to try to minimize the amount of stomach problems so you would you estimate about 12 to 13\n\n2:17:25.040 --> 2:17:29.920\n to 14 hours of running every day yeah that's probably like from from the first step to the\n\n2:17:29.920 --> 2:17:35.040\n last step it'll probably be somewhere around like say 14 hours 13 hours or something like that would\n\n2:17:35.040 --> 2:17:40.320\n be a pretty good estimate and then getting rest and so and then minimizing the risk of injury\n\n2:17:40.320 --> 2:17:46.000\n which could be as small as like like literally uneven surfaces resulting to like stepping the\n\n2:17:46.000 --> 2:17:51.200\n wrong way i mean that's going to be a lot of steps yeah yeah uh huh so the probability of injury are\n\n2:17:51.200 --> 2:17:55.600\n you worried about that kind of stuff is can you strengthen the ankles or those kinds of things\n\n2:17:55.600 --> 2:18:00.560\n that prevent yeah possibility of injury and that's that's where i'm putting a lot of my focus in is\n\n2:18:01.680 --> 2:18:06.160\n i think like just being running fit is going to be like generally speaking is going to be\n\n2:18:07.040 --> 2:18:12.080\n important i'm going to i think just from a lifetime of running is going to be a huge advantage\n\n2:18:12.720 --> 2:18:16.960\n a lot of these like kind of like mechanical movements are going to be very established\n\n2:18:16.960 --> 2:18:21.760\n it's just going to be about can i tolerate that volume of it there i think that i'm doing more\n\n2:18:21.760 --> 2:18:25.520\n strength work i think this is something where it's like you know maybe adding five pounds of\n\n2:18:25.520 --> 2:18:29.280\n lower body muscle is going to be an advantage versus a disadvantage when you're looking at\n\n2:18:29.280 --> 2:18:33.760\n power weight ratio because i just don't really don't i don't i never need to be running a 648\n\n2:18:33.760 --> 2:18:40.160\n mile for this adventure um and i so i'm looking at that i'm doing a lot more of that stuff focusing\n\n2:18:40.160 --> 2:18:46.480\n on that the training is changing a fair bit where it's more polarizing versus kind of being\n\n2:18:46.480 --> 2:18:50.480\n i mean i've always had some polarization in my training but this is even to an extreme where\n\n2:18:50.480 --> 2:18:55.920\n like i'm going to do some simulations where uh you know i go out and do two or three days where i\n\n2:18:55.920 --> 2:19:00.560\n target the exact thing i will be doing on the transcon you were on instagram posting about\n\n2:19:00.560 --> 2:19:05.920\n these simulated runs so you legitimately like trying to perfectly copy what would happen in\n\n2:19:05.920 --> 2:19:11.520\n one two or three day segment on that run yeah just to kind of start to weed out where are the\n\n2:19:11.520 --> 2:19:18.240\n potential problems so let's say i do a two or three day simulation where i'm averaging 70 miles a day\n\n2:19:18.240 --> 2:19:23.520\n and i find out at the end of three days there's a really weak spot here um i need to address that or\n\n2:19:23.520 --> 2:19:28.240\n i need to find a way to make that not a weak spot i think that's the only way to really get as close\n\n2:19:28.240 --> 2:19:33.360\n as you can to avoiding injury have you done that yet have you done a two day 70 mile like even that's\n\n2:19:33.360 --> 2:19:37.040\n incredibly difficult i haven't yet i'm going to build up to it because that's the other thing too\n\n2:19:37.040 --> 2:19:41.920\n is like i don't think you want to be so aggressive with that where you get injured trying to figure\n\n2:19:41.920 --> 2:19:47.520\n out how not to get injured uh so i'll i'll what i'm going to start what i just started last week\n\n2:19:47.520 --> 2:19:52.720\n is i've uh it looks really weird on my training schedule because like last week i ran almost 150\n\n2:19:52.720 --> 2:19:57.040\n miles but i took two days off so it's like usually for me to get to 150 miles that's a seven day\n\n2:19:57.040 --> 2:20:02.640\n training week uh so that's the way i'm doing it like i did i did a day where i did uh you know\n\n2:20:02.640 --> 2:20:08.400\n two like just over 20 milers separated with by just a couple hours and within that couple hours\n\n2:20:08.400 --> 2:20:12.960\n i did like a three mile walk the following morning i woke up and ran i think it was like\n\n2:20:12.960 --> 2:20:17.360\n just over 36 miles first thing in the morning just to get an idea of just like kind of like\n\n2:20:17.360 --> 2:20:21.840\n what is it like to be i mean this was in phoenix too so it was 100 degrees for the majority of that\n\n2:20:21.840 --> 2:20:27.680\n just suffer then rest yeah suffer again how that feels there's enough precedent with this sort of\n\n2:20:27.680 --> 2:20:32.720\n an activity where like everyone i've talked to so far has told me like there is going to be like\n\n2:20:32.720 --> 2:20:36.480\n this kind of like gradual decline in the early stages where you're just like okay it's getting\n\n2:20:36.480 --> 2:20:41.280\n worse it's getting worse it's getting worse and you hit a point where you're just like it hits\n\n2:20:41.280 --> 2:20:46.320\n kind of rock bottom and then like it starts to kind of gradually improve so you kind of have to\n\n2:20:46.320 --> 2:20:52.320\n let yourself get it's weird i think i can maybe eliminate i'm trying to find a way to eliminate\n\n2:20:52.320 --> 2:20:57.600\n some of that by doing the simulations whereas i from what i've seen i haven't seen a lot of people\n\n2:20:57.600 --> 2:21:02.640\n do the simulation route yet i've seen people just do like a lot of training and then say like okay\n\n2:21:02.640 --> 2:21:07.920\n i'll spend the first seven to ten days adapting to this and then i'll get comfortable within this\n\n2:21:07.920 --> 2:21:13.040\n environment and be fine whereas i'm going to try to get to a point where like some of that is\n\n2:21:13.040 --> 2:21:16.960\n already kind of cleared up before i start but not so much that i'm like adding like an extra\n\n2:21:16.960 --> 2:21:22.400\n central week to the trip with worth of running what do you think will be the hardest simulator\n\n2:21:22.400 --> 2:21:27.280\n run leading up to like will you do three days yeah i think i'll probably try to do three days\n\n2:21:28.400 --> 2:21:32.880\n somewhere between 70 and 80 miles each will be kind of like the goal will that be in august do\n\n2:21:32.880 --> 2:21:37.520\n you think how close to yeah i would like it to be in august like early august would be ideal i think\n\n2:21:37.520 --> 2:21:40.880\n like maybe the first week in august because that gives me kind of three weeks to let things kind\n\n2:21:40.880 --> 2:21:46.080\n of settle down from that but then it's crazy this is incredible it's it's actually interesting\n\n2:21:46.080 --> 2:21:50.560\n because like if i did let's say i did the simulation now um the problem with that is\n\n2:21:50.560 --> 2:21:55.440\n like the adaptations from just like the breakdown and the strengthening would likely be gone unless\n\n2:21:55.440 --> 2:22:02.080\n i did it again uh so i want to inch up to it so that like and get close enough to the starting\n\n2:22:02.080 --> 2:22:07.280\n date so that i'm still kind of like you know holding on to that adaptation when i start it\n\n2:22:07.280 --> 2:22:12.960\n so then those first few days maybe aren't quite as miserable and you said uh if everything goes\n\n2:22:12.960 --> 2:22:18.080\n amazing and you're challenging the record it'll be like a 42 day run yeah so that's what the record\n\n2:22:18.080 --> 2:22:23.520\n is almost exactly six weeks and that's at 72 and a half miles per day so will you be posting online\n\n2:22:23.520 --> 2:22:28.960\n and like yeah instagram's gonna be a big one i think i might do a few like youtube stuff along\n\n2:22:28.960 --> 2:22:35.600\n the way too um yeah i'm still ironing out exactly how much i think at minimum i'll do i'll do some\n\n2:22:35.600 --> 2:22:39.520\n instagram stuff i think i'll go live on instagram a few times during the day when i take like walking\n\n2:22:39.520 --> 2:22:45.520\n breaks uh partly just to kind of i think keeping people i mean it stays true to the the goal of\n\n2:22:45.520 --> 2:22:52.320\n raising awareness but it also i find when you bring people in there is an added pressure to\n\n2:22:52.320 --> 2:22:57.600\n that but there's also this sense that i've learned from the treadmill experience since we had like\n\n2:22:57.600 --> 2:23:01.840\n a pretty big production for that in the sense that i mean as much as you can turn on a camera\n\n2:23:01.840 --> 2:23:07.280\n in your own house but like the i remember thinking we had like 30 people lined up to\n\n2:23:07.280 --> 2:23:12.080\n come in and guest speak during that and there's points of that where i was like you know you get\n\n2:23:12.080 --> 2:23:15.680\n that voice we talked about the beginning where it's like you know maybe you could quit like\n\n2:23:15.680 --> 2:23:19.840\n you really need to run 100 miles on a treadmill is this really going to be valuable for you\n\n2:23:19.840 --> 2:23:23.760\n and then you think about oh you know what there's uh you know courtney dewalter one of the best\n\n2:23:23.760 --> 2:23:29.600\n female ultra runners to ever exist is taken in the 30 minutes to an hour out of her day\n\n2:23:29.600 --> 2:23:36.560\n to come on in two hours to you know help me you know amplify this event and do i really want to\n\n2:23:36.560 --> 2:23:39.920\n be sending emails out to these people saying hey guys i know you were gracious enough to\n\n2:23:39.920 --> 2:23:43.280\n block out time of your day you know i think there's a little bit of that to do where you're\n\n2:23:43.280 --> 2:23:47.280\n like you're you're you're jumping in with the community that is following along and saying\n\n2:23:47.280 --> 2:23:52.000\n here's how things are going show them the best the worst and everything between and then ultimately\n\n2:23:52.000 --> 2:23:55.200\n have that hold you accountable a little bit too it's like hard to get up in the morning and not\n\n2:23:55.200 --> 2:24:01.040\n go back out i don't know how you are but i had to uh whenever i did any kind of physical stuff\n\n2:24:01.040 --> 2:24:08.480\n like the 48 hour challenge or just any kind of running i hated turning on the camera yeah i hated\n\n2:24:08.480 --> 2:24:13.280\n it like because you have to like smile and be friendly and stuff oh i'm just gonna be super\n\n2:24:13.280 --> 2:24:19.440\n miserable if i'm miserable well that's it so like exactly in some sense that's what people\n\n2:24:20.640 --> 2:24:24.720\n you know we're gonna get a happy zac or an angry exactly it's like you're making bets\n\n2:24:24.720 --> 2:24:31.920\n and i'm sure there'll be some days maybe not many maybe very few where you're truly happy with\n\n2:24:31.920 --> 2:24:38.800\n yourself like for some weird ecstatic reason maybe if you get over the hump whatever that you mentioned\n\n2:24:38.800 --> 2:24:44.640\n that this dip i mean it's it's fascinating how many how much suffering this actually entails\n\n2:24:44.640 --> 2:24:50.080\n i wonder well and one thing i'm gonna definitely try to leverage to my advantage and one of the\n\n2:24:50.080 --> 2:24:55.360\n reasons why i think fight for the forgotten was the charity that really triggered me to decide to\n\n2:24:55.360 --> 2:25:00.480\n do this the transcontinental route was something i learned about early in my ultra running career\n\n2:25:00.480 --> 2:25:04.320\n and i thought to myself i want to do that someday but it was one of those kind of far off distance\n\n2:25:04.320 --> 2:25:08.080\n things that had never really like actualized in your mind until you put a date down or\n\n2:25:08.080 --> 2:25:11.200\n you know mention it on the joe rogan experience or something like that\n\n2:25:11.200 --> 2:25:17.280\n when then it then it's like people want to know when is this happening and uh um you know what i\n\n2:25:17.280 --> 2:25:23.920\n try to think about is you know the reason justin identified the pygmy tribe was because they were\n\n2:25:23.920 --> 2:25:28.400\n super forgotten where you know we think about just like some of these third world countries where\n\n2:25:29.120 --> 2:25:34.960\n it's a scenario of like some people it's easy for us here in the us to think to ourselves well why\n\n2:25:34.960 --> 2:25:39.760\n don't they just industrialize why don't they just like you know start to innovate a bit why are they\n\n2:25:39.760 --> 2:25:45.920\n so primitive what's wrong with them and in reality like when you take uh when you scale things down\n\n2:25:45.920 --> 2:25:52.160\n to the degree where you need the entire day because of the situation you're in just to take\n\n2:25:52.160 --> 2:25:57.760\n care of your basic needs of water and food you never get the opportunity to even build a real\n\n2:25:57.760 --> 2:26:03.360\n like establishment or you know a build on that like you need you need the free time or you need\n\n2:26:03.360 --> 2:26:08.720\n a portion of your population to have the free time available to innovate and the pygmy tribe just\n\n2:26:08.720 --> 2:26:12.960\n hadn't had that historically in fact they weren't even considered humans by like the local government\n\n2:26:12.960 --> 2:26:17.200\n for quite some time and you know the people that really pay the price in some of these situations\n\n2:26:17.200 --> 2:26:21.200\n are the women because they're the ones that get saddled with like the water gathering and things\n\n2:26:21.200 --> 2:26:26.080\n like that so the reason that justin picked wells to build was because he thought to himself if we\n\n2:26:26.080 --> 2:26:32.000\n can get them wells then now these women don't spend all day walking and carrying water now they\n\n2:26:32.000 --> 2:26:36.400\n can just get that water and now we have half the population freed up for other things now maybe they\n\n2:26:36.400 --> 2:26:41.520\n can start farms they can build some housing and stuff like that and it just it exponentially\n\n2:26:41.520 --> 2:26:47.760\n improves once you take care of some of those big key early things so when i'm thinking about like\n\n2:26:47.760 --> 2:26:51.360\n you know do i really need to go out here and travel another 12 hours a day my mind is going\n\n2:26:51.360 --> 2:26:55.920\n to hopefully go to well if one of those women woke up in the pygmy tribe one morning deciding you\n\n2:26:55.920 --> 2:27:00.960\n know what do i really need to go get water today well yeah you do you really do have to yeah you're\n\n2:27:00.960 --> 2:27:07.120\n running for that uh huh yeah and that that will give you fuel hopefully but yeah yeah i mean the\n\n2:27:07.120 --> 2:27:12.800\n reality is always there where i don't have to do it like they do have to do it so you know but i\n\n2:27:12.800 --> 2:27:20.080\n think just keeping that perspective it it puts us back to the beginning where it's this is one of\n\n2:27:20.080 --> 2:27:25.680\n those situations where i think it's like uh a no quit situation you have to put yourself in a no\n\n2:27:25.680 --> 2:27:31.920\n quit situation here because it's uh you know it's just bigger than you i can't wait to see like the\n\n2:27:31.920 --> 2:27:38.640\n dark places you go i mean there's some yeah the the quit situations and hopefully we get to have\n\n2:27:38.640 --> 2:27:44.000\n a glimpse of those because i think those are really inspiring when somebody is uh both gets\n\n2:27:44.000 --> 2:27:49.680\n broken by them because you know how tough you are but also is almost broken and overcomes it i mean\n\n2:27:49.680 --> 2:27:54.320\n that's just fascinating stories i can't wait i i know does joan know you're doing this by the way\n\n2:27:55.040 --> 2:27:59.440\n yeah i sent him i sent him a note a while back because he was the first spot i mentioned it on\n\n2:27:59.440 --> 2:28:03.520\n so i think he knows i'm not sure if he's following along about the exact starting date or not you will\n\n2:28:03.520 --> 2:28:11.920\n know this is great you probably think you're a crazy uh mfr for doing this but uh i think you\n\n2:28:11.920 --> 2:28:16.800\n love it and i think i love it and i think the world will love it ridiculous question who's the\n\n2:28:16.800 --> 2:28:25.920\n greatest endurance runner or endurance athlete of all time oh that's a good question um i think\n\n2:28:25.920 --> 2:28:36.400\n i'd probably go maybe two directions here uh i think uh heli geber lassie is one of the best\n\n2:28:36.400 --> 2:28:46.320\n in my opinion because just i mean 27 world records like like not all the different distance but like\n\n2:28:46.320 --> 2:28:52.880\n braking and rebraking and that sort of stuff um i mean he ran two what was it 203\n\n2:28:52.880 --> 2:28:58.720\n 359 before the shoe technology came in that is estimated at anywhere between a two to eight\n\n2:28:58.720 --> 2:29:04.160\n percent performance advantage i'm talking about a two hour marathon 203 yep two hour three minutes\n\n2:29:04.160 --> 2:29:10.080\n yeah so he did that with the old shoe technology which uh essentially dates back to anything if\n\n2:29:10.080 --> 2:29:16.240\n if you were a nike athlete it could date back to as early as i think early 2016 is when the first\n\n2:29:16.240 --> 2:29:21.120\n prototype started showing up uh so if you're before that in your career you were using you're\n\n2:29:21.120 --> 2:29:27.280\n guaranteed to be using the old shoe technology um and i mean just the range of it too and uh\n\n2:29:27.920 --> 2:29:32.320\n yeah it's it's hard i mean there's there it's uh is he a marathon runner purely\n\n2:29:32.320 --> 2:29:36.000\n no he did everything that's why i pick him i think because he he he went everywhere\n\n2:29:36.000 --> 2:29:40.960\n everything from the 800 and is like at a national level yeah at a national level i don't he wasn't\n\n2:29:40.960 --> 2:29:46.560\n competing at like olympics or anything in the 800 but he was he was mostly like 5k to marathon\n\n2:29:46.560 --> 2:29:52.800\n um yeah yeah so just incredible i mean i i could go a totally different direction too i think like\n\n2:29:52.800 --> 2:29:57.600\n steve prefontaine stands out in as an american runner just because if you look at it outside\n\n2:29:57.600 --> 2:30:06.160\n of just like performances and stuff like that i think um he basically like you can't find an\n\n2:30:06.160 --> 2:30:13.760\n american male runner who probably didn't get some motivation or some catalyst into their running\n\n2:30:13.760 --> 2:30:19.120\n journey from a prefontaine story or what would you say is inspiring about prefontaine uh like from the\n\n2:30:19.120 --> 2:30:24.880\n philosophy from the technique from his story uh i think there's a few things i mean there's a lot\n\n2:30:24.880 --> 2:30:30.320\n of things which is why he is who he is it's uh one was just his attitude about it where um he wasn't\n\n2:30:30.320 --> 2:30:36.000\n like this picture ask runner uh i mean he was obviously talented but you know you have the\n\n2:30:36.000 --> 2:30:40.160\n perfect story of like he wanted to be good at something you like most american kids tried\n\n2:30:40.160 --> 2:30:47.120\n football was no hard work was gonna get prefontaine starting in varsity for football starts running\n\n2:30:47.120 --> 2:30:52.080\n fell in love with the mile uh his college coach told him no you're not gonna be a miler you're\n\n2:30:52.080 --> 2:30:57.280\n gonna be a 5k guy and he popularized the 5k in the united states or three mile in some cases\n\n2:30:57.840 --> 2:31:03.760\n and uh i mean he the way he would race i think is what really made him interesting for folks\n\n2:31:03.760 --> 2:31:08.480\n where he would he was just like all guts runner where he's like he's like i mean one of his famous\n\n2:31:08.480 --> 2:31:12.880\n quotes was like if you if you beat me you're gonna have to bleed to do it because he's gonna be an\n\n2:31:12.880 --> 2:31:18.080\n all guts race in in a sport where it gets very tactical at times especially at the like national\n\n2:31:18.080 --> 2:31:23.120\n or i shouldn't say national but at the like competition level the championship level where\n\n2:31:23.120 --> 2:31:26.960\n it's like kind of more of a sit and kick approach a lot of times where everyone's kind of waiting\n\n2:31:26.960 --> 2:31:30.960\n for someone to make a move like pre was gonna make a move really early yeah so this idea of\n\n2:31:30.960 --> 2:31:36.480\n leading from the front which i guess is tactically really a bad idea well from a\n\n2:31:36.480 --> 2:31:45.040\n from a running a pr standpoint it's a bad idea in most cases but so a race i guess is not just about\n\n2:31:45.040 --> 2:31:49.920\n the pr so race winning in a lot of cases and that's what he thought was going to put him in\n\n2:31:49.920 --> 2:31:53.520\n the best advantage to win i think it's just the run from the front i mean what what do you because\n\n2:31:53.520 --> 2:32:00.000\n you mentioned this uh the 100 mile you ran you were in second place and then in 90s you were\n\n2:32:00.000 --> 2:32:06.640\n able to get to the first place how hard is it to run when you're in first place you know i think\n\n2:32:06.640 --> 2:32:11.200\n this is really different some people thrive under it where it's like for them i mean like i talked\n\n2:32:11.200 --> 2:32:15.520\n about jim walsh before i think he loves being in the front if he's in the front he loves it that's\n\n2:32:15.520 --> 2:32:20.320\n where he's excited that's where he knows he's he's doing what he's doing where he's pushing his limits\n\n2:32:20.320 --> 2:32:25.600\n and things like that uh pre was probably the same way and i think there's other folks who are much\n\n2:32:25.600 --> 2:32:30.480\n more comfortable kind of saying let's let things settle down here a little bit and then i'll make\n\n2:32:30.480 --> 2:32:35.520\n my move when it's time to make my move or they think of it as and this is a very important i\n\n2:32:35.520 --> 2:32:40.800\n think lesson for for the average ultra runner is just like knowing what you're capable of\n\n2:32:40.800 --> 2:32:47.280\n is going to be an important piece to the puzzle because you can like you you you can try to say\n\n2:32:47.280 --> 2:32:52.240\n i want to run faster than i'm capable of in an early part of a hundred miler but then you're\n\n2:32:52.240 --> 2:32:56.320\n going to pay for it at the end so really unless you're trying to go for the win and that's a\n\n2:32:56.320 --> 2:33:00.400\n tactic that you think is going to produce a win versus trying to run your fastest time you got\n\n2:33:00.400 --> 2:33:04.800\n to run within yourself within your parameters obviously there's a big question about where\n\n2:33:04.800 --> 2:33:08.720\n those parameters are in a lot of cases which makes ultra marathon even more interesting because it's\n\n2:33:08.720 --> 2:33:12.640\n like there's so much unknown about it it's like well maybe you can go faster and we just don't\n\n2:33:12.640 --> 2:33:17.760\n know yet so there's in the face of that uncertainty there's something admirable like it was with\n\n2:33:17.760 --> 2:33:25.040\n prefontaine where you take the risk and run faster than you know you you think you might be able to\n\n2:33:25.040 --> 2:33:32.320\n run in terms of pace that you can hold so push the pace that's possible yeah explore the unknown\n\n2:33:32.320 --> 2:33:37.600\n explore it's like a pioneer spirit right yeah you know the next frontier kind of a thing but\n\n2:33:37.600 --> 2:33:42.720\n i mean prefontaine also there's other angles with him too where he was like in the amateur era where\n\n2:33:42.720 --> 2:33:47.200\n to be an olympian you couldn't be pro so he's turning down i mean the guy was on food stamps\n\n2:33:47.200 --> 2:33:52.000\n and living in a trailer because he wanted to run at the olympics and there was a lot of like\n\n2:33:52.000 --> 2:33:56.160\n politics involved with not being able to take take sponsorship money and things like that which\n\n2:33:56.160 --> 2:34:03.680\n has changed since then but so he was huge in the movement for that to kind of like you know have a\n\n2:34:03.680 --> 2:34:09.840\n situation where now as an athlete you can finish in most cases finish college sign a big contract\n\n2:34:09.840 --> 2:34:14.320\n with you know a sponsor and then also still compete in the olympic games and go to the events\n\n2:34:14.320 --> 2:34:18.000\n that are actually ones that are going to likely catapult your career and most of the olympic\n\n2:34:18.000 --> 2:34:22.080\n distance endurance events so so he just revolutionized the sport and then to add even\n\n2:34:22.080 --> 2:34:27.040\n more flavor to the whole thing i mean he died a very premature death he got a car accident and\n\n2:34:27.600 --> 2:34:33.760\n died before he would have likely probably medaled at the olympics so he and there is a tragedy the\n\n2:34:33.760 --> 2:34:40.800\n fact that he didn't yeah well he was fourth place at the olympics the prior his first go of it and\n\n2:34:40.800 --> 2:34:44.160\n it was kind of one of those things where it's like fourth place at the olympics is the first man\n\n2:34:44.160 --> 2:34:48.320\n looking out of the first woman looking out and for a guy that had as much hype as him i think\n\n2:34:48.320 --> 2:34:52.640\n like a medal was something he really wanted to take home with him there and especially how that\n\n2:34:52.640 --> 2:34:58.400\n race went i mean yeah i don't know it's it's it's tragic the whole thing but that's one of the things\n\n2:34:58.400 --> 2:35:04.880\n that makes olympics amazing is the tragedy of it like one race decides the story of a lifetime which\n\n2:35:04.880 --> 2:35:11.040\n is like yeah that's why it's that's why it's amazing even if a lot of people get hurt because of it\n\n2:35:12.640 --> 2:35:19.680\n tragedy makes the the triumph special right yeah and well it makes i mean it makes life\n\n2:35:19.680 --> 2:35:23.920\n like a movie almost exactly you know if everything's all sunshine and rainbows then\n\n2:35:23.920 --> 2:35:28.560\n it's not as entertaining to watch yeah there's no adversity to overcome you mentioned shoe technology\n\n2:35:28.560 --> 2:35:34.880\n how much has shoe technology advanced through the past few decades how much has it changed running\n\n2:35:34.880 --> 2:35:41.040\n generally but also running like ultra marathon running i would say an ultra running it's had\n\n2:35:41.040 --> 2:35:49.200\n much of a less of an impact because ultra running is still heavily skewed towards the trails so the\n\n2:35:49.200 --> 2:35:53.360\n technology at least from what we know isn't necessarily translating over to these like\n\n2:35:53.360 --> 2:35:57.840\n massive varied terrain certainly not the technical terrain and things like that now on road races\n\n2:35:57.840 --> 2:36:03.760\n flat stuff like the track stuff the roads the run i guess you a runnable trail um where it's\n\n2:36:03.760 --> 2:36:08.720\n like basically crushed limestone more or less uh you definitely get an advantage from it it's uh\n\n2:36:08.720 --> 2:36:16.880\n and essentially what what happened um is in this probably dated back actually before 2015 uh you\n\n2:36:16.880 --> 2:36:24.080\n know nike decided well their their their uh development team uh was ahead of the curve they've\n\n2:36:24.080 --> 2:36:30.000\n developed this new foam they call like a pibak foam uh and they they realized that like when you\n\n2:36:30.000 --> 2:36:35.440\n step down into a shoe the reason like uh racers a lot of times would wear these flats because they're\n\n2:36:35.440 --> 2:36:41.360\n trying to take out any of that lost energy into the foam in the shoe well this foam that nike\n\n2:36:41.360 --> 2:36:47.360\n came out with is so good that it actually returns way more energy than the average foam did to the\n\n2:36:47.360 --> 2:36:51.040\n point where like when they test these things on like force plate treadmills and things like that\n\n2:36:51.040 --> 2:36:55.520\n it's like a depending on the person's gait and some of things like a two to eight percent\n\n2:36:55.520 --> 2:37:00.560\n improvement in performance i mean we've seen records just across the board get broken since\n\n2:37:00.560 --> 2:37:07.600\n this came out all distances basically yeah yeah i i think from at least from the 5k up through\n\n2:37:07.600 --> 2:37:13.200\n the marathon and i mean we've seen some insane improvements in the marathon i think like uh the\n\n2:37:13.200 --> 2:37:20.400\n women's marathon went from what was considered relatively untouchable like 216 to a 214 and\n\n2:37:20.400 --> 2:37:26.400\n i mean like it was like 218 was like just world class like if you could run a 218 marathon as a\n\n2:37:26.400 --> 2:37:30.640\n woman that was like i mean it still is to a degree but then you know now you have someone run a 214\n\n2:37:31.600 --> 2:37:36.640\n like that's a huge and you attributed a lot of that to the the shoe yeah yeah i think there's\n\n2:37:36.640 --> 2:37:40.080\n probably other things that come in mind too like now that people know there's a performance\n\n2:37:40.080 --> 2:37:44.240\n advantage from a mechanical standpoint it's also a confidence thing where it's like oh now i can\n\n2:37:44.240 --> 2:37:48.640\n probably try going five seconds per mile faster and maybe they could have anyway and they just\n\n2:37:48.640 --> 2:37:52.400\n now they think they can so they are so there's probably a little bit of that that's just adding\n\n2:37:52.400 --> 2:37:57.360\n to it do you think there's a lot of extra innovation that's still possible like what yeah\n\n2:37:57.360 --> 2:38:02.240\n if you could do this kind of big leap uh with a little innovation of foam is there other stuff\n\n2:38:02.240 --> 2:38:07.200\n that you can do or further innovation materials that make up the foam yeah so they can definitely\n\n2:38:07.200 --> 2:38:12.880\n go much more advantage they put a cap on it essentially so there was a there's also a carbon\n\n2:38:12.880 --> 2:38:16.880\n plate element to this too where they put like this carbon plate in there in between the foam\n\n2:38:16.880 --> 2:38:24.160\n so like i believe when when kipchiki broke well when they did that that kind of uh uh the sub\n\n2:38:24.160 --> 2:38:30.160\n two hour project he actually had on a shoe if i'm not mistaken that never got to market because\n\n2:38:30.160 --> 2:38:35.040\n they put down some parameters on it after uh before it that one came to market where it was\n\n2:38:35.040 --> 2:38:40.000\n actually like stacked up to i can't remember how many millimeters it was an insane amount and they\n\n2:38:40.000 --> 2:38:44.640\n had like i think maybe even three layer plates in there and that was a nike shoe he was wearing yeah\n\n2:38:44.640 --> 2:38:50.960\n yeah so what makes it kind of controversial or difficult is nike came out with these prototypes\n\n2:38:50.960 --> 2:38:55.040\n so a prototype for people don't understand shoes like these these companies they'll develop a shoe\n\n2:38:55.040 --> 2:38:59.520\n and it usually takes like somewhere in the neighborhood of like probably 18 months to hit\n\n2:38:59.520 --> 2:39:05.120\n the market so if you're like a sponsored athlete or work for the company you can get your hands\n\n2:39:05.120 --> 2:39:09.920\n on these shoes before they actually come to market so we had an issue i think this wasn't\n\n2:39:09.920 --> 2:39:14.880\n necessarily as big of an issue in the ultra running community but uh in the track and field olympic\n\n2:39:14.880 --> 2:39:20.480\n distance stuff was a big issue because you had nike athletes having these prototype shoes before\n\n2:39:20.480 --> 2:39:24.400\n anyone could get them and then you had athletes were sponsored by these other brands who couldn't\n\n2:39:24.400 --> 2:39:29.760\n wear them even if even when they did come to market so then we had this like chase to catch up\n\n2:39:29.760 --> 2:39:34.080\n where uh other companies are starting to make their own version of it and now we're getting to\n\n2:39:34.080 --> 2:39:41.600\n a point where most companies have a version of that shoe um but we had a huge transition phase\n\n2:39:41.600 --> 2:39:47.760\n that impacted the olympics big time i mean think of here here's a here's an example of it uh there's\n\n2:39:47.760 --> 2:39:55.280\n a there was a an athlete cara goucher um she was not she was a nike athlete wasn't uh when they\n\n2:39:55.280 --> 2:40:01.680\n came out with this shoe and she ran the olympic trial marathon and got fourth place the first\n\n2:40:01.680 --> 2:40:07.680\n person out and uh two of the people had ever had that shoe on and she was maybe a minute or two like\n\n2:40:07.680 --> 2:40:12.320\n i'd have to look to see exactly but it was within the the performance advantage range and so you\n\n2:40:12.320 --> 2:40:17.840\n could argue that she was the first person in modern running to lose an olympic spot due to\n\n2:40:17.840 --> 2:40:24.000\n a technological disadvantage wow and and it's like i mean it's one of those yeah i mean it's one of\n\n2:40:24.000 --> 2:40:30.720\n those things where like um it's it's a transition right so there's gonna be bumpy road and there's\n\n2:40:30.720 --> 2:40:36.800\n gonna be people that get caught in that transition that it's unfortunate for but it's also like uh\n\n2:40:36.800 --> 2:40:41.680\n you know once everything does catch up and every shoe company has a version of this there's still\n\n2:40:41.680 --> 2:40:46.080\n problems i mean these are incredibly expensive shoes it's like a 250 shoe so it's like at what\n\n2:40:46.080 --> 2:40:51.600\n point do you tell like a wealthy family with a high school kid that you know you can get that\n\n2:40:51.600 --> 2:40:55.680\n 250 shoe but then you go and this kid's family can barely afford a pair of shoes for them much\n\n2:40:55.680 --> 2:41:03.040\n less a 250 parachute like where do we draw that line and that sort of stuff um also just here's\n\n2:41:03.040 --> 2:41:07.280\n the other big one like let's i mean two to eight percent is a massive range what if you're on the\n\n2:41:07.280 --> 2:41:12.080\n two percent versus someone's on the eight percent you know chances are if you're you know blowing\n\n2:41:12.080 --> 2:41:16.960\n a record out of the water you're probably closer to that high end percentage versus someone who's\n\n2:41:16.960 --> 2:41:21.520\n maybe getting incremental gains you're probably closer to that lower end so is it fair to have\n\n2:41:21.520 --> 2:41:25.920\n a piece of equipment that has that big of a range when we're talking about less than a percent\n\n2:41:25.920 --> 2:41:30.640\n determining these races when all is held constant those are fascinating like philosophical questions\n\n2:41:30.640 --> 2:41:35.760\n that i think it's nice to solve that for the shoe or to raise those questions for a shoe\n\n2:41:35.760 --> 2:41:40.160\n because the more complicated place where they will be raised is probably like genetics\n\n2:41:40.160 --> 2:41:45.520\n genetic engineering all those kinds of things yeah it'll get a lot more complicated so it's\n\n2:41:45.520 --> 2:41:49.040\n nice when you have like a particular piece of technology that's just like right there it's\n\n2:41:49.040 --> 2:41:55.120\n a shoe we can understand it we can study it right we may be coming on the precipice of like\n\n2:41:55.120 --> 2:41:59.840\n human powered sport performance is no longer being something that we like look at as this\n\n2:41:59.840 --> 2:42:05.520\n like pinnacle of uh like i guess i don't maybe entertainment's the wrong word but like is that\n\n2:42:05.520 --> 2:42:10.400\n a pursuit you know do we end up just going a different direction i mean i think it's like\n\n2:42:10.400 --> 2:42:14.000\n it's so hard for us to think about that right now because it's so part of like the culture\n\n2:42:14.000 --> 2:42:19.520\n and the lifestyle of the average person where like sport is a hobby of theirs as well as a\n\n2:42:19.520 --> 2:42:25.440\n passion to follow and it's like how complicated does it need to get before people lose that\n\n2:42:25.440 --> 2:42:31.120\n interest and and there could be a future where most of the olympics is esports somebody told me\n\n2:42:31.120 --> 2:42:36.960\n that esports is in the olympics i've been meaning to look this up which is you know like what video\n\n2:42:36.960 --> 2:42:44.240\n so video games are in the olympics yeah yeah it could be as like a trial that they're doing um\n\n2:42:44.240 --> 2:42:51.120\n yeah if this is true i'm trying in real time look it up but if this esports joining olympics in 2024\n\n2:42:51.840 --> 2:42:59.760\n wow so that could be just a that could be a fun side thing but it could be a first step into a\n\n2:42:59.760 --> 2:43:03.680\n complete transformation what sports mean yeah because you can control video games better than\n\n2:43:03.680 --> 2:43:09.840\n you control for genetics and humans well and in reality we've been dealing with this problem in\n\n2:43:09.840 --> 2:43:14.160\n other areas just with the performance enhancing side of things with drugs and all that stuff too\n\n2:43:14.160 --> 2:43:19.040\n and anyway that that conversation's flared back up with track and field too where we are seeing a lot\n\n2:43:19.040 --> 2:43:23.680\n of records get broken a lot of it probably is to shoot technology but you know in 2020 with the\n\n2:43:23.680 --> 2:43:28.800\n covid stuff you have all these out of competition testing protocols that a lot of these top tier\n\n2:43:28.800 --> 2:43:34.880\n olympic athletes are getting uh to try to eliminate like if you just do inter competition\n\n2:43:34.880 --> 2:43:40.080\n testing like there's potential for people to do things that are uh going to give them a\n\n2:43:40.080 --> 2:43:45.520\n performance advantage but not going to show up on that test on the day of or after their race where\n\n2:43:45.520 --> 2:43:50.320\n now you have these like limitations of being able to test so do we have a like a group of athletes\n\n2:43:50.320 --> 2:43:54.880\n now who decide oh i'm not going to get tested in 2020 do the covid restrictions this is the time\n\n2:43:54.880 --> 2:43:59.360\n to dope up and then you know hit some stride and some records and then you taper back off when they\n\n2:43:59.360 --> 2:44:03.360\n get this thing fired back up again and so there may be some of that as well and i mean that's\n\n2:44:03.360 --> 2:44:07.600\n always been an ongoing problem and yeah so the boost you get from performance enhancing drugs\n\n2:44:07.600 --> 2:44:11.680\n could be tying you relative to the stuff we have in the future right yeah so you might be the last\n\n2:44:11.680 --> 2:44:19.680\n generation of like natural unmodified humans that were running and who knows maybe that's already\n\n2:44:19.680 --> 2:44:25.760\n over who knows who's who's modified that that's that's true you might we might be living through\n\n2:44:25.760 --> 2:44:33.360\n that transition to the new nike shoe but broadly defined yeah so you'll be uh in some sense in in\n\n2:44:33.360 --> 2:44:40.000\n the history books as uh humans used to run without any modifications they used to destroy their body\n\n2:44:40.000 --> 2:44:46.000\n and let it recover and then do it again and they used to be impressed with a with an 11 hour\n\n2:44:46.000 --> 2:44:54.320\n an 100 mile time when we could do it in under an hour now yeah yeah so uh but nevertheless it\n\n2:44:54.320 --> 2:45:01.600\n is incredible the four mile the four minute mile was incredibly impressive uh the i really love\n\n2:45:01.600 --> 2:45:09.680\n the 11 hour mark for the 100 miler and the two hour marathon by most people um for the longest\n\n2:45:09.680 --> 2:45:14.640\n time will start to be impossible you know there's still people that think it's impossible with under\n\n2:45:14.640 --> 2:45:23.920\n certain constraints so uh uh eliot kipchoge of kenya as you mentioned ran a one hour 59 minute\n\n2:45:23.920 --> 2:45:32.400\n 40 second marathon but he had like you said the prototype shoes and he had the the the pace\n\n2:45:32.400 --> 2:45:37.680\n setters yeah i don't know how essential that is but it seems quite essential do you think it's\n\n2:45:37.680 --> 2:45:43.280\n possible first of all what do you think about that accomplishment uh and he is one of the greatest if\n\n2:45:43.280 --> 2:45:47.840\n not the greatest marathon runners of all time what do you think about that accomplishment and\n\n2:45:47.840 --> 2:45:53.120\n do you think it's possible to run a two hour marathon without any assistance yeah i mean\n\n2:45:53.120 --> 2:45:57.520\n i think yeah there's no question about it regardless of technology he's world class if\n\n2:45:57.520 --> 2:46:06.640\n not the best um the i think he i think he could go under two or someone equivalent to him could\n\n2:46:06.640 --> 2:46:14.080\n go under two hours with with the shoe technology probably what it'll take is it'll take a fast\n\n2:46:14.080 --> 2:46:20.400\n course a course that has like very few tangents because like you know turning on a course they\n\n2:46:20.400 --> 2:46:25.360\n estimate adds about a percent to the to the distance so you know when we're talking about\n\n2:46:25.360 --> 2:46:29.440\n a marathon you're getting up to like a quarter mile extra running you know that alone could\n\n2:46:29.440 --> 2:46:34.640\n potentially put you down near near too flat based on what you know we're seeing because i mean\n\n2:46:34.640 --> 2:46:41.680\n kip jaggi he's got a was it 201 40 i believe is his actual world record where it's actually like\n\n2:46:41.680 --> 2:46:47.360\n you know certified so i mean he's right on the door knocking knocking on the door there um yeah\n\n2:46:47.360 --> 2:46:51.680\n the prototype he had since then they put in a regulation where you can't stack a shoe for the\n\n2:46:51.680 --> 2:46:56.400\n roads more than 40 millimeters so you can only have so much of that energy returning foam and\n\n2:46:56.400 --> 2:47:02.160\n you can only have i think one carbon plate in there now uh so that puts a little bit of a\n\n2:47:02.160 --> 2:47:08.240\n ceiling on that technological thing uh but but who knows what else will come out that and and\n\n2:47:08.240 --> 2:47:13.040\n and to be honest who comes out with it because the fact that nike came out with this technology\n\n2:47:13.040 --> 2:47:17.760\n is the reason why it's being allowed to be used if that would have been like you know another\n\n2:47:17.760 --> 2:47:22.480\n running company that that came out with it i'm sure the the regulations would have been slapped\n\n2:47:22.480 --> 2:47:25.360\n down on it immediately and they would have probably just thrown it out all together would\n\n2:47:25.360 --> 2:47:32.240\n have been this politics yeah oh yeah well and i mean it's it you can go you can go super like\n\n2:47:32.240 --> 2:47:37.920\n you know negative with that and say like hey like this is like this is terrible or this is like super\n\n2:47:37.920 --> 2:47:43.360\n nefarious when in reality it's like you know you have a company that has you know billions of\n\n2:47:43.360 --> 2:47:48.160\n dollars and is interested enough in the sport that otherwise doesn't generate a ton of revenue\n\n2:47:48.800 --> 2:47:55.040\n to you know pick up a big tab and support like uh you know track and field and things like that but\n\n2:47:55.040 --> 2:48:00.960\n you know with that you know you you want to be the guy who says yeah thanks for the millions\n\n2:48:00.960 --> 2:48:06.320\n and millions of dollars but we're gonna all those years and money you spent on that phone\n\n2:48:06.320 --> 2:48:11.200\n yeah you wasted it we're not gonna let you use it but you know if you're another company who uh\n\n2:48:11.200 --> 2:48:17.040\n you know revolutionizes the sport in potentially a negative way uh you know maybe maybe you say no\n\n2:48:17.040 --> 2:48:21.920\n to them so it gets interesting that's the way that's how it always happens yeah yeah there's\n\n2:48:21.920 --> 2:48:25.680\n really no way around i think phil mephiton i think it's him that he wrote a book about a\n\n2:48:25.680 --> 2:48:30.320\n two hour marathon what are the limits how fast could we run and i think he puts it like an hour\n\n2:48:30.320 --> 2:48:35.440\n and 42 minutes something like that or 40 something minutes it's kind of interesting question uh of\n\n2:48:35.440 --> 2:48:41.600\n what are the limits uh do you think do you think we'll just keep pushing the limits of what humans\n\n2:48:41.600 --> 2:48:48.000\n are capable of in the ultras in the marathon is this just like the way yeah the uh the way of\n\n2:48:48.000 --> 2:48:55.200\n sport i think ultra for sure because that is a vastly growing sport and it's there's\n\n2:48:56.320 --> 2:49:02.080\n there's a lot of potential for much bigger popular much pool bigger pool of like talent to pull from\n\n2:49:02.720 --> 2:49:07.760\n uh that could really push the needle down on some of these performances and things like that\n\n2:49:07.760 --> 2:49:13.200\n uh especially as it becomes more popular if if people start realizing or i shouldn't say realizing\n\n2:49:13.200 --> 2:49:17.920\n but if a scenario happens where like oh i'm one of the best endurance athletes in the world i make\n\n2:49:17.920 --> 2:49:21.840\n more money running ultra marathons than i do running the marathon then you know all of a\n\n2:49:21.840 --> 2:49:29.200\n sudden we see every record get broken in a matter of a couple of years uh but the the for the marathon\n\n2:49:29.200 --> 2:49:35.920\n i mean it's gonna get faster i think but like to what degree is so hard to know it's very hard to\n\n2:49:35.920 --> 2:49:40.880\n know and the one hour and 40 minutes seems like that's pretty fast yes that's very fast i mean\n\n2:49:40.880 --> 2:49:47.360\n for folks for some perspective there the current world record is like in the 440s per mile per mile\n\n2:49:47.360 --> 2:49:52.320\n like just to add a little flavor to that you're basically sprinting yeah i mean go out to a track\n\n2:49:53.120 --> 2:49:59.520\n and run one lap as fast as you can and then reflect on what time you get and realize like\n\n2:49:59.520 --> 2:50:07.920\n the world record for the marathon is that is that lap at just over 70 seconds per lap so a minute\n\n2:50:07.920 --> 2:50:15.360\n and 10 just over that but you're doing it 26.2 miles so so over a hundred times it's mind boggling\n\n2:50:15.360 --> 2:50:20.880\n but watching elliot kipchoge just first of all he was like smiling at the end of it so the there's\n\n2:50:20.880 --> 2:50:28.880\n an extreme efficiency here too so he's not he's able to just find the right way to maximize yeah\n\n2:50:28.880 --> 2:50:33.920\n maximize efficiency it makes it look easy i mean that that's true for basically every olympic\n\n2:50:33.920 --> 2:50:40.720\n athlete when you watch gymnasts they kind of make it look easy yeah but there's like tens if not\n\n2:50:40.720 --> 2:50:45.600\n hundreds of thousands of hours behind that training yeah just to be comfortable enough to even attempt\n\n2:50:45.600 --> 2:50:50.880\n some of the moves they do in gymnastics is mind boggling that one is super awesome because uh\n\n2:50:50.880 --> 2:50:57.120\n how tragic it is like one little slip up yeah four years of work and your route it's all gone\n\n2:50:57.120 --> 2:51:02.240\n not just four years of work for many of them a lifetime a lifetime of work and they're teenagers\n\n2:51:02.240 --> 2:51:08.640\n and they're teenagers and they get dedicated everything to it that's that's what makes the\n\n2:51:08.640 --> 2:51:13.120\n pursuits of humans so fascinating we kind of talked about this a little bit already but\n\n2:51:14.080 --> 2:51:18.240\n is there something that stands out to you as one of the hardest things you've had to overcome\n\n2:51:19.040 --> 2:51:23.840\n in all the either training or the competing that you've done has there been moments that\n\n2:51:23.840 --> 2:51:30.160\n kind of stand out where you're proud of yourself that that you were truly tested and you overcame\n\n2:51:30.160 --> 2:51:36.400\n it i think i'd be more inclined just because it stands out to me much bigger than any one like\n\n2:51:36.400 --> 2:51:43.520\n hard decision or outcome i had from a particular race is just like the trajectory of like you know\n\n2:51:43.520 --> 2:51:49.760\n doing what i'm doing now is so much different from what i would have ever expected uh you know\n\n2:51:49.760 --> 2:51:54.080\n i mean i was a talented enough runner where i could make the state meet by my senior year at a\n\n2:51:54.080 --> 2:52:00.160\n small division three school and you know compete at a division three college and be pretty modest\n\n2:52:00.160 --> 2:52:06.800\n talent comparative to my to my peers at the top level of division three to think that like i'd be\n\n2:52:06.800 --> 2:52:13.440\n doing anything that was revolved around running as as an occupation is is uh i still second guess\n\n2:52:13.440 --> 2:52:18.320\n that that's actually occurring makes me wonder about the whole simulation theory thing it's like\n\n2:52:18.320 --> 2:52:25.040\n who's got my joystick and exactly uh but they got cheat codes yeah exactly yeah because i mean i\n\n2:52:25.040 --> 2:52:28.960\n went to school to be a teacher and i really loved that profession i taught for about five years and\n\n2:52:28.960 --> 2:52:33.200\n then i got to a point where you know some of it's just perfect timing too like the sport gained\n\n2:52:33.200 --> 2:52:36.960\n enough popularity where there's enough money in it where like i could start a coaching business i\n\n2:52:36.960 --> 2:52:41.760\n could get sponsorships and things like that and actually look at it and say financially i can make\n\n2:52:41.760 --> 2:52:48.800\n a go of this or at least risk it but there's such a fine line between like deciding to do that or\n\n2:52:48.800 --> 2:52:53.360\n kind of staying comfortable because uh i mean i was at the perfect teaching spot for me i was at\n\n2:52:53.360 --> 2:52:59.120\n this uh like project based learning school and just outside of madison wisconsin loved it um one\n\n2:52:59.120 --> 2:53:02.720\n of the hardest decisions my life to make was to step away from that to pursue running and more\n\n2:53:02.720 --> 2:53:08.720\n holistically um and i mean i almost didn't i had a co teacher who was uh i was thinking myself i\n\n2:53:08.720 --> 2:53:12.080\n knew that was like a decision i was gonna have to make the next few years but it was such an easy\n\n2:53:12.080 --> 2:53:16.800\n decision to say well wait one more year and he was just like he was a little more of a free spirit\n\n2:53:16.800 --> 2:53:21.680\n than i was certainly at the time he's like dude what are you waiting for just go why are you here\n\n2:53:21.680 --> 2:53:26.480\n like like after i told him that he like every time we'd we'd i'd come into i'd come into school the\n\n2:53:26.480 --> 2:53:31.440\n next day and he'd be like why are you still here but i mean that was there's a tongue in cheek for\n\n2:53:31.440 --> 2:53:35.280\n sure but uh but it's hard to know that you're going to be successful right in that kind of\n\n2:53:35.280 --> 2:53:43.200\n leap given your like you know because it's easier when you're like an ultra performer early on but\n\n2:53:43.200 --> 2:53:48.960\n to have the faith that you can accomplish something in some regards it's a blessing in the sense that\n\n2:53:48.960 --> 2:53:56.480\n like uh you know failing would have been fairly predictable right whereas if like you know i always\n\n2:53:56.480 --> 2:54:01.520\n wonder i mean i think of these like especially the big sports like baseball football and basketball\n\n2:54:01.520 --> 2:54:08.960\n and you get you know guys who guys and girls who are like identified in like early high school as\n\n2:54:08.960 --> 2:54:16.080\n being the next and it's like what kind of pressure is that to think like well if i'm not like literally\n\n2:54:16.080 --> 2:54:20.800\n one of the best players in the nba in 10 years i failed yeah it's just mind boggling to think if\n\n2:54:20.800 --> 2:54:25.440\n i'm not one of the best at one of the most competitive sports on the planet in what is an\n\n2:54:25.440 --> 2:54:30.240\n athletic i think an athletic state of an nba basketball player is probably one of the most\n\n2:54:30.240 --> 2:54:36.720\n athletic human beings on the planet and to know like at in a teenage year that your your your\n\n2:54:36.720 --> 2:54:41.680\n your success bar is being the best one of the best in the league or the best ever and that\n\n2:54:41.680 --> 2:54:46.720\n conversation is floating around everywhere you look and see versus being able to kind of quietly\n\n2:54:46.720 --> 2:54:51.200\n fail and go back to teaching this makes it a little more digestible i think you have a little\n\n2:54:51.200 --> 2:54:57.440\n bit of more freedom to be great right nobody's expecting you to be right uh is there from that\n\n2:54:57.440 --> 2:55:04.080\n is there advice you can give to young people today high schoolers college students taking on\n\n2:55:04.080 --> 2:55:10.400\n trying to figure out their career trying to figure out their life advice on how to succeed in either\n\n2:55:10.400 --> 2:55:14.880\n yeah i think uh you know one thing i was always interested when i was teaching was like you'd\n\n2:55:14.880 --> 2:55:19.680\n have these you'd have students who had like interests they had what they were good at and\n\n2:55:19.680 --> 2:55:24.880\n sometimes those ran in in unison with one another other times they didn't and it was always\n\n2:55:24.880 --> 2:55:30.240\n interesting to me when you'd have a student who's like i'm really into like you know guitar or i'm\n\n2:55:30.240 --> 2:55:35.440\n really into skateboarding or something like that where it's like pretty small like success rate on\n\n2:55:35.440 --> 2:55:40.240\n that avenue versus what you could maybe accomplish by focusing on just something like a little more\n\n2:55:40.240 --> 2:55:48.400\n standard and i think like really like besides the likelihood of it becoming something you can turn\n\n2:55:48.400 --> 2:55:52.560\n into a profession or not you should just ask yourself like is this something that i want to\n\n2:55:52.560 --> 2:55:59.120\n spend my free time doing uh and because if it is then you want to keep that in your life because\n\n2:55:59.120 --> 2:56:02.640\n that's something that's rewarding motivating it might be the catalyst that gets you out of\n\n2:56:02.640 --> 2:56:06.880\n bed in the morning and you know go to another job in order to go do that thing afterwards and i think\n\n2:56:06.880 --> 2:56:15.840\n nowadays we're getting to a point where like the your reach ability from even a really small like\n\n2:56:16.480 --> 2:56:22.480\n unmonetized thing previously is now an option where if like you live in a city where there's\n\n2:56:22.480 --> 2:56:25.840\n only two other people interested in your topic of area so you're not gonna be able to turn into a\n\n2:56:25.840 --> 2:56:31.200\n job now with the internet you have the world at your disposal so that two to three people in every\n\n2:56:31.200 --> 2:56:35.840\n town can turn into thousands tens of thousands hundreds of millions of people and if you\n\n2:56:35.840 --> 2:56:40.160\n really focus your time and energy into that thing then you know who knows where you can go and how\n\n2:56:40.160 --> 2:56:43.760\n much more enjoyable your life can be if you're able to turn your career into a passion of yours\n\n2:56:43.760 --> 2:56:50.880\n so i think like that is something i would tell tell people um focus on that see the thing you're\n\n2:56:50.880 --> 2:56:57.760\n good at and you kind of sparks that flame and uh go with that even if society doesn't really want\n\n2:56:57.760 --> 2:57:05.680\n you to uh like it's non traditional uh and the odds are low of like traditionally defined success\n\n2:57:06.080 --> 2:57:11.840\n just do that thing i've struggled with that it's like it was always clear especially like in school\n\n2:57:11.840 --> 2:57:16.640\n there's stuff i'm actually good at and stuff that the world wants me to do right yeah and i kept\n\n2:57:16.640 --> 2:57:22.000\n doing the world wanted me to be a plumber when i took that test my sophomore year but even like\n\n2:57:22.000 --> 2:57:29.120\n like academically just going to university and uh academia there's certain ways even in in i would\n\n2:57:29.120 --> 2:57:35.360\n say even in the thing you want to do the way you do that thing the world will want you to do in a\n\n2:57:35.360 --> 2:57:41.920\n certain way and even just like finding your way of doing that thing is uh is really powerful like\n\n2:57:41.920 --> 2:57:50.480\n for me the way i do research the way i learn is is different than colleagues of mine and i realized\n\n2:57:50.480 --> 2:57:55.680\n i realized that that i really like to follow things i'm passionate about versus sort of the\n\n2:57:55.680 --> 2:58:00.400\n rigor of studying every like the fundamentals all across the board and building up in castle\n\n2:58:01.280 --> 2:58:06.480\n um on the fundamentals like layer upon layer just there's a bunch of details in the way i\n\n2:58:06.480 --> 2:58:11.760\n pursue the very thing that i currently do that's different than others and it took me quite a long\n\n2:58:11.760 --> 2:58:16.720\n time to accept like you don't need to do it the way everyone else is doing it doesn't not everyone\n\n2:58:16.720 --> 2:58:20.800\n else but the majority of people are telling you to do it because one is beneficial to do it\n\n2:58:20.800 --> 2:58:26.000\n different because then you'll more likely stand out and two like why the hell are you doing it\n\n2:58:26.000 --> 2:58:32.080\n the way it's not working for you yeah yeah you know i saw that all the time when i was teaching\n\n2:58:32.080 --> 2:58:37.600\n i was dual certified i was my my certifications were in history and broadfield social studies so\n\n2:58:37.600 --> 2:58:44.320\n like econ uh psychology history all that stuff and then i also had a certification of special\n\n2:58:44.320 --> 2:58:49.200\n education which was you know people think of special education a lot of times as like oh it's\n\n2:58:49.200 --> 2:58:53.200\n the you know the kid who is not smart enough to do the regular thing when reality it's like\n\n2:58:53.920 --> 2:58:58.720\n i mean there is some you know there's obviously like you know like certain things like down\n\n2:58:58.720 --> 2:59:03.360\n syndrome and stuff like that but like there's also like a huge population of groups of both\n\n2:59:03.360 --> 2:59:08.240\n like gifted and talented on one end of the spectrum where they're incredibly smart and\n\n2:59:08.240 --> 2:59:13.360\n they're like the geniuses but for whatever reason the standard method of learning does not click\n\n2:59:13.360 --> 2:59:17.840\n with them does not work with them and then they just need a slightly different path or maybe\n\n2:59:17.840 --> 2:59:22.320\n a drastically different path and they're gonna just flourish and you have kids that end up\n\n2:59:22.320 --> 2:59:27.920\n falling on the other end where you know maybe it's really difficult for them to be able to read at\n\n2:59:27.920 --> 2:59:34.080\n the speed of other students but if you give them this specific direction they can just thrive in\n\n2:59:34.080 --> 2:59:40.400\n a certain area and just seeing that like the you know like that there's multiple ways to do stuff\n\n2:59:40.400 --> 2:59:45.440\n and there's not necessarily one path to the end is i think such an eye opening thing to learn\n\n2:59:45.440 --> 2:59:49.440\n especially if you learn maybe that's what i should answer the question that you asked me with is you\n\n2:59:49.440 --> 2:59:54.240\n know keep an open mind as to what paths are forward and know that you know maybe just because\n\n2:59:55.040 --> 2:59:58.400\n even if you look to your left you know to the right and all your classmates are successful\n\n2:59:58.400 --> 3:00:00.720\n doing it one way it doesn't necessarily mean that's going to be the way for you\n\n3:00:01.280 --> 3:00:05.600\n yeah so that could lend you in eating a meat based diet running across the country\n\n3:00:05.600 --> 3:00:10.960\n uh like the the incredible madman that you are zack i'm a huge fan as i told you many times you're\n\n3:00:10.960 --> 3:00:16.320\n an inspiration to many i'll be there checking in every day if you somehow make it out the starting\n\n3:00:16.320 --> 3:00:22.080\n line on september 1st i know i know joe rogan and millions of others will be as well so i'm excited\n\n3:00:22.080 --> 3:00:25.840\n to see all the suffering that you're going to go through i wish you the best of luck and\n\n3:00:25.840 --> 3:00:29.200\n thank you so much for talking today i really really appreciate it well thanks a bunch of\n\n3:00:29.200 --> 3:00:34.160\n likes it's been a an honor to come on your podcast i've been a fan of it for uh 10 years\n\n3:00:34.160 --> 3:00:39.520\n i've been a fan of it for uh for quite some time and um i thought about wearing a white suit but\n\n3:00:40.240 --> 3:00:46.000\n michael malice already took care of that one so it was well and uh i think it'll be really good\n\n3:00:46.000 --> 3:00:51.360\n for the ratings of this conversation if you end up dying during that run so i'll do my best so\n\n3:00:51.360 --> 3:00:56.480\n the everything that could happen will be positive for for the world you're saying i should try to\n\n3:00:56.480 --> 3:01:02.080\n average 100 miles a day 100 miles well i think you're going to push yourself to again it's not\n\n3:01:02.080 --> 3:01:07.600\n a priority but it's trying to beat that record that's probably going to take everything you have\n\n3:01:07.600 --> 3:01:13.840\n and that that that's truly inspiring i wish you the best of luck man thanks a bunch thanks for\n\n3:01:13.840 --> 3:01:21.040\n listening to this conversation with zac bitter and thank you to ladder belcampo noom and better help\n\n3:01:21.040 --> 3:01:26.560\n check them out in the description to support this podcast and now let me leave you with some words\n\n3:01:26.560 --> 3:01:33.280\n steve prefontaine i'm going to work so that's a pure guts race at the end and if it is i'm the\n\n3:01:33.280 --> 3:01:58.640\n only one who can win it thank you for listening and hope to see you next time\n\n"
}