{
  "title": "Eric Weinstein: Revolutionary Ideas in Science, Math, and Society | Lex Fridman Podcast #16",
  "id": "2wq9x2QcZN0",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:03.520\n The following is a conversation with Eric Weinstein.\n\n00:03.520 --> 00:08.820\n He's a mathematician, economist, physicist, and the managing director of Teal Capital.\n\n00:08.820 --> 00:14.500\n He coined the term, and you can say, is the founder of the intellectual dark web, which\n\n00:14.500 --> 00:19.920\n is a loosely assembled group of public intellectuals that includes Sam Harris, Jordan Peterson,\n\n00:19.920 --> 00:24.920\n Steven Pinker, Joe Rogan, Michael Shermer, and a few others.\n\n00:24.920 --> 00:30.340\n This conversation is part of the Artificial Intelligence Podcast at MIT and beyond.\n\n00:30.340 --> 00:36.280\n If you enjoy it, subscribe on YouTube, iTunes, or simply connect with me on Twitter at Lex\n\n00:36.280 --> 00:39.320\n Friedman, spelled F R I D.\n\n00:39.320 --> 00:44.600\n And now, here's my conversation with Eric Weinstein.\n\n00:44.600 --> 00:46.400\n Are you nervous about this?\n\n00:46.400 --> 00:47.400\n Scared shitless.\n\n00:47.400 --> 00:48.400\n Okay.\n\n00:48.400 --> 00:54.660\n You mentioned Kung Fu Panda as one of your favorite movies.\n\n00:54.660 --> 00:58.180\n It has the usual profound master student dynamic going on.\n\n00:58.180 --> 01:04.080\n So who was, who has been a teacher that significantly influenced the direction of your thinking\n\n01:04.080 --> 01:05.080\n and life's work?\n\n01:05.080 --> 01:08.080\n So if you're the Kung Fu Panda, who was your Shifu?\n\n01:08.080 --> 01:12.240\n Oh, well, it's interesting because I didn't see Shifu as being the teacher.\n\n01:12.240 --> 01:13.240\n Who was the teacher?\n\n01:13.240 --> 01:15.500\n Oogway, Master Oogway.\n\n01:15.500 --> 01:16.500\n The turtle.\n\n01:16.500 --> 01:17.500\n Oh, the turtle.\n\n01:17.500 --> 01:18.500\n Right.\n\n01:18.500 --> 01:21.260\n They only meet twice in the entire film.\n\n01:21.260 --> 01:25.180\n And the first conversation sort of doesn't count.\n\n01:25.180 --> 01:33.100\n So the magic of the film, in fact, its point is that the teaching that really matters is\n\n01:33.100 --> 01:40.140\n transferred during a single conversation and it's very brief.\n\n01:40.140 --> 01:42.660\n And so who played that role in my life?\n\n01:42.660 --> 01:51.220\n I would say, uh, either, uh, my grandfather, uh, Harry Rubin and his wife, Sophie Rubin,\n\n01:51.220 --> 01:54.300\n my grandmother, or Tom Lehrer.\n\n01:54.300 --> 01:56.100\n Tom Lehrer?\n\n01:56.100 --> 01:57.460\n Yeah.\n\n01:57.460 --> 01:58.460\n In which way?\n\n01:58.460 --> 02:05.380\n If you give a child Tom Lehrer records, what you do is you destroy their ability to be\n\n02:05.380 --> 02:08.660\n taken over by later malware.\n\n02:08.660 --> 02:17.420\n And it's so irreverent, so witty, so clever, so obscene that it destroys the ability to\n\n02:17.420 --> 02:19.380\n lead a normal life for many people.\n\n02:19.380 --> 02:27.060\n So if I meet somebody who's usually really shifted from any kind of neurotypical presentation,\n\n02:27.060 --> 02:31.100\n I'll often ask them, uh, are you a Tom Lehrer fan?\n\n02:31.100 --> 02:34.220\n And the odds that they will respond are quite high.\n\n02:34.220 --> 02:38.280\n Tom Lehrer is, uh, poisoning pigeons in the park, Tom Lehrer.\n\n02:38.280 --> 02:39.280\n That's very interesting.\n\n02:39.280 --> 02:44.120\n There are a small number of Tom Lehrer songs that broke into the general population, poisoning\n\n02:44.120 --> 02:48.140\n pigeons in the park, the element song, and perhaps the Vatican rag.\n\n02:48.140 --> 02:53.180\n Uh, so when you meet somebody who knows those songs but doesn't know, oh, you're judging\n\n02:53.180 --> 02:55.220\n me right now, aren't you?\n\n02:55.220 --> 02:56.220\n Harshly.\n\n02:56.220 --> 03:00.340\n Uh, no, but you're a Russian, so I doubt as the, you know, Nikolai Ivanovich Lubachevsky,\n\n03:00.340 --> 03:01.340\n that song.\n\n03:01.340 --> 03:02.340\n Yeah.\n\n03:02.340 --> 03:06.100\n Um, so that was a song about plagiarism that was in fact plagiarized, which most people\n\n03:06.100 --> 03:11.540\n don't know from Danny Kay, uh, where Danny Kay did a song called Stanislavsky of the\n\n03:11.540 --> 03:13.340\n Muskie arts.\n\n03:13.340 --> 03:19.120\n And so Tom Lehrer did this brilliant job of plagiarizing a song about and making it about\n\n03:19.120 --> 03:24.860\n plagiarism and then making it about this mathematician who worked in non Euclidean geometry.\n\n03:24.860 --> 03:27.580\n That was like, uh, giving heroin to a child.\n\n03:27.580 --> 03:33.660\n It was extremely addictive and eventually led me to a lot of different places, one of\n\n03:33.660 --> 03:36.620\n which may have been a PhD in mathematics.\n\n03:36.620 --> 03:41.700\n And he was also at least a lecturer in mathematics, I believe at Harvard, something like that.\n\n03:41.700 --> 03:42.700\n Yeah.\n\n03:42.700 --> 03:43.700\n I just had dinner with him.\n\n03:43.700 --> 03:51.740\n In fact, uh, when my son turned 13, we didn't tell him, but, um, his bar mitzvah present\n\n03:51.740 --> 03:54.700\n was dinner with his hero, Tom Lehrer.\n\n03:54.700 --> 04:01.020\n And Tom Lehrer was 88 years old, sharp as a tack, irreverent and funny as hell.\n\n04:01.020 --> 04:05.860\n And just, you know, there are very few people in this world that you have to meet while\n\n04:05.860 --> 04:07.020\n they're still here.\n\n04:07.020 --> 04:09.420\n And that was definitely one for our family.\n\n04:09.420 --> 04:16.700\n So that wit is a reflection of intelligence in some kind of deep way, like where that\n\n04:16.700 --> 04:20.260\n would be a good test of intelligence, whether you're a Tom Lehrer fan.\n\n04:20.260 --> 04:27.500\n So what do you think that is about wit, about that kind of humor, ability to see the absurdity\n\n04:27.500 --> 04:28.500\n in existence?\n\n04:28.500 --> 04:33.540\n Well, do you think that's connected to intelligence or are we just two Jews on a mic that appreciate\n\n04:33.540 --> 04:34.540\n that kind of humor?\n\n04:34.540 --> 04:37.580\n No, I think that it's absolutely connected to intelligence.\n\n04:37.580 --> 04:40.140\n So you can, you can see it.\n\n04:40.140 --> 04:45.260\n There's a place where Tom Lehrer decides that he's going to lampoon Gilbert of Gilbert and\n\n04:45.260 --> 04:49.540\n Sullivan and he's going to outdo Gilbert with clever, meaningless wordplay.\n\n04:49.540 --> 04:55.540\n And he has, forget the, well, let's see, he's doing Clementine as if Gilbert and Sullivan\n\n04:55.540 --> 04:56.540\n wrote it.\n\n04:56.540 --> 05:00.540\n That I misunderstood depressed her young sister named Mr. This Mr. Depester, she tried pestering\n\n05:00.540 --> 05:04.940\n sisters of festering blister you best to resist or say I, the sister persisted the Mr. Resisted\n\n05:04.940 --> 05:07.900\n I kissed her all loyalty slip when he said, when she said I could have her, her sister's\n\n05:07.900 --> 05:10.860\n cadaver must surely have turned in its crypt.\n\n05:10.860 --> 05:11.980\n That's so dense.\n\n05:11.980 --> 05:19.180\n It's so insane that that's clearly intelligence because it's hard to construct something like\n\n05:19.180 --> 05:20.180\n that.\n\n05:20.180 --> 05:26.380\n If I look at my favorite Tom Lehrer, Tom Lehrer lyric, you know, there's a perfectly absurd\n\n05:26.380 --> 05:30.300\n one, which is once all the Germans were warlike and mean, but that couldn't happen again.\n\n05:30.300 --> 05:34.740\n We taught them a lesson in 1918 and they've hardly bothered us since then, right?\n\n05:34.740 --> 05:36.900\n That is a different kind of intelligence.\n\n05:36.900 --> 05:41.780\n You know, you're taking something that is so horrific and you're, you're sort of making\n\n05:41.780 --> 05:47.780\n it palatable and funny and demonstrating also, um, just your humanity.\n\n05:47.780 --> 05:53.660\n I mean, I think the thing that came through as, as Tom Lehrer wrote all of these terrible,\n\n05:53.660 --> 05:59.340\n horrible lines was just what a sensitive and beautiful soul he was, who was channeling\n\n05:59.340 --> 06:02.820\n pain through humor and through grace.\n\n06:02.820 --> 06:07.900\n I've seen throughout Europe, throughout Russia, that same kind of humor emerged from the generation\n\n06:07.900 --> 06:09.260\n of world war II.\n\n06:09.260 --> 06:14.660\n It seemed like that humor is required to somehow deal with the pain and the suffering of that,\n\n06:14.660 --> 06:16.700\n that war created.\n\n06:16.700 --> 06:19.700\n You do need the environment to create the broad Slavic soul.\n\n06:19.700 --> 06:30.780\n I don't think that many Americans really appreciate, um, Russian humor, how you had to joke during\n\n06:30.780 --> 06:35.700\n the time of, let's say article 58 under Stalin, you had to be very, very careful.\n\n06:35.700 --> 06:40.500\n You know, the concept of a Russian satirical magazine like Crocodile, uh, doesn't make\n\n06:40.500 --> 06:41.500\n sense.\n\n06:41.500 --> 06:48.680\n So you have this cross cultural problem that there are certain areas of human experience\n\n06:48.680 --> 06:51.420\n that it would be better to know nothing about.\n\n06:51.420 --> 06:56.780\n And quite unfortunately, Eastern Europe knows a great deal about them, which makes the,\n\n06:56.780 --> 07:02.940\n you know, the songs of Vladimir Vysotsky so potent, the, uh, you know, the pros of Pushkin,\n\n07:02.940 --> 07:09.020\n whatever it is, uh, you have to appreciate the depth of the Eastern European experience.\n\n07:09.020 --> 07:14.160\n And I would think that perhaps Americans knew something like this around the time of the\n\n07:14.160 --> 07:22.580\n civil war or merit maybe, um, you know, under slavery and Jim Crow or even the, uh, harsh\n\n07:22.580 --> 07:28.500\n tyranny of, uh, the coal and steel employers during the labor wars.\n\n07:28.500 --> 07:34.940\n Um, but in general, I would say it's hard for us to understand and imagine the collective\n\n07:34.940 --> 07:40.660\n culture unless we have the system of selective pressures that, for example, uh, Russians\n\n07:40.660 --> 07:41.660\n were subjected to.\n\n07:41.660 --> 07:49.820\n Yeah, so if there's one good thing that comes out of war, it's literature, art, and humor\n\n07:49.820 --> 07:50.820\n and music.\n\n07:50.820 --> 07:52.380\n Oh, I don't think so.\n\n07:52.380 --> 07:57.660\n I think almost everything is good about war except for death and destruction.\n\n07:57.660 --> 07:59.380\n Right.\n\n07:59.380 --> 08:02.720\n Without the death, it would bring, uh, the romance of it.\n\n08:02.720 --> 08:03.720\n The whole thing is nice.\n\n08:03.720 --> 08:07.900\n Well, this is why we're always caught up in war and we have this very ambiguous relationship\n\n08:07.900 --> 08:15.820\n to it is that it makes life real and pressing and meaningful and at an unacceptable price\n\n08:15.820 --> 08:17.820\n and the price has never been higher.\n\n08:17.820 --> 08:22.860\n So just jump in, uh, into AI a little bit.\n\n08:22.860 --> 08:28.740\n You, uh, in one of the conversations you had or one of the videos, you described that one\n\n08:28.740 --> 08:34.480\n of the things AI systems can't do and biological systems can is self replicate in the physical\n\n08:34.480 --> 08:35.480\n world.\n\n08:35.480 --> 08:37.400\n Oh no, no.\n\n08:37.400 --> 08:38.700\n In the physical world.\n\n08:38.700 --> 08:45.020\n Well, yes, the physical robots can't self replicate, but the fit, but you, this is a\n\n08:45.020 --> 08:50.940\n very tricky point, which is that the only thing that we've been able to create that's\n\n08:50.940 --> 08:57.440\n really complex that has an analog of our reproductive system is software.\n\n08:57.440 --> 09:01.220\n But nevertheless, software replicates itself.\n\n09:01.220 --> 09:05.820\n Uh, if we're speaking strictly for the replication in this kind of digital space.\n\n09:05.820 --> 09:08.700\n So let me just to begin, let me ask a question.\n\n09:08.700 --> 09:15.140\n Do you see a protective barrier or a gap between the physical world and the digital world?\n\n09:15.140 --> 09:16.580\n Let's not call it digital.\n\n09:16.580 --> 09:20.900\n Let's call it the logical world versus the physical world.\n\n09:20.900 --> 09:21.900\n Why logical?\n\n09:21.900 --> 09:28.080\n Well, because even though we had, let's say Einstein's brain preserved, uh, it was meaningless\n\n09:28.080 --> 09:33.720\n to us as a physical object because we couldn't do anything with what was stored in it at\n\n09:33.720 --> 09:35.660\n a logical level.\n\n09:35.660 --> 09:40.380\n And so the idea that something may be stored logically and that it may be stored physically,\n\n09:40.380 --> 09:45.740\n uh, are not necessarily, uh, we don't always benefit from synonymizing.\n\n09:45.740 --> 09:51.060\n I'm not suggesting that there isn't a material basis to the logical world, but that it does\n\n09:51.060 --> 09:58.260\n warrant identification with a separate layer that need not invoke logic gates and zeros\n\n09:58.260 --> 09:59.700\n and ones.\n\n09:59.700 --> 10:03.660\n And uh, so connecting those two worlds, the logical world and the physical world, or maybe\n\n10:03.660 --> 10:09.380\n just connecting to the logical world inside our brain, Einstein's brain.\n\n10:09.380 --> 10:14.740\n You mentioned the idea of out, outtelligence.\n\n10:14.740 --> 10:15.960\n Artificial outtelligence.\n\n10:15.960 --> 10:16.960\n Artificial outtelligence.\n\n10:16.960 --> 10:17.960\n Yes.\n\n10:17.960 --> 10:22.660\n This is the only essay that John Brockman ever invited me to write that he refused to\n\n10:22.660 --> 10:24.660\n publish in Edge.\n\n10:24.660 --> 10:25.660\n Why?\n\n10:25.660 --> 10:30.660\n Well, maybe it wasn't, it wasn't well written, um, but I don't know.\n\n10:30.660 --> 10:36.820\n The idea is quite compelling is quite unique and new and at least from my view of a stance\n\n10:36.820 --> 10:38.700\n point, maybe you can explain it.\n\n10:38.700 --> 10:39.700\n Sure.\n\n10:39.700 --> 10:45.360\n What I was thinking about is why it is that we're waiting to be terrified by artificial\n\n10:45.360 --> 10:53.480\n general intelligence when in fact, artificial life, uh, is terrifying in and of itself and\n\n10:53.480 --> 10:54.620\n it's already here.\n\n10:54.620 --> 11:00.280\n So in order to have a system of selective pressures, you need three distinct elements.\n\n11:00.280 --> 11:04.400\n You need variation within a population.\n\n11:04.400 --> 11:08.580\n You need heritability and you need differential success.\n\n11:08.580 --> 11:16.140\n So what's really unique and I've made this point, I think elsewhere about software is\n\n11:16.140 --> 11:19.380\n that if you think about what humans know how to build, that's impressive.\n\n11:19.380 --> 11:25.340\n So I always take a car and I say, does it have an analog of each of the physical physiological\n\n11:25.340 --> 11:26.340\n systems?\n\n11:26.340 --> 11:27.340\n Does it have a skeletal structure?\n\n11:27.340 --> 11:28.340\n That's its frame.\n\n11:28.340 --> 11:30.380\n Does it have a neurological structure?\n\n11:30.380 --> 11:35.740\n Has an on board computer, has a digestive system.\n\n11:35.740 --> 11:38.520\n The one thing it doesn't have is a reproductive system.\n\n11:38.520 --> 11:47.460\n But if you can call spawn on a process, effectively you do have a reproductive system and that\n\n11:47.460 --> 11:53.460\n means that you can create something with variation, heritability and differential success.\n\n11:53.460 --> 12:01.420\n Now the next step in the chain of thinking was where do we see inanimate, non intelligent\n\n12:01.420 --> 12:05.700\n life outwitting intelligent life?\n\n12:05.700 --> 12:11.500\n And um, I have two favorite systems and I try to stay on them so that we don't get distracted.\n\n12:11.500 --> 12:16.980\n One of which is the Ofres orchid, um, subspecies or subclade.\n\n12:16.980 --> 12:17.980\n I don't know what to call it.\n\n12:17.980 --> 12:18.980\n There's a type of flower.\n\n12:18.980 --> 12:23.940\n Yeah, it's a type of flower that mimics the female of a pollinator species in order to\n\n12:23.940 --> 12:27.460\n dupe the males into, uh, engaging.\n\n12:27.460 --> 12:31.980\n It was called pseudo copulation with the fake female, which is usually represented by the\n\n12:31.980 --> 12:34.040\n lowest pedal.\n\n12:34.040 --> 12:37.420\n And there's also a pheromone component to fool the males into thinking they have a mating\n\n12:37.420 --> 12:38.420\n opportunity.\n\n12:38.420 --> 12:42.820\n But the flower doesn't have to give up energy energy in the form of nectar as a lure because\n\n12:42.820 --> 12:45.320\n it's tricking the males.\n\n12:45.320 --> 12:53.660\n The other system is a particular species, uh, of muscle lampicillus in the clear streams\n\n12:53.660 --> 13:02.060\n of Missouri and it fools bass into biting a fleshy lip that contain its young.\n\n13:02.060 --> 13:07.100\n And when the bass see this fleshy lip, which looks exactly like a species of fish that\n\n13:07.100 --> 13:13.420\n the bass like to eat, the, uh, the young explode and clamp onto the gills and parasitize the\n\n13:13.420 --> 13:20.860\n bass and also lose the best redistribute them as they eventually release both of these systems.\n\n13:20.860 --> 13:31.700\n You have a highly intelligent dupe being fooled by a lower life form and what is sculpting\n\n13:31.700 --> 13:34.780\n these, these convincing lures.\n\n13:34.780 --> 13:41.540\n It's the intelligence of previously duped targets for these strategies.\n\n13:41.540 --> 13:48.980\n So when the target is smart enough to avoid the strategy, uh, those weaker mimics, uh,\n\n13:48.980 --> 13:49.980\n fall off.\n\n13:49.980 --> 13:52.780\n They have terminal lines and only the better ones survive.\n\n13:52.780 --> 14:00.820\n So it's an arms race between the target species, uh, that is being parasitized, getting smarter\n\n14:00.820 --> 14:09.000\n and this other less intelligent or non intelligent object getting as if smarter.\n\n14:09.000 --> 14:13.700\n And so what you see is, is that artificial intelligence, artificial general intelligence\n\n14:13.700 --> 14:17.260\n is not needed to parasitize us.\n\n14:17.260 --> 14:22.120\n It's simply sufficient for us to outwit ourselves.\n\n14:22.120 --> 14:27.100\n So you could have a program, let's say, you know, one of these Nigerian scams, um, that\n\n14:27.100 --> 14:36.060\n writes letters and uses whoever sends it Bitcoin, uh, to figure out which aspects of the program\n\n14:36.060 --> 14:38.900\n should be kept, which should be varied and thrown away.\n\n14:38.900 --> 14:43.340\n And you don't need it to be in any way intelligent in order to have a really nightmarish scenario\n\n14:43.340 --> 14:46.740\n of being parasitized by something that has no idea what it's doing.\n\n14:46.740 --> 14:49.400\n So you, you, you phrased a few concepts really eloquently.\n\n14:49.400 --> 14:53.060\n So let me try to, uh, as a few directions this goes.\n\n14:53.060 --> 14:58.180\n So one first, first of all, in the way we write software today, it's not common that\n\n14:58.180 --> 15:01.180\n we allow it to self modify.\n\n15:01.180 --> 15:02.180\n But we do have that ability.\n\n15:02.180 --> 15:05.220\n Now we have the ability, it's just not common.\n\n15:05.220 --> 15:06.220\n It's not just common.\n\n15:06.220 --> 15:13.100\n So, so your, your thought is that that is a serious worry.\n\n15:13.100 --> 15:15.400\n If there becomes, uh,\n\n15:15.400 --> 15:18.540\n Self modifying code is, is available now.\n\n15:18.540 --> 15:21.220\n So there's, there's different types of self modification, right?\n\n15:21.220 --> 15:28.500\n There's a personalization, you know, your email app, your Gmail is a self modifying\n\n15:28.500 --> 15:32.420\n to you after you log in or whatever you can think of it that way.\n\n15:32.420 --> 15:39.620\n But ultimately it's central, all the information is centralized, but you're thinking of ideas\n\n15:39.620 --> 15:45.460\n where you're completely, so this is an unique entity, uh, operating under selective pressures\n\n15:45.460 --> 15:46.460\n and it changes.\n\n15:46.460 --> 15:52.520\n Well, you just, if you think about the fact that our immune systems, uh, don't know what's\n\n15:52.520 --> 15:58.740\n coming at them next, but they have a small set of spanning components and if it's, if\n\n15:58.740 --> 16:06.660\n it's a sufficiently expressive system in that any shape, uh, or binding region can be approximated,\n\n16:06.660 --> 16:13.100\n uh, with, with the Lego that is present, um, then you can have confidence that you don't\n\n16:13.100 --> 16:20.580\n need to know what's coming at you because the combinatorics, um, are sufficient to reach\n\n16:20.580 --> 16:22.660\n any configuration needed.\n\n16:22.660 --> 16:25.380\n Uh, so that's a beautiful thing.\n\n16:25.380 --> 16:30.700\n Well, terrifying thing to worry about because it's so within our reach.\n\n16:30.700 --> 16:34.140\n Whatever I suggest these things, I do always have a concern as to whether or not I will\n\n16:34.140 --> 16:37.020\n bring them into being by talking about them.\n\n16:37.020 --> 16:43.300\n So, uh, there's this thing from open AI, uh, next, next week to talk to the founder of\n\n16:43.300 --> 16:50.060\n open AI, uh, this idea that, uh, their text generation, the new, uh, the new stuff they\n\n16:50.060 --> 16:54.400\n have for generating texts is they didn't want to bring it, they didn't want to release it\n\n16:54.400 --> 16:57.420\n because they're worried about the.\n\n16:57.420 --> 17:00.660\n I'm delighted to hear that, but they're going to end up releasing.\n\n17:00.660 --> 17:01.660\n Yes.\n\n17:01.660 --> 17:06.160\n So that's the thing is I think talking about it, um, well, at least from my end, I'm more\n\n17:06.160 --> 17:14.100\n a proponent of technology preventing tech, uh, so further innovation, preventing the\n\n17:14.100 --> 17:16.100\n detrimental effects of innovation.\n\n17:16.100 --> 17:22.300\n Well, we're at a, we're sort of tumbling down a hill at accelerating speed.\n\n17:22.300 --> 17:27.020\n So whether or not we're proponents or it doesn't, it doesn't really, it may not matter, but\n\n17:27.020 --> 17:33.580\n I, well, I do feel that there are people who've held things back and, uh, you know, died poor\n\n17:33.580 --> 17:35.380\n than they might've otherwise been.\n\n17:35.380 --> 17:37.380\n We don't even know their names.\n\n17:37.380 --> 17:43.740\n I don't think that we should discount the idea that having the smartest people showing\n\n17:43.740 --> 17:50.820\n off how smart they are by what they've developed may be a terminal process.\n\n17:50.820 --> 17:57.240\n I'm very mindful in particular of a beautiful letter that Edward Teller of all people wrote\n\n17:57.240 --> 18:02.060\n to Leo Zillard and where Zillard was trying to figure out how to control the use of atomic\n\n18:02.060 --> 18:08.020\n weaponry at the end of world war II and teller rather strangely because many of us view him\n\n18:08.020 --> 18:15.060\n as a monster, um, showed some, a very advanced moral thinking talking about the slim chance\n\n18:15.060 --> 18:19.100\n we have for survival and that the only hope is to make Warren thinkable.\n\n18:19.100 --> 18:24.900\n I do think that not enough of us feel in our gut what it is we are playing with when we\n\n18:24.900 --> 18:26.660\n are working on technical problems.\n\n18:26.660 --> 18:31.500\n And I would recommend to anyone who hasn't seen it, a movie called the bridge over the\n\n18:31.500 --> 18:38.260\n bridge on the river Kwai about, I believe captured British POWs who just in a desire\n\n18:38.260 --> 18:43.180\n to do a bridge well, end up over collaborating with their Japanese captors.\n\n18:43.180 --> 18:51.100\n Well now you're making me a question the unrestricted open discussion of ideas and AI.\n\n18:51.100 --> 18:55.980\n I'm not saying I know the answer, I'm just saying that I could make a decent case for\n\n18:55.980 --> 19:00.020\n either our need to talk about this and to become technologically focused on containing\n\n19:00.020 --> 19:06.840\n it or need to stop talking about this and try to hope that the relatively small number\n\n19:06.840 --> 19:11.100\n of highly adept individuals who are looking at these problems is small enough that we\n\n19:11.100 --> 19:14.060\n should in fact be talking about how to contain them.\n\n19:14.060 --> 19:20.380\n Well the way ideas, the way innovation happens, what new ideas develop, Newton with calculus,\n\n19:20.380 --> 19:26.940\n whether if he was silent, the idea would be, would emerge elsewhere in the case of Newton\n\n19:26.940 --> 19:27.940\n of course.\n\n19:27.940 --> 19:34.980\n But in the case of AI, how small is the set of individuals out of which such ideas would\n\n19:34.980 --> 19:35.980\n arise?\n\n19:35.980 --> 19:42.060\n Well the idea is that the researchers we know and those that we don't know who may live\n\n19:42.060 --> 19:47.100\n in countries that don't wish us to know what level they're currently at are very disciplined\n\n19:47.100 --> 19:50.540\n in keeping these things to themselves.\n\n19:50.540 --> 19:57.180\n Of course I will point out that there's a religious school in Kerala that developed\n\n19:57.180 --> 20:05.980\n something very close to the calculus, certainly in terms of infinite series in I guess religious\n\n20:05.980 --> 20:10.420\n prayer and rhyme and prose.\n\n20:10.420 --> 20:16.300\n So it's not that Newton had any ability to hold that back and I don't really believe\n\n20:16.300 --> 20:17.580\n that we have an ability to hold it back.\n\n20:17.580 --> 20:23.020\n I do think that we could change the proportion of the time we spend worrying about the effects\n\n20:23.020 --> 20:26.420\n of what if we are successful rather than simply trying to succeed and hope that we'll be able\n\n20:26.420 --> 20:27.900\n to contain things later.\n\n20:27.900 --> 20:29.300\n Beautifully put.\n\n20:29.300 --> 20:35.660\n So on the idea of intelligence, what form, treading cautiously as we've agreed as we\n\n20:35.660 --> 20:38.060\n tumbled down the hill, what form...\n\n20:38.060 --> 20:39.620\n We can't stop ourselves, can we?\n\n20:39.620 --> 20:42.000\n We cannot.\n\n20:42.000 --> 20:43.540\n What form do you see it taking?\n\n20:43.540 --> 20:52.040\n So one example, Facebook, Google, do want to, I don't know a better word, you want to\n\n20:52.040 --> 20:59.580\n influence users to behave a certain way and so that's one kind of example of how intelligence\n\n20:59.580 --> 21:05.940\n is systems perhaps modifying the behavior of these intelligent human beings in order\n\n21:05.940 --> 21:08.460\n to sell more product of different kinds.\n\n21:08.460 --> 21:13.060\n But do you see other examples of this actually emerging in...\n\n21:13.060 --> 21:18.680\n Just take any parasitic system, make sure that there's some way in which that there's\n\n21:18.680 --> 21:25.180\n differential success, heritability, and variation.\n\n21:25.180 --> 21:29.380\n And those are the magic ingredients and if you really wanted to build a nightmare machine,\n\n21:29.380 --> 21:36.780\n make sure that the system that expresses the variability has a spanning set so that it\n\n21:36.780 --> 21:41.920\n can learn to arbitrary levels by making it sufficiently expressive.\n\n21:41.920 --> 21:43.240\n That's your nightmare.\n\n21:43.240 --> 21:49.060\n So it's your nightmare, but it could also be, it's a really powerful mechanism by which\n\n21:49.060 --> 21:52.360\n to create, well, powerful systems.\n\n21:52.360 --> 21:59.100\n So are you more worried about the negative direction that might go versus the positive?\n\n21:59.100 --> 22:05.140\n So you said parasitic, but that doesn't necessarily need to be what the system converges towards.\n\n22:05.140 --> 22:07.780\n It could be, what is it?\n\n22:07.780 --> 22:13.700\n And the dividing line between parasitism and symbiosis is not so clear.\n\n22:13.700 --> 22:15.060\n That's what they tell me about marriage.\n\n22:15.060 --> 22:17.540\n I'm still single, so I don't know.\n\n22:17.540 --> 22:27.580\n Well yeah, we could go into that too, but no, I think we have to appreciate, are you\n\n22:27.580 --> 22:30.660\n infected by your own mitochondria?\n\n22:30.660 --> 22:31.660\n Right.\n\n22:31.660 --> 22:32.660\n Right?\n\n22:32.660 --> 22:33.660\n Yeah.\n\n22:33.660 --> 22:42.580\n So in marriage, you fear the loss of independence, but even though the American therapeutic community\n\n22:42.580 --> 22:47.420\n may be very concerned about codependence, what's to say that codependence isn't what's\n\n22:47.420 --> 22:52.780\n necessary to have a stable relationship in which to raise children who are maximally\n\n22:52.780 --> 22:57.260\n case selected and require incredible amounts of care because you have to wait 13 years\n\n22:57.260 --> 23:00.700\n before there's any reproductive payout and most of us don't want our 13 year olds having\n\n23:00.700 --> 23:01.700\n kids.\n\n23:01.700 --> 23:08.940\n That's a very tricky situation to analyze and I would say that predators and parasites\n\n23:08.940 --> 23:14.020\n drive much of our evolution and I don't know whether to be angry at them or thank them.\n\n23:14.020 --> 23:19.620\n Well ultimately, I mean nobody knows the meaning of life or what even happiness is, but there\n\n23:19.620 --> 23:20.620\n is some metrics.\n\n23:20.620 --> 23:21.620\n They didn't tell you?\n\n23:21.620 --> 23:22.620\n They didn't.\n\n23:22.620 --> 23:23.620\n They didn't.\n\n23:23.620 --> 23:29.460\n That's why all the poetry and books are about, you know, there's some metrics under which\n\n23:29.460 --> 23:35.060\n you can kind of measure how good it is that these AI systems are roaming about.\n\n23:35.060 --> 23:44.380\n So you're more nervous about software than you are optimistic about ideas of, yeah, self\n\n23:44.380 --> 23:45.380\n replicating largely.\n\n23:45.380 --> 23:50.420\n I don't think we've really felt where we are.\n\n23:50.420 --> 23:57.660\n You know, occasionally we get a wake up, 9 11 was so anomalous compared to everything\n\n23:57.660 --> 24:03.540\n else we've experienced on American soil that it came to us as a complete shock that that\n\n24:03.540 --> 24:05.060\n was even a possibility.\n\n24:05.060 --> 24:11.620\n What it really was was a highly creative and determined R and D team deep in the bowels\n\n24:11.620 --> 24:18.200\n of Afghanistan showing us that we had certain exploits that we were open to that nobody\n\n24:18.200 --> 24:19.380\n had chosen to express.\n\n24:19.380 --> 24:23.700\n I can think of several of these things that I don't talk about publicly that just seem\n\n24:23.700 --> 24:32.140\n to have to do with, um, how relatively unimaginative those who wish to cause havoc and destruction\n\n24:32.140 --> 24:33.860\n have been up until now.\n\n24:33.860 --> 24:43.780\n But the great mystery of our time of this particular little era is how remarkably stable\n\n24:43.780 --> 24:50.780\n we've been since 1945 when we demonstrated the ability to use a nuclear weapons in anger.\n\n24:50.780 --> 24:58.440\n And we don't know why things like that haven't happened since then.\n\n24:58.440 --> 25:03.780\n We've had several close calls, we've had mistakes, we've had a brinksmanship.\n\n25:03.780 --> 25:09.820\n And what's now happened is that we've settled into a sense that, Oh, it's, it'll always\n\n25:09.820 --> 25:10.820\n be nothing.\n\n25:10.820 --> 25:20.260\n It's been so long since something was at that level of danger that we've got a wrong idea\n\n25:20.260 --> 25:21.260\n in our head.\n\n25:21.260 --> 25:25.500\n And that's why when I went on the Ben Shapiro show, I talked about the need to resume above\n\n25:25.500 --> 25:30.460\n ground testing of nuclear devices because we have people whose developmental experience\n\n25:30.460 --> 25:37.580\n suggests that when let's say Donald Trump and North Korea engage on Twitter, Oh, it's\n\n25:37.580 --> 25:38.580\n nothing.\n\n25:38.580 --> 25:39.580\n It's just posturing.\n\n25:39.580 --> 25:41.140\n Everybody's just in it for money.\n\n25:41.140 --> 25:46.860\n There's, there's an, a sense that people are in a video game mode, which has been the right\n\n25:46.860 --> 25:49.500\n call since 1945.\n\n25:49.500 --> 25:51.140\n We've been mostly in video game mode.\n\n25:51.140 --> 25:52.140\n It's amazing.\n\n25:52.140 --> 25:57.140\n So you're worried about a generation which has not seen any existential.\n\n25:57.140 --> 25:58.300\n We've lived under it.\n\n25:58.300 --> 26:00.260\n You see, you're younger.\n\n26:00.260 --> 26:05.860\n I don't know if, if, and again, you came from, from Moscow.\n\n26:05.860 --> 26:13.540\n There was a TV show called the day after that had a huge effect on a generation growing\n\n26:13.540 --> 26:21.020\n up in the U S and it talked about what life would be like after a nuclear exchange.\n\n26:21.020 --> 26:27.500\n We have not gone through an embodied experience collectively where we've thought about this.\n\n26:27.500 --> 26:32.780\n And I think it's one of the most irresponsible things that the elders among us have done,\n\n26:32.780 --> 26:41.820\n which is to provide this beautiful garden in which the thorns are cut off of the, of\n\n26:41.820 --> 26:47.860\n the Rose bushes and all of the edges are rounded and sanded.\n\n26:47.860 --> 26:52.140\n And so people have developed this, this totally unreal idea, which is everything's going to\n\n26:52.140 --> 26:54.240\n be just fine.\n\n26:54.240 --> 27:01.180\n And do I think that my leading concern is AGI or my leading concern is a thermonuclear\n\n27:01.180 --> 27:04.060\n exchange or gene drives or any one of these things?\n\n27:04.060 --> 27:11.780\n I don't know, but I know that our time here in this very long experiment here is finite\n\n27:11.780 --> 27:19.340\n because the toys that we've built are so impressive and the wisdom to accompany them has not materialized.\n\n27:19.340 --> 27:24.300\n And I think it's, we actually got a wisdom uptick since 1945.\n\n27:24.300 --> 27:29.980\n We had a lot of dangerous skilled players on the world stage who nevertheless, no matter\n\n27:29.980 --> 27:38.140\n how bad they were managed to not embroil us in something that we couldn't come back from\n\n27:38.140 --> 27:39.140\n the cold war.\n\n27:39.140 --> 27:46.660\n Yeah, and the distance from the cold war, you know, I'm very mindful of a, there was\n\n27:46.660 --> 27:54.980\n a Russian tradition actually of on your wedding day, going to visit a memorial to those who\n\n27:54.980 --> 27:55.980\n gave their lives.\n\n27:55.980 --> 28:02.800\n Can you imagine this where you, on the happiest day of your life, you go and you pay homage\n\n28:02.800 --> 28:08.980\n to the people who fought and died in the battle of Stalingrad.\n\n28:08.980 --> 28:13.460\n I'm not a huge fan of communism, I got to say, but there were a couple of things that\n\n28:13.460 --> 28:18.860\n the Russians did that were really positive in the Soviet era.\n\n28:18.860 --> 28:25.060\n And I think trying to let people know how serious life actually is, is the Russian model\n\n28:25.060 --> 28:28.660\n of seriousness is better than the American model.\n\n28:28.660 --> 28:34.340\n And maybe like you mentioned, there was a small echo of that after 9 11.\n\n28:34.340 --> 28:36.180\n But we wouldn't let it form.\n\n28:36.180 --> 28:42.860\n We talk about 9 11, but it's 9 12 that really moved the needle when we were all just there\n\n28:42.860 --> 28:46.140\n and nobody wanted to speak.\n\n28:46.140 --> 28:55.580\n We witnessed something super serious and we didn't want to run to our computers and blast\n\n28:55.580 --> 28:59.260\n out our deep thoughts and our feelings.\n\n28:59.260 --> 29:05.740\n And it was profound because we woke up briefly, you know, I talk about the gated institutional\n\n29:05.740 --> 29:08.980\n narrative that sort of programs our lives.\n\n29:08.980 --> 29:15.260\n I've seen it break three times in my life, one of which was the election of Donald Trump.\n\n29:15.260 --> 29:21.300\n Another time was the fall of Lehman Brothers when everybody who knew that Bear Stearns\n\n29:21.300 --> 29:27.380\n wasn't that important knew that Lehman Brothers met AIG was next.\n\n29:27.380 --> 29:29.460\n And the other one was 9 11.\n\n29:29.460 --> 29:35.260\n And so if I'm 53 years old and I only remember three times that the global narrative was\n\n29:35.260 --> 29:42.980\n really interrupted, that tells you how much we've been on top of developing events.\n\n29:42.980 --> 29:46.580\n You know, I mean we had the Murrow federal building explosion, but it didn't cause the\n\n29:46.580 --> 29:47.580\n narrative to break.\n\n29:47.580 --> 29:49.580\n It wasn't profound enough.\n\n29:49.580 --> 29:58.820\n Around 9 12 we started to wake up out of our slumber and the powers that be did not want\n\n29:58.820 --> 29:59.820\n to coming together.\n\n29:59.820 --> 30:03.780\n They, you know, the admonition was go shopping.\n\n30:03.780 --> 30:07.820\n And the powers that be was what is that force as opposed to blaming individuals?\n\n30:07.820 --> 30:08.920\n We don't know.\n\n30:08.920 --> 30:13.460\n So whatever that, whatever that force is, there's a component of it that's emergent\n\n30:13.460 --> 30:15.780\n and there's a component of it that's deliberate.\n\n30:15.780 --> 30:18.840\n So give yourself a portfolio with two components.\n\n30:18.840 --> 30:23.900\n Some amount of it is emergent, but some amount of it is also an understanding that if people\n\n30:23.900 --> 30:27.880\n come together, they become an incredible force.\n\n30:27.880 --> 30:34.660\n And what you're seeing right now I think is there are forces that are trying to come together\n\n30:34.660 --> 30:39.500\n and there are forces that are trying to push things apart.\n\n30:39.500 --> 30:43.540\n And you know, one of them is the globalist narrative versus the national narrative where\n\n30:43.540 --> 30:50.080\n to the global, uh, globalist perspective, uh, the nation nations are bad things in essence\n\n30:50.080 --> 30:56.300\n that they're temporary, they're nationalistic, they're jingoistic, it's all negative to people\n\n30:56.300 --> 30:59.420\n in the national, more in the national idiom, they're saying, look, this is where I pay\n\n30:59.420 --> 31:00.420\n my taxes.\n\n31:00.420 --> 31:02.660\n This is where I do my army service.\n\n31:02.660 --> 31:04.340\n This is where I have a vote.\n\n31:04.340 --> 31:06.180\n This is where I have a passport.\n\n31:06.180 --> 31:10.220\n Who the hell are you to tell me that because you've moved into someplace that you can make\n\n31:10.220 --> 31:15.580\n money globally, that you've chosen to abandon other people to whom you have a special and\n\n31:15.580 --> 31:16.580\n elevated duty.\n\n31:16.580 --> 31:22.140\n And I think that these competing narratives have been pushing towards the global perspective,\n\n31:22.140 --> 31:27.660\n uh, from the elite and a larger and larger number of disenfranchised people are saying,\n\n31:27.660 --> 31:32.060\n hey, I actually live in a, in a place and I have laws and I speak a language, I have\n\n31:32.060 --> 31:33.660\n a culture.\n\n31:33.660 --> 31:40.300\n And who are you to tell me that because you can profit in some far away land that my obligations\n\n31:40.300 --> 31:43.260\n to my fellow countrymen are so, so much diminished.\n\n31:43.260 --> 31:47.940\n So these tensions between nations and so on, ultimately you see being proud of your country\n\n31:47.940 --> 31:53.700\n and so on, which creates potentially the kind of things that led to wars and so on.\n\n31:53.700 --> 31:58.420\n They, they ultimately, it is human nature and it is good for us for wake up calls of\n\n31:58.420 --> 31:59.420\n different kinds.\n\n31:59.420 --> 32:05.020\n Well, I think that these are tensions and my point isn't, I mean, nationalism run amok\n\n32:05.020 --> 32:09.980\n is a nightmare and internationalism run amok is a nightmare.\n\n32:09.980 --> 32:16.820\n And the problem is we're trying to push these pendulums, uh, to some place where they're\n\n32:16.820 --> 32:24.260\n somewhat balanced, where we, we have a higher duty of care to those, uh, who share our log,\n\n32:24.260 --> 32:30.940\n our laws and our citizenship, but we don't forget our duties of care to the global system.\n\n32:30.940 --> 32:37.660\n I would think this is elementary, but the problem that we're facing concerns the ability\n\n32:37.660 --> 32:45.540\n for some to profit at the, by abandoning their obligations, uh, to others within their system.\n\n32:45.540 --> 32:48.580\n And that's what we've had for decades.\n\n32:48.580 --> 32:50.220\n You mentioned nuclear weapons.\n\n32:50.220 --> 32:55.860\n I was hoping to get answers from you since one of the many things you've done as a economics\n\n32:55.860 --> 33:00.500\n and maybe you can understand human behavior of why the heck we haven't blown each other\n\n33:00.500 --> 33:01.500\n up yet.\n\n33:01.500 --> 33:02.500\n But okay.\n\n33:02.500 --> 33:03.500\n So, uh, we'll get back.\n\n33:03.500 --> 33:04.500\n I don't know the answer.\n\n33:04.500 --> 33:05.500\n Yes.\n\n33:05.500 --> 33:06.500\n It's a, it's a fast.\n\n33:06.500 --> 33:07.500\n It's really important to say that we really don't know.\n\n33:07.500 --> 33:09.500\n A mild uptick in wisdom.\n\n33:09.500 --> 33:10.820\n A mild uptick in wisdom.\n\n33:10.820 --> 33:17.300\n Well, Steven Pinker, who I've talked with has a lot of really good ideas about why,\n\n33:17.300 --> 33:20.060\n but I don't trust his optimism.\n\n33:20.060 --> 33:24.860\n Listen, I'm Russian, so I never trust a guy who was that optimistic.\n\n33:24.860 --> 33:25.860\n No, no, no.\n\n33:25.860 --> 33:31.260\n It's just that you're talking about a guy who's looking at a system in which more and\n\n33:31.260 --> 33:37.740\n more of the kinetic energy like war has been turned into potential energy, like unused\n\n33:37.740 --> 33:38.740\n nuclear weapons.\n\n33:38.740 --> 33:39.740\n Beautifully put.\n\n33:39.740 --> 33:42.900\n You know, now I'm looking at that system and I'm saying, okay, well, if you don't have\n\n33:42.900 --> 33:46.060\n a potential energy term, then everything's just getting better and better.\n\n33:46.060 --> 33:47.060\n Yeah.\n\n33:47.060 --> 33:48.060\n Wow.\n\n33:48.060 --> 33:49.060\n That's beautifully put.\n\n33:49.060 --> 33:50.060\n Only a physicist could.\n\n33:50.060 --> 33:51.060\n Okay.\n\n33:51.060 --> 33:52.060\n I'm not a physicist.\n\n33:52.060 --> 33:55.060\n Is that a dirty word?\n\n33:55.060 --> 33:56.060\n No, no.\n\n33:56.060 --> 33:57.060\n I wish I were a physicist.\n\n33:57.060 --> 33:58.060\n Me too.\n\n33:58.060 --> 33:59.060\n My dad's a physicist.\n\n33:59.060 --> 34:02.900\n I'm trying to live up that probably for the rest of my life.\n\n34:02.900 --> 34:04.500\n He's probably gonna listen to this too.\n\n34:04.500 --> 34:05.500\n So.\n\n34:05.500 --> 34:06.500\n He did.\n\n34:06.500 --> 34:07.500\n Yeah.\n\n34:07.500 --> 34:13.940\n So your friend, Sam Harris, uh, worries a lot about the existential threat of AI.\n\n34:13.940 --> 34:18.060\n Not in the way that you've described, but in the more, well, he hangs out with Elon.\n\n34:18.060 --> 34:20.380\n I don't know Elon.\n\n34:20.380 --> 34:30.020\n So are you worried about that kind of, uh, you know, about the, um, about either robotic\n\n34:30.020 --> 34:35.660\n systems or, you know, traditionally defined AI systems essentially becoming a super intelligent,\n\n34:35.660 --> 34:40.700\n much more intelligent than human beings and, uh, getting, well, they already are and they're\n\n34:40.700 --> 34:47.420\n not when, when seen as a, um, a collective, you mean, well, I mean, I, I can mean all\n\n34:47.420 --> 34:54.420\n sorts of things, but certainly many of the things that we thought were peculiar to general\n\n34:54.420 --> 34:57.340\n intelligence or do not require general intelligence.\n\n34:57.340 --> 35:04.160\n So that's been one of the big awakenings that you can write a pretty convincing sports story\n\n35:04.160 --> 35:10.700\n from stats alone, uh, without needing to have watched the game.\n\n35:10.700 --> 35:13.900\n So you know, is it possible to write lively pros about politics?\n\n35:13.900 --> 35:17.580\n Yeah, no, not yet.\n\n35:17.580 --> 35:20.480\n So we were sort of all over the map.\n\n35:20.480 --> 35:24.020\n One of the, one of the things about chess that you'll, there's a question I once asked\n\n35:24.020 --> 35:29.220\n on Quora that didn't get a lot of response, which was what is the greatest brilliancy\n\n35:29.220 --> 35:32.860\n ever produced by a computer in a chess game, which was different than the question of what\n\n35:32.860 --> 35:35.540\n is the greatest game ever played.\n\n35:35.540 --> 35:39.180\n So if you think about brilliancies is what really animates many of us to think of chess\n\n35:39.180 --> 35:42.240\n as an art form.\n\n35:42.240 --> 35:47.380\n Those are those moves and combinations that just show such flair, panache and, and, and\n\n35:47.380 --> 35:50.500\n in soul, um, computers weren't really great at that.\n\n35:50.500 --> 35:56.820\n They were great positional monsters and you know, recently we, we've started seeing brilliancies\n\n35:56.820 --> 35:57.820\n and so.\n\n35:57.820 --> 36:03.100\n The grandmasters have identified with, uh, with alpha zero that things were quite brilliant.\n\n36:03.100 --> 36:04.100\n Yeah.\n\n36:04.100 --> 36:06.780\n So that's, that's, that's a, you know, that's an example of something we don't think that\n\n36:06.780 --> 36:12.220\n that's AGI, but in a very restricted set, a set of rules like chess, you're starting\n\n36:12.220 --> 36:15.980\n to see poetry, uh, of a high order.\n\n36:15.980 --> 36:22.740\n And, and so I'm not, I don't like the idea that we're waiting for AGI, AGI is sort of\n\n36:22.740 --> 36:29.780\n slowly infiltrating our lives in the same way that I don't think a worm should be, you\n\n36:29.780 --> 36:34.760\n know, the C elegans shouldn't be treated as non conscious because it only has 300 neurons.\n\n36:34.760 --> 36:39.080\n Maybe it just has a very low level of consciousness because we don't understand what these things\n\n36:39.080 --> 36:40.860\n mean as they scale up.\n\n36:40.860 --> 36:43.700\n So am I worried about this general phenomena?\n\n36:43.700 --> 36:44.700\n Sure.\n\n36:44.700 --> 36:48.240\n But I think that one of the things that's happening is that a lot of us are fretting\n\n36:48.240 --> 36:53.620\n about this, uh, in part because of human needs.\n\n36:53.620 --> 36:56.220\n We've always been worried about the Golem, right?\n\n36:56.220 --> 37:01.660\n Well, the Golem is the artificially created life, you know, it's like Frankenstein.\n\n37:01.660 --> 37:02.660\n Yeah, sure.\n\n37:02.660 --> 37:10.760\n It's a Jewish version and, um, Frankenberg, Frankenstein, yeah, that's makes sense, right?\n\n37:10.760 --> 37:16.920\n So the, uh, but we've always been worried about creating something like this and it's\n\n37:16.920 --> 37:23.460\n getting closer and closer and there are ways in which\n\n37:23.460 --> 37:27.260\n we have to realize that the whole thing is kind of, the whole thing that we've experienced\n\n37:27.260 --> 37:32.140\n are the context of our lives is almost certainly coming to an end.\n\n37:32.140 --> 37:37.700\n And I don't mean to suggest that, uh, we won't survive.\n\n37:37.700 --> 37:39.060\n I don't know.\n\n37:39.060 --> 37:43.900\n And I don't mean to suggest that it's coming tomorrow and it could be 300, 500 years, but\n\n37:43.900 --> 37:49.600\n there's no plan that I'm aware of if we have three rocks that we could possibly inhabit\n\n37:49.600 --> 37:58.300\n that are, uh, sensible within current technological dreams, the earth, the moon and Mars.\n\n37:58.300 --> 38:04.860\n And we have a very competitive civilization that is still forced into violence to sort\n\n38:04.860 --> 38:06.860\n out disputes that cannot be arbitrated.\n\n38:06.860 --> 38:13.000\n It is not clear to me that we have a longterm future until we get to the next stage, which\n\n38:13.000 --> 38:18.180\n is to figure out whether or not the Einsteinian speed limit can be broken.\n\n38:18.180 --> 38:21.620\n And that requires our source code.\n\n38:21.620 --> 38:25.720\n Our source code, the stuff in our brains to figure out what do you mean by our source\n\n38:25.720 --> 38:26.720\n code?\n\n38:26.720 --> 38:30.940\n The source code of the context, whatever it is that produces the quarks, the electrons,\n\n38:30.940 --> 38:31.940\n the neutrinos.\n\n38:31.940 --> 38:33.380\n Oh, our source code.\n\n38:33.380 --> 38:34.380\n I got it.\n\n38:34.380 --> 38:35.380\n So this is,\n\n38:35.380 --> 38:38.100\n You're talking about stuff that's written in a higher level language.\n\n38:38.100 --> 38:39.100\n Yeah.\n\n38:39.100 --> 38:40.100\n Yeah.\n\n38:40.100 --> 38:41.100\n That's right.\n\n38:41.100 --> 38:42.100\n You're talking about the low level, the bits.\n\n38:42.100 --> 38:43.100\n Yeah.\n\n38:43.100 --> 38:46.600\n That's what is currently keeping us here.\n\n38:46.600 --> 38:53.500\n We can't even imagine, you know, we have harebrained schemes for staying within the Einsteinian\n\n38:53.500 --> 38:54.500\n speed limit.\n\n38:54.500 --> 38:58.780\n Uh, you know, maybe if we could just drug ourselves and go into a suspended state or\n\n38:58.780 --> 39:03.620\n we could have multiple generations of that, I think all that stuff is pretty silly, but\n\n39:03.620 --> 39:07.740\n I think it's also pretty silly to imagine that our wisdom is going to increase to the\n\n39:07.740 --> 39:14.140\n point that we can have the toys we have and, uh, we're not going to use them for 500 years.\n\n39:14.140 --> 39:18.700\n Speaking of Einstein, I had a profound breakthrough when I realized you're just one letter away\n\n39:18.700 --> 39:19.700\n from the guy.\n\n39:19.700 --> 39:22.740\n Yeah, but I'm also one letter away from Feinstein.\n\n39:22.740 --> 39:25.740\n It's, well, you get to pick.\n\n39:25.740 --> 39:26.740\n Okay.\n\n39:26.740 --> 39:32.620\n So unified theory, you know, you've worked, uh, you, you enjoy the beauty of geometry.\n\n39:32.620 --> 39:34.420\n I don't actually know if you enjoy it.\n\n39:34.420 --> 39:35.980\n You certainly are quite good at it.\n\n39:35.980 --> 39:36.980\n I tremble before it.\n\n39:36.980 --> 39:42.180\n If you're religious, that is one of the, I don't have to be religious.\n\n39:42.180 --> 39:43.180\n It's just so beautiful.\n\n39:43.180 --> 39:44.180\n You will tremble anyway.\n\n39:44.180 --> 39:50.940\n I mean, I just read Einstein's biography and one of the ways, uh, one of the things you've\n\n39:50.940 --> 39:59.060\n done is try to explore a unified theory, uh, talking about a 14 dimensional observers that\n\n39:59.060 --> 40:02.220\n has the 4d space time continuum embedded in it.\n\n40:02.220 --> 40:09.260\n I, I'm just curious how you think and how philosophically at a high level about something\n\n40:09.260 --> 40:17.000\n more than four dimensions, uh, how do you try to, what, what does it make you feel?\n\n40:17.000 --> 40:23.460\n Talking in the mathematical world about dimensions that are greater than the ones we can perceive.\n\n40:23.460 --> 40:27.140\n Is there something that you take away that's more than just the math?\n\n40:27.140 --> 40:32.700\n Well, first of all, stick out your tongue at me.\n\n40:32.700 --> 40:33.700\n Okay.\n\n40:33.700 --> 40:41.260\n Now on the front of that time, yeah, there was a sweet receptor and next to that were\n\n40:41.260 --> 40:45.460\n salt receptors and two different sides, a little bit farther back.\n\n40:45.460 --> 40:48.300\n There were sour receptors and you wouldn't show me the back of your tongue where your\n\n40:48.300 --> 40:50.300\n bitter receptor was.\n\n40:50.300 --> 40:51.300\n Show the good side always.\n\n40:51.300 --> 40:52.300\n Okay.\n\n40:52.300 --> 40:58.820\n So you had four dimensions of taste receptors, but you also had pain receptors on that tongue\n\n40:58.820 --> 41:01.240\n and probably heat receptors on that time.\n\n41:01.240 --> 41:05.400\n So let's assume that you had one of each, that would be six dimensions.\n\n41:05.400 --> 41:12.260\n So when you eat something, you eat a slice of pizza and it's got some, some, uh, some\n\n41:12.260 --> 41:17.740\n hot pepper on it, maybe some jalapeno, you're having a six dimensional experience, dude.\n\n41:17.740 --> 41:23.900\n Do you think we overemphasize the value of time as one of the dimensions or space?\n\n41:23.900 --> 41:27.580\n Well, we certainly overemphasize the value of time cause we like things to start and\n\n41:27.580 --> 41:30.660\n end or we really don't like things to end, but they seem to.\n\n41:30.660 --> 41:37.020\n Well, what if you flipped one of the spatial dimensions into being a temporal dimension?\n\n41:37.020 --> 41:41.660\n And you and I were to meet in New York city and say, well, where, where and when should\n\n41:41.660 --> 41:42.660\n we meet?\n\n41:42.660 --> 41:50.580\n What about, I'll meet you on a 36 in Lexington at two in the afternoon and uh, 11 oclock\n\n41:50.580 --> 41:53.300\n in the morning.\n\n41:53.300 --> 41:55.300\n That would be very confusing.\n\n41:55.300 --> 41:59.340\n Well, so it's convenient for us to think about time, you mean.\n\n41:59.340 --> 42:03.580\n We happen to be in a delicious situation in which we have three dimensions of space and\n\n42:03.580 --> 42:07.960\n one of time and they're woven together in this sort of strange fabric where we can trade\n\n42:07.960 --> 42:11.820\n off a little space for a little time, but we still only have one dimension that is picked\n\n42:11.820 --> 42:13.480\n out relative to the other three.\n\n42:13.480 --> 42:15.660\n It's very much Gladys Knight and the pips.\n\n42:15.660 --> 42:17.700\n So which one developed for who?\n\n42:17.700 --> 42:22.820\n Do we develop for these dimensions or did the dimensions or were they always there and\n\n42:22.820 --> 42:23.820\n it doesn't?\n\n42:23.820 --> 42:27.300\n Well, do you imagine that there isn't a place where there are four temporal dimensions or\n\n42:27.300 --> 42:31.820\n two and two of space and time or three of time and one of space and then would time\n\n42:31.820 --> 42:33.960\n not be playing the role of space?\n\n42:33.960 --> 42:37.580\n Why do you imagine that the sector that you're in is all that there is?\n\n42:37.580 --> 42:40.820\n I certainly do not, but I can't imagine otherwise.\n\n42:40.820 --> 42:46.180\n I mean, I haven't done ayahuasca or any of those drugs that hope to one day, but instead\n\n42:46.180 --> 42:49.660\n of doing ayahuasca, you could just head over to building two.\n\n42:49.660 --> 42:50.780\n That's where the mathematicians are?\n\n42:50.780 --> 42:52.260\n Yeah, that's where they hang.\n\n42:52.260 --> 42:53.260\n Just to look at some geometry.\n\n42:53.260 --> 42:55.620\n Well, just ask about pseudo Ramanian geometry.\n\n42:55.620 --> 42:57.620\n That's what you're interested in.\n\n42:57.620 --> 42:58.620\n Okay.\n\n42:58.620 --> 43:01.660\n Or you could talk to a shaman and end up in Peru.\n\n43:01.660 --> 43:03.140\n And then it's an extra money for that trip.\n\n43:03.140 --> 43:06.460\n Yeah, but you won't be able to do any calculations if that's how you choose to go about it.\n\n43:06.460 --> 43:09.100\n Well, a different kind of calculation, so to speak.\n\n43:09.100 --> 43:10.100\n Yeah.\n\n43:10.100 --> 43:14.020\n One of my favorite people, Edward Frankel, Berkeley professor, author of Love and Math,\n\n43:14.020 --> 43:20.260\n great title for a book, said that you are quite a remarkable intellect to come up with\n\n43:20.260 --> 43:25.660\n such beautiful original ideas in terms of unified theory and so on, but you're working\n\n43:25.660 --> 43:28.260\n outside academia.\n\n43:28.260 --> 43:33.940\n So one question in developing ideas that are truly original, truly interesting, what's\n\n43:33.940 --> 43:39.660\n the difference between inside academia and outside academia when it comes to developing\n\n43:39.660 --> 43:40.660\n such ideas?\n\n43:40.660 --> 43:41.860\n Oh, it's a terrible choice.\n\n43:41.860 --> 43:43.260\n Terrible choice.\n\n43:43.260 --> 43:55.220\n So if you do it inside of academics, you are forced to constantly show great loyalty to\n\n43:55.220 --> 44:03.020\n the consensus and you distinguish yourself with small, almost microscopic heresies to\n\n44:03.020 --> 44:07.220\n make your reputation in general.\n\n44:07.220 --> 44:14.180\n And you have very competent people and brilliant people who are working together, who form\n\n44:14.180 --> 44:22.780\n very deep social networks and have a very high level of behavior, at least within mathematics\n\n44:22.780 --> 44:27.880\n and at least technically within physics, theoretical physics.\n\n44:27.880 --> 44:35.260\n When you go outside, you meet lunatics and crazy people, madmen.\n\n44:35.260 --> 44:41.220\n And these are people who do not usually subscribe to the consensus position and almost always\n\n44:41.220 --> 44:44.360\n lose their way.\n\n44:44.360 --> 44:52.380\n And the key question is, will progress likely come from someone who has miraculously managed\n\n44:52.380 --> 44:59.100\n to stay within the system and is able to take on a larger amount of heresy that is sort\n\n44:59.100 --> 45:01.260\n of unthinkable?\n\n45:01.260 --> 45:07.860\n In which case, that will be fascinating, or is it more likely that somebody will maintain\n\n45:07.860 --> 45:15.780\n a level of discipline from outside of academics and be able to make use of the freedom that\n\n45:15.780 --> 45:21.500\n comes from not having to constantly affirm your loyalty to the consensus of your field?\n\n45:21.500 --> 45:28.460\n So you've characterized in ways that academia in this particular sense is declining.\n\n45:28.460 --> 45:34.900\n You posted a plot, the older population of the faculty is getting larger, the younger\n\n45:34.900 --> 45:37.260\n is getting smaller and so on.\n\n45:37.260 --> 45:40.540\n So which direction of the two are you more hopeful about?\n\n45:40.540 --> 45:42.660\n Well, the baby boomers can't hang on forever.\n\n45:42.660 --> 45:46.440\n First of all, in general, true, and second of all, in academia.\n\n45:46.440 --> 45:51.540\n But that's really what this time is about.\n\n45:51.540 --> 45:57.180\n We're used to financial bubbles that last a few years in length and then pop.\n\n45:57.180 --> 46:04.020\n The baby boomer bubble is this really long lived thing, and all of the ideology, all\n\n46:04.020 --> 46:07.260\n of the behavior patterns, the norms.\n\n46:07.260 --> 46:11.660\n For example, string theory is an almost entirely baby boomer phenomenon.\n\n46:11.660 --> 46:16.620\n It was something that baby boomers were able to do because it required a very high level\n\n46:16.620 --> 46:20.620\n of mathematical ability.\n\n46:20.620 --> 46:24.260\n You don't think of string theory as an original idea?\n\n46:24.260 --> 46:29.900\n Oh, I mean, it was original to Veneziano, probably is older than the baby boomers.\n\n46:29.900 --> 46:32.780\n And there are people who are younger than the baby boomers who are still doing string\n\n46:32.780 --> 46:33.780\n theory.\n\n46:33.780 --> 46:37.920\n And I'm not saying that nothing discovered within the large string theoretic complex\n\n46:37.920 --> 46:38.920\n is wrong.\n\n46:38.920 --> 46:39.920\n Quite the contrary.\n\n46:39.920 --> 46:44.500\n A lot of brilliant mathematics and a lot of the structure of physics was elucidated by\n\n46:44.500 --> 46:46.940\n string theorists.\n\n46:46.940 --> 46:51.560\n What do I think of the deliverable nature of this product that will not ship called\n\n46:51.560 --> 46:52.560\n string theory?\n\n46:52.560 --> 46:57.540\n I think that it is largely an affirmative action program for highly mathematically and\n\n46:57.540 --> 47:03.240\n geometrically talented baby boomer physics physicists so that they can say that they're\n\n47:03.240 --> 47:10.480\n working on something within the constraints of what they will say is quantum gravity.\n\n47:10.480 --> 47:15.460\n Now there are other schemes, you know, there's like asymptotic safety, there are other things\n\n47:15.460 --> 47:17.100\n that you could imagine doing.\n\n47:17.100 --> 47:26.780\n I don't think much of any of the major programs, but to have inflicted this level of loyalty\n\n47:26.780 --> 47:27.780\n through a shibboleth.\n\n47:27.780 --> 47:29.420\n Well, surely you don't question X.\n\n47:29.420 --> 47:32.380\n Well, I question almost everything in the string program.\n\n47:32.380 --> 47:34.300\n And that's why I got out of physics.\n\n47:34.300 --> 47:39.060\n When you called me a physicist, it was a great honor, but the reason I didn't become a physicist\n\n47:39.060 --> 47:41.340\n wasn't that I fell in love with mathematics.\n\n47:41.340 --> 47:49.060\n I said, wow, in 1984, 1983, I saw the field going mad and I saw that mathematics, which\n\n47:49.060 --> 47:52.980\n has all sorts of problems, was not going insane.\n\n47:52.980 --> 47:57.500\n And so instead of studying things within physics, I thought it was much safer to study the same\n\n47:57.500 --> 47:59.900\n objects within mathematics.\n\n47:59.900 --> 48:01.220\n There's a huge price to pay for that.\n\n48:01.220 --> 48:03.740\n You lose physical intuition.\n\n48:03.740 --> 48:08.260\n But the point is, is that it wasn't a North Korean reeducation camp either.\n\n48:08.260 --> 48:15.500\n Are you hopeful about cracking open the Einstein unified theory in a way that has been really,\n\n48:15.500 --> 48:21.420\n really understanding whether this, uh, uniting everything together with quantum theory and\n\n48:21.420 --> 48:22.420\n so on?\n\n48:22.420 --> 48:28.340\n I mean, I'm trying to play this role myself to do it to the extent of handing it over\n\n48:28.340 --> 48:34.300\n to the more responsible, more professional, more competent community.\n\n48:34.300 --> 48:40.540\n Um, so I think that they're wrong about a great number of their belief structures, but\n\n48:40.540 --> 48:45.660\n I do believe, I mean, I have a really profound love, hate relationship with this group of\n\n48:45.660 --> 48:46.660\n people.\n\n48:46.660 --> 48:51.780\n I think the physics side, cause the mathematicians actually seem to be much more open minded\n\n48:51.780 --> 48:55.940\n and uh, well they are and they aren't, they're open minded about anything that looks like\n\n48:55.940 --> 48:56.940\n great math.\n\n48:56.940 --> 48:57.940\n Right.\n\n48:57.940 --> 48:58.940\n Right.\n\n48:58.940 --> 49:01.820\n They'll study something that isn't very important physics, but if it's beautiful mathematics,\n\n49:01.820 --> 49:07.780\n then they'll have a, they have great intuition about these things as good as the mathematicians\n\n49:07.780 --> 49:08.780\n are.\n\n49:08.780 --> 49:12.780\n And I might even intellectually at some horsepower level, give them the edge.\n\n49:12.780 --> 49:16.700\n The theoretical theoretical physics community is bar none.\n\n49:16.700 --> 49:22.020\n The most profound intellectual community that we have ever created.\n\n49:22.020 --> 49:23.700\n It is the number one.\n\n49:23.700 --> 49:28.460\n There's nobody in second place as far as I'm concerned, like in their spare time and the\n\n49:28.460 --> 49:30.620\n spare time they invented molecular biology.\n\n49:30.620 --> 49:33.180\n What, what was the origin of molecular biology?\n\n49:33.180 --> 49:34.700\n You're saying something like Francis Crick.\n\n49:34.700 --> 49:39.180\n I mean, a lot of, a lot of the early molecular biologists were physicists.\n\n49:39.180 --> 49:40.180\n Yeah.\n\n49:40.180 --> 49:44.420\n I mean, you know, Schrodinger wrote what is life and that was highly inspirational.\n\n49:44.420 --> 49:53.340\n I mean, you have to appreciate that there is no community like the basic research community\n\n49:53.340 --> 49:59.380\n in theoretical physics and it's not something I'm highly critical of these guys.\n\n49:59.380 --> 50:08.420\n I think that they would just wasted the decades of time with a near religious devotion to\n\n50:08.420 --> 50:13.340\n their misconception of where the problems were in physics.\n\n50:13.340 --> 50:20.060\n But this has been the greatest intellectual collapse ever witnessed within academics.\n\n50:20.060 --> 50:22.300\n You see it as a collapse or just a lull?\n\n50:22.300 --> 50:26.020\n Oh, I'm terrified that we're about to lose the vitality.\n\n50:26.020 --> 50:29.340\n We can't afford to pay these people.\n\n50:29.340 --> 50:33.420\n We can't afford to give them an accelerator just to play with in case they find something\n\n50:33.420 --> 50:35.300\n at the next energy level.\n\n50:35.300 --> 50:38.420\n These people created our economy.\n\n50:38.420 --> 50:41.900\n They gave us the rad lab and radar.\n\n50:41.900 --> 50:45.620\n They gave us two atomic devices to end world war two.\n\n50:45.620 --> 50:51.700\n They created the semiconductor and the transistor to power our economy through Moore's law.\n\n50:51.700 --> 50:57.360\n As a positive externality of particle accelerators, they created the worldwide web and we have\n\n50:57.360 --> 51:02.420\n the insolence to say, why should we fund you with our taxpayer dollars?\n\n51:02.420 --> 51:08.860\n No, the question is, are you enjoying your physics dollars?\n\n51:08.860 --> 51:15.780\n These guys signed the world's worst licensing agreement and if they simply charged for every\n\n51:15.780 --> 51:23.540\n time you used a transistor or a URL or enjoyed the piece that they have provided during this\n\n51:23.540 --> 51:29.140\n period of time through the terrible weapons that they developed or your communications\n\n51:29.140 --> 51:34.060\n devices, all of the things that power our economy, I really think came out of physics,\n\n51:34.060 --> 51:37.020\n even to the extent the chemistry came out of physics and molecular biology came out\n\n51:37.020 --> 51:38.020\n of physics.\n\n51:38.020 --> 51:42.780\n So, first of all, you have to know that I'm very critical of this community.\n\n51:42.780 --> 51:45.180\n Second of all, it is our most important community.\n\n51:45.180 --> 51:46.180\n We have neglected it.\n\n51:46.180 --> 51:47.660\n We've abused it.\n\n51:47.660 --> 51:49.820\n We don't take it seriously.\n\n51:49.820 --> 51:55.780\n We don't even care to get them to rehab after a couple of generations of failure, right?\n\n51:55.780 --> 52:01.060\n No one, I think the youngest person to have really contributed to the standard model of\n\n52:01.060 --> 52:05.780\n theoretical level was born in 1951, right?\n\n52:05.780 --> 52:15.020\n Frank Wilczek and almost nothing has happened that in theoretical physics after 1973, 74\n\n52:15.020 --> 52:21.780\n that sent somebody to Stockholm for theoretical development that predicted experiment.\n\n52:21.780 --> 52:24.580\n So we have to understand that we are doing this to ourselves.\n\n52:24.580 --> 52:31.340\n Now, with that said, these guys have behaved abysmally in my opinion because they haven't\n\n52:31.340 --> 52:35.540\n owned up to where they actually are, what problems they're really facing, how definite\n\n52:35.540 --> 52:37.380\n they can actually be.\n\n52:37.380 --> 52:40.820\n They haven't shared some of their most brilliant discoveries, which are desperately needed\n\n52:40.820 --> 52:45.740\n in other fields like gauge theory, which at least the mathematicians can, can share, which\n\n52:45.740 --> 52:49.180\n is an upgrade of the differential calculus of Newton and Leibniz.\n\n52:49.180 --> 52:53.100\n And they haven't shared the importance of renormalization theory.\n\n52:53.100 --> 52:57.940\n Even though this should be standard operating procedure for people across the sciences dealing\n\n52:57.940 --> 53:01.180\n with different layers and different levels of phenomena.\n\n53:01.180 --> 53:06.240\n And by shared, you mean communicated in such a way that it disseminates throughout the\n\n53:06.240 --> 53:07.240\n different sizes.\n\n53:07.240 --> 53:12.180\n These guys are sitting, both theoretical physicists and mathematicians are sitting on top of a\n\n53:12.180 --> 53:16.420\n giant stockpile of intellectual gold, right?\n\n53:16.420 --> 53:19.740\n They have so many things that have not been manifested anywhere.\n\n53:19.740 --> 53:25.260\n I was just on Twitter, I think I mentioned the Habermann switch pitch that shows the\n\n53:25.260 --> 53:28.980\n self duality of the tetrahedron realized as a linkage mechanism.\n\n53:28.980 --> 53:36.540\n Now this is like a triviality and it makes an amazing toy that's, you know, built a market,\n\n53:36.540 --> 53:38.460\n hopefully a fortune for Chuck Habermann.\n\n53:38.460 --> 53:44.740\n Well, you have no idea how much great stuff that these priests have in their monastery.\n\n53:44.740 --> 53:47.540\n So it's truly a love and hate relationship for you.\n\n53:47.540 --> 53:48.540\n Yeah.\n\n53:48.540 --> 53:49.540\n Well, it sounds like it's more on the love side.\n\n53:49.540 --> 53:54.740\n This building that we're in right here is the building in which I really put together\n\n53:54.740 --> 54:00.180\n the conspiracy between the National Academy of Sciences and the National Science Foundation\n\n54:00.180 --> 54:04.400\n through the government university industry research round table to destroy the bargaining\n\n54:04.400 --> 54:10.980\n power of American academics, uh, using foreign labor with, uh, on microfeature in the base.\n\n54:10.980 --> 54:11.980\n Oh yeah.\n\n54:11.980 --> 54:13.220\n That was done here in this building.\n\n54:13.220 --> 54:14.220\n Isn't that weird?\n\n54:14.220 --> 54:19.220\n And I'm, I'm truly speaking with a revolutionary and a radical, uh, no, no, no, no, no, no,\n\n54:19.220 --> 54:20.220\n no, no, no, no, no, no.\n\n54:20.220 --> 54:25.220\n At an intellectual level, I am absolutely garden variety.\n\n54:25.220 --> 54:27.660\n I'm just straight down the middle.\n\n54:27.660 --> 54:33.660\n The system that we are in this, this university is functionally insane.\n\n54:33.660 --> 54:34.660\n Yeah.\n\n54:34.660 --> 54:41.140\n Harvard is functionally insane and we don't understand that when we get these things wrong,\n\n54:41.140 --> 54:43.660\n the financial crisis made this very clear.\n\n54:43.660 --> 54:49.340\n There was a long period where every grownup, everybody with a tie, uh, who spoke in a,\n\n54:49.340 --> 54:54.820\n you know, in Barrett, baritone tones, uh, with, with the right degree at the end of\n\n54:54.820 --> 54:55.820\n their name.\n\n54:55.820 --> 54:56.820\n Yeah.\n\n54:56.820 --> 54:59.420\n Uh, we're talking about how we banished volunteer volatility.\n\n54:59.420 --> 55:01.100\n We were in the great moderation.\n\n55:01.100 --> 55:02.260\n Okay.\n\n55:02.260 --> 55:04.100\n They were all crazy.\n\n55:04.100 --> 55:05.100\n And who was, who was right?\n\n55:05.100 --> 55:08.460\n It was like Nassim Taleb, Nouriel Roubini.\n\n55:08.460 --> 55:13.980\n Now what happens is, is that they claimed the market went crazy, but the market didn't\n\n55:13.980 --> 55:14.980\n go crazy.\n\n55:14.980 --> 55:18.620\n The market had been crazy and what happened is, is that it suddenly went sane.\n\n55:18.620 --> 55:21.660\n Well, that's where we are with academics.\n\n55:21.660 --> 55:25.500\n Academics right now is mad as a hatter and it's, it's absolutely evident.\n\n55:25.500 --> 55:27.000\n I can show you graph after graph.\n\n55:27.000 --> 55:28.500\n I can show you the internal discussions.\n\n55:28.500 --> 55:30.900\n I can show you the conspiracies.\n\n55:30.900 --> 55:35.380\n Barrett's dealing with one right now over, uh, it's admissions policies for people, uh,\n\n55:35.380 --> 55:38.300\n of color, uh, who happened to come from Asia.\n\n55:38.300 --> 55:41.420\n All of this madness is necessary to keep the game going.\n\n55:41.420 --> 55:46.940\n What we're talking about just on, well, we're on the topic of revolutionaries is we're talking\n\n55:46.940 --> 55:50.060\n about the danger of an outbreak of sanity.\n\n55:50.060 --> 55:51.060\n Yeah.\n\n55:51.060 --> 55:57.020\n You're, you're the guy pointing out the elephant in the room here and the elephant has no clothes.\n\n55:57.020 --> 55:59.540\n Is that how that goes?\n\n55:59.540 --> 56:07.980\n I was going to talk a little bit to, uh, Joe Rogan about this, ran out of time, but I think\n\n56:07.980 --> 56:13.420\n you're, you have some, you, just listening to you, you could probably speak really eloquently\n\n56:13.420 --> 56:16.580\n to academia on the difference between the different fields.\n\n56:16.580 --> 56:21.740\n So you think there's a difference between science, engineering, and then the humanities\n\n56:21.740 --> 56:25.940\n in academia in terms of tolerance that they're willing to tolerate?\n\n56:25.940 --> 56:33.020\n So from my perspective, I thought computer science and maybe engineering is more tolerant\n\n56:33.020 --> 56:38.580\n to radical ideas, but that's perhaps innocent of me is that I always, you know, all the\n\n56:38.580 --> 56:42.380\n battles going on now are a little bit more on the humanity side and gender studies and\n\n56:42.380 --> 56:43.380\n so on.\n\n56:43.380 --> 56:48.140\n Have you seen the, uh, American mathematical society's publication of an essay called get\n\n56:48.140 --> 56:49.140\n out the way?\n\n56:49.140 --> 56:50.140\n I have not.\n\n56:50.140 --> 56:55.100\n What's, what's the idea is that white men who hold, uh, positions.\n\n56:55.100 --> 56:56.540\n Yeah.\n\n56:56.540 --> 57:01.300\n Within universities and mathematics should vacate their positions so that young black\n\n57:01.300 --> 57:04.020\n women can take over something like this.\n\n57:04.020 --> 57:07.240\n That's in terms of diversity, which I also want to ask you about, but in terms of diversity\n\n57:07.240 --> 57:14.980\n of strictly ideas, do you think, cause you're basically saying physics as a community has\n\n57:14.980 --> 57:21.460\n become a little bit intolerant to some degree to new radical ideas, or at least you, uh,\n\n57:21.460 --> 57:26.940\n you said it's changed a little bit recently, which is that even string theory is now admitting,\n\n57:26.940 --> 57:32.960\n okay, we don't look very promising in the short term, right?\n\n57:32.960 --> 57:39.860\n So the question is what compiles if you want to take the computer science metaphor, what\n\n57:39.860 --> 57:42.060\n will get you into a journal?\n\n57:42.060 --> 57:47.060\n Will you spend your life trying to push some paper into a journal or will it be accepted\n\n57:47.060 --> 57:48.060\n easily?\n\n57:48.060 --> 57:56.660\n What about the characteristics of the submitter and what gets taken up and what does not?\n\n57:56.660 --> 58:01.780\n All of these fields are experiencing pressure because no field is performing so brilliantly\n\n58:01.780 --> 58:11.320\n well, um, that it's revolutionizing our way of speaking and thinking in the ways in which\n\n58:11.320 --> 58:12.900\n we've become accustomed.\n\n58:12.900 --> 58:19.340\n But don't you think even in theoretical physics, a lot of times, even with theories like string\n\n58:19.340 --> 58:24.180\n theory, you could speak to this, it does eventually lead to what are the ways that this theory\n\n58:24.180 --> 58:25.660\n would be testable.\n\n58:25.660 --> 58:31.960\n Yeah, ultimately, although look, there's this thing about popper and the scientific method\n\n58:31.960 --> 58:36.400\n that's a cancer and a disease and the minds of very smart people.\n\n58:36.400 --> 58:39.860\n That's not really how most of the stuff gets worked out.\n\n58:39.860 --> 58:41.340\n It's how it gets checked.\n\n58:41.340 --> 58:47.380\n All right, so, and there is a dialogue between theory and experiment, but everybody should\n\n58:47.380 --> 58:56.980\n read Paul directs 1963 American scientific American article where he, he, you know, it's\n\n58:56.980 --> 58:57.980\n very interesting.\n\n58:57.980 --> 59:03.160\n He talks about it as if it was about the Schrodinger equation and Schrodinger's failure to advance\n\n59:03.160 --> 59:06.340\n his own work because of his failure to account for some phenomenon.\n\n59:06.340 --> 59:10.400\n The key point is that if your theory is a slight bit off, it won't agree with experiment,\n\n59:10.400 --> 59:12.940\n but it doesn't mean that the theory is actually wrong.\n\n59:12.940 --> 59:18.700\n Um, but direct could as easily have been talking about his own equation in which he predicted\n\n59:18.700 --> 59:22.460\n that the electrons should have an antiparticle.\n\n59:22.460 --> 59:26.820\n And since the only positively charged particle that was known at the time was the proton,\n\n59:26.820 --> 59:30.780\n Heisenberg pointed out, well, shouldn't your antiparticle, the proton have the same mass\n\n59:30.780 --> 59:33.660\n as the electron and doesn't that invalidate your theory?\n\n59:33.660 --> 59:38.860\n So I think the direct was actually being quite potentially quite sneaky, um, and, uh, talking\n\n59:38.860 --> 59:42.980\n about the fact that he had been pushed off of his own theory to some extent by Heisenberg.\n\n59:42.980 --> 59:51.580\n Um, but look, we've fetishized the scientific method and popper and falsification, um, because\n\n59:51.580 --> 59:55.580\n it protects us from crazy ideas entering the field.\n\n59:55.580 --> 59:58.420\n So you know, it's a question of balancing type one and type two error.\n\n59:58.420 --> 1:00:01.560\n And we're pretty, we were pretty maxed out in one direction.\n\n1:00:01.560 --> 1:00:08.020\n The opposite of that, let me say what comforts me sort of biology or engineering, uh, at\n\n1:00:08.020 --> 1:00:10.860\n the end of the day, does the thing work?\n\n1:00:10.860 --> 1:00:11.860\n Yeah.\n\n1:00:11.860 --> 1:00:15.580\n You can test the crazies away and the crazy.\n\n1:00:15.580 --> 1:00:19.700\n Well see now you're saying, but some ideas are truly crazy and some are, are actually\n\n1:00:19.700 --> 1:00:20.700\n correct.\n\n1:00:20.700 --> 1:00:24.140\n So, well there's pre correct currently crazy.\n\n1:00:24.140 --> 1:00:25.140\n Yeah.\n\n1:00:25.140 --> 1:00:26.140\n Right.\n\n1:00:26.140 --> 1:00:30.020\n And so you don't want to get rid of everybody who's pre correct and currently crazy.\n\n1:00:30.020 --> 1:00:37.020\n Um, the problem is, is that we don't have standards in general for trying to determine\n\n1:00:37.020 --> 1:00:42.180\n who has to be put to the sword in terms of their career and who has to be protected,\n\n1:00:42.180 --> 1:00:47.940\n uh, as some sort of giant time suck pain in the ass, uh, who may change everything.\n\n1:00:47.940 --> 1:00:48.940\n Do you think that's possible?\n\n1:00:48.940 --> 1:00:51.180\n Uh, creating a mechanism of those select?\n\n1:00:51.180 --> 1:00:53.860\n Well, you're not going to like the answer, but here it comes.\n\n1:00:53.860 --> 1:00:54.860\n Oh boy.\n\n1:00:54.860 --> 1:00:59.440\n It has to do with very human elements.\n\n1:00:59.440 --> 1:01:02.580\n We're trying to do this at the level of like rules and fairness.\n\n1:01:02.580 --> 1:01:10.980\n That's not going to work cause the only thing that really understands this, you read the\n\n1:01:10.980 --> 1:01:11.980\n double helix?\n\n1:01:11.980 --> 1:01:12.980\n It's a book.\n\n1:01:12.980 --> 1:01:16.140\n Oh, you have to read this book.\n\n1:01:16.140 --> 1:01:22.060\n Not only did Jim Watson, uh, half discover this three dimensional structure of DNA, he's\n\n1:01:22.060 --> 1:01:28.420\n also one hell of a writer before he became an ass, uh, that no, he's tried to destroy\n\n1:01:28.420 --> 1:01:29.620\n his own reputation.\n\n1:01:29.620 --> 1:01:33.060\n I knew about the ass, I didn't know about the good writer.\n\n1:01:33.060 --> 1:01:36.180\n Jim Watson is one of the most important people now living.\n\n1:01:36.180 --> 1:01:42.140\n And uh, as I've said before, Jim Watson is too important, a legacy to be left to Jim\n\n1:01:42.140 --> 1:01:43.140\n Watson.\n\n1:01:43.140 --> 1:01:49.500\n Um, yeah, that book tells you more about what actually moves the dial, right?\n\n1:01:49.500 --> 1:01:53.700\n There's another story about him, which I don't, don't agree with, which is that he stole everything\n\n1:01:53.700 --> 1:01:54.700\n from Rosalind Franklin.\n\n1:01:54.700 --> 1:01:58.840\n I mean the, the problems that he had with Rosalind Franklin are real, but we should\n\n1:01:58.840 --> 1:02:04.260\n actually honor that tension in our history by delving into it rather than having a simple\n\n1:02:04.260 --> 1:02:05.260\n solution.\n\n1:02:05.260 --> 1:02:10.180\n Jim Watson talks about Francis Crick being a pain in the ass that everybody secretly\n\n1:02:10.180 --> 1:02:12.840\n knew was super brilliant.\n\n1:02:12.840 --> 1:02:19.260\n And there's an encounter between, uh, Chargaff, uh, who came up with the equimolar relations\n\n1:02:19.260 --> 1:02:25.140\n between the nucleotides who should have gotten the structure of DNA and Watson and Crick.\n\n1:02:25.140 --> 1:02:30.900\n And you know, he talks about missing a shiver in the heartbeat of biology and stuff is so\n\n1:02:30.900 --> 1:02:31.900\n gorgeous.\n\n1:02:31.900 --> 1:02:35.220\n It just makes you tremble even thinking about it.\n\n1:02:35.220 --> 1:02:42.980\n Um, look, we know very often who is to be feared and we need to fund the people that\n\n1:02:42.980 --> 1:02:45.160\n we fear.\n\n1:02:45.160 --> 1:02:49.740\n The people who are wasting our time need to be excluded from the conversation.\n\n1:02:49.740 --> 1:02:54.980\n You see, and you know, maybe we'll make some errors in both directions.\n\n1:02:54.980 --> 1:02:58.200\n But we have known our own people.\n\n1:02:58.200 --> 1:03:02.500\n We know the pains in the asses that might work out and we know the people who are really\n\n1:03:02.500 --> 1:03:06.780\n just blowhards who really have very little to contribute most of the time.\n\n1:03:06.780 --> 1:03:10.140\n It's not a hundred percent, but you're not going to get there with rules.\n\n1:03:10.140 --> 1:03:11.140\n Right.\n\n1:03:11.140 --> 1:03:12.620\n It's a using some kind of instinct.\n\n1:03:12.620 --> 1:03:18.500\n I mean, I, to be honest, I'm going to make you roll your eyes for a second, but uh, and\n\n1:03:18.500 --> 1:03:21.760\n the first time I heard that there is a large community of people who believe the earth\n\n1:03:21.760 --> 1:03:27.980\n is flat actually made me pause and ask myself the question, why would there be such a community?\n\n1:03:27.980 --> 1:03:28.980\n Yeah.\n\n1:03:28.980 --> 1:03:30.260\n Is it possible the earth is flat?\n\n1:03:30.260 --> 1:03:33.140\n So I had to like, wait a minute.\n\n1:03:33.140 --> 1:03:37.620\n I mean, then you go through a thinking process that I think is really healthy.\n\n1:03:37.620 --> 1:03:39.580\n It ultimately ends up being a geometry thing.\n\n1:03:39.580 --> 1:03:43.340\n I think, uh, it's an interesting, it's an interesting thought experiment at the very\n\n1:03:43.340 --> 1:03:44.340\n least.\n\n1:03:44.340 --> 1:03:46.540\n Well, I don't, I do a different version of it.\n\n1:03:46.540 --> 1:03:48.460\n I say, why is this community stable?\n\n1:03:48.460 --> 1:03:49.460\n Yeah.\n\n1:03:49.460 --> 1:03:51.020\n That's a good, uh, way to analyze it.\n\n1:03:51.020 --> 1:03:56.020\n Well, interesting that whatever we've done has not erased the community.\n\n1:03:56.020 --> 1:04:00.660\n So you know, they're taking a long shot bet that won't pan out, you know, maybe we just\n\n1:04:00.660 --> 1:04:04.580\n haven't thought enough about the rationality of the square root of two and somebody brilliant\n\n1:04:04.580 --> 1:04:05.580\n will figure it out.\n\n1:04:05.580 --> 1:04:11.540\n Maybe we will eventually land one day on the surface of Jupiter and explore it, right?\n\n1:04:11.540 --> 1:04:14.220\n These are crazy things that will never happen.\n\n1:04:14.220 --> 1:04:17.580\n So much of social media operates by AI algorithms.\n\n1:04:17.580 --> 1:04:21.980\n You talked about this a little bit, uh, recommending the content you see.\n\n1:04:21.980 --> 1:04:28.180\n So on this idea of radical thought, how much should AI show you things you disagree with\n\n1:04:28.180 --> 1:04:34.460\n on Twitter and so on in a Twitter word verse in this question?\n\n1:04:34.460 --> 1:04:35.460\n Yeah.\n\n1:04:35.460 --> 1:04:36.460\n Yeah.\n\n1:04:36.460 --> 1:04:37.460\n Cause you don't know the answer?\n\n1:04:37.460 --> 1:04:38.460\n No, no, no, no.\n\n1:04:38.460 --> 1:04:44.460\n Look, we've been, they've pushed out this cognitive Lego to us that will just lead to\n\n1:04:44.460 --> 1:04:45.940\n madness.\n\n1:04:45.940 --> 1:04:49.460\n It's good to be challenged with things that you disagree with.\n\n1:04:49.460 --> 1:04:53.900\n The answer is no, it's good to be challenged with interesting things with which you currently\n\n1:04:53.900 --> 1:04:56.700\n disagree, but that might be true.\n\n1:04:56.700 --> 1:05:00.380\n So I don't really care about whether or not I disagree with something or don't disagree.\n\n1:05:00.380 --> 1:05:05.460\n I need to know why that particular disagreeable thing is being pushed out.\n\n1:05:05.460 --> 1:05:07.140\n Is it because it's likely to be true?\n\n1:05:07.140 --> 1:05:09.900\n Is it because, is there some reason?\n\n1:05:09.900 --> 1:05:14.380\n Because I can write, I can write a computer generator, uh, to come up with an infinite\n\n1:05:14.380 --> 1:05:17.740\n number of disagreeable statements that nobody needs to look at.\n\n1:05:17.740 --> 1:05:22.920\n So please, before you push things at me that are disagreeable, tell me why.\n\n1:05:22.920 --> 1:05:26.220\n There is an aspect in which that question is quite dumb, especially because it's being\n\n1:05:26.220 --> 1:05:34.140\n used to, uh, almost, um, uh, very generically by these different networks to say, well,\n\n1:05:34.140 --> 1:05:35.620\n we're trying to work this out.\n\n1:05:35.620 --> 1:05:43.100\n But you know, basically, uh, how much do you see the value of seeing things, uh, you don't\n\n1:05:43.100 --> 1:05:47.660\n like, not you disagree with, because it's very difficult to know exactly what you articulated,\n\n1:05:47.660 --> 1:05:53.460\n which is, uh, the stuff that's important for you to consider that you disagree with.\n\n1:05:53.460 --> 1:05:55.040\n That's really hard to figure out.\n\n1:05:55.040 --> 1:05:57.240\n The bottom line is this stuff you don't like.\n\n1:05:57.240 --> 1:06:03.040\n If you're a, uh, uh, Hillary Clinton supporter, you may not want to, it might not make you\n\n1:06:03.040 --> 1:06:05.980\n feel good to see anything about Donald Trump.\n\n1:06:05.980 --> 1:06:08.420\n That's the only thing algorithms can really optimize for currently.\n\n1:06:08.420 --> 1:06:09.420\n They really can't.\n\n1:06:09.420 --> 1:06:10.660\n Now they can do better.\n\n1:06:10.660 --> 1:06:11.660\n This is where we're.\n\n1:06:11.660 --> 1:06:12.660\n You think so?\n\n1:06:12.660 --> 1:06:21.660\n No, we're engaged in some moronic back and forth where I have no idea why people who\n\n1:06:21.660 --> 1:06:27.580\n are capable of building Google, Facebook, Twitter are having us in these incredibly\n\n1:06:27.580 --> 1:06:28.940\n low level discussions.\n\n1:06:28.940 --> 1:06:31.260\n Do they not know any smart people?\n\n1:06:31.260 --> 1:06:36.140\n Do they not have the phone numbers of people who can elevate these discussions?\n\n1:06:36.140 --> 1:06:41.220\n They do, but this, they're optimizing for a different thing and they're pushing those\n\n1:06:41.220 --> 1:06:42.500\n people out of those rooms.\n\n1:06:42.500 --> 1:06:47.140\n They're, they're optimizing for things we can't see.\n\n1:06:47.140 --> 1:06:48.580\n And yes, profit is there.\n\n1:06:48.580 --> 1:06:54.620\n Nobody, nobody's questioning that, but they're also optimizing for things like political\n\n1:06:54.620 --> 1:06:57.640\n control or the fact that they're doing business in Pakistan.\n\n1:06:57.640 --> 1:07:01.300\n And so they don't want to talk about all the things that they're going to be bending to\n\n1:07:01.300 --> 1:07:03.340\n in Pakistan.\n\n1:07:03.340 --> 1:07:06.860\n So we're involved in a fake discussion.\n\n1:07:06.860 --> 1:07:07.960\n You think so?\n\n1:07:07.960 --> 1:07:11.340\n You think these conversations at that depth are happening inside Google?\n\n1:07:11.340 --> 1:07:15.820\n You don't think they have some basic metrics under user engagements?\n\n1:07:15.820 --> 1:07:18.320\n You're having a fake conversation with us guys.\n\n1:07:18.320 --> 1:07:19.860\n We know you're having a fake conversation.\n\n1:07:19.860 --> 1:07:23.700\n I do not wish to be part of your fake conversation.\n\n1:07:23.700 --> 1:07:28.980\n You know how to cool, you know, these units, you know, high availability, like nobody's\n\n1:07:28.980 --> 1:07:29.980\n business.\n\n1:07:29.980 --> 1:07:31.780\n My Gmail never goes down.\n\n1:07:31.780 --> 1:07:32.780\n Almost.\n\n1:07:32.780 --> 1:07:38.380\n So you think just because they can do incredible work on the software side with infrastructure,\n\n1:07:38.380 --> 1:07:46.420\n they can also deal with some of these difficult questions about human behavior, human understanding.\n\n1:07:46.420 --> 1:07:47.420\n You're not.\n\n1:07:47.420 --> 1:07:53.900\n I mean, I've seen the, I've seen the developers screens that people take shots of inside of\n\n1:07:53.900 --> 1:07:55.380\n Google.\n\n1:07:55.380 --> 1:07:58.540\n And I've heard stories inside of Facebook and Apple.\n\n1:07:58.540 --> 1:08:00.720\n We're not, we're engaged.\n\n1:08:00.720 --> 1:08:04.100\n They're engaging us in the wrong conversations.\n\n1:08:04.100 --> 1:08:06.220\n We are not at this low level.\n\n1:08:06.220 --> 1:08:08.260\n Here's one of my favorite questions.\n\n1:08:08.260 --> 1:08:17.340\n Why is every piece of hardware that I purchase in tech space equipped as a listening device?\n\n1:08:17.340 --> 1:08:19.780\n Where's my physical shutter to cover my lens?\n\n1:08:19.780 --> 1:08:26.060\n We had this in the 1970s, cameras that had lens caps, you know, how much would it cost\n\n1:08:26.060 --> 1:08:29.900\n to have a security model pay five extra bucks?\n\n1:08:29.900 --> 1:08:33.100\n Why is my indicator light software controlled?\n\n1:08:33.100 --> 1:08:37.980\n Why when my camera is on, do I not see that the light is on by putting it as something\n\n1:08:37.980 --> 1:08:39.780\n that cannot be bypassed?\n\n1:08:39.780 --> 1:08:45.460\n Why have you set up my, all of my devices at some difficulty to yourselves as listening\n\n1:08:45.460 --> 1:08:47.780\n devices and we don't even talk about this.\n\n1:08:47.780 --> 1:08:50.820\n This is, this thing is total fucking bullshit.\n\n1:08:50.820 --> 1:08:55.420\n Well, I hope these discussions are happening about privacy.\n\n1:08:55.420 --> 1:08:57.100\n Is there a more difficult thing you're giving them credit for?\n\n1:08:57.100 --> 1:08:59.140\n It's not just privacy.\n\n1:08:59.140 --> 1:09:01.140\n It's about social control.\n\n1:09:01.140 --> 1:09:03.700\n We're talking about social control.\n\n1:09:03.700 --> 1:09:07.260\n Why do I not have controls over my own levers?\n\n1:09:07.260 --> 1:09:11.780\n Just have a really cute UI where I can switch, I can dial things or I can at least see what\n\n1:09:11.780 --> 1:09:13.460\n the algorithms are.\n\n1:09:13.460 --> 1:09:17.540\n You think that there is some deliberate choices being made here.\n\n1:09:17.540 --> 1:09:21.700\n There's emergence and there is intention.\n\n1:09:21.700 --> 1:09:23.000\n There are two dimensions.\n\n1:09:23.000 --> 1:09:29.260\n The vector does not collapse onto either axis, but the idea that anybody who suggests that\n\n1:09:29.260 --> 1:09:34.580\n intention is completely absent is a child.\n\n1:09:34.580 --> 1:09:38.820\n That's really beautifully put and uh, like many things you've said is going to make me\n\n1:09:38.820 --> 1:09:40.900\n can I turn this around slightly?\n\n1:09:40.900 --> 1:09:41.900\n Yeah.\n\n1:09:41.900 --> 1:09:45.660\n I sit down with you and you say that you're obsessed with my feed.\n\n1:09:45.660 --> 1:09:47.740\n I don't even know what my feed is.\n\n1:09:47.740 --> 1:09:49.700\n What are you seeing that I'm not?\n\n1:09:49.700 --> 1:09:54.860\n I was obsessively looking through your feed on Twitter because it was really enjoyable\n\n1:09:54.860 --> 1:09:58.300\n because there's the Tom layer element is the humor in it.\n\n1:09:58.300 --> 1:10:03.180\n By the way, that feed is Eric R. Weinstein on Twitter at Eric R. Weinstein.\n\n1:10:03.180 --> 1:10:06.720\n No, but seriously, why?\n\n1:10:06.720 --> 1:10:10.180\n Why did I find it enjoyable or what was I seeing?\n\n1:10:10.180 --> 1:10:11.180\n What are you looking for?\n\n1:10:11.180 --> 1:10:13.020\n Why are we doing this?\n\n1:10:13.020 --> 1:10:14.780\n What is this podcast about?\n\n1:10:14.780 --> 1:10:16.460\n I know you've got all these interesting people.\n\n1:10:16.460 --> 1:10:18.900\n I'm just some guy who's sort of a podcast guest.\n\n1:10:18.900 --> 1:10:21.420\n Sort of a podcast.\n\n1:10:21.420 --> 1:10:22.420\n You're not even wearing a tie.\n\n1:10:22.420 --> 1:10:25.740\n I mean, it's not even a serious interview.\n\n1:10:25.740 --> 1:10:34.540\n I'm searching for meaning, for happiness, for a dopamine rush, so short term, long term.\n\n1:10:34.540 --> 1:10:37.340\n And how are you finding your way to me?\n\n1:10:37.340 --> 1:10:41.460\n I don't honestly know what I'm doing to reach you.\n\n1:10:41.460 --> 1:10:48.000\n The representing ideas which feel common sense to me and not many people are speaking.\n\n1:10:48.000 --> 1:10:54.700\n So it's kind of like the intellectual dark web folks, right?\n\n1:10:54.700 --> 1:11:00.580\n These folks from Sam Harris to Jordan Peterson to yourself are saying things where you're\n\n1:11:00.580 --> 1:11:05.420\n like saying, look, there's an elephant and he's not wearing any clothes.\n\n1:11:05.420 --> 1:11:09.580\n And I say, yeah, yeah, let's have more of that conversation.\n\n1:11:09.580 --> 1:11:10.940\n That's how I'm finding you.\n\n1:11:10.940 --> 1:11:14.700\n I'm desperate to try to change the conversation we're having.\n\n1:11:14.700 --> 1:11:17.340\n I'm very worried we've got an election in 2020.\n\n1:11:17.340 --> 1:11:23.960\n I don't think we can afford four more years of a misinterpreted message, which is what\n\n1:11:23.960 --> 1:11:25.820\n Donald Trump was.\n\n1:11:25.820 --> 1:11:28.420\n And I don't want the destruction of our institutions.\n\n1:11:28.420 --> 1:11:30.740\n They all seem hell bent on destroying themselves.\n\n1:11:30.740 --> 1:11:34.920\n So I'm trying to save theoretical physics, trying to save the New York Times, trying\n\n1:11:34.920 --> 1:11:38.320\n to save our various processes.\n\n1:11:38.320 --> 1:11:44.540\n And I think it feels delusional to me that this is falling to a tiny group of people\n\n1:11:44.540 --> 1:11:49.780\n who are willing to speak out without getting so freaked out that everything they say will\n\n1:11:49.780 --> 1:11:52.980\n be misinterpreted and that their lives will be ruined through the process.\n\n1:11:52.980 --> 1:11:57.580\n I mean, I think we're in an absolutely bananas period of time and I don't believe it should\n\n1:11:57.580 --> 1:12:02.580\n fall to such a tiny number of shoulders to shoulder this way.\n\n1:12:02.580 --> 1:12:08.140\n So I have to ask you on the capitalism side, you mentioned that technology is killing capitalism\n\n1:12:08.140 --> 1:12:15.240\n or it has effects that are unintended, well, not unintended, but not what economists would\n\n1:12:15.240 --> 1:12:18.740\n predict or speak of capitalism creating.\n\n1:12:18.740 --> 1:12:23.540\n I just want to talk to you about in general, the effect of even then artificial intelligence\n\n1:12:23.540 --> 1:12:28.980\n or technology automation taking away jobs and these kinds of things and what you think\n\n1:12:28.980 --> 1:12:34.240\n is the way to alleviate that, whether the Andrew Ng presidential candidate with universal\n\n1:12:34.240 --> 1:12:38.780\n basic income, UBI, what are your thoughts there?\n\n1:12:38.780 --> 1:12:41.940\n How do we fight off the negative effects of technology that...\n\n1:12:41.940 --> 1:12:43.980\n All right, you're a software guy, right?\n\n1:12:43.980 --> 1:12:44.980\n Yep.\n\n1:12:44.980 --> 1:12:52.180\n A human being is a worker is an old idea, a human being has a worker is a different\n\n1:12:52.180 --> 1:12:53.180\n object, right?\n\n1:12:53.180 --> 1:12:54.180\n Yeah.\n\n1:12:54.180 --> 1:12:59.420\n So if you think about object oriented programming as a paradigm, a human being has a worker\n\n1:12:59.420 --> 1:13:01.940\n and a human being has a soul.\n\n1:13:01.940 --> 1:13:07.740\n We're talking about the fact that for a period of time, the worker that a human being has\n\n1:13:07.740 --> 1:13:11.700\n was in a position to feed the soul that a human being has.\n\n1:13:11.700 --> 1:13:18.300\n However, we have two separate claims on the value in society.\n\n1:13:18.300 --> 1:13:23.460\n One is as a worker and the other is as a soul and the soul needs sustenance, it needs dignity,\n\n1:13:23.460 --> 1:13:27.500\n it needs meaning, it needs purpose.\n\n1:13:27.500 --> 1:13:34.700\n As long as your means of support is not highly repetitive, I think you have a while to go\n\n1:13:34.700 --> 1:13:37.020\n before you need to start worrying.\n\n1:13:37.020 --> 1:13:41.820\n And if what you do is highly repetitive and it's not terribly generative, you are in the\n\n1:13:41.820 --> 1:13:46.080\n cross hairs of for loops and while loops.\n\n1:13:46.080 --> 1:13:51.940\n And that's what computers excel at, repetitive behavior and when I say repetitive, I may\n\n1:13:51.940 --> 1:13:55.340\n mean things that have never happened through combinatorial possibilities, but as long as\n\n1:13:55.340 --> 1:13:59.080\n it has a looped characteristic to it, you're in trouble.\n\n1:13:59.080 --> 1:14:07.240\n We are seeing a massive push towards socialism because capitalists are slow to address the\n\n1:14:07.240 --> 1:14:13.700\n fact that a worker may not be able to make claims, a relatively undistinguished median\n\n1:14:13.700 --> 1:14:20.900\n member of our society is still has needs to reproduce, needs to have to dignity.\n\n1:14:20.900 --> 1:14:28.900\n And when capitalism abandons the median individual or the bottom 10th or whatever it's going\n\n1:14:28.900 --> 1:14:32.780\n to do, it's flirting with revolution.\n\n1:14:32.780 --> 1:14:37.660\n And what concerns me is that the capitalists aren't sufficiently capitalistic to understand\n\n1:14:37.660 --> 1:14:39.380\n this.\n\n1:14:39.380 --> 1:14:45.200\n You really want to court authoritarian control in our society because you can't see that\n\n1:14:45.200 --> 1:14:50.020\n people may not be able to defend themselves in the marketplace because the marginal product\n\n1:14:50.020 --> 1:14:55.140\n of their labor was too low to feed their dignity as a soul.\n\n1:14:55.140 --> 1:15:02.320\n So my great concern is that our free society has to do with the fact that we are self organized.\n\n1:15:02.320 --> 1:15:06.520\n I remember looking down from my office in Manhattan when Lehman brothers collapsed and\n\n1:15:06.520 --> 1:15:12.000\n thinking who's going to tell all these people that they need to show up at work when they\n\n1:15:12.000 --> 1:15:17.520\n don't have a financial system to incentivize them to show up at work.\n\n1:15:17.520 --> 1:15:22.040\n So my complaint is first of all, not with the socialists, but with the capitalists,\n\n1:15:22.040 --> 1:15:24.640\n which is you guys are being idiots.\n\n1:15:24.640 --> 1:15:30.780\n You're courting revolution by continuing to harp on the same old ideas that, well, you\n\n1:15:30.780 --> 1:15:32.820\n know, try, try harder, bootstrap yourself.\n\n1:15:32.820 --> 1:15:38.000\n Yeah, to an extent that works to an extent, but we are clearly headed in a place that\n\n1:15:38.000 --> 1:15:45.540\n there's nothing that ties together our need to contribute and our need to consume.\n\n1:15:45.540 --> 1:15:49.540\n And that may not be provided by capitalism because it may have been a temporary phenomena.\n\n1:15:49.540 --> 1:15:55.480\n So check out my article on anthropic capitalism and the new gimmick economy.\n\n1:15:55.480 --> 1:16:00.320\n I think people are late getting the wake up call and we would be doing a better job saving\n\n1:16:00.320 --> 1:16:05.840\n capitalism from itself because I don't want this done under authoritarian control.\n\n1:16:05.840 --> 1:16:11.080\n And the more we insist that everybody who's not thriving in our society during their reproductive\n\n1:16:11.080 --> 1:16:15.280\n years in order to have a family is failing at a personal level.\n\n1:16:15.280 --> 1:16:18.840\n I mean, what a disgusting thing that we're saying.\n\n1:16:18.840 --> 1:16:23.440\n What horrible message who, who the hell have we become that we've so bought into the Chicago\n\n1:16:23.440 --> 1:16:28.220\n model that we can't see the humanity that we're destroying in that process.\n\n1:16:28.220 --> 1:16:31.240\n And it's, I hate, I hate the thought of communism.\n\n1:16:31.240 --> 1:16:32.240\n I really do.\n\n1:16:32.240 --> 1:16:34.640\n My family has flirted with it decades past.\n\n1:16:34.640 --> 1:16:39.820\n It's a wrong, bad idea, but we are going to need to figure out how to make sure that those\n\n1:16:39.820 --> 1:16:45.160\n souls are nourished and respected and capitalism better have an answer.\n\n1:16:45.160 --> 1:16:48.120\n And I'm betting on capitalism, but I've got to tell you, I'm pretty disappointed with\n\n1:16:48.120 --> 1:16:49.120\n my team.\n\n1:16:49.120 --> 1:16:52.200\n So you're still on the capitalism team.\n\n1:16:52.200 --> 1:16:55.280\n You just, uh, there's a theme here.\n\n1:16:55.280 --> 1:16:56.280\n Radical capitalism.\n\n1:16:56.280 --> 1:16:57.280\n Hyper capitalism.\n\n1:16:57.280 --> 1:16:58.280\n Yeah.\n\n1:16:58.280 --> 1:17:02.060\n I want, I think hyper capitalism is going to have to be coupled to hyper socialism.\n\n1:17:02.060 --> 1:17:07.600\n You need to allow the most productive people to create wonders and you've got to stop bogging\n\n1:17:07.600 --> 1:17:11.040\n them down with all of these extra nice requirements.\n\n1:17:11.040 --> 1:17:13.360\n You know, nice is dead.\n\n1:17:13.360 --> 1:17:14.760\n Good has a future.\n\n1:17:14.760 --> 1:17:18.680\n Nice doesn't have a future because nice ends up with, with gulags.\n\n1:17:18.680 --> 1:17:21.080\n Damn, that's a good line.\n\n1:17:21.080 --> 1:17:22.080\n Okay.\n\n1:17:22.080 --> 1:17:23.080\n Last question.\n\n1:17:23.080 --> 1:17:30.520\n You tweeted today a simple, quite insightful equation saying, uh, imagine that every unit\n\n1:17:30.520 --> 1:17:35.760\n F of fame you picked up as stalkers and H haters.\n\n1:17:35.760 --> 1:17:39.640\n So I imagine S and H are dependent on your path to fame perhaps a little bit.\n\n1:17:39.640 --> 1:17:40.640\n Well, it's not as simple.\n\n1:17:40.640 --> 1:17:44.520\n I mean, people always take these things literally when you have like 280 characters to explain\n\n1:17:44.520 --> 1:17:45.520\n yourself.\n\n1:17:45.520 --> 1:17:50.520\n So you mean that that's not a mathematical, uh, no, there's no law.\n\n1:17:50.520 --> 1:17:51.520\n Oh, okay.\n\n1:17:51.520 --> 1:17:52.520\n All right.\n\n1:17:52.520 --> 1:17:56.760\n So I put the word imagine because I still have a mathematician's desire for precision.\n\n1:17:56.760 --> 1:18:00.880\n Imagine that this were true, but it was a beautiful way to imagine that there is a law\n\n1:18:00.880 --> 1:18:03.720\n that has those variables in it.\n\n1:18:03.720 --> 1:18:06.880\n And uh, you've become quite famous these days.\n\n1:18:06.880 --> 1:18:12.640\n So how do you yourself optimize that equation with the peculiar kind of fame that you have\n\n1:18:12.640 --> 1:18:13.720\n gathered along the way?\n\n1:18:13.720 --> 1:18:14.760\n I want to be kinder.\n\n1:18:14.760 --> 1:18:16.160\n I want to be kinder to myself.\n\n1:18:16.160 --> 1:18:17.380\n I want to be kinder to others.\n\n1:18:17.380 --> 1:18:24.920\n I want to be able to have heart, compassion, or these things are really important.\n\n1:18:24.920 --> 1:18:28.960\n And uh, I have a pretty spectrumy kind of approach to analysis.\n\n1:18:28.960 --> 1:18:29.960\n I'm quite literal.\n\n1:18:29.960 --> 1:18:32.920\n I can go full rain man on you at any given moment.\n\n1:18:32.920 --> 1:18:33.920\n No, I can't.\n\n1:18:33.920 --> 1:18:34.920\n I can't.\n\n1:18:34.920 --> 1:18:37.960\n Uh, it's facultative autism if you like, and people are gonna get angry because they want\n\n1:18:37.960 --> 1:18:39.960\n autism to be respected.\n\n1:18:39.960 --> 1:18:47.000\n So when you see me coding or you see me doing mathematics, I'm, you know, I speak with speech\n\n1:18:47.000 --> 1:18:54.360\n apnea, uh, be right down to dinner, you know, we have to try to integrate ourselves and\n\n1:18:54.360 --> 1:19:00.920\n those tensions between, you know, it's sort of back to us as a worker and us as a soul.\n\n1:19:00.920 --> 1:19:06.000\n Many of us are optimizing one to the, at the expense of the other.\n\n1:19:06.000 --> 1:19:11.720\n And I struggle with social media and I struggle with people making threats against our families\n\n1:19:11.720 --> 1:19:15.840\n and I struggle with, um, just how much pain people are in.\n\n1:19:15.840 --> 1:19:21.960\n And if there's one message I would like to push out there, um, you're responsible, everybody,\n\n1:19:21.960 --> 1:19:27.640\n all of us, myself included with struggling, struggle, struggle mightily because you, it's\n\n1:19:27.640 --> 1:19:30.880\n nobody else's job to do your struggle for you.\n\n1:19:30.880 --> 1:19:34.360\n Now with that said, if you're struggling and you're trying and you're trying to figure\n\n1:19:34.360 --> 1:19:38.640\n out how to better yourself and where you failed and where you've let down your family, your\n\n1:19:38.640 --> 1:19:43.520\n friends, your workers, all this kind of stuff, give yourself a break.\n\n1:19:43.520 --> 1:19:48.880\n You know, if, if, if it's not working out, I have a lifelong relationship with failure\n\n1:19:48.880 --> 1:19:49.880\n and success.\n\n1:19:49.880 --> 1:19:56.300\n There's been no period of my life where both haven't been present in one form or another.\n\n1:19:56.300 --> 1:20:00.680\n And I do wish to say that a lot of times people think this is glamorous.\n\n1:20:00.680 --> 1:20:04.640\n I'm about to go, you know, do a show with Sam Harris.\n\n1:20:04.640 --> 1:20:07.360\n People are going to listen in on two guys having a conversation on stage.\n\n1:20:07.360 --> 1:20:10.180\n It's completely crazy when I'm always trying to figure out how to make sure that those\n\n1:20:10.180 --> 1:20:12.600\n people get maximum value.\n\n1:20:12.600 --> 1:20:18.360\n And uh, that's why I'm doing this podcast, you know, just give yourself a break.\n\n1:20:18.360 --> 1:20:20.580\n You owe us, you owe us your struggle.\n\n1:20:20.580 --> 1:20:26.200\n You don't owe your family or your coworkers or your lovers or your family members success.\n\n1:20:26.200 --> 1:20:31.420\n Um, as long as you're in there and you're picking yourself up, recognize that this,\n\n1:20:31.420 --> 1:20:37.040\n this new situation with the economy that doesn't have the juice to sustain our institutions\n\n1:20:37.040 --> 1:20:41.780\n has caused the people who've risen to the top of those institutions to get quite brutal\n\n1:20:41.780 --> 1:20:43.800\n and cruel.\n\n1:20:43.800 --> 1:20:45.400\n Everybody is lying at the moment.\n\n1:20:45.400 --> 1:20:47.280\n Nobody's really a truth teller.\n\n1:20:47.280 --> 1:20:50.280\n Um, try to keep your humanity about you.\n\n1:20:50.280 --> 1:20:55.200\n Try to recognize that if you're failing, if things aren't where you want them to be and\n\n1:20:55.200 --> 1:20:57.800\n you're struggling and you're trying to figure out what you're doing wrong, which you could\n\n1:20:57.800 --> 1:21:01.360\n do, it's not necessarily all your fault.\n\n1:21:01.360 --> 1:21:02.960\n We are in a global situation.\n\n1:21:02.960 --> 1:21:08.640\n I have not met the people who are honest, kind, good, successful.\n\n1:21:08.640 --> 1:21:13.040\n Nobody that I've met is checking all the boxes.\n\n1:21:13.040 --> 1:21:14.580\n Nobody's getting all tens.\n\n1:21:14.580 --> 1:21:18.960\n So I just think that's an important message that doesn't get pushed out enough.\n\n1:21:18.960 --> 1:21:24.040\n Either people want to hold society responsible for their failures, which is not reasonable.\n\n1:21:24.040 --> 1:21:27.740\n You have to struggle, you have to try, or they want to say you're a hundred percent\n\n1:21:27.740 --> 1:21:31.960\n responsible for your failures, which is total nonsense.\n\n1:21:31.960 --> 1:21:32.960\n Beautifully put.\n\n1:21:32.960 --> 1:21:33.960\n Eric, thank you so much for talking today.\n\n1:21:33.960 --> 1:21:55.560\n Thanks for having me, buddy.\n\n"
}