{
  "title": "Vitalik Buterin: Ethereum, Cryptocurrency, and the Future of Money | Lex Fridman Podcast #80",
  "id": "3x1b_S6Qp2Q",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.920\n The following is a conversation with Vitalik Buterin, co creator of and author of the white\n\n00:05.920 --> 00:11.960\n paper that launched Ethereum and Ether, which is a cryptocurrency that is currently the\n\n00:11.960 --> 00:15.640\n second largest digital currency after Bitcoin.\n\n00:15.640 --> 00:20.360\n Ethereum has a lot of interesting technical ideas that are defining the future of blockchain\n\n00:20.360 --> 00:27.040\n technology and Vitalik is one of the most brilliant people innovating in the space today.\n\n00:27.040 --> 00:34.860\n Unlike Satoshi Nakamoto, the unknown person or group that created Bitcoin, Vitalik is\n\n00:34.860 --> 00:41.480\n very well known and at a young age is thrust into the limelight as one of the main faces\n\n00:41.480 --> 00:47.840\n of the technology that may redefine the nature of money and all forms of digital transactions\n\n00:47.840 --> 01:17.760\n in the 21st century.\n\n01:17.760 --> 01:24.200\n Quick summary of the ads, two sponsors, Masterclass and ExpressVPN.\n\n01:24.200 --> 01:29.120\n Please consider supporting the podcast by signing up to Masterclass at masterclass.com\n\n01:29.120 --> 01:39.200\n slash lex and getting ExpressVPN at expressvpn.com slash lexpod.\n\n01:39.200 --> 01:45.740\n This show is sponsored by Masterclass sign up at masterclass.com slash lex to get a discount\n\n01:45.740 --> 01:48.440\n and to support this podcast.\n\n01:48.440 --> 01:53.200\n When I first heard about Masterclass, I honestly thought it was too good to be true.\n\n01:53.200 --> 01:59.720\n For $180 a year, you get an all access pass to watch courses from experts at the top of\n\n01:59.720 --> 02:00.720\n their field.\n\n02:00.720 --> 02:06.400\n To list some of my favorites, Chris Hatfield on space exploration, Neil deGrasse Tyson\n\n02:06.400 --> 02:12.800\n on scientific thinking and communication, Will Wright, the creator of SimCity and Sims\n\n02:12.800 --> 02:20.480\n on game design, Jane Goodall on conservation, Carlos Santana, one of my favorite guitarists\n\n02:20.480 --> 02:29.720\n on guitar, Garry Kasparov on chess, Daniel Negrano on poker, one of my favorite poker\n\n02:29.720 --> 02:35.680\n players, Phil Ivey gives a course as well, and many more.\n\n02:35.680 --> 02:39.860\n Chris Hatfield explaining how rockets work and the experience of being launched into\n\n02:39.860 --> 02:43.280\n space alone is worth the money.\n\n02:43.280 --> 02:48.600\n By way of advice, for me, the key is not to be overwhelmed by the abundance of choice.\n\n02:48.600 --> 02:50.680\n Pick three courses you want to complete.\n\n02:50.680 --> 02:52.600\n Watch each all the way through from start to finish.\n\n02:52.600 --> 02:56.800\n It's not that long, but it's an experience that will stick with you for a long time,\n\n02:56.800 --> 02:58.360\n I promise.\n\n02:58.360 --> 02:59.820\n It's easily worth the money.\n\n02:59.820 --> 03:02.480\n You can watch it on basically any device.\n\n03:02.480 --> 03:08.560\n Once again, sign up at masterclass.com slash lex to get a discount and to support this\n\n03:08.560 --> 03:10.100\n podcast.\n\n03:10.100 --> 03:13.560\n This show is sponsored by ExpressVPN.\n\n03:13.560 --> 03:20.920\n Download it at expressvpn.com slash lexpod to get a discount and to support this podcast.\n\n03:20.920 --> 03:23.840\n I've been using ExpressVPN for many years.\n\n03:23.840 --> 03:25.960\n I honestly love it.\n\n03:25.960 --> 03:31.240\n It's easy to use, press the big power on button, and your privacy is protected.\n\n03:31.240 --> 03:35.800\n And if you like, you can make it look like your location is anywhere else in the world.\n\n03:35.800 --> 03:41.080\n I might be in Boston now, but I can make it look like I'm in New York, London, Paris,\n\n03:41.080 --> 03:42.920\n or anywhere else.\n\n03:42.920 --> 03:45.540\n This has a large number of obvious benefits.\n\n03:45.540 --> 03:50.400\n For example, certainly it allows you to access international versions of streaming websites\n\n03:50.400 --> 03:55.640\n like the Japanese version of Netflix or the UK version of Hulu.\n\n03:55.640 --> 04:00.720\n As you probably know, I was born in the Soviet Union, so sadly, given my roots and appreciation\n\n04:00.720 --> 04:06.760\n of Russian history and culture, my website and the website for this podcast is blocked\n\n04:06.760 --> 04:08.560\n in Russia.\n\n04:08.560 --> 04:15.360\n So this is another example of where you can use ExpressVPN to access sites like the podcast\n\n04:15.360 --> 04:19.120\n that are not accessible in your country.\n\n04:19.120 --> 04:21.920\n ExpressVPN works on any device you can imagine.\n\n04:21.920 --> 04:28.160\n I use it on Linux, shout out to Ubuntu, Windows, Android, but it's available everywhere else\n\n04:28.160 --> 04:29.400\n too.\n\n04:29.400 --> 04:37.200\n Once again, download it at expressvpn.com slash lexpod to get a discount and to support\n\n04:37.200 --> 04:38.800\n this podcast.\n\n04:38.800 --> 04:44.100\n And now here's my conversation with Vitalik Buterin.\n\n04:44.100 --> 04:50.200\n So before we talk about the fundamental ideas behind Ethereum and cryptocurrency, perhaps\n\n04:50.200 --> 04:58.520\n it'd be nice to talk about the origin story of Bitcoin and the mystery of Satoshi Nakamoto.\n\n04:58.520 --> 05:04.080\n You gave a talk that started with sort of asking the question, what did Satoshi Nakamoto\n\n05:04.080 --> 05:06.280\n actually invent?\n\n05:06.280 --> 05:10.000\n Maybe you could say who is Satoshi Nakamoto and what did he invent?\n\n05:10.000 --> 05:11.000\n Sure.\n\n05:11.000 --> 05:19.040\n So Satoshi Nakamoto is the name by which we know the person who originally came up with\n\n05:19.040 --> 05:20.040\n Bitcoin.\n\n05:20.040 --> 05:25.480\n So the reason why I say the name by which we know is that this is an anonymous fellow\n\n05:25.480 --> 05:33.640\n who has shown himself to us only over the internet just by first publishing the white\n\n05:33.640 --> 05:39.440\n paper for Bitcoin, then releasing the original source code for Bitcoin, and then talking\n\n05:39.440 --> 05:46.760\n to the very early Bitcoin community on Bitcoin forums and interacting with them and helping\n\n05:46.760 --> 05:49.640\n the project along for a couple of years.\n\n05:49.640 --> 05:55.840\n And then at some point in late 2010 to early 2011, he disappeared.\n\n05:55.840 --> 06:05.160\n So Bitcoin is a fairly unique project in how it has this kind of mythical, kind of quasi\n\n06:05.160 --> 06:10.800\n godlike founder who just kind of popped in, did the thing and then disappeared and we've\n\n06:10.800 --> 06:13.120\n somehow just never heard from him again.\n\n06:13.120 --> 06:18.360\n So in 2008, so the white paper was the first, do you know if the white paper was the first\n\n06:18.360 --> 06:22.160\n time the name would actually appear, Satoshi Nakamoto?\n\n06:22.160 --> 06:23.720\n I believe so.\n\n06:23.720 --> 06:31.580\n So how is it possible that the creator of such an impactful project remains anonymous?\n\n06:31.580 --> 06:34.280\n That's a tough question.\n\n06:34.280 --> 06:38.520\n There's no similarity to it in the history of technology as far as I'm aware.\n\n06:38.520 --> 06:39.520\n Yeah.\n\n06:39.520 --> 06:46.200\n So one possibility is that it's hellfinny because hellfinny was kind of also active\n\n06:46.200 --> 06:53.800\n in the Bitcoin community and as hellfinny in those two beginning years.\n\n06:53.800 --> 06:55.920\n Who is hellfinny, maybe you could say?\n\n06:55.920 --> 07:00.760\n He is one of the people in the early cypherpunk community.\n\n07:00.760 --> 07:12.720\n He was a computer scientist, cryptographers, people interested in technology, internet\n\n07:12.720 --> 07:14.880\n freedom, like those kinds of topics.\n\n07:14.880 --> 07:19.040\n Was it correct that I read that he seemed to have been involved in either the earliest\n\n07:19.040 --> 07:21.960\n or the first transaction of Bitcoin?\n\n07:21.960 --> 07:22.960\n Yes.\n\n07:22.960 --> 07:25.760\n The first transaction of Bitcoin was between Satoshi and hellfinny.\n\n07:25.760 --> 07:28.520\n Do you think he knew who Satoshi was?\n\n07:28.520 --> 07:31.380\n If he wasn't Satoshi, probably no.\n\n07:31.380 --> 07:36.900\n How is it possible to work so closely with people and nevertheless not know anything\n\n07:36.900 --> 07:39.860\n about their fundamental identity?\n\n07:39.860 --> 07:43.880\n Is this like a natural sort of characteristic of the internet?\n\n07:43.880 --> 07:51.680\n Like if we were to think about it, because you and I just met now, there's a depth of\n\n07:51.680 --> 07:56.600\n knowledge that we now have about each other that's like physical, like my vision system\n\n07:56.600 --> 07:58.200\n is able to recognize you.\n\n07:58.200 --> 08:05.960\n I can also verify your identity of uniqueness, like it's very hard to fake you being you.\n\n08:05.960 --> 08:11.360\n So the internet has a fundamentally different quality to it, which is just fascinating.\n\n08:11.360 --> 08:20.160\n This is definitely interesting as I definitely just know a lot of people just by their internet\n\n08:20.160 --> 08:21.160\n handles.\n\n08:21.160 --> 08:26.840\n And to me, when I think of them, I see their internet handles and one of them has a kind\n\n08:26.840 --> 08:33.080\n of profile picture as this kind of face that's kind of not quite human with a bunch of psychedelic\n\n08:33.080 --> 08:34.240\n colors in it.\n\n08:34.240 --> 08:37.480\n And when I visualize him, I could just visualize that.\n\n08:37.480 --> 08:40.920\n That's not an actual face.\n\n08:40.920 --> 08:45.960\n You are the creator of the second, well, he's currently the second most popular cryptocurrency\n\n08:45.960 --> 08:46.960\n Ethereum.\n\n08:46.960 --> 08:53.040\n So on this topic, if we just stick on Satoshi Nakamoto for a little bit longer, you may\n\n08:53.040 --> 08:58.240\n be the most qualified person to speak to the psychology of this anonymity that we're talking\n\n08:58.240 --> 08:59.240\n about.\n\n08:59.240 --> 09:03.780\n Like your identity is known, like I've just verified it.\n\n09:03.780 --> 09:10.420\n But from your perspective, what are the benefits in creating a cryptocurrency and then remaining\n\n09:10.420 --> 09:11.420\n anonymous?\n\n09:11.420 --> 09:17.200\n Like if it can psychoanalyze Satoshi Nakamoto, is there something interesting there?\n\n09:17.200 --> 09:20.400\n Or is it just a peculiar quirk of him?\n\n09:20.400 --> 09:26.920\n It definitely helps create this kind of image of this kind of neutral thing that doesn't\n\n09:26.920 --> 09:28.920\n belong to anyone.\n\n09:28.920 --> 09:36.720\n And that you created a project and because you're anonymous and because you also disappear\n\n09:36.720 --> 09:42.360\n or as unfortunately happened to Hal Finney, if that is him, he ended up dying of Lou Gehrig's\n\n09:42.360 --> 09:45.520\n disease and he's in the cryogenic freezer now.\n\n09:45.520 --> 09:55.840\n But if you pop in and you create it and you're gone and all that's remaining of that whole\n\n09:55.840 --> 10:03.940\n process is the thing itself, then no one can go and try to interpret any of your other\n\n10:03.940 --> 10:13.200\n behavior and try to understand like, oh, this person wrote this thing in some essay at age\n\n10:13.200 --> 10:16.880\n 16 where he expressed particular opinions about democracy.\n\n10:16.880 --> 10:21.320\n And so because of that, this project is a statement that's trying to do this specific\n\n10:21.320 --> 10:22.320\n thing.\n\n10:22.320 --> 10:30.680\n Instead, it creates this environment where the thing is what you make of it.\n\n10:30.680 --> 10:35.320\n It doesn't have the burden of your other ideas, political thought and so on.\n\n10:35.320 --> 10:43.160\n So now that we're sitting with you, do you feel the burden of being kind of the face\n\n10:43.160 --> 10:44.160\n of Ethereum?\n\n10:44.160 --> 10:49.860\n I mean, there's a very large community of developers, but nevertheless, is there like\n\n10:49.860 --> 10:52.200\n a burden associated with that?\n\n10:52.200 --> 10:53.500\n There definitely is.\n\n10:53.500 --> 11:00.260\n This is definitely a big reason why I've been trying to kind of push for the Ethereum ecosystem\n\n11:00.260 --> 11:06.740\n to become more decentralized in many ways, just encouraging a lot of core Ethereum work\n\n11:06.740 --> 11:11.860\n to happen outside of the Ethereum Foundation and of expanding the number of people that\n\n11:11.860 --> 11:17.280\n are making different kinds of decisions, having multiple software limitations instead of one\n\n11:17.280 --> 11:18.640\n and all of these things.\n\n11:18.640 --> 11:25.480\n There's a lot of things that I've tried to do to remove myself as a single point of failure\n\n11:25.480 --> 11:31.900\n because that is something that a lot of people criticize me for.\n\n11:31.900 --> 11:37.640\n So if you look at like the most fundamentally successful open source projects, it seems\n\n11:37.640 --> 11:43.480\n that it's like a sad reality when I think about it, is it seems to be that one person\n\n11:43.480 --> 11:51.800\n is a crucial contributor often, if you look at Linus for Linux for the kernel.\n\n11:51.800 --> 11:56.680\n That is possible and I'm definitely not planning to disappear.\n\n11:56.680 --> 12:04.360\n That's an interesting tension that projects like this kind of desire a single entity and\n\n12:04.360 --> 12:08.800\n yet they're fundamentally distributed.\n\n12:08.800 --> 12:12.940\n I don't know if there's something interesting to say about that kind of structure and thinking\n\n12:12.940 --> 12:17.620\n about the future of cryptocurrency, does there need to be a leader?\n\n12:17.620 --> 12:20.800\n There's different kinds of leaders.\n\n12:20.800 --> 12:22.920\n There's dictators who control all the money.\n\n12:22.920 --> 12:25.120\n There's people who control organizations.\n\n12:25.120 --> 12:30.540\n There's high priests that just have themselves other Twitter followers.\n\n12:30.540 --> 12:33.680\n What kind of leader are you, would you say?\n\n12:33.680 --> 12:42.720\n These days, actually a bit more in the high priest direction than before.\n\n12:42.720 --> 12:48.400\n I definitely actually don't do all that much of going around and ordering Ethereum Foundation\n\n12:48.400 --> 12:52.680\n people to do things because I think those things are important.\n\n12:52.680 --> 12:58.080\n If there's something that I do think is important, I do just usually kind of say it publicly\n\n12:58.080 --> 13:05.120\n or just kind of say it to people and quite often projects just going to start doing it.\n\n13:05.120 --> 13:10.360\n So let's ask the high philosophical question about money.\n\n13:10.360 --> 13:13.160\n What at the highest level is money?\n\n13:13.160 --> 13:15.420\n What is money?\n\n13:15.420 --> 13:21.120\n It's a kind of game and it's a game where we have points and if you have points, there's\n\n13:21.120 --> 13:24.560\n this one move where you can reduce your points by a number and increase someone else's points\n\n13:24.560 --> 13:26.560\n by the same number.\n\n13:26.560 --> 13:29.880\n So it's a fair game, hopefully.\n\n13:29.880 --> 13:32.440\n Well, it's one kind of fair game.\n\n13:32.440 --> 13:35.040\n For example, you can have other kinds of fair games.\n\n13:35.040 --> 13:38.280\n You're going to have a game where if I give someone a point and you give someone a point\n\n13:38.280 --> 13:42.440\n and instead of that person getting two points, that person gets four points and that's also\n\n13:42.440 --> 13:43.440\n fair.\n\n13:43.440 --> 13:51.420\n But, you know, money is easy to kind of set up and it serves a lot of useful functions\n\n13:51.420 --> 13:57.840\n and so it kind of just survives in society as a meme for thousands of years.\n\n13:57.840 --> 14:04.120\n It's useful for the storage of wealth, it's useful for the exchange of value.\n\n14:04.120 --> 14:09.560\n And it's also useful for denominating future payments, a unit of account.\n\n14:09.560 --> 14:11.440\n A unit of account.\n\n14:11.440 --> 14:18.680\n So what, if you look at the history of money in human civilization, just if you're a student\n\n14:18.680 --> 14:26.000\n of history, how has its role or just the mechanisms of money changed over time in your view?\n\n14:26.000 --> 14:30.640\n Even if we just look at the 20th century or before and then leading up to cryptocurrencies,\n\n14:30.640 --> 14:32.160\n that's something you think about?\n\n14:32.160 --> 14:39.440\n Yeah, and I think the big thing in the 20th century is kind of, we saw a lot more intermediation,\n\n14:39.440 --> 14:41.520\n I guess.\n\n14:41.520 --> 14:49.800\n The first part is kind of the move from adding more of different kinds of banking and then\n\n14:49.800 --> 14:57.600\n we saw the move from dollars being backed by gold to dollars being backed by gold that's\n\n14:57.600 --> 15:05.440\n only redeemable by certain people to dollars not being backed by anything to this system\n\n15:05.440 --> 15:12.720\n where you have a bunch of free floating currencies and then people getting kind of bank accounts\n\n15:12.720 --> 15:16.400\n and then those things becoming electronic, people getting accounts with payment processors\n\n15:16.400 --> 15:20.320\n that have bank accounts.\n\n15:20.320 --> 15:25.720\n So what do you make of that, that's such a fascinating philosophical idea that money\n\n15:25.720 --> 15:29.940\n might not be backed by anything.\n\n15:29.940 --> 15:33.680\n Is that like fascinating to you that money can exist without being backed by something\n\n15:33.680 --> 15:35.480\n physical?\n\n15:35.480 --> 15:36.480\n It definitely is.\n\n15:36.480 --> 15:39.480\n What do you make of that?\n\n15:39.480 --> 15:40.480\n How is that possible?\n\n15:40.480 --> 15:41.480\n Is that stable?\n\n15:41.480 --> 15:45.760\n If we look at the future of human civilization, is it possible to have money at the large\n\n15:45.760 --> 15:52.480\n scale at such a hugely productive and rich societies be able to operate successfully\n\n15:52.480 --> 15:54.920\n without money being backed by anything physical?\n\n15:54.920 --> 16:01.200\n I feel like the interesting thing about the 21st century especially is that a lot of the\n\n16:01.200 --> 16:04.420\n important valuable things are not backed by anything.\n\n16:04.420 --> 16:10.640\n If you look at tech companies for example, something like Twitter, you could theoretically\n\n16:10.640 --> 16:15.960\n imagine that if all of the employees wanted to, they could kind of come together, they\n\n16:15.960 --> 16:27.760\n would quit and start working on Twitter 2.0 and then the value of and just kind of build\n\n16:27.760 --> 16:32.580\n the exact same product or possibly build a better product and then just kind of continue\n\n16:32.580 --> 16:40.440\n on from there and the original Twitter would just not have people left anymore.\n\n16:40.440 --> 16:44.820\n There is theoretically kind of code and IP that's owned by the company but in reality\n\n16:44.820 --> 16:48.820\n like good programmers could probably rewrite all that stuff in three months.\n\n16:48.820 --> 16:56.560\n So the reason why the thing has value is just kind of network effects and coordination problems\n\n16:56.560 --> 17:01.640\n right like these employees in reality aren't going to switch all at once and also the users\n\n17:01.640 --> 17:05.960\n aren't all going to switch at once because it's just difficult for them to switch at\n\n17:05.960 --> 17:14.560\n once and so there's these kind of meta stable and of equilibrium in interactions between\n\n17:14.560 --> 17:20.500\n thousands of millions of people that are just actually quite sticky even though if you try\n\n17:20.500 --> 17:24.880\n to kind of assume that everyone's a perfectly rational and kind of perfectly slippery spherical\n\n17:24.880 --> 17:28.160\n cow they don't seem to exist at all.\n\n17:28.160 --> 17:29.160\n That stickiness.\n\n17:29.160 --> 17:34.800\n Do you have a sense, a grasp of the sort of the fundamental dynamic like the physics of\n\n17:34.800 --> 17:36.320\n that stickiness?\n\n17:36.320 --> 17:43.760\n It seems to work but and I think some of the cryptocurrency ideas kind of rely on it working.\n\n17:43.760 --> 17:51.880\n It's the sort of thing that's definitely been economically modeled a lot like one of the\n\n17:51.880 --> 17:59.840\n kind of analogy of something as similar that you often see in textbooks as like what is\n\n17:59.840 --> 18:05.620\n a government like if for example like 80% of people in a country just like tomorrow\n\n18:05.620 --> 18:11.020\n suddenly had the idea that like the laws that are currently the laws of the government that\n\n18:11.020 --> 18:15.640\n currently is the government are just people and some other thing is the government and\n\n18:15.640 --> 18:19.580\n they just kind of start acting like it then that would kind of become the new reality\n\n18:19.580 --> 18:27.020\n and then the question is well what happens if and if between zero and 80% of people start\n\n18:27.020 --> 18:34.240\n believing that and like what is the thing you also you see is that if there is one of\n\n18:34.240 --> 18:38.120\n these kind of switches happening is kind of revolution then if you're the first person\n\n18:38.120 --> 18:44.480\n to join then like you probably don't have the incentive to do that but then if you're\n\n18:44.480 --> 18:51.560\n the 55th percentile person to join then suddenly becomes quite safe too and so it's definitely\n\n18:51.560 --> 18:56.960\n is the sort of thing that you can kind of try to analyze and understand mathematically\n\n18:56.960 --> 19:06.980\n but one of the kind of results is that the sort of like when the switch happens definitely\n\n19:06.980 --> 19:13.080\n can be chaotic sometimes yeah but still like to me the idea that the network affects that\n\n19:13.080 --> 19:19.240\n the fact that human beings at a scale like millions billions can share even the idea\n\n19:19.240 --> 19:25.920\n of currency like yeah I'll agree that's just uh I know economists can model it I'm a skeptic\n\n19:25.920 --> 19:32.080\n on the economic and uh it's like uh so my my favorite sort of field maybe recreationally\n\n19:32.080 --> 19:36.920\n psychology is trying to understand human behavior and I think sometimes people just kind of\n\n19:36.920 --> 19:42.120\n pretend that they can have a grasp on human behavior even though we it's such a messy\n\n19:42.120 --> 19:46.200\n space that all the models that psychology or economics those different perspectives\n\n19:46.200 --> 19:53.060\n on human behavior can have are are difficult it's difficult to know how much that's wishful\n\n19:53.060 --> 19:58.160\n thinking and how much it is actually getting to the core of uh understanding human behavior\n\n19:58.160 --> 20:08.440\n but on that idea what do you think is the role of money in human motivation so do you\n\n20:08.440 --> 20:15.720\n think money from an economics perspective from a psychology perspective is core to like\n\n20:15.720 --> 20:23.480\n human desires money is definitely very far from the only motivator um it is a big motivator\n\n20:23.480 --> 20:30.200\n and that's uh one of the closest things you have to a universal motivator think because\n\n20:30.200 --> 20:36.040\n ultimately in like almost any person in the world if you ask them to do something like\n\n20:36.040 --> 20:41.080\n they'll be more inclined to do it if you also offer some uh offer them money right and that's\n\n20:41.080 --> 20:47.460\n uh like there's definitely many cases where people will do things other than things that\n\n20:47.460 --> 20:52.240\n maximize how much money they have and that happens all the time but like though a lot\n\n20:52.240 --> 20:57.360\n of those other things are kind of but much more specific to and of who that person is\n\n20:57.360 --> 21:01.000\n and of what their situation is the relationship between the motive and the action and these\n\n21:01.000 --> 21:05.800\n other things what do you think is the interplay of the other motivator from like Nietzsche\n\n21:05.800 --> 21:11.960\n perspective is power do you think money equals power do you think those are conflicting ideas\n\n21:11.960 --> 21:16.520\n do you think i mean that's the one of the ideas that decentralized currency decentralized\n\n21:16.520 --> 21:23.160\n applications are looking at is uh who holds the power yeah money is definitely a kind\n\n21:23.160 --> 21:29.600\n of power and there's definitely people who want money because it gives them power and\n\n21:29.600 --> 21:37.800\n even if my money doesn't seem to and if explicitly be about money a lot of things that people\n\n21:37.800 --> 21:44.880\n spend money on are ultimately about a social status of some kind um so i mean i definitely\n\n21:44.880 --> 21:50.480\n view those two things as an of interplaying and then there's also money as just a way\n\n21:50.480 --> 21:57.280\n of like measuring how successful you are like as a scoreboard right so this kind of gets\n\n21:57.280 --> 22:04.200\n back to the game i mean like if you have four billion dollars then the main benefit you\n\n22:04.200 --> 22:08.040\n get from going up one of the big benefits you get from going up to six million dollars\n\n22:08.040 --> 22:12.200\n is that now instead of being below the guy who has five you're above the guy who has\n\n22:12.200 --> 22:19.080\n five so you think money could be kind of uh in the game of life it's also a measure of\n\n22:19.080 --> 22:25.660\n self worth it's like how we it's definitely how uh how a lot of people perceive it define\n\n22:25.660 --> 22:30.400\n ourselves in the hierarchy of yeah and i'm not yeah not saying it's kind of a healthy\n\n22:30.400 --> 22:36.480\n thing that people uh define their self worth as money because it's definitely kind of far\n\n22:36.480 --> 22:43.880\n from a uh perfect indicator of how much you value you provide the society or anything\n\n22:43.880 --> 22:49.500\n like this but i definitely think that like as a matter of kind of current practice so\n\n22:49.500 --> 22:56.200\n much of people do feel that way so what does utopia from an economic perspective look like\n\n22:56.200 --> 23:04.920\n to you what does the perfect world look like i guess the economist's utopia would be one\n\n23:04.920 --> 23:12.640\n where kind of everything is incentive aligned in the in the sense that there aren't enough\n\n23:12.640 --> 23:20.440\n conflicts between what satisfies your goals and kind of what is uh good for everyone in\n\n23:20.440 --> 23:26.820\n the world in the world as a whole what do you think that would um look like does does\n\n23:26.820 --> 23:32.420\n that mean there's still poor people and rich people there's still income inequality do\n\n23:32.420 --> 23:41.320\n you think sort of uh marxist ideas are strong do you think sort of ideas of uh objectivism\n\n23:41.320 --> 23:47.120\n like where the market rules is strong like what is there is the different economic philosophies\n\n23:47.120 --> 23:55.140\n that just seem to be reflective what utopia would be so i definitely think that existing\n\n23:55.140 --> 24:02.640\n economic philosophies do end up kind of systematically kind of deviating from the utopia in a lot\n\n24:02.640 --> 24:07.720\n of ways yeah like one of the big things i talk about for example is public goods right\n\n24:07.720 --> 24:13.440\n and public goods are especially important on the internet right because like the idea\n\n24:13.440 --> 24:18.920\n is with kind of money as this game where you know i lose a few coin a few coins and you\n\n24:18.920 --> 24:23.140\n gain the same number of coins is that this usually happens in a trade where i lose some\n\n24:23.140 --> 24:30.680\n money you gain some money you lose a sandwich and i gain a sandwich and this kind of model\n\n24:30.680 --> 24:36.680\n works really well when the thing that we're using money to incentivize this kind of private\n\n24:36.680 --> 24:40.680\n goods right things that you provide to one person where the benefit comes to one person\n\n24:40.680 --> 24:48.040\n but the like on the internet especially but also many many contexts and if off the internet\n\n24:48.040 --> 24:53.960\n there's actions that kind of individuals or groups can take where instead of the benefit\n\n24:53.960 --> 25:00.200\n going to one person the benefit just goes to many people at the same time and you can't\n\n25:00.200 --> 25:04.600\n control where the benefit goes to right so for example this podcast you know we publish\n\n25:04.600 --> 25:11.120\n it and when it's published you don't have any fine grains control over like oh these\n\n25:11.120 --> 25:16.800\n 38 000 people can watch it and then like these other 29 000 people can't it's like once the\n\n25:16.800 --> 25:21.400\n number goes high enough then you know people just like copy it and then when i write articles\n\n25:21.400 --> 25:26.940\n on a blog then they're just like free for everyone and that stuff's even harder to prevent\n\n25:26.940 --> 25:33.020\n anyone from copying so and aside from that things like you know scientific research for\n\n25:33.020 --> 25:39.200\n example and even taking more pedestrian examples like climate change mitigation would be a\n\n25:39.200 --> 25:47.320\n big one so there's a lot of things in the world where you have these kind of individual\n\n25:47.320 --> 25:51.620\n actions with enough concentrated costs and distributed benefits and money as a point\n\n25:51.620 --> 25:58.920\n system does not do a good job of encouraging these things and one of the kind of other\n\n25:58.920 --> 26:05.320\n things even kind of tangentially connected to crypto but kind of theoretically outside\n\n26:05.320 --> 26:10.400\n of it that i work on is this sort of mechanism called quadratic funding and the way to think\n\n26:10.400 --> 26:19.880\n about it is i kind of imagine a point system where if like if one person gives coin gives\n\n26:19.880 --> 26:26.940\n coins to one other person then it works the same way as money but if multiple people give\n\n26:26.940 --> 26:32.160\n coins to one person and they do so anonymously so it's kind of not in consideration for a\n\n26:32.160 --> 26:38.240\n specific service to that person themselves then the number of coins received by that\n\n26:38.240 --> 26:43.020\n person is kind of greater than just the sum of the number of coins that have given by\n\n26:43.020 --> 26:48.600\n those different people so the actual formula is you take the square root of the amount\n\n26:48.600 --> 26:51.640\n that each person gave then you add all the square roots and then you kind of square the\n\n26:51.640 --> 26:58.480\n sum yeah and then you give that and the idea here would basically be that if let's say\n\n26:58.480 --> 27:05.520\n for example you just start going off and kind of planting a lot of trees and there's a bunch\n\n27:05.520 --> 27:09.320\n of people that are really happy that you're planting trees and then so they go and all\n\n27:09.320 --> 27:16.680\n kind of throw a coin your way then the like there is like basically the fact that kind\n\n27:16.680 --> 27:21.640\n of you get more than the sub you get this kind of square of sum of these of square roots\n\n27:21.640 --> 27:27.420\n of these tiny nodes that this actually kind of compensates for the tragedy of the commons\n\n27:27.420 --> 27:31.480\n right this there's even this kind of mathematical proof that it's sort of optimally compensates\n\n27:31.480 --> 27:38.120\n for it what is the tragedy of the common this is just this idea that like if there is this\n\n27:38.120 --> 27:45.640\n situation where there's some public good that lots of people benefit from then no individual\n\n27:45.640 --> 27:49.040\n person wants to contribute to it because if they contribute they only get a small part\n\n27:49.040 --> 27:54.880\n of the benefit from their contribution but they pay the full cost of their contribution\n\n27:54.880 --> 28:01.320\n in which context is this sorry what is the term quadratic what quadratic funding like\n\n28:01.320 --> 28:08.800\n what's in which context is this mechanism useful so obviously you said to combat the\n\n28:08.800 --> 28:13.000\n tragedy of the commons but you know in which context do you see it as useful actually practically\n\n28:13.000 --> 28:18.080\n yeah theoretically public goods in general right so like like services like what are\n\n28:18.080 --> 28:23.440\n we what are we talking about what's a public yeah so within the ethereum ecosystem for\n\n28:23.440 --> 28:28.440\n example like we've actually tried using this mechanism like yeah wrote a couple of articles\n\n28:28.440 --> 28:33.280\n about this on vitalik.ca where i go through some of the most recent rounds and it's been\n\n28:33.280 --> 28:40.760\n really interesting um some of the top ones that people supported there were um things\n\n28:40.760 --> 28:46.880\n like kind of just online user interfaces that make it easier for people to interact with\n\n28:46.880 --> 28:57.680\n ethereum um there was a documentation there were podcasts um there were kind of software\n\n28:57.680 --> 29:03.740\n kind of clients like kind of implementations of the ethereum protocol of privacy tools\n\n29:03.740 --> 29:10.120\n just like lots of things that are kind of useful to lots of people when a lot of people\n\n29:10.120 --> 29:15.600\n are contributing for like funding a particular particular entity yeah that's really that's\n\n29:15.600 --> 29:20.560\n really interesting is there something special about the quadratic the the the summing of\n\n29:20.560 --> 29:25.720\n the square roots and yeah so another way to think about it is like imagine if n people\n\n29:25.720 --> 29:32.180\n each give a dollar then the person gets n squared right um and and so each individual\n\n29:32.180 --> 29:37.200\n person's contribution gets multiplied by n right because you have n people and so that\n\n29:37.200 --> 29:41.880\n kind of perfectly compensates for the kind like kind of n to one uh tragedy of the commons\n\n29:41.880 --> 29:49.120\n i just wonder if the the squared part is yeah fundamental no it is um and i'd uh recommend\n\n29:49.120 --> 29:56.280\n you go to on vitalik.ca i have this article called quadratic payments a primer and highly\n\n29:56.280 --> 30:01.040\n recommended it's kind of at least my attempt so far kind of explaining the intuition behind\n\n30:01.040 --> 30:09.740\n this intuition so if we could can we go to the the very basics what is the blockchain\n\n30:09.740 --> 30:16.080\n or perhaps we might even start at the uh the the byzantine generals problem and byzantine\n\n30:16.080 --> 30:24.480\n fault tolerance in general that i i uh bitcoin was taking steps to uh providing a solution\n\n30:24.480 --> 30:32.400\n for so the byzantine generals problem it's this uh paper that leslie lamport published\n\n30:32.400 --> 30:38.040\n in 1982 where he has this thought experiments where if you have two generals that are kind\n\n30:38.040 --> 30:43.400\n of camped out on opposite sides of a city um and they're planning when to attack the\n\n30:43.400 --> 30:50.080\n city then uh the question is and if how could those generals coordinate with each other\n\n30:50.080 --> 30:56.320\n and they could send messengers between each other but those messengers kind of could get\n\n30:56.320 --> 31:01.560\n sniped by the enemy on the road road some of those messages could end up being traders\n\n31:01.560 --> 31:11.080\n and if things could end up happening and with just two mess generals it turns out that there's\n\n31:11.080 --> 31:17.640\n kind of no solution in a finite number of rounds that guarantees that they will be able\n\n31:17.640 --> 31:22.120\n to kind of coordinate on the same answer but then in the case where you have more than\n\n31:22.120 --> 31:28.520\n two generals that then leslie analyzes cases like um are the mess messages kind of just\n\n31:28.520 --> 31:34.040\n oral messages um are the messages kind of signed messages so i could give you a signed\n\n31:34.040 --> 31:38.240\n message and you can pass along that signed message and the third party can still verify\n\n31:38.240 --> 31:44.720\n that i originally made that message and depending on those different cases there's kind of different\n\n31:44.720 --> 31:51.640\n bounds on like given how many generals and how many traders among those generals and\n\n31:51.640 --> 31:59.120\n if what like under what conditions you actually can't agree when to launch an attack uh so\n\n31:59.120 --> 32:03.800\n it's actually a big misconception that the byzantine generalist problem was unsolved\n\n32:03.800 --> 32:09.160\n so let's say lamport solved it the thing that was unsolved though is that all of these solutions\n\n32:09.160 --> 32:14.680\n assume that you've already agreed on and have fixed the list of who the generals are and\n\n32:14.680 --> 32:18.440\n these generals have to be kind of semi trusted to some extent they can't just be anonymous\n\n32:18.440 --> 32:22.960\n people because if they're anonymous then like the enemy could just be 99 percent of the\n\n32:22.960 --> 32:32.480\n generals uh so right the um in the 1980s and the 1990s kind of the general use case\n\n32:32.480 --> 32:38.920\n for distributed system stuff was more kind of enterprisey stuff where you could kind\n\n32:38.920 --> 32:45.480\n of assume that uh you know you know who the nodes are that are running these kind of computer\n\n32:45.480 --> 32:50.160\n networks so if he wants to have some kind of decentralized computer network that pretends\n\n32:50.160 --> 32:55.880\n to be a single computer and that you can kind of do do kind of operations on then it's made\n\n32:55.880 --> 33:00.840\n out of these kind of 15 specific computers and we know kind of who and where they are\n\n33:00.840 --> 33:05.240\n and so we have a good reason to believe that say at least 11 of them would be fine and\n\n33:05.240 --> 33:11.600\n it could also be within a single system exactly almost a network of devices sensors so on\n\n33:11.600 --> 33:16.920\n like in airplanes and i think uh like flight systems in general still use these kinds of\n\n33:16.920 --> 33:23.160\n ideas yep yep um so that's the 80s that's the 80s and 90s now the cypherpunks had a\n\n33:23.160 --> 33:28.320\n different use case in mind which is that they wanted to create a fully decentralized global\n\n33:28.320 --> 33:34.560\n permissionless currency and the problem here is that they didn't want any authorities and\n\n33:34.560 --> 33:39.520\n they didn't even want any kind of privileged list of people and so now the question is\n\n33:39.520 --> 33:46.760\n well how do you use these techniques to create consensus when you have no way of kind of\n\n33:46.760 --> 33:52.080\n measuring identities right you have no way of kind of determining whether or not some\n\n33:52.080 --> 33:58.680\n 99 of participants aren't actually all the same guy and so the clever solution that satoshi\n\n33:58.680 --> 34:05.560\n had this is uh kind of going back to the that presentation i made at defcon a few months ago where i said that the\n\n34:05.560 --> 34:11.740\n things that satoshi invented with crypto economics um is this uh really neat idea that you can\n\n34:11.740 --> 34:20.800\n use economic resources to kind of limit identity how many identities you can get and the uh\n\n34:20.800 --> 34:25.360\n if there isn't any existing decentralized digital currency then the only way to do this\n\n34:25.360 --> 34:33.640\n is with proof of work right so with proof of work the solution is uh just uh you publish\n\n34:33.640 --> 34:40.800\n a solution to a hard mathematical puzzle that takes some uh kind of clearly calculable amount\n\n34:40.800 --> 34:45.380\n of computational power to solve you get an identity and then you solve five of those\n\n34:45.380 --> 34:50.580\n puzzles you get five identities and then these are the identities that we run the consensus\n\n34:50.580 --> 34:55.920\n algorithm between so the proof of work mechanism you just described is like the fundamental\n\n34:55.920 --> 35:05.040\n idea proposed in the in the white paper that defines bitcoin uh what's the idea of consensus\n\n35:05.040 --> 35:15.800\n that we wish to reach why is consensus important here what is consensus so the goal here in\n\n35:15.800 --> 35:22.640\n just simple technical terms is to basically kind of wire together a set of a large number\n\n35:22.640 --> 35:27.280\n of computers in such a way that they kind of pretends to the outside world to be a single\n\n35:27.280 --> 35:32.380\n computer where that single computer keeps working even if a large portion of the kind\n\n35:32.380 --> 35:36.720\n of constituents the computers that make it up break and kind of break in arbitrary ways\n\n35:36.720 --> 35:41.480\n like they could shut off they could try to actively break a system they could do lots\n\n35:41.480 --> 35:49.780\n of mean things so the reason why the cypherpunks wanted to do this is because they wanted to\n\n35:49.780 --> 35:54.240\n run one particular program on this virtual computer and the one particular program that\n\n35:54.240 --> 35:58.880\n they wanted to run is just a currency system right it's a system that just processes a\n\n35:58.880 --> 36:05.840\n series of transactions and for every transaction it verifies that the sender has enough coins\n\n36:05.840 --> 36:10.080\n to pay for the transaction it verifies that the digital signature is correct and if the\n\n36:10.080 --> 36:14.200\n checks pass then it subtracts the coins from one account and adds the coins to the other\n\n36:14.200 --> 36:21.080\n account roughly so first of all the the the proof of work idea is kind of i mean at least\n\n36:21.080 --> 36:27.800\n to me seems pretty fascinating it is i mean that's a it's kind of a revolutionary idea\n\n36:27.800 --> 36:33.440\n i mean is is it is it obvious to come up with that you can use uh you can exchange basically\n\n36:33.440 --> 36:41.800\n computational resources for for identity it's uh it actually has a pretty long history it\n\n36:41.800 --> 36:51.320\n was uh first proposed in a paper by uh mc cynthia dwork and nixon naor in 1994 i believe\n\n36:51.320 --> 36:55.960\n and the original use case was uh combating email spam so the idea is that if you send\n\n36:55.960 --> 37:00.520\n an email you have to send it with a proof of work attached and like this makes it reasonably\n\n37:00.520 --> 37:04.080\n cheap to send emails to your friends but it makes it really expensive to send spam to\n\n37:04.080 --> 37:10.880\n a million people yeah that's a simple brilliant idea so maybe also taking a step back so what\n\n37:10.880 --> 37:18.740\n is the role of blockchain in this what is the blockchain sure so the blockchain my way\n\n37:18.740 --> 37:24.600\n of thinking about it is that it is this kind of system where you have this kind of one\n\n37:24.600 --> 37:31.680\n virtual computer created by this a bunch of these nodes in the network and the reason\n\n37:31.680 --> 37:37.080\n why the term blockchain is used is because the data structure that these systems use\n\n37:37.080 --> 37:45.680\n at least so far is one where they um different nodes in the network periodically publish\n\n37:45.680 --> 37:54.160\n blocks and a block is a kind of list of transactions together with a pointer like a hash of a previous\n\n37:54.160 --> 38:01.320\n block that it builds on top of and so you have a series of blocks that that nodes in\n\n38:01.320 --> 38:04.560\n the network create where each block points to the previous block and so you have this\n\n38:04.560 --> 38:10.640\n chain of them is a fault tolerance mechanism built into the idea of blockchain or is it\n\n38:10.640 --> 38:16.400\n a lot of possibilities of different ways to make sure there's no funny stuff going on\n\n38:16.400 --> 38:22.220\n there are indeed a lot of possibilities um so in a kind of just simple architecture as\n\n38:22.220 --> 38:26.880\n I just described the way the fault tolerance happens is like this right so you have a bunch\n\n38:26.880 --> 38:30.520\n of nodes and they're just happily and have occasionally creating blocks building on top\n\n38:30.520 --> 38:35.720\n of them each other's blocks and let's say you have kind of one block we'll call it kind\n\n38:35.720 --> 38:41.000\n of block one and then someone else builds another block honestly you'll call it block\n\n38:41.000 --> 38:46.320\n two then we have an attacker and what the attacker tries to do is the attacker tries\n\n38:46.320 --> 38:50.640\n to revert block two and the way they revert block two is instead of doing the thing they're\n\n38:50.640 --> 38:54.760\n supposed to do which is build a block on top of block two they're going to build another\n\n38:54.760 --> 39:00.280\n block on top of block one um so you have block one which has two children block two and then\n\n39:00.280 --> 39:07.240\n block two prime now this might sometimes even happen by random chance if you know two nodes\n\n39:07.240 --> 39:10.920\n in the network just happen to create blocks at the same time and they don't hear about\n\n39:10.920 --> 39:14.960\n each other's things before they create their own but this also could happen because of\n\n39:14.960 --> 39:22.400\n an attack now if this happens you have an attack then the uh no in the bitcoin system\n\n39:22.400 --> 39:30.520\n uh the nodes follow the longest chain um so if um this um attack had happened uh and when\n\n39:30.520 --> 39:35.160\n the original chain had more than two blocks on it so if it was trying to kind of revert\n\n39:35.160 --> 39:41.040\n more than more than two blocks then everyone would just would just ignore it and everyone\n\n39:41.040 --> 39:44.480\n would just keep following the regular chain but here you know we have block two and we\n\n39:44.480 --> 39:50.720\n have block two prime and so the two are kind of even and then whatever block um the next\n\n39:50.720 --> 39:56.120\n block is created on top of so say block three is now created on top of block two prime then\n\n39:56.120 --> 40:03.160\n everyone says uh agrees that block three is the new head um and block two prime is just\n\n40:03.160 --> 40:06.740\n kind of forgotten and then everyone just kind of peacefully builds on top of block three\n\n40:06.740 --> 40:12.640\n and the thing continues so how difficult is it to mess with the system right so how like\n\n40:12.640 --> 40:19.040\n if we look at the general problem like how many what fraction of people who participate\n\n40:19.040 --> 40:26.080\n in the system have to be bad players in order to mess with it truly like what's your is\n\n40:26.080 --> 40:31.600\n there is there a good number there is um well depending on kind of what your model of the\n\n40:31.600 --> 40:36.480\n participants is and like what kind of attack we're talking about it's anywhere between\n\n40:36.480 --> 40:47.560\n 23.2 and 50 of what of all of the computing power in the network sorry so 22 and 23 point\n\n40:47.560 --> 40:58.200\n between 23.2 and 50 and 50 can be compromised so like once your once your your portion of\n\n40:58.200 --> 41:04.120\n the total computing power in the network goes above the 23.2 level then there's kind of\n\n41:04.120 --> 41:08.440\n things that you could mean things that you can potentially do and as your percentage\n\n41:08.440 --> 41:12.740\n of the network kind of keeps going up then the your abilities as you mean things kind\n\n41:12.740 --> 41:17.440\n of goes higher and then if you have above 50 then you can just break everything so how\n\n41:17.440 --> 41:23.800\n how hard is it to achieve that level like it seems that so far historically speaking\n\n41:23.800 --> 41:29.680\n it's been exceptionally difficult so this is a challenging question um so the economic\n\n41:29.680 --> 41:36.680\n cost of acquiring that level of stuff from scratch is fairly high i think it's uh somewhere\n\n41:36.680 --> 41:42.040\n in the low billions of dollars and when you say that stuff you mean computational resources\n\n41:42.040 --> 41:48.200\n yeah so specifically specialized hardware and of asics that people use to solve these\n\n41:48.200 --> 41:54.160\n puzzles to do the mining these days small tangent uh so obviously i work a lot in deep\n\n41:54.160 --> 42:00.960\n learning with gpus and asics for that application and i tangentially kind of hear that so many\n\n42:00.960 --> 42:07.360\n of these you know sometimes nvidia gpus are sold out because of this other application\n\n42:07.360 --> 42:12.440\n like what do if you can comment i don't know if you're familiar or interested in this space\n\n42:12.440 --> 42:18.520\n what kind of asics what kind of hardware is generally used these days for to do the actual\n\n42:18.520 --> 42:23.440\n computation for the proof of work sure so in the case in bitcoin and ethereum are a\n\n42:23.440 --> 42:28.960\n bit different so in the case of bitcoin there is an algorithm called sha256 it's just a\n\n42:28.960 --> 42:33.880\n hash function and so the puzzle is just coming up with a number where the hash of the number\n\n42:33.880 --> 42:38.880\n is below some threshold and so because the hashes are designed to be random you just\n\n42:38.880 --> 42:45.040\n have to keep on trying different numbers until one works and the asics are just like specialized\n\n42:45.040 --> 42:51.320\n circuits that contain and if circuits for evaluating this hash over and over again and\n\n42:51.320 --> 42:56.240\n you have like millions or billions of these hash evaluators and just stacked on top of\n\n42:56.240 --> 43:01.000\n each other inside of a box and you just keep on running the box 24 7 in the asics there's\n\n43:01.000 --> 43:05.520\n literally specialized hardware designed for this yes oh this is a little bit an amazing\n\n43:05.520 --> 43:11.560\n world another tangent i'll come back to the basics but uh does quantum computing throw\n\n43:11.560 --> 43:19.080\n a wrench into any of this very good question so uh quantum computers have two main uh kind\n\n43:19.080 --> 43:24.520\n of families of algorithms that are relevant to cryptography one is shor's algorithm and\n\n43:24.520 --> 43:31.520\n shor's algorithm is one that kind of completely breaks the hardness of some specific kinds\n\n43:31.520 --> 43:35.560\n of mathematical problems so the one that you've probably heard of is it makes it very easy\n\n43:35.560 --> 43:41.280\n to factor numbers so figure out kind of what prime factors are the kind of that you need\n\n43:41.280 --> 43:46.920\n to multiply together to get some number even if that number is extremely big shor's algorithm\n\n43:46.920 --> 43:54.480\n can also be used to break elliptic curve cryptography it can break like any kind of hidden order\n\n43:54.480 --> 44:00.320\n groups it breaks a lot of kind of cryptographic nice things that we're used to but the good\n\n44:00.320 --> 44:07.720\n news is that for every kind of major use of things that shor's algorithm breaks we already\n\n44:07.720 --> 44:12.680\n know of quantum proof alternatives right now we don't use these quantum proof alternatives\n\n44:12.680 --> 44:20.280\n yet because in many cases they're five to ten times less efficient but the crypto industry\n\n44:20.280 --> 44:25.580\n in general kind of knows that this is coming eventually and it's kind of ready to take\n\n44:25.580 --> 44:31.680\n the hit and switch to that stuff when we when we have to the second algorithm that is relevant\n\n44:31.680 --> 44:38.240\n to cryptography is grover's algorithm and in grover's algorithm might even be kind of\n\n44:38.240 --> 44:44.520\n more familiar to ai people that's basically usually described as solving search problems\n\n44:44.520 --> 44:51.600\n but the idea here is that if you have a problem of the form find a number that satisfies some\n\n44:51.600 --> 44:58.840\n property then if with a classical computer you need to try and if n times before before\n\n44:58.840 --> 45:03.800\n you find a number then with a quantum computer you only need to do square root of n computations\n\n45:03.800 --> 45:12.840\n and grover's could potentially be used for mining but there's two possibilities here\n\n45:12.840 --> 45:18.480\n one is that grover's could be used for mining and whoever creates the first working quantum\n\n45:18.480 --> 45:22.800\n computer that could do grover's will just mine way faster than everyone else and we'll\n\n45:22.800 --> 45:27.920\n see another round of what we saw when a6 came out which is that kind of the new hardware\n\n45:27.920 --> 45:32.320\n just kind of dominated the old stuff and then eventually it switched to a new equilibrium\n\n45:32.320 --> 45:37.680\n but by the way way faster not exponentially faster quadratically faster quadratically\n\n45:37.680 --> 45:44.960\n faster which is not sort of it's not game changing i would say it's like a6 like you\n\n45:44.960 --> 45:50.200\n said it would be exactly yeah so it would not necessarily break proof of work as a that's\n\n45:50.200 --> 45:55.160\n right yeah now the other kind of possible world right is that quantum computers have\n\n45:55.160 --> 46:00.440\n a lot of overhead there's a lot of a complexity involved in maintaining quantum states and\n\n46:00.440 --> 46:07.600\n there's also as we've been realizing recently making quantum computers actually work requires\n\n46:07.600 --> 46:12.200\n kind of quantum error correction which requires kind of a thousand real qubits per logical\n\n46:12.200 --> 46:17.920\n qubit and so there's the very real possibility that the overhead of running a quantum computer\n\n46:17.920 --> 46:22.540\n will be higher than the speed up you get with grover's which would be kind of sad but which\n\n46:22.540 --> 46:28.220\n would also mean that the given proof of work will just keep working fine so beautifully\n\n46:28.220 --> 46:33.640\n put so so proof of work is the core idea of bitcoin is there other core ideas before we\n\n46:33.640 --> 46:39.160\n kind of take a step towards the origin story and ideas of ethereum is there other stuff\n\n46:39.160 --> 46:43.880\n that were key to the white paper of bitcoin there is proof of work and then there's just\n\n46:43.880 --> 46:49.880\n the cryptography is just kind of public keys and signatures that are used to verify transactions\n\n46:49.880 --> 46:56.120\n those two are the big things so then what is the origin story maybe the human side but\n\n46:56.120 --> 47:04.360\n also the technical side of ethereum sure so i joined the bitcoin community in 2011 and\n\n47:04.360 --> 47:09.760\n i started by just writing i first wrote for this sort of online thing called bitcoin weekly\n\n47:09.760 --> 47:16.500\n then i started writing for bitcoin magazine um and uh sorry to interrupt you have this\n\n47:16.500 --> 47:24.440\n funny kind of uh story true or not is uh that you were disillusioned by the downsides of\n\n47:24.440 --> 47:29.660\n centralized control from your experience with wow world of warcraft is this true or you're\n\n47:29.660 --> 47:35.120\n just being witty uh i mean the event is true the fact that that's the reason i do decentralization\n\n47:35.120 --> 47:42.640\n is witty maybe just a small tangent do have you always had a skepticism of centralized\n\n47:42.640 --> 47:49.600\n control is that sort of degree yeah has that feeling evolved over time or has that just\n\n47:49.600 --> 47:55.760\n always been a core feeling that decentralized control is the future of a human society it's\n\n47:55.760 --> 47:59.920\n definitely been something that felt very attractive to me ever since i could have learned that\n\n47:59.920 --> 48:05.440\n such a thing is possible it's possible even yeah so great so you're you joined the bitcoin\n\n48:05.440 --> 48:12.800\n community in 2011 you said you began writing so what's next started writing uh moved from\n\n48:12.800 --> 48:20.640\n high school to university halfway in between that and spent a year in university then at\n\n48:20.640 --> 48:27.720\n the end of that year i dropped out to do bitcoin things full time and this was a combination\n\n48:27.720 --> 48:33.360\n of continuing to write bitcoin magazine but also increasingly work on software projects\n\n48:33.360 --> 48:37.760\n and i traveled around the world for about six months and just going to different bitcoin\n\n48:37.760 --> 48:44.520\n communities like i went to first in new hampshire then spain other european places israel and\n\n48:44.520 --> 48:48.880\n then san francisco and along the way i've met a lot of other people that are working\n\n48:48.880 --> 48:54.600\n on different bitcoin projects and when i was in israel there were some very smart teams\n\n48:54.600 --> 49:00.880\n there that were working on ideas that people were starting to kind of call bitcoin 2.0\n\n49:00.880 --> 49:06.480\n so one of these were colored coins which is basically saying that hey let's not just use\n\n49:06.480 --> 49:10.080\n the blockchain for bitcoin but let's also like kind of issue other kinds of assets on\n\n49:10.080 --> 49:15.320\n it and then there was a protocol called master coin that supported issuing assets but also\n\n49:15.320 --> 49:21.160\n supported many other things like financial contracts like domain name registration and\n\n49:21.160 --> 49:30.920\n a lot of different things together and i spent some time working with these teams and i quickly\n\n49:30.920 --> 49:36.480\n kind of realized that this master coin protocol could be improved by kind of generalizing\n\n49:36.480 --> 49:40.480\n it more right so the best the analogy i use is that the master coin protocol was like\n\n49:40.480 --> 49:46.880\n this swiss army knife you have 25 different transaction types for 25 different applications\n\n49:46.880 --> 49:52.040\n but what i realized is that you could replace a bunch of them with things that are more\n\n49:52.040 --> 49:57.960\n general purpose so one of them was that you could replace like three transaction types\n\n49:57.960 --> 50:03.080\n for three types of financial contracts with a generic transaction type for a financial\n\n50:03.080 --> 50:08.640\n contract that just lets you specify a mathematical formula for kind of who how much money each\n\n50:08.640 --> 50:14.400\n side gets by the way it's a small pause what's you say financial contract just the terminology\n\n50:14.400 --> 50:21.960\n what is the contract what's a financial contract so this is just generally an agreement where\n\n50:21.960 --> 50:29.920\n kind of either one or two parties kind of put collateral kind of in and then they depending\n\n50:29.920 --> 50:35.360\n on kind of certain conditions like this could involve prices of assets this could involve\n\n50:35.360 --> 50:40.840\n the actions of the two parties it could involve other things but they kind of get different\n\n50:40.840 --> 50:46.640\n amounts of of assets out that just depend on things that happened so a contract is really\n\n50:46.640 --> 50:52.920\n a financial contract is at the core it's the it's the core interactive element of a financial\n\n50:52.920 --> 50:57.600\n system yeah there's yeah there's many different kinds of financial contracts like there's\n\n50:57.600 --> 51:02.000\n things like options where you kind of give someone the right to buy a thing that you\n\n51:02.000 --> 51:08.120\n have for some specific price for some period of time there's uh contracts for difference\n\n51:08.120 --> 51:13.520\n where you basically are kind of making a bet that says like for every dollar this thing\n\n51:13.520 --> 51:16.720\n goes up i'll give you seven dollars or for every dollar that thing goes down you give\n\n51:16.720 --> 51:21.840\n me seven dollars or something like that and but the main idea that these contracts have\n\n51:21.840 --> 51:27.600\n to be enforced and trusted them yes exactly you have to trust that they will work out\n\n51:27.600 --> 51:34.000\n in a system where nobody can be trusted yes this is such a beautiful complicated system\n\n51:34.000 --> 51:40.640\n okay so uh so you were seeking to kind of generalize this basic uh framework of contracts\n\n51:40.640 --> 51:48.320\n um so what does that entail so what what technically are the steps to creating ethereum\n\n51:48.320 --> 51:54.880\n sure so i guess just to kind of continue a bit with this master coin story um so started\n\n51:54.880 --> 52:00.720\n by kind of giving ideas for how to generalize the thing and eventually um this turned into\n\n52:00.720 --> 52:04.800\n a much more kind of fully fledged proposal that just says hey how about you scrap all\n\n52:04.800 --> 52:09.920\n your futures and instead you just um put in this programming language and i gave this\n\n52:09.920 --> 52:16.640\n idea to them and their response was something like hey this is great but this seems complicated\n\n52:16.640 --> 52:19.920\n and it seems like something that we're not going to be able to put onto our roadmap for\n\n52:19.920 --> 52:24.480\n a while and my response to this was like wait do you not realize how revolutionary this\n\n52:24.480 --> 52:29.840\n is well i'll just go do it myself and then i what was the name of the programming language\n\n52:29.840 --> 52:37.920\n i just called it ultimate scripting great uh so then i kind of went through a couple\n\n52:37.920 --> 52:43.520\n more rounds of iteration and then the idea for a theorem itself started to form\n\n52:43.520 --> 52:51.440\n um and the idea here is that you just have a blockchain where the core unit of the thing\n\n52:51.440 --> 52:57.600\n is what we call contracts it's these kind of accounts that can hold assets um and like\n\n52:57.600 --> 53:03.680\n they have their own internal memory but that are controlled by a piece of code and so if\n\n53:03.680 --> 53:09.280\n i send some ether to a contract the only thing that can determine where that kind of ether\n\n53:10.000 --> 53:16.800\n the currency inside ethereum and it goes after that um is the code of that contract itself\n\n53:16.800 --> 53:24.640\n and so basically kind of sending assets to computer programs becomes this kind of paradigm\n\n53:24.640 --> 53:30.560\n for creating these sort of agreements self executing agreements self executing it's so\n\n53:30.560 --> 53:36.480\n cool that code is sort of part of this contract so that that's what's meant by smart contracts\n\n53:36.480 --> 53:43.040\n yeah so how hard was it to build this kind of thing harder than expected um and originally\n\n53:43.040 --> 53:47.200\n i actually thought that this would be a thing that i would kind of casually work on for a\n\n53:47.200 --> 53:55.200\n couple of months publish and then go back to university um then i released it and a bunch\n\n53:55.200 --> 53:59.200\n of people or i released the white paper the white paper the idea is there the idea the\n\n53:59.200 --> 54:03.840\n white paper um a whole bunch of people came in offering the help a huge number of people\n\n54:03.840 --> 54:10.720\n and have expressed interest and this was something i was totally not expecting and then i kind of\n\n54:10.720 --> 54:15.920\n realized that this would be something that's kind of much bigger than i had ever um thought\n\n54:15.920 --> 54:23.280\n that it would be and then we started on this kind of much longer development slog of making\n\n54:23.280 --> 54:28.800\n something that lives up to this sort of much higher level of expectations what are the some\n\n54:28.800 --> 54:34.480\n of the is it fundamentally like software engineering challenges it was their social\n\n54:34.480 --> 54:40.720\n okay so there's social so so what are the biggest interesting challenges that you've learned about\n\n54:41.840 --> 54:45.600\n human civilization and in in software engineering through this process\n\n54:47.280 --> 54:54.400\n so i guess one of the challenges for me is that like i'm one of the kind of apparently unusual\n\n54:54.400 --> 54:59.440\n geek schoolers and i've never treated with anything but kindness in school yes um and so\n\n55:00.160 --> 55:06.960\n when i got into crypto i kind of expected everyone would just kind of be the same kind\n\n55:06.960 --> 55:14.800\n of altruistic and nice in that same way um but the um kind of the algorithm that i used for\n\n55:14.800 --> 55:18.480\n finding cofounders for this thing was not very good it was sort of literally one computer\n\n55:18.480 --> 55:23.440\n scientist called the greedy algorithm it's sort of the first 15 people who replied back offering\n\n55:23.440 --> 55:29.200\n to help kind of are the cofounders oh you mean like literally the the the people that for will\n\n55:29.200 --> 55:34.240\n form to be the the founders cofounders of the community the algorithm i like how you call it\n\n55:34.240 --> 55:43.920\n the algorithm yeah um and so what happened was that uh these um like especially as the project\n\n55:43.920 --> 55:48.320\n got really big like there started to be a lot of this kind of infighting and there were a lot of\n\n55:48.320 --> 55:53.280\n like i wanted the thing to be a non profit and some of them wanted to be a for profit\n\n55:53.280 --> 55:58.400\n uh and then there started to be people who were just kind of totally unable to work with each\n\n55:58.400 --> 56:04.720\n other there were people that were kind of trying to get an advantage for themselves in a lot of\n\n56:04.720 --> 56:12.320\n different ways and this uh just about six months later led to this big governance crisis and then\n\n56:12.320 --> 56:18.720\n we kind of reshuffled leadership a bit and then uh the project kept on going then nine months\n\n56:18.720 --> 56:23.760\n later there was another governance crisis and then there was a third governance crisis and so\n\n56:23.760 --> 56:30.000\n is there a way to if you're looking at the human side of things is there a way to optimize this\n\n56:30.000 --> 56:36.080\n aspect of the cryptocurrency world it seems that there is uh from my perspective there's a lot of\n\n56:36.080 --> 56:43.520\n different characters and personalities and egos and like you said uh i don't know if you know i\n\n56:43.520 --> 56:49.360\n also like to think that most of the world most of the people in the world are well intentioned\n\n56:50.080 --> 56:56.640\n but the way those intentions are realized may perhaps come off as uh yeah as as negative like\n\n56:56.640 --> 57:03.440\n what uh is there is there a hopeful message here about creating a governance structure for\n\n57:03.440 --> 57:09.440\n cryptocurrency that uh where everyone gets along and after about four rounds of reshuffle like i\n\n57:09.440 --> 57:16.160\n think we've actually come up with something that seems to be pretty stable and happy um i think uh\n\n57:18.960 --> 57:25.600\n i mean i definitely do think that most people are well intentioned i just think that like one of the\n\n57:25.600 --> 57:30.880\n reasons why i like decentralization is just because there's like this thing about power\n\n57:30.880 --> 57:35.760\n where power attracts people with egos and so that just allows us a very small percentage of people\n\n57:35.760 --> 57:44.000\n to just ruin so many things you think ego has a you think ego has a use like is ego always bad\n\n57:44.560 --> 57:49.200\n it seems like sometimes does but then the ethereum research team i feel like we've found\n\n57:50.160 --> 57:58.080\n also kind of a lot like a lot of very good people that are just kind of primarily just interested\n\n57:58.080 --> 58:05.920\n in things for the technology and uh things seem to just generally be going quite well\n\n58:06.720 --> 58:11.360\n yeah when you're when the focus and the passion is in the tech so on the so that's the human side\n\n58:11.360 --> 58:16.400\n of things but the technology side like what have you learned what have been the biggest challenges\n\n58:16.400 --> 58:25.040\n of bringing ethereum to life on the technology side so i think first of all just uh you know\n\n58:25.040 --> 58:30.640\n there's like the first law of software development which is that when someone gives you a timetable\n\n58:30.640 --> 58:35.600\n i switch the unit of time to the next largest unit of time and add one and like we basically\n\n58:35.600 --> 58:44.800\n fell victim to that um and uh and so instead of taking like three months it ended up taking like\n\n58:44.800 --> 58:51.200\n 20 months to watch the thing um and that was just i think underestimating the sheer technical\n\n58:51.200 --> 58:57.840\n complexity of the thing um there are research challenges like so for example one of the things\n\n58:57.840 --> 59:02.240\n that we've been saying from the start that we would do one is a switch from a proof of work\n\n59:02.240 --> 59:08.080\n to a proof of stake um where proof of stake is so this uh alternative consensus mechanism where\n\n59:08.080 --> 59:13.040\n instead of having to waste a lot of computing power on solving these mathematical puzzles\n\n59:13.040 --> 59:18.880\n that don't mean anything you kind of prove that you have access to coins inside of the system and\n\n59:18.880 --> 59:23.600\n this uh then it gives you some level of participation in the consensus can you\n\n59:23.600 --> 59:26.720\n maybe elaborate on that a little bit i understand the idea of proof of work\n\n59:27.360 --> 59:32.320\n um i know that a lot of people say that the idea of proof of stake is really appealing can you\n\n59:32.320 --> 59:41.840\n maybe linger on it longer explain what it is sure uh so basically the idea is like if i kind of lock\n\n59:41.840 --> 59:49.680\n up a hundred coins then i turn that into a kind of quote virtual miner and the system itself kind\n\n59:49.680 --> 59:56.560\n of automatically and randomly assigns that in a virtual miner the right to create blocks at\n\n59:56.560 --> 1:00:02.000\n particular intervals and then if someone else has 200 coins and they walk on the walk there's 200\n\n1:00:02.000 --> 1:00:07.200\n coins then they get a kind of twice as big virtual miner they'll be able to create blocks twice as\n\n1:00:07.200 --> 1:00:15.040\n often so it tries to kind of do similar things to proof of work except instead of the thing\n\n1:00:15.040 --> 1:00:22.000\n and of rate limiting your participation being your ability to crank out solutions to kind of\n\n1:00:22.000 --> 1:00:26.240\n hash challenges the thing that really limits your participation is kind of how much coins you're\n\n1:00:26.240 --> 1:00:31.600\n kind of locking into this mechanism okay so interesting so that that limited participation\n\n1:00:31.600 --> 1:00:42.640\n doesn't require you to run a lot of compute does that mean that the richer you are so rich people\n\n1:00:44.240 --> 1:00:53.200\n um are more like their identities more right and this stable yeah verifiable or whatever\n\n1:00:53.200 --> 1:00:58.880\n whatever the right terminology is right and this is definitely a common critique i think my usual\n\n1:00:58.880 --> 1:01:04.000\n answer to this is that like proof of work is even more of that kind of system exactly yeah because\n\n1:01:04.000 --> 1:01:08.000\n i didn't mean it and that statement is a criticism i think you're exactly right that's equivalent\n\n1:01:08.000 --> 1:01:14.320\n the proof of work is the same kind of thing but in the proof of work you have to also use physical\n\n1:01:14.320 --> 1:01:21.360\n resources yes and burn computers and burn trees and all of that stuff is there um a way to mess\n\n1:01:21.360 --> 1:01:27.920\n with the system of the proof of uh proof of stake there is but you will once again need to have a\n\n1:01:27.920 --> 1:01:32.080\n very large portion of all the coins that are locked in the system to do anything bad got it\n\n1:01:33.360 --> 1:01:38.800\n yeah and just that maybe take a small tangent one of the criticisms of cryptocurrency is the fact\n\n1:01:39.600 --> 1:01:44.080\n that i guess for the proof of work mechanism you have to use so much energy in the world\n\n1:01:44.080 --> 1:01:51.040\n yes is one of the motivations of proof of stake is to move away from this definitely like what's\n\n1:01:51.040 --> 1:01:57.040\n your sense of the uh maybe i'm just under informed is there like legitimately environmental impact\n\n1:01:57.040 --> 1:02:04.080\n from this yeah uh so the latest thing was that bitcoin consumed as much energy as the country of\n\n1:02:04.080 --> 1:02:09.280\n austria or something like that yeah and then ethereum is like right now maybe only like\n\n1:02:09.280 --> 1:02:15.120\n half in order of magnitude smaller than bitcoin i've heard you talk about ethereum 2.0 so what's\n\n1:02:15.120 --> 1:02:22.400\n the what's the dream of ethereum 2.0 what's the the status of proof of stake is the mechanism that\n\n1:02:22.400 --> 1:02:28.800\n ethereum moves towards and also how do you move to a different mechanism of consensus\n\n1:02:29.840 --> 1:02:36.400\n within a cryptocurrency so ethereum 2.0 is a collection of major upgrades that we've wanted\n\n1:02:36.400 --> 1:02:42.480\n to do to ethereum for quite some time the two big ones uh one is a proof of stake and the other is\n\n1:02:42.480 --> 1:02:48.000\n what we call sharding um sharding solves another problem with blockchains which is a scalability\n\n1:02:48.000 --> 1:02:54.480\n and what sharding does is it basically says instead of every participant in the network\n\n1:02:54.480 --> 1:02:59.440\n having to personally download and verify every transaction every participant in the network only\n\n1:02:59.440 --> 1:03:04.000\n downloads and verifies a small portion of transactions and then you kind of randomly\n\n1:03:04.000 --> 1:03:11.120\n distribute who gets how much work um and because of how the distribution is random it still has the\n\n1:03:11.120 --> 1:03:16.160\n property that you need a large portion of the entire network to corrupt what's going on inside\n\n1:03:16.160 --> 1:03:23.680\n of any shard but the system is still in a very redundant and very secure that's brilliant how\n\n1:03:23.680 --> 1:03:30.480\n hard is that to implement and how hard is uh proof of stake to implement like on the technical level\n\n1:03:30.480 --> 1:03:35.840\n yeah software level proof of stake and sharding are both challenging um i'd say sharding is a bit\n\n1:03:35.840 --> 1:03:40.640\n more challenging the reason is that proof of stake is kind of just a change to the how the\n\n1:03:40.640 --> 1:03:46.800\n consensus layer works sharding does both that but it's also a change to the networking layer\n\n1:03:46.800 --> 1:03:50.960\n um the reason is that sharding is kind of pointless if at the networking layer you still\n\n1:03:50.960 --> 1:03:55.680\n do what you do today which is you kind of gossip everything which means that if someone publishes\n\n1:03:55.680 --> 1:04:01.200\n something every other node and the client hears it like from uh on the networking layer and so\n\n1:04:01.200 --> 1:04:05.360\n instead we have to have kind of subnetworks and the ability to quickly switch between subnetworks\n\n1:04:05.360 --> 1:04:11.040\n and have the subnetworks talk to each other and this is all doable but it's a more complex\n\n1:04:11.040 --> 1:04:15.040\n architecture and it's definitely the sort of thing that hasn't not yet been done in cryptocurrency\n\n1:04:15.040 --> 1:04:21.200\n so most most of the networking layer in uh cryptocurrency is you're shouting you're like\n\n1:04:21.200 --> 1:04:26.800\n broadcasting messages and this is more like ad hoc networks like yeah you're shouting within\n\n1:04:26.800 --> 1:04:31.760\n smaller groups smaller group but you have like a bunch of subnet like exactly then you have to\n\n1:04:31.760 --> 1:04:38.720\n switch between oh man i'd love to see the uh so it's a beautiful idea uh so from a graph\n\n1:04:38.720 --> 1:04:44.320\n theoretical perspective but just the software that like who's responsible is the ethereum\n\n1:04:44.960 --> 1:04:48.880\n project like the people involved would they be implementing like what's the actual\n\n1:04:48.880 --> 1:04:56.080\n you know this is like legit software engineering uh who like how does that work how do people\n\n1:04:56.080 --> 1:05:02.880\n collaborate build that kind of project is this like almost um like is there a software engineering\n\n1:05:02.880 --> 1:05:08.960\n lead is there it's like is it a legit almost like large scale open source project there is\n\n1:05:08.960 --> 1:05:14.160\n yeah so um we have uh someone named uh danny ryan on our team who's just been brilliant and\n\n1:05:14.160 --> 1:05:22.800\n great all around and he is a kind of de facto kind of development coordinator i guess it's like you\n\n1:05:22.800 --> 1:05:28.480\n have to invent job titles for this stuff the reason is that um like we also have this unique\n\n1:05:28.480 --> 1:05:32.560\n kind of organizational structure where the ethereum foundation itself kind of does research\n\n1:05:32.560 --> 1:05:37.680\n in house but then the actual implementation is done by independent teams that are separate\n\n1:05:37.680 --> 1:05:44.640\n companies and they're located all around the world and like fun places like australia and and\n\n1:05:44.640 --> 1:05:51.840\n and so uh you know you kind of just need a bunch of kind of almost nonstop cat herding to just\n\n1:05:52.400 --> 1:05:57.840\n keep getting these people to kind of talk to each other and kind of implement this back make sure\n\n1:05:57.840 --> 1:06:02.080\n that everyone agrees on kind of what what's going on and kind of how to interpret different things\n\n1:06:02.960 --> 1:06:08.080\n so how far into the future are we from these two mechanisms in ethereum 2.0 like what's what's your\n\n1:06:08.080 --> 1:06:15.200\n sense of the timeline keeping in mind the previous comment you made about the sort of uh general\n\n1:06:16.160 --> 1:06:24.720\n curse of software projects so ethereum 2.0 is split into three phases so phase zero just\n\n1:06:24.720 --> 1:06:30.080\n creates a proof stake network and it's actually separate from kind of proof of uh the proof of\n\n1:06:30.080 --> 1:06:34.960\n work network at the beginning just to kind of give it time to grow and improve itself\n\n1:06:34.960 --> 1:06:39.200\n do people get to choose sorry to interrupt do people get to choose i guess yes they get they\n\n1:06:39.200 --> 1:06:45.280\n get to choose to move over if they want to then phase one adds sharding but it only adds sharding\n\n1:06:45.280 --> 1:06:51.520\n of data storage and not sharding of computation and then after that there is kind of the merger\n\n1:06:51.520 --> 1:06:58.960\n phase which is where the uh and if the accounts uh kind of smart contracts like all of the activity\n\n1:06:58.960 --> 1:07:04.480\n and uh the existing eth1 system just kind of gets cut and pasted into eth2 and then the proof of\n\n1:07:04.480 --> 1:07:09.760\n work chain gets forgotten and then and things all the things that were living there before just\n\n1:07:09.760 --> 1:07:18.080\n kind of continue living inside of the proof of stake system so for timelines um phase zero has\n\n1:07:18.080 --> 1:07:26.960\n been uh kind of almost fully implemented um and now it's just a matter of uh a whole bunch of\n\n1:07:26.960 --> 1:07:33.280\n security auditing and testing um my own experience is that right now it feels like we're at about a\n\n1:07:33.280 --> 1:07:40.720\n phase comparable to when we were doing uh the original ethereum launch when we were maybe about\n\n1:07:40.720 --> 1:07:47.440\n four months away from launch so that's just a hunch then that's just a hunch yeah so how you\n\n1:07:47.440 --> 1:07:54.080\n know it took it took like over a decade for people to move from python 2 to python 3 uh how do you see\n\n1:07:54.720 --> 1:08:01.600\n the move from like this phase zero of for for different consensus mechanism do you see there\n\n1:08:01.600 --> 1:08:09.280\n being a a drastic phase shift in people just kind of jumping to this better mechanism so in phase\n\n1:08:09.280 --> 1:08:15.520\n zero i don't expect too many people to do much because in phase zero in phase one the new chain\n\n1:08:15.520 --> 1:08:20.400\n the get of deliberately enough doesn't have too much functionality turned on it's there just like\n\n1:08:20.400 --> 1:08:24.800\n if you want to be a proof of stake validator you can get things started if you want to store data\n\n1:08:24.800 --> 1:08:30.400\n for other blockchain applications you can get started but existing applications will largely\n\n1:08:30.400 --> 1:08:38.160\n keep living on eth1 and then when the merger happens then the merger is a operation that\n\n1:08:38.160 --> 1:08:43.520\n happens all at once so that's kind of one of the benefits of a consensus system that like on the\n\n1:08:43.520 --> 1:08:47.680\n one hand you have to coordinate the upgrade but on the other hand the upgrade can be coordinated\n\n1:08:48.960 --> 1:08:56.640\n so what's casper ffg by the way um casper ffg is the consensus algorithm that we are using for\n\n1:08:56.640 --> 1:09:01.200\n the proof of stake is there something interesting uh specific about casper ffg\n\n1:09:01.200 --> 1:09:09.200\n like some beautiful aspect of it that's uh there is so casper ffg combines together kind of two\n\n1:09:09.200 --> 1:09:14.800\n different schools of a consensus algorithm design uh so the general two different schools of the\n\n1:09:14.800 --> 1:09:23.040\n of this design are right one is uh 50 fault tolerant but dependent on network synchrony\n\n1:09:23.040 --> 1:09:30.240\n so 50 fault tolerant but it didn't tolerate up to 50 of faults but not more but it depends on\n\n1:09:30.240 --> 1:09:34.640\n an assumption that all of the nodes can talk uh talk to each other within some\n\n1:09:34.640 --> 1:09:39.040\n kind of limited period of time like if i send the message you'll receive it within a few seconds\n\n1:09:40.320 --> 1:09:47.200\n and the second school is 33 fault tolerant but safe under asynchrony which means that\n\n1:09:47.200 --> 1:09:53.360\n like if we agree on something then that thing is finalized and even if the network goes horribly\n\n1:09:53.360 --> 1:09:59.440\n wonky the second after that thing is finalized there's no way to revert that thing um and that's\n\n1:10:00.240 --> 1:10:06.720\n fascinating how you would make that happen it's uh definitely quite clever um i'd recommend the\n\n1:10:06.720 --> 1:10:12.880\n uh casper ffg paper if you just search like archive as in like arxiv casper ffg it's that's\n\n1:10:12.880 --> 1:10:18.480\n that's an archive the paper is an archive yeah yeah who are the authors um myself and uh virgil\n\n1:10:18.480 --> 1:10:25.600\n griffith that's awesome i take a small tangent this idea of just putting out white papers and\n\n1:10:25.600 --> 1:10:30.720\n papers and putting them on archive and just putting them publicly is that is that at the core\n\n1:10:31.840 --> 1:10:38.240\n is that a necessary component of the currency is that the tradition started with uh uh satoshi\n\n1:10:38.240 --> 1:10:42.320\n nakamoto's what do you make of it like what do you make of the future of that kind of sharing of\n\n1:10:42.320 --> 1:10:50.640\n ideas i guess so yeah and it's definitely something that's kind of mandatory for crypto because like\n\n1:10:50.640 --> 1:10:56.160\n crypto is all about making systems where you know you don't have to trust the operators to\n\n1:10:56.160 --> 1:11:02.080\n trust that the thing works and so if anything behind our system works is closed sourced and\n\n1:11:02.080 --> 1:11:09.680\n that kind of uh kills the point and so there is the kind of a sense in which the fundamental\n\n1:11:09.680 --> 1:11:14.640\n properties of the category of the thing we're trying to build just kind of forces openness\n\n1:11:14.640 --> 1:11:19.680\n but also openness just has proven to be a really great way to collaborate and then there's actually\n\n1:11:19.680 --> 1:11:24.640\n had a lot of kind of innovation and academic collaboration that's just kind of happened\n\n1:11:24.640 --> 1:11:31.280\n ad hoc in the crypto space the last few years so like for example we have this forum called\n\n1:11:31.280 --> 1:11:40.000\n eth research that's like e th r e s e a r and then dot ch um and there we publish kind of just\n\n1:11:40.000 --> 1:11:46.640\n ideas in a form that's kind of half formal like it's halfway in between like it's it's a kind of\n\n1:11:46.640 --> 1:11:52.480\n a text write up and then you can have math in it but it's often and of much shorter than a paper\n\n1:11:52.480 --> 1:11:58.880\n and it turns out that the great majority of new ideas like they're just kind of fairly small\n\n1:11:58.880 --> 1:12:03.360\n nuggets that you can explain in like five to ten lines and they don't really they don't need the\n\n1:12:03.360 --> 1:12:08.400\n whole formality of a paper exactly they don't require the kind of like 10 pages of a filler\n\n1:12:08.400 --> 1:12:15.040\n and so introduction conclusion is not needed yeah and so instead you just kind of publish the idea\n\n1:12:15.040 --> 1:12:20.160\n and then people can go comments on it and that's brilliant yeah this has been great for us i think\n\n1:12:20.160 --> 1:12:26.560\n i interrupted you was there something else on casper ffg that's just casper ffg is just kind\n\n1:12:26.560 --> 1:12:35.920\n of combines together these two schools um and so basically it creates this system where if you have\n\n1:12:36.720 --> 1:12:44.080\n more than 50 that are honest then and you have network synchrony then the thing kind of goes\n\n1:12:44.080 --> 1:12:48.640\n as a chain but then if network synchrony fails then kind of the last few blocks in the chain\n\n1:12:48.640 --> 1:12:54.880\n might um kind of get replaced but anything that was finalized by this kind of more asynchronous\n\n1:12:54.880 --> 1:13:02.320\n process uh gets uh can't be reverted and so you essentially get a kind of best of both worlds\n\n1:13:02.320 --> 1:13:07.600\n between those two models okay so i know what i'm doing tonight i'm going to be reading the casper\n\n1:13:07.600 --> 1:13:15.760\n fg paper uh apologize for the romanticized question but what to you are some or the most\n\n1:13:15.760 --> 1:13:21.360\n beautiful idea in the world of ethereum just something uh surprising something beautiful\n\n1:13:21.360 --> 1:13:27.360\n something powerful yeah i mean i think the fact that money can just emerge out of a database if\n\n1:13:27.360 --> 1:13:33.840\n enough people believe in it i think is definitely one of those things that's up there um i think one\n\n1:13:33.840 --> 1:13:39.520\n of the things that i really love about ethereum is also this concept of composability so this is the\n\n1:13:39.520 --> 1:13:45.760\n idea that like if i build an application on top of ethereum then you can build an application that\n\n1:13:45.760 --> 1:13:51.360\n talks to my application and you don't even need my permission you don't even need to talk to me\n\n1:13:51.360 --> 1:13:57.440\n right so one really fun example of this is there was this game on ethereum called crypto kitties\n\n1:13:57.440 --> 1:14:03.520\n that just involved kind of breeding digital cats yes and someone else created a game called crypto\n\n1:14:03.520 --> 1:14:08.720\n dragons where the way you play crypto dragons is you have a dragon and you have to feed it crypto\n\n1:14:08.720 --> 1:14:17.840\n kitties um and they just uh created the whole thing just like as an ethereum contract that you\n\n1:14:17.840 --> 1:14:23.920\n would send these uh these tokens that are defined by this other ethereum contract and for the\n\n1:14:23.920 --> 1:14:29.360\n interoperability to happen like the projects didn't don't really need to like the teams don't\n\n1:14:29.360 --> 1:14:35.040\n really need to talk to each other you just kind of interface with the existing program so it's\n\n1:14:35.040 --> 1:14:39.200\n arbitrarily composable in this kind of way so you have different uh you know different groups that\n\n1:14:39.200 --> 1:14:44.320\n could be working and so you could see it scaling to just outside of dragons and kitties it could\n\n1:14:44.320 --> 1:14:50.480\n be you could build like entire ecosystems of software yeah and in the i mean especially in\n\n1:14:50.480 --> 1:14:56.320\n the decentralized finance space that's been popping up the last two years there has been\n\n1:14:56.320 --> 1:15:02.160\n a huge amount of really interesting things happen as a result of this is a particular kind of like\n\n1:15:02.160 --> 1:15:08.080\n financial applications kind of thing yeah i mean there's like stable coins so this is a kind of\n\n1:15:08.480 --> 1:15:16.160\n tokens that retain a value equal to one dollar but they're kind of backed by a crypt uh cryptocurrency\n\n1:15:16.160 --> 1:15:22.640\n um then there's decentralized exchanges um so when as far as the decentralized exchanges goes\n\n1:15:22.640 --> 1:15:29.520\n there's this uh really interesting construction that um has existed for about one and one and a\n\n1:15:29.520 --> 1:15:37.200\n half years now called uniswap so what uniswap is it's a smart contract that holds the balances of\n\n1:15:37.200 --> 1:15:42.720\n two tokens we'll call them token a and token b and it maintains an invariance that the balance\n\n1:15:42.720 --> 1:15:47.680\n of token a multiplied by the balance of token b has to equal the same value and so the way that\n\n1:15:47.680 --> 1:15:53.280\n you trade against the thing is basically like you have this kind of curve you know like x times y\n\n1:15:53.280 --> 1:15:58.800\n equals k and yeah before you trade it's at some points on the curve after you trade you just like\n\n1:15:58.800 --> 1:16:03.520\n pick some different any to any other points on the curve and then whatever the delta x is that's the\n\n1:16:03.520 --> 1:16:08.080\n amount of a tokens you provide whatever the delta y is that's the amount of b tokens you get or vice\n\n1:16:08.080 --> 1:16:14.720\n versa and that's just and then kind of the slope at the current points on the curve kind of is the\n\n1:16:14.720 --> 1:16:24.720\n price um and so that just is the whole thing and that just allows you to have this exchange for\n\n1:16:24.720 --> 1:16:32.800\n tokens and even if there's very few participants and the whole thing is just like so simple and\n\n1:16:32.800 --> 1:16:39.280\n it's just very easy to set up very easy to participate in and it just provides so much value\n\n1:16:39.280 --> 1:16:48.160\n to people so and uh the uh the fundamental the the distributed application infrastructure allows\n\n1:16:48.160 --> 1:16:53.680\n that somehow yes so this is a smart contract meeting this is all a computer program that's\n\n1:16:53.680 --> 1:17:01.040\n just running on ethereum smart contracts too are just fascinating they are okay do you think\n\n1:17:01.040 --> 1:17:06.880\n cryptocurrency may become the main currency in the world one day so where do you think we're headed\n\n1:17:06.880 --> 1:17:14.160\n in terms of the role of currency the structure type of currency in the world i definitely expect\n\n1:17:14.160 --> 1:17:20.560\n um fiat currencies to continue to exist and continue to be strong and i definitely expect\n\n1:17:20.560 --> 1:17:25.040\n kind of fiat currencies to also digitize in their own way over the next couple of decades what's\n\n1:17:25.040 --> 1:17:31.120\n fiat currency by the way oh just like things like us dollars and like dollars and euros and yen and\n\n1:17:31.120 --> 1:17:36.640\n these other things and they're sort of backed by governments yes but i also expect kind of\n\n1:17:36.640 --> 1:17:43.120\n cryptocurrencies to play this kind of important role in just making sure that people always have\n\n1:17:43.120 --> 1:17:51.280\n an alternative if fiat currencies start breaking so like if or if you're in you know some very\n\n1:17:51.280 --> 1:18:00.800\n high inflation place like venice will for example or if uh your country just kind of gets cut off\n\n1:18:01.440 --> 1:18:06.400\n from um cut off from other financial systems because of like something the banks do\n\n1:18:06.400 --> 1:18:13.280\n uh if any kind of if there's even like some major trade disruption or something worse happens then\n\n1:18:14.160 --> 1:18:18.800\n like cryptocurrencies are the sort of thing that just because of their kind of global neutrality\n\n1:18:18.800 --> 1:18:23.600\n they're just kind of always there and you can keep using them it's interesting that you're quite\n\n1:18:23.600 --> 1:18:29.120\n humble about the possibilities of the future of cryptocurrency you don't think there's a possible\n\n1:18:29.120 --> 1:18:38.000\n future where it becomes the main set of currency because it feels like it feels like the centralized\n\n1:18:38.560 --> 1:18:45.920\n control by governments of currency is limiting somehow maybe my naive utopian view of the world\n\n1:18:45.920 --> 1:18:53.920\n it's uh i mean it's definitely very possible uh i mean i think like for cryptocurrencies being\n\n1:18:53.920 --> 1:19:04.080\n the main form of value to kind of work well like you do need to have some much more price stability\n\n1:19:04.080 --> 1:19:08.640\n than they have today and i mean there are now stable coins and there are kind of cryptic\n\n1:19:08.640 --> 1:19:13.520\n cryptocurrencies that try to be more stable than existing things like bitcoin and ether but\n\n1:19:13.520 --> 1:19:19.520\n and that just is to me the kind of the main challenge do you think oh that's do you think\n\n1:19:19.520 --> 1:19:25.280\n that's a characteristic of this just being the early days it's such a young concept the 10 years\n\n1:19:25.280 --> 1:19:31.200\n is nothing in the history of money yeah and i think it's a combination of two things right one\n\n1:19:31.200 --> 1:19:37.520\n is um it's uh uh it's still early days but the other is a kind of more durable any kind of\n\n1:19:37.520 --> 1:19:42.880\n economic problem which is that like demand for currency is volatile right because of like\n\n1:19:43.440 --> 1:19:49.360\n recessions booms changes to technology lots of things and if people's demand for how much\n\n1:19:49.360 --> 1:19:54.640\n currency they want to hold changes and if you have a currency that has a fixed supply\n\n1:19:54.640 --> 1:20:00.400\n then the change in demand has to be entirely expressed as a change in value of the currency\n\n1:20:00.400 --> 1:20:04.960\n and so what that means is that kind of the volatility of demand becomes entirely translated\n\n1:20:04.960 --> 1:20:10.720\n into volatility and ahead of prices of things that dominated in that currency but if you have\n\n1:20:10.720 --> 1:20:15.840\n a currency where instead the supply can change and so the supply can kind of go up when there's\n\n1:20:15.840 --> 1:20:22.000\n more demand then you have the supply and of absorbing more of that volatility and so the\n\n1:20:22.000 --> 1:20:26.640\n price of the currency would absorb less of the volatility on that topic so bitcoin does have a\n\n1:20:26.640 --> 1:20:33.920\n limited supply a specific fixed supply yes uh what's what's the idea and ethereum doesn't but\n\n1:20:33.920 --> 1:20:41.520\n can you clarify just in the comments you just made is ethereum qualify to the kind of currency\n\n1:20:41.520 --> 1:20:46.000\n that you're talking about and being flexible in the supply i mean it's a bit more flexible but\n\n1:20:46.000 --> 1:20:52.800\n kind of the thing that you would really want is something that's kind of specifically flexible\n\n1:20:53.520 --> 1:21:00.560\n in response to how valuable the currency is and and i'd recommend you to look at stable coins\n\n1:21:00.560 --> 1:21:07.840\n as well so like things like die for example it's a new like how you spell that da i and what uh\n\n1:21:07.840 --> 1:21:14.160\n what's stable coins is it a type of cryptocurrency it is a type of cryptocurrency it's um a type of\n\n1:21:14.160 --> 1:21:21.040\n cryptocurrency that's issued by a smart contract one of these ethereum computer programs that um\n\n1:21:21.040 --> 1:21:27.360\n where the smart contract holds a bunch of ether and then it is basically like that people deposit\n\n1:21:27.360 --> 1:21:32.160\n and then it issues die and the reason why people deposit is because they want to kind of go high\n\n1:21:32.160 --> 1:21:37.040\n leverage on their ether and so it kind of pairs these two sets of users one that wants stability\n\n1:21:37.040 --> 1:21:44.480\n and one that kind of wants extra risk together with each other and it basically creates some\n\n1:21:45.520 --> 1:21:52.240\n or gives one set of participants a guarantee that they'll be that they have this asset that can\n\n1:21:52.240 --> 1:21:56.640\n that can be later converted back into ether but and like specifically at kind of the one dollar\n\n1:21:56.640 --> 1:22:03.440\n rate and it has some kind of uh stabilizing network effects yeah it has this yeah it has\n\n1:22:03.440 --> 1:22:08.800\n many kinds of stabilizing mechanisms in it that's fascinating okay this is this world is awesome\n\n1:22:08.800 --> 1:22:14.160\n technically just from a scientific perspective is an awesome world uh that i i often don't see from\n\n1:22:14.160 --> 1:22:21.600\n an outsider's perspective what i often see is kind of uh maybe hype and a little bit if i may say so\n\n1:22:21.600 --> 1:22:28.080\n like charlatanism and you don't often see at least from my outsider's perspective the beautiful\n\n1:22:28.080 --> 1:22:35.920\n science of it and the engineering of it i mean maybe is there a comment you can make of who to\n\n1:22:35.920 --> 1:22:45.040\n follow how to learn about this world without being um interrupted by the charlatans and the hype\n\n1:22:45.040 --> 1:22:51.760\n people in this space i think you do need to just know the specific kind of just people to follow\n\n1:22:51.760 --> 1:22:57.760\n like there's you know there's all the kind of the cryptographers and the researchers and there's\n\n1:22:57.760 --> 1:23:03.840\n just like even just the ethereum research crew like myself you know like dan grad danny justin\n\n1:23:03.840 --> 1:23:11.680\n and of the other people were and then and of the academic cryptographers and like before um\n\n1:23:12.400 --> 1:23:18.080\n this today i was at stanford and stanford has the center for blockchain research and of dan bonet\n\n1:23:18.080 --> 1:23:25.680\n this and really a famous and great cryptographer um was uh running it and there's a lot of other\n\n1:23:25.680 --> 1:23:33.360\n people there and there's people working on zero knowledge proofs for example and um zuko from\n\n1:23:33.360 --> 1:23:41.840\n zcash has one other person that i respect so i think if you follow the technical you crawl along\n\n1:23:41.840 --> 1:23:45.680\n that yeah yeah you just start with the theory group and then look at the academics day bonet\n\n1:23:45.680 --> 1:23:51.520\n and so on and then just cautiously expand the network of people you follow yeah exactly and\n\n1:23:51.520 --> 1:23:57.600\n like if someone seems too too self promotional then just like remove them is there books\n\n1:23:58.320 --> 1:24:03.680\n that are so there's these white papers and we just discussed about about ideas being\n\n1:24:03.680 --> 1:24:08.240\n condensed into really small parts is there books that are emerging that are kind of\n\n1:24:09.200 --> 1:24:15.360\n good uh introductory material so for historical ones and there's like nathaniel popper's digital\n\n1:24:15.360 --> 1:24:20.720\n gold which is just about the history of bitcoin there's like one and then matthew leising announced\n\n1:24:20.720 --> 1:24:26.320\n that there's one about the history of ethereum um for technical ones and there's andreas hansenopoulos\n\n1:24:26.320 --> 1:24:33.360\n is mastering ethereum great so um let me ask you sort of uh sorry to to pull back to the\n\n1:24:35.280 --> 1:24:38.240\n the idea of governments and decentralized currency\n\n1:24:40.800 --> 1:24:46.240\n you know there's a tension between decentralization of currency and the power of nations\n\n1:24:46.240 --> 1:24:53.920\n um the power of governments you um what's your sense about that tension can is there some rule\n\n1:24:53.920 --> 1:25:02.720\n for regulation of currency you yeah is there like is the government the enemy of digital currency\n\n1:25:02.720 --> 1:25:11.120\n of distributed currency or can they be like cautious friends i mean i think like\n\n1:25:11.120 --> 1:25:17.520\n like the one thing that people forget is that it's clearly not entirely an enemy because i think\n\n1:25:18.400 --> 1:25:27.360\n if uh there hadn't been so much government regulation on and if centralized uh issuing\n\n1:25:27.360 --> 1:25:32.880\n centralized digital currencies then i like we'd be seeing things people like google and facebook\n\n1:25:32.880 --> 1:25:37.280\n and twitter just kind of issuing them left and right and then like if that was the case then\n\n1:25:37.280 --> 1:25:41.120\n decentralized currencies would still appeal to some people but they definitely would appeal to\n\n1:25:41.120 --> 1:25:49.600\n less people than today so even in that sense i think it's uh clearly been kind of more of a help\n\n1:25:49.600 --> 1:25:56.240\n just kind of set the stage for the end of the existence as a of the sector in some ways but\n\n1:25:57.040 --> 1:26:03.280\n also and i think some of both you know like there's definitely things that governments\n\n1:26:03.280 --> 1:26:10.240\n and if can do in some cases have done to have hurt the spread of uh and of growth of uh of\n\n1:26:10.240 --> 1:26:17.200\n blockchains there's uh things that they've done to help and they've uh in some cases definitely done\n\n1:26:17.200 --> 1:26:23.440\n a good job of kind of going after fraudulent projects and going after some of the projects\n\n1:26:23.440 --> 1:26:30.160\n that have some of the kind of craziest and most misleading marketing um there's uh also the\n\n1:26:30.160 --> 1:26:35.920\n possibility that governments will end up using blockchains for a lot of different things like\n\n1:26:35.920 --> 1:26:40.320\n you know governments yeah i mean they do a lot more than just regulating right like there's also\n\n1:26:40.960 --> 1:26:49.680\n like they have the kind of identity records and they have kind of like property registries\n\n1:26:49.680 --> 1:26:56.240\n even just their own currency is like secure like lots of different kind of things that they're\n\n1:26:56.240 --> 1:27:02.400\n operating and there's even blockchain applications in a lot of those yeah and they can you know they\n\n1:27:02.400 --> 1:27:08.480\n can leverage technology do a lot of good for our societies it is a little unfortunate that\n\n1:27:08.480 --> 1:27:14.560\n governments often lag behind in terms of their acceptance and leverage of technology if you look\n\n1:27:14.560 --> 1:27:22.160\n at the autonomous vehicle space ai in general they're uh they're a few years behind it'd be\n\n1:27:22.160 --> 1:27:29.280\n nice uh to help them catch up that's a that's that's a always ongoing problem you um met\n\n1:27:29.280 --> 1:27:35.440\n vladimir putin to discuss the centralized currency here you're born in the where were you born\n\n1:27:35.440 --> 1:27:44.320\n columbia it's a city about 115 kilometers south of moscow in russia yes yeah i grew up in moscow\n\n1:27:44.320 --> 1:27:49.360\n i mean that's vladimir putin is a is a central figure in this part of the world so what was\n\n1:27:49.360 --> 1:27:56.240\n that like meeting or meeting him what was that experience like he's taller in photos than in\n\n1:27:56.240 --> 1:28:07.120\n person yeah he's yeah that's right he's 57 i think 58 maybe yeah that's uh unfortunately we\n\n1:28:07.120 --> 1:28:11.920\n didn't actually kind of have too much of a chance to talk to him like i managed to see him for about\n\n1:28:11.920 --> 1:28:17.600\n one minute at the end of this meeting and i did get a chance to see a lot like some of the other\n\n1:28:17.600 --> 1:28:24.240\n end of government ministers and like he recommended some and uh some of them are are actually\n\n1:28:24.240 --> 1:28:30.880\n kind of interested in trying to use um like blockchains to like for various government\n\n1:28:30.880 --> 1:28:36.640\n use cases they kind of limit corruption and other things and i have like it's hard to tell from one\n\n1:28:36.640 --> 1:28:41.360\n conversation kind of what things are genuine and what things are just like oh blockchain is cool\n\n1:28:41.360 --> 1:28:48.640\n let's do blockchain right but you know when i when i listen to like um barack obama talk about\n\n1:28:48.640 --> 1:28:55.680\n artificial intelligence there's certain things i hear where okay so he might not be an expert in\n\n1:28:55.680 --> 1:29:02.160\n ai but he know he like actually studied it carefully enough to think about it like he\n\n1:29:02.160 --> 1:29:08.080\n internally like uh even if he's just reading a wikipedia page like he really thought about what\n\n1:29:08.080 --> 1:29:15.040\n this technology means did you get a sense that uh putin or some of the ministers like thought about\n\n1:29:15.040 --> 1:29:19.680\n blockchain like thought about the fundamentals of technical like understand it intuitively\n\n1:29:19.680 --> 1:29:26.720\n are they too old school to try to grasp it some are old school some are more new school\n\n1:29:26.720 --> 1:29:31.680\n it depends it's it's definitely like depends on who you talk to i mean that's an open question\n\n1:29:31.680 --> 1:29:37.680\n for me with putin because putin has said i don't know i've only talked to him for about one minute\n\n1:29:37.680 --> 1:29:44.720\n so but sometimes you can pick up sort of insights there's a quick comment there they're about maybe\n\n1:29:44.720 --> 1:29:50.960\n you can correct me on this but they're about 3000 cryptocurrencies being actively traded yes uh and\n\n1:29:50.960 --> 1:29:56.080\n ethereum is one of you know a lot of people believe that there will be the the main cryptocurrency i\n\n1:29:56.080 --> 1:30:00.800\n think bitcoin is currently still the main cryptocurrency but ethereum very likely might\n\n1:30:00.800 --> 1:30:07.520\n become that the the main one um is this kind of diversity good in the crypto world do you see it\n\n1:30:07.520 --> 1:30:12.800\n sticking around should there should there be a winner like should there be some consensus globally\n\n1:30:12.800 --> 1:30:18.320\n around uh bitcoin or around ethereum like what's your what's your sense i definitely think the\n\n1:30:18.320 --> 1:30:23.840\n diversity is good and i definitely think also that there's probably too many people trying to\n\n1:30:23.840 --> 1:30:29.040\n make separate blockchains kind of right now the number should definitely be greater than one and\n\n1:30:29.040 --> 1:30:35.280\n probably greater than two or even five um not three thousand not three thousand yeah and also\n\n1:30:35.280 --> 1:30:40.320\n not even like 40 high quality platforms that try to do the same thing i mean there's definitely\n\n1:30:40.320 --> 1:30:48.240\n this range from just like one person who just like wrongly thinks that you can create a cryptocurrency\n\n1:30:48.240 --> 1:30:53.680\n in like 12 hours and uh doesn't even think about kind of the community aspects of maintaining it\n\n1:30:53.680 --> 1:31:01.280\n going to uh people actually trying but only creating a really tiny one to like scammers\n\n1:31:01.280 --> 1:31:09.440\n to people like making something that's actually successful and then there's a lot of different\n\n1:31:09.440 --> 1:31:13.120\n categories of blockchain and you have project in terms of what it's trying to do and what\n\n1:31:13.120 --> 1:31:18.560\n applications it's for um and i think the experimentation is definitely healthy\n\n1:31:18.560 --> 1:31:24.160\n if you look at the two worlds it might be a little bit disjoint but uh the distributed\n\n1:31:24.160 --> 1:31:29.440\n applications cryptocurrency and then the world of artificial intelligence do you see there's some\n\n1:31:29.440 --> 1:31:36.560\n overlap between these worlds that both worry about centralized control is there some overlap that's\n\n1:31:36.560 --> 1:31:42.800\n interesting that you think about do you think about ai much yeah and i think uh definitely\n\n1:31:42.800 --> 1:31:48.640\n i'd have thought about things like in like the ai and if control problems and alignment problems and\n\n1:31:48.640 --> 1:31:52.800\n all of those things do you worry about the existential threat of ai it's definitely one\n\n1:31:52.800 --> 1:32:01.520\n of the things i worry about they think um block there's a lot of uh kind of common challenges\n\n1:32:01.520 --> 1:32:07.600\n because in in both cases what you're ultimately trying to do is you're trying to kind of get a\n\n1:32:07.600 --> 1:32:14.240\n simple system to direct a more complex system like in the case of uh this is drawing ai's the\n\n1:32:14.240 --> 1:32:20.080\n idea would be that the simple system is people and the complex system is well whatever um thing\n\n1:32:20.080 --> 1:32:24.240\n uh the people uh the people end up kind of unleashing on the universe that'll hopefully be\n\n1:32:24.240 --> 1:32:31.920\n a great thing um and in the case of blockchains and of the complex well the simple thing is uh\n\n1:32:32.400 --> 1:32:36.800\n the algorithm which is a piece of static and fully open source code and the more complex thing is\n\n1:32:36.800 --> 1:32:44.640\n just the all of the different possible kind of human actors and the end of the strategy is that\n\n1:32:44.640 --> 1:32:50.960\n they might end up used to participate in the network do you think about your own mortality\n\n1:32:50.960 --> 1:32:56.400\n like what you hope to accomplish in your life oh i definitely i definitely think about ending my\n\n1:32:56.400 --> 1:33:03.440\n own mortality so that's if i gave you the option to live forever would you depends a lot on what\n\n1:33:03.440 --> 1:33:08.720\n the fine birds is but i mean you know if it's one of those things where i'm going to be kind\n\n1:33:08.720 --> 1:33:16.880\n of like floating through empty space for 10 to the 75 years then no if it's uh um forever worth\n\n1:33:16.880 --> 1:33:26.240\n of uh and of having you know fulfilling life with uh and of meaning like with with friends to uh to\n\n1:33:26.240 --> 1:33:32.560\n spend the time with with kind of meaningful challenges to explore and individual interesting\n\n1:33:32.560 --> 1:33:40.000\n things to be working on then i think absolutely move that's uh beautifully put live forever\n\n1:33:40.000 --> 1:33:45.920\n but uh you'd have to check the fine print i think there's no better way to end it vitalik\n\n1:33:45.920 --> 1:33:52.080\n thank you so much for talking to us so exciting to follow your work from a distance and uh thank\n\n1:33:52.080 --> 1:33:56.800\n you for creating a revolutionary idea and sticking with it and building it out and doing some\n\n1:33:56.800 --> 1:34:01.680\n incredible engineering work and thanks for talking today yeah thank you thanks for listening to this\n\n1:34:01.680 --> 1:34:08.640\n conversation with vitalik buterin and thank you to our sponsors express vpn and masterclass please\n\n1:34:08.640 --> 1:34:14.720\n consider supporting the podcast by signing up to masterclass at masterclass.com slash lex\n\n1:34:14.720 --> 1:34:23.120\n and getting express vpn at express vpn.com slash lex pod if you enjoy this podcast subscribe on\n\n1:34:23.120 --> 1:34:28.800\n youtube review it with five stars on apple podcast support it on patreon or simply connect with me on\n\n1:34:28.800 --> 1:34:36.240\n twitter at lex friedman and now let me leave you with some words from vitalik buterin the thing\n\n1:34:36.240 --> 1:34:43.200\n that i often ask startups on top of ethereum is can you please tell me why using ethereum blockchain\n\n1:34:43.200 --> 1:34:48.880\n is better than using excel and if they can come up with a good answer that's when you know you've\n\n1:34:48.880 --> 1:35:02.720\n got something really interesting thank you for listening and hope to see you next time\n\n"
}