{
  "title": "Richard Dawkins: Evolution, Intelligence, Simulation, and Memes | Lex Fridman Podcast #87",
  "id": "5f-JlzBuUUU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:03.120\n The following is a conversation with Richard Dawkins,\n\n00:03.120 --> 00:07.040\n an evolutionary biologist and author of The Selfish Gene,\n\n00:07.040 --> 00:11.040\n The Blind Watchmaker, The God Delusion, The Magic of Reality,\n\n00:11.040 --> 00:15.680\n and The Greatest Show of Earth and his latest All Growing God.\n\n00:15.680 --> 00:21.680\n He is the originator and popularizer of a lot of fascinating ideas in evolutionary biology\n\n00:21.680 --> 00:26.320\n and science in general, including, funny enough, the introduction of the word\n\n00:26.320 --> 00:32.960\n meme in his 1976 book, The Selfish Gene, which, in the context of a gene centered view of evolution,\n\n00:32.960 --> 00:39.280\n is an exceptionally powerful idea. He's outspoken, bold, and often fearless in the\n\n00:39.280 --> 00:45.040\n defense of science and reason, and in this way, is one of the most influential thinkers of our time.\n\n00:46.800 --> 00:50.320\n This conversation was recorded before the outbreak of the pandemic.\n\n00:50.320 --> 00:54.480\n For everyone feeling the medical, psychological, and financial burden of this crisis,\n\n00:54.480 --> 00:59.760\n I'm sending love your way. Stay strong. We're in this together. We'll beat this thing.\n\n01:00.800 --> 01:05.280\n This is the Artificial Intelligence Podcast. If you enjoy it, subscribe on YouTube,\n\n01:05.280 --> 01:10.800\n review it with 5 stars on Apple Podcast, support it on Patreon, or simply connect with me on Twitter\n\n01:10.800 --> 01:16.720\n at Lex Friedman, spelled F R I D M A N. As usual, I'll do a few minutes of ads now,\n\n01:16.720 --> 01:20.480\n and never any ads in the middle that can break the flow of the conversation.\n\n01:20.480 --> 01:25.360\n I hope that works for you and doesn't hurt the listening experience.\n\n01:25.360 --> 01:29.600\n This show is presented by Cash App, the number one finance app in the App Store.\n\n01:29.600 --> 01:34.720\n When you get it, use code LEX PODCAST. Cash App lets you send money to friends,\n\n01:34.720 --> 01:38.560\n buy bitcoin, and invest in the stock market with as little as one dollar.\n\n01:39.120 --> 01:43.120\n Since Cash App allows you to send and receive money digitally, peer to peer,\n\n01:43.120 --> 01:48.080\n security in all digital transactions is very important. Let me mention the PCI\n\n01:48.080 --> 01:53.520\n data security standard that Cash App is compliant with. I'm a big fan of standards for safety and\n\n01:53.520 --> 02:00.240\n security. PCI DSS is a good example of that, where a bunch of competitors got together and agreed\n\n02:00.240 --> 02:03.840\n that there needs to be a global standard around the security of transactions.\n\n02:04.400 --> 02:08.960\n Now we just need to do the same for autonomous vehicles and artificial intelligence systems in\n\n02:08.960 --> 02:14.560\n general. So again, if you get Cash App from the App Store or Google Play and use the code LEX\n\n02:14.560 --> 02:19.360\n PODCAST, you get ten dollars and Cash App will also donate ten dollars to FIRST,\n\n02:19.360 --> 02:23.840\n an organization that is helping to advance robotics and STEM education for young people\n\n02:23.840 --> 02:29.760\n around the world. And now, here's my conversation with Richard Dawkins.\n\n02:30.960 --> 02:33.520\n Do you think there's intelligent life out there in the universe?\n\n02:34.640 --> 02:40.000\n Well, if we accept that there's intelligent life here and we accept that the number of planets in\n\n02:40.000 --> 02:45.600\n the universe is gigantic, I mean, 10 to the 22 stars has been estimated, it seems to me highly\n\n02:45.600 --> 02:51.760\n likely that there is not only life in the universe elsewhere, but also intelligent life. If you deny\n\n02:51.760 --> 02:55.600\n that, then you're committed to the view that the things that happened on this planet are\n\n02:55.600 --> 03:02.080\n staggeringly improbable, I mean, ludicrously off the charts improbable. And I don't think it's that\n\n03:02.080 --> 03:06.480\n improbable. Certainly the origin of life itself, there are really two steps, the origin of life,\n\n03:06.480 --> 03:11.520\n which is probably fairly improbable, and then the subsequent evolution to intelligent life,\n\n03:11.520 --> 03:15.360\n which is also fairly improbable. So the juxtaposition of those two, you could say,\n\n03:15.360 --> 03:20.960\n is pretty improbable, but not 10 to the 22 improbable. It's an interesting question,\n\n03:20.960 --> 03:25.200\n maybe you're coming on to it, how we would recognize intelligence from outer space if we\n\n03:25.840 --> 03:30.640\n encountered it. The most likely way we would come across them would be by radio. It's highly\n\n03:30.640 --> 03:38.240\n unlikely they'd ever visit us. But it's not that unlikely that we would pick up radio signals,\n\n03:38.880 --> 03:42.960\n and then we would have to have some means of deciding that it was intelligent.\n\n03:44.800 --> 03:50.000\n People involved in the SETI program discuss how they would do it, and things like prime numbers\n\n03:50.000 --> 03:56.800\n would be an obvious way for them to broadcast, to say, we are intelligent, we are here.\n\n03:56.800 --> 03:59.440\n I suspect it probably would be obvious, actually.\n\n03:59.440 --> 04:03.920\n Well, that's interesting, prime numbers, so the mathematical patterns, it's an open question\n\n04:03.920 --> 04:10.000\n whether mathematics is the same for us as it would be for aliens. I suppose we could assume\n\n04:10.720 --> 04:15.680\n that ultimately, if we're governed by the same laws of physics, then we should be governed by\n\n04:15.680 --> 04:17.040\n the same laws of mathematics.\n\n04:17.040 --> 04:22.160\n I think so. I suspect that they will have Pythagoras theorem, etc. I don't think their\n\n04:22.160 --> 04:23.680\n mathematics will be that different.\n\n04:23.680 --> 04:27.760\n Do you think evolution would also be a force on the alien planets as well?\n\n04:27.760 --> 04:33.440\n I stuck my neck out and said that if ever that we do discover life elsewhere, it will be Darwinian\n\n04:33.440 --> 04:41.120\n life, in the sense that it will work by some kind of natural selection, the nonrandom survival of\n\n04:41.120 --> 04:47.040\n randomly generated codes. It doesn't mean that the genetic, it would have to have some kind of\n\n04:47.040 --> 04:51.200\n genetics, but it doesn't have to be DNA genetics, probably wouldn't be actually.\n\n04:51.200 --> 04:53.840\n But I think it would have to be Darwinian, yes.\n\n04:53.840 --> 04:55.760\n So some kind of selection process.\n\n04:56.720 --> 04:59.280\n Yes, in the general sense, it would be Darwinian.\n\n05:00.320 --> 05:05.840\n So let me ask kind of an artificial intelligence engineering question. So you've been an\n\n05:05.840 --> 05:11.200\n outspoken critic of, I guess, what could be called intelligent design, which is an attempt\n\n05:11.200 --> 05:16.400\n to describe the creation of a human mind and body by some religious folks, religious folks\n\n05:16.400 --> 05:23.120\n used to describe. So broadly speaking, evolution is, as far as I know, again, you can correct me,\n\n05:23.120 --> 05:27.600\n is the only scientific theory we have for the development of intelligent life. Like there's no\n\n05:27.600 --> 05:30.240\n alternative theory, as far as I understand.\n\n05:30.240 --> 05:33.600\n None has ever been suggested, and I suspect it never will be.\n\n05:35.520 --> 05:39.280\n Well, of course, whenever somebody says that, a hundred years later.\n\n05:39.280 --> 05:42.240\n I know. It's a risk.\n\n05:42.240 --> 05:43.040\n It's a risk.\n\n05:43.040 --> 05:48.880\n It's a risk. But what a bet. I mean, I'm pretty confident.\n\n05:48.880 --> 05:53.760\n But it would look, sorry, yes, it would probably look very similar, but it's almost like Einstein\n\n05:53.760 --> 05:59.840\n general relativity versus Newtonian physics. It'll be maybe an alteration of the theory or\n\n05:59.840 --> 06:02.720\n something like that, but it won't be fundamentally different. But okay.\n\n06:06.320 --> 06:11.040\n So now for the past 70 years, even before the AI community has been trying to engineer\n\n06:11.040 --> 06:18.000\n intelligence, in a sense, to do what intelligent design says, you know, was done here on earth.\n\n06:18.720 --> 06:26.000\n What's your intuition? Do you think it's possible to build intelligence, to build computers that\n\n06:26.000 --> 06:31.200\n are intelligent, or do we need to do something like the evolutionary process? Like there's\n\n06:31.200 --> 06:32.320\n no shortcuts here.\n\n06:33.360 --> 06:38.960\n That's an interesting question. I'm committed to the belief that is ultimately possible\n\n06:38.960 --> 06:43.520\n because I think there's nothing nonphysical in our brains. I think our brains work by\n\n06:44.160 --> 06:49.280\n the laws of physics. And so it must, in principle, it'd be possible to replicate that.\n\n06:49.280 --> 06:54.480\n In practice, though, it might be very difficult. And as you suggest, it may be the only way\n\n06:54.480 --> 06:59.280\n to do it is by something like an evolutionary process. I'd be surprised. I suspect that\n\n06:59.280 --> 07:05.040\n it will come, but it's certainly been slower in coming than some of the early pioneers\n\n07:05.040 --> 07:06.240\n thought it would be.\n\n07:06.240 --> 07:12.160\n Yeah. But in your sense, is the evolutionary process efficient? So you can see it as exceptionally\n\n07:12.160 --> 07:17.120\n wasteful in one perspective, but at the same time, maybe that is the only path.\n\n07:17.120 --> 07:22.320\n It's a paradox, isn't it? I mean, on the one side, it is deplorably wasteful. It's\n\n07:22.320 --> 07:26.880\n fundamentally based on waste. On the other hand, it does produce magnificent results.\n\n07:26.880 --> 07:38.320\n I mean, the design of a soaring bird, an albatross, a vulture, an eagle, is superb. An engineer\n\n07:38.320 --> 07:41.200\n would be proud to have done it. On the other hand, an engineer would not be proud to have\n\n07:41.200 --> 07:46.800\n done some of the other things that evolution has served up. Some of the sort of botched\n\n07:46.800 --> 07:51.600\n jobs that you can easily understand because of their historical origins, but they don't\n\n07:51.600 --> 07:52.560\n look well designed.\n\n07:52.560 --> 07:55.680\n Do you have examples of bad design?\n\n07:55.680 --> 07:59.600\n My favorite example is the recurrent laryngeal nerve. I've used this many times. This is\n\n07:59.600 --> 08:04.880\n a nerve. It's one of the cranial nerves, which goes from the brain, and the end organ is\n\n08:04.880 --> 08:10.160\n that it supplies is the voice box, the larynx. But it doesn't go straight to the larynx.\n\n08:10.160 --> 08:15.520\n It goes right down into the chest and then loops around an artery in the chest and then\n\n08:15.520 --> 08:21.040\n comes straight back up again to the larynx. And I've assisted in the dissection of a\n\n08:21.040 --> 08:27.120\n giraffe's neck, which happened to have died in a zoo. And we saw the recurrent laryngeal\n\n08:27.120 --> 08:32.880\n nerve whizzing straight past the larynx, within an inch of the larynx, down into the chest,\n\n08:32.880 --> 08:41.120\n and then back up again, which is a detour of many feet. Very, very inefficient.\n\n08:41.120 --> 08:46.880\n The reason is historical. The ancestors are fish ancestors, the ancestors of all mammals\n\n08:46.880 --> 08:54.560\n and fish. The most direct pathway of that, of the equivalent of that nerve, there wasn't\n\n08:54.560 --> 08:59.840\n a larynx in those days, but it innervated part of the gills. The most direct pathway\n\n08:59.840 --> 09:06.240\n was behind that artery. And then when the mammal, when the tetrapods, when the land\n\n09:06.240 --> 09:12.640\n vertebrae started evolving, and then the neck started to stretch, the marginal cost of changing\n\n09:12.640 --> 09:17.920\n the embryological design to jump that nerve over the artery was too great. Or rather,\n\n09:19.680 --> 09:24.880\n each step of the way was a very small cost, but the cost of actually jumping it over would have\n\n09:24.880 --> 09:31.680\n been very large. As the neck lengthened, it was a negligible change to just increase the length of\n\n09:31.680 --> 09:35.120\n the detour a tiny bit, a tiny bit, a tiny bit, each millimeter at a time, didn't make any difference.\n\n09:35.920 --> 09:40.960\n But finally, when you get to a giraffe, it's a huge detour and no doubt is very inefficient.\n\n09:40.960 --> 09:47.600\n Now that's bad design. Any engineer would reject that piece of design. It's ridiculous.\n\n09:47.600 --> 09:52.000\n And there are quite a number of examples, as you'd expect. It's not surprising that we find\n\n09:52.000 --> 09:55.840\n examples of that sort. In a way, what's surprising is there aren't more of them. In a way, what's\n\n09:55.840 --> 10:01.200\n surprising is that the design of living things is so good. So natural selection manages to achieve\n\n10:01.200 --> 10:11.600\n excellent results, partly by tinkering, partly by coming along and cleaning up initial mistakes and,\n\n10:11.600 --> 10:17.040\n as it were, making the best of a bad job. That's really interesting. I mean, it is surprising and\n\n10:17.040 --> 10:22.880\n beautiful and it's a mystery from an engineering perspective that so many things are well designed.\n\n10:22.880 --> 10:30.240\n I suppose the thing we're forgetting is how many generations have to die for that.\n\n10:30.240 --> 10:33.360\n That's the inefficiency of it. Yes, that's the horrible wastefulness of it.\n\n10:33.360 --> 10:38.240\n So yeah, we marvel at the final product, but yeah, the process is painful.\n\n10:39.600 --> 10:45.600\n Elon Musk describes human beings as potentially what he calls the biological bootloader for\n\n10:45.600 --> 10:50.720\n artificial intelligence or artificial general intelligence is used as the term. It's kind of\n\n10:50.720 --> 10:57.520\n like super intelligence. Do you see superhuman level intelligence as potentially the next step\n\n10:57.520 --> 11:02.080\n in the evolutionary process? Yes, I think that if superhuman intelligence is to be found,\n\n11:02.080 --> 11:07.280\n it will be artificial. I don't have any hope that we ourselves, our brains will go on\n\n11:09.200 --> 11:16.560\n getting larger in ordinary biological evolution. I think that's probably come to an end. It is\n\n11:16.560 --> 11:22.720\n the dominant trend or one of the dominant trends in our fossil history for the last two or three\n\n11:22.720 --> 11:28.960\n million years. Brain size? Brain size, yes. So it's been swelling rather dramatically over the last\n\n11:28.960 --> 11:35.040\n two or three million years. That is unlikely to continue. The only way that happens is because\n\n11:35.040 --> 11:41.840\n natural selection favors those individuals with the biggest brains and that's not happening anymore.\n\n11:41.840 --> 11:48.400\n Right. So in general, in humans, the selection pressures are not, I mean, are they active in\n\n11:48.400 --> 11:56.080\n any form? Well, in order for them to be active, it would be necessary that the most, let's call it\n\n11:56.080 --> 12:02.240\n intelligence. Not that intelligence is simply correlated with brain size, but let's talk about\n\n12:02.240 --> 12:08.000\n intelligence. In order for that to evolve, it's necessary that the most intelligent beings have\n\n12:08.000 --> 12:17.200\n the most, individuals have the most children. And so intelligence may buy you money, it may buy you\n\n12:17.200 --> 12:22.240\n worldly success, it may buy you a nice house and a nice car and things like that if you have a\n\n12:22.240 --> 12:29.760\n successful career. It may buy you the admiration of your fellow people, but it doesn't increase the\n\n12:29.760 --> 12:35.440\n number of offspring that you have. It doesn't increase your genetic legacy to the next generation.\n\n12:35.440 --> 12:42.000\n On the other hand, artificial intelligence, I mean, computers and technology generally, is\n\n12:42.000 --> 12:48.880\n is evolving by a non genetic means, by leaps and bounds, of course. And so what do you think,\n\n12:48.880 --> 12:52.560\n I don't know if you're familiar, there's a company called Neuralink, but there's a general effort of\n\n12:52.560 --> 12:59.360\n brain computer interfaces, which is to try to build a connection between the computer and the brain\n\n12:59.360 --> 13:05.840\n to send signals both directions. And the long term dream there is to do exactly that, which is expand,\n\n13:05.840 --> 13:12.000\n I guess, expand the size of the brain, expand the capabilities of the brain. Do you see this as\n\n13:12.000 --> 13:18.000\n interesting? Do you see this as a promising possible technology? Or is the interface between\n\n13:18.000 --> 13:22.320\n the computer and the brain, like the brain is this wet, messy thing that's just impossible to\n\n13:22.320 --> 13:27.200\n interface with? Well, of course, it's interesting, whether it's promising, I'm really not qualified\n\n13:27.200 --> 13:34.320\n to say. What I do find puzzling is that the brain being as small as it is compared to a computer and\n\n13:34.320 --> 13:40.240\n the individual components being as slow as they are compared to our electronic components,\n\n13:40.240 --> 13:47.840\n it is astonishing what it can do. I mean, imagine building a computer that fits into the size of a\n\n13:47.840 --> 13:57.760\n human skull. And with the equivalent of transistors or integrated circuits, which work as slowly as\n\n13:57.760 --> 14:04.960\n neurons do. It's something mysterious about that, something, something must be going on that we\n\n14:04.960 --> 14:11.200\n don't understand. So I have just talked to Roger Penrose, I'm not sure you're familiar with his\n\n14:11.200 --> 14:20.640\n work. And he also describes this kind of mystery in the mind, in the brain, that as he sees a\n\n14:20.640 --> 14:27.120\n materialist, so there's no sort of mystical thing going on. But there's so much about the material\n\n14:27.120 --> 14:32.800\n of the brain that we don't understand. That might be quantum mechanical in nature and so on. So\n\n14:32.800 --> 14:37.760\n there the idea is about consciousness. Do you have any, have you ever thought about, do you ever\n\n14:37.760 --> 14:42.800\n think about ideas of consciousness or a little bit more about the mystery of intelligence and\n\n14:42.800 --> 14:48.000\n consciousness that seems to pop up just like you're saying from our brain? I agree with Roger\n\n14:48.000 --> 14:55.600\n Penrose that there is a mystery there. I mean, he's one of the world's greatest physicists. I\n\n14:55.600 --> 15:00.800\n can't possibly argue with his... But nobody knows anything about consciousness. And in fact,\n\n15:02.320 --> 15:10.720\n if we talk about religion and so on, the mystery of consciousness is so awe inspiring and we know\n\n15:10.720 --> 15:16.240\n so little about it that the leap to sort of religious or mystical explanations is too easy\n\n15:16.240 --> 15:21.360\n to make. I think that it's just an act of cowardice to leap to religious explanations and\n\n15:21.360 --> 15:28.400\n Roger doesn't do that, of course. But I accept that there may be something that we don't understand\n\n15:28.400 --> 15:34.480\n about it. So correct me if I'm wrong, but in your book, Selfish Gene, the gene centered view of\n\n15:34.480 --> 15:40.160\n evolution allows us to think of the physical organisms as just the medium through which the\n\n15:40.160 --> 15:49.760\n software of our genetics and the ideas sort of propagate. So maybe can we start just with the\n\n15:49.760 --> 15:57.840\n basics? What in this context does the word meme mean? It would mean the cultural equivalent of a\n\n15:57.840 --> 16:02.960\n gene, cultural equivalent in the sense of that which plays the same role as the gene in the\n\n16:02.960 --> 16:08.720\n transmission of culture and the transmission of ideas in the broadest sense. And it's a\n\n16:08.720 --> 16:13.840\n useful word if there's something Darwinian going on. Obviously, culture is transmitted,\n\n16:14.560 --> 16:18.960\n but is there anything Darwinian going on? And if there is, that means there has to be something\n\n16:18.960 --> 16:25.680\n like a gene, which becomes more numerous or less numerous in the population.\n\n16:25.680 --> 16:27.600\n So it can replicate?\n\n16:27.600 --> 16:31.040\n It can replicate. Well, it clearly does replicate. There's no question about that.\n\n16:31.760 --> 16:36.800\n The question is, does it replicate in a sort of differential way in a Darwinian fashion? Could you\n\n16:36.800 --> 16:43.280\n say that certain ideas propagate because they're successful in the meme pool? In a sort of trivial\n\n16:43.280 --> 16:52.160\n sense, you can. Would you wish to say, though, that in the same way as an animal body is modified,\n\n16:52.160 --> 16:59.200\n adapted to serve as a machine for propagating genes, is it also a machine for propagating memes?\n\n16:59.200 --> 17:05.280\n Could you actually say that something about the way a human is, is modified, adapted,\n\n17:05.280 --> 17:12.480\n is modified, adapted for the function of meme propagation?\n\n17:12.480 --> 17:18.480\n That's such a fascinating possibility, if that's true. That it's not just about the genes which\n\n17:18.480 --> 17:28.240\n seem somehow more comprehensible as these things of biology. The idea that culture or maybe ideas,\n\n17:28.240 --> 17:33.360\n you can really broadly define it, operates under these mechanisms.\n\n17:33.360 --> 17:40.560\n Even morphology, even anatomy does evolve by memetic means. I mean, things like hairstyles,\n\n17:42.720 --> 17:49.840\n styles of makeup, circumcision, these things are actual changes in the body form which are\n\n17:49.840 --> 17:57.760\n nongenetic and which get passed on from generation to generation or sideways like a virus in a\n\n17:57.760 --> 17:59.280\n quasi genetic way.\n\n17:59.280 --> 18:05.520\n But the moment you start drifting away from the physical, it becomes interesting because\n\n18:05.520 --> 18:09.520\n the space of ideas, ideologies, political systems.\n\n18:09.520 --> 18:10.480\n Of course, yes.\n\n18:10.480 --> 18:19.520\n So what's your sense? Are memes a metaphor more or are they really,\n\n18:20.160 --> 18:24.160\n is there something fundamental, almost physical presence of memes?\n\n18:24.160 --> 18:29.440\n Well, I think they're a bit more than a metaphor. And I mentioned the physical\n\n18:30.720 --> 18:35.120\n bodily characteristics which are a bit trivial in a way, but when things like the propagation\n\n18:35.120 --> 18:42.960\n of religious ideas, both longitudinally down generations and transversely as in a sort of\n\n18:42.960 --> 18:54.640\n epidemiology of ideas, when a charismatic preacher converts people, that resembles viral\n\n18:54.640 --> 19:01.360\n transmission. Whereas the longitudinal transmission from grandparent to parent to child,\n\n19:01.360 --> 19:06.320\n et cetera, is more like conventional genetic transmission.\n\n19:06.960 --> 19:12.240\n That's such a beautiful, especially in the modern day idea. Do you think about this\n\n19:12.240 --> 19:17.280\n implication in social networks where the propagation of ideas, the viral propagation of ideas,\n\n19:17.280 --> 19:21.520\n and has the new use of the word meme to describe?\n\n19:21.520 --> 19:27.600\n Well, the internet, of course, provides extremely rapid method of transmission.\n\n19:27.600 --> 19:32.320\n Before, when I first coined the word, the internet didn't exist. And so I was thinking\n\n19:32.320 --> 19:38.960\n that in terms of books, newspapers, broader radio, television, that kind of thing.\n\n19:38.960 --> 19:47.360\n Now an idea can just leap around the world in all directions instantly. And so the internet\n\n19:47.360 --> 19:54.560\n provides a step change in the facility of propagation of memes.\n\n19:54.560 --> 20:00.160\n How does that make you feel? Isn't it fascinating that sort of ideas, it's like you have Galapagos\n\n20:00.160 --> 20:05.760\n Islands or something, it's the 70s, and the internet allowed all these species to just\n\n20:05.760 --> 20:11.760\n like globalize. And in a matter of seconds, you can spread the message to millions of\n\n20:11.760 --> 20:21.360\n people. And these ideas, these memes can breed, can evolve, can mutate. And there's a selection,\n\n20:21.360 --> 20:26.240\n and there's like different, I guess, groups that have all like, there's a dynamics that's\n\n20:26.240 --> 20:31.840\n fascinating here. Do you think, yes, basically, do you think your work in this direction,\n\n20:31.840 --> 20:37.920\n while fundamentally was focused on life on Earth, do you think it should continue, like\n\n20:37.920 --> 20:38.920\n to be taken further?\n\n20:38.920 --> 20:43.200\n Well, I do think it would probably be a good idea to think in a Darwinian way about this\n\n20:43.200 --> 20:49.680\n sort of thing. We conventionally think of the transmission of ideas from an evolutionary\n\n20:49.680 --> 20:58.240\n context as being limited to, in our ancestors, people living in villages, living in small\n\n20:58.240 --> 21:03.120\n bands where everybody knew each other, and ideas could propagate within the village,\n\n21:03.120 --> 21:08.400\n and they might hop to a neighboring village, occasionally, and maybe even to a neighboring\n\n21:08.400 --> 21:15.760\n continent eventually. And that was a slow process. Nowadays, villages are international.\n\n21:15.760 --> 21:22.600\n I mean, you have people, it's been called echo chambers, where people are in a sort\n\n21:22.600 --> 21:28.560\n of internet village, where the other members of the village may be geographically distributed\n\n21:28.560 --> 21:32.080\n all over the world, but they just happen to be interested in the same things, use the\n\n21:32.080 --> 21:38.440\n same terminology, the same jargon, have the same enthusiasm. So, people like the Flat\n\n21:38.440 --> 21:44.080\n Earth Society, they don't all live in one place, they find each other, and they talk\n\n21:44.080 --> 21:48.680\n the same language to each other, they talk the same nonsense to each other. And they,\n\n21:48.680 --> 21:56.040\n so this is a kind of distributed version of the primitive idea of people living in villages\n\n21:56.040 --> 21:58.760\n and propagating their ideas in a local way.\n\n21:58.760 --> 22:06.320\n Is there Darwinist parallel here? So, is there evolutionary purpose of villages, or is that\n\n22:06.320 --> 22:07.320\n just a...\n\n22:07.320 --> 22:12.400\n I wouldn't use a word like evolutionary purpose in that case, but villages will be something\n\n22:12.400 --> 22:16.200\n that just emerged, that's the way people happen to live.\n\n22:16.200 --> 22:23.520\n And in just the same kind of way, the Flat Earth Society, societies of ideas emerge in\n\n22:23.520 --> 22:26.040\n the same kind of way in this digital space.\n\n22:26.040 --> 22:27.040\n Yes, yes.\n\n22:27.040 --> 22:35.160\n Is there something interesting to say about the, I guess, from a perspective of Darwin,\n\n22:35.160 --> 22:43.520\n could we fully interpret the dynamics of social interaction in these social networks? Or is\n\n22:43.520 --> 22:49.360\n there some much more complicated thing need to be developed? Like, what's your sense?\n\n22:49.360 --> 22:55.920\n Well, a Darwinian selection idea would involve investigating which ideas spread and which\n\n22:55.920 --> 23:03.840\n don't. So, some ideas don't have the ability to spread. I mean, the Flat Earth, Flat Earthism\n\n23:03.840 --> 23:07.680\n is, there are a few people believe in it, but it's not going to spread because it's\n\n23:07.680 --> 23:14.600\n obvious nonsense. But other ideas, even if they are wrong, can spread because they are\n\n23:14.600 --> 23:16.600\n attractive in some sense.\n\n23:16.600 --> 23:24.160\n So the spreading and the selection in the Darwinian context is, it just has to be attractive\n\n23:24.160 --> 23:27.840\n in some sense. Like we don't have to define, like it doesn't have to be attractive in the\n\n23:27.840 --> 23:32.520\n way that animals attract each other. It could be attractive in some other way.\n\n23:32.520 --> 23:38.320\n Yes. All that matters is, all that is needed is that it should spread. And it doesn't have\n\n23:38.320 --> 23:43.760\n to be true to spread. In truth, there's one criterion which might help an idea to spread.\n\n23:43.760 --> 23:49.520\n But there are other criteria which might help it to spread. As you say, attraction in animals\n\n23:49.520 --> 23:56.320\n is not necessarily valuable for survival. The famous peacock's tail doesn't help the\n\n23:56.320 --> 24:02.560\n peacock to survive. It helps it to pass on its genes. Similarly, an idea which is actually\n\n24:02.560 --> 24:08.040\n rubbish, but which people don't know is rubbish and think is very attractive will spread in\n\n24:08.040 --> 24:10.360\n the same way as a peacock's gene spread.\n\n24:10.360 --> 24:16.080\n It's a small sidestep. I remember reading somewhere, I think recently, that in some\n\n24:16.080 --> 24:22.840\n species of birds, sort of the idea that beauty may have its own purpose and the idea that\n\n24:22.840 --> 24:31.480\n some birds, I'm being ineloquent here, but there's some aspects of their feathers and\n\n24:31.480 --> 24:37.600\n so on that serve no evolutionary purpose whatsoever. There's somebody making an argument that there\n\n24:37.600 --> 24:44.560\n are some things about beauty that animals do that may be its own purpose. Does that\n\n24:44.560 --> 24:46.880\n ring a bell for you? Does that sound ridiculous?\n\n24:46.880 --> 24:56.640\n I think it's a rather distorted bell. Darwin, when he coined the phrase sexual selection,\n\n24:56.640 --> 25:04.560\n didn't feel the need to suggest that what was attractive to females, usually is males\n\n25:04.560 --> 25:08.720\n attracting females, that what females found attractive had to be useful. He said it didn't\n\n25:08.720 --> 25:13.960\n have to be useful. It was enough that females found it attractive. And so it could be completely\n\n25:13.960 --> 25:18.080\n useless, probably was completely useless in the conventional sense, but was not at all\n\n25:18.080 --> 25:24.000\n useless in the sense of passing on, Darwin didn't call them genes, but in the sense of\n\n25:24.000 --> 25:30.560\n reproducing. Others, starting with Wallace, the co discoverer of natural selection, didn't\n\n25:30.560 --> 25:37.320\n like that idea and they wanted sexually selected characteristics like peacock's tails to be\n\n25:37.320 --> 25:41.920\n in some sense useful. It's a bit of a stretch to think of a peacock's tail as being useful,\n\n25:41.920 --> 25:47.880\n but in the sense of survival, but others have run with that idea and have brought it up\n\n25:47.880 --> 25:53.560\n to date. And so there are two schools of thought on sexual selection, which are still active\n\n25:53.560 --> 25:58.720\n and about equally supported now. Those who follow Darwin in thinking that it's just enough\n\n25:58.720 --> 26:06.120\n to say it's attractive and those who follow Wallace and say that it has to be in some\n\n26:06.120 --> 26:08.440\n sense useful.\n\n26:08.440 --> 26:10.600\n Do you fall into one category or the other?\n\n26:10.600 --> 26:16.400\n No, I'm open minded. I think they both could be correct in different cases. I mean, they've\n\n26:16.400 --> 26:20.760\n both been made sophisticated in a mathematical sense, more so than when Darwin and Wallace\n\n26:20.760 --> 26:22.560\n first started talking about it.\n\n26:22.560 --> 26:30.120\n I'm Russian, I romanticize things, so I prefer the former, where the beauty in itself is\n\n26:30.120 --> 26:40.120\n a powerful attraction, is a powerful force in evolution. On religion, do you think there\n\n26:40.120 --> 26:47.520\n will ever be a time in our future where almost nobody believes in God, or God is not a part\n\n26:47.520 --> 26:49.680\n of the moral fabric of our society?\n\n26:49.680 --> 26:55.200\n Yes, I do. I think it may happen after a very long time. It may take a long time for that\n\n26:55.200 --> 26:56.200\n to happen.\n\n26:56.200 --> 27:03.960\n So do you think ultimately for everybody on Earth, religion, other forms of doctrines,\n\n27:03.960 --> 27:07.880\n ideas could do better job than what religion does?\n\n27:07.880 --> 27:12.480\n Yes. I mean, following in truth, reason.\n\n27:12.480 --> 27:23.520\n Well, truth is a funny, funny word. And reason too. There's, yeah, it's a difficult idea\n\n27:23.520 --> 27:29.960\n now with truth on the internet, right, and fake news and so on. I suppose when you say\n\n27:29.960 --> 27:37.200\n reason, you mean the very basic sort of inarguable conclusions of science versus which political\n\n27:37.200 --> 27:38.200\n system is better.\n\n27:38.200 --> 27:46.680\n Yes, yes. I mean, truth about the real world, which is ascertainable by, not just by the\n\n27:46.680 --> 27:51.320\n more rigorous methods of science, but by just ordinary sensory observation.\n\n27:51.320 --> 27:58.520\n So do you think there will ever be a time when we move past it? Like, I guess another\n\n27:58.520 --> 28:08.760\n way to ask it, are we hopelessly, fundamentally tied to religion in the way our society functions?\n\n28:08.760 --> 28:14.600\n Well, clearly all individuals are not hopelessly tied to it because many individuals don't\n\n28:14.600 --> 28:21.960\n believe. You could mean something like society needs religion in order to function properly,\n\n28:21.960 --> 28:24.160\n something like that. And some people have suggested that.\n\n28:24.160 --> 28:26.120\n What's your intuition on that?\n\n28:26.120 --> 28:33.720\n Well, I've read books on it and they're persuasive. I don't think they're that persuasive though.\n\n28:33.720 --> 28:41.400\n I mean, some people suggested that society needs a sort of figurehead, which can be a\n\n28:41.400 --> 28:45.480\n non existent figurehead in order to function properly. I think there's something rather\n\n28:45.480 --> 28:51.200\n patronising about the idea that, well, you and I are intelligent enough not to believe\n\n28:51.200 --> 28:57.320\n in God, but the plebs need it sort of thing. And I think that's patronising. And I'd like\n\n28:57.320 --> 29:01.400\n to think that that was not the right way to proceed.\n\n29:01.400 --> 29:10.720\n But at the individual level, do you think there's some value of spirituality? Sort of,\n\n29:10.720 --> 29:15.120\n if I think sort of as a scientist, the amount of things we actually know about our universe\n\n29:15.120 --> 29:21.600\n is a tiny, tiny, tiny percentage of what we could possibly know. So just from everything,\n\n29:21.600 --> 29:25.680\n even the certainty we have about the laws of physics, it seems to be that there's yet\n\n29:25.680 --> 29:32.240\n a huge amount to discover. And therefore we're sitting where 99.99% of things are just still\n\n29:32.240 --> 29:38.120\n shrouded in mystery. Do you think there's a role in a kind of spiritual view of that,\n\n29:38.120 --> 29:39.720\n sort of a humbled spiritual view?\n\n29:39.720 --> 29:43.960\n I think it's right to be humble. I think it's right to admit that there's a lot we don't\n\n29:43.960 --> 29:48.480\n know, a lot we don't understand, a lot that we still need to work on. We're working on\n\n29:48.480 --> 29:57.600\n it. What I don't think is that it helps to invoke supernatural explanations. If our current\n\n29:57.600 --> 30:01.640\n scientific explanations aren't adequate to do the job, then we need better ones. We need\n\n30:01.640 --> 30:06.200\n to work more. And of course, the history of science shows just that, that as science goes\n\n30:06.200 --> 30:13.200\n on, problems get solved one after another, and the science advances as science gets better.\n\n30:13.200 --> 30:21.400\n But to invoke a non scientific, non physical explanation is simply to lie down in a cowardly\n\n30:21.400 --> 30:25.440\n way and say, we can't solve it, so we're going to invoke magic. Don't let's do that. Let's\n\n30:25.440 --> 30:30.600\n say we need better science. We need more science. It may be that the science will never do it.\n\n30:30.600 --> 30:36.860\n It may be that we will never actually understand everything. And that's okay, but let's keep\n\n30:36.860 --> 30:39.480\n working on it.\n\n30:39.480 --> 30:43.520\n A challenging question there is, do you think science can lead us astray in terms of the\n\n30:43.520 --> 30:50.680\n humbleness? So there's some aspect of science, maybe it's the aspect of scientists and not\n\n30:50.680 --> 30:59.760\n science, but of sort of a mix of ego and confidence that can lead us astray in terms of discovering\n\n30:59.760 --> 31:05.240\n the, you know, some of the big open questions about the universe.\n\n31:05.240 --> 31:09.640\n I think that's right. I mean, there are, there are arrogant people in any walk of life and\n\n31:09.640 --> 31:13.560\n scientists are no exception to that. And so there are arrogant scientists who think we've\n\n31:13.560 --> 31:18.640\n solved everything. Of course we haven't. So humility is a proper stance for a scientist.\n\n31:18.640 --> 31:25.980\n I mean, it's a proper working stance because it encourages further work. But in a way to\n\n31:25.980 --> 31:30.740\n resort to a supernatural explanation is a kind of arrogance because it's saying, well,\n\n31:30.740 --> 31:38.280\n we don't understand it scientifically. Therefore the non scientific religious supernatural\n\n31:38.280 --> 31:42.200\n explanation must be the right one. That's arrogant. What is, what is humble is to say\n\n31:42.200 --> 31:46.560\n we don't know and we need to work further on it.\n\n31:46.560 --> 31:53.160\n So maybe if I could psychoanalyze you for a second, you have at times been just slightly\n\n31:53.160 --> 32:00.440\n frustrated with people who have supernat, you know, have a supernatural. Has that changed\n\n32:00.440 --> 32:06.480\n over the years? Have you become like, how do people that kind of have a seek supernatural\n\n32:06.480 --> 32:12.720\n explanations, how do you see those people as human beings as it's like, do you see them\n\n32:12.720 --> 32:21.200\n as dishonest? Do you see them as, um, sort of, uh, ignorant? Do you see them as, I don't\n\n32:21.200 --> 32:26.360\n know, is it like, how do you think of certainly not, not, not dishonest. And, and I mean,\n\n32:26.360 --> 32:30.120\n obviously many of them are perfectly nice people. So I don't, I don't sort of despise\n\n32:30.120 --> 32:38.000\n them in that sense. Um, I think it's often a misunderstanding that, that, um, people\n\n32:38.000 --> 32:44.800\n will jump from the admission that we don't understand something. They will jump straight\n\n32:44.800 --> 32:49.440\n to what they think of as an alternative explanation, which is the supernatural one, which is not\n\n32:49.440 --> 32:55.820\n an alternative. It's a non explanation. Um, instead of jumping to the conclusion that\n\n32:55.820 --> 33:02.200\n science needs more work, that we need to actually get, do some better, better science. So, um,\n\n33:02.200 --> 33:09.560\n I don't have, I mean, personal antipathy towards such people. I just think they're, they're\n\n33:09.560 --> 33:10.560\n misguided.\n\n33:10.560 --> 33:15.760\n So what about this really interesting space that I have trouble with? So religion I have\n\n33:15.760 --> 33:21.240\n a better grasp on, but, um, there's a large communities, like you said, Flat Earth community,\n\n33:21.240 --> 33:27.920\n uh, that I've recently, because I've made a few jokes about it. I saw that there's,\n\n33:27.920 --> 33:33.640\n I've noticed that there's people that take it quite seriously. So there's this bigger\n\n33:33.640 --> 33:40.960\n world of conspiracy theorists, which is a kind of, I mean, there's elements of it that\n\n33:40.960 --> 33:48.240\n are religious as well, but I think they're also scientific. So the, the basic credo of\n\n33:48.240 --> 33:56.680\n a conspiracy theorist is to question everything, which is also the credo of a good scientist,\n\n33:56.680 --> 33:59.960\n I would say. So what do you make of this?\n\n33:59.960 --> 34:07.200\n I mean, I think it's probably too easy to say that by labeling something conspiracy,\n\n34:07.200 --> 34:11.840\n you therefore dismiss it. I mean, occasionally conspiracies are right. And so we shouldn't\n\n34:11.840 --> 34:17.440\n dismiss conspiracy theories out of hand. We should examine them on their own merits. Flat\n\n34:17.440 --> 34:22.760\n Earthism is obvious nonsense. We don't have to examine that much further. Um, but, um,\n\n34:22.760 --> 34:27.280\n I mean, there may be other conspiracy theories which are actually right.\n\n34:27.280 --> 34:31.720\n So I've, you know, grew up in the Soviet Union. So I, I just, you know, uh, the space race\n\n34:31.720 --> 34:37.520\n was very influential for me on both sides of the coin. Uh, you know, there's a conspiracy\n\n34:37.520 --> 34:45.200\n theory that we never went to the moon. Right. And it's, uh, it's like, I cannot understand\n\n34:45.200 --> 34:50.760\n it and it's very difficult to rigorously scientifically show one way or the other. It's just, you\n\n34:50.760 --> 34:54.600\n have to use some of the human intuition about who would have to lie, who would have to work\n\n34:54.600 --> 35:01.720\n together. And it's clear that very unlikely, uh, good behind that is my general intuition\n\n35:01.720 --> 35:06.480\n that most people in this world are good. You know, in order to really put together some\n\n35:06.480 --> 35:12.280\n conspiracy theories, there has to be a large number of people working together and essentially\n\n35:12.280 --> 35:13.280\n being dishonest.\n\n35:13.280 --> 35:18.480\n Yes, which is improbable. The sheer number who would have to be in on this conspiracy\n\n35:18.480 --> 35:23.840\n and the sheer detail, the attention to detail they'd have had to have had and so on. I'd\n\n35:23.840 --> 35:29.400\n also worry about the motive and why would anyone want to suggest that it didn't happen?\n\n35:29.400 --> 35:35.120\n What's the, what's the, why is it so hard to believe? I mean, the, the physics of it,\n\n35:35.120 --> 35:40.720\n the mathematics of it, the, the idea of computing orbits and, and, and trajectories and things,\n\n35:40.720 --> 35:44.360\n it, it all works mathematically. Why wouldn't you believe it?\n\n35:44.360 --> 35:50.280\n It's a psychology question because there's something really pleasant about, um, you know,\n\n35:50.280 --> 35:55.700\n pointing out that the emperor has no clothes when everybody like, uh, you know, thinking\n\n35:55.700 --> 36:00.240\n outside the box and coming up with the true answer where everybody else is diluted. There's\n\n36:00.240 --> 36:04.480\n something, I mean, I have that for science, right? You want to prove the entire scientific\n\n36:04.480 --> 36:06.120\n community wrong. That's the whole.\n\n36:06.120 --> 36:11.040\n That's, that's, that's right. And, and of course, historically, lone geniuses have come\n\n36:11.040 --> 36:15.820\n out right sometimes, but often people with who think they're a lone genius much more\n\n36:15.820 --> 36:20.840\n often turn out not to. Um, so you have to judge each case on its merits. The mere fact\n\n36:20.840 --> 36:25.960\n that you're a maverick, the mere fact that you, you're going against the current tide\n\n36:25.960 --> 36:29.960\n doesn't make you right. You've got to show you're right by looking at the evidence.\n\n36:29.960 --> 36:35.480\n So because you focus so much on, on religion and disassembled a lot of ideas there and\n\n36:35.480 --> 36:41.400\n I just, I was wondering if, if you have ideas about conspiracy theory groups, because it's\n\n36:41.400 --> 36:46.600\n such a prevalent, even reaching into, uh, presidential politics and so on. It seems\n\n36:46.600 --> 36:50.960\n like it's a very large communities that believe different kinds of conspiracy theories. Is\n\n36:50.960 --> 36:56.560\n there some connection there to your thinking on religion? And it is curious. It's a matter.\n\n36:56.560 --> 37:03.000\n It's an obvious difficult thing. Uh, I don't understand why people believe things that\n\n37:03.000 --> 37:07.960\n are clearly nonsense, like, well, flat earth and also the conspiracy about not landing\n\n37:07.960 --> 37:15.000\n on the moon or, um, that, um, the, that the United States engineered 9 11 that, that kind\n\n37:15.000 --> 37:21.640\n of thing. Um, so it's not clearly nonsense. It's extremely unlikely. Okay. It's extremely\n\n37:21.640 --> 37:27.020\n unlikely that religion is a bit different because it's passed down from generation to\n\n37:27.020 --> 37:31.920\n generation. So many of the people who are religious, uh, got it from their parents who\n\n37:31.920 --> 37:35.800\n got it from their parents who got it from their parents and childhood indoctrination\n\n37:35.800 --> 37:45.840\n is a very powerful force. But these things like the nine 11 conspiracy theory, the, um,\n\n37:45.840 --> 37:50.840\n Kennedy assassination conspiracy theory, the man on the moon conspiracy theory, these are\n\n37:50.840 --> 37:57.120\n not childhood indoctrination. These are, um, presumably dreamed up by somebody who then\n\n37:57.120 --> 38:04.600\n tells somebody else who then wants to believe it. And I don't know why people are so eager\n\n38:04.600 --> 38:10.760\n to fall in line with some, just some person that they happen to read or meet who spins\n\n38:10.760 --> 38:16.160\n some yarn. I can kind of understand why they believe what their parents and teachers told\n\n38:16.160 --> 38:21.600\n them when they were very tiny and not capable of critical thinking for themselves. So I\n\n38:21.600 --> 38:28.960\n sort of get why the great religions of the world like Catholicism and Islam go on persisting.\n\n38:28.960 --> 38:34.080\n It's because of childhood indoctrination, but that's not true of flat earthism and sure\n\n38:34.080 --> 38:40.440\n enough flat earthism is a very minority cult way larger than I ever realized. Well, yes,\n\n38:40.440 --> 38:43.880\n I know, but so that's a really clean idea and you've articulated that in your new book\n\n38:43.880 --> 38:49.280\n and then, and I'll go on God and in God, the illusion is the early indoctrination. That's\n\n38:49.280 --> 38:54.320\n really interesting that you can get away with a lot of out there ideas in terms of religious\n\n38:54.320 --> 39:04.140\n texts. If, um, the age at which you convey those ideas at first is a young age. So indoctrination\n\n39:04.140 --> 39:11.600\n is sort of an essential element of propagation of religion. So let me ask on the morality\n\n39:11.600 --> 39:16.360\n side in the books that I mentioned, God, delusion, and I'll go on God. You described that human\n\n39:16.360 --> 39:21.960\n beings don't need religion to be moral. So from an engineering perspective, we want to\n\n39:21.960 --> 39:32.800\n engineer morality into AI systems. So in general, where do you think morals come from in humans?\n\n39:32.800 --> 39:40.680\n A very complicated and interesting question. It's clear to me that the moral standards,\n\n39:40.680 --> 39:50.560\n the moral values of our civilization changes as the decades go by, certainly as the centuries\n\n39:50.560 --> 39:59.400\n go by, even as the decades go by. And we in the 21st century are quite clearly labeled\n\n39:59.400 --> 40:05.680\n 21st century people in terms of our moral values. There's a spread. I mean, some of\n\n40:05.680 --> 40:10.600\n us are a little bit more ruthless, some of us more conservative, some of us more liberal\n\n40:10.600 --> 40:18.040\n and so on. But we all subscribe to pretty much the same views when you compare us with\n\n40:18.040 --> 40:26.720\n say 18th century, 17th century people, even 19th century, 20th century people. So we're\n\n40:26.720 --> 40:31.440\n much less racist, we're much less sexist and so on than we used to be. Some people are\n\n40:31.440 --> 40:37.080\n still racist and some are still sexist, but the spread has shifted. The Gaussian distribution\n\n40:37.080 --> 40:47.300\n has moved and moves steadily as the centuries go by. And that is the most powerful influence\n\n40:47.300 --> 40:54.360\n I can see on our moral values. And that doesn't have anything to do with religion. I mean,\n\n40:54.360 --> 41:03.520\n the religion, sorry, the morals of the Old Testament are Bronze Age models. They're deplorable\n\n41:03.520 --> 41:09.560\n and they are to be understood in terms of the people in the desert who made them up\n\n41:09.560 --> 41:17.800\n at the time. And so human sacrifice, an eye for an eye, a tooth for a tooth, petty revenge,\n\n41:17.800 --> 41:23.800\n killing people for breaking the Sabbath, all that kind of thing, inconceivable now.\n\n41:23.800 --> 41:29.380\n So at some point religious texts may have in part reflected that Gaussian distribution\n\n41:29.380 --> 41:30.380\n at that time.\n\n41:30.380 --> 41:32.220\n I'm sure they did. I'm sure they always reflect that, yes.\n\n41:32.220 --> 41:39.040\n And then now, but the sort of almost like the meme, as you describe it, of ideas moves\n\n41:39.040 --> 41:42.120\n much faster than religious texts do, than new religions.\n\n41:42.120 --> 41:49.200\n Yes. So basing your morals on religious texts, which were written millennia ago, is not a\n\n41:49.200 --> 41:56.920\n great way to proceed. I think that's pretty clear. So not only should we not get our morals\n\n41:56.920 --> 42:03.640\n from such texts, but we don't. We quite clearly don't. If we did, then we'd be discriminating\n\n42:03.640 --> 42:12.960\n against women and we'd be racist, we'd be killing homosexuals and so on. So we don't\n\n42:12.960 --> 42:20.400\n and we shouldn't. Now, of course, it's possible to use your 21st century standards of morality\n\n42:20.400 --> 42:25.980\n and you can look at the Bible and you can cherry pick particular verses which conform\n\n42:25.980 --> 42:30.640\n to our modern morality, and you'll find that Jesus says some pretty nice things, which\n\n42:30.640 --> 42:38.120\n is great. But you're using your 21st century morality to decide which verses to pick, which\n\n42:38.120 --> 42:44.480\n verses to reject. And so why not cut out the middleman of the Bible and go straight to\n\n42:44.480 --> 42:51.080\n the 21st century morality, which is where that comes from. It's a much more complicated\n\n42:51.080 --> 42:57.400\n question. Why is it that morality, moral values change as the centuries go by? They undoubtedly\n\n42:57.400 --> 43:02.680\n do. And it's a very interesting question to ask why. It's another example of cultural\n\n43:02.680 --> 43:09.640\n evolution, just as technology progresses, so moral values progress for probably very\n\n43:09.640 --> 43:10.640\n different reasons.\n\n43:10.640 --> 43:15.440\n But it's interesting if the direction in which that progress is happening has some evolutionary\n\n43:15.440 --> 43:18.960\n value or if it's merely a drift that can go into any direction.\n\n43:18.960 --> 43:22.880\n I'm not sure it's any direction and I'm not sure it's evolutionarily valuable. What it\n\n43:22.880 --> 43:29.320\n is is progressive in the sense that each step is a step in the same direction as the previous\n\n43:29.320 --> 43:37.080\n step. So it becomes more gentle, more decent by modern standards, more liberal, less violent.\n\n43:37.080 --> 43:42.600\n But more decent, I think you're using terms and interpreting everything in the context\n\n43:42.600 --> 43:48.320\n of the 21st century because Genghis Khan would probably say that this is not more decent\n\n43:48.320 --> 43:52.560\n because we're now, you know, there's a lot of weak members of society that we're not\n\n43:52.560 --> 43:53.560\n murdering.\n\n43:53.560 --> 43:58.240\n Yes. I was careful to say by the standards of the 21st century, by our standards, if\n\n43:58.240 --> 44:03.160\n we with hindsight look back at history, what we see is a trend in the direction towards\n\n44:03.160 --> 44:06.840\n us, towards our present, our present value system.\n\n44:06.840 --> 44:13.360\n For us, we see progress, but it's an open question whether that won't, you know, I don't\n\n44:13.360 --> 44:17.040\n see necessarily why we can never return to Genghis Khan times.\n\n44:17.040 --> 44:26.160\n We could. I suspect we won't. But if you look at the history of moral values over the centuries,\n\n44:26.160 --> 44:31.640\n it is in a progressive, I use the word progressive not in a value judgment sense, in the sense\n\n44:31.640 --> 44:37.640\n of a transitive sense. Each step is the same, is the same direction as the previous step.\n\n44:37.640 --> 44:47.600\n So things like we don't derive entertainment from torturing cats. We don't derive entertainment\n\n44:47.600 --> 44:53.360\n from like the Romans did in the Colosseum from that state.\n\n44:53.360 --> 45:00.440\n Or rather we suppress the desire to get, I mean, to have play. It's probably in us somewhere.\n\n45:00.440 --> 45:05.320\n So there's a bunch of parts of our brain, one that probably, you know, limbic system\n\n45:05.320 --> 45:10.980\n that wants certain pleasures. And that's I don't, I mean, I wouldn't have said that,\n\n45:10.980 --> 45:16.200\n but you're at liberty to think that you like, well, no, there's a, there's a Dan Carlin\n\n45:16.200 --> 45:20.560\n of hardcore history. There's a really nice explanation of how we've enjoyed watching\n\n45:20.560 --> 45:25.040\n the torture of people, the fighting of people, just to torture the suffering of people throughout\n\n45:25.040 --> 45:32.560\n history as entertainment until quite recently. And now everything we do with sports, we're\n\n45:32.560 --> 45:38.160\n kind of channeling that feeling into something else. I mean, there, there is some dark aspects\n\n45:38.160 --> 45:44.400\n of human nature that are underneath everything. And I do hope this like higher level software\n\n45:44.400 --> 45:52.440\n we've built will keep us at bay. I'm also Jewish and have history with the Soviet Union\n\n45:52.440 --> 45:58.400\n and the Holocaust. And I clearly remember that some of the darker aspects of human nature\n\n45:58.400 --> 45:59.400\n creeped up there.\n\n45:59.400 --> 46:04.120\n They do. There have been, there have been steps backwards admittedly, and the Holocaust\n\n46:04.120 --> 46:11.000\n is an obvious one. But if you take a broad view of history, it's the same direction.\n\n46:11.000 --> 46:16.960\n So Pamela McCordick in Machines Who Think has written that AI began with an ancient\n\n46:16.960 --> 46:24.120\n wish to forge the gods. Do you see, it's a poetic description I suppose, but do you see\n\n46:24.120 --> 46:30.120\n a connection between our civilizations, historic desire to create gods, to create religions\n\n46:30.120 --> 46:35.560\n and our modern desire to create technology and intelligent technology?\n\n46:35.560 --> 46:46.440\n I suppose there's a link between an ancient desire to explain away mystery and science,\n\n46:46.440 --> 46:53.920\n but intelligence, artificial intelligence, creating gods, creating new gods. And I forget,\n\n46:53.920 --> 46:59.320\n I read somewhere a somewhat facetious paper which said that we have a new god is called\n\n46:59.320 --> 47:05.320\n Google and we pray to it and we worship it and we ask its advice like an Oracle and so\n\n47:05.320 --> 47:08.680\n on. That's fun.\n\n47:08.680 --> 47:12.200\n You don't see that, you see that as a fun statement, a facetious statement. You don't\n\n47:12.200 --> 47:17.480\n see that as a kind of truth of us creating things that are more powerful than ourselves\n\n47:17.480 --> 47:18.480\n and natural.\n\n47:18.480 --> 47:26.440\n It has a kind of poetic resonance to it, which I get, but I wouldn't, I wouldn't have bothered\n\n47:26.440 --> 47:28.840\n to make the point myself, put it that way.\n\n47:28.840 --> 47:34.320\n All right. So you don't think AI will become our new god, a new religion, a new gods like\n\n47:34.320 --> 47:35.320\n Google?\n\n47:35.320 --> 47:42.280\n Well, yes. I mean, I can see that the future of intelligent machines or indeed intelligent\n\n47:42.280 --> 47:48.800\n aliens from outer space might yield beings that we would regard as gods in the sense\n\n47:48.800 --> 47:55.200\n that they are so superior to us that we might as well worship them. That's highly plausible,\n\n47:55.200 --> 48:03.460\n I think. But I see a very fundamental distinction between a god who is simply defined as something\n\n48:03.460 --> 48:09.400\n very, very powerful and intelligent on the one hand and a god who doesn't need explaining\n\n48:09.400 --> 48:20.360\n by a progressive step by step process like evolution or like engineering design. So suppose\n\n48:20.360 --> 48:27.080\n we did meet an alien from outer space who was marvelously, magnificently more intelligent\n\n48:27.080 --> 48:31.800\n than us and we would sort of worship it for that reason. Nevertheless, it would not be\n\n48:31.800 --> 48:39.640\n a god in the very important sense that it did not just happen to be there like god is\n\n48:39.640 --> 48:46.480\n supposed to. It must have come about by a gradual step by step incremental progressive\n\n48:46.480 --> 48:52.900\n process, presumably like Darwinian evolution. There's all the difference in the world between\n\n48:52.900 --> 49:01.180\n those two. Intelligence, design comes into the universe late as a product of a progressive\n\n49:01.180 --> 49:06.560\n evolutionary process or progressive engineering design process.\n\n49:06.560 --> 49:11.280\n So most of the work is done through this slow moving progress.\n\n49:11.280 --> 49:12.280\n Exactly.\n\n49:12.280 --> 49:23.240\n Yeah. Yeah. But there's still this desire to get answers to the why question that if\n\n49:23.240 --> 49:27.600\n the world is a simulation, if we're living in a simulation, that there's a programmer\n\n49:27.600 --> 49:30.400\n like creature that we can ask questions of.\n\n49:30.400 --> 49:35.600\n Well, let's pursue the idea that we're living in a simulation, which is not totally ridiculous,\n\n49:35.600 --> 49:36.600\n by the way.\n\n49:36.600 --> 49:39.720\n There we go.\n\n49:39.720 --> 49:46.440\n Then you still need to explain the programmer. The programmer had to come into existence\n\n49:46.440 --> 49:53.440\n by some... Even if we're in a simulation, the programmer must have evolved. Or if he's\n\n49:53.440 --> 49:54.920\n in a sort of...\n\n49:54.920 --> 49:55.920\n Or she.\n\n49:55.920 --> 50:03.600\n If she's in a meta simulation, then the meta program must have evolved by a gradual process.\n\n50:03.600 --> 50:09.880\n You can't escape that. Fundamentally, you've got to come back to a gradual incremental\n\n50:09.880 --> 50:13.760\n process of explanation to start with.\n\n50:13.760 --> 50:15.640\n There's no shortcuts in this world.\n\n50:15.640 --> 50:17.640\n No, exactly.\n\n50:17.640 --> 50:22.200\n But maybe to linger on that point about the simulation, do you think it's an interesting\n\n50:22.200 --> 50:28.400\n thing? Basically, you talk to... Bored the heck out of everybody asking this question,\n\n50:28.400 --> 50:33.440\n but whether you live in a simulation, do you think... First, do you think we live in a\n\n50:33.440 --> 50:37.480\n simulation? Second, do you think it's an interesting thought experiment?\n\n50:37.480 --> 50:42.160\n It's certainly an interesting thought experiment. I first met it in a science fiction novel\n\n50:42.160 --> 50:53.720\n by Daniel Galloy called Counterfeit World, in which it's all about... I mean, our heroes\n\n50:53.720 --> 51:00.520\n are running a gigantic computer which simulates the world, and something goes wrong, and so\n\n51:00.520 --> 51:05.840\n one of them has to go down into the simulated world in order to fix it. And then the denouement\n\n51:05.840 --> 51:10.040\n of the thing, the climax to the novel, is that they discover that they themselves are\n\n51:10.040 --> 51:15.580\n in another simulation at a higher level. So I was intrigued by this, and I love others\n\n51:15.580 --> 51:23.840\n of Daniel Galloy's science fiction novels. Then it was revived seriously by Nick Bostrom...\n\n51:23.840 --> 51:27.600\n Bostrom talking to him in an hour.\n\n51:27.600 --> 51:32.520\n And he goes further, not just treat it as a science fiction speculation, he actually\n\n51:32.520 --> 51:37.800\n thinks it's positively likely. I mean, he thinks it's very likely, actually.\n\n51:37.800 --> 51:42.480\n He makes a probabilistic argument, which you can use to come up with very interesting conclusions\n\n51:42.480 --> 51:44.360\n about the nature of this universe.\n\n51:44.360 --> 51:50.880\n I mean, he thinks that we're in a simulation done by, so to speak, our descendants of the\n\n51:50.880 --> 51:56.200\n future. But it's still a product of evolution. It's still ultimately going to be a product\n\n51:56.200 --> 52:05.040\n of evolution, even though the super intelligent people of the future have created our world,\n\n52:05.040 --> 52:11.800\n and you and I are just a simulation, and this table is a simulation and so on. I don't actually\n\n52:11.800 --> 52:15.160\n in my heart of hearts believe it, but I like his argument.\n\n52:15.160 --> 52:21.200\n Well, so the interesting thing is that I agree with you, but the interesting thing to me,\n\n52:21.200 --> 52:26.720\n if I were to say, if we're living in a simulation, that in that simulation, to make it work,\n\n52:26.720 --> 52:31.240\n you still have to do everything gradually, just like you said. That even though it's\n\n52:31.240 --> 52:33.360\n programmed, I don't think there could be miracles.\n\n52:33.360 --> 52:39.840\n Well, no, I mean, the programmer, the higher, the upper ones have to have evolved gradually.\n\n52:39.840 --> 52:44.080\n However, the simulation they create could be instantaneous. I mean, they could be switched\n\n52:44.080 --> 52:47.840\n on and we come into the world with fabricated memories.\n\n52:47.840 --> 52:53.840\n True, but what I'm trying to convey, so you're saying the broader statement, but I'm saying\n\n52:53.840 --> 52:59.240\n from an engineering perspective, both the programmer has to be slowly evolved and the\n\n52:59.240 --> 53:03.160\n simulation because it's like, from an engineering perspective.\n\n53:03.160 --> 53:05.640\n Oh yeah, it takes a long time to write a program.\n\n53:05.640 --> 53:11.000\n No, like just, I don't think you can create the universe in a snap. I think you have to\n\n53:11.000 --> 53:12.000\n grow it.\n\n53:12.000 --> 53:20.600\n Okay. Well, that's a good point. That's an arguable point. By the way, I have thought\n\n53:20.600 --> 53:26.720\n about using the Nick Bostrom idea to solve the riddle of how you were talking. We were\n\n53:26.720 --> 53:33.360\n talking earlier about why the human brain can achieve so much. I thought of this when\n\n53:33.360 --> 53:39.880\n my then 100 year old mother was marveling at what I could do with a smartphone and I\n\n53:39.880 --> 53:44.440\n could call, look up anything in the encyclopedia, I could play her music that she liked and\n\n53:44.440 --> 53:48.560\n so on. She said, but it's all in that tiny little phone. No, it's out there. It's in\n\n53:48.560 --> 53:56.440\n the cloud. And maybe most of what we do is in a cloud. So maybe if we are a simulation,\n\n53:56.440 --> 54:01.880\n even all the power that we think is in our skull, it actually may be like the power that\n\n54:01.880 --> 54:07.880\n we think is in the iPhone. But is that actually out there in an interface to something else?\n\n54:07.880 --> 54:14.200\n I mean, that's what, including Roger Penrose with panpsychism, that consciousness is somehow\n\n54:14.200 --> 54:19.640\n a fundamental part of physics, that it doesn't have to actually all reside inside. But Roger\n\n54:19.640 --> 54:26.520\n thinks it does reside in the skull, whereas I'm suggesting that it doesn't, that there's\n\n54:26.520 --> 54:27.520\n a cloud.\n\n54:27.520 --> 54:35.520\n That'd be a fascinating notion. On a small tangent, are you familiar with the work of\n\n54:35.520 --> 54:43.640\n Donald Hoffman, I guess? Maybe not saying his name correctly, but just forget the name,\n\n54:43.640 --> 54:51.040\n the idea that there's a difference between reality and perception. So like we biological\n\n54:51.040 --> 54:55.120\n organisms perceive the world in order for the natural selection process to be able to\n\n54:55.120 --> 55:01.120\n survive and so on. But that doesn't mean that our perception actually reflects the fundamental\n\n55:01.120 --> 55:03.920\n reality, the physical reality underneath.\n\n55:03.920 --> 55:10.600\n Well, I do think that although it reflects the fundamental reality, I do believe there\n\n55:10.600 --> 55:18.520\n is a fundamental reality, I do think that our perception is constructive in the sense\n\n55:18.520 --> 55:26.280\n that we construct in our minds a model of what we're seeing. And so this is really the\n\n55:26.280 --> 55:32.400\n view of people who work on visual illusions, like Richard Gregory, who point out that things\n\n55:32.400 --> 55:40.680\n like a Necker cube, which flip from a two dimensional picture of a cube on a sheet of\n\n55:40.680 --> 55:46.520\n paper, we see it as a three dimensional cube, and it flips from one orientation to another\n\n55:46.520 --> 55:53.160\n at regular intervals. What's going on is that the brain is constructing a cube, but the\n\n55:53.160 --> 55:58.320\n sense data are compatible with two alternative cubes. And so rather than stick with one of\n\n55:58.320 --> 56:04.120\n them, it alternates between them. I think that's just a model for what we do all the\n\n56:04.120 --> 56:10.520\n time when we see a table, when we see a person, when we see anything, we're using the sense\n\n56:10.520 --> 56:18.160\n data to construct or make use of a perhaps previously constructed model. I noticed this\n\n56:18.160 --> 56:26.680\n when I meet somebody who actually is, say, a friend of mine, but until I kind of realized\n\n56:26.680 --> 56:33.520\n that it is him, he looks different. And then when I finally clock that it's him, his features\n\n56:33.520 --> 56:39.720\n switch like a Necker cube into the familiar form. As it were, I've taken his face out\n\n56:39.720 --> 56:48.240\n of the filing cabinet inside and grafted it onto or used the sense data to invoke it.\n\n56:48.240 --> 56:53.200\n Yeah, we do some kind of miraculous compression on this whole thing to be able to filter out\n\n56:53.200 --> 56:58.840\n most of the sense data and make sense of it. That's just a magical thing that we do. So\n\n56:58.840 --> 57:08.360\n you've written several, many amazing books, but let me ask, what books, technical or fiction\n\n57:08.360 --> 57:15.920\n or philosophical, had a big impact on your own life? What books would you recommend people\n\n57:15.920 --> 57:19.280\n consider reading in their own intellectual journey?\n\n57:19.280 --> 57:29.000\n Darwin, of course. The original. I'm actually ashamed to say I've never read Darwin. He's\n\n57:29.000 --> 57:35.880\n astonishingly prescient because considering he was writing in the middle of the 19th century,\n\n57:35.880 --> 57:41.000\n Michael Gieselin said he's working 100 years ahead of his time. Everything except genetics\n\n57:41.000 --> 57:49.240\n is amazingly right and amazingly far ahead of his time. And of course, you need to read\n\n57:49.240 --> 57:55.880\n the updatings that have happened since his time as well. I mean, he would be astonished\n\n57:55.880 --> 58:03.380\n by, well, let alone Watson and Crick, of course, but he'd be astonished by Mendelian genetics\n\n58:03.380 --> 58:04.380\n as well.\n\n58:04.380 --> 58:08.480\n Yeah, it'd be fascinating to see what he thought about DNA, what he would think about DNA.\n\n58:08.480 --> 58:15.280\n I mean, yes, it would. Because in many ways, it clears up what appeared in his time to\n\n58:15.280 --> 58:23.600\n be a riddle. The digital nature of genetics clears up what was a problem, what was a big\n\n58:23.600 --> 58:28.680\n problem. Gosh, there's so much that I could think of. I can't really...\n\n58:28.680 --> 58:34.880\n Is there something outside sort of more fiction? When you think young, was there books that\n\n58:34.880 --> 58:39.840\n just kind of outside of kind of the realm of science or religion that just kind of sparked\n\n58:39.840 --> 58:40.840\n your journey?\n\n58:40.840 --> 58:47.520\n Yes. Well, actually, I suppose I could say that I've learned some science from science\n\n58:47.520 --> 58:57.360\n fiction. I mentioned Daniel Galloy, and that's one example, but another of his novels called\n\n58:57.360 --> 59:01.800\n Dark Universe, which is not terribly well known, but it's a very, very nice science\n\n59:01.800 --> 59:07.880\n fiction story. It's about a world of perpetual darkness. And we're not told at the beginning\n\n59:07.880 --> 59:12.840\n of the book why these people are in darkness. They stumble around in some kind of underground\n\n59:12.840 --> 59:21.280\n world of caverns and passages, using echolocation like bats and whales to get around. And they've\n\n59:21.280 --> 59:28.600\n adapted, presumably by Darwinian means, to survive in perpetual total darkness. But what's\n\n59:28.600 --> 59:36.480\n interesting is that their mythology, their religion has echoes of Christianity, but it's\n\n59:36.480 --> 59:44.720\n based on light. And so there's been a fall from a paradise world that once existed where\n\n59:44.720 --> 59:52.880\n light reigns supreme. And because of the sin of mankind, light banished them. So they no\n\n59:52.880 --> 59:58.640\n longer are in light's presence, but light survives in the form of mythology and in the\n\n59:58.640 --> 1:00:04.740\n form of sayings like, there's a great light almighty. Oh, for light's sake, don't do that.\n\n1:00:04.740 --> 1:00:08.000\n And I hear what you mean rather than I see what you mean.\n\n1:00:08.000 --> 1:00:12.000\n So some of the same religious elements are present in this other totally kind of absurd\n\n1:00:12.000 --> 1:00:13.000\n different form.\n\n1:00:13.000 --> 1:00:17.640\n Yes. And so it's a wonderful, I wouldn't call it satire, because it's too good natured\n\n1:00:17.640 --> 1:00:24.640\n for that. I mean, a wonderful parable about Christianity and the doctrine, the theological\n\n1:00:24.640 --> 1:00:31.640\n doctrine of the fall. So I find that kind of science fiction immensely stimulating.\n\n1:00:31.640 --> 1:00:36.360\n Fred Hoyle's The Black Cloud. Oh, by the way, anything by Arthur C. Clarke I find very wonderful\n\n1:00:36.360 --> 1:00:46.520\n too. Fred Hoyle's The Black Cloud, his first science fiction novel, where he, well, I learned\n\n1:00:46.520 --> 1:00:52.240\n a lot of science from that. It suffers from an obnoxious hero, unfortunately, but apart\n\n1:00:52.240 --> 1:00:59.520\n from that, you learn a lot of science from it. Another of his novels, A for Andromeda,\n\n1:00:59.520 --> 1:01:05.920\n which by the way, the theme of that is taken up by Carl Sagan's science fiction novel,\n\n1:01:05.920 --> 1:01:15.400\n another wonderful writer, Carl Sagan, Contact, where the idea is, again, we will not be visited\n\n1:01:15.400 --> 1:01:21.040\n from outer space by physical bodies. We will be visited possibly, we might be visited by\n\n1:01:21.040 --> 1:01:28.840\n radio, but the radio signals could manipulate us and actually have a concrete influence\n\n1:01:28.840 --> 1:01:37.040\n on the world if they make us or persuade us to build a computer, which runs their software.\n\n1:01:37.040 --> 1:01:43.560\n So that they can then transmit their software by radio, and then the computer takes over\n\n1:01:43.560 --> 1:01:50.240\n the world. And this is the same theme in both Hoyle's book and Sagan's book, I presume.\n\n1:01:50.240 --> 1:01:56.440\n I don't know whether Sagan knew about Hoyle's book, probably did. But it's a clever idea\n\n1:01:56.440 --> 1:02:04.600\n that we will never be invaded by physical bodies. The War of the Worlds of H.G. Wells\n\n1:02:04.600 --> 1:02:11.880\n will never happen. But we could be invaded by radio signals, code, coded information,\n\n1:02:11.880 --> 1:02:20.520\n which is sort of like DNA. And we are, I call them, we are survival machines of our DNA.\n\n1:02:20.520 --> 1:02:26.520\n So it has great resonance for me, because I think of us, I think of bodies, physical\n\n1:02:26.520 --> 1:02:34.640\n bodies, biological bodies, as being manipulated by coded information, DNA, which has come\n\n1:02:34.640 --> 1:02:35.640\n down through generations.\n\n1:02:35.640 --> 1:02:40.840\n And in the space of memes, it doesn't have to be physical, it can be transmitted through\n\n1:02:40.840 --> 1:02:47.440\n the space of information. That's a fascinating possibility, that from outer space we can\n\n1:02:47.440 --> 1:02:54.160\n be infiltrated by other memes, by other ideas, and thereby controlled in that way. Let me\n\n1:02:54.160 --> 1:03:00.160\n ask the last, the silliest, or maybe the most important question. What is the meaning of\n\n1:03:00.160 --> 1:03:06.200\n life? What gives your life fulfillment, purpose, happiness, meaning?\n\n1:03:06.200 --> 1:03:10.360\n From a scientific point of view, the meaning of life is the propagation of DNA, but that's\n\n1:03:10.360 --> 1:03:16.280\n not what I feel. That's not the meaning of my life. So the meaning of my life is something\n\n1:03:16.280 --> 1:03:19.700\n which is probably different from yours and different from other people's, but we each\n\n1:03:19.700 --> 1:03:27.060\n make our own meaning. So we set up goals, we want to achieve, we want to write a book,\n\n1:03:27.060 --> 1:03:36.000\n we want to do whatever it is we do, write a quartet, we want to win a football match.\n\n1:03:36.000 --> 1:03:41.680\n And these are short term goals, well, maybe even quite long term goals, which are set\n\n1:03:41.680 --> 1:03:46.840\n up by our brains, which have goal seeking machinery built into them. But what we feel,\n\n1:03:46.840 --> 1:03:54.680\n we don't feel motivated by the desire to pass on our DNA, mostly. We have other goals which\n\n1:03:54.680 --> 1:04:01.440\n can be very moving, very important. They could even be called as called spiritual in some\n\n1:04:01.440 --> 1:04:07.640\n cases. We want to understand the riddle of the universe, we want to understand consciousness,\n\n1:04:07.640 --> 1:04:13.840\n we want to understand how the brain works. These are all noble goals. Some of them can\n\n1:04:13.840 --> 1:04:20.080\n be noble goals anyway. And they are a far cry from the fundamental biological goal,\n\n1:04:20.080 --> 1:04:26.940\n which is the propagation of DNA. But the machinery that enables us to set up these higher level\n\n1:04:26.940 --> 1:04:34.240\n goals is originally programmed into us by natural selection of DNA.\n\n1:04:34.240 --> 1:04:41.720\n The propagation of DNA. But what do you make of this unfortunate fact that we are mortal?\n\n1:04:41.720 --> 1:04:47.080\n Do you ponder your mortality? Does it make you sad?\n\n1:04:47.080 --> 1:04:53.880\n I ponder it. It would, it makes me sad that I shall have to leave and not see what's going\n\n1:04:53.880 --> 1:05:02.200\n to happen next. If there's something frightening about mortality, apart from sort of missing,\n\n1:05:02.200 --> 1:05:10.320\n as I said, something more deeply, darkly frightening, it's the idea of eternity. But eternity is\n\n1:05:10.320 --> 1:05:15.280\n only frightening if you're there. Eternity before we were born, billions of years before\n\n1:05:15.280 --> 1:05:20.680\n we were born, and we were effectively dead before we were born. As I think it was Mark\n\n1:05:20.680 --> 1:05:25.240\n Twain said, I was dead for billions of years before I was born and never suffered the smallest\n\n1:05:25.240 --> 1:05:31.920\n inconvenience. That's how it's going to be after we leave. So I think of it as really,\n\n1:05:31.920 --> 1:05:36.720\n mortality is a frightening prospect. And so the best way to spend it is under a general\n\n1:05:36.720 --> 1:05:39.680\n anesthetic, which is what it'll be.\n\n1:05:39.680 --> 1:05:44.280\n Beautifully put. Richard, it is a huge honor to meet you, to talk to you. Thank you so\n\n1:05:44.280 --> 1:05:45.280\n much for your time.\n\n1:05:45.280 --> 1:05:46.280\n Thank you very much.\n\n1:05:46.280 --> 1:05:50.880\n Thanks for listening to this conversation with Richard Dawkins. And thank you to our\n\n1:05:50.880 --> 1:05:55.400\n presenting sponsor, Cash App. Please consider supporting the podcast by downloading Cash\n\n1:05:55.400 --> 1:06:01.280\n App and using code LEXPodcast. If you enjoy this podcast, subscribe on YouTube, review\n\n1:06:01.280 --> 1:06:06.480\n with 5 stars on Apple Podcast, support on Patreon, or simply connect with me on Twitter\n\n1:06:06.480 --> 1:06:08.640\n at Lex Friedman.\n\n1:06:08.640 --> 1:06:13.080\n And now let me leave you with some words of wisdom from Richard Dawkins.\n\n1:06:13.080 --> 1:06:18.880\n We are going to die. And that makes us the lucky ones. Most people are never going to\n\n1:06:18.880 --> 1:06:24.120\n die because they are never going to be born. The potential people who could have been here\n\n1:06:24.120 --> 1:06:29.460\n in my place but who will in fact never see the light of day outnumber the sand grains\n\n1:06:29.460 --> 1:06:36.320\n of Arabia. Certainly, those unborn ghosts include greater poets than Keats, scientists\n\n1:06:36.320 --> 1:06:42.000\n greater than Newton. We know this because the set of possible people allowed by our\n\n1:06:42.000 --> 1:06:49.560\n DNA so massively exceeds the set of actual people. In the teeth of these stupefying odds,\n\n1:06:49.560 --> 1:06:57.440\n it is you and I, in our ordinariness, that are here. We privileged few who won the lottery\n\n1:06:57.440 --> 1:07:04.840\n of birth against all odds. How dare we whine at our inevitable return to that prior state\n\n1:07:04.840 --> 1:07:08.480\n from which the vast majority have never stirred.\n\n1:07:08.480 --> 1:07:28.000\n Thank you for listening and hope to see you next time.\n\n"
}