{
  "title": "Noam Chomsky: Putin, Ukraine, China, and Nuclear War | Lex Fridman Podcast #316",
  "id": "7uHGlfeCBbE",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.000\n Will there be a war between U.S. and China in the 21st century?\n\n00:05.000 --> 00:08.000\n If there is, we're finished.\n\n00:08.000 --> 00:17.000\n A war between the U.S. and China would destroy the possibilities of organized life on Earth.\n\n00:18.000 --> 00:23.000\n The following is a conversation with Noam Chomsky, his second time on the podcast.\n\n00:23.000 --> 00:27.000\n This episode is focused on the war in Ukraine.\n\n00:27.000 --> 00:32.000\n And it is a departure from the way I usually do this podcast in several ways.\n\n00:32.000 --> 00:39.000\n Noam is a strong and healthy 93 year old, but this conversation is remote to be cautious.\n\n00:40.000 --> 00:42.000\n It is brief, only one hour.\n\n00:42.000 --> 00:50.000\n It is more of an interview than a conversation due to the limitations of our audio and video connection.\n\n00:50.000 --> 00:54.000\n I decided it's best to get Noam's clear thoughts on this war\n\n00:54.000 --> 01:01.000\n and the complicated geopolitics of today and the rest of the 21st century that is unrolling before us,\n\n01:01.000 --> 01:06.000\n with our decisions and actions fully capable of either helping humanity flourish\n\n01:06.000 --> 01:10.000\n or unleashing global destruction and suffering.\n\n01:10.000 --> 01:16.000\n As a brief aside, perhaps you know this, but let me mention that I traveled to Ukraine\n\n01:16.000 --> 01:22.000\n and saw, heard, felt things that are haunting and gave me a lot to think about.\n\n01:22.000 --> 01:27.000\n Because of that, I've been really struggling to edit the videos I recorded.\n\n01:27.000 --> 01:29.000\n I hope to finish it soon.\n\n01:29.000 --> 01:34.000\n I'm sorry for these delays, and I'm especially sorry to the people there who gave me their time,\n\n01:34.000 --> 01:37.000\n their story, their heart.\n\n01:37.000 --> 01:39.000\n Please be patient with me.\n\n01:39.000 --> 01:41.000\n I hope you understand.\n\n01:41.000 --> 01:43.000\n This is the Lex Readman Podcast.\n\n01:43.000 --> 01:46.000\n To support it, please check out our sponsors in the description.\n\n01:46.000 --> 01:50.000\n And now, dear friends, here's Noam Chomsky.\n\n01:50.000 --> 01:58.000\n You have studied and criticized powerful leaders and nations in times of global conflict and struggles for power.\n\n01:58.000 --> 02:03.000\n So let me ask you, what do you think motivates Vladimir Putin?\n\n02:03.000 --> 02:11.000\n Is it power, legacy, fame, geopolitical influence, or the flourishing of a nation he loves and represents?\n\n02:11.000 --> 02:18.000\n I have no particular insight into Putin's mind.\n\n02:18.000 --> 02:28.000\n I can only watch the actions over the last 20, 25 years and read the statements.\n\n02:28.000 --> 02:38.000\n Took power about almost 25 years ago, has held it since as prime minister or president.\n\n02:38.000 --> 02:51.000\n His first task was to try to overcome the chaos and disarray of the 1990s.\n\n02:51.000 --> 03:08.000\n During the 90s, Gorbachev had a proposal, he called for a cooperative enterprise with the West.\n\n03:08.000 --> 03:15.000\n They would share an effort to rebuild what he called a common European home,\n\n03:15.000 --> 03:24.000\n in which there would be no military alliances, just Russia, Western US accommodation,\n\n03:24.000 --> 03:36.000\n with a move towards social democracy and former USSR and comparable moves in the United States.\n\n03:36.000 --> 03:42.000\n Well, that was quickly smashed. The United States had no interest in that.\n\n03:42.000 --> 03:47.000\n Clinton came along pretty soon, early 90s.\n\n03:47.000 --> 03:56.000\n Russia was induced to adopt what was called shock therapy,\n\n03:56.000 --> 04:03.000\n a harsh, quick market transformation, which devastated the economy,\n\n04:03.000 --> 04:17.000\n created enormous social disarray, rise of what are called oligarchs, kleptocrats, high mortality.\n\n04:17.000 --> 04:23.000\n And Clinton started the policy of expanding NATO to the East\n\n04:23.000 --> 04:30.000\n in violation of firm, unambiguous promises to Gorbachev not to do so.\n\n04:30.000 --> 04:39.000\n Yeltsin, Putin's friend, opposed it. Other Russian leaders opposed it, but they didn't react.\n\n04:39.000 --> 04:45.000\n They accepted it. When Putin came in, he continued that policy.\n\n04:45.000 --> 04:49.000\n Meanwhile, did reconstruct the Russian economy.\n\n04:49.000 --> 04:58.000\n Russian society became a viable, deeply authoritarian society under his tight control.\n\n04:58.000 --> 05:06.000\n He himself organized a major kleptocracy with him in the middle,\n\n05:06.000 --> 05:10.000\n apparently became very wealthy. On the international front,\n\n05:10.000 --> 05:17.000\n he pretty much continued the former policies as US diplomats,\n\n05:17.000 --> 05:24.000\n practically every diplomat who had any contact with Russia had been dispatched there,\n\n05:24.000 --> 05:30.000\n knew about it, as they all warned from the 90s that what Clinton was doing,\n\n05:30.000 --> 05:38.000\n expanded by Bush afterwards, was reckless and provocative,\n\n05:38.000 --> 05:46.000\n that Russia did have a clear red line before Putin, which he adhered to,\n\n05:46.000 --> 05:51.000\n namely no NATO membership for Ukraine and Georgia.\n\n05:51.000 --> 06:00.000\n This is pretty much how things went on through the 2000s.\n\n06:00.000 --> 06:10.000\n In 2008, President Bush did invite Ukraine to join NATO.\n\n06:10.000 --> 06:17.000\n That was vetoed by France and Germany, but under US pressure, it was kept on the agenda.\n\n06:17.000 --> 06:22.000\n The Russians continued to object. Western diplomats,\n\n06:22.000 --> 06:29.000\n including the present current head of the CIA and his predecessors,\n\n06:29.000 --> 06:35.000\n warned that this was reckless, provocative, shouldn't be done, continued.\n\n06:35.000 --> 06:41.000\n Putin didn't do much. He stayed with it until pretty recently.\n\n06:41.000 --> 06:51.000\n After 2014, the uprising that threw out the former president,\n\n06:51.000 --> 06:56.000\n who was pro Russian, instituted anti Russian laws.\n\n06:56.000 --> 07:07.000\n The United States and NATO began a policy of moving to effectively integrate Ukraine\n\n07:07.000 --> 07:17.000\n into the NATO command, joint military exercises, training, sending weapons and so on.\n\n07:17.000 --> 07:26.000\n Putin objected. Other Russian leaders objected. They're unified on this, but didn't do much.\n\n07:26.000 --> 07:37.000\n They continued with the proposals that Ukraine be excluded from NATO,\n\n07:37.000 --> 07:43.000\n and that there be some form of autonomy for the Donbass region.\n\n07:43.000 --> 07:51.000\n Meanwhile, in reaction to the uprising, the Maidan Uprising 2014,\n\n07:51.000 --> 08:01.000\n Russia moved in and took over Crimea, protecting its warm water base and major naval base.\n\n08:01.000 --> 08:09.000\n The US objected and recognised it, but things continued without notable conflict.\n\n08:09.000 --> 08:14.000\n I won't go through all the details. When Joe Biden came in,\n\n08:14.000 --> 08:27.000\n he expanded the program of what US military journals call a defective integration of Ukraine within NATO,\n\n08:27.000 --> 08:40.000\n proposed September 2021, proposed enhanced program of preparation for NATO mission,\n\n08:40.000 --> 08:48.000\n extended with a formal statement in November. We're now practically up to the invasion.\n\n08:48.000 --> 08:55.000\n Putin's position hardened. France, mainly France, to an extent Germany,\n\n08:55.000 --> 09:04.000\n did make some moves towards possible negotiations. Putin dismissed them,\n\n09:04.000 --> 09:16.000\n moved on to the direct invasion. What are his, to get back to your question, what motivates him?\n\n09:16.000 --> 09:26.000\n I presume what he's been saying all along, namely establishing his legacy as a leader\n\n09:26.000 --> 09:35.000\n who overcame the extensive destruction of Russia, massive weakening over it,\n\n09:35.000 --> 09:42.000\n restored his position as a world power, prevented Ukraine from entering NATO.\n\n09:42.000 --> 09:50.000\n It may have further ambitions as to dominating and controlling Ukraine, very likely.\n\n09:50.000 --> 10:02.000\n There is a theory in the West that he suddenly became a total madman who wants to restore the great Russian empire.\n\n10:02.000 --> 10:16.000\n This is combined with the gloating over the fact that the Russian military is a paper tiger that can't even conquer cities\n\n10:16.000 --> 10:23.000\n a couple of kilometers from the border, but defended not even by a regular army.\n\n10:23.000 --> 10:32.000\n But somehow along with this, he's planning to attack NATO powers, conquer Europe, who knows what.\n\n10:32.000 --> 10:39.000\n It's impossible to put all these concepts together. They're totally internally contradictory.\n\n10:39.000 --> 10:48.000\n So what's my judgment? I think what motivates him is what he's been demonstrating in his actions.\n\n10:48.000 --> 11:00.000\n Restore Russia as a great power, restore its economy, control it as a total dictatorship,\n\n11:00.000 --> 11:09.000\n enrich himself and his cronies, establish a legacy as a major figure in Russian history,\n\n11:09.000 --> 11:19.000\n make sure that Ukraine does not join NATO, and probably by now he's hardened the position,\n\n11:19.000 --> 11:32.000\n maintain Crimea and the southeastern corridor to Russia, and some ambiguous agreements about the Donbass region.\n\n11:32.000 --> 11:39.000\n That looks like his motivation. There's much speculation that goes beyond this,\n\n11:39.000 --> 11:54.000\n but it's very hard to reconcile with the assessment of the real world by the same people who are making the grandiose speculations.\n\n11:54.000 --> 12:04.000\n I don't think anything's changed.\n\n12:04.000 --> 12:14.000\n It seems to me his policies are about the same as what they were. They've changed in response to changed circumstances.\n\n12:14.000 --> 12:22.000\n So very recently, right before the invasion, a few weeks before, for the first time,\n\n12:22.000 --> 12:34.000\n Putin announced recognition of the independence of the Donbass region. That's a stronger position than before, much stronger.\n\n12:34.000 --> 12:45.000\n Up till then, he had pretty much kept to the longstanding position of some kind of accommodation within a federal structure\n\n12:45.000 --> 12:53.000\n in which the Donbass region would have considerable autonomy. So that's a harshening of the position.\n\n12:53.000 --> 12:57.000\n So even the human mind of Vladimir Putin, the man?\n\n12:57.000 --> 13:04.000\n I can't read his mind. I can only see the policies that he's pursued and the statements that he's made.\n\n13:04.000 --> 13:15.000\n There are many people speculating about his mind. And as I say, these speculations are, first of all, not based on anything.\n\n13:15.000 --> 13:21.000\n Never said anything about trying to conquer NATO. But more importantly,\n\n13:21.000 --> 13:31.000\n they are totally inconsistent with the analyses of Russian power by the same people who are making the speculations.\n\n13:31.000 --> 13:46.000\n So we see the same individual speculating about Putin's grandiose plans to become Peter the Great and conquer,\n\n13:46.000 --> 13:55.000\n start attacking NATO powers, on the one hand saying that, on the other hand gloating over the fact that his military powers\n\n13:55.000 --> 14:03.000\n so minuscule he can't even conquer towns a couple miles from the border.\n\n14:03.000 --> 14:07.000\n Well, it's impossible to make sense of that position.\n\n14:07.000 --> 14:17.000\n Why did Russia invade Ukraine on February 24th? Who do you think is to blame? Who do you place the blame on?\n\n14:17.000 --> 14:29.000\n Well, who's to blame? Any power that commits aggression is to blame. So I continue to say, as I have been for many months,\n\n14:29.000 --> 14:41.000\n that Putin's invasion of Ukraine is on a par with such acts of aggression as the U.S. invasion of Iraq,\n\n14:41.000 --> 14:55.000\n the Stalin, Hitler invasion of Poland, other acts of supreme international crime under international law.\n\n14:55.000 --> 14:58.000\n Of course he's to blame.\n\n14:58.000 --> 15:04.000\n The U.S. committed $6.9 billion in military assistance to Ukraine since the Russian invasion.\n\n15:04.000 --> 15:08.000\n Should U.S. keep up with this support?\n\n15:08.000 --> 15:18.000\n There are two questions. One has to do with providing support for defense against the invasion, which is certainly legitimate.\n\n15:18.000 --> 15:28.000\n The other is seeking ways to end the crime before even worse disasters arise.\n\n15:28.000 --> 15:33.000\n Now that second part is not discussed in the West, barely discussed.\n\n15:33.000 --> 15:43.000\n Anyone who dares to discuss it is immediately subjected to a flood of invective and hysterical condemnation.\n\n15:43.000 --> 15:48.000\n But if you're serious about Ukraine, there are two things you ask.\n\n15:48.000 --> 15:54.000\n One, what can we do to support Ukraine in defense against aggression?\n\n15:54.000 --> 16:06.000\n Second, how can we move to end the war before it leads to even worse destruction of Ukraine, more starvation worldwide,\n\n16:06.000 --> 16:17.000\n reversing the limited efforts to deal with global warming, possibly moving up an escalation out of the war, the nuclear war.\n\n16:17.000 --> 16:27.000\n That's the second half of the borrow, a phrase attributed to Winston Churchill.\n\n16:27.000 --> 16:33.000\n There's a lot of war, war, but no joy, joy, joy.\n\n16:33.000 --> 16:39.000\n And there ought to be joy, joy if you care about Ukraine and the rest of the world.\n\n16:39.000 --> 16:41.000\n Can it be done? We don't know.\n\n16:41.000 --> 16:56.000\n Official U.S. policy is to reject a diplomatic settlement, to move to weaken Russia severely so that it cannot carry out further aggression,\n\n16:56.000 --> 17:07.000\n but not do anything on the joy, joy side, not think of how to bring the crimes and atrocities to an end.\n\n17:07.000 --> 17:10.000\n That's the second part of the question.\n\n17:10.000 --> 17:20.000\n So, yes, the U.S. should continue with the kind of calibrated support that's been given.\n\n17:20.000 --> 17:34.000\n The Pentagon wisely has vetoed initiatives to go well beyond support for defense up to attack on Russia.\n\n17:34.000 --> 17:42.000\n So far, the Pentagon, which seems to be the dovish component in the U.S. administration,\n\n17:42.000 --> 17:49.000\n has vetoed plans which very likely would lead on to nuclear war, which would destroy everything.\n\n17:49.000 --> 17:58.000\n So calibrated provision of weapons to blunt the offensive, allow Ukraine to defend itself,\n\n17:58.000 --> 18:11.000\n if sensible, combined with efforts to see if something can be done to bring the crimes and atrocities to an end\n\n18:11.000 --> 18:21.000\n and avert the much worse consequences that are in store, that would be instead the U.S. only dealing with the first.\n\n18:21.000 --> 18:29.000\n And all of our discussions limit themselves to the first in the United States and in Britain, not in Europe.\n\n18:29.000 --> 18:35.000\n Do you worry about nuclear war in the 21st century? How do we avoid it?\n\n18:35.000 --> 18:41.000\n Anyone who doesn't worry about nuclear war doesn't have a gray cell functioning.\n\n18:41.000 --> 18:46.000\n Of course, everyone is worried about nuclear war, or should be.\n\n18:46.000 --> 18:54.000\n It's very easy to see how steps could be taken, even been recommended, that would lead to nuclear war.\n\n18:54.000 --> 19:05.000\n So you can read articles even by liberal commentators who say we should drop all the pretenses, just go to war against Russia.\n\n19:05.000 --> 19:08.000\n They have to be destroyed.\n\n19:08.000 --> 19:19.000\n You can see proposals coming from Congress, the leading figures, saying we should establish a no fly zone.\n\n19:19.000 --> 19:29.000\n Pentagon objects. They point out correctly that to establish a no fly zone, you have to have control of the air,\n\n19:29.000 --> 19:37.000\n which means destroying Russian air defense systems, which happen to be inside Russia.\n\n19:37.000 --> 19:41.000\n We don't know that Russia won't react.\n\n19:41.000 --> 19:53.000\n Even the call, now almost universal, to ensure that Ukraine wins, drives out all the Russians, drives them out of the country,\n\n19:53.000 --> 19:58.000\n sounds nice on paper, but notice the assumption.\n\n19:58.000 --> 20:10.000\n The assumption is that Vladimir Putin, this madman who just seeks power and is out of control, will sit there quietly,\n\n20:10.000 --> 20:20.000\n accept defeat, slink away, not use the military means that of course he has to destroy Ukraine.\n\n20:20.000 --> 20:31.000\n One of the interesting comments that came out in today's long article, I think Washington Post reviewing a lot of leaks,\n\n20:31.000 --> 20:41.000\n actually not leaks, actually presented by U.S. intelligence and U.S. leaders about the long build up to the war.\n\n20:41.000 --> 20:50.000\n One of the points it made was surprised on the part of British and U.S. leaders about Putin's strategy\n\n20:50.000 --> 20:59.000\n and his failure to adopt, to fight the war the way the U.S. and Britain would, with real shock and awe,\n\n20:59.000 --> 21:04.000\n destruction of communication facilities, of energy facilities and so on.\n\n21:04.000 --> 21:07.000\n They can't understand why he hasn't done all that.\n\n21:07.000 --> 21:21.000\n If you want to make it very likely that that will happen, then insist on fighting until somehow Russia faces total defeat.\n\n21:21.000 --> 21:35.000\n Then it's a gamble, but if he's as crazy and insane as you claim, presumably will use weapons that he hasn't used yet to destroy Ukraine.\n\n21:35.000 --> 21:41.000\n So the West is taking an extraordinary gamble with the fate of Ukraine.\n\n21:41.000 --> 21:52.000\n Gambling that the madman, lunatic, mad Vlad won't use the weapons he has to destroy Ukraine\n\n21:52.000 --> 21:58.000\n and set the stage for escalation of the latter which might lead to nuclear war.\n\n21:58.000 --> 22:00.000\n It's quite a gamble.\n\n22:00.000 --> 22:06.000\n How much propaganda is there in the world today in Russia, in Ukraine, in the West?\n\n22:06.000 --> 22:08.000\n It's extraordinary.\n\n22:08.000 --> 22:12.000\n In Russia, of course, it's total.\n\n22:12.000 --> 22:14.000\n Ukraine is a different story.\n\n22:14.000 --> 22:15.000\n They're at war.\n\n22:15.000 --> 22:17.000\n They expect propaganda.\n\n22:17.000 --> 22:28.000\n In the West, let me quote Graham Fuller, very highly placed in U.S. intelligence,\n\n22:28.000 --> 22:36.000\n one of the top officials for decades dealing mostly with Russia and Central Asia.\n\n22:36.000 --> 22:49.000\n He recently said that in all the years of the Cold War, he's never seen any extreme Russia phobia to the extent that he sees today.\n\n22:49.000 --> 22:53.000\n I think that's pretty accurate.\n\n22:53.000 --> 23:10.000\n I mean, the U.S. has even canceled Russian outlets, which means if you want to find out what Sergei Lavrov or other Russian officials are saying,\n\n23:10.000 --> 23:14.000\n you can't look it up on their own outlets.\n\n23:14.000 --> 23:27.000\n You have to go through Al Jazeera, Indian state television or someplace where they still allow Russian positions to be expressed.\n\n23:27.000 --> 23:31.000\n And of course, the propaganda is just outlandish.\n\n23:31.000 --> 23:34.000\n I think Fuller is quite correct on this.\n\n23:34.000 --> 23:38.000\n In Russia, of course, you expect total propaganda.\n\n23:38.000 --> 23:46.000\n There's nothing, any independent outlets such as there were have been crushed.\n\n23:46.000 --> 23:54.000\n If the media is a source of inaccuracies and even lies, then how do we find the truth?\n\n23:54.000 --> 24:01.000\n I don't regard the media as a source of inaccuracies and lies.\n\n24:01.000 --> 24:03.000\n They do exist.\n\n24:03.000 --> 24:09.000\n But by and large, media reporting is reasonably accurate.\n\n24:09.000 --> 24:19.000\n Reporters, the journalists themselves, as in the past, do courageous, honest work.\n\n24:19.000 --> 24:23.000\n I've written about this for 50 years.\n\n24:23.000 --> 24:26.000\n My opinion hasn't changed.\n\n24:26.000 --> 24:31.000\n But they do pick certain things and not other things.\n\n24:31.000 --> 24:37.000\n There's selection, there's framing, there's ways of presenting things.\n\n24:37.000 --> 24:45.000\n All of that forms a kind of propaganda system, which you have to work your way through.\n\n24:45.000 --> 24:50.000\n But it's rarely a matter of straight, outright lying.\n\n24:50.000 --> 24:54.000\n So there's a difference between propaganda and lying?\n\n24:54.000 --> 25:02.000\n Of course, a propaganda system shapes and limits the material that's presented.\n\n25:02.000 --> 25:05.000\n It may tell the truth within that framework.\n\n25:05.000 --> 25:12.000\n So let me give you a concrete example, which I wrote about extensively.\n\n25:12.000 --> 25:19.000\n I have a book called Manufacturing Consent jointly with Edward Herman.\n\n25:19.000 --> 25:26.000\n It's about his term, which I had accepted a propaganda model of the media.\n\n25:26.000 --> 25:30.000\n A large part of the book is defense of the media.\n\n25:30.000 --> 25:36.000\n Defense of the media against harsh attacks by Freedom House.\n\n25:36.000 --> 25:40.000\n Several volumes they published attacking the media,\n\n25:40.000 --> 25:47.000\n charging that the media were so adversarial and dishonest that they lost the war in Vietnam.\n\n25:47.000 --> 25:52.000\n Well, it took the trouble of reading through the two volumes.\n\n25:52.000 --> 25:57.000\n One volume is charges, the next volume is evidence.\n\n25:57.000 --> 26:01.000\n Turns out that all of the evidence is lies.\n\n26:01.000 --> 26:03.000\n They had no evidence.\n\n26:03.000 --> 26:05.000\n They were just lying.\n\n26:05.000 --> 26:11.000\n The media, in fact, the journalists were doing honest, courageous work.\n\n26:11.000 --> 26:16.000\n But within a certain framework.\n\n26:16.000 --> 26:24.000\n A framework of assuming that the American cause was basically just, basically honorable,\n\n26:24.000 --> 26:28.000\n making mistakes, doing bad things.\n\n26:28.000 --> 26:38.000\n But the idea of questioning that the United States was engaged in a major war crime.\n\n26:38.000 --> 26:40.000\n That's off the record.\n\n26:40.000 --> 26:50.000\n So unfortunately, there was this crime and that crime which harmed their effort to do good and so on.\n\n26:50.000 --> 26:53.000\n Well, that's not lying, it's propaganda.\n\n26:53.000 --> 26:55.000\n So how do we find the truth?\n\n26:55.000 --> 26:58.000\n How do we find the truth?\n\n26:58.000 --> 27:01.000\n That's what you have a brain for.\n\n27:01.000 --> 27:03.000\n It's not deep.\n\n27:03.000 --> 27:05.000\n It's quite shallow.\n\n27:05.000 --> 27:07.000\n It's not quantum physics.\n\n27:07.000 --> 27:09.000\n Put a little effort into it.\n\n27:09.000 --> 27:13.000\n Think about, look for other sources.\n\n27:13.000 --> 27:15.000\n Think a little about history.\n\n27:15.000 --> 27:18.000\n Look at the documentary record.\n\n27:18.000 --> 27:25.000\n They're all pretty well fools together and you can get a reasonable understanding of what's happening.\n\n27:25.000 --> 27:35.000\n If you could sit down with Vladimir Putin and ask him a question or talk to him about an idea, what would you say?\n\n27:35.000 --> 27:40.000\n I would walk out of the room, just as with almost any other leader.\n\n27:40.000 --> 27:42.000\n I know what he's going to say.\n\n27:42.000 --> 27:43.000\n I read the party line.\n\n27:43.000 --> 27:45.000\n I read his pronouncements.\n\n27:45.000 --> 27:47.000\n Doesn't want to hear from me.\n\n27:47.000 --> 27:59.000\n Am I going to say, why did you carry out a crime that's comparable to the US invasion of Iraq and the Stalin Hitler invasion of Poland?\n\n27:59.000 --> 28:02.000\n Am I going to ask that question?\n\n28:02.000 --> 28:26.000\n If I met with John F. Kennedy today, would I ask, why did you radically escalate the war in Vietnam, launch the US Air Force, start authorized napalm, drive launch programs to drive villagers who you know are supporting the National Liberation Front,\n\n28:26.000 --> 28:32.000\n drive them into concentration camps to separate them from the forces they're defending?\n\n28:32.000 --> 28:34.000\n Would I have asked him that?\n\n28:34.000 --> 28:36.000\n Of course not.\n\n28:36.000 --> 28:50.000\n Do you think the people who led us into the war in Vietnam, the war in Afghanistan and Iraq, the war in Ukraine are evil?\n\n28:50.000 --> 29:03.000\n I mean, it's very hard to be in a position of leadership of a violent, aggressive power without carrying out evil acts.\n\n29:03.000 --> 29:06.000\n Are the people evil?\n\n29:06.000 --> 29:11.000\n I mean, I'm not their moral advisors.\n\n29:11.000 --> 29:13.000\n I don't know anything about them.\n\n29:13.000 --> 29:19.000\n I look at their actions, their statements, their policies, evaluate those.\n\n29:19.000 --> 29:24.000\n Their families can evaluate their personalities.\n\n29:24.000 --> 29:29.000\n Will there be a war between US and China in the 21st century?\n\n29:29.000 --> 29:33.000\n If there is, we're finished.\n\n29:33.000 --> 29:43.000\n A war between the US and China would destroy the possibilities of organized life on Earth.\n\n29:43.000 --> 29:55.000\n In fact, we can put it differently. Unless the US and China reach an accommodation and work together and cooperatively,\n\n29:55.000 --> 30:00.000\n it's very unlikely that organized human society will survive.\n\n30:00.000 --> 30:14.000\n We are facing enormous problems, problems, destruction of the environment, endemics, threat of nuclear war.\n\n30:14.000 --> 30:23.000\n None of these decline of democratic functioning of an arena for rational discourse.\n\n30:23.000 --> 30:26.000\n None of these things have boundaries.\n\n30:26.000 --> 30:34.000\n We either work together to overcome them, which we can do, or we'll all sink together.\n\n30:34.000 --> 30:37.000\n That's the real question we should be asking.\n\n30:37.000 --> 30:42.000\n What the United States is doing is not helping.\n\n30:42.000 --> 30:57.000\n So the current US policy, which is perfectly open, nothing secret about it, is to what's called encircle China with sentinel states,\n\n30:57.000 --> 31:14.000\n South Korea, Japan, Australia, which will be heavily armed, provided by Biden with precision weapons aimed at China,\n\n31:14.000 --> 31:23.000\n backed by major naval operations, huge naval operations just took place in the Pacific.\n\n31:23.000 --> 31:32.000\n Many nations participating, RIMPAC didn't get reported here, as far as I know, but an enormous operation threatening China.\n\n31:32.000 --> 31:41.000\n All of this to encircle China, to continue with policies like that.\n\n31:41.000 --> 31:56.000\n Somebody like Pelosi, just to probably make her look more, I don't know what her motives are, taking a highly provocative,\n\n31:56.000 --> 32:02.000\n stupid act, opposed by the military, opposed by the White House.\n\n32:02.000 --> 32:09.000\n Yes, acts like that, which of course called for the response of highly dangerous.\n\n32:09.000 --> 32:14.000\n We don't have to do that. We don't have to increase the threat.\n\n32:14.000 --> 32:20.000\n I mean, right now, the last NATO summit, take a look at it.\n\n32:20.000 --> 32:33.000\n For the first time, it invited to attend countries that are in the sentinel states surrounding China and circling China from the east.\n\n32:33.000 --> 32:41.000\n And it, in fact, extended the range of NATO to what's called the Indo Pacific region.\n\n32:41.000 --> 32:55.000\n So all of us by now, the North Atlantic includes the whole Indo Pacific region to try to ensure that we can overcome the so called China threat.\n\n32:55.000 --> 33:03.000\n Certainly, we might ask exactly what the China threat is. It's done sometimes.\n\n33:03.000 --> 33:16.000\n So former prime minister of Australia, Paul Keating, well known international diplomat, had an article a while ago in the Australian press.\n\n33:16.000 --> 33:22.000\n That's right in the claws of the dragon asking, going through what the China threat is.\n\n33:22.000 --> 33:30.000\n He ran through the various claims, finally concluded the China threat is that China exists.\n\n33:30.000 --> 33:36.000\n It exists. It does not follow U.S. orders. It's not like Europe.\n\n33:36.000 --> 33:42.000\n Europe does what the United States tells it to do, even if it doesn't like it.\n\n33:42.000 --> 33:49.000\n China just ignores what the U.S. says. There's a formal way of describing this.\n\n33:49.000 --> 33:54.000\n There are two versions of the international order.\n\n33:54.000 --> 34:04.000\n One version is the U.N. based international order, which theoretically we subscribe to, but we don't accept.\n\n34:04.000 --> 34:14.000\n The U.N. based international order is unacceptable to the United States because it bans U.S. foreign policy.\n\n34:14.000 --> 34:27.000\n Literally, it explicitly bans the threat or use of force in international affairs, except under circumstances that almost never arise.\n\n34:27.000 --> 34:36.000\n Well, that's U.S. foreign policy. Try to find a president who isn't engaged in the threat or use of force in international affairs.\n\n34:36.000 --> 34:48.000\n So obviously we can't accept the U.N. based international system, even though under the Constitution, that's the supreme law of the land.\n\n34:48.000 --> 34:56.000\n It doesn't matter. So the United States has what's called a rule based international order.\n\n34:56.000 --> 35:02.000\n That's acceptable because it's the United States that sets the rules.\n\n35:02.000 --> 35:08.000\n So we want a rule based international order where the U.S. sets the rules.\n\n35:08.000 --> 35:20.000\n In commentary in the United States, even in scholarship, almost 100 percent calling for a rule based international order.\n\n35:20.000 --> 35:31.000\n Is that false? No, it's true. Is it propaganda? Of course it's propaganda because of what's not said and because of what's presupposed.\n\n35:31.000 --> 35:39.000\n An answer to an earlier question. Well, China does not accept the rule based international order.\n\n35:39.000 --> 35:47.000\n So when the U.S. imposes demands, Europe may not like them, but they follow them.\n\n35:47.000 --> 35:55.000\n China ignores them. So take, for example, the U.S. sanctions on Iran.\n\n35:55.000 --> 36:08.000\n The U.S. has to punish Iran because the United States pulled out of the, unilaterally pulled out of the Iran nuclear agreements.\n\n36:08.000 --> 36:19.000\n So in order to punish Iran for wrecking the agreements in violation of Security Council orders, we impose very harsh sanctions.\n\n36:19.000 --> 36:35.000\n Europe strongly opposes the sanctions, condemn them harshly, but it adheres to them because you don't disobey U.S. orders.\n\n36:35.000 --> 36:43.000\n That's too dangerous. China ignores them. They're not keeping to the rule based international order.\n\n36:43.000 --> 36:58.000\n Well, that's unacceptable. In fact, it's said pretty openly. You can hear the Secretary of State and others saying China is challenging our global hegemony.\n\n36:58.000 --> 37:05.000\n Yes, they are. They don't accept U.S. global hegemony, especially in the waters off China.\n\n37:05.000 --> 37:16.000\n They do a lot of rotten things, China. I mean, internally, there's all kind of repression, violence and so on.\n\n37:16.000 --> 37:29.000\n But first of all, that's not a threat to us. And second, the U.S. doesn't care about it because it easily accepts and supports comparable crimes and atrocities internal to allies.\n\n37:29.000 --> 37:41.000\n So, yes, we should protest it, but without hypocrisy. We have no standing to protest it. We support comparable things in all sorts of other places.\n\n37:41.000 --> 37:57.000\n Just take a look at the U.S. foreign aid. The leading recipient of U.S. foreign aid is Israel, which is engaged in constant terror, violence and repression, constant, almost daily.\n\n37:57.000 --> 38:05.000\n Second leading recipient is Egypt, one of the worst dictatorships in Egypt's history.\n\n38:05.000 --> 38:13.000\n About 60,000 people in jail, political prisoners tortured and so on. Do we care?\n\n38:13.000 --> 38:21.000\n Second leading recipient. I mean, what are we talking about? That's why most of the world just laughs at us.\n\n38:21.000 --> 38:38.000\n There's a lot of failure to understand here about why the global South doesn't join us in our proxy war against Russia, fighting Russia until it's severely weakened.\n\n38:38.000 --> 38:43.000\n They don't join us. Here, the question is, what's wrong with them?\n\n38:43.000 --> 38:56.000\n They look into their minds to figure out what's wrong. They have a different attitude. They say, yes, we oppose the invasion of Ukraine, terrible crime.\n\n38:56.000 --> 39:06.000\n But what are you talking about? This is what you do to us all the time. You don't care about crimes like this. That's most of the global South.\n\n39:06.000 --> 39:17.000\n We can't comprehend that because we're so insulated that we are just obviously right and everyone who doesn't go along must be wrong.\n\n39:17.000 --> 39:29.000\n Do you think the United States as a global leader, as an empire, may collapse in this century? Why and how will it happen and how can we avoid it?\n\n39:29.000 --> 39:49.000\n The United States can certainly harm itself severely. That's what we're doing right now. Right now, the greatest threat to the United States is internal countries tearing itself apart.\n\n39:49.000 --> 40:12.000\n I really don't have to run through it with you. Take a look at something as elementary as mortality. The United States is the only country outside of war, life expectancy is declining, mortality is increasing.\n\n40:12.000 --> 40:28.000\n It doesn't happen anywhere. You take a look at health outcomes generally. They're among the worst among the developed societies and health spending is about twice as high as the developed societies.\n\n40:28.000 --> 40:50.000\n You look at the charts, all of this starts around the late 1970s, early 80s. If you go back to that point, the United States was pretty much a normal developed country in terms of mortality, incarceration, health expenses, other measures.\n\n40:50.000 --> 41:05.000\n Since then, the United States has fallen off the chart. It's gone way off the chart. Well, that's the neoliberal assault of the last 40 years. It's had a major effect on the United States.\n\n41:05.000 --> 41:21.000\n It's left a lot of anger, resentment, violence. Meanwhile, the Republican Party has simply drifted off the spectrum. It's not a normal political party in any usual sense, not what it used to be.\n\n41:21.000 --> 41:39.000\n Its main policy is block anything in order to regain power. That's its policy, stated almost openly by McConnell, followed religiously by the entire Congress.\n\n41:39.000 --> 42:00.000\n That's not the acts of a political party. Of course, democracy has declined. Violence has increased. The judgements, the decisions of the Supreme Court, the court's the most reactionary court in memory.\n\n42:00.000 --> 42:28.000\n To go back to the 19th century, decision after decision is an effort to create a country of white supremacist Christian nationalists. I mean, scarcely hidden, if you read the opinions of Alito, Thomas, Gorsuch, and others.\n\n42:28.000 --> 42:49.000\n So yes, we can destroy ourselves within. And in fact, the ways we're doing it are almost astonishing. So it's well known, for example. Everybody knows that U.S. infrastructure, bridges, subways, and so on, is in terrible shape, needs a lot of repair.\n\n42:49.000 --> 43:03.000\n The American Association of Engineers gives it a failing mark every year. Finally, Congress did pass a limited infrastructure bill, say rebuild bridges and so on.\n\n43:03.000 --> 43:19.000\n It has to be called a China Competition Act. We can't rebuild their bridges because they're falling apart. We have to rebuild their bridges to beat China. It's pathological.\n\n43:19.000 --> 43:34.000\n And that's what's happening inside the country. Take Thomas's decision in the recent case in which he invalidated a New York law.\n\n43:34.000 --> 43:51.000\n This is last October, a couple of weeks ago, and validated a New York law going back to 1913 that required people to have some justification if they wanted to carry concealed weapons in public.\n\n43:51.000 --> 44:08.000\n He went through that with a very interesting decision. He said the United States, he said, is such a decaying, collapsing, hateful society that people just have to have guns.\n\n44:08.000 --> 44:24.000\n I mean, how can you expect somebody to go to the grocery store without a gun in a country as disgusting and hideous as this one? It's essentially what he said. Those weren't his words, but they were the import.\n\n44:24.000 --> 44:33.000\n What gives you hope about the United States, about the future of human civilization?\n\n44:33.000 --> 44:50.000\n Human civilization will not survive unless the United States takes a leading position in dealing with and overcoming the very severe crises that we face.\n\n44:50.000 --> 44:58.000\n The United States is the most powerful country, not only in the world, but in human history. There's nothing to compare with it.\n\n44:58.000 --> 45:06.000\n What the United States does has an overwhelming impact on what happens in the world.\n\n45:06.000 --> 45:29.000\n When the United States alone pulls out of the Paris agreements on dealing with climate change and insists on maximizing the use of fossil fuels and dismantling the regulatory apparatus that provides some mitigation.\n\n45:29.000 --> 45:37.000\n When the United States does that, as it did under Trump, it's a blow to the future of civilization.\n\n45:37.000 --> 45:53.000\n When Republican states today, right now, say they're going to punish corporations that seek to take climate change into account and their investments.\n\n45:53.000 --> 46:04.000\n The U.S. is telling the world, we want to destroy all of us. Again, not their words, but their import. That's what they mean.\n\n46:04.000 --> 46:22.000\n So as long as we have a political organization dedicated to gaining power at any cost, maximizing profit, no matter what the consequences, no future for human civilization.\n\n46:22.000 --> 46:35.000\n Noam, thank you for talking today. Thank you for talking once again. And thank you for fighting for the future of human civilization. Again, thank you.\n\n46:35.000 --> 46:37.000\n Thank you.\n\n46:37.000 --> 46:44.000\n Thanks for listening to this conversation with Noam Chomsky. To support this podcast, please check out our sponsors in the description.\n\n46:44.000 --> 46:59.000\n And now, let me leave you with some words from Voltaire. It is forbidden to kill. Therefore, all murderers are punished unless they kill in large numbers, and to the sound of trumpets.\n\n46:59.000 --> 47:14.000\n Thank you for listening and hope to see you next time.\n\n"
}