{
  "title": "Michael Mina: Rapid COVID Testing | Lex Fridman Podcast #235",
  "id": "80OvNaEgmmw",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.720\n The following is a conversation with Michael Mina, his second time on the podcast.\n\n00:04.720 --> 00:11.840\n He's a professor at Harvard doing research on infectious disease and immunology. In my view,\n\n00:11.840 --> 00:18.640\n the most powerful, doable, and obvious solution to COVID 19 from the very beginning is rapid\n\n00:18.640 --> 00:24.080\n at home testing. This is what Michael has been talking about and writing about since the beginning\n\n00:24.080 --> 00:30.400\n of the pandemic. The accuracy of these tests is high for the task of detecting contagiousness,\n\n00:30.400 --> 00:36.160\n which is what matters. Hundreds of millions can be manufactured quickly and relatively cheaply.\n\n00:36.160 --> 00:41.920\n Privacy and individual freedoms are preserved. I believe that if you give people the power of\n\n00:41.920 --> 00:47.760\n information, information about whether they are contagious or not, they will do the right thing\n\n00:47.760 --> 00:54.560\n at scale, all while respecting their freedom and minimizing the destructive effects of the pandemic\n\n00:54.560 --> 01:01.680\n on our health and our economy. The solution was obvious in May of 2020. It was obvious when Michael\n\n01:01.680 --> 01:08.240\n and I spoke the first time a year ago, and it is obvious today. We talk about why it has not yet\n\n01:08.240 --> 01:15.600\n been done and how we can still do it. This is the Lex Friedman podcast. To support it, please check\n\n01:15.600 --> 01:21.200\n out our sponsors in the description. And now here's my conversation with Michael Mina.\n\n01:22.240 --> 01:30.000\n We spoke a year ago about rapid at home testing, and I think you think it should have been,\n\n01:30.000 --> 01:36.480\n still should be a big part of the solution to COVID. So let's recap. Where do things stand\n\n01:36.480 --> 01:44.640\n today in terms of rapid at home testing? Well, it's certainly something that you're right,\n\n01:44.640 --> 01:53.520\n I do think we should have them today. We've now had almost 20 months of living in anxiety,\n\n01:53.520 --> 01:59.360\n uncertainty, being afraid for our health, for our family's health, for our friends, you know,\n\n01:59.360 --> 02:04.560\n shutdowns, economic instability, everything has been uncertain because of this virus.\n\n02:05.280 --> 02:10.480\n And then there's this little test, and it's the first time for many people that they're using it\n\n02:10.480 --> 02:15.280\n and they're feeling empowered. They're feeling like they can control their little slice\n\n02:16.160 --> 02:22.160\n of this pandemic. So as these tests have come out and more and more and more Americans have\n\n02:22.160 --> 02:27.200\n had an opportunity to go and buy them from, you know, CVS or Walgreens or wherever they're at,\n\n02:28.720 --> 02:35.200\n I think that it's really shifting the tenor of the discussion. For a long time, all of 2020,\n\n02:35.200 --> 02:40.880\n it was like, I often felt like it was me and a few other people against the world, you know,\n\n02:41.840 --> 02:47.120\n these tests should be public health tools, these tests are infectiousness indicators,\n\n02:47.120 --> 02:51.600\n they shouldn't be compared to PCR, you know, all of these different things. And we could,\n\n02:51.600 --> 02:58.400\n of course, go through and recap what the benefits and the metrics are that we should be looking at.\n\n02:58.400 --> 03:05.520\n But the point is, last year and most of this year was about educating scientists, educating\n\n03:05.520 --> 03:12.640\n public health leaders, educating physicians to get them to understand that there is a different\n\n03:12.640 --> 03:17.200\n reason to test in a pandemic than purely diagnostics and transmission blockade and\n\n03:17.200 --> 03:21.360\n severing transmission chains is a big one. So now, I think we're at a point where people\n\n03:21.360 --> 03:26.000\n are now understanding and they're understanding because they are feeling it, they're holding it\n\n03:26.000 --> 03:28.960\n and they're doing it and they're seeing, they're feeling the delight of seeing a negative\n\n03:29.760 --> 03:35.040\n and saying, I feel more comfortable. It's not perfect, but it's pretty darn close to perfect\n\n03:35.760 --> 03:42.640\n to allowing me to go and see my mom without mistakenly infecting her, you know, or whatever\n\n03:42.640 --> 03:48.480\n the story might be. And now that that's happening, I think all of a sudden we're seeing a massive\n\n03:48.480 --> 03:54.960\n change politically for these tests. Biden just came out the COVID 19 action plan the other day\n\n03:54.960 --> 03:59.280\n and one of the main pillars of it was testing and in particular, bringing rapid tests,\n\n03:59.920 --> 04:08.240\n scaling them up. So on that front, I think finally there is success. People are actually understanding\n\n04:08.240 --> 04:14.160\n and, you know, I haven't stopped beating this drum for far too long and I like hate rapid tests now.\n\n04:15.120 --> 04:21.120\n So maybe it's good to step back. Would you say most Americans have not taken a rapid at home test?\n\n04:21.120 --> 04:26.480\n Absolutely. Most have definitely not taken a rapid test. So like many of them probably don't know.\n\n04:26.480 --> 04:33.200\n They kind of probably say testing, they have like memories of testing, like PCR testing,\n\n04:33.200 --> 04:39.440\n they have to go into somewhere and they have to like a swab deep in their nose and that's\n\n04:39.440 --> 04:43.440\n the experience. So maybe when, if you have to travel like Canada or something like that,\n\n04:43.440 --> 04:48.160\n you have to get tested, that kind of stuff. So what are rapid at home tests?\n\n04:48.160 --> 04:56.720\n Yeah. So the rapid at home tests are, I like to call them paper strip tests. They're simple tests\n\n04:56.720 --> 05:05.600\n that, I wish I brought some today, but I didn't. They're simple tests that you swab. At the moment,\n\n05:05.600 --> 05:09.760\n most of them use a swab that you just swab the front of your nose. So it's not one of the deep\n\n05:10.560 --> 05:16.480\n swabs that goes into your brain. And so it's not very uncomfortable. It's just like picking your\n\n05:16.480 --> 05:27.040\n nose, if you will, and you put that swab into a little tube and the tube has some liquid in it.\n\n05:27.040 --> 05:32.560\n And then you put a few drops of that liquid onto a paper strip or you drop the paper strip\n\n05:32.560 --> 05:39.680\n into the tube, just like one of those indicators for the pool. And if you, just like a pregnancy\n\n05:39.680 --> 05:45.120\n test, then if you get two lines, you're positive, one line, you're negative. It's super simple. It\n\n05:45.120 --> 05:50.400\n takes 30 seconds, once you know how to do it, of hands on time. And you wait around 10 minutes,\n\n05:50.400 --> 05:57.280\n and then you read the result. They are extraordinarily effective to answer one\n\n05:57.280 --> 06:05.120\n question, am I infectious? And that is the public health question that we need to answer and\n\n06:05.120 --> 06:11.680\n consistently ask during this pandemic. Are you infectious? Am I infectious? Because it's only\n\n06:11.680 --> 06:17.760\n when we know that we're infectious that we can be empowered to not mistakenly infect others.\n\n06:19.200 --> 06:28.560\n The PCR test is a little different. And we can go into the pros and cons, but one of the major\n\n06:28.560 --> 06:36.000\n differences is that a PCR test gets a lot of... A lot of people talking about the PCR test say it's\n\n06:36.000 --> 06:44.640\n much more sensitive. And at an analytical level, it is. It can detect one molecule instead of\n\n06:44.640 --> 06:52.640\n 100,000. But for public health, we don't want a test that can detect one molecule. In fact,\n\n06:52.640 --> 06:58.560\n that has created a net negative for public health. We just want to know, am I infectious?\n\n06:58.560 --> 07:04.240\n And to know that question, to know if I'm infectious, I only need a test that is going\n\n07:04.240 --> 07:10.800\n to be positive if I have a high viral load, like a million. And the virus grows so fast,\n\n07:10.800 --> 07:16.640\n it will grow from zero to a billion in a day. So you don't really need, even on the front end of an\n\n07:16.640 --> 07:21.760\n infection, you don't need better sensitivity. If the trade off is that you don't get the result\n\n07:21.760 --> 07:27.760\n for one, two or three days, you absolutely want a rapid result that can tell you, yes,\n\n07:27.760 --> 07:33.760\n you're infectious, you're transmitting to others right now. And I'm going to give you the result\n\n07:33.760 --> 07:38.720\n right now. So it is a much more effective tool because it's fast, because it's accessible. We\n\n07:38.720 --> 07:43.680\n can use them in the home. And there's some issues with using them at home. We can talk a little bit\n\n07:43.680 --> 07:49.440\n about what those issues are, like reporting and how do you use everything on the honor system if\n\n07:49.440 --> 07:55.520\n you have a test that you're taking at home and you use it to go to work. But they can be accessible.\n\n07:55.520 --> 08:00.560\n PCR has to go into a lab. It takes a lot of time for somebody to get a PCR test. They either have\n\n08:00.560 --> 08:04.960\n to go online and order it. It takes the next day for it to come back. They swab themselves,\n\n08:04.960 --> 08:10.480\n they ship it out the next day, and then they get a result two days later. That's four days minimum\n\n08:10.480 --> 08:15.040\n for the most part. And at that point, you're not even infectious, even if you did happen to be\n\n08:15.040 --> 08:20.000\n infectious when you first ordered the test. So it's really the speed of these tests and the\n\n08:20.000 --> 08:23.520\n accessibility and distribution of them that makes them so immensely powerful.\n\n08:23.520 --> 08:28.720\n So you have this like amazing graphic you tweeted. It's exactly what you're saying,\n\n08:28.720 --> 08:36.000\n which is rapid antigen test answers the question, am I currently infectious? And you have, I think,\n\n08:36.000 --> 08:43.920\n a comparison of seven different tests based on the viral load. And based on the viral load across\n\n08:43.920 --> 08:50.400\n these different tests, you look at the likelihood of infectiousness. So what does this graphic show?\n\n08:50.400 --> 08:54.960\n We can overlay that for people. I think it's just really nice and really clear.\n\n08:54.960 --> 09:01.360\n Yeah. So what that's showing is that we can never ask what's the sensitivity of a test and just let\n\n09:01.360 --> 09:06.160\n that be the answer. That's what the FDA does currently. And that question doesn't mean\n\n09:06.160 --> 09:12.560\n anything. We have to say, what is the sensitivity of the test to detect what? And so we can have\n\n09:12.560 --> 09:18.320\n different viral loads. For example, you can have a viral load of one or you can have a viral load\n\n09:18.320 --> 09:25.760\n of a trillion. And a PCR test will tell you that you are positive regardless of whether it's one\n\n09:25.760 --> 09:33.520\n or a trillion. Now, so we can't ask the question, how sensitive is a rapid test compared to PCR?\n\n09:33.520 --> 09:37.360\n Because that covers the whole gamut. What we really want to say is, how sensitive is the rapid test\n\n09:38.000 --> 09:46.960\n to detect me if I am infectious? And that gets to about 97% or so sensitive. If the question is,\n\n09:46.960 --> 09:51.120\n how likely is it to detect me if I'm a super spreader? That's a really important one to be\n\n09:51.120 --> 09:56.720\n able to detect. They're all about 100% sensitive. So if you have extraordinarily high viral loads\n\n09:56.720 --> 10:01.600\n to the point where you might be a super spreader, these simple rapid tests will essentially always\n\n10:01.600 --> 10:06.960\n catch you and tell you you're positive. And then as you go down the line, if you're no longer\n\n10:06.960 --> 10:14.400\n infectious at all, then these rapid tests might have a 0% sensitivity compared to PCR.\n\n10:14.400 --> 10:19.200\n But that's actually a good thing. The FDA and others look at it as though it's a bad thing\n\n10:19.200 --> 10:24.960\n because they average it all together and say, oh, this is only a 40% sensitive test compared to PCR.\n\n10:26.160 --> 10:30.080\n But that's not the right way to look at it. You want to say, well, out of all of the samples,\n\n10:30.080 --> 10:34.640\n how many of them were not transmissible? How many were mid, moderate, high, extremely high,\n\n10:34.640 --> 10:38.480\n super spreader? And you should at the very least create a weighted average based on\n\n10:38.480 --> 10:44.160\n transmissibility potential. We don't do that. And that's why nobody in America has these tests,\n\n10:44.160 --> 10:50.560\n because that's why they're very rare. Because we have slowed down their authorization because of\n\n10:50.560 --> 10:56.880\n that misunderstanding that they don't have to be 80% or 90% sensitive compared to any time PCR\n\n10:56.880 --> 11:03.760\n positivity. They need to be 80% or 90% or more if you're infectious. And for that question,\n\n11:03.760 --> 11:08.240\n they're like 95% up to 100% sensitive when you're most infectious.\n\n11:08.240 --> 11:14.720\n So when you have a lot of virion particles in you, that's what it means when you say viral load,\n\n11:14.720 --> 11:18.960\n that means you're going to be very infectious. The more you have, the more infectious you are.\n\n11:18.960 --> 11:24.560\n And this test is basically very good at detecting when you're very infectious.\n\n11:25.760 --> 11:33.200\n Why don't we have rapid at home tests? You said there's a bit of confusion. FDA is involved.\n\n11:33.200 --> 11:40.560\n You've talked about, you continue to talk about that these at home tests are classified as,\n\n11:40.560 --> 11:46.160\n I guess, medical devices. And so because of that, FDA is looking at them differently\n\n11:47.440 --> 11:54.880\n than they probably should be looked at. So what's the problem here? Can you sort of explain\n\n11:54.880 --> 11:59.360\n what does it mean to be a medical device? Why is that an issue? Where is the FDA messing up?\n\n11:59.360 --> 12:05.840\n So when we declare something as a medical device and we evaluate as a medical device,\n\n12:05.840 --> 12:10.880\n then it makes sense that the comparison, if you're trying to get a new one onto the market,\n\n12:11.600 --> 12:15.840\n that the comparison would be against a gold standard medical device for that purpose.\n\n12:17.040 --> 12:24.640\n So PCR is currently the gold standard, or at least in the eyes of the FDA,\n\n12:24.640 --> 12:32.400\n the PCR test is the gold standard medical device. And that's because it's so sensitive.\n\n12:33.280 --> 12:39.280\n As a physician, I have one patient in front of me at a time. And that patient comes to me and I\n\n12:39.280 --> 12:47.120\n don't have to care about the 99.9999% of people in the world who are not in front of me. I only\n\n12:47.120 --> 12:51.920\n care about that one patient. And so when I get a sample from that patient and that patient's saying,\n\n12:51.920 --> 12:56.480\n Doc, I don't feel well. I haven't been feeling well for the last few weeks. Do you think this\n\n12:56.480 --> 13:02.960\n is COVID? Well, for that question, I want to have the absolute best sensitivity test,\n\n13:04.080 --> 13:08.800\n regardless of what it means for transmissibility, because my patient isn't sitting in my office\n\n13:08.800 --> 13:14.080\n saying, Doc, do you think I'm infectious? They're saying, Doc, do you think I have recently been or\n\n13:14.080 --> 13:20.320\n am infected? And these are totally different things. One is medicine. And if the patient's\n\n13:20.320 --> 13:24.720\n infected, the time isn't of the essence because they're sitting there in my office. I can say,\n\n13:24.720 --> 13:29.680\n look, I'm sorry you're not feeling well. Let's get a PCR test on you. We'll be able to tell\n\n13:29.680 --> 13:34.960\n you if you have any evidence that there has been recently an infection inside of you.\n\n13:35.920 --> 13:41.760\n And you'll get the results in a couple of days. And it might be expensive. And so insurance is\n\n13:41.760 --> 13:46.480\n going to pay for it. And you're just one person. And so I don't really care how many resources it\n\n13:46.480 --> 13:53.120\n takes to get you this answer. On the other hand, there's public health testing. And public health\n\n13:53.120 --> 13:59.520\n testing has to account for all of the people you're not seeing as well as the person you're\n\n13:59.520 --> 14:05.840\n testing at the moment. So accessibility becomes a central theme. Frequency of tests, it has to\n\n14:05.840 --> 14:10.160\n account for all the days that you're not sitting there in front of your doctor's office getting a\n\n14:10.160 --> 14:15.280\n test as well as the one you are. So it has to say how frequently. What if you're infected tomorrow,\n\n14:15.280 --> 14:20.880\n but you're at the doctor's office today getting a negative COVID test? That PCR test at the doctor's\n\n14:20.880 --> 14:26.160\n office today is going to do nothing to let you know that you get exposed and infected tomorrow.\n\n14:26.160 --> 14:28.960\n The only way to know that is to be testing yourself frequently.\n\n14:31.440 --> 14:37.440\n And the reason it matters is that these tests can be accessible if we are okay with saying\n\n14:37.440 --> 14:42.800\n the real purpose of a public health test is to answer the question, am I infectious?\n\n14:42.800 --> 14:47.680\n The reason we want to answer that is if you're infectious, that's when you isolate. We actually\n\n14:47.680 --> 14:56.880\n don't want to isolate PCR positive individuals who are no longer infectious. That's bad public\n\n14:56.880 --> 15:01.680\n health practice. If I haven't been infectious for three weeks, I don't want to have somebody tell\n\n15:01.680 --> 15:08.080\n me that I need to go and isolate for 10 days just because I happen to use a PCR test today,\n\n15:08.080 --> 15:13.600\n three weeks after I was infectious. And furthermore, I definitely don't want the public\n\n15:13.600 --> 15:18.320\n health agency to come and round up all the people I was with last night and say, you guys have to\n\n15:18.320 --> 15:23.280\n quarantine for 14 days because you were with Michael who wasn't infectious yesterday.\n\n15:23.840 --> 15:29.200\n It's nonsensical to do that. And it's a huge disincentive to actually get tested. That's\n\n15:29.200 --> 15:33.840\n exactly right. Huge disincentive to get tested. People, if it's too sensitive, especially with\n\n15:33.840 --> 15:39.760\n flights, things like that, we shouldn't be stopping people from taking a flight if they haven't been\n\n15:39.760 --> 15:46.480\n infectious for 60 days. And to be clear, people are only infectious for somewhere between three\n\n15:46.480 --> 15:54.800\n and seven days, but can be positive on a PCR test for 30 to 70 days. So, I mean, it's potentially\n\n15:54.800 --> 16:00.400\n a tenfold difference in terms of how long you're PCR positive versus how long you're infectious.\n\n16:00.400 --> 16:05.520\n So, we don't want to be taking people during those 30 to 70 days and saying you need to isolate just\n\n16:05.520 --> 16:10.480\n because you go and get a swab, or you can't go on your trip just because you had COVID last month.\n\n16:11.280 --> 16:18.640\n That's not good use of a test. So, the reason we don't have these tools right now is because\n\n16:20.080 --> 16:28.240\n when we evaluate a rapid test as a medical device, the FDA says, well, this has to achieve\n\n16:28.240 --> 16:34.400\n the properties that we expect from a medical device, which again, doesn't have to take time\n\n16:34.400 --> 16:39.520\n into account, doesn't really have to take cost or resources or scalability or access into account.\n\n16:39.520 --> 16:48.400\n It only takes sensitivity and specificity to catch molecules. And so, just by definition, I mean, it\n\n16:48.400 --> 16:55.280\n is a mathematical fact, you know, that if you have a perfect public health test for COVID, which means\n\n16:55.280 --> 17:03.760\n that it would be 100% sensitive and 100% specific for contagious people or for the infectious stage\n\n17:03.760 --> 17:13.440\n of an infection, then it literally can't, it is an impossibility for that test to achieve an 80%\n\n17:13.440 --> 17:19.040\n sensitivity at a population level against a medical device, which is what the FDA asks for.\n\n17:19.040 --> 17:26.160\n And that's because you're only infectious for maybe 20%. So, theoretically, it should only have\n\n17:26.160 --> 17:33.040\n a 20% sensitivity against the PCR while still being a perfect medical, a perfect public health\n\n17:33.040 --> 17:37.280\n test. And the test is answering the question, am I infectious? That's what you're testing for,\n\n17:37.280 --> 17:43.200\n not for the exact counting of the virion particles in your system. That's exactly right. Okay. So,\n\n17:43.200 --> 17:50.960\n why are we still here? So, have you had conversations with folks? You said that there's a\n\n17:50.960 --> 17:58.000\n bunch of leaders that are kind of starting to wake up to this idea, but why is this taking this so\n\n17:58.000 --> 18:06.240\n long? Why don't we still have hundreds of millions of at home tests? The reason it's taking long,\n\n18:06.240 --> 18:15.040\n the reason it's taking long, I think, is because every agency and government is generally deferential\n\n18:15.040 --> 18:22.880\n to the FDA. And in this context, I would argue that government hasn't been particularly creative.\n\n18:24.000 --> 18:29.040\n So, for example, last year, when Trump was still president, I would, or in the transition,\n\n18:29.680 --> 18:32.800\n and I recall talking to the White House a number of times and saying,\n\n18:32.800 --> 18:37.760\n here's a plan to give us our lives back. I think that was actually the title of the Atlantic\n\n18:37.760 --> 18:45.360\n article. And this plan can stop shutdowns, it can stop outbreaks, it can allow society to keep\n\n18:45.360 --> 18:51.920\n running and could have prevented the outbreaks of last winter and fall and saved hundreds of\n\n18:51.920 --> 18:57.760\n thousands of lives. So, when I bring that to the White House or to the government, the federal\n\n18:57.760 --> 19:03.760\n government, whoever it might be, and I say, here's a plan, this would work. They say, what I get back\n\n19:03.760 --> 19:09.360\n is, this sounds really interesting, Michael. It looks like it checks out. But there's one problem,\n\n19:09.360 --> 19:13.840\n we don't have the test, there's no scale. And that's kind of where it all dropped. It's like\n\n19:13.840 --> 19:20.880\n this defeatist attitude of like, don't have the test, so we can't act on it. But now it's really\n\n19:20.880 --> 19:25.200\n changing. Well, and so that's really where things have been. And so nobody's paid attention. It's\n\n19:25.200 --> 19:30.240\n always been this like esoteric thing that, yeah, maybe one day we'll get around to it, but really\n\n19:30.240 --> 19:36.400\n it's not that important. And the pandemic's going away. But this was like 100% predictable, everything\n\n19:36.400 --> 19:41.360\n that's happening today. We predicted it last year. It's not, this isn't like rocket science or\n\n19:41.360 --> 19:46.160\n anything. The variants and all those kinds of things. So the FDA, we can start to understand\n\n19:46.160 --> 19:52.240\n why, but also like one question I want to ask, is it possible to go around the FDA?\n\n19:52.240 --> 20:00.320\n Yeah. So why has the FDA not changed? And why has nobody tried to push the FDA to change?\n\n20:01.520 --> 20:08.880\n I think what the real reason is the FDA has one job around these tests and it is to authorize\n\n20:08.880 --> 20:14.800\n them as medical devices. They haven't been charged with doing anything else. So in their eyes,\n\n20:14.800 --> 20:20.880\n they're doing exactly what they're supposed to do. They're evaluating these tests as medical\n\n20:20.880 --> 20:25.280\n devices and they're telling company after company after company, sorry, you don't make the cut.\n\n20:26.560 --> 20:30.800\n And the only way to make the cut is really to kind of skew your clinical trials to favor\n\n20:31.600 --> 20:36.080\n the rapid test being positive, which isn't really good practice. We shouldn't be trying to\n\n20:36.080 --> 20:43.200\n skew clinical trials. But that's kind of what's happened. It's been forced upon the companies to\n\n20:43.200 --> 20:48.560\n do that. And so I think the FDA truly believes from the bottom of their heart that they are\n\n20:48.560 --> 20:53.680\n doing the right thing here. And I would argue that to an extent they are. I've been pretty\n\n20:53.680 --> 21:00.400\n hard on the FDA, but maybe the issue is a higher level issue. Like the in vitro diagnostics\n\n21:00.400 --> 21:04.800\n division is they get applications and they evaluate them and the applications are for\n\n21:04.800 --> 21:10.960\n medical claims. That's however, because there's been a misunderstanding of these tests and\n\n21:10.960 --> 21:18.080\n the companies only know to apply for these as medical claims because there's nothing else in\n\n21:18.080 --> 21:24.800\n this country to apply for except the medical claim. So we don't have a public health pathway\n\n21:24.800 --> 21:30.720\n to evaluate a test and authorize a test. It doesn't exist. We have defunded and devalued\n\n21:30.720 --> 21:36.000\n public health for so long that we literally don't have a language for it. We don't have laws,\n\n21:36.000 --> 21:40.960\n a language, words. Is it called a public health test? Is it called something else?\n\n21:40.960 --> 21:45.760\n I call it a public health test because I'm trying to create a new definition here,\n\n21:45.760 --> 21:52.480\n but that's why nobody's acted because everyone says, well, there's no other pathway. So the FDA\n\n21:53.040 --> 22:00.080\n in vitro medical diagnostics division is the only pathway. So what I am trying to do is to say, look,\n\n22:01.200 --> 22:09.120\n the FDA very clearly states that they do not authorize or review public health tools\n\n22:09.120 --> 22:17.280\n and they don't authorize or review public health tests for COVID. So what I want the president of\n\n22:17.280 --> 22:24.000\n the United States to do is to utilize executive powers and take an executive action that can\n\n22:24.000 --> 22:31.200\n simply state like one line. One line could potentially change all of this. And it's a pretty\n\n22:31.200 --> 22:39.840\n obvious and simple line. And it is that any tools used for public health testing during this public\n\n22:39.840 --> 22:47.120\n health emergency will be designated as public health tools. Like it's obvious, like it's public\n\n22:47.120 --> 22:51.040\n health emergency. It's a tool used for public health that should be designated as a public health\n\n22:51.040 --> 22:57.760\n tool. If we can do that, if we can get that language out there so that that's the president's\n\n22:57.760 --> 23:05.120\n decision, then all of a sudden the FDA is off the hook. They're not trying to cram a square peg\n\n23:05.120 --> 23:11.680\n through a round hole. They can say, look, the antigen tests are not on us anymore. At least if\n\n23:11.680 --> 23:16.800\n they're going to be used for public health, like when you test a thousand people at a time or test\n\n23:16.800 --> 23:23.120\n a school classroom if they've been exposed, this is public health. And so then the CDC could take\n\n23:23.120 --> 23:30.080\n it over. The CDC could say, okay, what are the metrics we are interested in? And they could say,\n\n23:30.080 --> 23:34.160\n we're interested in a test that can catch you if you're infectious. So you want high viral load\n\n23:34.160 --> 23:40.880\n detection. That's fast, that's scalable. And hey, if your test has been used in Europe for months\n\n23:40.880 --> 23:47.920\n and has performed extremely well, then we'll give you a certificate by right immediately. And that\n\n23:47.920 --> 23:53.360\n could actually get hundreds of millions of additional tests into the United States tomorrow.\n\n23:54.480 --> 23:59.200\n So you need some kind of classification from an FDA or from somebody to call it a public health\n\n23:59.200 --> 24:04.400\n tool in order for it to be manufactured. Is it possible to just go around all of this and just\n\n24:04.400 --> 24:11.920\n for somebody to manufacture at scale tests? Well, if you did that and you just called them,\n\n24:11.920 --> 24:18.400\n you put a claim on them that called them public health tools, the FDA has a very\n\n24:19.120 --> 24:23.040\n weird view of this and they will tell you that it's illegal, that it's a crime.\n\n24:24.800 --> 24:29.520\n Is there a way to say like Elon Musk did with the flamethrower, it's not a flamethrower?\n\n24:29.520 --> 24:38.480\n Yeah. Believe me, I've tried to think of all the different approaches. There's major\n\n24:38.480 --> 24:42.720\n inconsistencies here. So it's not like we don't have a precedent for a public health test even\n\n24:42.720 --> 24:50.000\n during this pandemic. There is a very strong precedent. Pooled testing, we have companies\n\n24:50.000 --> 24:57.920\n like Ginkgo based out here in Cambridge that are working with 100 different labs around the country.\n\n24:57.920 --> 25:04.480\n So that might mean like not a ton of quality control over those labs. I don't want to say\n\n25:04.480 --> 25:07.840\n that they don't, I'm just saying the reality is if you're working with that many labs,\n\n25:07.840 --> 25:12.960\n it's hard to say, they're running pooled testing of millions and millions and millions of kids.\n\n25:15.040 --> 25:21.760\n So here you have a company that's testing in each pool five to 25 kids at a time,\n\n25:22.880 --> 25:27.200\n millions of kids in a pretty distributed way across the country in all these different labs\n\n25:28.480 --> 25:33.520\n and the FDA doesn't care at all. You don't need an EUA. It doesn't need a regulatory authority.\n\n25:33.520 --> 25:40.720\n It's collection on site. It's getting shipped to a lab. There's no oversight of it. So why does\n\n25:40.720 --> 25:47.280\n that have no oversight but a rapid test for the exact same purpose? You're just giving people\n\n25:47.280 --> 25:52.720\n immediate results instead of two day delayed pooled PCR results. So it's a much more effective tool.\n\n25:53.680 --> 25:58.960\n Why is the rapid test used for the same purpose, not designated as a public health tool, but\n\n25:58.960 --> 26:07.520\n requiring FDA authorization? It's a ridiculous reason and it's because the FDA says that if\n\n26:07.520 --> 26:16.160\n a test, and this is actually CMS that says this and the FDA adopts it, if a test alters your\n\n26:17.120 --> 26:22.400\n behavior, if you get a single result and it's going to alter your behavior, then that is a\n\n26:22.400 --> 26:29.520\n medical device. But the thing that I find ridiculous is like, okay, but you can give a\n\n26:29.520 --> 26:35.680\n pooled test that alters 25 people's behavior at once and that's not falling, like that's more\n\n26:35.680 --> 26:41.120\n risky. One person turns positive in the pool and 25 people have to be quarantined.\n\n26:42.720 --> 26:47.040\n And how do they evaluate the accuracy? So for people who don't know, pooled test\n\n26:47.040 --> 26:54.240\n is you're testing a small fraction of the people. And if one of them is positive,\n\n26:54.240 --> 26:57.680\n then you basically say, we have to retest everybody in the pool.\n\n26:57.680 --> 27:03.760\n Yeah. So you take, let's say you have a school and each classroom you might have 20 kids each swab\n\n27:03.760 --> 27:09.440\n their nose in a classroom and all those swabs go into a single tube. And then you rinse that tube\n\n27:09.440 --> 27:16.240\n out with some saline and you run a PCR test on that tube of 25 samples, 20 samples. And so if\n\n27:16.240 --> 27:23.840\n that tube turns positive in the PCR test, then all 20 or 25 of those students are now having\n\n27:23.840 --> 27:31.280\n to quarantine. And if there's no positive, then all 20 or 25 students are interpreting that their\n\n27:31.280 --> 27:40.080\n result is negative. So it really is ridiculous decision by the FDA to say that if the test itself\n\n27:40.080 --> 27:44.960\n only tests one sample at a time, it's medicine because it will tell you one person at a time,\n\n27:44.960 --> 27:51.600\n if you're positive or if you're negative. But if you do it as a pool and you tell 25 people that\n\n27:51.600 --> 27:56.880\n your pool was negative, then that's somehow different. That's public health, not medicine.\n\n27:58.240 --> 28:00.880\n There's no logic there. Was it just personalities and\n\n28:00.880 --> 28:06.240\n accidents of history or something like that? For example, you talk about the public health\n\n28:06.240 --> 28:12.880\n tools and CDC, you look at masks. So masks were decided to somehow be an effective tool\n\n28:12.880 --> 28:20.080\n to help with the pandemic. So I'm sure the evidence that was used there was probably not\n\n28:20.080 --> 28:26.000\n as strong as the evidence supporting antigen rapid tests. I was very much reading a lot of research\n\n28:26.000 --> 28:31.920\n on masks. It's tricky. It's really tricky to show how well they stop the transmission of a virus,\n\n28:31.920 --> 28:36.720\n especially when you don't fully understand how the virus is transmitted or the viral load required,\n\n28:36.720 --> 28:41.440\n all that kind of stuff. But then the CDC pretty quickly decided masks or whatever,\n\n28:41.440 --> 28:47.360\n there's some oscillations back and forth, but then they quickly decided, everybody decided\n\n28:47.360 --> 28:53.760\n masks is a good tool. So masks being decided a good tool and then rapid antigen tests,\n\n28:53.760 --> 28:58.880\n not a good tool. Is that just like certain personalities who didn't speak up in a meeting\n\n28:58.880 --> 29:03.120\n or who did speak up in a meeting? Is this just like a weird roll of the dice or is there a\n\n29:03.120 --> 29:09.760\n better explanation? I think it's somewhat of a roll of the dice, but I also think it's that testing.\n\n29:09.760 --> 29:20.960\n So doctors don't pretend to really understand much about fluid dynamics and how well masks are\n\n29:20.960 --> 29:28.400\n working. That's way out of their realm. Doctors do believe that they understand all aspects of\n\n29:28.400 --> 29:39.680\n the tests. And so the greatest barriers to rapid tests being brought to market or being rolled out\n\n29:39.680 --> 29:46.640\n heavily and supported as public health tools, the greatest barriers came from physicians saying,\n\n29:47.600 --> 29:51.120\n hell no, we can't use a test that's not as sensitive as a PCR.\n\n29:51.120 --> 29:58.800\n And look at what happens if you use this antigen test and not a PCR test. You get people who are\n\n29:58.800 --> 30:05.520\n showing a positive on a PCR and negative on an antigen. And they just assume that that was a\n\n30:05.520 --> 30:12.000\n false negative on the antigen. For public health, I would call it a false positive on the PCR test.\n\n30:12.000 --> 30:18.960\n But this type of thinking literally does not exist in medicine. And I think the biggest problem here\n\n30:18.960 --> 30:28.320\n is that we placed physicians in decision making power. When this pandemic hit, everyone called up\n\n30:28.320 --> 30:34.640\n clinical laboratory folks and microbiologists and physicians to ask, well, what kind of test should\n\n30:34.640 --> 30:40.960\n we use, that kind of thing. And there is no training in medical school for this kind of\n\n30:40.960 --> 30:47.760\n public health work. You have to optimize on the right qualities of a test that have nothing to\n\n30:47.760 --> 30:54.000\n do with medicine. And then sometimes, if not frequently, they're actually at odds. And I'll\n\n30:54.000 --> 30:59.440\n give an example why the physicians, you could see why the physicians would have been against it from\n\n30:59.440 --> 31:08.720\n their perspective. And they say, if a physician is a TSA agent at the airport, you know, a TSA agent,\n\n31:08.720 --> 31:14.720\n their role at any given time, and the role they think that the instruments need to play is I want\n\n31:14.720 --> 31:19.600\n you to scan the bag as well as possible. This is the only bag that I'm interested in at the moment.\n\n31:20.640 --> 31:26.560\n And this is my lane, this is my bag. I want to make sure that my instrument's doing, I don't want\n\n31:26.560 --> 31:32.000\n the crappy instrument in my lane, I want to make sure that I'm doing everything I can. But what\n\n31:32.000 --> 31:36.720\n those TSA agents don't have to worry about is, well, how many other instruments are there in this\n\n31:36.720 --> 31:42.000\n airport? Is anyone getting through the lines here without going through security? The average TSA\n\n31:42.000 --> 31:45.600\n agent doesn't have to worry about that. They literally have one job to do, and it's pay\n\n31:45.600 --> 31:51.600\n attention to this lane. If there's a big gap in the security line and people are flowing through\n\n31:52.160 --> 31:56.800\n without going through security, that's not on the TSA agent. That's not a big systematic problem of\n\n31:56.800 --> 32:04.480\n that of the system. And we can't expect that TSA agent to have ever even thought about that. Like,\n\n32:04.480 --> 32:09.760\n that's not on them. They were trained to look at the bag. And that's kind of like physicians.\n\n32:09.760 --> 32:15.280\n That's kind of like physicians. And probably some physicians will hear this and feel like I'm\n\n32:15.280 --> 32:20.560\n insulting it. I don't mean to be likening the two professions or anything like that. But the point\n\n32:20.560 --> 32:28.960\n is that a physician has one duty. Do no harm to this patient. Time is an of the essence. Scale,\n\n32:28.960 --> 32:35.440\n how many tests can my hospital perform in a day? How many tests can my county or country perform\n\n32:35.440 --> 32:42.720\n in a day? That's not a physician's training to think like that at all. And so what has happened\n\n32:42.720 --> 32:47.680\n is doctors got on board early and said, oh, hell no. We've seen these antigen tests before. They're\n\n32:47.680 --> 32:52.560\n not particularly sensitive compared to PCR. And early in the pandemic, there was like pissing\n\n32:52.560 --> 33:00.720\n matches between labs who had the most sensitive PCR. And it just distracted everything. I was\n\n33:00.720 --> 33:06.560\n trying to say pretty early, like, we don't need sensitivity. We just need frequency. We just need\n\n33:06.560 --> 33:12.000\n scale. We need to think differently because our only goal if we're doing frequent routine testing\n\n33:12.000 --> 33:17.360\n of asymptomatic people is not medicine. It's to say, do you need to isolate now? And if you have\n\n33:17.360 --> 33:23.200\n a PCR test that's taking three days to return and you're like, if I was currently spreading virus\n\n33:23.200 --> 33:27.920\n before I walked in here and you handed me, this actually happened to me today when I walked into\n\n33:27.920 --> 33:35.040\n Harvard. Today was my first day back into Harvard since February of 2020. I go in, I scan my badge\n\n33:35.040 --> 33:42.560\n and they hand me a PCR tube and they say like, return this by noon or something before your work\n\n33:42.560 --> 33:48.480\n day is done. And I'm looking at it. I'm like, what is this going to do? Like, what if I'm super\n\n33:48.480 --> 33:52.960\n spreader right now? You're giving me free reign to walk around and infect everyone in the school\n\n33:52.960 --> 33:58.960\n and you're going to give me my result to tell me I did that in two days from now? It doesn't really\n\n33:58.960 --> 34:04.720\n make sense. So who is supposed to be, so it's understandable that doctors kind of feel that way,\n\n34:04.720 --> 34:12.960\n just like you said, do no harm. Who's supposed to care about public health? Is it the FDA? Is there\n\n34:12.960 --> 34:19.040\n some other organization yet to be created? Is it like, just like with the military, the reason we\n\n34:19.040 --> 34:25.520\n have civilian leadership when you talk about war, is it the president that's supposed to do like\n\n34:25.520 --> 34:32.080\n override FDA, override doctors, override and basically politicians in representing the people\n\n34:32.080 --> 34:37.920\n in the state of emergency make big public health decisions? Like who is supposed to do it? Besides\n\n34:37.920 --> 34:45.360\n you on Twitter. It's like most people really thinking about solutions to COVID will mention\n\n34:45.360 --> 34:52.880\n you or will mention this idea of rapid at home testing. And it's, you watch that happening,\n\n34:53.440 --> 34:57.280\n this discussion that this is an obvious part of the solution and the solution is not happening.\n\n34:57.920 --> 35:03.520\n So who is supposed to implement this idea? I think the CDC that it should start there.\n\n35:04.080 --> 35:08.880\n Override the FDA? Well, I don't even think it needs to override it. And that's why I think\n\n35:08.880 --> 35:14.400\n these should just be designated as a different tool so that the company is, it's not overriding.\n\n35:14.400 --> 35:19.200\n It's just saying, look, this isn't even, this isn't in your jurisdiction to the FDA. This is\n\n35:19.200 --> 35:25.280\n just a public health tool. But the problem is the centers for Medicaid, Medicare services\n\n35:25.280 --> 35:31.200\n designates any tool, just like FDA, they designate these as medical devices purely because they could\n\n35:31.200 --> 35:37.360\n change somebody's behavior based on the result of one test. So to change that at this point,\n\n35:37.360 --> 35:42.320\n unless you can get CMS buy in, you know, we don't have, there is no designation as a public health\n\n35:42.320 --> 35:49.520\n tool, but the president can just say, these are public health tools. These are not to be\n\n35:50.960 --> 35:55.520\n regulated as medical devices if their goal is not medicine, but public health.\n\n35:55.520 --> 36:02.640\n And if he does it, he does have the authority to do that as president and to say, I'm tasking the CDC\n\n36:03.440 --> 36:08.880\n to certify these tests or, or authorize them for use in the United States. And, you know,\n\n36:08.880 --> 36:14.080\n he has to say something like that. He can't come out and say, these are public health tools, have\n\n36:14.080 --> 36:19.200\n free reign, just, you know, any company start, start shipping them in the US because that would\n\n36:19.200 --> 36:25.120\n create pandemonium and we'd have a lot of bad tests. But there's a lot of really good tests\n\n36:25.120 --> 36:30.960\n out there. We just are taking like six to 12 months to run trials. They're failing because\n\n36:30.960 --> 36:37.920\n they can't keep up with PCR. And if the president were to do this, then the CDC could take it over\n\n36:37.920 --> 36:43.520\n and they could say, okay, it's on us. We're going to decide. The UK actually did this. They,\n\n36:44.320 --> 36:49.680\n early on, they said, okay, they laid out a very clear regimen. They said, this is how we are going\n\n36:49.680 --> 36:56.080\n to evaluate rapid antigen tests because they're public health tools. They did it in a, in a domain\n\n36:56.080 --> 37:02.000\n that was outside of their normal medical diagnostic regulatory agencies. And they, they literally just\n\n37:02.000 --> 37:08.720\n had a very fast screening to say, what are the best tests? They went through a huge number of\n\n37:08.720 --> 37:12.480\n different tests and they said, okay, these are the, this is the rank order of which tests are good,\n\n37:12.480 --> 37:18.320\n which are bad, which are scalable, which are not. And they were able to start deploying them in\n\n37:18.320 --> 37:24.080\n weeks, not years. So I think the CDC really needs to take charge. The problem is when it comes to\n\n37:24.080 --> 37:31.440\n like law, if everyone currently perceives this as like fully within the domain of the FDA and they've\n\n37:31.440 --> 37:39.040\n never heard of such enough public health test idea enabling, but the, but the FDA itself has created\n\n37:39.040 --> 37:45.360\n the idea by saying we don't regulate public health tools. So the word is out there. The FDA has said,\n\n37:45.360 --> 37:51.200\n we don't regulate them. So that gives the president an opportunity to say, okay, these are\n\n37:51.200 --> 37:57.440\n those, you know, these are public health tools by definition. And, and I do think that this is a kind\n\n37:57.440 --> 38:02.480\n of a crisis and it's a crisis of testing, but it's also a crisis of like, really, we're going to go\n\n38:02.480 --> 38:08.080\n through this whole pandemic and never figure this thing out. That's just really sad. You know, if we\n\n38:08.080 --> 38:14.160\n get through this and don't figure out how to evaluate a rapid test. So how do vaccines\n\n38:15.200 --> 38:22.000\n play with this? So one of the things that when people discuss solutions to COVID, there's a\n\n38:22.000 --> 38:29.680\n sense that once you have a vaccine COVID is solved. So how does that interplay? Like, why do we still\n\n38:29.680 --> 38:36.880\n need tests if we have vaccines? Yeah, I actually wrote an op ed in New York times or Wall Street\n\n38:36.880 --> 38:44.880\n Journal or something that was titled why we still need rapid tests with vaccines. And the real reason\n\n38:44.880 --> 38:51.520\n is because we have evaluated our vaccines based on their ability to stop disease. In fact, most of\n\n38:51.520 --> 38:57.120\n the trials didn't evaluate them based on their ability to stop transmission. They didn't even\n\n38:57.120 --> 39:04.960\n evaluate that at all, no less put it as one of the metrics for authorization. And with a virus like\n\n39:04.960 --> 39:10.000\n this, it would be a bit naive to think that it's really going to stop transmission well.\n\n39:12.240 --> 39:17.120\n I think a lot of excitement happened right after the first clinical trials. And I'm sure we were\n\n39:17.120 --> 39:22.000\n talking about it when I was last here, I would imagine given the timing. But those first clinical\n\n39:22.000 --> 39:27.440\n trials came out and everyone jumped for joy that these things were going to be the end to this\n\n39:27.440 --> 39:34.720\n pandemic. But we had really short sighted vision there by not recognizing two main features. One is\n\n39:35.680 --> 39:41.600\n that they might not stop transmission. Another, I guess three, another is that new variants might\n\n39:41.600 --> 39:47.440\n come around that will break through the vaccine protective immunity. And the third is that we were\n\n39:48.640 --> 39:54.160\n measuring the efficacy of these vaccines during the peak of their performance in the first few\n\n39:54.160 --> 39:59.200\n months after people got vaccinated. And that gives a skewed view of just how effective these are going\n\n39:59.200 --> 40:05.600\n to be long term. So what happened with the vaccines is that everyone got very comfortable,\n\n40:05.600 --> 40:10.880\n including the CDC saying, if you've been vaccinated, this is the end of the pandemic for\n\n40:10.880 --> 40:17.280\n you. And let's keep it up. But then Delta comes along and waning immunity comes along. And both\n\n40:17.280 --> 40:24.880\n of these things compound exactly as anticipated to get breakthrough cases. And unfortunately,\n\n40:24.880 --> 40:30.080\n what we're seeing now is the CDC and the administration went so all in on saying that\n\n40:30.720 --> 40:35.360\n breakthrough cases are rare, that transmission doesn't really happen if you're vaccinated\n\n40:35.360 --> 40:41.600\n without great data, especially with Delta, that once people started seeing breakthrough cases,\n\n40:41.600 --> 40:46.560\n they started interpreting that as a failure of the vaccine. The vaccines are still working to\n\n40:46.560 --> 40:53.360\n keep people out of the hospital for the most part, but they're not working to stop transmission.\n\n40:53.360 --> 41:00.560\n And if our goal is to stop transmission, which until we decide as a society that we have different\n\n41:00.560 --> 41:06.560\n goals, like we're okay with people getting ill and letting transmission go because we don't want\n\n41:06.560 --> 41:10.880\n to worry about it anymore. We're not there yet. So until we decide that we're not going to stop\n\n41:10.880 --> 41:16.960\n transmission, we need other avenues besides the vaccine because it's not doing it. It also means\n\n41:16.960 --> 41:21.840\n that herd immunity isn't going to happen. And unfortunately, as long as we keep letting spread\n\n41:21.840 --> 41:27.520\n happen in the context of vaccinated people, we're kind of giving this virus a bootcamp\n\n41:27.520 --> 41:33.280\n of exactly what it needs to do and mutate to get around our vaccine derived antibodies.\n\n41:33.840 --> 41:37.280\n And that makes me very nervous. So the more we can do to stop spread\n\n41:38.240 --> 41:41.600\n in the unvaccinated, in the elderly vaccinated, and in other people,\n\n41:43.200 --> 41:48.800\n the better. We just should be focusing on that. So in your eyes, the solution would look like this.\n\n41:49.360 --> 41:53.600\n You would make enough tests where every single person will get tested every single day?\n\n41:53.600 --> 42:00.240\n I think that that would be... I don't want to do that actually. I want to do a variation on that.\n\n42:00.240 --> 42:05.040\n I think what we should do is have a dynamical testing program. It doesn't have to be\n\n42:06.880 --> 42:14.080\n complicated. Every household has a box of tests in their cupboard. And if you haven't seen any\n\n42:14.080 --> 42:19.680\n cases in your community for a long time, stop testing. Do wastewater testing to see if there's\n\n42:19.680 --> 42:25.360\n any RNA coming back. If you start to see RNA in the wastewater that represents the virus,\n\n42:25.360 --> 42:30.160\n and you're still wanting to stop outbreaks, you say, hey, you know those tests that are in your\n\n42:30.160 --> 42:35.360\n cupboards, households in this county, why doesn't each household or each person in each household\n\n42:35.360 --> 42:44.160\n use one test per week? Can you start to just pause on that idea? That's really cool, the wastewater\n\n42:44.160 --> 42:49.920\n testing. That's the thing? So you can get a sense of how prevalent the virus is in a particular\n\n42:49.920 --> 42:55.360\n community by testing the wastewater? That's exactly right. And so the viral load associated,\n\n42:56.160 --> 43:02.400\n the viral load that you can find in the community represents the prevalence of the virus in the\n\n43:02.400 --> 43:08.800\n community, which is really quite nice. That's a nice way to paint like a map of the intensity\n\n43:08.800 --> 43:17.600\n of the virus. Okay, so when it goes above a certain level, you can start doing much higher\n\n43:17.600 --> 43:23.680\n frequency testing in each household. That's right. So I don't want people to be in testing purgatory,\n\n43:23.680 --> 43:29.280\n like that's not what I want. I just want us to get through this damn pandemic. And so we can\n\n43:29.280 --> 43:34.880\n monitor the wastewater or any other methods. We can monitor the hospitals and the clinics. And\n\n43:34.880 --> 43:38.320\n if somebody does come in with COVID like symptoms, and then a few other people come in,\n\n43:38.320 --> 43:43.120\n you realize, okay, we got spread happening in our community. Send out a text message,\n\n43:43.120 --> 43:48.080\n put it on the news, put in the newspaper, whatever you need to do, tell people, tell families,\n\n43:48.080 --> 43:53.120\n use your test. And if the cases get worse, because you're just doing it once a week,\n\n43:53.120 --> 43:58.320\n that's not going to stop transmission, but it's going to enable you to identify where outbreaks\n\n43:58.320 --> 44:03.840\n are happening. If you start to find outbreaks in pockets, then the rule is simply, okay,\n\n44:03.840 --> 44:08.400\n let's squash the outbreak real fast. So everyone in that area in certain zip code or whatever it\n\n44:08.400 --> 44:15.440\n might be, test every two days for seven days or every day for seven days, and you'll get rid of\n\n44:15.440 --> 44:22.160\n the outbreak. We can do that. And if you've now gone, again, a week or two with no cases\n\n44:23.120 --> 44:28.960\n identified, stop the testing again. That's the nice thing that everything changes when people\n\n44:28.960 --> 44:35.120\n have the tests in their home. It becomes dynamic. It can become easy. You send a text message,\n\n44:35.120 --> 44:41.280\n take your test today. If some people don't do it, that's fine. The only goal is to get R below one,\n\n44:41.280 --> 44:46.960\n and you stop the outbreak. People think it has to be near perfect. I always hear people say,\n\n44:48.080 --> 44:54.240\n oh, what if somebody doesn't use it? Or what if somebody lies? Well, you have 98% of people\n\n44:54.240 --> 45:00.160\n testing or even 50%. That's a whole lot better. And another big difference that people, I think,\n\n45:00.160 --> 45:07.360\n oftentimes have a problem wrapping their head around, especially to an extent physicians who\n\n45:07.360 --> 45:14.720\n are used to different kinds of metrics, is that all we have to do to completely stop an outbreak\n\n45:14.720 --> 45:21.840\n from spreading in a community is to get, for every 100 infected people, to get them to go on\n\n45:21.840 --> 45:29.200\n and infect 95. Most people would say, oh my God, that's a horrible program. You're still letting\n\n45:29.200 --> 45:36.400\n 100 people go and infect 95 people. But for a virus like this, that's a massive public health\n\n45:36.400 --> 45:42.080\n win. If you can get 100 people to infect 90, most people, doctors, I would say, like a lot of people\n\n45:42.080 --> 45:47.360\n would say, that sounds like a failure, to be honest. But if you do that for multiple days in\n\n45:47.360 --> 45:52.400\n a row, then in a couple of weeks, you've gone from a big outbreak to a very, very small outbreak.\n\n45:53.360 --> 45:58.480\n And on the other hand, if you don't do that, if you allow 100 people to just infect 140 people,\n\n45:59.200 --> 46:03.680\n because you're not doing the testing, then instead of having 20 people at the end of\n\n46:03.680 --> 46:09.360\n those four weeks with the testing, you literally would have 600. Massive differences here.\n\n46:10.960 --> 46:16.080\n The only goal then is to get R below one, have 100 people infect less than 100, and you stop the\n\n46:16.080 --> 46:21.040\n outbreaks and everyone stays safe. From everything you've seen, how cheap can these things get?\n\n46:21.040 --> 46:26.080\n From like in the past year, in terms of the developments you've seen with the various test\n\n46:26.080 --> 46:32.320\n manufacturers, how cheap can it be to make a test, to manufacture a test? So there's the\n\n46:32.320 --> 46:38.880\n manufacturing process that could be 50 cents, maybe less. It's hard to really have eyeballs\n\n46:38.880 --> 46:43.600\n inside these companies in terms of where they're producing them in China and Taiwan, a number of\n\n46:43.600 --> 46:49.360\n other places. Some of them are produced here in the United States too, but 50 cents, say,\n\n46:49.360 --> 46:53.280\n was a very, very reasonable, generous number for how much it costs per test.\n\n46:54.800 --> 46:59.280\n You look at a place with high market competition that has actually authorized a lot of these tests\n\n46:59.280 --> 47:04.640\n like Germany. Germany has 60, 70 some odd different companies of high quality rapid tests\n\n47:04.640 --> 47:10.080\n authorized. You can go there and buy it for 80 cents, and they're still making a profit.\n\n47:10.080 --> 47:18.160\n And so it's extremely cheap. Market competition can drive these tests way down in terms of cost.\n\n47:19.040 --> 47:25.680\n I think one of the most important features of a rapid test program is what do you do with the\n\n47:25.680 --> 47:33.280\n result? Is it going to be used for you to gain entry to school or work? Is it going to be reported\n\n47:33.280 --> 47:38.880\n to the public health agencies? All of these, the primary mode should be just get people tests,\n\n47:38.880 --> 47:42.560\n but really if you're going to be using it for a workplace thing, like what Biden is now saying,\n\n47:42.560 --> 47:46.960\n vaccinate or test, which is going to lead to a crisis if we don't fix this soon because we're\n\n47:46.960 --> 47:52.160\n going to have massive demand for testing in the next couple of weeks. But when he says that,\n\n47:52.160 --> 47:56.880\n that's essentially saying, okay, companies need to make sure that their people are testing.\n\n47:56.880 --> 48:02.400\n So are you going to base it on the honor system? I would say you probably would not base\n\n48:02.960 --> 48:08.800\n testing on the honor system if it's like to take somebody who would otherwise be quarantined from\n\n48:08.800 --> 48:13.360\n work in school. And so you can go to school as long as your test is negative. So test to stay\n\n48:13.360 --> 48:19.040\n program is a big thing that I've been pushing for and others have. Businesses bringing people into\n\n48:19.040 --> 48:24.960\n work who need to test, they need to have verification, but they don't want to set up\n\n48:24.960 --> 48:30.080\n nursing stations in their lobbies or in the school parking lot or whatever. Everyone's tired of that.\n\n48:30.080 --> 48:34.800\n We need to bring the tests into the home, but that means we need the technology to enable it.\n\n48:34.800 --> 48:42.240\n And so I was at a conference recently. Do you know Mike Milken? Milken Institute. He's a very\n\n48:42.240 --> 48:46.720\n wealthy billionaire, but he's done a lot of philanthropy and he has a conference to raise\n\n48:46.720 --> 48:52.480\n money for prostate cancer research. I was at this conference recently, Francis Collins,\n\n48:52.480 --> 48:58.640\n a number of other people were there. And every morning we all had to test in the morning,\n\n48:58.640 --> 49:05.040\n which I thought was a great idea obviously before we walked into that conference. But you didn't\n\n49:05.040 --> 49:11.200\n have to test there and they didn't base it on the honor system. Every morning I scanned a QR code on\n\n49:11.200 --> 49:19.200\n the box and eMed, which is a service that provides test verification, popped up with a proctor right\n\n49:19.200 --> 49:25.440\n on my phone or on my computer and said, okay, let's go through your tests. And they watch you,\n\n49:25.440 --> 49:30.240\n they videotape you using the test. So it's all recorded. It's all a reportable type of test.\n\n49:30.960 --> 49:35.440\n And at the end of it, just from your home, you don't actually see the proctor,\n\n49:35.440 --> 49:39.520\n you know, but they're just verifying that you actually do it. They verify the test,\n\n49:39.520 --> 49:44.480\n they verify the test results with you. And at the end of it, you've then gotten\n\n49:45.360 --> 49:51.200\n from your couch or from your car, wherever you are, an actual verified laboratory report that\n\n49:51.200 --> 49:56.000\n can be considered proof that you yourself use the test and you yourself got a negative.\n\n49:56.640 --> 50:02.800\n So the tools are out here if we want to use them at scale. And in fact, the CDC uses eMed now to\n\n50:03.840 --> 50:08.880\n enable people to come back into the United States through an antigen test. So before you get on your\n\n50:08.880 --> 50:13.920\n flight, you're sitting in the airport in Heathrow or wherever you are, you can get on your computer,\n\n50:13.920 --> 50:19.760\n use your eMed test, and you get the negative and CDC will accept that, TSA will accept you to come\n\n50:19.760 --> 50:24.240\n back into the US with a rapid antigen test that you did without anyone else watching,\n\n50:24.240 --> 50:26.800\n except for this proctor on your phone. Super simple.\n\n50:27.840 --> 50:33.760\n How much private information is being collected? So like this, you know, people have in the United\n\n50:33.760 --> 50:41.120\n States, the American way, they have a hesitancy on the overreach of government in things like\n\n50:41.120 --> 50:50.720\n vaccine passports, like using any mechanism of verification that's controlled by government\n\n50:50.720 --> 50:58.160\n can lead to overreach by said government. So there's a concern of that. Do you see there a way\n\n50:58.160 --> 51:06.000\n of achieving testing that's verified but does not violate people's privacy or sense of freedom?\n\n51:06.000 --> 51:12.720\n Absolutely. I think so. The way that right now in the United States, they're requesting that\n\n51:13.760 --> 51:19.520\n these tests get, that the results get delivered to public health agencies. But I've long held that\n\n51:20.560 --> 51:25.520\n while that's ideal, it should never be the thing that holds up somebody being allowed to know their\n\n51:25.520 --> 51:32.960\n own status. But if you are going to work and you have to let your boss or your manager, whomever,\n\n51:32.960 --> 51:38.000\n know that you were negative that day, or if you're going to school, I think it's going to be hard to\n\n51:38.000 --> 51:46.080\n maintain complete privacy in that situation because they need to know your name. But sure, I mean,\n\n51:46.080 --> 51:51.920\n could you cut off the public health reporting? Yes, you could. But I worry, I mean, can you opt\n\n51:51.920 --> 51:56.560\n out? Maybe you could opt out. That should be a feature. I want to opt out of the public health\n\n51:56.560 --> 52:03.520\n reporting because for whatever reason, otherwise I'm not going to do the test. But that means that,\n\n52:03.520 --> 52:07.040\n okay, then you're not going to go to work. So right now there's this serious tension and\n\n52:08.000 --> 52:14.960\n I am very uncomfortable with the idea that we force anyone to do anything. But there is a tension\n\n52:14.960 --> 52:20.000\n between these two things for sure. And how do you balance that during a public health emergency?\n\n52:21.200 --> 52:25.520\n I think first and foremost, let people, everyone has a right to know their status.\n\n52:25.520 --> 52:28.720\n Right. The fact that we have made it hard for people\n\n52:28.720 --> 52:33.440\n to know their status on their terms, I think is a travesty. I mean, it's just so\n\n52:34.400 --> 52:42.640\n terrible that we have prioritized us knowing at the expense of you. Essentially what public health\n\n52:42.640 --> 52:48.160\n has long said during this pandemic is, if I'm public health, if I can't know, then you can't\n\n52:48.160 --> 52:54.240\n know your status. That's not the right way to look at public health. We need to engage the public.\n\n52:54.240 --> 52:57.600\n And if some of them don't want to participate in the public health part, but want to know\n\n52:58.240 --> 53:03.200\n their status, by default, they are participating in public health, whether they know it or not,\n\n53:03.200 --> 53:07.520\n because they're not going to go get their mom sick by mistake. At least most people wouldn't.\n\n53:07.520 --> 53:14.720\n And then also you can create systems where you can, individuals can form\n\n53:14.720 --> 53:21.280\n relationships based on their status without ever reporting it to a centralized place.\n\n53:21.280 --> 53:27.920\n So you can go to, I don't know, a local business owner might require that you show\n\n53:28.560 --> 53:34.480\n that you're negative, but that doesn't require reporting it. You can, like there might be\n\n53:35.280 --> 53:42.160\n basically like an ID that's only in possession, you are the only person in possession of that.\n\n53:42.160 --> 53:48.080\n So you literally show it, here's a test I took, it's negative and nobody else knows about that test.\n\n53:48.080 --> 53:53.840\n So that could very well be done, even through a company like eMed. I think, and I might be wrong\n\n53:53.840 --> 54:00.320\n here, I believe that they take the test result, and because they are considered a CLIA waived\n\n54:00.320 --> 54:07.360\n laboratory, like a digital laboratory, they report their results by law out to the public health\n\n54:07.360 --> 54:11.360\n agencies. But let's say there was something a little different. Let's say you were verifying\n\n54:11.360 --> 54:15.520\n an over the counter test, and it doesn't have to be a CLIA waive because it's over the counter,\n\n54:15.520 --> 54:21.920\n then you're not bound by CLIA rules. And you could create the same service, but that just doesn't\n\n54:21.920 --> 54:27.120\n report out to the public health agencies. It gives people the option to opt in or out of public\n\n54:27.120 --> 54:34.880\n health reporting. And I know that public health people get a little queasy when I talk about this,\n\n54:34.880 --> 54:41.040\n but as a public health person myself, I guess of course I would prefer that the data be available\n\n54:41.040 --> 54:45.920\n to evaluate to know where the cases are. But first and foremost, I want to make sure that the people\n\n54:45.920 --> 54:52.960\n using the test are going to use the test. And if that means that they're not reporting, and if\n\n54:52.960 --> 54:57.040\n that's the only way that they will use it is if it's not reported, then that's better than no test.\n\n54:58.240 --> 55:05.280\n Especially given that the central to the vaccine hesitancy is a distrust of authority and the\n\n55:05.280 --> 55:15.360\n distrust of government. So you're asking people to get tested and report their status\n\n55:17.120 --> 55:22.240\n to a centralized authority when they clearly do not trust that authority. It doesn't make any\n\n55:22.240 --> 55:28.080\n sense. It seems like a perfect solution to let people who are hesitant on the vaccine\n\n55:28.640 --> 55:33.760\n to get their own status and have full control of that information and opt in,\n\n55:33.760 --> 55:37.840\n provide that information if they wish to, but they have the full control of it and have the\n\n55:37.840 --> 55:43.040\n freedom to do that information what they want. I fully agree with that. I really do. I think\n\n55:43.040 --> 55:48.640\n we can have the verified services and we could have the privacy if you want it. If you need to\n\n55:48.640 --> 55:53.680\n go into a restaurant and there's a rule that you have to be a negative test, have it on your phone\n\n55:53.680 --> 55:59.040\n and only your phone. And it's okay. Like emails you the lab report, you have it. You can say,\n\n55:59.040 --> 56:04.400\n look, that's my name. I used it this morning. Negative. And in that case, you'd want something\n\n56:04.400 --> 56:10.560\n that just is there and is not going anywhere else. And I think that those services, I think they can\n\n56:10.560 --> 56:17.120\n exist. And it's a struggle because for those companies, they don't want to fall out of favor\n\n56:17.120 --> 56:24.400\n with the CDC or with the FDA. And so this is a big problem in our marketplace in general by having\n\n56:24.400 --> 56:33.680\n private companies who want to be the public health agents of this pandemic. We lose a lot of control\n\n56:33.680 --> 56:38.240\n because the companies ultimately have to do what's going to make them money so they survive and keep\n\n56:38.240 --> 56:45.040\n performing the service. It's really just such a hard problem. And this is why last time I was here,\n\n56:45.040 --> 56:52.640\n I'm guessing I was probably really pushing for the government to be producing these tests. I think I\n\n56:52.640 --> 56:56.320\n would have still been pushing for that. At this point, I've decided, okay, the government's clearly\n\n56:56.320 --> 57:03.440\n not going to do that. I've been thinking, I really want Elon Musk to produce the tests. I really am\n\n57:03.440 --> 57:09.280\n sort of serious that these tests are simple to make, but we've been using machines to make them\n\n57:09.280 --> 57:15.520\n that have been around for a long time. Scale is an issue right now, kind of. Really, it's the EUA\n\n57:15.520 --> 57:19.680\n process and getting the companies to be allowed to market in the US that's the issue. But let's\n\n57:19.680 --> 57:26.240\n just say scale is the issue. And one company wants to make 20 million tests a day. These aren't that\n\n57:26.240 --> 57:31.360\n hard. We should be able to do that. We just need a faster machine, a better machine, and a quicker\n\n57:31.360 --> 57:36.000\n one. And there's a few folks, like you mentioned, know how to solve that problem. I've had a lot of\n\n57:36.000 --> 57:41.360\n discussion with Tesla folks and know with people that used to work at Tesla, like Jim Keller,\n\n57:41.360 --> 57:46.240\n about how to make stuff much cheaper, much better. That's basically what Tesla is world class at.\n\n57:46.240 --> 57:53.440\n It's like, okay, does this thing have to cost $1,000? No, it can cost $10. And let's figure out\n\n57:53.440 --> 58:00.320\n how to manufacture it. Those folks are like the best in the world at doing that. Okay, but what\n\n58:00.320 --> 58:10.000\n about this Biden action plan? So it sounds like the guy agrees with you, vaccinate or test. So\n\n58:10.000 --> 58:15.920\n I think given that choice, a lot of people go test in America because there's like a division,\n\n58:15.920 --> 58:22.400\n it seems like. So is this just politics? Is this just words? Or do you think this is actually\n\n58:22.400 --> 58:27.040\n going to lead to something? And maybe can you explain what the action plan is?\n\n58:27.040 --> 58:34.400\n Sure. So there's a number of pillars to the action plan. The two that I've been most focused on,\n\n58:34.400 --> 58:37.520\n I mean, some of them are we want to get everyone vaccinated. We want to get everyone vaccinated.\n\n58:37.520 --> 58:44.400\n All these things. And one pillar is saying any company in the United States that has\n\n58:45.200 --> 58:54.880\n more than 100 employees is now required to ensure that any unvaccinated individuals in their workforce\n\n58:55.680 --> 59:04.400\n test weekly. Another pillar is that the president's going to reduce the cost of PCR tests.\n\n59:04.400 --> 59:14.080\n By 35%, which is pretty moderate reduction. And is going to reduce the cost of antigen tests\n\n59:14.080 --> 59:20.640\n and scale them up and make 280 million tests and put $2 billion into it.\n\n59:22.400 --> 59:26.320\n So those are the two that I found most intriguing for the kind of mission that I've been on, which\n\n59:26.320 --> 59:31.200\n is to just educate people around, hey, we have really, really powerful products that we can\n\n59:31.200 --> 59:36.080\n educate people around. Hey, we have really, really powerful public health tools we have yet to deploy.\n\n59:39.520 --> 59:46.320\n The issue at hand though, is that now that the president has said vaccinate or test,\n\n59:47.360 --> 59:52.400\n there's a problem inherent in that. It's essentially to coerce people around vaccinated\n\n59:52.400 --> 59:56.320\n to get vaccinated. Because vaccinate or test doesn't make sense when the vaccinated people\n\n59:56.320 --> 1:00:00.000\n can transmit the virus just fine. It should be vaccinate and test.\n\n1:00:00.000 --> 1:00:05.440\n Exactly. The problem that I have with that vaccinate or test idea is it's great if you\n\n1:00:05.440 --> 1:00:12.160\n want to use it as a coercive effort to get people vaccinated. I'm not going to wade into that\n\n1:00:12.160 --> 1:00:17.840\n argument. Do I agree with it or not? I'm just not going to even put my words under.\n\n1:00:17.840 --> 1:00:25.360\n I disagree with it. Let me say, I disagree. As opposed to doing great science communication,\n\n1:00:25.360 --> 1:00:31.600\n this weird, people talking down to the populace as if they're children trying to trick them.\n\n1:00:31.600 --> 1:00:39.680\n Here, have some candy. Everyone with common sense. Somebody told me I was having a conversation.\n\n1:00:40.240 --> 1:00:43.120\n If the government is going to give you money to take the vaccine,\n\n1:00:43.840 --> 1:00:49.680\n people that were already hesitant about the vaccine are not going to trust whatever the\n\n1:00:49.680 --> 1:00:54.080\n heck you're doing. Don't trick people into taking the vaccine. Be honest and communicate\n\n1:00:54.080 --> 1:01:00.960\n transparently everything that's known about the vaccine. Communicate the data. Inspire people with\n\n1:01:04.480 --> 1:01:10.320\n transparency and real communication of all the uncertainty around it and all the difficult\n\n1:01:10.320 --> 1:01:16.320\n decisions of risk and all those kinds of things. As opposed to trying to trick them like children\n\n1:01:16.320 --> 1:01:22.480\n into taking the vaccine anyway. Yes. Okay. Well, I didn't have to say that.\n\n1:01:22.480 --> 1:01:28.880\n So there we go. But you're saying it should not be like vaccinate or test. That tradeoff\n\n1:01:28.880 --> 1:01:35.200\n does not make sense. Exactly. By saying vaccinate or test is absolutely confusing\n\n1:01:35.920 --> 1:01:40.480\n because it implies for anyone who's thinking about it, it is implying. And I've seen this\n\n1:01:40.480 --> 1:01:44.160\n because I have business leaders call me, Fortune 500 business leaders who call me and say,\n\n1:01:44.960 --> 1:01:50.080\n what do I do? I have 8,000 employees. Where am I going to get my tests? And a lot of people are\n\n1:01:50.080 --> 1:01:58.240\n saying, they're calling this a pandemic of the unvaccinated. These types of divisive language\n\n1:01:58.240 --> 1:02:02.480\n doesn't help. This isn't a pandemic of the unvaccinated. This is a pandemic of a fucking\n\n1:02:02.480 --> 1:02:09.120\n virus. Don't ever put it on the unvaccinated who frankly are just scared. They don't know who to\n\n1:02:09.120 --> 1:02:17.440\n trust. And we haven't given them a lot of reason to trust public health, to be frank. So I agree.\n\n1:02:17.440 --> 1:02:22.800\n I mean, now that you've opened the door, I'll just say my piece. Absolutely, we need to be the most\n\n1:02:22.800 --> 1:02:30.400\n honest we can with all of this. This is confusing language to say vaccinate or test. We need to be\n\n1:02:30.400 --> 1:02:37.840\n very upfront and say, look, vaccines aren't stopping transmission very well. Unfortunately,\n\n1:02:37.840 --> 1:02:43.120\n this is the world we have. We have Delta. We're going to have new mutants. We have a vaccine that\n\n1:02:43.120 --> 1:02:50.560\n wanes somewhat over time. This is biology. I'm sorry. This is just what it is. And then we say,\n\n1:02:50.560 --> 1:02:55.280\n but the vaccines are really protective for your personal health. They're going to keep you out of\n\n1:02:55.280 --> 1:03:01.280\n the hospital. This is what you should care about as an individual. And as a population,\n\n1:03:01.280 --> 1:03:04.320\n we need to figure out, okay, we have to stop transmission if that's our goal.\n\n1:03:05.760 --> 1:03:09.440\n So we should use the tools that are going to stop transmission if that's our goal. And saying\n\n1:03:09.440 --> 1:03:15.120\n vaccinate or test, if our goal is to actually stop transmission, that's confusing because vaccines are\n\n1:03:15.120 --> 1:03:22.880\n not stopping it. There may be mildly lowering the risk of transmission. So I'm just not a fan of that\n\n1:03:22.880 --> 1:03:26.880\n language. I think we should be being very, very clear, like you said, and upfront about what are\n\n1:03:26.880 --> 1:03:34.560\n the limitations of the vaccine and of the test. And we should be very clear that it can only help.\n\n1:03:34.560 --> 1:03:41.920\n The American public in aggregate is extremely intelligent. They will figure out when you say\n\n1:03:41.920 --> 1:03:47.840\n that vaccine breakthrough cases are rare, and then they start seeing story after story of whole\n\n1:03:47.840 --> 1:03:52.480\n parties of people who are vaccinated have outbreaks. And everyone knows more people now\n\n1:03:52.480 --> 1:03:57.120\n who are having breakthrough cases than they knew who had regular cases before the vaccine.\n\n1:03:57.120 --> 1:04:02.160\n People start to wonder, hmm, well, this is weird. They say that the vaccines are working,\n\n1:04:02.160 --> 1:04:05.680\n breakthrough cases are rare. Maybe the whole vaccine program is failing entirely.\n\n1:04:06.240 --> 1:04:11.680\n And so it ends up shooting ourselves in the foot if we try to create false expectations,\n\n1:04:11.680 --> 1:04:16.720\n because we think it's going to be beneficial for one thing when it's not for the other.\n\n1:04:16.720 --> 1:04:25.920\n And so to get back to the action plan, vaccinate or test, I think, and the increase in rapid tests,\n\n1:04:25.920 --> 1:04:32.960\n I do think it was a bold move. I would say that it was the most prominent sort of display,\n\n1:04:33.600 --> 1:04:39.680\n encouraging display of the fact that rapid tests are indeed effective public health tools.\n\n1:04:40.720 --> 1:04:46.880\n My real concern now is that 280 million tests, that's like less than one per person per year\n\n1:04:46.880 --> 1:04:52.480\n in the United States. So that's not the way that he said and delivered it. And what most people\n\n1:04:52.480 --> 1:04:56.000\n think of when they hear the word 280 million, you don't usually put a lot of thought into,\n\n1:04:56.000 --> 1:05:01.040\n what does that number mean? It sounds a big number. Most people are now going to be expecting\n\n1:05:01.040 --> 1:05:06.320\n that these tests are actually going to be staying in stock on the shelves at CVS and Walgreens and\n\n1:05:06.320 --> 1:05:13.120\n Amazon or whatever. So that's crisis number one is like, now the expectation is set for having rapid\n\n1:05:13.120 --> 1:05:18.160\n tests, but they're not going to scale that well. We won't have them. And then there's vaccinate or\n\n1:05:18.160 --> 1:05:23.600\n test. And that's going to bring millions and millions of people who are not currently testing\n\n1:05:23.600 --> 1:05:28.400\n to have to start testing. So that's going to overwhelm our PCR labs. And it's going to create\n\n1:05:28.400 --> 1:05:34.800\n five day delays again with PCR, if not longer, because we'll have backlogs. And so the only real\n\n1:05:34.800 --> 1:05:39.920\n solution to this is to just scale up the tests that are actually scalable. And that's the simple\n\n1:05:39.920 --> 1:05:44.560\n rapid tests. And it's not even to scale them up through production and manufacturing here.\n\n1:05:44.560 --> 1:05:50.240\n It's to open the doors so that the companies that already exist here and can scale are allowed to do\n\n1:05:50.240 --> 1:05:55.440\n it and to bring in the international market. Some of the biggest diagnostic companies in the world\n\n1:05:56.160 --> 1:06:00.640\n are not selling their millions and millions and millions of tests in the billions of tests in the\n\n1:06:00.640 --> 1:06:06.960\n United States because they don't want to play the game that the FDA is currently requiring of them.\n\n1:06:07.840 --> 1:06:12.640\n So we have an opportunity and I am very encouraged that the president actually did put these into the\n\n1:06:12.640 --> 1:06:18.880\n action plan. And I do want to say for the record that I'm supportive of it in principle. But I\n\n1:06:18.880 --> 1:06:25.840\n think now we actually are in the time where it has been set and we have to deal with the crisis before\n\n1:06:25.840 --> 1:06:32.160\n it happens. Otherwise, there could be some real political points taken off. I do worry that the\n\n1:06:32.160 --> 1:06:36.080\n president, if he doesn't pull through with this and really make the tests available and we end\n\n1:06:36.080 --> 1:06:41.360\n up getting into this other test crisis this fall, there could be political consequences to that.\n\n1:06:41.360 --> 1:06:45.360\n And the reason is these rapid tests are so personal, they become emotional almost.\n\n1:06:46.480 --> 1:06:51.360\n They give people that empowerment that I was talking about earlier. And when people can't get\n\n1:06:51.360 --> 1:06:57.360\n that because the shelves are out of stock, they actually feel frustrated and then that converts\n\n1:06:57.360 --> 1:07:04.560\n into anger and blame. And so I do think that we have to be really smart about making a policy\n\n1:07:04.560 --> 1:07:09.600\n like this and then ensuring that we can carry through with what the average American is actually\n\n1:07:09.600 --> 1:07:16.560\n expecting. And speaking of politics, one of the great things about testing, maybe you can correct\n\n1:07:16.560 --> 1:07:22.880\n me, but from my sense, it's one of the only solutions to COVID that has not yet been politicized.\n\n1:07:23.440 --> 1:07:30.640\n So masks and vaccines, whether you like it or not, have been heavily politicized where there's\n\n1:07:30.640 --> 1:07:41.440\n literally a red blue split on the use of those or like proud use, effective use of those tools.\n\n1:07:42.000 --> 1:07:47.120\n And it seems like everybody I talked to about testing, everybody's on board, red or blue.\n\n1:07:47.680 --> 1:07:53.200\n They are, which is why I am particularly concerned about the vaccinate or test policy.\n\n1:07:53.840 --> 1:07:56.720\n Because all of a sudden we just politicized it. We just\n\n1:07:56.720 --> 1:08:01.360\n brought it with this thing that was fully bipartisan, really bipartisan. I mean, I've\n\n1:08:01.360 --> 1:08:08.080\n talked to the fully, the really right side of Congress and the super liberal side of Congress,\n\n1:08:08.080 --> 1:08:14.880\n the Senate, the same politicians, governors everywhere in this country have asked me for\n\n1:08:14.880 --> 1:08:20.160\n support around these rapid tests because it's just, you can have it reported or not. You can\n\n1:08:20.160 --> 1:08:24.240\n have it in the home, in the privacy of your own home or not, or you do it at school.\n\n1:08:24.240 --> 1:08:29.280\n And these tools are just so powerful to identify infectious people. They didn't have to be\n\n1:08:29.280 --> 1:08:34.080\n politicized. They still don't. I don't think that the action plan went so far that it's going to\n\n1:08:34.080 --> 1:08:39.360\n politicize them. But I do think already it's starting to conjure up emotion saying, well,\n\n1:08:39.360 --> 1:08:46.960\n now I have to get tested. The have to part, right. And that is where we go wrong. I have to get\n\n1:08:46.960 --> 1:08:55.600\n we go wrong. I have to get tested or vaccinated. Screw that. I am independent, whatever. And\n\n1:08:57.360 --> 1:09:02.240\n I do worry that this thing that was purely bipartisan, that we could have just scaled\n\n1:09:02.240 --> 1:09:05.760\n up months ago. People would have, we could have delivered it to every household. Didn't even have\n\n1:09:05.760 --> 1:09:12.160\n to ask people to request it. Just delivered packages to every home in America by now easily.\n\n1:09:12.160 --> 1:09:17.600\n And if we were smart about it, you know, we could have done it. The most unpleasant thing about\n\n1:09:17.600 --> 1:09:24.560\n COVID is the uncertainty. And that's what leads to fear on both the vaccine hesitant,\n\n1:09:24.560 --> 1:09:32.080\n is the uncertainty about the vaccine and people who have taken the vaccine, the uncertainty around\n\n1:09:32.080 --> 1:09:38.240\n like, am I in danger walking around? Can I go, can I walk down the hall? Like this fear of the world\n\n1:09:38.240 --> 1:09:45.040\n around you. And I think testing allows you to remove a lot of that uncertainty. Like you,\n\n1:09:45.040 --> 1:09:50.640\n you gain back confidence that you can operate in this world and not get infected and you become\n\n1:09:50.640 --> 1:09:56.560\n like a nicer person. I find myself every time I get tested, I become a nicer person to others\n\n1:09:56.560 --> 1:10:00.800\n because I know I'm not putting them in danger. I'm not putting people in danger.\n\n1:10:00.800 --> 1:10:07.760\n It's a, it's a heavy burden to carry to worry. Am I infectious? Like I was out last night,\n\n1:10:07.760 --> 1:10:12.320\n but I do want to go see my mom today, you know, like, am I infectious? I don't know. And this has\n\n1:10:12.320 --> 1:10:22.160\n created massive anxiety and I can't, I completely agree that it is, it's a relieving feeling and,\n\n1:10:22.160 --> 1:10:27.520\n and it's an amazing feeling to be in a room when, and I did this in the middle of the pandemic when\n\n1:10:27.520 --> 1:10:34.000\n everyone was supposed to be wearing a mask indoors and everyone rapid tests, you know, and I said,\n\n1:10:34.000 --> 1:10:40.080\n everyone should rapid test before you walk into this room. And it was a wonderful experiment\n\n1:10:40.640 --> 1:10:46.960\n because everyone was just so relaxed. You know, the other, the alternative is everyone, nobody\n\n1:10:46.960 --> 1:10:54.800\n tests and everyone wears a mask. You have a mask that maybe gives you 20% maybe protection during,\n\n1:10:54.800 --> 1:10:59.920\n if you're all in the same room together, if that, or you have a rapid test program where everyone\n\n1:10:59.920 --> 1:11:04.960\n rapid test before, and that gives you like 95% to a hundred percent protection, not a hundred\n\n1:11:04.960 --> 1:11:10.560\n percent, but close. And all of a sudden that allows everyone to take a big sigh and be like,\n\n1:11:10.560 --> 1:11:15.520\n wow, this is the first time I've seen people without masks indoors in a long time. And I feel\n\n1:11:15.520 --> 1:11:20.160\n pretty good. And restaurants, like restaurants are scary right now because you just don't know\n\n1:11:20.160 --> 1:11:27.520\n who might be infectious and nobody's masked. And like, wouldn't it be great to just go into\n\n1:11:27.520 --> 1:11:32.800\n a restaurant where you know that everyone just tested negative that day? It just really reduces\n\n1:11:32.800 --> 1:11:39.760\n anxiety. It makes individuals feel empowered. And I mean, at the end of the day, COVID and\n\n1:11:39.760 --> 1:11:45.760\n our response to COVID is a, it's truly an information problem. You know, why do we\n\n1:11:45.760 --> 1:11:49.840\n quarantine anyone? Why did we ever close anything down? We didn't close things down because everyone\n\n1:11:49.840 --> 1:11:56.000\n is positive. We closed things down because we didn't know if anyone was positive. We quarantine\n\n1:11:56.000 --> 1:12:01.120\n a whole classroom of kids, not because they're all positive, but because we don't know if one\n\n1:12:01.120 --> 1:12:05.760\n of them are positive. And so we just quarantine everyone when there's a positive in the case,\n\n1:12:05.760 --> 1:12:09.600\n in the, in the classroom, like one day, we'll then ask the whole classroom not to come to school for\n\n1:12:09.600 --> 1:12:17.600\n 10 days. That's not a biological problem. That's an information problem. And the crazy thing is we\n\n1:12:17.600 --> 1:12:23.520\n have the tool to solve that information problem. It's literally our eyes on the virus. It's how\n\n1:12:23.520 --> 1:12:27.760\n we see this virus. And if everyone glowed green, when they were infectious, we would have never\n\n1:12:27.760 --> 1:12:31.760\n had to close down anyone, any society. And we would have never had the outbreaks because we\n\n1:12:31.760 --> 1:12:36.480\n would have been able to stay away from the green people, you know? And yeah, I like what you said,\n\n1:12:36.480 --> 1:12:40.560\n the quarantine is an information problem. That's absolutely right. What, is there something you\n\n1:12:40.560 --> 1:12:48.160\n can say to what people can do, like listening to this, individuals? Do you just complain like\n\n1:12:48.160 --> 1:12:54.160\n loudly? Like, why can't we do this? Can you speak with your money somehow? What, what can people do\n\n1:12:55.040 --> 1:13:01.680\n to help? God, it's, it's amazing to think you're asking me this question and this video will go\n\n1:13:01.680 --> 1:13:08.880\n out to, you know, the web and all the people that watch you. And last year in July, maybe\n\n1:13:08.880 --> 1:13:13.360\n something like that, June, I forget exactly when it was, I was on Twiv this week in virology.\n\n1:13:14.400 --> 1:13:18.000\n Shout out to Twiv. Those guys are awesome. They are awesome. I love, I love Twiv.\n\n1:13:19.120 --> 1:13:23.680\n And they asked me the exact same question towards the end. They said, this makes so much sense. You\n\n1:13:23.680 --> 1:13:29.040\n know, why wouldn't we do this? What can people do? And so I said, oh, you know, just send me an email,\n\n1:13:29.040 --> 1:13:35.120\n like write to me. I'm sure you could find my email somewhere online and get in touch and I will,\n\n1:13:35.120 --> 1:13:41.280\n you know, and we can try to figure out how to make something happen. Bad idea.\n\n1:13:41.280 --> 1:13:41.840\n Very smart.\n\n1:13:43.440 --> 1:13:47.280\n Way too many emails. I didn't, I feel bad because I didn't end up getting back to anyone because I\n\n1:13:47.280 --> 1:13:52.640\n just got inundated. But it did lead to the development of rapidtest.org where we did\n\n1:13:53.280 --> 1:13:59.440\n automate the process of writing letters to congressional members and elected representatives.\n\n1:13:59.440 --> 1:14:07.760\n So that helps. Fast forward to today. What can, what can people do? I honestly don't know. Like,\n\n1:14:07.760 --> 1:14:13.360\n what can the average person at this point do? We have tried everything. The FDA is immutable on\n\n1:14:13.360 --> 1:14:19.200\n this. They will not change and we shouldn't ask them to change because they have decided that this\n\n1:14:19.200 --> 1:14:23.440\n is how they regulate medical devices and they're going to stick to it. So what we need to do,\n\n1:14:23.440 --> 1:14:31.120\n what we need to do, and maybe this is something to do, is get, if you know people who have sway\n\n1:14:31.120 --> 1:14:37.520\n over politicians, lobbyists, whatever it might be, let people know to request that the president,\n\n1:14:37.520 --> 1:14:45.360\n literally the president of the United States, uses executive powers to just do a simple,\n\n1:14:45.360 --> 1:14:50.800\n something as simple as designating these powerful public health tools as public health tools.\n\n1:14:50.800 --> 1:14:58.080\n Allow the CDC and the NIH or whomever it must be or academic centers of excellence designated by\n\n1:14:58.080 --> 1:15:05.360\n the CDC to evaluate the tests in a very fast fashion with the appropriate metrics that these\n\n1:15:05.360 --> 1:15:11.680\n tests need to achieve for public health. And within two days we can have 10 new tests authorized.\n\n1:15:12.480 --> 1:15:16.400\n You know, this doesn't have to be a six to 12 month endeavor. This could be a two day\n\n1:15:16.400 --> 1:15:22.880\n endeavor. We actually did it. I judged the rapid test XPRIZE and it went great. We actually got\n\n1:15:22.880 --> 1:15:28.880\n incredible metrics about how well does each test work and no clinical trials, you know,\n\n1:15:28.880 --> 1:15:33.200\n just a couple days worth of work in the lab and boom. And if we actually systematize it,\n\n1:15:33.200 --> 1:15:39.280\n it would be an hour or so in the lab. You know, so simple. So I don't know. I mean,\n\n1:15:39.280 --> 1:15:44.080\n I don't know how to really impact change. Thankfully, you know, I have a platform and\n\n1:15:44.080 --> 1:15:49.840\n I've been able to start talking with people who are very close to the President and the White\n\n1:15:49.840 --> 1:15:57.360\n House. And I do think that some change is finally happening because the silver bullet of the vaccine\n\n1:15:57.360 --> 1:16:03.440\n has not panned out to be the silver bullet. So now we got to now I think we're moving from a country\n\n1:16:03.440 --> 1:16:08.800\n that was a vaccine only approach to finally recognizing at the highest levels that there's\n\n1:16:08.800 --> 1:16:15.200\n other tools. Do you think it's possible to reopen fully without solving the testing problem\n\n1:16:15.200 --> 1:16:22.320\n completely? Like, do you think this vaccine approach will get us to reopen fully? I do.\n\n1:16:22.320 --> 1:16:29.440\n Yeah, I think over time, though. I mean, if we a lot of people ask me, like, what's what's like\n\n1:16:29.440 --> 1:16:36.800\n happening? Like, what's the end game here? Like, where does this end? And it's actually not a\n\n1:16:36.800 --> 1:16:45.440\n mystery. The end game is we will grow out of this virus. And by that, I mean, you and I\n\n1:16:46.320 --> 1:16:53.920\n and most people who are watching this are adults, right? Adults don't like to get infected with a\n\n1:16:53.920 --> 1:16:59.680\n virus for the very first time as adults. Babies are OK with it. And so what we have to do to\n\n1:16:59.680 --> 1:17:06.400\n understand how we're getting out of this virus is to look at babies like at newborns and say, OK,\n\n1:17:06.400 --> 1:17:12.320\n how does a baby get out of their high risk time period? They get exposed. They get exposed multiple\n\n1:17:12.320 --> 1:17:18.320\n times or vaccinated, of course. And eventually they get exposed enough that they build up this\n\n1:17:18.320 --> 1:17:22.720\n nice cushion of immunity that's sufficiently diverse that they can battle whatever gets\n\n1:17:22.720 --> 1:17:28.480\n thrown at them because they've seen it all already. But one exposure doesn't do it. I mean,\n\n1:17:28.480 --> 1:17:33.600\n over the course of the first few years of life, kids get exposed to coronaviruses tons of times,\n\n1:17:33.600 --> 1:17:37.600\n lots of different viruses they get. So unfortunately, what's happening with us,\n\n1:17:37.600 --> 1:17:43.040\n why this is so bad for us, is that as we're adults, we don't regenerate tissue very well.\n\n1:17:43.040 --> 1:17:47.120\n We have like overabundant inflammatory response. We have all these problems that when we get an\n\n1:17:47.120 --> 1:17:53.120\n infection for the first time, it sucks. It harms us. It causes us problems. But over time, just\n\n1:17:53.120 --> 1:17:58.320\n like a baby, we're going to start building up our immunity through vaccines and exposures.\n\n1:17:58.320 --> 1:18:03.280\n And I hate to say it, but tons of people are getting exposed to Delta right now who don't\n\n1:18:03.280 --> 1:18:12.400\n know it. Tons. And if you're vaccinated, you don't know it, is my point there. And at the end of the\n\n1:18:12.400 --> 1:18:18.080\n day, this is actually, I do not want this to be misconstrued as like saying, go get infected.\n\n1:18:18.080 --> 1:18:23.360\n But the fact that people are getting infected will add to our level of protection later on.\n\n1:18:23.360 --> 1:18:28.480\n And so... Yeah, but the question is how long that whole process takes. I think, you know,\n\n1:18:28.480 --> 1:18:34.640\n my guess is probably by the end of next year, early 2023, we will probably start looking at\n\n1:18:34.640 --> 1:18:39.200\n this as though it is not a particularly dangerous virus for most people. The elderly though,\n\n1:18:39.200 --> 1:18:43.920\n it will still be, but that's because their immunity... Variants and stuff. And I've heard\n\n1:18:43.920 --> 1:18:50.080\n other people say the statement you just said a year ago about the spring, right? Well, that\n\n1:18:50.080 --> 1:18:56.880\n probably was not wise. Well, I mean, it's because the intuition is like, okay, now that there's a\n\n1:18:56.880 --> 1:19:01.680\n vaccine, you're either going to take the vaccine or get infected and then there'll be herd immunity\n\n1:19:01.680 --> 1:19:08.480\n over, like it'll be very quick. So, you know, that's the intuition, but it seems like that's not\n\n1:19:09.120 --> 1:19:16.320\n happening. It seems like we're in this constant state of fear mongering for different reasons.\n\n1:19:16.320 --> 1:19:23.520\n It's almost like the virus got deeply integrated, not into just our biology, but\n\n1:19:24.080 --> 1:19:31.920\n in the game of politics and in the fear mongering around the news because the virus now started\n\n1:19:31.920 --> 1:19:39.200\n being together with the vaccine and the masks and it started getting integrated into the division\n\n1:19:39.200 --> 1:19:46.320\n and that's so effective at monetizing social media, for example. And so it's like, all right,\n\n1:19:47.200 --> 1:19:52.480\n so how do you get out of that? Because you can always kind of present certain kinds of numbers\n\n1:19:52.480 --> 1:20:01.280\n about number of cases or how full hospitals are and start making claims about that we're still,\n\n1:20:01.280 --> 1:20:06.640\n this is as bad as it's ever been, those kinds of statements. And so I'm not sure exactly what the\n\n1:20:06.640 --> 1:20:13.440\n way out is except the same way out as it was originally, which is testing is information.\n\n1:20:13.440 --> 1:20:13.920\n Yeah.\n\n1:20:13.920 --> 1:20:15.200\n It's information.\n\n1:20:15.200 --> 1:20:21.040\n Yeah. And I think we can do that. We can keep outbreaks suppressed with testing because it's\n\n1:20:21.040 --> 1:20:24.160\n information. Like people keep thinking of tests as being medical things. They're not,\n\n1:20:24.160 --> 1:20:31.760\n they're information. It can allow us to control things. Just like we drive down a road and we\n\n1:20:31.760 --> 1:20:35.360\n look at the cars and we don't hit other cars because we have the information that they're\n\n1:20:35.360 --> 1:20:39.520\n in the lane next to us and they're moving over. That's just information.\n\n1:20:39.520 --> 1:20:45.280\n Like you said, glow green. The problem with the virus, you don't see. You're walking around\n\n1:20:45.280 --> 1:20:54.960\n and everybody is a potential infectious creature. And so if you see the world as a potential for\n\n1:20:54.960 --> 1:20:56.880\n infection, you're going to be terrified of that.\n\n1:20:56.880 --> 1:21:01.360\n That's exactly right. And that is what has happened. And that's why I've been pushing so\n\n1:21:01.360 --> 1:21:06.880\n hard for these tests because they can allow people, if you use them at a community level,\n\n1:21:06.880 --> 1:21:10.160\n you can have enough people know that they're positive, enough people are good people that\n\n1:21:10.160 --> 1:21:15.280\n they won't go out and infect others. And the other great thing about them is again,\n\n1:21:15.280 --> 1:21:20.240\n a 10 day isolation period, especially for a vaccinated person, but in either case,\n\n1:21:21.440 --> 1:21:26.960\n is also an information problem. We don't have to isolate for 10 days if we're infected. What if\n\n1:21:26.960 --> 1:21:31.520\n we're only infectious for two, especially if we're vaccinated? Why are we telling people the only\n\n1:21:31.520 --> 1:21:38.240\n reason the CDC ever and the WHO ever suggested a 10 day isolation or a 14 day quarantine is because\n\n1:21:38.240 --> 1:21:43.040\n we didn't know when people stopped being infectious. There's actually some people stay infectious for\n\n1:21:43.040 --> 1:21:48.720\n 14 days. It's rare. But there's a lot of people who stay infectious for like four. And that's\n\n1:21:48.720 --> 1:21:53.600\n a whole nother week that we're asking people to isolate. People would probably be much more likely\n\n1:21:53.600 --> 1:21:58.240\n to comply if they only had to isolate as long as they wake up each morning and see two lines,\n\n1:21:58.800 --> 1:22:02.880\n because you're actually seeing it for your own two eyes. You're being empowered to make your\n\n1:22:02.880 --> 1:22:06.880\n own decision. You're not being told you need to isolate for 10 days and you're sitting there\n\n1:22:06.880 --> 1:22:11.760\n thinking, oh, I feel fine. I don't know. There's a lot of asymptomatic spread. But if you see the\n\n1:22:11.760 --> 1:22:18.000\n two lines every day, then you actually get to, you're doing a little experiment for yourself to\n\n1:22:18.000 --> 1:22:23.200\n prove to yourself, today I'm still infectious. Let's hope it's tomorrow. Come on immune system.\n\n1:22:23.200 --> 1:22:26.960\n You can do this. And then you get to day four and boom, you start being negative.\n\n1:22:28.160 --> 1:22:33.840\n That's a much more tolerable thing because you are being able to make that decision based on\n\n1:22:34.640 --> 1:22:40.320\n true data that is empowering you. And it really does change, changes everything,\n\n1:22:40.320 --> 1:22:45.760\n because it's all fear and empowerment and these are empowering devices.\n\n1:22:46.560 --> 1:22:50.800\n Well, I wanted to have this conversation with you because obviously it's a great solution.\n\n1:22:50.800 --> 1:22:53.520\n Let's keep talking about it. People who will listen to this should,\n\n1:22:55.120 --> 1:23:01.200\n I guess, pressure local politicians, federal, national politicians.\n\n1:23:01.200 --> 1:23:08.160\n Write articles with the title like, Dear POTUS, please designate these as public health tools.\n\n1:23:08.160 --> 1:23:11.520\n Or just start talking about it in the media. Talk about it on social media, anywhere.\n\n1:23:12.080 --> 1:23:18.640\n Testing is a public health good. Testing is a public health good. It should not be considered\n\n1:23:18.640 --> 1:23:26.320\n a medical device. I shouldn't have to pay to keep you safe. Testing should generally be free\n\n1:23:26.320 --> 1:23:32.160\n for that matter, subsidized by the government. These tools exist. We should all... And I think\n\n1:23:32.160 --> 1:23:38.240\n the more people that generate noise to just say, a public health test is a public health tool.\n\n1:23:40.160 --> 1:23:43.600\n Period. You can't even argue with it. That's just true.\n\n1:23:43.600 --> 1:23:49.600\n Yeah. I think if you talk about it enough, then certain people that have even a bigger platform,\n\n1:23:49.600 --> 1:23:58.640\n like Elon Musk, Sunder Prachai, those folks that have power to really do large scale manufacturing,\n\n1:23:58.640 --> 1:24:04.960\n also influence governments, will pay attention. And that's the hope. Enough people talk about it.\n\n1:24:04.960 --> 1:24:09.440\n I think business leaders, like business leaders, obviously have so much power here.\n\n1:24:09.440 --> 1:24:13.600\n Yeah. They pay the lobbyists who make things\n\n1:24:13.600 --> 1:24:17.600\n happen. Let's be honest. There's people who pull levers that are not the politicians themselves.\n\n1:24:17.600 --> 1:24:23.120\n And I do think business leaders have so much to gain from these tools to keep their businesses\n\n1:24:23.120 --> 1:24:27.600\n safe, to not have to quarantine and lockdown. And I hope that all of them hear this message to say,\n\n1:24:29.360 --> 1:24:34.480\n let's ask the president or the people around the president to designate these as public\n\n1:24:34.480 --> 1:24:39.680\n health tools. Change the system. And if you can't change every aspect of the system,\n\n1:24:39.680 --> 1:24:43.120\n then figure out how to change the system enough so that you're doing everything\n\n1:24:43.840 --> 1:24:48.560\n in a safe way that is not endangering anyone, but it is only protective.\n\n1:24:48.560 --> 1:24:53.760\n Yeah. You mentioned last time that you spent time as a Buddhist monk.\n\n1:24:54.960 --> 1:25:00.160\n We didn't spend much time talking about it. I just would love to talk to you about it a\n\n1:25:00.160 --> 1:25:08.000\n little bit more. Maybe by way of advice, how do you recommend people can integrate\n\n1:25:08.000 --> 1:25:12.480\n meditation into their lives? Or how does one meditate?\n\n1:25:14.720 --> 1:25:26.000\n I think for me, meditation was really an active effort, which sounds weird because most people\n\n1:25:26.000 --> 1:25:35.200\n think of meditation as the absence of activity. But just like anything, meditation requires\n\n1:25:35.200 --> 1:25:42.800\n exercise. In this case, it requires exercise and quieting your mind. And the whole... Well,\n\n1:25:42.800 --> 1:25:49.440\n there's a lot of different reasons people meditate. Most people watching this podcast or this show,\n\n1:25:49.440 --> 1:25:50.960\n what is this called? I don't know.\n\n1:25:50.960 --> 1:25:53.360\n Is this an interview? I'm not even recording. This is\n\n1:25:53.360 --> 1:26:01.680\n just you and I talking. It is. Most people are meditating to bring\n\n1:26:01.680 --> 1:26:06.720\n some balance and bring some sanity to their life and just be able to control their feelings and\n\n1:26:06.720 --> 1:26:14.560\n emotions a little bit more. And for that purpose, I think the best way to... What meditation is,\n\n1:26:14.560 --> 1:26:18.800\n if you can call it what you will, it's just getting some alone time, some time to think\n\n1:26:18.800 --> 1:26:26.560\n or not think. Whatever looks different for each person. For me, it was a very active effort to\n\n1:26:26.560 --> 1:26:34.800\n try to quiet my mind with the explicit intent to detach from things, from lots of things.\n\n1:26:34.800 --> 1:26:40.640\n And it's actually... It sounds weird in our culture here to talk about detachment as a goal.\n\n1:26:41.840 --> 1:26:47.760\n Detachment from loved ones, detachment from objects is easy to reconcile. People understand\n\n1:26:47.760 --> 1:26:52.320\n that, yeah, I don't want to be too attached to my car or whatever. But detachment from\n\n1:26:52.320 --> 1:26:56.720\n a loved one is a very hard thing because we want to do the opposite usually. We want to love a loved\n\n1:26:56.720 --> 1:27:05.920\n one. But in a lot of Buddhist thought, it is those attachments that keep people in this cycle of\n\n1:27:05.920 --> 1:27:18.240\n rebirth. Now, I don't personally believe in rebirth in a Buddhist sense in that you actually get\n\n1:27:18.240 --> 1:27:25.680\n born multiple times. I think my personal feeling is we die and we're vanished. That's just me.\n\n1:27:25.680 --> 1:27:36.480\n But I still really found meditation to be extraordinarily powerful to feel control over\n\n1:27:36.480 --> 1:27:42.640\n a whole different part of my body that I never thought that it could be controlled, your mind.\n\n1:27:42.640 --> 1:27:50.640\n You close your eyes and most of us immediately start seeing blotches and we start thinking about\n\n1:27:50.640 --> 1:27:56.320\n things. And it's an amazing feeling to start getting to the point where you can actually\n\n1:27:59.440 --> 1:28:08.400\n quiet your mind and close your mind down so that you can just have peace, silence of your mind\n\n1:28:08.400 --> 1:28:14.800\n for a long period of time. And I loved it. But it's kind of a dangerous slope because you can\n\n1:28:14.800 --> 1:28:19.840\n kind of get caught up in it and really start going from, okay, I'm trying to quiet my mind\n\n1:28:19.840 --> 1:28:25.200\n to almost being addicted to quieting your mind. And it was a very active exercise every day,\n\n1:28:25.200 --> 1:28:33.840\n 15 hours a day to just practice quieting my mind. And eventually I could. And in Buddhism,\n\n1:28:33.840 --> 1:28:38.400\n there's a whole lot of stages that you go through too. Once you hit that point where you can quiet\n\n1:28:38.400 --> 1:28:47.600\n your mind, then there's other psychological things that happen. And eventually the end goal for a\n\n1:28:47.600 --> 1:28:53.600\n Buddhist monk who's spending their life meditating in the forest is to achieve nirvana, is to have\n\n1:28:54.160 --> 1:29:00.080\n an absence of any attachment to the point where you're not even attached to your own foot or your\n\n1:29:00.080 --> 1:29:09.520\n own leg. You can cut it off. So you don't even have an attachment to self, to ego? Do you feel\n\n1:29:09.520 --> 1:29:16.560\n like a conscious being or no? Well, I never attained it, but I didn't really. So the goal\n\n1:29:16.560 --> 1:29:22.160\n is you have to first look at it through the eyes of samsara, which is the cycle of rebirth,\n\n1:29:22.880 --> 1:29:27.600\n which is suffering. It's a cycle of suffering is how it's viewed. And the idea is like,\n\n1:29:27.600 --> 1:29:33.280\n if I really love this hat and then the hat gets lost, I'm sad. So that makes me suffer.\n\n1:29:34.320 --> 1:29:40.080\n And if I hate this hat and I see it, then it makes me sad or mad. And that is an emotion.\n\n1:29:40.080 --> 1:29:45.360\n But if I'm completely ambivalent about that hat, I don't care if it's there,\n\n1:29:45.360 --> 1:29:52.080\n I don't care if it gets lost, if it's shredded, then that invokes no emotional rise out of me,\n\n1:29:52.080 --> 1:29:57.520\n good or bad. And so the idea is to find the balance there where you are so detached from\n\n1:29:57.520 --> 1:30:03.840\n everything that you're not getting a rise, negative or positive. And this is really,\n\n1:30:03.840 --> 1:30:13.840\n it's really such a distinct thing in a relative to our normal lives here in America where we live\n\n1:30:13.840 --> 1:30:20.400\n for rises. You want happiness and joy. And then you also, nobody wants sadness, but when you come\n\n1:30:20.400 --> 1:30:26.080\n out of sadness, you feel happy. Either way it averages out. And if it doesn't average out,\n\n1:30:26.080 --> 1:30:31.760\n then you're in a bad spot. That would be things like major depressive disorder where you're\n\n1:30:31.760 --> 1:30:36.080\n truly not averaging out. But if you're living a pretty happy life, that's why there's no right\n\n1:30:36.080 --> 1:30:40.400\n or wrong. You can go up and down and you average out or you can just go that straight line.\n\n1:30:40.400 --> 1:30:49.040\n So this is not necessarily the Buddhist ideal is somehow obviously the ideal you should strive for,\n\n1:30:49.600 --> 1:30:55.680\n but the actual exercise of meditation that the Buddhist monks use seems like a\n\n1:30:58.880 --> 1:31:06.560\n great tool for becoming aware of your own mind. And that seems to be important for\n\n1:31:06.560 --> 1:31:14.320\n appreciating life. There's some kind of experiencing life on a deeper level.\n\n1:31:15.440 --> 1:31:21.600\n I think so. I mean, that's my personal opinion is yes. And that I think it,\n\n1:31:22.800 --> 1:31:24.080\n I don't meditate anymore.\n\n1:31:25.680 --> 1:31:29.520\n Back in the capitalist Western world where there's meetings.\n\n1:31:30.640 --> 1:31:34.720\n That's right. I mean, I stopped after I was a monk and then the tsunami hit\n\n1:31:34.720 --> 1:31:41.840\n and I lived in a refugee camp and that was the Indian Ocean tsunami in 2004. And it just really,\n\n1:31:44.640 --> 1:31:48.240\n it was really interesting in Sri Lanka. They wanted me, I asked, well, what can I do to help?\n\n1:31:49.600 --> 1:31:57.280\n It was a horrible, horrible hell on earth experience in many ways. But when I said,\n\n1:31:57.280 --> 1:32:04.160\n what can I do to help? The answer was, well, you could meditate. That's how, keep doing what you're\n\n1:32:04.160 --> 1:32:11.280\n doing. That's how we can get good karma. And to me, coming from Western roots, I just couldn't\n\n1:32:11.280 --> 1:32:16.400\n deal with that. I just said that it doesn't make sense to me. Why would I just sit and meditate\n\n1:32:16.400 --> 1:32:22.000\n when there's so much devastation happening here? And so I kind of stopped meditating then and then\n\n1:32:22.000 --> 1:32:29.200\n never really recovered from that time in the refugee camp. But I do feel like I understand\n\n1:32:29.200 --> 1:32:35.040\n or like I am aware of a part of me that most people never get the privilege to be aware of.\n\n1:32:35.040 --> 1:32:45.520\n And that is a pretty profound feeling, I think, or just awareness to say, if I ever need to go\n\n1:32:45.520 --> 1:32:51.440\n back to that, I have the capacity to do that. And I do use it. I mean, I don't use it a lot,\n\n1:32:51.440 --> 1:33:01.840\n but I use it when I really need to, to try to settle myself, to actually calm myself, whether\n\n1:33:01.840 --> 1:33:09.120\n it's pain, physical or emotional pain. It is possible to make those things go away, but just\n\n1:33:09.120 --> 1:33:18.080\n like anything, it takes training. If you take yourself back to that place you were, Sam Harris\n\n1:33:18.080 --> 1:33:24.320\n talks about that through his meditation practice, he's able to escape the sense of free will\n\n1:33:25.280 --> 1:33:33.200\n and the sense of agency. You can get away from that. Do you ever think about consciousness and\n\n1:33:33.200 --> 1:33:39.760\n free will when you were meditating? Like, did you get some deep insight about the nature\n\n1:33:40.640 --> 1:33:46.240\n of consciousness that you were somehow able to escape it through meditation or no?\n\n1:33:46.240 --> 1:33:50.960\n I looked at it in a much more utilitarian way, I think.\n\n1:33:52.400 --> 1:33:56.960\n The sensation, like minimizing amount of thoughts in your mind and then beginning to really\n\n1:33:56.960 --> 1:34:01.920\n appreciate the sensation. You weren't writing a book on free will.\n\n1:34:01.920 --> 1:34:08.160\n Right. I mean, maybe if I kept at it, there's a good chance that if the tsunami didn't happen,\n\n1:34:08.160 --> 1:34:10.960\n I might still be sitting there on the top of that mountain.\n\n1:34:10.960 --> 1:34:17.920\n If there's tsunamis, you see pain, you see, especially if you see cruelty and you're\n\n1:34:17.920 --> 1:34:24.320\n supposed to meditate through that, there's something in the human spirit that pushes us\n\n1:34:24.320 --> 1:34:30.000\n to want to help. If you see somebody who's suffering, to react to that seems like to help\n\n1:34:30.000 --> 1:34:36.960\n them as opposed to care less through meditation. Don't become attached to the suffering of others.\n\n1:34:36.960 --> 1:34:43.440\n Exactly. I mean, that's, I do think that that's, you know, and they're two totally valid ways to\n\n1:34:43.440 --> 1:34:50.320\n live life. They are, generally, I think they're ingrained in us pretty early in society.\n\n1:34:50.320 --> 1:34:52.000\n Right. And it's hard to escape.\n\n1:34:52.000 --> 1:34:52.640\n Yeah.\n\n1:34:52.640 --> 1:35:00.320\n What about just in general, becoming detached from possessions, like minimalism in not having\n\n1:35:00.320 --> 1:35:08.320\n many things. So, the capitalist world kind of pushes you towards having possessions and\n\n1:35:09.040 --> 1:35:15.760\n deriving joy from more and more and better possessions. Have you returned back to the\n\n1:35:15.760 --> 1:35:21.360\n joys of that world or do you find yourself enjoying the minimalist life?\n\n1:35:21.360 --> 1:35:30.320\n A little of both. I think I really don't like, I find things to be a burden, to be a massive\n\n1:35:30.320 --> 1:35:37.440\n burden. And to me, when you have a burden like that, you know, even if it's just knowing that\n\n1:35:37.440 --> 1:35:43.520\n there's like boxes in your basement of stuff, you know, whatever it might be, it makes it hard to\n\n1:35:43.520 --> 1:35:52.800\n focus. And so, I personally like, I mean, my ideal, like if I had a, my house, for example,\n\n1:35:52.800 --> 1:36:01.200\n would be to have like nothing on anything. And that to me is like peaceful. Some people find\n\n1:36:01.200 --> 1:36:10.800\n that to be not peaceful. For me, it's like, I love to have the idea that if needed, I could like\n\n1:36:10.800 --> 1:36:19.440\n pack up and move and not worry about anything. Do I actually have that in reality? No. We're\n\n1:36:19.440 --> 1:36:24.640\n about to have a baby, you know, but it's like, I already see it, it's like stressful. There's\n\n1:36:24.640 --> 1:36:30.720\n like boxes of stuff showing up at the house, like bottles and clothes and all these little\n\n1:36:30.720 --> 1:36:39.360\n hats and whatnot. And I do have to like sometimes go into my meditation to just say like, this is\n\n1:36:39.360 --> 1:36:49.040\n okay. You know, like it's okay to have all of this stuff. It's not permanent, you know. And, but I do\n\n1:36:49.040 --> 1:36:54.160\n think that it's easy to get lost in it all. And it's important to remember given all that, like\n\n1:36:54.160 --> 1:37:00.160\n people who buy houses, you know, buy a home and buy a house and make a home out of it. And you\n\n1:37:00.160 --> 1:37:05.840\n start a family. It's easy to forget that even though you have all these responsibilities,\n\n1:37:05.840 --> 1:37:12.640\n you're still free. And like freedom takes work and it takes remembering, it takes\n\n1:37:12.640 --> 1:37:18.880\n meditation on it, but you're free. You're born free, you live free. I mean, depends of course\n\n1:37:18.880 --> 1:37:24.080\n which country, but in the United States, even with all the possessions, even with all the burdens\n\n1:37:25.280 --> 1:37:33.600\n of sort of credit and owing money and all those kinds of things, you can scale everything down\n\n1:37:33.600 --> 1:37:40.160\n and you're free. But ultimately the people you love, you love each other, it doesn't take much\n\n1:37:40.160 --> 1:37:47.600\n money to be happy together. And for me, I personally value that freedom of having the freedom to\n\n1:37:47.600 --> 1:37:55.360\n always pursue your happiness as opposed to being burdened by material possessions that, you know,\n\n1:37:55.360 --> 1:37:59.840\n yeah, that basically limit your ability to be happy because you're always paying off stuff.\n\n1:37:59.840 --> 1:38:04.320\n You always catch, you know, trying to match the neighbors that are always a little bit richer,\n\n1:38:04.320 --> 1:38:09.520\n that kind of pursuit. I think that pursuit is wonderful for innovation and for building\n\n1:38:09.520 --> 1:38:15.200\n cooler, better things. But on an individual level, I think you have to remember that,\n\n1:38:15.200 --> 1:38:20.000\n first of all, life is finite. And second of all, like your goal is not to get a bigger house.\n\n1:38:20.000 --> 1:38:24.560\n Your goal is to be just content and happy in the moment.\n\n1:38:24.560 --> 1:38:31.280\n I completely, completely agree with that. So in looking at our failure at scale\n\n1:38:32.880 --> 1:38:42.080\n to engineer, to manufacture, to deploy tests, how do you feel about our prospect as a human\n\n1:38:42.080 --> 1:38:51.840\n civilization? Are you optimistic? So this pandemic, it is what it is. It hurt a lot of people,\n\n1:38:51.840 --> 1:38:58.560\n both it took lives, but it also hurt a lot of businesses and a lot of people economically.\n\n1:39:00.400 --> 1:39:05.600\n But there's very likely to be a much worse pandemic down the line. There might be other\n\n1:39:05.600 --> 1:39:09.760\n threats to human civilization. Are you nevertheless optimistic?\n\n1:39:10.800 --> 1:39:14.320\n Oh, I don't think I'm optimistic about it at all, I think.\n\n1:39:14.320 --> 1:39:15.440\n What are you most worried about?\n\n1:39:15.440 --> 1:39:23.520\n It's one of those things, it's so existential that I don't worry about it. But I do think,\n\n1:39:23.520 --> 1:39:27.840\n I mean, in the United States, for example, so you asked about the human civilization,\n\n1:39:27.840 --> 1:39:34.320\n but let's talk about like American society for a moment. I do think that we're probably seeing\n\n1:39:35.920 --> 1:39:39.680\n the end of a really interesting experiment, like the American experiment,\n\n1:39:39.680 --> 1:39:44.080\n and we're seeing its limitations. We're probably going to become another blip,\n\n1:39:44.080 --> 1:39:48.800\n like another power that's in the history books that like rose and collapsed.\n\n1:39:48.800 --> 1:39:55.600\n Probably that's where we'll go. In terms of civilization, I think we're demonstrating a\n\n1:39:55.600 --> 1:40:03.280\n pretty significant inability to recognize the danger, whether that's the pandemic or whether\n\n1:40:03.280 --> 1:40:12.800\n that's climate change. I think it's extraordinary that we are not taking these things seriously.\n\n1:40:12.800 --> 1:40:13.680\n Yeah.\n\n1:40:13.680 --> 1:40:18.480\n And we're not acting with the urgency. And I mean, in some ways, climate change\n\n1:40:20.240 --> 1:40:26.560\n truly makes like this pandemic look like child's play in terms of like the destruction it has the\n\n1:40:26.560 --> 1:40:31.680\n potential to wreak. I tend to think if you just look at the progress of human history,\n\n1:40:32.480 --> 1:40:41.840\n that the people who do good in the world outpower the people that do bad in the world.\n\n1:40:41.840 --> 1:40:49.120\n So there's something about our minds that likes to focus on the negative, like on the destructive,\n\n1:40:49.120 --> 1:40:54.880\n because we're afraid of it. It's also, for some reason, more fun to watch destruction.\n\n1:40:56.640 --> 1:41:06.160\n But it seems like the people who build, who create solutions, who innovate, and who just put\n\n1:41:06.160 --> 1:41:12.880\n like both on the emotional level, so love out there and like on the actual engineering level,\n\n1:41:12.880 --> 1:41:18.240\n tools that make for higher quality of life. I think those win out if you look at human history.\n\n1:41:19.120 --> 1:41:24.400\n But the question is whether the negative stuff can sometimes peak to the level where everybody's\n\n1:41:24.400 --> 1:41:30.640\n just destroyed. But as long as that doesn't happen, I tend to believe that there'll be like\n\n1:41:30.640 --> 1:41:36.480\n a gradual, with some noise, a gradual improvement of quality of life in human civilization.\n\n1:41:37.360 --> 1:41:42.880\n I do think so, to a certain extent. But it's that what you said, like unless there's like some\n\n1:41:43.440 --> 1:41:50.640\n significant peak of bad, you know, the problem with bad is that it can happen like that, you know,\n\n1:41:50.640 --> 1:41:58.000\n good. You can't build a society overnight, but you sure can kill one. Like I just think about\n\n1:41:58.000 --> 1:42:03.840\n food crises and instability and just, I don't know. But I do hope that, I mean, I completely agree. I\n\n1:42:03.840 --> 1:42:14.160\n think we can engineer our way to a healthier, better world. Like I truly do. My concern is that\n\n1:42:14.160 --> 1:42:21.040\n the people who are doing that until very recently don't generally rule the world. Now, of course,\n\n1:42:21.040 --> 1:42:29.520\n we're seeing non elected leaders and, you know, people who run massive corporations essentially\n\n1:42:31.040 --> 1:42:37.680\n having as much or really more power than elected leaders, or than kings and queens and such. So how\n\n1:42:37.680 --> 1:42:42.640\n they choose to wield that power, you know, is an interesting choice. And I do hope that you're\n\n1:42:42.640 --> 1:42:52.640\n right in that over time, fear will drive companies to produce a better product or whatever, you know,\n\n1:42:52.640 --> 1:42:59.120\n something like over time, it's just like predator prey models. You get so bad or so everything like\n\n1:42:59.120 --> 1:43:04.080\n it's so revved up that all of a sudden, something cracks and they say, okay, I do want an electric\n\n1:43:04.080 --> 1:43:10.800\n car or whatever. And that takes some combination of innovation, letting people know that you're\n\n1:43:10.800 --> 1:43:15.440\n an innovation, letting people know that these electric cars exist. It's kind of rapid test too.\n\n1:43:15.440 --> 1:43:20.960\n Like you get to finally feel it and see it, have an electric car. And then all of a sudden things\n\n1:43:20.960 --> 1:43:25.200\n change and everyone says, oh, this is so bad. And actually I'm doing good for the world, relatively\n\n1:43:25.200 --> 1:43:32.320\n speaking. And, you know, I guess the paradigm shift, it becomes a, for lack of a better word,\n\n1:43:32.320 --> 1:43:39.120\n viral positivity does. And I mean, I believe that ultimately that wins out\n\n1:43:39.120 --> 1:43:46.160\n out because I think there's much more power to be gained. So I think most people want to do good.\n\n1:43:46.160 --> 1:43:53.440\n And if you want to wield power, you want to channel people's desire to do good.\n\n1:43:54.160 --> 1:44:01.200\n And I think over time that's exactly what people will do. But yeah, this, I mean, both on the\n\n1:44:01.200 --> 1:44:05.520\n natural side, the pandemic, you know, there's still biology at play. There's still viruses\n\n1:44:05.520 --> 1:44:10.720\n out there trying to kill us. There's accidents. There's nuclear weapons. There's unintended\n\n1:44:10.720 --> 1:44:16.000\n consequences of tools, whether it's on the nanotechnology side or the artificial intelligence\n\n1:44:16.000 --> 1:44:22.560\n side. Then there's the natural things like meteors and all that kind of stuff and the climate change,\n\n1:44:23.920 --> 1:44:30.000\n all of that. But I tend to think we humans are a clever bunch. And when there's a deadline,\n\n1:44:30.000 --> 1:44:37.120\n a real deadline or a real threat before us, we kind of step up. I don't know, but maybe you have\n\n1:44:37.120 --> 1:44:43.600\n to believe that until the very end. Otherwise life's not as fun.\n\n1:44:43.600 --> 1:44:50.800\n Yeah, that's right. I mean, we'll have to see, I guess. Well, ideally we won't be alive to see that.\n\n1:44:50.800 --> 1:45:00.800\n Well, no, Michael, I'm glad we talk again because this has been such a difficult time\n\n1:45:00.800 --> 1:45:08.960\n that feels like there's no solutions. And it's so refreshing to hear that there's a solution\n\n1:45:08.960 --> 1:45:14.720\n to COVID. And there's an engineering solution on the individual level, something people can do.\n\n1:45:14.720 --> 1:45:19.920\n On the government level, it's something people can do. On the global level, something people can do.\n\n1:45:19.920 --> 1:45:26.400\n We should be doing rapid testing at scale. It's obvious. It's amazing that you still\n\n1:45:27.360 --> 1:45:34.000\n are telling that story, pushing that message bravely, boldly. I really,\n\n1:45:34.000 --> 1:45:41.680\n really appreciate the work you're doing. And I will do in my small way the same to try to help out\n\n1:45:41.680 --> 1:45:47.040\n and everybody else should too until we get hundreds of millions of tests in people's hands.\n\n1:45:47.040 --> 1:45:56.400\n It's an obvious solution. We should have had it a long time ago. And I like solutions, not problems.\n\n1:45:56.400 --> 1:46:00.880\n And this is obviously a solution. So thank you for presenting it to the world and thank you for\n\n1:46:00.880 --> 1:46:07.360\n talking about it. It's something that I can't not do. If it saves one person's life, then it was\n\n1:46:07.360 --> 1:46:15.360\n worth the two years of lobbying for this. And so let's hope we see a change. Thanks for talking today.\n\n1:46:15.360 --> 1:46:16.640\n Absolutely.\n\n1:46:17.680 --> 1:46:21.840\n Thanks for listening to this conversation with Michael Mina. To support this podcast,\n\n1:46:21.840 --> 1:46:27.280\n please check out our sponsors in the description. And now, let me leave you with some words from\n\n1:46:27.280 --> 1:46:35.840\n Lord Byron. Always laugh when you can. It is cheap medicine. Thank you for listening and hope to see\n\n1:46:35.840 --> 1:46:48.400\n you next time.\n\n"
}