{
  "title": "Robert Langer: Edison of Medicine | Lex Fridman Podcast #105",
  "id": "9LQffCdHHlQ",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:03.480\n The following is a conversation with Bob Langer, professor at\n\n00:03.480 --> 00:06.960\n MIT, and one of the most cited researchers in history,\n\n00:07.280 --> 00:11.120\n specializing in biotechnology fields of drug delivery systems\n\n00:11.120 --> 00:15.600\n and tissue engineering. He has bridged theory and practice by\n\n00:15.600 --> 00:19.200\n being a key member and driving force in launching many\n\n00:19.200 --> 00:23.480\n successful biotech companies out of MIT. This conversation was\n\n00:23.480 --> 00:27.400\n recorded before the outbreak of the coronavirus pandemic. His\n\n00:27.400 --> 00:30.040\n research and companies are at the forefront of developing\n\n00:30.040 --> 00:34.000\n treatment for COVID 19, including a promising vaccine\n\n00:34.000 --> 00:39.320\n candidate. Quick summary of the ads to sponsors cash app and\n\n00:39.320 --> 00:42.520\n masterclass. Please consider supporting the podcast by\n\n00:42.520 --> 00:47.080\n downloading cash app and using code Lex podcast and signing up\n\n00:47.080 --> 00:51.880\n a masterclass.com slash Lex, click on the links by the stuff.\n\n00:52.120 --> 00:55.320\n It really is the best way to support this podcast and in\n\n00:55.320 --> 00:59.960\n general, the journey I'm on in my research and startup. This is\n\n00:59.960 --> 01:02.600\n the artificial intelligence podcast. If you enjoy it,\n\n01:02.760 --> 01:05.560\n subscribe on YouTube, review it with five stars and Apple\n\n01:05.560 --> 01:09.400\n podcast supported on Patreon, or connect with me on Twitter at\n\n01:09.400 --> 01:13.800\n Lex Friedman. As usual, I'll do a few minutes of ads now and\n\n01:13.800 --> 01:16.000\n never any ads in the middle that can break the flow of the\n\n01:16.000 --> 01:20.880\n conversation. This show is presented by cash app, the\n\n01:20.880 --> 01:24.560\n number one finance app in the app store. When you get it, use\n\n01:24.560 --> 01:28.520\n code Lex podcast cash app lets you send money to friends by\n\n01:28.520 --> 01:32.040\n Bitcoin and invest in the stock market with as little as $1.\n\n01:32.480 --> 01:34.800\n Since cash app allows you to send and receive money\n\n01:34.800 --> 01:37.960\n digitally. Let me mention a surprising fact related to\n\n01:37.960 --> 01:41.440\n physical money. Of all the currency in the world, roughly\n\n01:41.480 --> 01:46.480\n 8% of it is actual physical money. The other 92% of money\n\n01:46.480 --> 01:50.480\n only exists digitally. So again, if you get cash app from\n\n01:50.480 --> 01:54.440\n the App Store, Google Play and use the code Lex podcast, you\n\n01:54.440 --> 01:58.760\n get $10. And cash app will also donate $10 to first an\n\n01:58.760 --> 02:01.400\n organization that is helping to advance robotics and STEM\n\n02:01.400 --> 02:05.600\n education for young people around the world. This show is\n\n02:05.600 --> 02:10.120\n sponsored by masterclass, sign up at masterclass.com slash Lex\n\n02:10.120 --> 02:14.000\n to get a discount and to support this podcast. When I first\n\n02:14.000 --> 02:16.440\n heard about masterclass, I thought it was too good to be\n\n02:16.440 --> 02:21.560\n true. For $180 a year you get an all access pass to watch\n\n02:21.560 --> 02:25.640\n courses from to list some of my favorites. Chris Hadfield on\n\n02:25.640 --> 02:28.720\n space exploration near the grass Tyson on scientific thinking\n\n02:28.720 --> 02:32.720\n and communication will write creator some city and Sims on\n\n02:32.720 --> 02:37.320\n game design. Carlos Santana on guitar. Europa is probably one\n\n02:37.320 --> 02:40.560\n of the most beautiful guitar instrumentals ever. Garak is\n\n02:40.560 --> 02:45.080\n part of on chess, Daniel Negrano on poker and many more. Chris\n\n02:45.080 --> 02:48.200\n Hadfield explaining how rockets work and experience of being\n\n02:48.200 --> 02:52.240\n launched into space alone is worth the money. You can watch\n\n02:52.240 --> 02:56.160\n it on basically any device. Once again, sign up a masterclass\n\n02:56.160 --> 03:01.160\n dot com slash Lex to get a discount and to support this\n\n03:01.160 --> 03:06.320\n podcast. And now here's my conversation with Bob Langer.\n\n03:07.600 --> 03:10.960\n You have a bit of a love for magic. Do you see a connection\n\n03:10.960 --> 03:12.640\n between magic and science?\n\n03:12.640 --> 03:17.920\n I do. I think magic can surprise you. And, uh, you know, and I\n\n03:17.920 --> 03:20.720\n think science can surprise you. And there's something magical\n\n03:20.720 --> 03:23.960\n about, about science. I mean, making discoveries and things\n\n03:23.960 --> 03:26.800\n like that. Yeah. So on the, and then on the magic side, is\n\n03:26.800 --> 03:30.160\n there some kind of engineering scientific process to the tricks\n\n03:30.160 --> 03:34.440\n themselves? Do you see, cause there's a duality to it. One is\n\n03:34.720 --> 03:39.280\n you're the, um, you're, you're sort of the person inside that\n\n03:39.280 --> 03:42.480\n knows how the whole thing works, how the universe of the magic\n\n03:42.480 --> 03:45.960\n trick works. And then from the outside observer, which is kind\n\n03:45.960 --> 03:49.560\n of the role of the scientists, you, the people that observe\n\n03:49.560 --> 03:52.920\n the magic trick don't know at least initially anything that's\n\n03:52.920 --> 03:55.200\n going on. Do you see that kind of duality?\n\n03:55.720 --> 03:58.560\n Well, I think the duality that I see is fascination. You know,\n\n03:58.560 --> 04:03.160\n I think of it, you know, when I watch magic myself, I'm always\n\n04:03.160 --> 04:06.280\n fascinated by it. Sometimes it's a puzzle to think how it's done,\n\n04:06.280 --> 04:09.280\n but just the sheer fact that something that you never thought\n\n04:09.280 --> 04:13.400\n could happen does happen. And I think about that in science too,\n\n04:13.440 --> 04:17.360\n you know, sometimes you, it's something that, that you might\n\n04:17.360 --> 04:21.320\n dream about and hoping to discover, maybe you do in some\n\n04:21.320 --> 04:22.000\n way or form.\n\n04:22.600 --> 04:26.200\n What is the most amazing magic trick you've ever seen?\n\n04:26.880 --> 04:29.480\n Well, there's one I like, which is called the invisible pack.\n\n04:30.000 --> 04:35.000\n And the way it works is you have this pack and you hold it up.\n\n04:35.000 --> 04:40.200\n Well, first you say to somebody, this is invisible and this deck\n\n04:40.200 --> 04:43.560\n and you say, well, shuffle it. They shuffle it, but you know,\n\n04:43.560 --> 04:46.640\n they're sort of make believe. And then you say, okay, I'd like\n\n04:46.640 --> 04:50.440\n you to pick a card, any card and show it to me. And you show it\n\n04:50.440 --> 04:55.120\n to me and I look at it. And let's say it's the three of\n\n04:55.120 --> 04:57.720\n hearts. I said, we'll put it back in the deck. But what I'd\n\n04:57.720 --> 05:00.320\n like you to do is turn it up upside down from every other\n\n05:00.320 --> 05:04.880\n card in the deck. So they do that imaginary. And I say,\n\n05:04.880 --> 05:07.520\n do you want to shuffle it again? And they shuffle it. And I said,\n\n05:07.520 --> 05:10.920\n well, so there's still one card upside down from every other\n\n05:10.920 --> 05:12.840\n card in the deck. I said, what is that? And they said, well,\n\n05:12.840 --> 05:15.960\n three hearts. So what just so happens in my back pocket, I\n\n05:15.960 --> 05:18.880\n have this deck, it's, you know, it's a real deck. I show it to\n\n05:18.880 --> 05:22.080\n you and I just open it up. And there's just one card upside\n\n05:22.080 --> 05:23.920\n down. And it's the three of hearts.\n\n05:27.000 --> 05:30.120\n And, and you can do this trick.\n\n05:30.480 --> 05:33.120\n I can, if I don't, I would have probably brought it.\n\n05:33.120 --> 05:37.320\n All right. Well, beautiful. Let's get into the, into the\n\n05:37.320 --> 05:43.360\n science. As of today, you have over 295,000 citations. An H\n\n05:43.360 --> 05:47.760\n index of 269. You're one of the most cited people in history and\n\n05:47.760 --> 05:52.440\n the most cited engineer in history. And yet nothing great,\n\n05:53.000 --> 05:57.120\n I think is ever achieved without failure. So the interesting\n\n05:57.120 --> 06:01.320\n part, what rejected papers, ideas, efforts in your life or\n\n06:01.320 --> 06:03.880\n most painful, or had the biggest impact on your life?\n\n06:04.440 --> 06:07.200\n Well, it's interesting. I mean, I've had plenty of rejection too,\n\n06:07.200 --> 06:11.640\n you know, but I suppose one way I think about this is that when\n\n06:11.640 --> 06:14.360\n I first started, and this certainly had an impact both\n\n06:14.360 --> 06:19.200\n ways, you know, I first started, we made two big discoveries and\n\n06:19.200 --> 06:22.720\n they were kind of interrelated. I mean, one was, I was trying to\n\n06:22.720 --> 06:25.520\n isolate with my postdoctoral advisor, Judah Folkman,\n\n06:25.840 --> 06:29.560\n substances that could stop blood vessels from growing and nobody\n\n06:29.560 --> 06:35.320\n had done that before. And so that was part A, let's say part B\n\n06:35.320 --> 06:38.320\n is we had to develop a way to study that. And what was\n\n06:38.320 --> 06:42.280\n critical to study that was to have a way to slowly release\n\n06:42.520 --> 06:47.080\n those substances for, you know, more than a day, you know, maybe\n\n06:47.080 --> 06:50.480\n months. And that had never been done before either. So we\n\n06:50.480 --> 06:55.440\n published the first one we sent to Nature, the journal, and they\n\n06:55.440 --> 06:59.920\n rejected it. And then we sent it, we revised it, we sent it to\n\n06:59.920 --> 07:04.440\n Science and they accepted it. And the other, the opposite\n\n07:04.440 --> 07:06.960\n happened, we sent it to Science and they rejected it. And then\n\n07:06.960 --> 07:10.440\n we sent it to Nature and they accepted it. But I have to tell\n\n07:10.440 --> 07:12.800\n you, when we got the rejections, it was really upsetting. I\n\n07:12.800 --> 07:15.760\n thought, you know, I'd done some really good work. And Dr.\n\n07:15.760 --> 07:19.920\n Folkman thought we'd done some really good work. And, and, but\n\n07:19.920 --> 07:24.040\n it was very depressing to, you know, get rejected like that.\n\n07:24.040 --> 07:27.360\n If you can linger on just the feeling or the thought process\n\n07:27.400 --> 07:30.160\n when you get the rejection, especially early on in your\n\n07:30.160 --> 07:39.400\n career, what, I mean, you don't know, now people know you as a\n\n07:39.400 --> 07:42.800\n brilliant scientist, but at the time, I'm sure you're full of\n\n07:42.800 --> 07:48.360\n self doubt. And did you believe that maybe this idea is actually\n\n07:48.360 --> 07:51.760\n quite terrible, that it could have been done much better? Or\n\n07:51.760 --> 07:54.280\n is there underlying confidence? What was the feelings?\n\n07:54.760 --> 07:58.640\n Well, you feel depressed and I felt the same way when I got\n\n07:58.640 --> 08:02.440\n grants rejected, which I did a lot in the beginning. I guess\n\n08:02.440 --> 08:07.120\n part of me, you know, you have multiple emotions. One is being\n\n08:07.120 --> 08:11.200\n sad and being upset and also being maybe a little bit angry\n\n08:11.200 --> 08:14.600\n because you didn't feel the reviewers didn't get it. But\n\n08:14.600 --> 08:17.280\n then as I thought about it more, I thought, well, maybe I just\n\n08:17.280 --> 08:20.680\n didn't explain it well enough. And you know, that, you know,\n\n08:20.680 --> 08:24.040\n that you go through stages. And so you say, well, okay, I'll\n\n08:24.040 --> 08:26.920\n explain it better next time. And certainly you get reviews and\n\n08:26.920 --> 08:29.920\n when you get the reviews, you see what they either didn't like\n\n08:29.920 --> 08:32.560\n or didn't understand. And then you try to incorporate that into\n\n08:32.560 --> 08:33.520\n your next versions.\n\n08:34.520 --> 08:37.840\n You've given advice to students to do something big, do\n\n08:37.840 --> 08:40.400\n something that really can change the world rather than something\n\n08:40.400 --> 08:45.160\n incremental. How did you yourself seek out such ideas? Is\n\n08:45.160 --> 08:49.720\n there a process? Is there a sort of a rigorous process? Or is it\n\n08:49.720 --> 08:50.880\n more spontaneous?\n\n08:51.320 --> 08:55.520\n It's more spontaneous. I mean, part of its exposure to things,\n\n08:55.600 --> 08:58.960\n part of its seeing other people, like I mentioned, Dr. Folkman,\n\n08:58.960 --> 09:02.000\n he was my postdoctoral advisor, he was very good at that, you\n\n09:02.000 --> 09:05.200\n could sort of see that he had big ideas. And I certainly met a\n\n09:05.200 --> 09:08.720\n lot of people who didn't. And I think you could spot an idea\n\n09:08.720 --> 09:11.400\n that might have potential when you see it, you know, because it\n\n09:11.400 --> 09:14.120\n could have very broad implications, whereas a lot of\n\n09:14.120 --> 09:19.480\n people might just keep doing derivative stuff. And so I\n\n09:19.480 --> 09:23.560\n don't know. But it's not something that I've ever done.\n\n09:24.680 --> 09:26.160\n Systematically, I don't think.\n\n09:26.680 --> 09:30.960\n So in the space of ideas, how many are just when you see them?\n\n09:31.200 --> 09:34.320\n It's just magic. It's something that you see that could be\n\n09:34.320 --> 09:37.880\n impactful if you dig deeper.\n\n09:38.680 --> 09:42.080\n Yeah, it's sort of hard to say because there's multiple levels\n\n09:42.080 --> 09:49.040\n of ideas. One type of thing is like a new, you know, creation\n\n09:49.040 --> 09:51.480\n that you could engineer tissues for the first time or make\n\n09:51.480 --> 09:54.640\n dishes from scratch on the first time. But another thing is\n\n09:54.640 --> 09:58.480\n really just deeply understanding something. And that's important\n\n09:58.480 --> 10:04.240\n too. So and that may lead to other things. So sometimes you\n\n10:04.280 --> 10:07.440\n could think of a new technology, or I thought of a new\n\n10:07.440 --> 10:11.600\n technology. But other times, things came from just the\n\n10:11.600 --> 10:15.840\n process of trying to discover things. So it's never and you\n\n10:15.840 --> 10:19.760\n don't necessarily know, like people talk about aha moments,\n\n10:19.760 --> 10:23.320\n but I don't know if I've, I mean, I certainly feel like I've\n\n10:23.320 --> 10:27.840\n had some ideas that I really like. But it's taken me a long\n\n10:27.840 --> 10:32.720\n time to go from the thought process of starting it to all of\n\n10:32.720 --> 10:35.120\n a sudden, knowing that it might work.\n\n10:35.520 --> 10:39.200\n So if you take drug delivery, for example, is the notion is\n\n10:39.200 --> 10:43.760\n the initial notion, kind of a very general one, that we should\n\n10:43.760 --> 10:48.400\n be able to do something like this. And then you start to ask\n\n10:48.400 --> 10:51.120\n the questions of Well, how would you do it and then and then\n\n10:51.120 --> 10:52.400\n digging and digging and digging?\n\n10:52.680 --> 10:54.840\n I think that's right. I think it depends. I mean, there are\n\n10:54.840 --> 10:58.280\n many different examples. The example I gave about delivering\n\n10:58.520 --> 11:01.880\n large molecules, which we used to study these blood vessel\n\n11:01.880 --> 11:05.280\n inhibitors. I mean, there, we had to invent something that\n\n11:05.280 --> 11:10.200\n would do that. But other times, it's, it's, it's different.\n\n11:10.200 --> 11:13.000\n Sometimes it's really understanding what goes on in\n\n11:13.000 --> 11:16.520\n terms of understanding the mechanisms. And so it's, it's,\n\n11:16.560 --> 11:19.120\n it's not a single thing. And there are many different parts\n\n11:19.120 --> 11:23.240\n to it, you know, over the years, we've invented different or\n\n11:23.240 --> 11:27.680\n discovered different principles for aerosols for delivering,\n\n11:27.720 --> 11:30.200\n you know, genetic therapy agents, you know, all kinds of\n\n11:30.200 --> 11:30.680\n things.\n\n11:31.600 --> 11:34.120\n So let's explore some of the key ideas you've touched on in your\n\n11:34.120 --> 11:39.200\n life. Let's start with the basics. Okay. So first, let me\n\n11:39.200 --> 11:42.640\n ask, how complicated is the biology and chemistry of the\n\n11:42.640 --> 11:46.600\n human body from the perspective of trying to affect some parts\n\n11:46.600 --> 11:50.560\n of it in a positive way? So that you know, for me, especially\n\n11:50.560 --> 11:54.280\n coming from the field of computer science and computer\n\n11:54.280 --> 11:57.720\n engineering and robotics, it seems that the human body is\n\n11:57.720 --> 12:00.440\n exceptionally complicated, and how the heck you can figure out\n\n12:00.440 --> 12:01.680\n anything is amazing.\n\n12:02.120 --> 12:05.080\n I agree with you. I think it's super complicated. I mean,\n\n12:05.080 --> 12:08.320\n we're still just scratching the surface in many ways. But I feel\n\n12:08.320 --> 12:12.280\n like we have made progress in different ways. And some of its\n\n12:12.280 --> 12:16.200\n by really understanding things like we were just talking about\n\n12:16.440 --> 12:19.600\n other times, you know, you might, or somebody might we or\n\n12:19.600 --> 12:23.480\n others might invent technologies that might be helpful on\n\n12:23.520 --> 12:26.920\n exploring that. And I think over many years, we've understood\n\n12:26.920 --> 12:29.200\n things better and better, but we still have such a long ways to\n\n12:29.200 --> 12:29.520\n go.\n\n12:29.640 --> 12:34.000\n Are there? I mean, if you just look at the other things that\n\n12:35.480 --> 12:39.280\n are there knobs that are reliably controllable about the\n\n12:39.280 --> 12:46.040\n human body, if you consider is there is it? So if you start to\n\n12:46.040 --> 12:49.840\n think about controlling various aspects of when we talk about\n\n12:49.880 --> 12:54.240\n drug delivery a little bit, but controlling various aspects\n\n12:54.240 --> 12:57.800\n chemically of the human body, is there a solid understanding\n\n12:57.800 --> 13:02.000\n across the populations of humans that are solid, reliable knobs\n\n13:02.040 --> 13:02.920\n that can be controlled?\n\n13:03.320 --> 13:06.680\n I think that's hard to do. But on the other hand, whenever we\n\n13:06.680 --> 13:09.520\n make a new drug or medical device, to a certain extent,\n\n13:09.520 --> 13:12.840\n we're doing that, you know, in a small way, what you just said,\n\n13:12.840 --> 13:16.880\n but I don't know that there are great knobs. I mean, and we're\n\n13:16.880 --> 13:20.160\n learning about those knobs all the time. But if there's a\n\n13:20.160 --> 13:23.880\n biological pathway or something that you can affect, or\n\n13:23.880 --> 13:26.960\n understand, I mean, then that might be such a knob.\n\n13:27.640 --> 13:31.640\n So what is a pharmaceutical drug? How do you do? How do you\n\n13:31.640 --> 13:34.720\n discover a specific one? How do you test it? How do you\n\n13:34.720 --> 13:36.640\n understand it? How do you ship it?\n\n13:36.840 --> 13:40.680\n Yeah, well, I'll give an example, which goes back to\n\n13:40.680 --> 13:43.840\n what I said before. So when I was doing my postdoctoral work\n\n13:43.840 --> 13:46.560\n with Judah Folkman, we wanted to come up with drugs that would\n\n13:46.560 --> 13:49.760\n stop blood vessels from growing or alternatively make them grow.\n\n13:50.280 --> 13:54.160\n And actually, people didn't even believe that, that those things\n\n13:54.160 --> 13:55.920\n could happen. But\n\n13:56.040 --> 13:58.560\n could we pause on that for a second? Sure. What is a blood\n\n13:58.560 --> 14:01.920\n vessel? What does it mean for a blood vessel to grow and shrink?\n\n14:01.920 --> 14:03.040\n And why is that important?\n\n14:03.040 --> 14:08.360\n Sure. So a blood vessel is could be an artery or vein or a\n\n14:08.360 --> 14:14.600\n capillary. And it, you know, provides oxygen, it provides\n\n14:14.600 --> 14:19.960\n nutrients gets rid of waste. So, you know, to different parts of\n\n14:19.960 --> 14:23.600\n your body if you so so the blood vessels end up being very, very\n\n14:23.600 --> 14:29.920\n important. And, you know, if you have cancer, blood vessels grow\n\n14:29.920 --> 14:32.680\n into the tumor. And that's part of what enables the tumor to get\n\n14:32.680 --> 14:36.440\n bigger. And that's also part of what enables the tumor to\n\n14:36.440 --> 14:39.600\n metastasize and which means spread throughout the body and\n\n14:39.880 --> 14:42.760\n ultimately kill somebody. So that was part of what we were\n\n14:42.760 --> 14:45.520\n trying to do. We tried what we wanted to see if we could find\n\n14:45.680 --> 14:49.280\n substances that could stop that from happening. So first, I\n\n14:49.280 --> 14:51.680\n mean, there are many steps. First, we had to develop a bio\n\n14:51.680 --> 14:54.280\n assay to study blood vessel growth. Again, there wasn't\n\n14:54.280 --> 14:57.960\n one. That's where we needed the polymer systems because the\n\n14:57.960 --> 15:03.360\n blood vessels grew slowly took months. That so after we had the\n\n15:03.360 --> 15:07.440\n polymer system and we had the bio assay, then I isolated many\n\n15:07.440 --> 15:12.920\n different molecules initially from cartilage. And almost all\n\n15:12.920 --> 15:17.080\n of them didn't work. But we were fortunate we found one it wasn't\n\n15:17.080 --> 15:21.400\n purified, but we found one that did work. And that paper that\n\n15:21.400 --> 15:24.960\n was this paper I mentioned science in 1976. Those were\n\n15:24.960 --> 15:27.920\n really the isolation of some of the very first angiogenesis and\n\n15:27.920 --> 15:29.000\n blood vessel inhibitors.\n\n15:29.560 --> 15:34.000\n So there's a lot of words there. Yeah, let's go. First of all,\n\n15:34.040 --> 15:38.680\n polymer molecules, big, big molecules. So the what are\n\n15:38.680 --> 15:45.000\n polymers? What's bio assay? What is the process of trying to\n\n15:45.000 --> 15:46.920\n isolate this whole thing simplified to where you can\n\n15:46.920 --> 15:48.360\n control and experiment with it?\n\n15:48.480 --> 15:54.960\n Polymers are like plastics or like plastics or rubber. What\n\n15:54.960 --> 15:55.960\n were some of the other questions?\n\n15:55.960 --> 15:59.000\n Sorry, so a polymer, some plastics and rubber, and that\n\n15:59.000 --> 16:01.280\n means something that has structure and that could be\n\n16:01.280 --> 16:02.840\n useful for what?\n\n16:03.080 --> 16:05.680\n Well, in this case, it would be something that could be useful\n\n16:05.680 --> 16:10.680\n for delivering a molecule for a long time. So it could slowly\n\n16:10.680 --> 16:13.840\n diffuse out of that at a controlled rate to where you\n\n16:13.840 --> 16:14.800\n wanted it to go.\n\n16:15.080 --> 16:17.720\n So then you would find the idea is that there would be a\n\n16:17.720 --> 16:22.760\n particular blood vessels that you can target, say they're\n\n16:22.760 --> 16:26.600\n connected somehow to a tumor that you could target and over\n\n16:27.200 --> 16:31.680\n a long period of time to be able to place the polymer there\n\n16:31.680 --> 16:34.600\n and it'd be delivering a certain kind of chemical.\n\n16:34.680 --> 16:37.920\n That's correct. I think what you said is good. So so that it\n\n16:37.920 --> 16:41.520\n would deliver the molecule or the chemical that would stop\n\n16:41.520 --> 16:44.120\n the blood vessels from going over a long enough time so that\n\n16:44.120 --> 16:47.920\n it really could happen. So that was sort of the what we call\n\n16:47.920 --> 16:50.240\n the bio assay is the way that we would study that.\n\n16:50.240 --> 16:53.840\n So, sorry, so what is a bio assay? Which part is the bio\n\n16:53.840 --> 16:54.320\n assay?\n\n16:54.360 --> 16:58.840\n All of it. In other words, the bio assay is the way you study\n\n17:00.080 --> 17:01.000\n blood vessel growth.\n\n17:01.680 --> 17:05.000\n The blood vessel growth and you can control that somehow with\n\n17:05.720 --> 17:08.080\n is there an understanding what kind of chemicals could control\n\n17:08.080 --> 17:09.040\n the growth of a blood vessel?\n\n17:09.040 --> 17:11.560\n Sure. Well, now there is, but then when I started, there\n\n17:11.560 --> 17:14.600\n wasn't and that that gets to your original question. So you\n\n17:14.600 --> 17:17.400\n go through various steps. We did the first steps. We showed\n\n17:17.400 --> 17:20.240\n that a such molecules existed and then we developed\n\n17:20.240 --> 17:24.920\n techniques for studying them. And we even isolated fractions,\n\n17:24.920 --> 17:28.880\n you know, groups of substances that would do it. But what\n\n17:28.880 --> 17:33.360\n would happen over the next, we did that in 1976, we published\n\n17:33.360 --> 17:37.160\n that what would happen over the next 28 years is other people\n\n17:37.160 --> 17:39.640\n would follow in our footsteps. I mean, we tried to do some\n\n17:39.640 --> 17:43.760\n stuff too, but ultimately to make a new drug takes billions\n\n17:43.760 --> 17:47.920\n of dollars. So what happened was there were different growth\n\n17:47.920 --> 17:50.760\n factors that people would isolate, sometimes using the\n\n17:50.760 --> 17:55.760\n techniques that we developed. And then they would figure out\n\n17:55.760 --> 17:58.720\n using some of those techniques, ways to stop those growth\n\n17:58.720 --> 18:02.400\n factors and ways to stop the blood vessels from growing. That\n\n18:02.400 --> 18:05.040\n like I say, it took 28 years, it took billions of dollars and\n\n18:05.040 --> 18:11.160\n work by many companies like Genetec. But in 2004, 28 years\n\n18:11.160 --> 18:15.720\n after we started, the first one of those Avastin got approved\n\n18:15.720 --> 18:20.920\n by the FDA. And that's become, you know, one of the top\n\n18:20.920 --> 18:23.920\n biotech selling drugs in history. And it's been approved\n\n18:23.920 --> 18:27.200\n for all kinds of cancers and actually for many eye diseases\n\n18:27.200 --> 18:30.640\n too, where you have abnormal blood vessel growth, macular.\n\n18:30.640 --> 18:38.480\n So in general, one of the key ways you can alleviate, what's\n\n18:38.480 --> 18:41.960\n the hope in terms of tumors associated with cancerous\n\n18:41.960 --> 18:46.640\n tumors? What can you help by being able to control the\n\n18:46.640 --> 18:47.840\n growth of vessels?\n\n18:47.840 --> 18:52.680\n So if you cut off the blood supply, you cut off the, it's\n\n18:52.680 --> 18:56.600\n kind of like a war almost, right? If the nutrition is going\n\n18:56.600 --> 19:01.480\n to the tumor and you can cut it off, I mean, you starve the\n\n19:01.480 --> 19:05.240\n tumor and it becomes very small, it may disappear or it's going\n\n19:05.240 --> 19:08.120\n to be much more amenable to other therapies because it is\n\n19:08.120 --> 19:12.200\n tiny, you know, like, you know, chemotherapy or immunotherapy\n\n19:12.200 --> 19:15.000\n is going to be, have a much easier time against a small\n\n19:15.000 --> 19:16.000\n tumor than a big one.\n\n19:16.000 --> 19:20.880\n Is that an obvious idea? I mean, it seems like a very clever\n\n19:20.880 --> 19:23.880\n strategy in this war against cancer.\n\n19:23.880 --> 19:27.480\n Well, you know, in retrospect, it's an obvious idea, but when\n\n19:27.480 --> 19:31.880\n Dr. Folkman, my boss first proposed it, it wasn't, a lot of\n\n19:31.880 --> 19:33.600\n people didn't thought he was pretty crazy.\n\n19:33.600 --> 19:39.360\n And so in what sense, if you can sort of linger on it, when\n\n19:39.360 --> 19:42.280\n you're thinking about these ideas at the time, were you\n\n19:42.280 --> 19:43.560\n feeling you're out in the dark?\n\n19:43.560 --> 19:46.760\n So how much mystery is there about the whole thing?\n\n19:46.760 --> 19:50.520\n How much just blind experimentation, if you can put\n\n19:50.520 --> 19:52.400\n yourself in that mindset from years ago?\n\n19:52.400 --> 19:52.840\n Yeah.\n\n19:52.840 --> 19:56.480\n Well, there was, I mean, for me, actually, it wasn't just\n\n19:56.480 --> 19:56.960\n the idea.\n\n19:56.960 --> 19:59.520\n It was that I didn't know a lot of biology or biochemistry.\n\n19:59.520 --> 20:03.440\n So I certainly felt I was in the dark, but I kept trying and\n\n20:03.440 --> 20:06.040\n I kept trying to learn and I kept plugging.\n\n20:06.040 --> 20:08.520\n But I mean, a lot of it was being in the dark.\n\n20:08.520 --> 20:11.320\n So the human body is complicated, right?\n\n20:11.320 --> 20:12.280\n We'll establish this.\n\n20:12.280 --> 20:16.680\n Quantum mechanics in physics is a theory that works incredibly\n\n20:16.680 --> 20:19.720\n well, but we don't really necessarily understand the underlying\n\n20:19.720 --> 20:20.360\n nature of it.\n\n20:20.360 --> 20:25.280\n So are drugs the same in that you're ultimately trying to\n\n20:25.280 --> 20:29.880\n show that the thing works to do something that you try to do,\n\n20:29.880 --> 20:33.520\n but you don't necessarily understand the fundamental\n\n20:33.520 --> 20:35.360\n mechanisms by which it's doing it?\n\n20:35.360 --> 20:36.760\n It really varies.\n\n20:36.760 --> 20:40.200\n I think sometimes people do know them because they've figured\n\n20:40.200 --> 20:42.640\n out pathways and ways to interfere with them.\n\n20:42.640 --> 20:45.160\n Other times it is shooting in the dark.\n\n20:45.160 --> 20:46.640\n It really has varied.\n\n20:46.640 --> 20:47.160\n Okay.\n\n20:47.160 --> 20:49.960\n And sometimes people make serendipitous discoveries and\n\n20:49.960 --> 20:51.840\n they don't even realize what they did.\n\n20:51.840 --> 20:55.960\n So what is the discovery process for a drug?\n\n20:55.960 --> 20:59.120\n You said a bunch of people trying to work with this.\n\n20:59.120 --> 21:08.360\n Is it a kind of a mix of serendipitous discovery and art,\n\n21:08.360 --> 21:12.840\n or is there a systematic science to trying different chemical\n\n21:12.840 --> 21:16.960\n reactions and how they affect whatever you're trying to do,\n\n21:16.960 --> 21:18.840\n like shrink blood vessels?\n\n21:18.840 --> 21:22.480\n Yeah, I don't think there's a single way to go about\n\n21:22.480 --> 21:25.320\n something in terms of characterizing the entire drug\n\n21:25.320 --> 21:26.440\n discovery process.\n\n21:26.440 --> 21:28.600\n If I look at the blood vessel one,\n\n21:28.600 --> 21:34.400\n yeah, there the first step was to have the kinds of theories\n\n21:34.400 --> 21:35.400\n that Dr. Folkman had.\n\n21:35.400 --> 21:38.120\n The second step was to have the techniques where you could\n\n21:38.120 --> 21:40.880\n study blood vessel growth for the first time and at least\n\n21:40.880 --> 21:44.200\n quantitate or semi quantitate it.\n\n21:44.200 --> 21:48.120\n Third step was to find substances that would stop blood\n\n21:48.120 --> 21:49.680\n vessels from growing.\n\n21:49.680 --> 21:54.440\n Fourth step was to maybe purify those substances.\n\n21:54.440 --> 21:55.760\n There are many other steps too.\n\n21:55.760 --> 21:57.680\n I mean, before you have an effective drug,\n\n21:57.680 --> 21:58.800\n you have to show that it's safe.\n\n21:58.800 --> 22:00.600\n You have to show that it's effective.\n\n22:00.600 --> 22:01.880\n And you start with animals.\n\n22:01.880 --> 22:03.600\n You ultimately go to patients.\n\n22:03.600 --> 22:06.400\n And there are multiple kinds of clinical trials you have to do.\n\n22:06.400 --> 22:08.720\n If you step back, is it amazing to you\n\n22:08.720 --> 22:11.680\n that we descendants of great apes\n\n22:11.680 --> 22:18.040\n are able to create drugs, chemicals that\n\n22:18.040 --> 22:22.160\n are able to improve some aspects of our bodies?\n\n22:22.160 --> 22:25.240\n Or is it quite natural that we're\n\n22:25.240 --> 22:27.760\n able to discover these kinds of things?\n\n22:27.760 --> 22:29.800\n Well, at a high level, it is amazing.\n\n22:29.800 --> 22:31.600\n I mean, evolution is amazing.\n\n22:31.600 --> 22:33.960\n The way I look at your question, the fact\n\n22:33.960 --> 22:36.320\n that we have evolved the way we've done,\n\n22:36.320 --> 22:38.600\n I mean, it's pretty remarkable.\n\n22:38.600 --> 22:41.200\n So let's talk about drug delivery.\n\n22:41.200 --> 22:43.640\n What are the difficult problems in drug delivery?\n\n22:43.640 --> 22:48.240\n What is drug delivery from starting\n\n22:48.240 --> 22:51.160\n from your early seminal work in the field to today?\n\n22:51.160 --> 22:55.840\n Well, drug delivery is getting a drug\n\n22:55.840 --> 22:57.960\n to go where you want it, at the level you want it,\n\n22:57.960 --> 22:59.720\n in a safe way.\n\n22:59.720 --> 23:02.040\n Some of the big challenges, I mean, there are a lot.\n\n23:02.040 --> 23:06.520\n I mean, I'd say one is, could you target the right cell?\n\n23:06.520 --> 23:08.240\n Like, we talked about cancers or some way\n\n23:08.240 --> 23:11.880\n to deliver a drug just to a cancer cell and no other cell.\n\n23:11.880 --> 23:14.640\n Another challenge is to get drugs\n\n23:14.640 --> 23:15.840\n across different barriers.\n\n23:15.840 --> 23:17.640\n Like, could you ever give insulin orally?\n\n23:17.640 --> 23:21.320\n Could you, or give it passively transdermally?\n\n23:21.320 --> 23:24.000\n Can you get drugs across the blood brain barrier?\n\n23:24.000 --> 23:26.240\n I mean, there are lots of big challenges.\n\n23:26.240 --> 23:29.040\n Can you make smart drug delivery systems\n\n23:29.040 --> 23:32.400\n that might respond to physiologic signals in the body?\n\n23:32.400 --> 23:33.240\n Oh, interesting.\n\n23:33.240 --> 23:37.040\n So smart, they have some kind of sense,\n\n23:37.040 --> 23:39.280\n a chemical sensor, or is there something more\n\n23:39.280 --> 23:41.280\n than a chemical sensor that's able to respond\n\n23:41.280 --> 23:43.120\n to something in the body?\n\n23:43.120 --> 23:44.040\n Could be either one.\n\n23:44.040 --> 23:48.600\n I mean, one example might be if you were diabetic,\n\n23:48.600 --> 23:53.320\n if you got more glucose, could you get more insulin?\n\n23:53.320 --> 23:57.040\n But that's just an example.\n\n23:57.040 --> 23:59.480\n Is there some way to control the actual mechanism\n\n23:59.480 --> 24:02.240\n of delivery in response to what the body's doing?\n\n24:02.240 --> 24:03.200\n Yes, there is.\n\n24:03.200 --> 24:05.000\n I mean, one of the things that we've done\n\n24:05.000 --> 24:07.520\n is encapsulate what are called beta cells.\n\n24:07.520 --> 24:09.840\n Those are insulin producing cells in a way\n\n24:09.840 --> 24:11.800\n that they're safe and protected.\n\n24:11.800 --> 24:15.280\n And then what'll happen is glucose will go in\n\n24:15.280 --> 24:20.280\n and the cells will make insulin.\n\n24:20.360 --> 24:22.120\n And so that's an example.\n\n24:23.000 --> 24:25.880\n So from an AI robotics perspective,\n\n24:25.880 --> 24:29.280\n how close are these drug delivery systems\n\n24:29.280 --> 24:31.040\n to something like a robot?\n\n24:31.040 --> 24:33.640\n Or is it totally wrong to think about them\n\n24:33.640 --> 24:35.480\n as intelligent agents?\n\n24:35.480 --> 24:39.600\n And how much room is there to add that kind of intelligence\n\n24:39.600 --> 24:42.080\n into these delivery systems, perhaps in the future?\n\n24:42.080 --> 24:45.280\n Yeah, I think it depends on the particular delivery system.\n\n24:45.280 --> 24:47.040\n Of course, one of the things people are concerned about\n\n24:47.040 --> 24:49.560\n is cost, and if you add a lot of bells and whistles\n\n24:49.560 --> 24:51.400\n to something, it'll cost more.\n\n24:51.400 --> 24:54.200\n But I mean, we, for example, have made\n\n24:54.200 --> 24:55.920\n what I'll call intelligent microchips\n\n24:55.920 --> 24:58.840\n that can, where you can send a signal\n\n24:58.840 --> 25:01.840\n and you'll release drug in response to that signal.\n\n25:01.840 --> 25:04.600\n And I think systems like that microchip someday\n\n25:04.600 --> 25:06.040\n have the potential to do what you and I\n\n25:06.040 --> 25:07.400\n were just talking about,\n\n25:07.400 --> 25:09.480\n that there could be a signal like glucose\n\n25:09.480 --> 25:11.600\n and it could have some instruction to say\n\n25:11.600 --> 25:14.360\n when there's more glucose, deliver more insulin.\n\n25:14.360 --> 25:16.000\n So do you think it's possible that there,\n\n25:16.000 --> 25:19.640\n that could be robotic type systems roaming our body\n\n25:19.640 --> 25:21.640\n sort of long term and be able to deliver\n\n25:21.640 --> 25:23.600\n certain kinds of drugs in the future?\n\n25:23.600 --> 25:26.320\n You see, do you see that kind of future?\n\n25:26.320 --> 25:29.000\n Someday, I don't think we're very close to it yet,\n\n25:29.000 --> 25:31.880\n but someday, you know that that's nanotechnology\n\n25:31.880 --> 25:33.720\n and that would mean even miniaturizing\n\n25:33.720 --> 25:35.760\n some of the things that I just discussed.\n\n25:35.760 --> 25:37.800\n And we're certainly not at that point yet,\n\n25:37.800 --> 25:40.120\n but someday I expect we will be.\n\n25:40.120 --> 25:44.240\n So some of it is just the shrinking of the technology.\n\n25:44.240 --> 25:47.280\n That's a part of it, that's one of the things.\n\n25:47.280 --> 25:52.200\n In general, what role do you see AI sort of,\n\n25:52.200 --> 25:55.160\n there's a lot of work now with using data\n\n25:55.160 --> 25:57.200\n to make intelligent, create systems\n\n25:57.200 --> 25:59.080\n that make intelligent decisions.\n\n25:59.080 --> 26:04.080\n Do you see any of that data driven kind of computing systems\n\n26:04.080 --> 26:09.080\n having a role in any part of this,\n\n26:09.480 --> 26:13.320\n into the delivery of drugs, the design of drugs\n\n26:13.320 --> 26:15.240\n and any part of the chain?\n\n26:15.240 --> 26:18.080\n I do, I think that AI can be useful\n\n26:18.080 --> 26:20.040\n in a number of parts of the chain.\n\n26:20.040 --> 26:22.880\n I mean, one, I think if you get a large amount\n\n26:22.880 --> 26:26.320\n of information, you know, say you have some chemical data\n\n26:26.320 --> 26:29.040\n because you've done high throughput screens\n\n26:29.040 --> 26:30.600\n and let's, I'll just make this up,\n\n26:30.600 --> 26:33.560\n but let's say I have a, I'm trying to come up with a drug\n\n26:33.560 --> 26:37.800\n to treat disease X, whatever that disease is\n\n26:37.800 --> 26:42.800\n and I have a test for that and hopefully a fast test\n\n26:43.520 --> 26:47.520\n and let's say I test 10,000 chemical substances\n\n26:47.520 --> 26:49.960\n and a couple work, most of them don't work,\n\n26:49.960 --> 26:52.640\n some maybe work a little, but if I had a,\n\n26:52.640 --> 26:54.920\n with the right kind of artificial intelligence,\n\n26:54.920 --> 26:57.160\n maybe you could look at the chemical structures\n\n26:57.160 --> 26:58.480\n and look at what works and see\n\n26:58.480 --> 26:59.760\n if there's certain commonalities,\n\n26:59.760 --> 27:02.480\n look at what doesn't work and see what commonalities\n\n27:02.480 --> 27:05.240\n there are and then maybe use that somehow\n\n27:05.240 --> 27:07.040\n to predict the next generation of things\n\n27:07.040 --> 27:08.520\n that you would test.\n\n27:08.520 --> 27:10.760\n As a tangent, what are your thoughts\n\n27:10.760 --> 27:14.840\n on our society's relationship with pharmaceutical drugs?\n\n27:14.840 --> 27:17.400\n Do we, and perhaps I apologize\n\n27:17.400 --> 27:19.880\n if this is a philosophical broader question,\n\n27:19.880 --> 27:22.240\n but do we over rely on them?\n\n27:22.240 --> 27:24.720\n Do we improperly prescribe them?\n\n27:24.720 --> 27:26.560\n In what ways is the system working well\n\n27:26.560 --> 27:28.040\n and what way can it improve?\n\n27:28.040 --> 27:33.040\n Well, I think pharmaceutical drugs are really important.\n\n27:33.040 --> 27:37.080\n I mean, the life expectancy and life quality of people\n\n27:37.080 --> 27:40.200\n over many, many years has increased tremendously\n\n27:40.200 --> 27:42.120\n and I think that's a really good thing.\n\n27:42.120 --> 27:44.080\n I think one thing that would also be good\n\n27:44.080 --> 27:45.920\n is if we could extend that more and more\n\n27:45.920 --> 27:47.720\n to people in the developing world,\n\n27:47.720 --> 27:49.920\n which is something that our lab has been doing\n\n27:49.920 --> 27:52.240\n with the Gates Foundation or trying to do.\n\n27:53.800 --> 27:55.800\n So I think ways in which it could improve,\n\n27:55.800 --> 27:59.320\n I mean, if there was some way to reduce costs,\n\n27:59.320 --> 28:01.680\n that's certainly an issue people are concerned about.\n\n28:01.680 --> 28:05.280\n If there was some way to help people in poor countries,\n\n28:05.280 --> 28:06.880\n that would also be a good thing.\n\n28:06.880 --> 28:10.680\n And then of course, we still need to make better drugs\n\n28:10.680 --> 28:12.360\n for so many diseases.\n\n28:12.360 --> 28:14.200\n I mean, cancer, diabetes.\n\n28:14.200 --> 28:17.680\n I mean, there's heart disease and rare diseases.\n\n28:17.680 --> 28:20.360\n There are many, many situations where it'd be great\n\n28:20.360 --> 28:22.880\n if we could do better and help more people.\n\n28:22.880 --> 28:27.760\n Can we talk about another exciting space,\n\n28:27.760 --> 28:29.520\n which is tissue engineering?\n\n28:29.520 --> 28:32.360\n What is tissue engineering or regenerative medicine?\n\n28:32.360 --> 28:35.440\n Yeah, so that tissue engineering or regenerative medicine\n\n28:35.440 --> 28:38.880\n have to do with building an organ or tissue from scratch.\n\n28:38.880 --> 28:41.880\n So someday maybe we can build a liver\n\n28:43.080 --> 28:47.360\n or make new cartilage and also would enable you\n\n28:47.360 --> 28:49.960\n to someday create organs on a chip,\n\n28:49.960 --> 28:52.520\n which we and others are trying to do,\n\n28:52.520 --> 28:54.520\n which might lead to better drug testing\n\n28:54.520 --> 28:57.920\n and maybe less testing on animals or people.\n\n28:57.920 --> 29:01.240\n Organs on a chip, that sounds fascinating.\n\n29:01.240 --> 29:06.120\n So what are the various ways to generate tissue?\n\n29:06.120 --> 29:08.320\n And how do, so is it, you know,\n\n29:08.320 --> 29:10.600\n the one is of course from stem cells.\n\n29:10.600 --> 29:11.960\n Is there other methods?\n\n29:11.960 --> 29:14.240\n What are the different possible flavors here?\n\n29:14.240 --> 29:17.440\n Yeah, well, I think, I mean, there's multiple components.\n\n29:17.440 --> 29:19.800\n One is having generally some type of scaffold.\n\n29:19.800 --> 29:23.800\n That's what Jay Vacanti and I started many, many years ago.\n\n29:23.800 --> 29:26.160\n And then on that scaffold,\n\n29:26.160 --> 29:28.360\n you might put different cell types,\n\n29:28.360 --> 29:30.600\n which could be a cartilage cell, a bone cell,\n\n29:30.600 --> 29:32.640\n could be a stem cell that might differentiate\n\n29:32.640 --> 29:35.520\n into different things, could be more than one cell.\n\n29:35.520 --> 29:37.520\n And the scaffold, sorry to interrupt,\n\n29:37.520 --> 29:39.680\n is kind of like a canvas that's a structure\n\n29:39.680 --> 29:43.000\n that you can, on which the cells can grow?\n\n29:43.000 --> 29:44.960\n I think that's a good explanation what you just did.\n\n29:44.960 --> 29:47.840\n I'll have to use that, the canvas, that's good.\n\n29:47.840 --> 29:49.600\n Yeah, so I think that that's fair.\n\n29:49.600 --> 29:52.600\n You know, and the chip could be such a canvas.\n\n29:52.600 --> 29:55.440\n Could be fibers that are made of plastics\n\n29:55.440 --> 29:57.080\n that you'd put in the body someday.\n\n29:57.080 --> 29:59.840\n And when you say chip, do you mean electronic chip?\n\n29:59.840 --> 30:00.680\n Like a...\n\n30:00.680 --> 30:02.160\n Not necessarily, it could be though.\n\n30:02.160 --> 30:04.820\n But it doesn't have to be, it could just be a structure\n\n30:04.820 --> 30:08.400\n that's not in vivo, so to speak,\n\n30:08.400 --> 30:10.920\n that's, you know, that's outside the body.\n\n30:10.920 --> 30:11.760\n So is there...\n\n30:11.760 --> 30:13.280\n Canvas is not a bad word.\n\n30:13.280 --> 30:18.280\n So is there a possibility to weave into this canvas\n\n30:20.200 --> 30:22.160\n a computational component?\n\n30:22.160 --> 30:23.880\n So if we talk about electronic chips,\n\n30:23.880 --> 30:28.000\n some ability to sense, control,\n\n30:28.000 --> 30:31.320\n some aspect of this growth process for the tissue.\n\n30:31.320 --> 30:33.340\n I would say the answer to that is yes.\n\n30:33.340 --> 30:36.760\n I think right now people are working mostly\n\n30:36.760 --> 30:40.660\n on validating these kinds of chips for saying,\n\n30:40.660 --> 30:43.560\n well, it does work as effectively,\n\n30:43.560 --> 30:47.220\n or hopefully as just putting something in the body.\n\n30:47.220 --> 30:49.380\n But I think someday what you suggested,\n\n30:49.380 --> 30:51.240\n you certainly would be possible.\n\n30:51.240 --> 30:53.600\n So what kind of tissues can we engineer today?\n\n30:53.600 --> 30:54.440\n What would, yeah.\n\n30:54.440 --> 30:57.200\n Yeah, well, so skin's already been made\n\n30:57.200 --> 30:58.780\n and approved by the FDA.\n\n30:58.780 --> 31:00.860\n There are advanced clinical trials,\n\n31:00.860 --> 31:03.020\n like what are called phase three trials,\n\n31:03.020 --> 31:05.440\n that are at complete or near completion\n\n31:05.440 --> 31:08.360\n for making new blood vessels.\n\n31:08.360 --> 31:10.480\n One of my former students, Laura Nicholson,\n\n31:10.480 --> 31:11.620\n led a lot of that.\n\n31:13.240 --> 31:14.160\n Oh, that's amazing.\n\n31:14.160 --> 31:16.240\n So human skin can be grown.\n\n31:16.240 --> 31:20.480\n That's already approved in the entire, the FDA process.\n\n31:20.480 --> 31:22.380\n So that means what,\n\n31:23.600 --> 31:27.920\n so one, that means you can grow that tissue\n\n31:27.920 --> 31:30.040\n and do various kinds of experiments\n\n31:30.040 --> 31:34.200\n in terms of drugs and so on.\n\n31:34.200 --> 31:35.760\n But what does that, does that mean\n\n31:35.760 --> 31:38.040\n that some kind of healing and treatment\n\n31:38.040 --> 31:41.240\n of different conditions for unhuman beings?\n\n31:41.240 --> 31:43.560\n Yes, I mean, they've been approved now for,\n\n31:43.560 --> 31:45.180\n I mean, different groups have made them,\n\n31:45.180 --> 31:47.620\n different companies and different professors,\n\n31:47.620 --> 31:50.600\n but they've been approved for burn victims\n\n31:50.600 --> 31:53.240\n and for patients with diabetic skin ulcers.\n\n31:53.240 --> 31:54.080\n That's amazing.\n\n31:54.960 --> 31:59.540\n Okay, so skin, what else?\n\n31:59.540 --> 32:01.940\n Well, at different stages,\n\n32:01.940 --> 32:05.240\n people are, like skin, blood vessels,\n\n32:05.240 --> 32:08.580\n there's clinical trials going now for helping patients\n\n32:08.580 --> 32:12.320\n hear better, for patients that might be paralyzed,\n\n32:12.320 --> 32:15.480\n for patients that have different eye problems.\n\n32:15.480 --> 32:18.400\n I mean, and different groups have worked on\n\n32:18.400 --> 32:20.840\n just about everything, new liver, new kidneys.\n\n32:20.840 --> 32:24.480\n I mean, there've been all kinds of work done in this area.\n\n32:24.480 --> 32:26.680\n Some of it's early, but there's certainly\n\n32:26.680 --> 32:27.680\n a lot of activity.\n\n32:27.680 --> 32:29.300\n What about neural tissue?\n\n32:30.300 --> 32:31.480\n Yeah.\n\n32:31.480 --> 32:34.160\n The nervous system and even the brain.\n\n32:34.160 --> 32:36.200\n Well, there've been people out of working on that too.\n\n32:36.200 --> 32:37.440\n We've done a little bit with that,\n\n32:37.440 --> 32:40.360\n but there are people who've done a lot on neural stem cells\n\n32:40.360 --> 32:43.280\n and I know Evan Snyder, who's been one of our collaborators\n\n32:43.280 --> 32:46.200\n on some of our spinal cord works done work like that\n\n32:46.200 --> 32:48.040\n and there've been other people as well.\n\n32:48.040 --> 32:51.120\n Is there challenges for the,\n\n32:51.120 --> 32:52.800\n when it is part of the human body,\n\n32:52.800 --> 32:55.780\n is there challenges to getting the body to accept\n\n32:55.780 --> 32:58.040\n this new tissue that's being generated?\n\n32:58.040 --> 33:00.120\n How do you solve that kind of challenge?\n\n33:00.120 --> 33:02.780\n There can be problems with accepting it.\n\n33:02.780 --> 33:04.600\n I think maybe in particular,\n\n33:04.600 --> 33:07.160\n you might mean rejection by the body.\n\n33:07.160 --> 33:09.340\n So there are multiple ways that people are trying\n\n33:09.340 --> 33:10.180\n to deal with that.\n\n33:10.180 --> 33:14.680\n One way is, which was what we've done with Dan Anderson,\n\n33:14.680 --> 33:16.060\n who was one of my former postdocs\n\n33:16.060 --> 33:19.520\n and I mentioned this a little bit before for a pancreas,\n\n33:19.520 --> 33:20.840\n is encapsulating the cells.\n\n33:20.840 --> 33:25.840\n So immune cells or antibodies can't get in and attack them.\n\n33:26.880 --> 33:28.920\n So that's a way to protect them.\n\n33:28.920 --> 33:33.920\n Other strategies could be making the cells non immunogenic,\n\n33:34.240 --> 33:36.960\n which might be done by different either techniques\n\n33:36.960 --> 33:40.760\n which might mask them or using some gene editing approaches.\n\n33:40.760 --> 33:42.160\n So there are different ways that people\n\n33:42.160 --> 33:43.600\n are trying to do that.\n\n33:43.600 --> 33:45.560\n And of course, if you use the patient's own cells\n\n33:45.560 --> 33:50.240\n or cells from a close relative, that might be another way.\n\n33:50.240 --> 33:52.720\n It increases the likelihood that it'll get accepted\n\n33:52.720 --> 33:54.440\n if you use the patient's own cells.\n\n33:54.440 --> 33:55.320\n Yes.\n\n33:55.320 --> 33:57.700\n And then finally, there's immunosuppressive drugs,\n\n33:57.700 --> 34:00.320\n which will suppress the immune response.\n\n34:00.320 --> 34:03.940\n That's right now what's done, say, for a liver transplant.\n\n34:03.940 --> 34:06.240\n The fact that this whole thing works is fascinating,\n\n34:06.240 --> 34:09.880\n at least from my outside perspective.\n\n34:09.880 --> 34:13.220\n Will we one day be able to regenerate any organ\n\n34:13.220 --> 34:15.640\n or part of the human body?\n\n34:15.640 --> 34:16.880\n Any of you?\n\n34:16.880 --> 34:19.400\n I mean, it's exciting to think about future possibilities\n\n34:19.400 --> 34:20.680\n of tissue engineering.\n\n34:22.720 --> 34:25.100\n Do you see some tissues more difficult than others?\n\n34:25.100 --> 34:27.000\n What are the possibilities here?\n\n34:27.000 --> 34:29.160\n Yeah, well, of course, I'm an optimist.\n\n34:29.160 --> 34:30.760\n And I also feel the timeframe,\n\n34:30.760 --> 34:32.320\n if we're talking about someday,\n\n34:32.320 --> 34:33.860\n someday could be hundreds of years.\n\n34:33.860 --> 34:36.080\n But I think that, yes, someday,\n\n34:36.080 --> 34:39.280\n I think we will be able to regenerate many things.\n\n34:39.280 --> 34:41.840\n And there are different strategies that one might use.\n\n34:41.840 --> 34:44.840\n One might use some cells themselves.\n\n34:44.840 --> 34:47.600\n One might use some molecules\n\n34:47.600 --> 34:49.700\n that might help regenerate the cells.\n\n34:49.700 --> 34:51.920\n And so I think there are different possibilities.\n\n34:51.920 --> 34:54.720\n What do you think that means for longevity?\n\n34:54.720 --> 34:59.720\n If we look maybe not someday, but 10, 20 years out,\n\n35:00.000 --> 35:01.840\n the possibilities of tissue engineering,\n\n35:01.840 --> 35:04.440\n the possibilities of the research that you're doing,\n\n35:04.440 --> 35:06.800\n does it have a significant impact\n\n35:06.800 --> 35:10.040\n on the longevity of human life?\n\n35:10.040 --> 35:11.120\n I don't know that we'll see\n\n35:11.120 --> 35:12.800\n a radical increase in longevity,\n\n35:12.800 --> 35:15.900\n but I think that in certain areas,\n\n35:15.900 --> 35:19.420\n we'll see people live better lives\n\n35:19.420 --> 35:21.700\n and maybe somewhat longer lives.\n\n35:21.700 --> 35:25.740\n What's the most beautiful scientific idea\n\n35:25.740 --> 35:28.220\n in bioengineering that you've come across\n\n35:28.220 --> 35:29.820\n in your years of research?\n\n35:30.740 --> 35:33.460\n I apologize for the romantic question.\n\n35:33.460 --> 35:35.460\n No, that's an interesting question.\n\n35:35.460 --> 35:37.900\n I certainly think what's happening right now\n\n35:37.900 --> 35:39.580\n with CRISPR is a beautiful idea.\n\n35:39.580 --> 35:42.100\n That certainly wasn't my idea.\n\n35:42.100 --> 35:45.980\n I mean, but I think it's very interesting here\n\n35:45.980 --> 35:48.820\n what people have capitalized on\n\n35:48.820 --> 35:52.980\n is that there's a mechanism by which bacteria\n\n35:52.980 --> 35:54.780\n are able to destroy viruses.\n\n35:54.780 --> 35:58.620\n And that understanding that leads to machinery\n\n35:58.620 --> 36:03.620\n to sort of cut and paste genes and fix a cell.\n\n36:06.860 --> 36:09.380\n So that kind of, do you see a promise\n\n36:09.380 --> 36:13.700\n for that kind of ability to copy and paste?\n\n36:13.700 --> 36:16.860\n I mean, like we said, the human body is complicated.\n\n36:16.860 --> 36:21.860\n Is that, that seems exceptionally difficult to do.\n\n36:23.260 --> 36:25.220\n I think it is exceptionally difficult to do,\n\n36:25.220 --> 36:27.940\n but that doesn't mean that it won't be done.\n\n36:27.940 --> 36:30.460\n There's a lot of companies and people trying to do it.\n\n36:30.460 --> 36:32.500\n And I think in some areas it will be done.\n\n36:32.500 --> 36:36.300\n Some of the ways that you might lower the bar\n\n36:36.300 --> 36:38.260\n are not, are just taking,\n\n36:39.180 --> 36:40.900\n like not necessarily doing it directly,\n\n36:40.900 --> 36:45.780\n but you could take a cell that might be useful,\n\n36:45.780 --> 36:48.740\n but you want to give it some cancer killing capabilities,\n\n36:48.740 --> 36:50.980\n something like what's called a CAR T cell.\n\n36:50.980 --> 36:52.380\n And that might be a different way\n\n36:52.380 --> 36:56.260\n of somehow making a CAR T cell and maybe making it better.\n\n36:56.260 --> 36:58.460\n So there might be sort of easier things\n\n36:58.460 --> 37:01.540\n and rather than just fixing the whole body.\n\n37:01.540 --> 37:04.100\n So the way a lot of things have moved with medicine\n\n37:04.100 --> 37:06.140\n over time is stepwise.\n\n37:06.140 --> 37:10.260\n So I can see things that might be easier to do\n\n37:10.260 --> 37:11.860\n than say, fix a brain.\n\n37:11.860 --> 37:13.940\n That would be very hard to do,\n\n37:13.940 --> 37:16.420\n but maybe someday that'll happen too.\n\n37:16.420 --> 37:19.260\n So in terms of stepwise, that's an interesting notion.\n\n37:19.260 --> 37:24.100\n Do you see that if you look at medicine or bioengineering,\n\n37:25.180 --> 37:29.140\n do you see that there is these big leaps\n\n37:29.140 --> 37:33.460\n that happen every decade or so, or some distant period,\n\n37:33.460 --> 37:36.500\n or is it a lot of incremental work?\n\n37:36.500 --> 37:39.020\n Not, I don't mean to reduce its impact\n\n37:39.020 --> 37:40.060\n by saying it's incremental,\n\n37:40.060 --> 37:45.060\n but is there sort of phase shifts in the science,\n\n37:46.300 --> 37:48.220\n big leaps?\n\n37:48.220 --> 37:49.700\n I think there's both.\n\n37:49.700 --> 37:53.020\n Every so often a new technique or a new technology comes out.\n\n37:54.300 --> 37:56.660\n I mean, genetic engineering was an example.\n\n37:56.660 --> 37:58.820\n I mentioned CRISPR.\n\n37:58.820 --> 38:01.300\n I think every so often things happen\n\n38:01.300 --> 38:03.340\n that make a big difference,\n\n38:03.340 --> 38:07.580\n but still there's to try to really make progress,\n\n38:07.580 --> 38:09.820\n make a new drug, make a new device.\n\n38:09.820 --> 38:11.100\n There's a lot of things.\n\n38:11.100 --> 38:12.740\n I don't know if I'd call them incremental,\n\n38:12.740 --> 38:15.780\n but there's a lot, a lot of work that needs to be done.\n\n38:15.780 --> 38:16.940\n Absolutely.\n\n38:16.940 --> 38:20.900\n So you have over, numbers could be off,\n\n38:20.900 --> 38:22.020\n but it's a big amount.\n\n38:22.020 --> 38:25.340\n You have over 1,100 current or pending patents\n\n38:25.340 --> 38:27.260\n that have been licensed, sublicensed\n\n38:27.260 --> 38:28.740\n to over 300 companies.\n\n38:29.660 --> 38:33.980\n What's your view, what in your view are the strengths\n\n38:33.980 --> 38:36.660\n and what are the drawbacks of the patenting process?\n\n38:36.660 --> 38:39.260\n Well, I think for the most part, there's strengths.\n\n38:39.260 --> 38:42.220\n I think that if you didn't have patents,\n\n38:42.220 --> 38:43.540\n especially in medicine,\n\n38:43.540 --> 38:45.940\n you'd never get the funding that it takes\n\n38:45.940 --> 38:47.660\n to make a new drug or a new device.\n\n38:47.660 --> 38:49.420\n I mean, which according to Tufts,\n\n38:49.420 --> 38:52.700\n to make a new drug costs over $2 billion right now.\n\n38:52.700 --> 38:55.780\n And nobody would even come close to giving you that money,\n\n38:55.780 --> 39:00.780\n any of that money, if it weren't for the patent system,\n\n39:00.780 --> 39:03.100\n because then anybody else could do it.\n\n39:03.100 --> 39:08.100\n That then leads to the negative though.\n\n39:08.300 --> 39:11.860\n Sometimes somebody does have a very successful drug\n\n39:11.860 --> 39:14.380\n and you certainly wanna try to make it available\n\n39:14.380 --> 39:15.860\n to everybody.\n\n39:15.860 --> 39:20.860\n And so the patent system allowed it to happen\n\n39:21.140 --> 39:23.820\n in the first place, but maybe it'll impede it\n\n39:23.820 --> 39:26.700\n after a little bit, or certainly to some people\n\n39:26.700 --> 39:31.220\n or to some companies, once it is out there.\n\n39:31.220 --> 39:34.660\n What's the, on the point of the cost,\n\n39:34.660 --> 39:37.620\n what would you say is the most expensive part\n\n39:37.620 --> 39:40.980\n of the $2 billion of making a drug?\n\n39:40.980 --> 39:42.900\n Human clinical trials.\n\n39:42.900 --> 39:44.620\n That is by far the most expensive.\n\n39:44.620 --> 39:47.540\n In terms of money or pain or both?\n\n39:47.540 --> 39:50.660\n Well, money, but pain goes, it's hard to know.\n\n39:50.660 --> 39:54.140\n I mean, but usually proving things that are,\n\n39:54.140 --> 39:57.740\n proving that something new is safe and effective in people\n\n39:57.740 --> 40:00.420\n is almost always the biggest expense.\n\n40:00.420 --> 40:02.740\n Could you linger on that for just a little longer\n\n40:02.740 --> 40:06.300\n and describe what it takes to prove,\n\n40:06.300 --> 40:09.580\n for people that don't know, in general,\n\n40:09.580 --> 40:12.940\n what it takes to prove that something is effective on humans?\n\n40:12.940 --> 40:17.660\n Well, you'd have to take a particular disease,\n\n40:17.660 --> 40:20.460\n but the process is you start out with,\n\n40:20.460 --> 40:21.980\n usually you start out with cells,\n\n40:21.980 --> 40:23.420\n then you'd go to animal models.\n\n40:23.420 --> 40:25.780\n Usually you have to do a couple animal models.\n\n40:25.780 --> 40:28.660\n And of course the animal models aren't perfect for humans.\n\n40:28.660 --> 40:31.060\n And then you have to do three sets of clinical trials\n\n40:31.060 --> 40:34.140\n at a minimum, a phase one trial to show that it's safe\n\n40:34.140 --> 40:36.580\n in small number of patients, a phase two trial\n\n40:36.580 --> 40:39.220\n to show that it's effective in a small number of patients,\n\n40:39.220 --> 40:42.500\n and a phase three trial to show that it's safe and effective\n\n40:42.500 --> 40:44.540\n in a large number of patients.\n\n40:44.540 --> 40:46.900\n And that could end up being hundreds\n\n40:46.900 --> 40:49.260\n or thousands of patients.\n\n40:49.260 --> 40:52.620\n And they have to be really carefully controlled studies.\n\n40:52.620 --> 40:55.060\n And you'd have to manufacture the drug,\n\n40:55.060 --> 40:58.860\n you'd have to really watch those patients.\n\n40:58.860 --> 41:03.140\n You have to be very concerned that it is gonna be safe.\n\n41:03.140 --> 41:07.500\n And then you look and see, does it treat the disease better\n\n41:07.500 --> 41:10.860\n than whatever the gold standard was before that?\n\n41:10.860 --> 41:12.780\n Assuming there was one.\n\n41:12.780 --> 41:14.420\n That's a really interesting line.\n\n41:14.420 --> 41:17.980\n Show that it's safe first, and then that it's effective.\n\n41:17.980 --> 41:19.220\n First do no harm.\n\n41:19.220 --> 41:21.380\n First do no harm, that's right.\n\n41:21.380 --> 41:26.140\n So how, again, if you can linger in a little bit,\n\n41:26.140 --> 41:28.260\n how does the patenting process work?\n\n41:29.140 --> 41:32.660\n Yeah, well, you do a certain amount of research,\n\n41:32.660 --> 41:35.300\n though that's not necessarily has to be the case.\n\n41:35.300 --> 41:36.820\n But for us, usually it is.\n\n41:36.820 --> 41:39.100\n Usually we do a certain amount of research\n\n41:40.420 --> 41:41.860\n and make some findings.\n\n41:41.860 --> 41:46.380\n And we had a hypothesis, let's say we prove it,\n\n41:46.380 --> 41:49.580\n or we make some discovery, we invent some technique.\n\n41:49.580 --> 41:52.940\n And then we write something up, what's called a disclosure.\n\n41:52.940 --> 41:55.620\n We give it to MIT's technology transfer office.\n\n41:55.620 --> 41:57.820\n They then give it to some patent attorneys,\n\n41:57.820 --> 42:00.900\n and they use that plus talking to us\n\n42:00.900 --> 42:03.740\n and work on writing a patent.\n\n42:03.740 --> 42:07.700\n And then you go back and forth with the USPTO,\n\n42:07.700 --> 42:09.900\n that's the United States Patent and Trademark Office.\n\n42:09.900 --> 42:14.340\n And they may not allow it the first, second or third time,\n\n42:14.340 --> 42:17.140\n but they will tell you why they don't.\n\n42:17.140 --> 42:18.180\n And you may adjust it,\n\n42:18.180 --> 42:21.540\n and maybe you'll eventually get it, and maybe you won't.\n\n42:21.540 --> 42:24.980\n So you've been part of launching 40 companies\n\n42:24.980 --> 42:28.500\n together worth, again, numbers could be outdated,\n\n42:28.500 --> 42:30.780\n but an estimated $23 billion.\n\n42:33.260 --> 42:34.700\n You've described your thoughts\n\n42:34.700 --> 42:36.980\n on a formula for startup success.\n\n42:36.980 --> 42:38.940\n So perhaps you can describe that formula\n\n42:38.940 --> 42:41.540\n and in general describe what does it take\n\n42:41.540 --> 42:43.260\n to build a successful startup?\n\n42:44.180 --> 42:46.540\n Well, I'd break that down into a couple of categories.\n\n42:46.540 --> 42:48.660\n And I'm a scientist and certainly\n\n42:48.660 --> 42:50.700\n from the science standpoint, I'll go over that.\n\n42:50.700 --> 42:54.180\n But I actually think that really the most important thing\n\n42:54.180 --> 42:57.660\n is probably the business people that I work with.\n\n42:57.660 --> 43:01.580\n And when I look back at the companies that have done well,\n\n43:01.580 --> 43:03.860\n it's been because we've had great business people.\n\n43:03.860 --> 43:05.220\n And when they haven't done as well,\n\n43:05.220 --> 43:06.940\n we haven't had as good business people.\n\n43:06.940 --> 43:08.820\n But from a science standpoint,\n\n43:08.820 --> 43:11.460\n I think about that we've made some kind of discovery\n\n43:12.540 --> 43:15.340\n that is almost what I'd call a platform\n\n43:15.340 --> 43:17.860\n that you could use it for different things.\n\n43:17.860 --> 43:20.540\n And certainly the drug delivery system example\n\n43:20.540 --> 43:22.660\n that I gave earlier is a good example of that.\n\n43:22.660 --> 43:25.660\n You could use it for drug A, B, C, D, E and so forth.\n\n43:27.100 --> 43:30.420\n And that I'd like to think that we've taken it far enough\n\n43:30.420 --> 43:33.300\n so that we've written at least one really good paper\n\n43:33.300 --> 43:35.420\n in a top journal, hopefully a number\n\n43:36.340 --> 43:39.340\n that we've reduced it to practice and animal models\n\n43:39.340 --> 43:44.340\n that we've filed patents, maybe had issued patents\n\n43:45.380 --> 43:48.340\n that have what I'll call very good and broad claims.\n\n43:48.340 --> 43:50.860\n That's sort of the key on a patent.\n\n43:50.860 --> 43:54.180\n And then in our case, a lot of times when we've done it,\n\n43:55.020 --> 43:57.780\n a lot of times it's somebody in the lab\n\n43:57.780 --> 43:59.380\n like a postdoc or graduate student\n\n43:59.380 --> 44:01.740\n that spent a big part of their life doing it\n\n44:01.740 --> 44:03.740\n and that they wanna work at that company\n\n44:03.740 --> 44:04.780\n because they have this passion\n\n44:04.780 --> 44:06.580\n that they wanna see something they did\n\n44:06.580 --> 44:09.380\n make a difference in people's lives.\n\n44:09.380 --> 44:12.980\n Maybe you can mention the business component.\n\n44:12.980 --> 44:15.300\n It's funny to hear Grace had to say\n\n44:15.300 --> 44:17.940\n that there's value to business folks.\n\n44:17.940 --> 44:18.780\n Oh yeah, well.\n\n44:18.780 --> 44:20.420\n That's not always said.\n\n44:20.420 --> 44:25.220\n So what value, what business instinct is valuable\n\n44:25.220 --> 44:29.180\n to make a startup successful, a company successful?\n\n44:29.180 --> 44:32.180\n I think the business aspects are,\n\n44:32.180 --> 44:35.740\n you have to be a good judge of people\n\n44:35.740 --> 44:37.700\n so that you hire the right people.\n\n44:37.700 --> 44:40.460\n You have to be strategic so you figure out\n\n44:40.460 --> 44:41.820\n if you do have that platform\n\n44:41.820 --> 44:44.700\n that could be used for all these different things.\n\n44:44.700 --> 44:47.620\n And knowing that medical research is so expensive,\n\n44:47.620 --> 44:49.180\n what thing are you gonna do first, second,\n\n44:49.180 --> 44:51.980\n third, fourth and fifth?\n\n44:51.980 --> 44:53.660\n I think you need to have a good,\n\n44:53.660 --> 44:57.220\n what I'll call FDA regulatory clinical trial strategy.\n\n44:58.100 --> 45:01.580\n I think you have to be able to raise money incredibly.\n\n45:01.580 --> 45:02.740\n So there are a lot of things.\n\n45:02.740 --> 45:05.260\n You have to be good with people, good manager of people.\n\n45:05.260 --> 45:08.460\n So the money and the people part I get,\n\n45:08.460 --> 45:13.020\n but the stuff before in terms of deciding the A, B, C, D,\n\n45:13.020 --> 45:16.660\n if you have a platform which drugs to first take a testing,\n\n45:16.660 --> 45:18.900\n you see nevertheless scientists\n\n45:18.900 --> 45:22.580\n as not being always too good at that process.\n\n45:22.580 --> 45:24.260\n Well, I think they're a part of the process,\n\n45:24.260 --> 45:28.180\n but I'd say there's probably, I'm gonna just make this up,\n\n45:28.180 --> 45:31.780\n but maybe six or seven criteria that you wanna use\n\n45:31.780 --> 45:33.300\n and it's not just science.\n\n45:33.300 --> 45:35.180\n I mean, the kinds of things that I would think about\n\n45:35.180 --> 45:37.900\n is, is the market big or small?\n\n45:37.900 --> 45:41.260\n Is the, are there good animal models for it\n\n45:41.260 --> 45:44.320\n so that you could test it and it wouldn't take 50 years?\n\n45:45.560 --> 45:48.420\n Are the clinical trials that could be set up\n\n45:48.420 --> 45:51.960\n ones that have clear end points\n\n45:51.960 --> 45:53.700\n where you can make a judgment?\n\n45:53.700 --> 45:58.700\n And another issue would be competition.\n\n45:58.860 --> 46:00.420\n Are there other ways that some companies\n\n46:00.420 --> 46:01.540\n out there are doing it?\n\n46:01.540 --> 46:04.860\n Another issue would be reimbursement.\n\n46:05.820 --> 46:07.540\n You know, can it get reimbursed?\n\n46:07.540 --> 46:10.180\n So a lot of things that you have manufacturing issues\n\n46:10.180 --> 46:11.860\n you'd wanna consider.\n\n46:11.860 --> 46:13.700\n So I think there are really a lot of things\n\n46:13.700 --> 46:15.540\n that go into whether you,\n\n46:15.540 --> 46:17.740\n what you do first, second, third, or fourth.\n\n46:19.300 --> 46:23.100\n So you lead one of the largest academic labs in the world\n\n46:23.100 --> 46:27.020\n with over $10 million in annual grants\n\n46:27.020 --> 46:28.520\n and over a hundred researchers,\n\n46:28.520 --> 46:31.740\n probably over a thousand since the lab's beginning.\n\n46:31.740 --> 46:36.740\n Researchers can be individualistic and eccentric.\n\n46:37.100 --> 46:38.580\n How do I put it nicely?\n\n46:38.580 --> 46:40.000\n There you go, eccentric.\n\n46:40.000 --> 46:43.140\n So what insights into research leadership can you give\n\n46:43.140 --> 46:45.340\n having to run such a successful lab\n\n46:45.340 --> 46:47.320\n with so much diverse talent?\n\n46:49.440 --> 46:50.780\n Well, I don't know that I'm any expert.\n\n46:50.780 --> 46:53.500\n I think that what you do to me,\n\n46:53.500 --> 46:54.900\n I mean, I just want,\n\n46:54.900 --> 46:56.380\n I mean, this is gonna sound very simplistic,\n\n46:56.380 --> 46:58.940\n but I just want people in the lab to be happy,\n\n46:58.940 --> 47:00.260\n to be doing things that I hope\n\n47:00.260 --> 47:02.700\n will make the world a better place,\n\n47:02.700 --> 47:04.460\n to be working on science\n\n47:04.460 --> 47:06.140\n that can make the world a better place.\n\n47:06.140 --> 47:09.820\n And I guess my feeling is if we're able to do that,\n\n47:11.300 --> 47:13.940\n you know, it kind of runs itself.\n\n47:13.940 --> 47:17.360\n So how do you make a researcher happy in general?\n\n47:17.360 --> 47:19.260\n I think when people feel,\n\n47:19.260 --> 47:21.460\n I mean, this is gonna sound like, again,\n\n47:21.460 --> 47:23.600\n simplistic or maybe like motherhood and apple pie,\n\n47:23.600 --> 47:26.540\n but I think if people feel they're working on something\n\n47:26.540 --> 47:30.180\n really important that can affect many other people's lives\n\n47:30.180 --> 47:32.600\n and they're making some progress,\n\n47:32.600 --> 47:34.100\n they'll feel good about it\n\n47:34.100 --> 47:35.420\n and they'll feel good about themselves\n\n47:35.420 --> 47:37.240\n and they'll be happy.\n\n47:37.240 --> 47:39.820\n But through brainstorming and so on,\n\n47:39.820 --> 47:43.940\n what's your role and how difficult is it as a group\n\n47:43.940 --> 47:48.940\n in this collaboration to arrive at these big questions\n\n47:49.420 --> 47:51.100\n that might have impact?\n\n47:51.100 --> 47:54.620\n Well, the big questions come from many different ways.\n\n47:54.620 --> 47:57.420\n Sometimes it's trying to, things that I might think of\n\n47:57.420 --> 47:59.500\n or somebody in the lab might think of,\n\n47:59.500 --> 48:00.900\n which could be a new technique\n\n48:00.900 --> 48:02.900\n or to understand something better.\n\n48:02.900 --> 48:05.560\n But gee, we've had people like Bill Gates\n\n48:05.560 --> 48:07.180\n and the Gates Foundation come to us\n\n48:07.180 --> 48:10.140\n and Juvenile Diabetes Foundation come to us and say,\n\n48:10.140 --> 48:11.740\n gee, could you help us on these things?\n\n48:11.740 --> 48:13.540\n And I mean, that's good too.\n\n48:13.540 --> 48:15.500\n It doesn't happen just one way.\n\n48:16.900 --> 48:20.800\n And I mean, you've kind of mentioned it, happiness,\n\n48:20.800 --> 48:24.720\n but is there something more,\n\n48:24.720 --> 48:26.440\n how do you inspire a researcher\n\n48:26.440 --> 48:28.300\n to do the best work of their life?\n\n48:28.300 --> 48:32.660\n So you mentioned passion and passion is a kind of fire.\n\n48:32.660 --> 48:35.980\n Do you see yourself having a role to keep that fire going,\n\n48:35.980 --> 48:39.900\n to build it up, to inspire the researchers\n\n48:39.900 --> 48:42.840\n through the pretty difficult process\n\n48:42.840 --> 48:47.840\n of going from idea to big question, to big answer?\n\n48:47.840 --> 48:48.680\n I think so.\n\n48:48.680 --> 48:52.680\n I think I try to do that by talking to people\n\n48:52.680 --> 48:56.840\n going over their ideas and their progress.\n\n48:56.840 --> 49:00.000\n I try to do it as an individual.\n\n49:00.000 --> 49:01.880\n Certainly when I talk about my own career,\n\n49:01.880 --> 49:04.640\n I had my setbacks at different times\n\n49:04.640 --> 49:06.920\n and people know that, that know me.\n\n49:06.920 --> 49:11.920\n And you just try to keep pushing and so forth.\n\n49:12.080 --> 49:15.760\n But yeah, I think I try to do that.\n\n49:15.760 --> 49:17.920\n But yeah, I think I try to do that\n\n49:17.920 --> 49:20.960\n as the one who leads the lab.\n\n49:20.960 --> 49:23.320\n So you have this exceptionally successful lab\n\n49:23.320 --> 49:27.400\n and one of the great institutions in the world, MIT.\n\n49:29.280 --> 49:32.680\n And yet sort of, at least in my neck of the woods\n\n49:32.680 --> 49:35.220\n in computer science and artificial intelligence,\n\n49:36.560 --> 49:39.680\n a lot of the research is kind of,\n\n49:40.520 --> 49:43.060\n a lot of the great researchers, not everyone,\n\n49:43.060 --> 49:46.920\n but some are kind of going to industry.\n\n49:46.920 --> 49:49.680\n A lot of the research is moving to industry.\n\n49:49.680 --> 49:52.600\n What do you think about the future of science in general?\n\n49:52.600 --> 49:54.440\n Is there drawbacks?\n\n49:54.440 --> 49:57.080\n Is there strength to the academic environment\n\n49:58.200 --> 49:59.920\n that you hope will persist?\n\n49:59.920 --> 50:02.120\n How does it need to change?\n\n50:02.120 --> 50:04.200\n What needs to stay the same?\n\n50:04.200 --> 50:05.920\n What are your thoughts on this whole landscape\n\n50:05.920 --> 50:08.000\n of science and its future?\n\n50:08.000 --> 50:10.400\n Well, first I think going to industry is good,\n\n50:10.400 --> 50:12.840\n but I think being in academia is good.\n\n50:12.840 --> 50:15.240\n You know, I have lots of students who've done both\n\n50:15.240 --> 50:18.480\n and they've had great careers doing both.\n\n50:18.480 --> 50:21.280\n I think from an academic standpoint,\n\n50:21.280 --> 50:24.920\n I mean, the biggest concern probably that people feel today,\n\n50:24.920 --> 50:26.560\n you know, at a place like MIT\n\n50:26.560 --> 50:30.240\n or other research heavy institutions is gonna be funding\n\n50:30.240 --> 50:34.060\n and particular funding that's not super directed,\n\n50:34.060 --> 50:37.080\n you know, so that you can do basic research.\n\n50:37.080 --> 50:39.360\n I think that's probably the number one thing,\n\n50:39.360 --> 50:43.400\n but you know, it would be great if we as a society\n\n50:43.400 --> 50:45.640\n could come up with better ways to teach,\n\n50:45.640 --> 50:49.200\n you know, so that people all over could learn better.\n\n50:50.160 --> 50:51.820\n You know, so I think there are a number of things\n\n50:51.820 --> 50:54.020\n that would be good to be able to do better.\n\n50:55.320 --> 50:58.900\n So again, you're very successful in terms of funding,\n\n50:58.900 --> 51:01.980\n but do you still feel the pressure of that,\n\n51:01.980 --> 51:04.640\n of having to seek funding?\n\n51:04.640 --> 51:07.420\n Does it affect the science or is it,\n\n51:07.420 --> 51:11.260\n or can you simply focus on doing the best work of your life\n\n51:11.260 --> 51:14.040\n and the funding comes along with that?\n\n51:14.040 --> 51:16.240\n I'd say the last 10 or 15 years,\n\n51:16.240 --> 51:18.460\n we've done pretty well funding,\n\n51:18.460 --> 51:19.760\n but I always worry about it.\n\n51:19.760 --> 51:23.640\n You know, it's like you're still operating\n\n51:23.640 --> 51:25.860\n on more soft money than hard.\n\n51:25.860 --> 51:27.760\n And so I always worry about it,\n\n51:27.760 --> 51:32.760\n but we've been fortunate that places have come to us\n\n51:33.000 --> 51:34.880\n like the Gates Foundation and others,\n\n51:34.880 --> 51:37.600\n Juvenile Diabetes Foundation, some companies,\n\n51:37.600 --> 51:39.760\n and they're willing to give us funding\n\n51:39.760 --> 51:42.200\n and we've gotten government money as well.\n\n51:42.200 --> 51:44.760\n We have a number of NIH grants and I've always had that\n\n51:44.760 --> 51:47.180\n and that's important to me too.\n\n51:47.180 --> 51:51.480\n So I worry about it, but you know,\n\n51:51.480 --> 51:53.760\n I just view that as a part of the process.\n\n51:53.760 --> 51:57.440\n Now, if you put yourself in the shoes of a philanthropist,\n\n51:57.440 --> 52:02.200\n like say I gave you $100 billion right now,\n\n52:02.200 --> 52:05.560\n but you couldn't spend it on your own research.\n\n52:05.560 --> 52:10.560\n So how hard is it to decide which labs to invest in,\n\n52:12.800 --> 52:16.460\n which ideas, which problems, which solutions?\n\n52:16.460 --> 52:19.120\n You know, cause funding is so much,\n\n52:19.120 --> 52:22.960\n such an important part of progression of science\n\n52:22.960 --> 52:24.560\n in today's society.\n\n52:24.560 --> 52:26.720\n So if you put yourself in the shoes of a philanthropist,\n\n52:26.720 --> 52:27.560\n how hard is that problem?\n\n52:27.560 --> 52:29.320\n How would you go about solving it?\n\n52:29.320 --> 52:32.400\n Sure, well, I think what I do, the first thing is different\n\n52:32.400 --> 52:34.760\n philanthropists have different visions.\n\n52:34.760 --> 52:37.620\n And I think the first thing is to form a concrete vision\n\n52:37.620 --> 52:38.460\n of what you want.\n\n52:38.460 --> 52:41.100\n Some people, I mean, I'll just give you two examples\n\n52:41.100 --> 52:44.320\n of people that I know.\n\n52:44.320 --> 52:47.480\n David Koch was very interested in cancer research\n\n52:47.480 --> 52:51.640\n and part of that was that he had prostate cancer.\n\n52:51.640 --> 52:55.440\n And a number of people do that along those lines.\n\n52:55.440 --> 52:57.960\n They've had somebody, they've either had cancer themselves\n\n52:57.960 --> 53:00.000\n or somebody they loved had cancer\n\n53:00.000 --> 53:02.700\n and they wanna put money into cancer research.\n\n53:02.700 --> 53:04.160\n Bill Gates, on the other hand,\n\n53:04.160 --> 53:06.480\n I think when he had got his fortune,\n\n53:06.480 --> 53:08.560\n I mean, he thought about it and felt, well,\n\n53:08.560 --> 53:10.180\n how could he have the greatest impact?\n\n53:10.180 --> 53:12.520\n And he thought about, you know, helping people\n\n53:12.520 --> 53:15.660\n in the developing world and medicines\n\n53:15.660 --> 53:18.040\n and different things like that, like vaccines\n\n53:18.040 --> 53:20.160\n that might be really helpful for people\n\n53:20.160 --> 53:21.120\n in the developing world.\n\n53:21.120 --> 53:25.720\n And so I think first you start out with that vision.\n\n53:25.720 --> 53:29.440\n Once you start out with that vision, whatever vision it is,\n\n53:29.440 --> 53:33.760\n then I think you try to ask the question,\n\n53:33.760 --> 53:38.360\n who in the world does the best work if that was your goal?\n\n53:38.360 --> 53:40.240\n I mean, but you really, I think have to have\n\n53:40.240 --> 53:41.060\n a defined vision.\n\n53:41.060 --> 53:41.900\n Vision first.\n\n53:41.900 --> 53:45.080\n Yeah, and I think that's what people do.\n\n53:45.080 --> 53:48.360\n I mean, I have never seen anybody do it otherwise.\n\n53:48.360 --> 53:49.760\n I mean, and that, by the way,\n\n53:49.760 --> 53:53.280\n may not be the best thing overall.\n\n53:53.280 --> 53:55.600\n I mean, I think it's good that all those things happen,\n\n53:55.600 --> 53:57.800\n but, you know, what you really want to do,\n\n53:57.800 --> 54:00.440\n and I'll make a contrast in a second,\n\n54:00.440 --> 54:02.680\n in addition to funding important areas,\n\n54:02.680 --> 54:07.680\n like what both of those people did, is to help young people.\n\n54:07.760 --> 54:10.120\n And they may be at odds with each other\n\n54:10.120 --> 54:13.080\n because a far more, a lab like ours,\n\n54:13.080 --> 54:15.680\n which is, you know, I'm older, is, you know,\n\n54:15.680 --> 54:18.680\n might be very good at addressing some of those kinds\n\n54:18.680 --> 54:20.680\n of problems, but, you know, I'm not young.\n\n54:20.680 --> 54:22.720\n I train a lot of people who are young,\n\n54:22.720 --> 54:24.480\n but it's not the same as helping somebody\n\n54:24.480 --> 54:26.480\n who's an assistant professor someplace.\n\n54:26.480 --> 54:30.960\n So I think what's, I think, been good about our thing,\n\n54:30.960 --> 54:33.280\n our society, or things overall,\n\n54:33.280 --> 54:35.040\n are that there are people who come at it\n\n54:35.040 --> 54:37.840\n from different ways, and the combination,\n\n54:37.840 --> 54:40.380\n the confluence of the government funding,\n\n54:40.380 --> 54:43.880\n the certain foundations that fund things,\n\n54:43.880 --> 54:46.640\n and other foundations that, you know,\n\n54:46.640 --> 54:48.280\n want to see disease treated,\n\n54:48.280 --> 54:51.480\n well, then they can go seek out people,\n\n54:51.480 --> 54:53.240\n or they can put a request for proposals\n\n54:53.240 --> 54:54.680\n and see who does the best.\n\n54:54.680 --> 54:58.000\n You know, I'd say both David Koch and Bill Gates\n\n54:58.000 --> 54:58.960\n did exactly that.\n\n54:58.960 --> 55:02.200\n They sought out people, both of them, you know,\n\n55:02.200 --> 55:04.200\n or their foundations that they were involved in,\n\n55:04.200 --> 55:05.820\n sought out people like myself.\n\n55:07.480 --> 55:10.220\n But they also had requests for proposals.\n\n55:11.400 --> 55:12.720\n Now, you mentioned young people,\n\n55:12.720 --> 55:14.160\n and that reminds me of something you said\n\n55:14.160 --> 55:17.720\n in an interview of Written Somewhere,\n\n55:17.720 --> 55:21.840\n that said some of your initial struggles\n\n55:21.840 --> 55:26.660\n in terms of finding a faculty position, or so on,\n\n55:28.200 --> 55:30.120\n that you didn't quite, for people,\n\n55:30.120 --> 55:33.000\n fit into a particular bucket, a particular.\n\n55:33.000 --> 55:33.840\n Right.\n\n55:35.000 --> 55:36.320\n Can you speak to that?\n\n55:38.240 --> 55:41.760\n How, do you see limitations to the academic system\n\n55:41.760 --> 55:44.120\n that it does have such buckets?\n\n55:44.120 --> 55:49.120\n Is there, how can we allow for people\n\n55:49.120 --> 55:54.120\n who are brilliant, but outside the disciplines\n\n55:56.400 --> 55:59.600\n of the previous decade?\n\n55:59.600 --> 56:01.320\n Yeah, well, I think that's a great question.\n\n56:01.320 --> 56:03.620\n I think that, I think the department heads\n\n56:03.620 --> 56:07.040\n have to have a vision, you know, and some of them do.\n\n56:07.040 --> 56:11.040\n Every so often, you know, there are institutes\n\n56:11.040 --> 56:13.400\n or labs that do that.\n\n56:13.400 --> 56:17.480\n I mean, at MIT, I think that's done sometimes.\n\n56:17.480 --> 56:21.240\n I know mechanical engineering department just had a search,\n\n56:21.240 --> 56:25.440\n and they hired Gio Traverso, who is one of my,\n\n56:25.440 --> 56:28.200\n he was a fellow with me, but he's actually\n\n56:28.200 --> 56:32.000\n a molecular biologist and a gastroenterologist.\n\n56:32.000 --> 56:34.200\n And, you know, he's one of the best in the world,\n\n56:34.200 --> 56:37.240\n but he's also done some great mechanical engineering\n\n56:37.240 --> 56:39.800\n and designing some new pills and things like that.\n\n56:39.800 --> 56:43.880\n And they picked him, and boy, I give them a lot of credit.\n\n56:43.880 --> 56:46.880\n I mean, that's vision, to pick somebody.\n\n56:46.880 --> 56:49.880\n And I think, you know, they'll be the richer four.\n\n56:49.880 --> 56:52.120\n I think the Media Lab has certainly hired, you know,\n\n56:52.120 --> 56:55.400\n people like Ed Boyden and others who have done,\n\n56:55.400 --> 56:56.820\n you know, very different things.\n\n56:56.820 --> 57:00.480\n And so I think that, you know, that's part of the vision\n\n57:00.480 --> 57:03.560\n of the leadership who do things like that.\n\n57:03.560 --> 57:07.320\n Do you think one day, you've mentioned David Koch and cancer,\n\n57:07.320 --> 57:10.520\n do you think one day we'll cure cancer?\n\n57:10.520 --> 57:12.240\n Yeah, I mean, of course, one day,\n\n57:12.240 --> 57:14.280\n I don't know how long that day will come.\n\n57:14.280 --> 57:15.120\n Soon.\n\n57:15.120 --> 57:17.520\n Yeah, soon, soon, no, but I think.\n\n57:17.520 --> 57:19.200\n So you think it is a grand challenge,\n\n57:19.200 --> 57:20.120\n it is a grand challenge,\n\n57:20.120 --> 57:22.680\n it's not just solvable within a few years.\n\n57:22.680 --> 57:24.460\n No, I don't think very many things\n\n57:24.460 --> 57:25.940\n are solvable in a few years.\n\n57:25.940 --> 57:28.580\n There's some good ideas that people are working on,\n\n57:28.580 --> 57:31.100\n but I mean, all cancers, that's pretty tough.\n\n57:32.160 --> 57:35.000\n If we do get the cure, what will the cure look like?\n\n57:35.000 --> 57:37.260\n Do you think which mechanisms,\n\n57:37.260 --> 57:40.200\n which disciplines will help us arrive at that cure\n\n57:40.200 --> 57:42.680\n from all the amazing work you've done\n\n57:42.680 --> 57:44.000\n that has touched on cancer?\n\n57:44.000 --> 57:45.520\n No, I think it'll be a combination\n\n57:45.520 --> 57:46.800\n of biology and engineering.\n\n57:46.800 --> 57:50.440\n I think it'll be biology to understand\n\n57:50.440 --> 57:54.040\n the right genetic mechanisms to solve this problem\n\n57:54.040 --> 57:56.400\n and maybe the right immunological mechanisms\n\n57:56.400 --> 58:00.400\n and engineering in the sense of producing the molecules,\n\n58:00.400 --> 58:02.200\n developing the right delivery systems,\n\n58:02.200 --> 58:04.560\n targeting it or whatever else needs to be done.\n\n58:05.680 --> 58:08.920\n Well, that's a beautiful vision for engineering.\n\n58:08.920 --> 58:11.880\n So on a lighter topic, I've read that you love chocolate\n\n58:11.880 --> 58:16.880\n and mentioned two places, Ben and Bill's Chocolate Aquarium\n\n58:16.920 --> 58:20.280\n and the chocolate cookies, the Soho Globs\n\n58:20.280 --> 58:22.620\n from Rosie's Bakery in Chestnut Hill.\n\n58:22.620 --> 58:25.400\n I went to their website and I was trying\n\n58:25.400 --> 58:26.960\n to finish a paper last night.\n\n58:26.960 --> 58:30.700\n There's a deadline today and yet I was wasting\n\n58:30.700 --> 58:34.200\n way too much time at 3 a.m. instead of writing the paper,\n\n58:34.200 --> 58:36.400\n staring at the Rosie Baker's cookies,\n\n58:36.400 --> 58:38.320\n which are just look incredible.\n\n58:38.320 --> 58:40.680\n The Soho Globs just look incredible.\n\n58:40.680 --> 58:44.680\n But for me, oatmeal white raisin cookies won my heart\n\n58:44.680 --> 58:46.460\n just from the pictures.\n\n58:46.460 --> 58:49.040\n Do you think one day we'll be able to engineer\n\n58:49.040 --> 58:52.900\n the perfect cookie with the help of chemistry\n\n58:52.900 --> 58:55.440\n and maybe a bit of data driven artificial intelligence\n\n58:55.440 --> 59:00.440\n or is cookies something that's more art than engineering?\n\n59:02.480 --> 59:03.600\n I think there's some of both.\n\n59:03.600 --> 59:06.040\n I think engineering will probably help someday.\n\n59:06.960 --> 59:08.640\n What about chocolate?\n\n59:08.640 --> 59:09.900\n Same thing, same thing.\n\n59:09.900 --> 59:12.840\n You'd have to go to see some of David Edwards stuff.\n\n59:12.840 --> 59:15.840\n He was one of my postdocs and he's a professor at Harvard\n\n59:15.840 --> 59:18.520\n but he also started Cafe Art Sciences\n\n59:18.520 --> 59:22.440\n and it's just a really cool restaurant around here.\n\n59:22.440 --> 59:26.960\n But he also has companies that do ways\n\n59:26.960 --> 59:30.360\n of looking at fragrances and trying to use engineering\n\n59:30.360 --> 59:34.280\n in new ways and so I think that's just an example.\n\n59:34.280 --> 59:38.200\n But I expect someday that AI and engineering\n\n59:38.200 --> 59:40.920\n will play a role in almost everything.\n\n59:40.920 --> 59:42.640\n Including creating the perfect cookie.\n\n59:42.640 --> 59:43.480\n Yes.\n\n59:43.480 --> 59:45.240\n Well, I dream of that day as well.\n\n59:45.240 --> 59:47.760\n So when you look back at your life,\n\n59:47.760 --> 59:50.640\n having accomplished an incredible amount of positive impact\n\n59:50.640 --> 59:53.600\n on the world through science and engineering,\n\n59:53.600 --> 59:56.320\n what are you most proud of?\n\n59:56.320 --> 59:59.400\n My students, I really feel when I look at that,\n\n59:59.400 --> 1:00:02.320\n we've probably had close to 1,000 students\n\n1:00:02.320 --> 1:00:06.760\n go through the lab and they've done incredibly well.\n\n1:00:06.760 --> 1:00:09.720\n I think 18 are in the National Academy of Engineering,\n\n1:00:09.720 --> 1:00:12.280\n 16 in the National Academy of Medicine.\n\n1:00:12.280 --> 1:00:15.280\n I mean, they've been CEOs of companies,\n\n1:00:15.280 --> 1:00:19.460\n presidents of universities and they've done,\n\n1:00:19.460 --> 1:00:21.200\n I think eight are faculty at MIT,\n\n1:00:21.200 --> 1:00:22.940\n maybe about 12 at Harvard.\n\n1:00:22.940 --> 1:00:25.680\n I mean, so it really makes you feel good\n\n1:00:25.680 --> 1:00:28.780\n to think that the people, they're not my children\n\n1:00:28.780 --> 1:00:31.200\n but they're close to my children in a way\n\n1:00:31.200 --> 1:00:32.720\n and it makes you feel really good\n\n1:00:32.720 --> 1:00:34.660\n to see them have such great lives\n\n1:00:34.660 --> 1:00:36.800\n and them do so much good and be happy.\n\n1:00:37.760 --> 1:00:40.080\n Well, I think that's a perfect way to end it, Bob.\n\n1:00:40.080 --> 1:00:41.160\n Thank you so much for talking to me.\n\n1:00:41.160 --> 1:00:41.980\n My pleasure.\n\n1:00:41.980 --> 1:00:42.820\n It was an honor.\n\n1:00:42.820 --> 1:00:43.660\n Good questions.\n\n1:00:43.660 --> 1:00:44.480\n Thank you.\n\n1:00:44.480 --> 1:00:48.000\n Thanks for listening to this conversation with Bob Langer\n\n1:00:48.000 --> 1:00:52.120\n and thank you to our sponsors, Cash App and Masterclass.\n\n1:00:52.120 --> 1:00:53.980\n Please consider supporting the podcast\n\n1:00:53.980 --> 1:00:58.640\n by downloading Cash App and using code LexPodcast\n\n1:00:58.640 --> 1:01:02.720\n and signing up at masterclass.com slash Lex.\n\n1:01:02.720 --> 1:01:05.360\n Click on the links, buy all the stuff.\n\n1:01:05.360 --> 1:01:07.240\n It's the best way to support this podcast\n\n1:01:07.240 --> 1:01:11.240\n and the journey I'm on in my research and startup.\n\n1:01:11.240 --> 1:01:13.840\n If you enjoy this thing, subscribe on YouTube,\n\n1:01:13.840 --> 1:01:16.140\n review it with 5,000 Apple Podcast,\n\n1:01:16.140 --> 1:01:19.080\n support it on Patreon or connect with me on Twitter\n\n1:01:19.080 --> 1:01:24.080\n at Lex Friedman, spelled without the E, just F R I D M A N.\n\n1:01:25.360 --> 1:01:28.080\n And now let me leave you with some words from Bill Bryson\n\n1:01:28.080 --> 1:01:31.120\n in his book, A Short History of Nearly Everything.\n\n1:01:31.120 --> 1:01:33.880\n If this book has a lesson,\n\n1:01:33.880 --> 1:01:36.480\n it is that we're awfully lucky to be here.\n\n1:01:36.480 --> 1:01:39.640\n And by we, I mean every living thing.\n\n1:01:39.640 --> 1:01:42.500\n To attain any kind of life in this universe of ours\n\n1:01:42.500 --> 1:01:44.800\n appears to be quite an achievement.\n\n1:01:44.800 --> 1:01:47.460\n As humans, we're doubly lucky, of course.\n\n1:01:47.460 --> 1:01:50.080\n We enjoy not only the privilege of existence,\n\n1:01:50.080 --> 1:01:53.460\n but also the singular ability to appreciate it\n\n1:01:53.460 --> 1:01:57.600\n and even in a multitude of ways to make it better.\n\n1:01:57.600 --> 1:02:01.800\n It is talent we have only barely begun to grasp.\n\n1:02:01.800 --> 1:02:28.800\n Thank you for listening and hope to see you next time.\n\n"
}