{
  "title": "Manolis Kellis: Biology of Disease | Lex Fridman Podcast #133",
  "id": "Aq9UPIXbtKI",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.640\n The following is a conversation with Manolis Kellis, his third time on the podcast.\n\n00:05.640 --> 00:11.380\n He is a professor at MIT and head of the MIT Computational Biology Group.\n\n00:11.380 --> 00:17.160\n This time we went deep on the science, biology, and genetics.\n\n00:17.160 --> 00:19.920\n So this is a bit of an experiment.\n\n00:19.920 --> 00:25.120\n Manolis went back and forth between the basics of biology to the latest state of the art\n\n00:25.120 --> 00:26.120\n in the research.\n\n00:26.120 --> 00:31.240\n He's a master at this, so I just sat back and enjoyed the ride.\n\n00:31.240 --> 00:37.400\n This conversation happened at 7am, so it's yet another podcast episode after an all nighter\n\n00:37.400 --> 00:38.400\n for me.\n\n00:38.400 --> 00:44.040\n And once again, since the universe has a sense of humor, this one was a tough one for my\n\n00:44.040 --> 00:50.480\n brain to keep up, but I did my best and I never shy away from a good challenge.\n\n00:50.480 --> 00:55.960\n Quick mention of each sponsor, followed by some thoughts related to the episode.\n\n00:55.960 --> 01:02.160\n First is SEMrush, the most advanced SEO optimization tool I've ever come across.\n\n01:02.160 --> 01:08.920\n I don't like looking at numbers, but someone probably should, it helps you make good decisions.\n\n01:08.920 --> 01:13.920\n Second is Pessimist Archive, they're back, one of my favorite history podcasts on why\n\n01:13.920 --> 01:20.840\n people resist new things from recorded music to umbrellas to cars, chess, coffee, and the\n\n01:20.840 --> 01:22.460\n elevator.\n\n01:22.460 --> 01:28.320\n Third is 8sleep, a mattress that cools itself, measures heart rate variability, has an app,\n\n01:28.320 --> 01:33.160\n and has given me yet another reason to look forward to sleep, including the all important\n\n01:33.160 --> 01:34.840\n power nap.\n\n01:34.840 --> 01:40.080\n And finally, BetterHelp, online therapy when you want to face your demons with a licensed\n\n01:40.080 --> 01:45.440\n professional, not just by doing the David Goggins like physical challenges like I seem\n\n01:45.440 --> 01:47.960\n to do on occasion.\n\n01:47.960 --> 01:54.200\n Please check out these sponsors in the description to get a discount and to support this podcast.\n\n01:54.200 --> 01:59.280\n As a side note, let me say that biology in the brain and in the various systems of the\n\n01:59.280 --> 02:05.800\n body fill me with awe every time I think about how such a chaotic mess coming from its humble\n\n02:05.800 --> 02:11.940\n origins in the ocean was able to achieve such incredibly complex and robust mechanisms of\n\n02:11.940 --> 02:17.920\n life that survived despite all the forces of nature that want to destroy it.\n\n02:17.920 --> 02:22.920\n It is so unlike the computing systems we humans have engineered that it makes me feel that\n\n02:22.920 --> 02:28.420\n in order to create artificial general intelligence and artificial consciousness, we may have\n\n02:28.420 --> 02:33.560\n to completely rethink how we engineer computational systems.\n\n02:33.560 --> 02:38.520\n If you enjoy this thing, subscribe on YouTube, review it with 5 stars on Apple Podcast, follow\n\n02:38.520 --> 02:44.880\n on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n02:44.880 --> 02:49.760\n And now, here's my conversation with Manolis Callas.\n\n02:49.760 --> 02:54.880\n So your group at MIT is trying to understand the molecular basis of human disease.\n\n02:54.880 --> 02:57.720\n What are some of the biggest challenges in your view?\n\n02:57.720 --> 02:58.720\n Don't get me started.\n\n02:58.720 --> 03:06.240\n I mean, understanding human disease is the most complex challenge in modern science.\n\n03:06.240 --> 03:13.340\n So because human disease is as complex as the human genome, it is as complex as the\n\n03:13.340 --> 03:20.680\n human brain, and it is in many ways, even more complex because the more we understand\n\n03:20.680 --> 03:27.000\n disease complexity, the more we start understanding genome complexity and epigenome complexity\n\n03:27.000 --> 03:31.200\n and brain circuitry complexity and immune system complexity and cancer complexity and\n\n03:31.200 --> 03:32.280\n so on and so forth.\n\n03:32.280 --> 03:39.400\n So traditionally, human disease was following basic biology.\n\n03:39.400 --> 03:44.360\n You would basically understand basic biology in model organisms like, you know, mouse and\n\n03:44.360 --> 03:46.040\n fly and yeast.\n\n03:46.040 --> 03:53.400\n You would understand sort of mammalian biology and animal biology and eukaryotic biology\n\n03:53.400 --> 03:59.920\n in sort of progressive layers of complexity, getting closer to human phylogenetically.\n\n03:59.920 --> 04:06.640\n And you would do perturbation experiments in those species to see if I knock out a gene,\n\n04:06.640 --> 04:07.960\n what happens?\n\n04:07.960 --> 04:12.720\n And based on the knocking out of these genes, you would basically then have a way to drive\n\n04:12.720 --> 04:16.880\n human biology because you would sort of understand the functions of these genes.\n\n04:16.880 --> 04:23.660\n And then if you find that a human gene locus, something that you've mapped from human genetics\n\n04:23.660 --> 04:28.760\n to that gene is related to a particular human disease, you'd say, aha, now I know the function\n\n04:28.760 --> 04:31.440\n of the gene from the model organisms.\n\n04:31.440 --> 04:37.120\n I can now go and understand the function of that gene in human.\n\n04:37.120 --> 04:38.320\n But this is all changing.\n\n04:38.320 --> 04:39.440\n This is dramatically changed.\n\n04:39.440 --> 04:41.760\n So that was the old way of doing basic biology.\n\n04:41.760 --> 04:46.280\n You would start with the animal models, the eukaryotic models, the mammalian models, and\n\n04:46.280 --> 04:48.680\n then you would go to human.\n\n04:48.680 --> 04:55.320\n Human genetics has been so transformed in the last decade or two that human genetics\n\n04:55.320 --> 04:58.420\n is now actually driving the basic biology.\n\n04:58.420 --> 05:04.300\n There is more genetic mutation information in the human genome than there will ever be\n\n05:04.300 --> 05:06.240\n in any other species.\n\n05:06.240 --> 05:08.440\n What do you mean by mutation information?\n\n05:08.440 --> 05:11.380\n So perturbations is how you understand systems.\n\n05:11.380 --> 05:16.120\n So an engineer builds systems and then they know how they work from the inside out.\n\n05:16.120 --> 05:20.360\n A scientist studies systems through perturbations.\n\n05:20.360 --> 05:23.040\n You basically say, if I poke that balloon, what's going to happen?\n\n05:23.040 --> 05:26.480\n And I'm going to film it in super high resolution, understand, I don't know, aerodynamics or\n\n05:26.480 --> 05:28.840\n fluid dynamics if it's filled with water, et cetera.\n\n05:28.840 --> 05:33.960\n So you can then make experimentation by perturbation and then the scientific process is sort of\n\n05:33.960 --> 05:41.120\n building models that best fit the data, designing new experiments that best test your models\n\n05:41.120 --> 05:43.320\n and challenge your models and so on and so forth.\n\n05:43.320 --> 05:44.800\n This is the same thing with science.\n\n05:44.800 --> 05:49.440\n Basically if you're trying to understand biological science, you basically want to do perturbations\n\n05:49.440 --> 05:54.600\n that then drive the models.\n\n05:54.600 --> 05:58.320\n So how do these perturbations allow you to understand disease?\n\n05:58.320 --> 06:04.120\n So if you know that a gene is related to disease, you don't want to just know that it's related\n\n06:04.120 --> 06:05.120\n to the disease.\n\n06:05.120 --> 06:09.960\n You want to know what is the disease mechanism because you want to go and intervene.\n\n06:09.960 --> 06:17.240\n So the way that I like to describe it is that traditionally epidemiology, which is basically\n\n06:17.240 --> 06:23.000\n the study of disease, you know, sort of the observational study of disease has been about\n\n06:23.000 --> 06:25.760\n correlating one thing with another thing.\n\n06:25.760 --> 06:29.880\n So if you have a lot of people with liver disease who are also alcoholics, you might\n\n06:29.880 --> 06:34.360\n say, well, maybe the alcoholism is driving the liver disease or maybe those who have\n\n06:34.360 --> 06:36.780\n liver disease self medicate with alcohol.\n\n06:36.780 --> 06:40.120\n So the connection could be either way.\n\n06:40.120 --> 06:47.640\n With genetic epidemiology, it's about correlating changes in genome with phenotypic differences\n\n06:47.640 --> 06:50.120\n and then you know the direction of causality.\n\n06:50.120 --> 06:58.120\n So if you know that a particular gene is related to the disease, you can basically say, okay,\n\n06:58.120 --> 07:03.860\n perturbing that gene in mouse causes the mice to have X phenotype.\n\n07:03.860 --> 07:08.240\n So perturbing that gene in human causes the humans to have the disease.\n\n07:08.240 --> 07:14.680\n So I can now figure out what are the detailed molecular phenotypes in the human that are\n\n07:14.680 --> 07:18.820\n related to that organismal phenotype in the disease.\n\n07:18.820 --> 07:22.960\n So it's all about understanding disease mechanism, understanding what are the pathways, what\n\n07:22.960 --> 07:27.560\n are the tissues, what are the processes that are associated with the disease so that we\n\n07:27.560 --> 07:29.000\n know how to intervene.\n\n07:29.000 --> 07:33.360\n You can then prescribe particular medications that also alter these processes.\n\n07:33.360 --> 07:37.920\n You can prescribe lifestyle changes that also affect these processes and so on and so forth.\n\n07:37.920 --> 07:41.040\n That's such a beautiful puzzle to try to solve.\n\n07:41.040 --> 07:45.480\n Like what kind of perturbations eventually have this ripple effect that leads to disease\n\n07:45.480 --> 07:46.480\n across the population.\n\n07:46.480 --> 07:51.880\n And then you study that for animals or mice first and then see how that might possibly\n\n07:51.880 --> 07:54.680\n connect to humans.\n\n07:54.680 --> 08:01.340\n How hard is that puzzle of trying to figure out how little perturbations might lead to,\n\n08:01.340 --> 08:04.200\n in a stable way, to a disease?\n\n08:04.200 --> 08:11.040\n In animals, we make the puzzle simpler because we perturb one gene at a time.\n\n08:11.040 --> 08:13.500\n That's the beauty of this, the power of animal models.\n\n08:13.500 --> 08:15.800\n You can basically decouple the perturbations.\n\n08:15.800 --> 08:21.240\n You only do one perturbation and you only do strong perturbations at a time.\n\n08:21.240 --> 08:28.600\n In human, the puzzle is incredibly complex because obviously you don't do human experimentation.\n\n08:28.600 --> 08:34.720\n You wait for natural selection and natural genetic variation to basically do its own\n\n08:34.720 --> 08:40.560\n experiments, which it has been doing for hundreds and thousands of years in the human population\n\n08:40.560 --> 08:49.320\n and for hundreds of thousands of years across the history leading to the human population.\n\n08:49.320 --> 08:54.440\n So you basically take this natural genetic variation that we all carry within us.\n\n08:54.440 --> 08:58.280\n Every one of us carries 6 million perturbations.\n\n08:58.280 --> 09:02.920\n So I've done 6 million experiments on you, 6 million experiments on me, 6 million experiments\n\n09:02.920 --> 09:06.400\n on every one of 7 billion people on the planet.\n\n09:06.400 --> 09:08.600\n What's the 6 million correspond to?\n\n09:08.600 --> 09:14.840\n 6 million unique genetic variants that are segregating in the human population.\n\n09:14.840 --> 09:22.880\n Every one of us carries millions of polymorphic sites, poly, many, morph, forms.\n\n09:22.880 --> 09:25.080\n Polymorphic means many forms, variants.\n\n09:25.080 --> 09:29.560\n That basically means that every one of us has single nucleotide alterations that we\n\n09:29.560 --> 09:34.680\n have inherited from mom and from dad that basically can be thought of as tiny little\n\n09:34.680 --> 09:36.320\n perturbations.\n\n09:36.320 --> 09:42.480\n Most of them don't do anything, but some of them lead to all of the phenotypic differences\n\n09:42.480 --> 09:43.920\n that we see between us.\n\n09:43.920 --> 09:48.960\n The reason why two twins are identical is because these variants completely determine\n\n09:48.960 --> 09:52.520\n the way that I'm going to look at exactly 93 years of age.\n\n09:52.520 --> 09:54.720\n How happy are you with this kind of data set?\n\n09:54.720 --> 09:59.240\n Is it large enough of the human population of Earth?\n\n09:59.240 --> 10:01.680\n Is that too big, too small?\n\n10:01.680 --> 10:07.360\n Yeah, so is it large enough is a power analysis question.\n\n10:07.360 --> 10:11.440\n In every one of our grants, we do a power analysis based on what is the effect size\n\n10:11.440 --> 10:19.200\n that I would like to detect and what is the natural variation in the two forms.\n\n10:19.200 --> 10:25.240\n Every time you do a perturbation, you're asking, I'm changing form A into form B. Form A has\n\n10:25.240 --> 10:30.160\n some natural phenotypic variation around it and form B has some natural phenotypic variation\n\n10:30.160 --> 10:31.240\n around it.\n\n10:31.240 --> 10:36.200\n If those variances are large and the differences between the mean of A and the mean of B are\n\n10:36.200 --> 10:38.920\n small, then you have very little power.\n\n10:38.920 --> 10:44.600\n The further the means go apart, that's the effect size, the more power you have, and\n\n10:44.600 --> 10:48.760\n the smaller the standard deviation, the more power you have.\n\n10:48.760 --> 10:54.440\n So basically when you're asking, is that sufficiently large, certainly not for everything, but we\n\n10:54.440 --> 11:01.240\n already have enough power for many of the stronger effects in the more tight distributions.\n\n11:01.240 --> 11:09.840\n So that's the hopeful message that there exists parts of the genome that have a strong effect\n\n11:09.840 --> 11:13.200\n that has a small variance.\n\n11:13.200 --> 11:14.200\n That's exactly right.\n\n11:14.200 --> 11:18.400\n Unfortunately, those perturbations are the basis of disease in many cases.\n\n11:18.400 --> 11:20.800\n So it's not a hopeful message.\n\n11:20.800 --> 11:22.720\n Sometimes it's a terrible message.\n\n11:22.720 --> 11:27.880\n It's basically, well, some people are sick, but if we can figure out what are these contributors\n\n11:27.880 --> 11:32.760\n to sickness, we can then help make them better and help many other people better who don't\n\n11:32.760 --> 11:38.960\n carry that exact mutation, but who carry mutations on the same pathways.\n\n11:38.960 --> 11:42.800\n And that's what we like to call the allelic series of a gene.\n\n11:42.800 --> 11:49.580\n You basically have many perturbations of the same gene in different people, each with a\n\n11:49.580 --> 11:55.200\n different frequency in the human population and each with a different effect on the individual\n\n11:55.200 --> 11:56.200\n that carries them.\n\n11:56.200 --> 12:03.000\n So you said in the past there would be these small experiments on perturbations and animal\n\n12:03.000 --> 12:04.000\n models.\n\n12:04.000 --> 12:08.400\n What does this puzzle solving process look like today?\n\n12:08.400 --> 12:13.180\n So we basically have something like 7 billion people in the planet and every one of them\n\n12:13.180 --> 12:16.760\n carries something like 6 million mutations.\n\n12:16.760 --> 12:25.000\n You basically have an enormous matrix of genotype by phenotype by systematically measuring the\n\n12:25.000 --> 12:27.960\n phenotype of these individuals.\n\n12:27.960 --> 12:32.640\n And the traditional way of measuring this phenotype has been to look at one trait at\n\n12:32.640 --> 12:33.700\n a time.\n\n12:33.700 --> 12:40.160\n You would gather families and you would sort of paint the pedigrees of a strong effect,\n\n12:40.160 --> 12:47.320\n what we like to call Mendelian mutation, so a mutation that gets transmitted in a dominant\n\n12:47.320 --> 12:53.240\n or a recessive, but strong effect form where basically one locus plays a very big role\n\n12:53.240 --> 12:54.240\n in that disease.\n\n12:54.240 --> 12:59.560\n And you could then look at carriers versus non carriers in one family, carriers versus\n\n12:59.560 --> 13:04.480\n non carriers in another family and do that for hundreds, sometimes thousands of families\n\n13:04.480 --> 13:08.360\n and then trace these inheritance patterns and then figure out what is the gene that\n\n13:08.360 --> 13:09.500\n plays that role.\n\n13:09.500 --> 13:14.420\n Is this the matrix that you're showing in talks or lectures?\n\n13:14.420 --> 13:21.000\n So that matrix is the input to those stuff that I show in talks.\n\n13:21.000 --> 13:24.980\n So basically that matrix has traditionally been strong effect genes.\n\n13:24.980 --> 13:29.880\n What the matrix looks like now is instead of pedigrees, instead of families, you basically\n\n13:29.880 --> 13:36.720\n have thousands and sometimes hundreds of thousands of unrelated individuals, each with all of\n\n13:36.720 --> 13:43.520\n their genetic variants and each with their phenotype, for example, height or lipids or,\n\n13:43.520 --> 13:48.080\n you know, whether they're sick or not for a particular trait.\n\n13:48.080 --> 13:53.080\n That has been the modern view instead of going to families, going to unrelated individuals\n\n13:53.080 --> 13:55.760\n with one phenotype at a time.\n\n13:55.760 --> 14:00.960\n And what we're doing now as we're maturing in all of these sciences is that we're doing\n\n14:00.960 --> 14:07.960\n this in the context of large medical systems or enormous cohorts that are very well phenotyped\n\n14:07.960 --> 14:13.720\n across hundreds of phenotypes, sometimes with our complete electronic health record.\n\n14:13.720 --> 14:19.640\n So you can now start relating not just one gene segregating one family, not just thousands\n\n14:19.640 --> 14:25.080\n of variants segregating with one phenotype, but now you can do millions of variants versus\n\n14:25.080 --> 14:27.120\n hundreds of phenotypes.\n\n14:27.120 --> 14:33.880\n And as a computer scientist, I mean, deconvolving that matrix, partitioning it into the layers\n\n14:33.880 --> 14:40.160\n of biology that are associated with every one of these elements is a dream come true.\n\n14:40.160 --> 14:42.840\n It's like the world's greatest puzzle.\n\n14:42.840 --> 14:50.120\n And you can now solve that puzzle by throwing in more and more knowledge about the function\n\n14:50.120 --> 14:56.520\n of different genomic regions and how these functions are changed across tissues and in\n\n14:56.520 --> 14:58.100\n the context of disease.\n\n14:58.100 --> 15:00.720\n And that's what my group and many other groups are doing.\n\n15:00.720 --> 15:05.760\n We're trying to systematically relate this genetic variation with molecular variation\n\n15:05.760 --> 15:12.700\n at the expression level of the genes, at the epigenomic level of the gene regulatory circuitry,\n\n15:12.700 --> 15:17.020\n and at the cellular level of what are the functions that are happening in those cells,\n\n15:17.020 --> 15:22.340\n at the single cell level using single cell profiling, and then relate all that vast amount\n\n15:22.340 --> 15:29.160\n of knowledge computationally with the thousands of traits that each of these of thousands\n\n15:29.160 --> 15:30.800\n of variants are perturbing.\n\n15:30.800 --> 15:34.280\n I mean, this is something we talked about, I think last time.\n\n15:34.280 --> 15:36.480\n So there's these effects at different levels that happen.\n\n15:36.480 --> 15:42.800\n You said at a single cell level, you're trying to see things that happen due to certain perturbations.\n\n15:42.800 --> 15:49.560\n And then it's not just like a puzzle of perturbation and disease.\n\n15:49.560 --> 15:57.660\n It's perturbation then effect at a cellular level, then at an organ level, a body, like,\n\n15:57.660 --> 16:02.760\n how do you disassemble this into like what your group is working on?\n\n16:02.760 --> 16:06.560\n You're basically taking a bunch of the hard problems in the space.\n\n16:06.560 --> 16:13.520\n How do you break apart a difficult disease and break it apart into problems that you,\n\n16:13.520 --> 16:15.520\n into puzzles that you can now start solving?\n\n16:15.520 --> 16:17.380\n So there's a struggle here.\n\n16:17.380 --> 16:22.120\n Super scientists love hard puzzles and they're like, oh, I want to build a method that just\n\n16:22.120 --> 16:24.920\n deconvolves the whole thing computationally.\n\n16:24.920 --> 16:31.640\n And that's very tempting and it's very appealing, but biologists just like to decouple that\n\n16:31.640 --> 16:36.080\n complexity experimentally, to just like peel off layers of complexity experimentally.\n\n16:36.080 --> 16:40.380\n And that's what many of these modern tools that my group and others have both developed\n\n16:40.380 --> 16:41.600\n and used.\n\n16:41.600 --> 16:46.760\n The fact that we can now figure out tricks for peeling off these layers of complexity\n\n16:46.760 --> 16:53.080\n by testing one cell type at a time or by testing one cell at a time.\n\n16:53.080 --> 16:56.380\n And you could basically say, what is the effect of these genetic variants associated with\n\n16:56.380 --> 16:59.360\n Alzheimer's on human brain?\n\n16:59.360 --> 17:04.320\n Human brain sounds like, oh, it's an organ, of course, just go one organ at a time.\n\n17:04.320 --> 17:09.500\n But human brain has of course, dozens of different brain regions and within each of these brain\n\n17:09.500 --> 17:15.080\n regions, dozens of different cell types and every single type of neuron, every single\n\n17:15.080 --> 17:24.160\n type of glial cell between astrocytes, oligodendrocytes, microglia, between all of the neural cells\n\n17:24.160 --> 17:29.880\n and the vascular cells and the immune cells that are co inhabiting the brain between the\n\n17:29.880 --> 17:34.440\n different types of excitatory and inhibitory neurons that are sort of interacting with\n\n17:34.440 --> 17:39.300\n each other between different layers of neurons in the cortical layers.\n\n17:39.300 --> 17:47.920\n Every single one of these has a different type of function to play in cognition, in\n\n17:47.920 --> 17:55.280\n interaction with the environment, in maintenance of the brain, in energetic needs, in feeding\n\n17:55.280 --> 18:01.680\n the brain with blood, with oxygen, in clearing out the debris that are resulting from the\n\n18:01.680 --> 18:06.940\n super high energy production of cognition in humans.\n\n18:06.940 --> 18:17.040\n So all of these things are basically potentially deconvolvable computationally, but experimentally,\n\n18:17.040 --> 18:21.640\n you can just do single cell profiling of dozens of regions of the brain across hundreds of\n\n18:21.640 --> 18:24.640\n individuals across millions of cells.\n\n18:24.640 --> 18:31.440\n And then now you have pieces of the puzzle that you can then put back together to understand\n\n18:31.440 --> 18:32.440\n that complexity.\n\n18:32.440 --> 18:39.400\n I mean, first of all, the cells in the human brain are the most, maybe I'm romanticizing\n\n18:39.400 --> 18:42.520\n it, but cognition seems to be very complicated.\n\n18:42.520 --> 18:53.520\n So separating into the function, breaking Alzheimer's down to the cellular level seems\n\n18:53.520 --> 18:56.340\n very challenging.\n\n18:56.340 --> 19:05.200\n Is that basically you're trying to find a way that some perturbation in the genome results\n\n19:05.200 --> 19:11.920\n in some obvious major dysfunction in the cell.\n\n19:11.920 --> 19:14.400\n You're trying to find something like that.\n\n19:14.400 --> 19:15.400\n Exactly.\n\n19:15.400 --> 19:17.120\n So what does human genetics do?\n\n19:17.120 --> 19:21.640\n Human genetics basically looks at the whole path from genetic variation all the way to\n\n19:21.640 --> 19:22.640\n disease.\n\n19:22.640 --> 19:31.640\n So human genetics has basically taken thousands of Alzheimer's cases and thousands of controls\n\n19:31.640 --> 19:38.440\n matched for age, for sex, for environmental backgrounds and so on and so forth.\n\n19:38.440 --> 19:44.500\n And then looked at that map where you're asking, what are the individual genetic perturbations\n\n19:44.500 --> 19:48.520\n and how are they related to all the way to Alzheimer's disease?\n\n19:48.520 --> 19:51.280\n And that has actually been quite successful.\n\n19:51.280 --> 19:57.680\n So we now have more than 27 different loci, these are genomic regions that are associated\n\n19:57.680 --> 20:02.420\n with Alzheimer's at these end to end level.\n\n20:02.420 --> 20:07.400\n But the moment you sort of break up that very long path into smaller levels, you can basically\n\n20:07.400 --> 20:13.480\n say from genetics, what are the epigenomic alterations at the level of gene regulatory\n\n20:13.480 --> 20:19.160\n elements where that genetic variant perturbs the control region nearby.\n\n20:19.160 --> 20:21.840\n That effect is much larger.\n\n20:21.840 --> 20:25.480\n You mean much larger in terms of this down the line impact or?\n\n20:25.480 --> 20:31.120\n It's much larger in terms of the measurable effect, this A versus B variance is actually\n\n20:31.120 --> 20:35.800\n so much cleanly defined when you go to the shorter branches.\n\n20:35.800 --> 20:40.760\n Because for one genetic variant to affect Alzheimer's, that's a very long path.\n\n20:40.760 --> 20:43.940\n That basically means that in the context of millions of these 6 million variants that\n\n20:43.940 --> 20:51.040\n every one of us carries, that one single nucleotide has a detectable effect all the way to the\n\n20:51.040 --> 20:52.040\n end.\n\n20:52.040 --> 20:57.700\n I mean, it's just mind boggling that that's even possible, but indeed there are such effects.\n\n20:57.700 --> 21:03.000\n So the hope is, or the most scientifically speaking, the most effective place where to\n\n21:03.000 --> 21:10.640\n detect the alteration that results in disease is earlier on in the pipeline, as early as\n\n21:10.640 --> 21:11.640\n possible.\n\n21:11.640 --> 21:12.680\n It's a trade off.\n\n21:12.680 --> 21:17.800\n If you go very early on in the pipeline, now each of these epigenomic alterations, for\n\n21:17.800 --> 21:25.500\n example, this enhancer control region is active maybe 50% less, which is a dramatic effect.\n\n21:25.500 --> 21:29.680\n Now you can ask, well, how much does changing one regulatory region in the genome in one\n\n21:29.680 --> 21:31.280\n cell type change disease?\n\n21:31.280 --> 21:33.920\n Well, that path is now long.\n\n21:33.920 --> 21:39.680\n So if you instead look at expression, the path between genetic variation and the expression\n\n21:39.680 --> 21:44.560\n of one gene goes through many enhancer regions, and therefore it's a subtler effect at the\n\n21:44.560 --> 21:45.560\n gene level.\n\n21:45.560 --> 21:51.360\n But then now you're closer because one gene is acting in the context of only 20,000 other\n\n21:51.360 --> 21:57.200\n genes as opposed to one enhancer acting in the context of 2 million other enhancers.\n\n21:57.200 --> 22:04.040\n So you basically now have genetic, epigenomic, the circuitry, transcriptomic, the gene expression\n\n22:04.040 --> 22:09.600\n control, and then cellular, where you can basically say, I can measure various properties\n\n22:09.600 --> 22:11.160\n of those cells.\n\n22:11.160 --> 22:17.560\n What is the calcium influx rate when I have this genetic variation?\n\n22:17.560 --> 22:19.760\n What is the synaptic density?\n\n22:19.760 --> 22:24.500\n What is the electric impulse conductivity and so on and so forth?\n\n22:24.500 --> 22:32.660\n So you can measure things along this path to disease, and you can also measure endophenotypes.\n\n22:32.660 --> 22:37.460\n You can basically measure your brain activity.\n\n22:37.460 --> 22:39.680\n You can do imaging in the brain.\n\n22:39.680 --> 22:44.440\n You can basically measure, I don't know, the heart rate, the pulse, the lipids, the amount\n\n22:44.440 --> 22:46.700\n of blood secreted and so on and so forth.\n\n22:46.700 --> 22:52.760\n And then through all of that, you can basically get at the path to causality, the path to\n\n22:52.760 --> 22:55.320\n disease.\n\n22:55.320 --> 22:57.680\n And is there something beyond cellular?\n\n22:57.680 --> 23:05.480\n So you mentioned lifestyle interventions or changes as a way to, or like be able to prescribe\n\n23:05.480 --> 23:07.840\n changes in lifestyle.\n\n23:07.840 --> 23:09.360\n Like what about organs?\n\n23:09.360 --> 23:13.200\n What about like the function of the body as a whole?\n\n23:13.200 --> 23:14.200\n Yeah, absolutely.\n\n23:14.200 --> 23:18.200\n So basically when you go to your doctor, they always measure, you know, your pulse.\n\n23:18.200 --> 23:19.200\n They always measure your height.\n\n23:19.200 --> 23:21.240\n They always measure your weight, you know, your BMI.\n\n23:21.240 --> 23:24.180\n So basically these are just very basic variables.\n\n23:24.180 --> 23:27.960\n But with digital devices nowadays, you can start measuring hundreds of variables for\n\n23:27.960 --> 23:29.600\n every individual.\n\n23:29.600 --> 23:37.300\n You can basically also phenotype cognitively through tests, Alzheimer's patients.\n\n23:37.300 --> 23:43.720\n There are cognitive tests that you can measure, that you typically do for cognitive decline,\n\n23:43.720 --> 23:48.500\n these mini mental observations that you have specific questions to.\n\n23:48.500 --> 23:51.980\n You can think of sort of enlarging the set of cognitive tests.\n\n23:51.980 --> 23:55.760\n So in the mouse, for example, you do experiments for how do they get out of mazes?\n\n23:55.760 --> 23:57.280\n How do they find food?\n\n23:57.280 --> 24:02.440\n Whether they recall a fear, whether they shake in a new environment and so on and so forth.\n\n24:02.440 --> 24:06.560\n In the human, you can have much, much richer phenotypes where you can basically say not\n\n24:06.560 --> 24:13.920\n just imaging at the organ level and all kinds of other activities at the organ level, but\n\n24:13.920 --> 24:19.480\n you can also do at the organism level, you can do behavioral tests.\n\n24:19.480 --> 24:21.120\n And how did they do on empathy?\n\n24:21.120 --> 24:22.920\n How did they do on memory?\n\n24:22.920 --> 24:26.160\n How did they do on longterm memory versus short term memory?\n\n24:26.160 --> 24:27.160\n And so on and so forth.\n\n24:27.160 --> 24:28.760\n I love how you're calling that phenotype.\n\n24:28.760 --> 24:29.760\n I guess it is.\n\n24:29.760 --> 24:31.040\n It is.\n\n24:31.040 --> 24:37.880\n But like your behavior patterns that might change over a period of a life, your ability\n\n24:37.880 --> 24:44.560\n to remember things, your ability to be empathetic or emotionally, your intelligence perhaps\n\n24:44.560 --> 24:45.560\n even.\n\n24:45.560 --> 24:47.160\n Yeah, but intelligence has hundreds of variables.\n\n24:47.160 --> 24:50.720\n You can be your math intelligence, your literary intelligence, your puzzle solving intelligence,\n\n24:50.720 --> 24:51.720\n your logic.\n\n24:51.720 --> 24:52.880\n It could be like hundreds of things.\n\n24:52.880 --> 24:57.440\n And all of that, we're able to measure that better and better and all that could be connected\n\n24:57.440 --> 24:58.920\n to the entire pipeline somehow.\n\n24:58.920 --> 25:01.840\n We used to think of each of these as a single variable like intelligence.\n\n25:01.840 --> 25:03.380\n I mean, that's ridiculous.\n\n25:03.380 --> 25:10.880\n It's basically dozens of different genes that are controlling every single variable.\n\n25:10.880 --> 25:16.040\n You can basically think of, imagine us in a video game where every one of us has measures\n\n25:16.040 --> 25:20.960\n of strength, stamina, energy left and so on and so forth.\n\n25:20.960 --> 25:24.440\n But you could click on each of those five bars that are just the main bars and each\n\n25:24.440 --> 25:28.560\n of those will just give you then hundreds of bars and can basically say, okay, great\n\n25:28.560 --> 25:36.200\n for my machine learning task, I want someone who, a human who has these particular forms\n\n25:36.200 --> 25:37.200\n of intelligence.\n\n25:37.200 --> 25:40.620\n I require now these 20 different things.\n\n25:40.620 --> 25:45.000\n And then you can combine those things and then relate them to of course performance\n\n25:45.000 --> 25:50.820\n in a particular task, but you can also relate them to genetic variation that might be affecting\n\n25:50.820 --> 25:52.800\n different parts of the brain.\n\n25:52.800 --> 25:56.600\n For example, your frontal cortex versus your temporal cortex versus your visual cortex\n\n25:56.600 --> 25:58.040\n and so on and so forth.\n\n25:58.040 --> 26:02.520\n So genetic variation that affects expression of genes in different parts of your brain\n\n26:02.520 --> 26:08.920\n can basically affect your music ability, your auditory ability, your smell, just dozens\n\n26:08.920 --> 26:15.980\n of different phenotypes can be broken down into hundreds of cognitive variables and then\n\n26:15.980 --> 26:20.520\n relate each of those to thousands of genes that are associated with them.\n\n26:20.520 --> 26:28.440\n So somebody who loves RPGs or playing games, there's too few variables that we can control.\n\n26:28.440 --> 26:32.680\n So I'm excited if we're in fact living in a simulation and this is a video game, I'm\n\n26:32.680 --> 26:37.240\n excited by the quality of the video game.\n\n26:37.240 --> 26:39.760\n The game designer did a hell of a good job.\n\n26:39.760 --> 26:40.760\n So we're impressed.\n\n26:40.760 --> 26:41.760\n Oh, I don't know.\n\n26:41.760 --> 26:43.800\n The sunset last night was a little unrealistic.\n\n26:43.800 --> 26:44.800\n Yeah.\n\n26:44.800 --> 26:45.800\n Yeah.\n\n26:45.800 --> 26:46.800\n The graphics.\n\n26:46.800 --> 26:47.800\n Exactly.\n\n26:47.800 --> 26:48.800\n Come on, NVIDIA.\n\n26:48.800 --> 26:54.480\n To zoom back out, we've been talking about the genetic origins of diseases, but I think\n\n26:54.480 --> 27:01.080\n it's fascinating to talk about what are the most important diseases to understand and\n\n27:01.080 --> 27:05.320\n especially as it connects to the things that you're working on.\n\n27:05.320 --> 27:08.840\n So it's very difficult to think about important diseases to understand.\n\n27:08.840 --> 27:10.500\n There's many metrics of importance.\n\n27:10.500 --> 27:12.360\n One is lifestyle impact.\n\n27:12.360 --> 27:16.440\n I mean, if you look at COVID, the impact on lifestyle has been enormous.\n\n27:16.440 --> 27:23.080\n So understanding COVID is important because it has impacted the wellbeing in terms of\n\n27:23.080 --> 27:27.280\n ability to have a job, ability to have an apartment, ability to go to work, ability\n\n27:27.280 --> 27:34.480\n to have a mental circle of support and all of that for millions of Americans, like huge,\n\n27:34.480 --> 27:35.520\n huge impact.\n\n27:35.520 --> 27:37.000\n So that's one aspect of importance.\n\n27:37.000 --> 27:42.480\n So basically mental disorders, Alzheimer's has a huge importance in the wellbeing of\n\n27:42.480 --> 27:44.040\n Americans.\n\n27:44.040 --> 27:48.220\n Whether or not it kills someone for many, many years, it has a huge impact.\n\n27:48.220 --> 27:52.360\n So the first measure of importance is just wellbeing.\n\n27:52.360 --> 27:53.780\n Impact on the quality of life.\n\n27:53.780 --> 27:55.860\n Impact on the quality of life, absolutely.\n\n27:55.860 --> 28:00.160\n The second metric, which is much easier to quantify is deaths.\n\n28:00.160 --> 28:01.920\n What is the number one killer?\n\n28:01.920 --> 28:04.760\n The number one killer is actually heart disease.\n\n28:04.760 --> 28:10.700\n It is actually killing 650,000 Americans per year.\n\n28:10.700 --> 28:14.280\n Number two is cancer with 600,000 Americans.\n\n28:14.280 --> 28:19.600\n Number three, far, far down the list is accidents, every single accident combined.\n\n28:19.600 --> 28:24.720\n So basically you read the news, accidents, like there was a huge car crash all over the\n\n28:24.720 --> 28:25.800\n news.\n\n28:25.800 --> 28:31.320\n But the number of deaths, number three by far, 167,000.\n\n28:31.320 --> 28:32.800\n Core respiratory disease.\n\n28:32.800 --> 28:39.160\n So that's asthma, not being able to breathe and so on and so forth, 160,000 Alzheimer's\n\n28:39.160 --> 28:45.040\n number five with 120,000 and then stroke, brain aneurysms and so on and so forth, that's\n\n28:45.040 --> 28:49.720\n 147,000 diabetes and metabolic disorders, et cetera.\n\n28:49.720 --> 28:51.140\n That's 85,000.\n\n28:51.140 --> 28:58.960\n The flu is 60,000, suicide, 50,000 and then overdose, et cetera, you know, goes further\n\n28:58.960 --> 29:00.120\n down the list.\n\n29:00.120 --> 29:06.620\n So of course COVID has creeped up to be the number three killer this year with, you know,\n\n29:06.620 --> 29:11.360\n more than 100,000 Americans and counting.\n\n29:11.360 --> 29:16.560\n And you know, but if you think about sort of what do we use, what are the most important\n\n29:16.560 --> 29:22.720\n diseases, you have to understand both the quality of life and the sheer number of deaths\n\n29:22.720 --> 29:25.560\n and just numbers of years lost if you wish.\n\n29:25.560 --> 29:30.960\n And each of these diseases you can think of as, and also including terrorist attacks and\n\n29:30.960 --> 29:39.200\n school shootings, for example, things which lead to fatalities, you can look at as problems\n\n29:39.200 --> 29:41.480\n that could be solved.\n\n29:41.480 --> 29:44.080\n And some problems are harder to solve than others.\n\n29:44.080 --> 29:46.860\n I mean, that's part of the equation.\n\n29:46.860 --> 29:52.960\n So maybe if you look at these diseases, if you look at heart disease or cancer or Alzheimer's\n\n29:52.960 --> 29:59.800\n or just like schizophrenia and obesity, Debbie, like not necessarily things that kill you,\n\n29:59.800 --> 30:05.480\n but affect the quality of life, which problems are solvable, which aren't, which are harder\n\n30:05.480 --> 30:07.280\n to solve, which aren't.\n\n30:07.280 --> 30:13.720\n I love your question because he puts it in the context of a global effort rather than\n\n30:13.720 --> 30:15.120\n just the local effort.\n\n30:15.120 --> 30:22.560\n So basically if you look at the global aspect, exercise and nutrition are two interventions\n\n30:22.560 --> 30:27.040\n that we can as a society make a much better job at.\n\n30:27.040 --> 30:33.080\n So if you think about sort of the availability of cheap food, it's extremely high in calories.\n\n30:33.080 --> 30:36.960\n It's extremely detrimental for you, like a lot of processed food, et cetera.\n\n30:36.960 --> 30:43.120\n So if we change that equation and as a society, we made availability of healthy food much,\n\n30:43.120 --> 30:52.520\n much easier and charged a burger at McDonald's, the price that it costs on the health system,\n\n30:52.520 --> 30:56.360\n then people would actually start buying more healthy foods.\n\n30:56.360 --> 30:59.600\n So basically that's sort of a societal intervention, if you wish.\n\n30:59.600 --> 31:06.580\n In the same way, increasing empathy, increasing education, increasing the social framework\n\n31:06.580 --> 31:10.040\n and support would basically lead to fewer suicides.\n\n31:10.040 --> 31:11.880\n It would lead to fewer murders.\n\n31:11.880 --> 31:15.880\n It would lead to fewer deaths overall.\n\n31:15.880 --> 31:19.100\n So that's something that we as a society can do.\n\n31:19.100 --> 31:21.940\n You can also think about external factors versus internal factors.\n\n31:21.940 --> 31:27.440\n So the external factors are basically communicable diseases like COVID, like the flu, et cetera.\n\n31:27.440 --> 31:33.200\n And the internal factors are basically things like cancer and Alzheimer's where basically\n\n31:33.200 --> 31:38.560\n your genetics will eventually drive you there.\n\n31:38.560 --> 31:43.520\n And then of course, with all of these factors, every single disease has both the genetic\n\n31:43.520 --> 31:46.200\n component and environmental component.\n\n31:46.200 --> 31:55.700\n So heart disease, huge genetic contribution, Alzheimer's, it's like 60% plus genetic.\n\n31:55.700 --> 31:59.040\n So I think it's like 79% heritability.\n\n31:59.040 --> 32:06.400\n So that basically means that genetics alone explains 79% of Alzheimer's incidents.\n\n32:06.400 --> 32:14.040\n And yes, there's a 21% environmental component where you could basically enrich your cognitive\n\n32:14.040 --> 32:21.040\n environment, enrich your social interactions, read more books, learn a foreign language,\n\n32:21.040 --> 32:24.800\n go running, you know, sort of have a more fulfilling life.\n\n32:24.800 --> 32:29.320\n All of that will actually decrease Alzheimer's, but there's a limit to how much that can impact\n\n32:29.320 --> 32:31.240\n because of the huge genetic footprint.\n\n32:31.240 --> 32:32.240\n So this is fascinating.\n\n32:32.240 --> 32:38.860\n So each one of these problems have a genetic component and an environment component.\n\n32:38.860 --> 32:43.520\n And so like when there's a genetic component, what can we do about some of these diseases?\n\n32:43.520 --> 32:48.520\n And have you worked on what can you say that's in terms of problems that are solvable here\n\n32:48.520 --> 32:50.520\n or understandable?\n\n32:50.520 --> 32:55.740\n So my group works on the genetic component, but I would argue that understanding the genetic\n\n32:55.740 --> 32:59.700\n component can have a huge impact even on the environmental component.\n\n32:59.700 --> 33:00.800\n Why is that?\n\n33:00.800 --> 33:03.560\n Because genetics gives us access to mechanism.\n\n33:03.560 --> 33:09.580\n And if we can alter the mechanism, if we can impact the mechanism, we can perhaps counteract\n\n33:09.580 --> 33:12.080\n some of the environmental components.\n\n33:12.080 --> 33:18.240\n So understanding the biological mechanisms leading to disease is extremely important\n\n33:18.240 --> 33:20.820\n in being able to intervene.\n\n33:20.820 --> 33:26.040\n But when you can intervene and what, you know, the analogy that I like to give is for example,\n\n33:26.040 --> 33:29.880\n for obesity, you know, think of it as a giant bathtub of fat.\n\n33:29.880 --> 33:35.800\n There's basically fat coming in from your diet and there's fat coming out from your\n\n33:35.800 --> 33:36.800\n exercise.\n\n33:36.800 --> 33:37.800\n Okay.\n\n33:37.800 --> 33:42.240\n So that's an in out equation and that's the equation that everybody's focusing on.\n\n33:42.240 --> 33:47.740\n But your metabolism impacts that, you know, bathtub.\n\n33:47.740 --> 33:53.080\n Basically your metabolism controls the rate at which you're burning energy.\n\n33:53.080 --> 33:56.640\n It controls the rate at which you're storing energy.\n\n33:56.640 --> 34:02.800\n And it also teaches you about the various valves that control the input and the output\n\n34:02.800 --> 34:04.020\n equation.\n\n34:04.020 --> 34:11.320\n So if we can learn from the genetics, the valves, we can then manipulate those valves.\n\n34:11.320 --> 34:16.060\n And even if the environment is feeding you a lot of fat and getting a little that out,\n\n34:16.060 --> 34:19.840\n you can just poke another hole at the bathtub and just get a lot of the fat out.\n\n34:19.840 --> 34:21.160\n Yeah, that's fascinating.\n\n34:21.160 --> 34:22.160\n Yeah.\n\n34:22.160 --> 34:25.840\n So we're not just passive observers of our genetics.\n\n34:25.840 --> 34:29.640\n The more we understand, the more we can come up with actual treatments.\n\n34:29.640 --> 34:35.680\n And I think that's an important aspect to realize when people are thinking about strong\n\n34:35.680 --> 34:38.080\n effect versus weak effect variants.\n\n34:38.080 --> 34:39.580\n So some variants have strong effects.\n\n34:39.580 --> 34:43.400\n We talked about these Mendelian disorders where a single gene has a sufficiently large\n\n34:43.400 --> 34:49.420\n effect, penetrance, expressivity, and so on and so forth, that basically you can trace\n\n34:49.420 --> 34:55.320\n it in families with cases and not cases, cases, not cases, and so on and so forth.\n\n34:55.320 --> 35:02.840\n But so these are the genes that everybody says, oh, that's the genes we should go after\n\n35:02.840 --> 35:04.880\n because that's a strong effect gene.\n\n35:04.880 --> 35:06.860\n I like to think about it slightly differently.\n\n35:06.860 --> 35:15.440\n These are the genes where genetic impacts that have a strong effect were tolerated because\n\n35:15.440 --> 35:20.200\n every single time we have a genetic association with disease, it depends on two things.\n\n35:20.200 --> 35:24.680\n Number one, the obvious one, whether the gene has an impact on the disease.\n\n35:24.680 --> 35:32.180\n Number two, the more subtle one is whether there is genetic variation standing and circulating\n\n35:32.180 --> 35:37.680\n and segregating in the human population that impacts that gene.\n\n35:37.680 --> 35:44.480\n Some genes are so darn important that if you mess with them, even a tiny little amount,\n\n35:44.480 --> 35:46.440\n that person's dead.\n\n35:46.440 --> 35:49.020\n So those genes don't have variation.\n\n35:49.020 --> 35:53.040\n You're not going to find a genetic association if you don't have variation.\n\n35:53.040 --> 35:55.400\n That doesn't mean that the gene has no role.\n\n35:55.400 --> 35:59.120\n It simply means that the gene tolerates no mutations.\n\n35:59.120 --> 36:01.480\n So that's actually a strong signal when there's no variation.\n\n36:01.480 --> 36:02.480\n That's so fascinating.\n\n36:02.480 --> 36:03.480\n Exactly.\n\n36:03.480 --> 36:06.780\n Genes that have very little variation are hugely important.\n\n36:06.780 --> 36:10.840\n You can actually rank the importance of genes based on how little variation they have.\n\n36:10.840 --> 36:16.920\n And those genes that have very little variation but no association with disease, that's a\n\n36:16.920 --> 36:20.440\n very good metric to say, oh, that's probably a developmental gene because we're not good\n\n36:20.440 --> 36:22.840\n at measuring those phenotypes.\n\n36:22.840 --> 36:29.040\n So it's genes that you can tell evolution has excluded mutations from, but yet we can't\n\n36:29.040 --> 36:32.120\n see them associated with anything that we can measure nowadays.\n\n36:32.120 --> 36:34.840\n It's probably early embryonic lethal.\n\n36:34.840 --> 36:36.200\n What are all the words you just said?\n\n36:36.200 --> 36:37.760\n Early embryonic what?\n\n36:37.760 --> 36:38.760\n Lethal.\n\n36:38.760 --> 36:39.760\n Meaning?\n\n36:39.760 --> 36:40.760\n Meaning that that embryo will die.\n\n36:40.760 --> 36:41.760\n Okay.\n\n36:41.760 --> 36:49.160\n There's a bunch of stuff that is required for a stable functional organism across the\n\n36:49.160 --> 36:53.880\n board for an entire species, I guess.\n\n36:53.880 --> 36:58.680\n If you look at sperm, it expresses thousands of proteins.\n\n36:58.680 --> 37:01.240\n Does sperm actually need thousands of proteins?\n\n37:01.240 --> 37:05.320\n No, but it's probably just testing them.\n\n37:05.320 --> 37:11.960\n So my speculation is that misfolding of these proteins is an early test for failure.\n\n37:11.960 --> 37:18.440\n So that out of the millions of sperm that are possible, you select the subset that are\n\n37:18.440 --> 37:21.920\n just not grossly misfolding thousands of proteins.\n\n37:21.920 --> 37:25.720\n So it's kind of an assert that this is folded correctly.\n\n37:25.720 --> 37:26.720\n Correct.\n\n37:26.720 --> 37:27.720\n Yeah.\n\n37:27.720 --> 37:32.560\n This just because if this little thing about the folding of a protein isn't correct, that\n\n37:32.560 --> 37:35.720\n probably means somewhere down the line, there's a bigger issue.\n\n37:35.720 --> 37:36.720\n That's exactly right.\n\n37:36.720 --> 37:37.720\n So fail fast.\n\n37:37.720 --> 37:45.100\n So basically if you look at the mammalian investment in a newborn, that investment is\n\n37:45.100 --> 37:47.720\n enormous in terms of resources.\n\n37:47.720 --> 37:52.840\n So mammals have basically evolved mechanisms for fail fast.\n\n37:52.840 --> 37:58.880\n Where basically in those early months of development, I mean it's horrendous of course at the personal\n\n37:58.880 --> 38:08.680\n level when you lose your future child, but in some ways there's so little hope for that\n\n38:08.680 --> 38:12.880\n child to develop and sort of make it through the remaining months that sort of fail fast\n\n38:12.880 --> 38:19.560\n is probably a good evolutionary principle for mammals.\n\n38:19.560 --> 38:24.920\n And of course humans have a lot of medical resources that you can sort of give those\n\n38:24.920 --> 38:33.120\n children a chance and we have so much more success in sort of giving folks who have these\n\n38:33.120 --> 38:37.040\n strong carrier mutations a chance, but if they're not even making it through the first\n\n38:37.040 --> 38:39.860\n three months, we're not going to see them.\n\n38:39.860 --> 38:45.080\n So that's why when we say what are the most important genes to focus on, the ones that\n\n38:45.080 --> 38:50.040\n have a strong effect mutation or the ones that have a weak effect mutation, well the\n\n38:50.040 --> 38:57.080\n jury might be out because the ones that have a strong effect mutation are basically not\n\n38:57.080 --> 38:58.720\n mattering as much.\n\n38:58.720 --> 39:04.960\n The ones that only have weak effect mutations by understanding through genetics that they\n\n39:04.960 --> 39:10.200\n have a weak effect mutation and understanding that they have a causal role on the disease,\n\n39:10.200 --> 39:15.720\n we can then say, okay, great, evolution has only tolerated a 2% change in that gene.\n\n39:15.720 --> 39:22.560\n Pharmaceutically I can go in and induce a 70% change in that gene and maybe I will poke\n\n39:22.560 --> 39:33.220\n another hole at the bathtub that was not easy to control in many of the other sort of strong\n\n39:33.220 --> 39:35.160\n effect genetic variants.\n\n39:35.160 --> 39:41.800\n So there's this beautiful map of across the population of things that you're saying strong\n\n39:41.800 --> 39:48.200\n and weak effects, so stuff with a lot of mutations and stuff with little mutations with no mutations\n\n39:48.200 --> 39:51.360\n and you have this map and it lays out the puzzle.\n\n39:51.360 --> 39:52.360\n Yeah.\n\n39:52.360 --> 39:56.120\n So when I say strong effect, I mean at the level of individual mutations.\n\n39:56.120 --> 40:03.640\n So basically genes where, so you have to think of first the effect of the gene on the disease.\n\n40:03.640 --> 40:10.240\n Remember how I was sort of painting that map earlier from genetics all the way to phenotype.\n\n40:10.240 --> 40:15.960\n That gene can have a strong effect on the disease, but the genetic variant might have\n\n40:15.960 --> 40:18.880\n a weak effect on the gene.\n\n40:18.880 --> 40:24.960\n So basically when you ask what is the effect of that genetic variant on the disease, it\n\n40:24.960 --> 40:29.560\n could be that that genetic variant impacts the gene by a lot and then the gene impacts\n\n40:29.560 --> 40:33.240\n the disease by a little, or it could be that the genetic variants impacts the gene by a\n\n40:33.240 --> 40:35.880\n little and then the gene impacts the disease by a lot.\n\n40:35.880 --> 40:41.720\n So what we care about is genes that impact the disease a lot, but genetics gives us the\n\n40:41.720 --> 40:51.920\n full equation and what I would argue is if we couple the genetics with expression variation\n\n40:51.920 --> 41:00.400\n to basically ask what genes change by a lot and which genes correlate with disease by\n\n41:00.400 --> 41:06.200\n a lot, even if the genetic variants change them by a little, then those are the best\n\n41:06.200 --> 41:07.200\n places to intervene.\n\n41:07.200 --> 41:13.200\n Those are the best places where pharmaceutical, if I have even a modest effect, I will have\n\n41:13.200 --> 41:17.120\n a strong effect on the disease, whereas those genetic variants that have a huge effect on\n\n41:17.120 --> 41:21.120\n the disease, I might not be able to change that gene by this much without affecting all\n\n41:21.120 --> 41:22.360\n kinds of other things.\n\n41:22.360 --> 41:23.360\n Interesting.\n\n41:23.360 --> 41:26.040\n So that's what we're looking at.\n\n41:26.040 --> 41:31.800\n What have we been able to find in terms of which disease could be helped?\n\n41:31.800 --> 41:37.280\n Again, don't get me started.\n\n41:37.280 --> 41:38.960\n We have found so much.\n\n41:38.960 --> 41:46.000\n Our understanding of disease has changed so dramatically with genetics.\n\n41:46.000 --> 41:49.000\n I mean places that we had no idea would be involved.\n\n41:49.000 --> 41:53.920\n So one of the worst things about my genome is that I have a genetic predisposition to\n\n41:53.920 --> 41:56.520\n age related macular degeneration, AMD.\n\n41:56.520 --> 42:02.260\n So it's a form of blindness that causes you to lose the central part of your vision progressively\n\n42:02.260 --> 42:04.400\n as you grow older.\n\n42:04.400 --> 42:06.240\n My increased risk is fairly small.\n\n42:06.240 --> 42:07.680\n I have an 8% chance.\n\n42:07.680 --> 42:10.080\n You only have a 6% chance.\n\n42:10.080 --> 42:11.080\n I'm an average.\n\n42:11.080 --> 42:14.560\n By the way, when you say my, you mean literally yours.\n\n42:14.560 --> 42:15.880\n You know this about you.\n\n42:15.880 --> 42:18.000\n I know this about me.\n\n42:18.000 --> 42:26.500\n Which is kind of, I mean philosophically speaking is a pretty powerful thing to live with.\n\n42:26.500 --> 42:31.680\n Maybe that's, so we agreed to talk again by the way for the listeners to where we're going\n\n42:31.680 --> 42:36.080\n to try to focus on science today and a little bit of philosophy next time.\n\n42:36.080 --> 42:42.880\n But it's interesting to think about the more you're able to know about yourself from the\n\n42:42.880 --> 42:49.360\n genetic information in terms of the diseases, how that changes your own view of life.\n\n42:49.360 --> 42:56.000\n So there's a lot of impact there and there's something called genetics exceptionalism,\n\n42:56.000 --> 43:01.040\n which basically thinks of genetics as something very, very different than everything else\n\n43:01.040 --> 43:04.200\n as a type of determinism.\n\n43:04.200 --> 43:07.320\n And you know, let's talk about that next time.\n\n43:07.320 --> 43:08.320\n So basically.\n\n43:08.320 --> 43:09.320\n That's a good preview.\n\n43:09.320 --> 43:10.320\n Yeah.\n\n43:10.320 --> 43:11.680\n So let's go back to AMD.\n\n43:11.680 --> 43:16.920\n So basically with AMD, we have no idea what causes AMD.\n\n43:16.920 --> 43:23.700\n You know, it was, it was a mystery until the genetics were worked out.\n\n43:23.700 --> 43:28.640\n And now the fact that I know that I have a predisposition allows me to sort of make some\n\n43:28.640 --> 43:34.720\n life choices, number one, but number two, the genes that lead to that predisposition\n\n43:34.720 --> 43:38.520\n give us insights as to how does it actually work.\n\n43:38.520 --> 43:42.960\n And that's a place where genetics gave us something totally unexpected.\n\n43:42.960 --> 43:52.000\n So there's a complement pathway, which is an immune function pathway that was in, you\n\n43:52.000 --> 43:55.940\n know, most of the loci associated with AMD.\n\n43:55.940 --> 44:02.600\n And that basically told us that, wow, there's an immune basis to this eye disorder that\n\n44:02.600 --> 44:05.180\n people had just not expected before.\n\n44:05.180 --> 44:11.160\n If you look at complement, it was recently also implicated in schizophrenia.\n\n44:11.160 --> 44:17.280\n And there's a type of microglia that is involved in synaptic pruning.\n\n44:17.280 --> 44:20.560\n So synapses are the connections between neurons.\n\n44:20.560 --> 44:27.160\n And in this whole use it or lose it view of mental cognition and other capabilities, you\n\n44:27.160 --> 44:32.960\n basically have microglia, which are immune cells that are sort of constantly traversing\n\n44:32.960 --> 44:38.640\n your brain and then pruning neuronal connections, pruning synaptic connections that are not\n\n44:38.640 --> 44:40.260\n utilized.\n\n44:40.260 --> 44:47.960\n So in schizophrenia, there's thought to be a change in the pruning that basically if\n\n44:47.960 --> 44:53.280\n you don't prune your synapses the right way, you will actually have an increased role of\n\n44:53.280 --> 44:54.280\n schizophrenia.\n\n44:54.280 --> 44:57.160\n This is something that was completely unexpected for schizophrenia.\n\n44:57.160 --> 45:01.560\n Of course, we knew it has to do with neurons, but the role of the complement complex, which\n\n45:01.560 --> 45:06.520\n is also implicated in AMD, which is now also implicated in schizophrenia, was a huge surprise.\n\n45:06.520 --> 45:08.040\n What's the complement complex?\n\n45:08.040 --> 45:13.960\n So it's basically a set of genes, the complement genes that are basically having various immune\n\n45:13.960 --> 45:15.460\n roles.\n\n45:15.460 --> 45:19.940\n And as I was saying earlier, our immune system has been coopted for many different roles\n\n45:19.940 --> 45:21.220\n across the body.\n\n45:21.220 --> 45:23.440\n So they actually play many diverse roles.\n\n45:23.440 --> 45:29.600\n And somehow the immune system is connected to the synaptic pruning process, the process.\n\n45:29.600 --> 45:30.600\n Exactly.\n\n45:30.600 --> 45:33.080\n So the prune cells were coopted to prune synapses.\n\n45:33.080 --> 45:35.720\n How did you figure this out?\n\n45:35.720 --> 45:41.920\n How does one go about figuring this intricate connection, like pipeline of connections out?\n\n45:41.920 --> 45:42.920\n Yeah.\n\n45:42.920 --> 45:44.280\n Let me give you another example.\n\n45:44.280 --> 45:48.920\n So Alzheimer's disease, the first place that you would expect it to act is obviously the\n\n45:48.920 --> 45:49.920\n brain.\n\n45:49.920 --> 45:57.000\n So we had basically this roadmap epigenomics consortium view of the human epigenome, the\n\n45:57.000 --> 46:04.440\n largest map of the human epigenome that has ever been built across 127 different tissues\n\n46:04.440 --> 46:10.560\n and samples with dozens of epigenomic marks measured in hundreds of donors.\n\n46:10.560 --> 46:16.600\n So what we've basically learned through that is that you basically can map what are the\n\n46:16.600 --> 46:20.280\n active gene regulatory elements for every one of the tissues in the body.\n\n46:20.280 --> 46:27.400\n And then we connected these gene regulatory active maps of basically what regions of the\n\n46:27.400 --> 46:32.000\n human genome are turning on in every one of different tissues.\n\n46:32.000 --> 46:38.600\n We then can go back and say, where are all of the genetic loci that are associated with\n\n46:38.600 --> 46:39.600\n disease?\n\n46:39.600 --> 46:46.400\n This is something that my group, I think was the first to do back in 2010 in this Ernst\n\n46:46.400 --> 46:52.040\n Nature Biotech paper, but basically we were for the first time able to show that specific\n\n46:52.040 --> 46:58.560\n chromatin states, specific epigenomic states, in that case enhancers, were in fact enriched\n\n46:58.560 --> 47:00.720\n in disease associated variants.\n\n47:00.720 --> 47:05.640\n We pushed that further in the Ernst Nature paper a year later.\n\n47:05.640 --> 47:12.680\n And then in this roadmap epigenomics paper a few years after that, but basically that\n\n47:12.680 --> 47:18.160\n matrix that you mentioned earlier was in fact the first time that we could see what genetic\n\n47:18.160 --> 47:26.360\n traits have genetic variants that are enriched in what tissues in the body.\n\n47:26.360 --> 47:28.800\n And a lot of that map made complete sense.\n\n47:28.800 --> 47:33.800\n If you looked at a diversity of immune traits like allergies and type one diabetes and so\n\n47:33.800 --> 47:38.920\n on and so forth, you basically could see that they were enriching, that the genetic variants\n\n47:38.920 --> 47:44.680\n associated with those traits were enriched in enhancers in these gene regulatory elements\n\n47:44.680 --> 47:49.280\n active in T cells and B cells and hematopoietic stem cells and so on and so forth.\n\n47:49.280 --> 47:56.960\n So that basically gave us a confirmation in many ways that those immune traits were indeed\n\n47:56.960 --> 48:00.360\n enriching immune cells.\n\n48:00.360 --> 48:06.080\n If you looked at type two diabetes, you basically saw an enrichment in only one type of sample\n\n48:06.080 --> 48:08.960\n and it was pancreatic islets.\n\n48:08.960 --> 48:14.960\n And we know that type two diabetes sort of stems from the dysregulation of insulin in\n\n48:14.960 --> 48:17.440\n the beta cells of pancreatic islets.\n\n48:17.440 --> 48:21.200\n And that sort of was spot on, super precise.\n\n48:21.200 --> 48:25.880\n If you looked at blood pressure, where would you expect blood pressure to occur?\n\n48:25.880 --> 48:29.880\n You know, I don't know, maybe in your metabolism and ways that you process coffee or something\n\n48:29.880 --> 48:30.880\n like that.\n\n48:30.880 --> 48:33.880\n Maybe in your brain, the way that you stress out and increases your blood pressure, et\n\n48:33.880 --> 48:34.880\n cetera.\n\n48:34.880 --> 48:40.360\n So the blood pressure localized specifically in the left ventricle of the heart.\n\n48:40.360 --> 48:44.100\n So the enhancers of the left ventricle in the heart contained a lot of genetic variants\n\n48:44.100 --> 48:46.760\n associated with blood pressure.\n\n48:46.760 --> 48:53.280\n If you look at height, we found an enrichment specifically in embryonic stem cell enhancers.\n\n48:53.280 --> 48:57.480\n So the genetic variants predisposing you to be taller or shorter are in fact acting in\n\n48:57.480 --> 49:01.380\n developmental stem cells, makes complete sense.\n\n49:01.380 --> 49:05.920\n If you looked at inflammatory bowel disease, you basically found inflammatory, which is\n\n49:05.920 --> 49:09.880\n immune, and also bowel disease, which is digestive.\n\n49:09.880 --> 49:15.800\n And indeed we saw a double enrichment both in the immune cells and in the digestive cells.\n\n49:15.800 --> 49:19.040\n So that basically told us that this is acting in both components.\n\n49:19.040 --> 49:23.460\n There's an immune component to inflammatory bowel disease and there's a digestive component.\n\n49:23.460 --> 49:25.960\n And the big surprise was for Alzheimer's.\n\n49:25.960 --> 49:29.160\n We had seven different brain samples.\n\n49:29.160 --> 49:36.240\n We found zero enrichment in the brain samples for genetic variants associated with Alzheimer's.\n\n49:36.240 --> 49:38.020\n And this is mind boggling.\n\n49:38.020 --> 49:40.040\n Our brains were literally hurting.\n\n49:40.040 --> 49:42.000\n What is going on?\n\n49:42.000 --> 49:49.080\n And what is going on is that the brain samples are primarily neurons, oligodendrocytes, and\n\n49:49.080 --> 49:54.120\n astrocytes in terms of the cell types that make them up.\n\n49:54.120 --> 49:59.400\n So that basically indicated that genetic variants associated with Alzheimer's were probably\n\n49:59.400 --> 50:04.560\n not acting in oligodendrocytes, astrocytes, or neurons.\n\n50:04.560 --> 50:05.960\n So what could they be acting in?\n\n50:05.960 --> 50:10.200\n Well, the fourth major cell type is actually microglia.\n\n50:10.200 --> 50:13.720\n Microglia are resident immune cells in your brain.\n\n50:13.720 --> 50:15.880\n Oh, nice.\n\n50:15.880 --> 50:16.880\n They immune.\n\n50:16.880 --> 50:17.880\n Oh, wow.\n\n50:17.880 --> 50:24.160\n They are CD14 plus, which is this sort of cell surface markers of those cells.\n\n50:24.160 --> 50:30.200\n So they're CD14 plus cells, just like macrophages that are circulating in your blood.\n\n50:30.200 --> 50:35.640\n The microglia are resident monocytes that are basically sitting in your brain.\n\n50:35.640 --> 50:38.400\n They're tissue specific monocytes.\n\n50:38.400 --> 50:42.840\n And every one of your tissues, like your fat, for example, has a lot of macrophages that\n\n50:42.840 --> 50:43.920\n are resident.\n\n50:43.920 --> 50:49.560\n And the M1 versus M2 macrophage ratio has a huge role to play in obesity.\n\n50:49.560 --> 50:53.440\n And so basically, again, these immune cells are everywhere, but basically what we found\n\n50:53.440 --> 50:59.080\n through this completely unbiased view of what are the tissues that likely underlie different\n\n50:59.080 --> 51:08.080\n disorders, we found that Alzheimer's was humongously enriched in microglia, but not at all in the\n\n51:08.080 --> 51:09.080\n other cell types.\n\n51:09.080 --> 51:15.480\n So what are we supposed to make that if you look at the tissues involved, is that simply\n\n51:15.480 --> 51:24.640\n useful for indication of propensity for disease, or does it give us somehow a pathway of treatment?\n\n51:24.640 --> 51:26.120\n It's very much the second.\n\n51:26.120 --> 51:33.900\n If you look at the way to therapeutics, you have to start somewhere.\n\n51:33.900 --> 51:34.900\n What are you going to do?\n\n51:34.900 --> 51:42.040\n You're going to basically make assays that manipulate those genes and those pathways\n\n51:42.040 --> 51:43.780\n in those cell types.\n\n51:43.780 --> 51:49.200\n So before we know the tissue of action, we don't even know where to start.\n\n51:49.200 --> 51:51.040\n We basically are at a loss.\n\n51:51.040 --> 51:54.720\n But if you know the tissue of action, and even better, if you know the pathway of action,\n\n51:54.720 --> 52:00.280\n then you can basically screen your small molecules, not for the gene, you can screen them directly\n\n52:00.280 --> 52:02.640\n for the pathway in that cell type.\n\n52:02.640 --> 52:10.480\n So you can basically develop a high throughput multiplexed robotic system for testing the\n\n52:10.480 --> 52:16.240\n impact of your favorite molecules that you know are safe, efficacious, and sort of hit\n\n52:16.240 --> 52:18.940\n that particular gene and so on and so forth.\n\n52:18.940 --> 52:25.720\n You can basically screen those molecules against either a set of genes that act in that pathway\n\n52:25.720 --> 52:29.820\n or on the pathway directly by having a cellular assay.\n\n52:29.820 --> 52:33.400\n And then you can basically go into mice and do experiments and basically sort of figure\n\n52:33.400 --> 52:38.800\n out ways to manipulate these processes that allow you to then go back to humans and do\n\n52:38.800 --> 52:43.200\n a clinical trial that basically says, okay, I was able indeed to reverse these processes\n\n52:43.200 --> 52:44.200\n in mice.\n\n52:44.200 --> 52:46.240\n Can I do the same thing in humans?\n\n52:46.240 --> 52:51.820\n So the knowledge of the tissues gives you the pathway to treatment, but that's not the\n\n52:51.820 --> 52:52.820\n only part.\n\n52:52.820 --> 52:57.280\n There are many additional steps to figuring out the mechanism of disease.\n\n52:57.280 --> 52:59.080\n So that's really promising.\n\n52:59.080 --> 53:04.360\n Maybe to take a small step back, you've mentioned all these puzzles that were figured out with\n\n53:04.360 --> 53:13.960\n the Nature paper for, I mean, you've mentioned a ton of diseases from obesity to Alzheimer's,\n\n53:13.960 --> 53:17.720\n even schizophrenia, I think you mentioned.\n\n53:17.720 --> 53:20.720\n What is the actual methodology of figuring this out?\n\n53:20.720 --> 53:26.040\n So indeed, I mentioned a lot of diseases and my lab works on a lot of different disorders.\n\n53:26.040 --> 53:39.500\n And the reason for that is that if you look at biology, it used to be zoology departments\n\n53:39.500 --> 53:43.680\n and botanology departments and virology departments and so on and so forth.\n\n53:43.680 --> 53:47.680\n And MIT was one of the first schools to basically create a biology department, like, oh, we're\n\n53:47.680 --> 53:49.640\n going to study all of life suddenly.\n\n53:49.640 --> 53:51.720\n Why was that even a case?\n\n53:51.720 --> 53:58.480\n Because the advent of DNA and the genome and the central dogma of DNA makes RNA makes protein\n\n53:58.480 --> 54:01.600\n in many ways, unified biology.\n\n54:01.600 --> 54:07.480\n You could suddenly study the process of transcription in viruses or in bacteria and have a huge\n\n54:07.480 --> 54:15.040\n impact on yeast and fly and maybe even mammals because of this realization of these common\n\n54:15.040 --> 54:17.760\n underlying processes.\n\n54:17.760 --> 54:27.180\n And in the same way that DNA unified biology, genetics is unifying disease studies.\n\n54:27.180 --> 54:39.440\n So you used to have, I don't know, cardiovascular disease department and neurological disease\n\n54:39.440 --> 54:47.640\n department and neurodegeneration department and basically immune and cancer and so on\n\n54:47.640 --> 54:48.640\n and so forth.\n\n54:48.640 --> 54:53.600\n And all of these were studied in different labs because it made sense, because basically\n\n54:53.600 --> 54:57.560\n the first step was understanding how the tissue functions and we kind of knew the tissues\n\n54:57.560 --> 55:00.680\n involved in cardiovascular disease and so on and so forth.\n\n55:00.680 --> 55:05.760\n But what's happening with human genetics is that all of these walls and edifices that\n\n55:05.760 --> 55:08.480\n we had built are crumbling.\n\n55:08.480 --> 55:16.560\n And the reason for that is that genetics is in many ways revealing unexpected connections.\n\n55:16.560 --> 55:21.480\n So suddenly we now have to bring the immunologists to work on Alzheimer's.\n\n55:21.480 --> 55:22.680\n They were never in the room.\n\n55:22.680 --> 55:25.920\n They were in another building altogether.\n\n55:25.920 --> 55:31.600\n The same way for schizophrenia, we now have to sort of worry about all these interconnected\n\n55:31.600 --> 55:33.200\n aspects.\n\n55:33.200 --> 55:37.500\n For metabolic disorders, we're finding contributions from brain.\n\n55:37.500 --> 55:41.340\n So suddenly we have to call the neurologist from the other building and so on and so forth.\n\n55:41.340 --> 55:49.200\n So in my view, it makes no sense anymore to basically say, oh, I'm a geneticist studying\n\n55:49.200 --> 55:50.200\n immune disorders.\n\n55:50.200 --> 55:55.360\n I mean, that's ridiculous because, I mean, of course in many ways you still need to sort\n\n55:55.360 --> 55:56.480\n of focus.\n\n55:56.480 --> 56:01.080\n But what we're doing is that we're basically saying we'll go wherever the genetics takes\n\n56:01.080 --> 56:02.440\n us.\n\n56:02.440 --> 56:10.440\n And by building these massive resources, by working on our latest map is now 833 tissues,\n\n56:10.440 --> 56:15.560\n sort of the next generation of the epigenomics roadmap, which we're now called epimap, is\n\n56:15.560 --> 56:18.120\n 833 different tissues.\n\n56:18.120 --> 56:24.620\n And using those, we've basically found enrichments in 540 different disorders.\n\n56:24.620 --> 56:29.340\n Those enrichments are not like, oh great, you guys work on that and we'll work on this.\n\n56:29.340 --> 56:31.980\n They're intertwined amazingly.\n\n56:31.980 --> 56:36.120\n So of course there's a lot of modularity, but there's these enhancers that are sort\n\n56:36.120 --> 56:39.040\n of broadly active and these disorders that are broadly active.\n\n56:39.040 --> 56:43.480\n So basically some enhancers are active in all tissues and some disorders are enriching\n\n56:43.480 --> 56:44.480\n in all tissues.\n\n56:44.480 --> 56:49.160\n So basically there's these multifactorial and this other class, which I like to call\n\n56:49.160 --> 56:54.560\n polyfactorial diseases, which are basically lighting up everywhere.\n\n56:54.560 --> 57:00.000\n And in many ways it's, you know, sort of cutting across these walls that were previously built\n\n57:00.000 --> 57:01.760\n across these departments.\n\n57:01.760 --> 57:07.040\n And the polyfactorial ones were probably the previous structural departments wasn't equipped\n\n57:07.040 --> 57:08.040\n to deal with those.\n\n57:08.040 --> 57:14.680\n I mean, again, maybe it's a romanticized question, but you know, there's in physics, there's\n\n57:14.680 --> 57:16.920\n a theory of everything.\n\n57:16.920 --> 57:22.400\n Do you think it's possible to move towards an almost theory of everything of disease\n\n57:22.400 --> 57:24.100\n from a genetic perspective?\n\n57:24.100 --> 57:29.640\n So if this unification continues, is it possible that, like, do you think in those terms, like\n\n57:29.640 --> 57:35.720\n trying to arrive at a fundamental understanding of how disease emerges, period?\n\n57:35.720 --> 57:41.680\n That unification is not just foreseeable, it's inevitable.\n\n57:41.680 --> 57:43.600\n I see it as inevitable.\n\n57:43.600 --> 57:45.240\n We have to go there.\n\n57:45.240 --> 57:48.340\n You cannot be a specialist anymore.\n\n57:48.340 --> 57:53.840\n If you're a genomicist, you have to be a specialist in every single disorder.\n\n57:53.840 --> 57:59.960\n And the reason for that is that the fundamental understanding of the circuitry of the human\n\n57:59.960 --> 58:07.960\n genome that you need to solve schizophrenia, that fundamental circuitry is hugely important\n\n58:07.960 --> 58:09.600\n to solve Alzheimer's.\n\n58:09.600 --> 58:13.100\n And that same circuitry is hugely important to solve metabolic disorders.\n\n58:13.100 --> 58:20.040\n And that same exact circuitry is hugely important for solving immune disorders and cancer and,\n\n58:20.040 --> 58:22.260\n you know, every single disease.\n\n58:22.260 --> 58:26.680\n So all of them have the same sub task.\n\n58:26.680 --> 58:29.880\n And I teach dynamic programming in my class.\n\n58:29.880 --> 58:34.400\n Dynamic programming is all about sort of not redoing the work.\n\n58:34.400 --> 58:37.280\n It's reusing the work that you do once.\n\n58:37.280 --> 58:42.240\n So basically for us to say, oh, great, you know, you guys in the immune building go solve\n\n58:42.240 --> 58:44.240\n the fundamental circuitry of everything.\n\n58:44.240 --> 58:47.680\n And then you guys in the schizophrenia building go solve the fundamental circuitry of everything\n\n58:47.680 --> 58:50.080\n separately, is crazy.\n\n58:50.080 --> 58:56.080\n So what we need to do is come together and sort of have a circuitry group, the circuitry\n\n58:56.080 --> 58:59.520\n building that sort of tries to solve the circuitry of everything.\n\n58:59.520 --> 59:05.920\n And then the immune folks who will apply this knowledge to all of the disorders that are\n\n59:05.920 --> 59:12.460\n associated with immune dysfunction and the schizophrenia folks will basically interacting\n\n59:12.460 --> 59:15.560\n with both the immune folks and with the neuronal folks.\n\n59:15.560 --> 59:19.000\n And all of them will be interacting with the circuitry folks and so on and so forth.\n\n59:19.000 --> 59:22.320\n So that's sort of the current structure of my group, if you wish.\n\n59:22.320 --> 59:27.200\n So basically what we're doing is focusing on the fundamental circuitry.\n\n59:27.200 --> 59:34.020\n But at the same time, we're the users of our own tools by collaborating with many other\n\n59:34.020 --> 59:37.480\n labs in every one of these disorders that we mentioned.\n\n59:37.480 --> 59:42.880\n We basically have a heart focus on cardiovascular disease, coronary artery disease, heart failure\n\n59:42.880 --> 59:44.280\n and so on and so forth.\n\n59:44.280 --> 59:48.900\n We have an immune focus on several immune disorders.\n\n59:48.900 --> 59:55.580\n We have a cancer focus on metastatic melanoma and immunotherapy response.\n\n59:55.580 --> 1:00:04.120\n We have a psychiatric disease focus on schizophrenia, autism, PTSD, and other psychiatric disorders.\n\n1:00:04.120 --> 1:00:10.280\n We have an Alzheimer's and neurodegeneration focus on Huntington's disease, ALS and, you\n\n1:00:10.280 --> 1:00:14.460\n know, AD related disorders like frontotemporal dementia and Lewy body dementia.\n\n1:00:14.460 --> 1:00:16.740\n And of course, a huge focus on Alzheimer's.\n\n1:00:16.740 --> 1:00:23.320\n We have a metabolic focus on the role of exercise and diets and sort of how they're impacting\n\n1:00:23.320 --> 1:00:29.120\n metabolic organs across the body and across many different tissues.\n\n1:00:29.120 --> 1:00:34.100\n And all of them are interfacing with the circuitry.\n\n1:00:34.100 --> 1:00:42.180\n And the reason for that is another computer science principle of eat your own dog food.\n\n1:00:42.180 --> 1:00:47.760\n If everybody ate their own dog food, dog food would taste a lot better.\n\n1:00:47.760 --> 1:00:55.080\n The reason why Microsoft Excel and Word and PowerPoint was so important and so successful\n\n1:00:55.080 --> 1:01:00.000\n is because the employees that were working on them, were using them for their day to\n\n1:01:00.000 --> 1:01:01.500\n day tasks.\n\n1:01:01.500 --> 1:01:06.120\n You can't just simply build a circuitry and say, here it is guys, take the circuitry,\n\n1:01:06.120 --> 1:01:11.440\n we're done without being the users of that circuitry because you then go back.\n\n1:01:11.440 --> 1:01:16.740\n And because we span the whole spectrum from profiling the epigenome, using comparative\n\n1:01:16.740 --> 1:01:21.220\n genomics, finding the important nucleotides in the genome, building the basic functional\n\n1:01:21.220 --> 1:01:26.800\n map of what are the genes in the human genome, what are the gene regulatory elements of the\n\n1:01:26.800 --> 1:01:27.800\n human genome.\n\n1:01:27.800 --> 1:01:31.720\n I mean, over the years we've written a series of papers on how do you find human genes in\n\n1:01:31.720 --> 1:01:34.080\n the first place using comparative genomics?\n\n1:01:34.080 --> 1:01:38.840\n How do you find the motifs that are the building blocks of gene regulation using comparative\n\n1:01:38.840 --> 1:01:39.840\n genomics?\n\n1:01:39.840 --> 1:01:44.800\n And how do you then find how these motifs come together and act in specific tissues\n\n1:01:44.800 --> 1:01:46.280\n using epigenomics?\n\n1:01:46.280 --> 1:01:53.860\n How do you link regulators to enhancers and enhancers to their target genes using epigenomics\n\n1:01:53.860 --> 1:01:55.260\n and regulatory genomics?\n\n1:01:55.260 --> 1:02:00.320\n So through the years we've basically built all this infrastructure for understanding\n\n1:02:00.320 --> 1:02:06.900\n what I like to say, every single nucleotide of the human genome and how it acts in every\n\n1:02:06.900 --> 1:02:10.320\n one of the major cell types and tissues of the human body.\n\n1:02:10.320 --> 1:02:12.040\n I mean, this is no small task.\n\n1:02:12.040 --> 1:02:15.540\n This is an enormous task that takes the entire field.\n\n1:02:15.540 --> 1:02:20.720\n And that's something that my group has taken on along with many other groups.\n\n1:02:20.720 --> 1:02:25.340\n And we have also, and that sort of a thing sets my group perhaps apart, we have also\n\n1:02:25.340 --> 1:02:30.640\n worked with specialists in every one of these disorders to basically further our understanding\n\n1:02:30.640 --> 1:02:35.280\n all the way down to disease and in some cases collaborating with pharma to go all the way\n\n1:02:35.280 --> 1:02:42.480\n down to therapeutics because of our deep, deep understanding of that basic circuitry\n\n1:02:42.480 --> 1:02:47.600\n and how it allows us to now improve the circuitry.\n\n1:02:47.600 --> 1:02:51.880\n Not just treat it as a black box, but basically go and say, okay, we need a better cell type\n\n1:02:51.880 --> 1:02:56.480\n specific wiring that we now have at the tissue specific level.\n\n1:02:56.480 --> 1:03:01.560\n So we're focusing on that because we're understanding the needs from the disease front.\n\n1:03:01.560 --> 1:03:08.040\n So you have a sense of the entire pipeline, I mean, one, maybe you can indulge me.\n\n1:03:08.040 --> 1:03:14.700\n One nice question to ask would be, how do you, from the scientific perspective, go from\n\n1:03:14.700 --> 1:03:22.040\n knowing nothing about the disease to going, you said, to go into the entire pipeline and\n\n1:03:22.040 --> 1:03:26.840\n actually have a drug or a treatment that cures that disease?\n\n1:03:26.840 --> 1:03:32.840\n So that's an enormously long path and an enormously great challenge.\n\n1:03:32.840 --> 1:03:39.560\n And what I'm trying to argue is that it progresses in stages of understanding rather than one\n\n1:03:39.560 --> 1:03:40.960\n gene at a time.\n\n1:03:40.960 --> 1:03:45.200\n The traditional view of biology was you have one postdoc working on this gene and another\n\n1:03:45.200 --> 1:03:50.260\n postdoc working on that gene, and they'll just figure out everything about that gene\n\n1:03:50.260 --> 1:03:52.120\n and that's their job.\n\n1:03:52.120 --> 1:03:57.840\n But we've realized how polygenic the diseases are, so we can't have one postdoc per gene\n\n1:03:57.840 --> 1:03:58.840\n anymore.\n\n1:03:58.840 --> 1:04:04.360\n We now have to have these cross cutting needs.\n\n1:04:04.360 --> 1:04:10.480\n And I'm going to describe the path to circuitry along those needs.\n\n1:04:10.480 --> 1:04:15.600\n And every single one of these paths, we are now doing in parallel across thousands of\n\n1:04:15.600 --> 1:04:17.000\n genes.\n\n1:04:17.000 --> 1:04:23.160\n So the first step is you have a genetic association, and we talked a little bit about sort of the\n\n1:04:23.160 --> 1:04:27.760\n Mendelian path and the polygenic path to that association.\n\n1:04:27.760 --> 1:04:33.320\n So the Mendelian path was looking through families to basically find gene regions and\n\n1:04:33.320 --> 1:04:36.860\n ultimately genes that are underlying particular disorders.\n\n1:04:36.860 --> 1:04:43.240\n The polygenic path is basically looking at unrelated individuals in this giant matrix\n\n1:04:43.240 --> 1:04:49.200\n of genotype by phenotype, and then finding hits where a particular variant impacts disease\n\n1:04:49.200 --> 1:04:51.520\n all the way to the end.\n\n1:04:51.520 --> 1:04:57.960\n And then we now have a connection, not between a gene and a disease, but between a genetic\n\n1:04:57.960 --> 1:05:00.200\n region and a disease.\n\n1:05:00.200 --> 1:05:03.520\n And that distinction is not understood by most people.\n\n1:05:03.520 --> 1:05:06.640\n So I'm going to explain it a little bit more.\n\n1:05:06.640 --> 1:05:11.240\n Why do we not have a connection between a gene and a disease, but we have a connection\n\n1:05:11.240 --> 1:05:13.480\n between a genetic region and a disease?\n\n1:05:13.480 --> 1:05:21.840\n The reason for that is that 93% of genetic variants that are associated with disease\n\n1:05:21.840 --> 1:05:27.180\n don't impact the protein at all.\n\n1:05:27.180 --> 1:05:33.340\n So if you look at the human genome, there's 20,000 genes, there's 3.2 billion nucleotides.\n\n1:05:33.340 --> 1:05:40.120\n Only 1.5% of the genome codes for proteins.\n\n1:05:40.120 --> 1:05:46.160\n The other 98.5% does not code for proteins.\n\n1:05:46.160 --> 1:05:54.440\n If you now look at where are the disease variants located, 93% of them fall in that outside\n\n1:05:54.440 --> 1:05:55.720\n the genes portion.\n\n1:05:55.720 --> 1:06:00.600\n Of course, genes are enriched, but they're only enriched by a factor of three.\n\n1:06:00.600 --> 1:06:06.880\n That means that still 93% of genetic variants fall outside the proteins.\n\n1:06:06.880 --> 1:06:08.200\n Why is that difficult?\n\n1:06:08.200 --> 1:06:09.480\n Why is that a problem?\n\n1:06:09.480 --> 1:06:15.900\n The problem is that when a variant falls outside the gene, you don't know what gene is impacted\n\n1:06:15.900 --> 1:06:16.900\n by that variant.\n\n1:06:16.900 --> 1:06:21.160\n You can't just say, oh, it's near this gene, let's just connect that variant to the gene.\n\n1:06:21.160 --> 1:06:27.880\n And the reason for that is that the genome circuitry is very often long range.\n\n1:06:27.880 --> 1:06:34.880\n So you basically have that genetic variant that could sit in the intron of one gene.\n\n1:06:34.880 --> 1:06:38.120\n An intron is sort of the place between the exons that code for proteins.\n\n1:06:38.120 --> 1:06:43.560\n So proteins are split up into exons and introns and every exon codes for a particular subset\n\n1:06:43.560 --> 1:06:49.220\n of amino acids and together they're spliced together and then make the final protein.\n\n1:06:49.220 --> 1:06:51.900\n So that genetic variant might be sitting in an intron of a gene.\n\n1:06:51.900 --> 1:06:56.320\n It's transcribed with the gene, it's processed and then excised, but it might not impact\n\n1:06:56.320 --> 1:06:57.320\n this gene at all.\n\n1:06:57.320 --> 1:07:01.080\n It might actually impact another gene that's a million nucleotides away.\n\n1:07:01.080 --> 1:07:05.840\n So it's just riding along even though it has nothing to do with this nearby neighborhood.\n\n1:07:05.840 --> 1:07:06.840\n That's exactly right.\n\n1:07:06.840 --> 1:07:09.600\n Let me give you an example.\n\n1:07:09.600 --> 1:07:16.520\n The strongest genetic association with obesity was discovered in this FTO gene, fat and obesity\n\n1:07:16.520 --> 1:07:18.400\n associated gene.\n\n1:07:18.400 --> 1:07:23.780\n So this FTO gene was studied ad nauseum.\n\n1:07:23.780 --> 1:07:26.740\n People did tons of experiments on it.\n\n1:07:26.740 --> 1:07:33.000\n They figured out that FTO is in fact RNA methylation transferase.\n\n1:07:33.000 --> 1:07:38.880\n It basically impacts something that we call the epitranscriptome.\n\n1:07:38.880 --> 1:07:43.520\n Just like the genome can be modified, the transcriptome, the transcript of the genes\n\n1:07:43.520 --> 1:07:44.900\n can be modified.\n\n1:07:44.900 --> 1:07:49.320\n And we basically said, oh great, that means that epitranscriptomics is hugely involved\n\n1:07:49.320 --> 1:07:56.880\n in obesity because that gene FTO is clearly where the genetic locus is at.\n\n1:07:56.880 --> 1:08:04.400\n My group studied FTO in collaboration with a wonderful team led by Melina Klausnitzer.\n\n1:08:04.400 --> 1:08:11.800\n And what we found is that this FTO locus, even though it is as associated with obesity,\n\n1:08:11.800 --> 1:08:16.680\n does not implicate the FTO gene.\n\n1:08:16.680 --> 1:08:22.840\n The genetic variance, it's in the first intron of the FTO gene, but it controls two genes\n\n1:08:22.840 --> 1:08:32.120\n IRX3 and IRX5 that are sitting 1.2 million nucleotides away, several genes away.\n\n1:08:32.120 --> 1:08:33.120\n Oh boy.\n\n1:08:33.120 --> 1:08:38.880\n What am I supposed to feel about that because isn't that like super complicated then?\n\n1:08:38.880 --> 1:08:43.640\n So the way that I was introduced at a conference a few years ago was, and here's Manolis Kellis\n\n1:08:43.640 --> 1:08:48.720\n who wrote the most depressing paper of 2015.\n\n1:08:48.720 --> 1:08:52.080\n And the reason for that is that the entire pharmaceutical industry was so comfortable\n\n1:08:52.080 --> 1:08:56.120\n that there was a single gene in that locus.\n\n1:08:56.120 --> 1:08:59.580\n Because in some loci, you basically have three dozen genes that are all sitting in the same\n\n1:08:59.580 --> 1:09:04.060\n region of association and you're like, oh gosh, which ones of those is it?\n\n1:09:04.060 --> 1:09:08.120\n But even that question of which ones of those is it is making the assumption that it is\n\n1:09:08.120 --> 1:09:13.680\n one of those as opposed to some random gene just far, far away, which is what our paper\n\n1:09:13.680 --> 1:09:14.680\n showed.\n\n1:09:14.680 --> 1:09:19.040\n So basically what our paper showed is that you can't ignore the circuitry.\n\n1:09:19.040 --> 1:09:23.460\n You have to first figure out the circuitry, all of those long range interactions, how\n\n1:09:23.460 --> 1:09:28.820\n every genetic variant impacts the expression of every gene in every tissue imaginable across\n\n1:09:28.820 --> 1:09:30.960\n hundreds of individuals.\n\n1:09:30.960 --> 1:09:35.560\n And then you now have one of the building blocks, not even all of the building blocks\n\n1:09:35.560 --> 1:09:41.440\n for then going and understanding disease.\n\n1:09:41.440 --> 1:09:44.920\n So embrace the wholeness of the circuitry.\n\n1:09:44.920 --> 1:09:45.920\n Correct.\n\n1:09:45.920 --> 1:09:51.760\n So back to the question of starting knowing nothing to the disease and going to the treatment.\n\n1:09:51.760 --> 1:09:53.520\n So what are the next steps?\n\n1:09:53.520 --> 1:09:57.240\n So you basically have to first figure out the tissue and then describe how you figure\n\n1:09:57.240 --> 1:09:58.240\n out the tissue.\n\n1:09:58.240 --> 1:10:01.740\n You figure out the tissue by taking all of these non coding variants that are sitting\n\n1:10:01.740 --> 1:10:06.840\n outside proteins and then figuring out what are the epigenomic enrichments.\n\n1:10:06.840 --> 1:10:13.860\n And the reason for that, you know, thankfully is that there is convergence, that the same\n\n1:10:13.860 --> 1:10:19.440\n processes are impacted in different ways by different loci.\n\n1:10:19.440 --> 1:10:23.080\n And that's a saving grace for our field.\n\n1:10:23.080 --> 1:10:27.800\n The fact that if I look at hundreds of genetic variants associated with Alzheimer's, they\n\n1:10:27.800 --> 1:10:31.920\n localize in a small number of processes.\n\n1:10:31.920 --> 1:10:34.640\n Can you clarify why that's hopeful?\n\n1:10:34.640 --> 1:10:40.080\n So like they show up in the same exact way in the, in the specific set of processes.\n\n1:10:40.080 --> 1:10:41.080\n Yeah.\n\n1:10:41.080 --> 1:10:45.380\n So basically there's a small number of biological processes that underlie, or at least that\n\n1:10:45.380 --> 1:10:48.580\n play the biggest role in every disorder.\n\n1:10:48.580 --> 1:10:54.040\n So in Alzheimer's you basically have, you know, maybe 10 different types of processes.\n\n1:10:54.040 --> 1:10:56.360\n One of them is lipid metabolism.\n\n1:10:56.360 --> 1:10:58.920\n One of them is immune cell function.\n\n1:10:58.920 --> 1:11:02.400\n One of them is neuronal energetics.\n\n1:11:02.400 --> 1:11:07.760\n So these are just a small number of processes, but you have multiple lesions, multiple genetic\n\n1:11:07.760 --> 1:11:10.980\n perturbations that are associated with those processes.\n\n1:11:10.980 --> 1:11:15.800\n So if you look at schizophrenia, it's excitatory neuron function, it's inhibitory neuron function,\n\n1:11:15.800 --> 1:11:18.940\n it's synaptic pruning, it's calcium signaling and so on and so forth.\n\n1:11:18.940 --> 1:11:24.840\n So when you look at disease genetics, you have one hit here and one hit there and one\n\n1:11:24.840 --> 1:11:28.200\n hit there and one hit there, completely different parts of the genome.\n\n1:11:28.200 --> 1:11:31.640\n But it turns out all of those hits are calcium signaling proteins.\n\n1:11:31.640 --> 1:11:32.640\n Oh, cool.\n\n1:11:32.640 --> 1:11:34.600\n You're like, aha.\n\n1:11:34.600 --> 1:11:37.420\n That means that calcium signaling is important.\n\n1:11:37.420 --> 1:11:42.640\n So those people who are focusing on one doctor at a time cannot possibly see that picture.\n\n1:11:42.640 --> 1:11:44.560\n You have to become a genomicist.\n\n1:11:44.560 --> 1:11:51.400\n You have to look at the omics, the om, the holistic picture to understand these enrichments.\n\n1:11:51.400 --> 1:11:54.080\n But you mentioned the convergence thing.\n\n1:11:54.080 --> 1:11:58.400\n The whatever the thing associated with the disease shows up.\n\n1:11:58.400 --> 1:12:00.200\n So let me explain convergence.\n\n1:12:00.200 --> 1:12:03.580\n Convergence is such a beautiful concept.\n\n1:12:03.580 --> 1:12:12.480\n So you basically have these four genes that are converging on calcium signaling.\n\n1:12:12.480 --> 1:12:18.040\n So that basically means that they are acting each in their own way, but together in the\n\n1:12:18.040 --> 1:12:19.820\n same process.\n\n1:12:19.820 --> 1:12:27.600\n But now in every one of these loci, you have many enhancers controlling each of those genes.\n\n1:12:27.600 --> 1:12:33.280\n That's another type of convergence where dysregulation of seven different enhancers might all converge\n\n1:12:33.280 --> 1:12:39.280\n on dysregulation of that one gene, which then converges on calcium signaling.\n\n1:12:39.280 --> 1:12:44.160\n And in each one of those enhancers, you might have multiple genetic variants distributed\n\n1:12:44.160 --> 1:12:46.960\n across many different people.\n\n1:12:46.960 --> 1:12:49.840\n Everyone has their own different mutation.\n\n1:12:49.840 --> 1:12:52.880\n But all of these mutations are impacting that enhancer.\n\n1:12:52.880 --> 1:12:55.160\n And all of these enhancers are impacting that gene.\n\n1:12:55.160 --> 1:12:57.560\n And all of these genes are impacting this pathway.\n\n1:12:57.560 --> 1:13:00.020\n And all these pathways are acting in the same tissue.\n\n1:13:00.020 --> 1:13:05.280\n And all of these tissues are converging together on the same biological process of schizophrenia.\n\n1:13:05.280 --> 1:13:09.960\n And you're saying the saving grace is that that conversion seems to happen for a lot\n\n1:13:09.960 --> 1:13:11.120\n of these diseases.\n\n1:13:11.120 --> 1:13:12.180\n For all of them.\n\n1:13:12.180 --> 1:13:17.200\n Basically that for every single disease that we've looked at, we have found an epigenomic\n\n1:13:17.200 --> 1:13:18.500\n enrichment.\n\n1:13:18.500 --> 1:13:19.500\n How do you do that?\n\n1:13:19.500 --> 1:13:24.040\n You basically have all of the genetic variants associated with the disorder.\n\n1:13:24.040 --> 1:13:28.080\n And then you're asking for all of the enhancers active in a particular tissue.\n\n1:13:28.080 --> 1:13:33.760\n For 540 disorders, we've basically found that indeed there is an enrichment.\n\n1:13:33.760 --> 1:13:37.060\n That basically means that there is commonality.\n\n1:13:37.060 --> 1:13:40.600\n And from the commonality, we can just get insights.\n\n1:13:40.600 --> 1:13:47.120\n So to explain in mathematical terms, we're basically building an empirical prior.\n\n1:13:47.120 --> 1:13:52.600\n We're using a Bayesian approach to basically say, great, all of these variants are equally\n\n1:13:52.600 --> 1:13:57.200\n likely in a particular locus to be important.\n\n1:13:57.200 --> 1:14:02.800\n So in a genetic locus, you basically have a dozen variants that are coinherited.\n\n1:14:02.800 --> 1:14:07.960\n Because the way that inheritance works in the human genome is through all of these recombination\n\n1:14:07.960 --> 1:14:16.120\n events during meiosis, you basically have, you know, you inherit maybe three, chromosome\n\n1:14:16.120 --> 1:14:20.240\n three, for example, in your body is inherited from four different parts.\n\n1:14:20.240 --> 1:14:23.840\n One part comes from your dad, another part comes from your mom, another part comes from\n\n1:14:23.840 --> 1:14:25.860\n your dad, another part comes from your mom.\n\n1:14:25.860 --> 1:14:30.200\n So basically, the way that it, sorry, from your mom's mom.\n\n1:14:30.200 --> 1:14:33.800\n So you basically have one copy that comes from your dad and one copy that comes from\n\n1:14:33.800 --> 1:14:34.800\n your mom.\n\n1:14:34.800 --> 1:14:39.600\n But that copy that you got from your mom is a mixture of her maternal and her paternal\n\n1:14:39.600 --> 1:14:41.000\n chromosome.\n\n1:14:41.000 --> 1:14:44.680\n And the copy that you got from your dad is a mixture of his maternal and his paternal\n\n1:14:44.680 --> 1:14:45.680\n chromosome.\n\n1:14:45.680 --> 1:14:53.480\n So these breakpoints that happen when chromosomes are lining up are basically ensuring through\n\n1:14:53.480 --> 1:15:02.520\n these crossover events, they're ensuring that every child cell during the process of meiosis,\n\n1:15:02.520 --> 1:15:08.560\n where you basically have, you know, one spermatozoid that basically couples with one ovule to basically\n\n1:15:08.560 --> 1:15:12.240\n create one egg to basically create the zygote.\n\n1:15:12.240 --> 1:15:16.440\n You basically have half of your genome that comes from dad and half your genome that comes\n\n1:15:16.440 --> 1:15:17.440\n from mom.\n\n1:15:17.440 --> 1:15:21.040\n But in order to line them up, you basically have these crossover events.\n\n1:15:21.040 --> 1:15:27.880\n These crossover events are basically leading to coinheritance of that entire block coming\n\n1:15:27.880 --> 1:15:33.920\n from your maternal grandmother and that entire block coming from your maternal grandfather.\n\n1:15:33.920 --> 1:15:38.800\n Over many generations, these crossover events don't happen randomly.\n\n1:15:38.800 --> 1:15:45.720\n There's a protein called PRDM9 that basically guides the double stranded breaks and then\n\n1:15:45.720 --> 1:15:48.320\n leads to these crossovers.\n\n1:15:48.320 --> 1:15:54.240\n And that protein has a particular preference to only a small number of hotspots of recombination,\n\n1:15:54.240 --> 1:15:59.880\n which then lead to a small number of breaks between these coinheritance patterns.\n\n1:15:59.880 --> 1:16:06.720\n So even though there are 6 million variants, there are 6 million loci, this variation is\n\n1:16:06.720 --> 1:16:12.600\n inherited in blocks and every one of these blocks has like two dozen genetic variants\n\n1:16:12.600 --> 1:16:13.600\n that are all associated.\n\n1:16:13.600 --> 1:16:19.840\n So in the case of FTO, it wasn't just one variant, it was 89 common variants that were\n\n1:16:19.840 --> 1:16:24.320\n all humongously associated with obesity.\n\n1:16:24.320 --> 1:16:26.640\n Which one of those is the important one?\n\n1:16:26.640 --> 1:16:29.640\n Well, if you look at only one locus, you have no idea.\n\n1:16:29.640 --> 1:16:36.880\n But if you look at many loci, you basically say, aha, all of them are enriching in the\n\n1:16:36.880 --> 1:16:40.080\n same epigenomic map.\n\n1:16:40.080 --> 1:16:44.160\n In that particular case, it was mesenchymal stem cells.\n\n1:16:44.160 --> 1:16:50.560\n So these are the progenitor cells that give rise to your brown fat and your white fat.\n\n1:16:50.560 --> 1:16:54.020\n Progenitor is like the early on developmental stem cells?\n\n1:16:54.020 --> 1:16:58.120\n So you start from one zygote and that's a totipotent cell type.\n\n1:16:58.120 --> 1:17:00.000\n It can do anything.\n\n1:17:00.000 --> 1:17:08.280\n You then, you know, that cell divides, divides, divides, and then every cell division is leading\n\n1:17:08.280 --> 1:17:14.880\n to specialization where you now have a mesodermal lineage and ectodermal lineage and endodermal\n\n1:17:14.880 --> 1:17:19.320\n lineage that basically leads to different parts of your body.\n\n1:17:19.320 --> 1:17:25.840\n The ectoderm will basically give rise to your skin, ecto means outside, derm is skin.\n\n1:17:25.840 --> 1:17:29.640\n So ectoderm, but it also gives rise to your neurons and your whole brain.\n\n1:17:29.640 --> 1:17:31.600\n So that's a lot of ectoderm.\n\n1:17:31.600 --> 1:17:36.880\n Mesoderm gives rise to your internal organs, including the vasculature and you know, your\n\n1:17:36.880 --> 1:17:38.440\n muscle and stuff like that.\n\n1:17:38.440 --> 1:17:45.080\n So you basically have this progressive differentiation and then if you look further, further down\n\n1:17:45.080 --> 1:17:49.700\n that lineage, you basically have one lineage that will give rise to both your muscle and\n\n1:17:49.700 --> 1:17:52.880\n your bone, but also your fat.\n\n1:17:52.880 --> 1:17:57.720\n And if you go further down the lineage of your fat, you basically have your white fat\n\n1:17:57.720 --> 1:17:59.040\n cells.\n\n1:17:59.040 --> 1:18:01.640\n These are the cells that store energy.\n\n1:18:01.640 --> 1:18:06.640\n So when you eat a lot, but you don't exercise too much, there's an excess set of calories,\n\n1:18:06.640 --> 1:18:07.640\n excess energy.\n\n1:18:07.640 --> 1:18:08.640\n What do you do with those?\n\n1:18:08.640 --> 1:18:13.520\n You basically create, you spend a lot of that energy to create these high energy molecules,\n\n1:18:13.520 --> 1:18:19.840\n lipids, which you can then burn when you need them on a rainy day.\n\n1:18:19.840 --> 1:18:26.320\n So that leads to obesity if you don't exercise and if you overeat because your body's like,\n\n1:18:26.320 --> 1:18:27.680\n oh great, I have all these calories.\n\n1:18:27.680 --> 1:18:28.680\n I'm going to store them.\n\n1:18:28.680 --> 1:18:29.680\n Ooh, more calories.\n\n1:18:29.680 --> 1:18:30.680\n I'm going to store them too.\n\n1:18:30.680 --> 1:18:31.680\n Ooh, more calories.\n\n1:18:31.680 --> 1:18:40.280\n So basically the 42% of European chromosomes have a predisposition to storing fat, which\n\n1:18:40.280 --> 1:18:48.880\n was selected probably in the food scarcity periods, like basically as we were exiting\n\n1:18:48.880 --> 1:18:54.240\n Africa before and during the ice ages, there was probably a selection to those individuals\n\n1:18:54.240 --> 1:19:00.880\n who made it North to basically be able to store energy, a lot more energy.\n\n1:19:00.880 --> 1:19:07.160\n So you basically now have this lineage that is deciding whether you want to store energy\n\n1:19:07.160 --> 1:19:11.160\n in your white fat or burn energy in your beige fat.\n\n1:19:11.160 --> 1:19:18.680\n It turns out that your fat is, you know, like we have such a bad view of fat.\n\n1:19:18.680 --> 1:19:20.160\n Fat is your best friend.\n\n1:19:20.160 --> 1:19:24.500\n Fat can both store all these excess lipids that would be otherwise circulating through\n\n1:19:24.500 --> 1:19:29.900\n your body and causing damage, but it can also burn calories directly.\n\n1:19:29.900 --> 1:19:35.760\n If you have too much energy, you can just choose to just burn some of that as heat.\n\n1:19:35.760 --> 1:19:41.200\n So basically when you're cold, you're burning energy to basically warm your body up and\n\n1:19:41.200 --> 1:19:44.540\n you're burning all these lipids and you're burning all these calories.\n\n1:19:44.540 --> 1:19:50.000\n So what we basically found is that across the board, genetic variants associated with\n\n1:19:50.000 --> 1:19:56.520\n obesity across many of these regions were all enriched repeatedly in mesenchymal stem\n\n1:19:56.520 --> 1:19:58.360\n cell enhancers.\n\n1:19:58.360 --> 1:20:05.120\n So that gave us a hint as to which of these genetic variants was likely driving this whole\n\n1:20:05.120 --> 1:20:06.120\n association.\n\n1:20:06.120 --> 1:20:14.440\n And we ended up with this one genetic variant called RS1421085.\n\n1:20:14.440 --> 1:20:20.040\n And that genetic variant out of the 89 was the one that we predicted to be causal for\n\n1:20:20.040 --> 1:20:21.040\n the disease.\n\n1:20:21.040 --> 1:20:22.040\n Wow.\n\n1:20:22.040 --> 1:20:26.240\n So going back to those steps, first step is figure out the relevant tissue based on the\n\n1:20:26.240 --> 1:20:27.960\n global enrichment.\n\n1:20:27.960 --> 1:20:34.840\n Second step is figure out the causal variant among many variants in this linkage disequilibrium\n\n1:20:34.840 --> 1:20:41.160\n in this coinherited block between these recombination hotspots, these boundaries of these inherited\n\n1:20:41.160 --> 1:20:42.640\n blocks.\n\n1:20:42.640 --> 1:20:43.920\n That's the second step.\n\n1:20:43.920 --> 1:20:49.920\n The third step is once you know that causal variant, try to figure out what is the motif\n\n1:20:49.920 --> 1:20:52.720\n that is disrupted by that causal variant.\n\n1:20:52.720 --> 1:20:54.400\n Basically how does it act?\n\n1:20:54.400 --> 1:20:59.520\n Variants don't just disrupt elements, they disrupt the binding of specific regulators.\n\n1:20:59.520 --> 1:21:04.440\n So basically the third step there was how do you find the motif that is responsible\n\n1:21:04.440 --> 1:21:10.240\n like the gene regulatory word, the building block of gene regulation that is responsible\n\n1:21:10.240 --> 1:21:12.480\n for that dysregulatory event.\n\n1:21:12.480 --> 1:21:18.280\n And the fourth step is finding out what regulator normally binds that motif and is now no longer\n\n1:21:18.280 --> 1:21:19.280\n able to bind.\n\n1:21:19.280 --> 1:21:24.920\n And then once you have the regulator, can you then try to figure out how to, what after\n\n1:21:24.920 --> 1:21:27.200\n it developed, how to fix it?\n\n1:21:27.200 --> 1:21:28.200\n That's exactly right.\n\n1:21:28.200 --> 1:21:30.260\n You now know how to intervene.\n\n1:21:30.260 --> 1:21:34.520\n You have basically a regulator, you have a gene that you can then perturb and you say,\n\n1:21:34.520 --> 1:21:38.640\n well, maybe that regulator has a global role in obesity.\n\n1:21:38.640 --> 1:21:40.360\n I can perturb the regulator.\n\n1:21:40.360 --> 1:21:46.760\n Just to clarify, when we say perturb, like on the scale of a human life, can a human\n\n1:21:46.760 --> 1:21:49.000\n being be helped?\n\n1:21:49.000 --> 1:21:50.000\n Of course.\n\n1:21:50.000 --> 1:21:51.000\n Yeah.\n\n1:21:51.000 --> 1:21:52.480\n I guess understanding is the first step.\n\n1:21:52.480 --> 1:21:57.480\n No, no, but perturbed basically means you now develop therapeutics, pharmaceutical therapeutics\n\n1:21:57.480 --> 1:21:59.340\n against that.\n\n1:21:59.340 --> 1:22:03.800\n Or you develop other types of intervention that affect the expression of that gene.\n\n1:22:03.800 --> 1:22:11.040\n What do pharmaceutical therapeutics look like when your understanding is on a genetic level?\n\n1:22:11.040 --> 1:22:12.040\n Yeah.\n\n1:22:12.040 --> 1:22:13.040\n Sorry if it's a dumb question.\n\n1:22:13.040 --> 1:22:14.040\n No, no, no.\n\n1:22:14.040 --> 1:22:16.440\n It's a brilliant question, but I want to save it for a little bit later when we start talking\n\n1:22:16.440 --> 1:22:17.440\n about therapeutics.\n\n1:22:17.440 --> 1:22:18.440\n Perfect.\n\n1:22:18.440 --> 1:22:20.280\n So let's talk about the first four steps.\n\n1:22:20.280 --> 1:22:21.600\n There's two more.\n\n1:22:21.600 --> 1:22:25.600\n So basically the first step is figure out, I mean, the zero step, the starting point\n\n1:22:25.600 --> 1:22:26.760\n is the genetics.\n\n1:22:26.760 --> 1:22:31.100\n The first step after that is figure out the tissue of action.\n\n1:22:31.100 --> 1:22:36.920\n The second step is figuring out the nucleotide that is responsible or set of nucleotides.\n\n1:22:36.920 --> 1:22:40.960\n The third step is figuring out the motif and the upstream regulator, number four.\n\n1:22:40.960 --> 1:22:44.320\n Number five and six is what are the targets?\n\n1:22:44.320 --> 1:22:45.800\n So number five is great.\n\n1:22:45.800 --> 1:22:47.200\n Now I know the regulator.\n\n1:22:47.200 --> 1:22:48.200\n I know the motif.\n\n1:22:48.200 --> 1:22:51.460\n I know the tissue and I know the variant.\n\n1:22:51.460 --> 1:22:53.400\n What does it actually do?\n\n1:22:53.400 --> 1:22:59.240\n So you have to now trace it to the biological process and the genes that mediate that biological\n\n1:22:59.240 --> 1:23:00.480\n process.\n\n1:23:00.480 --> 1:23:05.400\n So knowing all of this can now allow you to find the target genes.\n\n1:23:05.400 --> 1:23:06.400\n How?\n\n1:23:06.400 --> 1:23:13.200\n By basically doing perturbation experiments or by looking at the folding of the epigenome\n\n1:23:13.200 --> 1:23:19.440\n or by looking at the genetic impact of that genetic variant on the expression of genes.\n\n1:23:19.440 --> 1:23:21.580\n And we use all three.\n\n1:23:21.580 --> 1:23:22.800\n So let me go through them.\n\n1:23:22.800 --> 1:23:26.360\n Basically one of them is physical links.\n\n1:23:26.360 --> 1:23:29.920\n This is the folding of the genome onto itself.\n\n1:23:29.920 --> 1:23:32.200\n How do you even figure out the folding?\n\n1:23:32.200 --> 1:23:36.760\n It's a little bit of a tangent, but it's a super awesome technology.\n\n1:23:36.760 --> 1:23:41.960\n Think of the genome as again, this massive packaging that we talked about of taking two\n\n1:23:41.960 --> 1:23:48.960\n meters worth of DNA and putting it in something that's a million times smaller than two meters\n\n1:23:48.960 --> 1:23:49.960\n worth of DNA.\n\n1:23:49.960 --> 1:23:51.760\n That's a single cell.\n\n1:23:51.760 --> 1:23:56.160\n You basically have this massive packaging and this packaging basically leads to the\n\n1:23:56.160 --> 1:24:02.600\n chromosome being wrapped around in sort of tight, tight ways in ways, however, that are\n\n1:24:02.600 --> 1:24:07.080\n functionally capable of being reopened and reclosed.\n\n1:24:07.080 --> 1:24:15.000\n So I can then go in and figure out that folding by sort of chopping up the spaghetti soup,\n\n1:24:15.000 --> 1:24:21.000\n putting glue and ligating the segments that were chopped up but nearby each other, and\n\n1:24:21.000 --> 1:24:26.020\n then sequencing through these ligation events to figure out that this region of this chromosome,\n\n1:24:26.020 --> 1:24:28.360\n that region of the chromosome were near each other.\n\n1:24:28.360 --> 1:24:33.560\n That means they were interacting even though they were far away on the genome itself.\n\n1:24:33.560 --> 1:24:42.500\n So that chopping up, sequencing and reglueing is basically giving you folds of the genome\n\n1:24:42.500 --> 1:24:43.500\n that we call.\n\n1:24:43.500 --> 1:24:44.500\n Sorry, can you backtrack?\n\n1:24:44.500 --> 1:24:45.500\n Of course.\n\n1:24:45.500 --> 1:24:50.600\n How does cutting it help you figure out which ones were close in the original folding?\n\n1:24:50.600 --> 1:24:53.440\n So you have a bowl of noodles.\n\n1:24:53.440 --> 1:24:54.760\n Go on.\n\n1:24:54.760 --> 1:24:59.480\n And in that bowl of noodles, some noodles are near each other.\n\n1:24:59.480 --> 1:25:00.480\n Yes.\n\n1:25:00.480 --> 1:25:06.520\n So you throw in a bunch of glue, you basically freeze the noodles in place, throw in a cutter\n\n1:25:06.520 --> 1:25:10.860\n that chops up the noodles into little pieces.\n\n1:25:10.860 --> 1:25:18.040\n Now throw in some ligation enzyme that lets those pieces that were free religate near\n\n1:25:18.040 --> 1:25:19.080\n each other.\n\n1:25:19.080 --> 1:25:24.240\n In some cases, they religate what you had just cut, but that's very rare.\n\n1:25:24.240 --> 1:25:30.320\n Most of the time they will religate in whatever was proximal.\n\n1:25:30.320 --> 1:25:36.760\n You now have glued the red noodle that was crossing the blue noodle to each other.\n\n1:25:36.760 --> 1:25:43.020\n You then reverse the glue, the glue goes away and you just sequence the heck out of it.\n\n1:25:43.020 --> 1:25:48.640\n Most of the time you'll find red segment with, you know, red segment, but you can specifically\n\n1:25:48.640 --> 1:25:52.640\n select for ligation events that have happened that were not from the same segment by sort\n\n1:25:52.640 --> 1:25:57.360\n of marking them in a particular way and then selecting those and then you sequence and\n\n1:25:57.360 --> 1:26:03.400\n you look for red with blue matches of sort of things that were glued that were not immediate\n\n1:26:03.400 --> 1:26:05.520\n proximal to each other.\n\n1:26:05.520 --> 1:26:08.640\n And that reveals the linking of the blue noodle and the red noodle.\n\n1:26:08.640 --> 1:26:09.640\n You're with me so far?\n\n1:26:09.640 --> 1:26:10.640\n Yeah.\n\n1:26:10.640 --> 1:26:11.640\n Good.\n\n1:26:11.640 --> 1:26:12.640\n So we've done these experiments.\n\n1:26:12.640 --> 1:26:13.640\n That's the physical.\n\n1:26:13.640 --> 1:26:14.640\n That's the physical.\n\n1:26:14.640 --> 1:26:15.820\n That's step one of the physical.\n\n1:26:15.820 --> 1:26:20.000\n And what the physical revealed is topologically associated domains, basically big blocks of\n\n1:26:20.000 --> 1:26:25.040\n the genome that are topologically connected together.\n\n1:26:25.040 --> 1:26:26.300\n That's the physical.\n\n1:26:26.300 --> 1:26:30.060\n The second one is the genetic links.\n\n1:26:30.060 --> 1:26:37.220\n It basically says across individuals that have different genetic variants, how are their\n\n1:26:37.220 --> 1:26:39.400\n genes expressed differently?\n\n1:26:39.400 --> 1:26:43.080\n Remember before I was saying that the path between genetics and disease is enormous,\n\n1:26:43.080 --> 1:26:47.520\n but we can break it up to look at the path between genetics and gene expression.\n\n1:26:47.520 --> 1:26:54.480\n So instead of using Alzheimer's as a phenotype, I can now use expression of IRX3 as the phenotype,\n\n1:26:54.480 --> 1:27:01.160\n expression of gene A. And I can look at all of the humans who contain a G at that location\n\n1:27:01.160 --> 1:27:05.360\n and all the humans that contain a T at that location and basically say, wow, it turns\n\n1:27:05.360 --> 1:27:09.480\n out that the expression of each gene is higher for the T humans than for the G humans at\n\n1:27:09.480 --> 1:27:10.660\n that location.\n\n1:27:10.660 --> 1:27:16.560\n So that basically gives me a genetic link between a genetic variant, a locus, a region,\n\n1:27:16.560 --> 1:27:19.960\n and the expression of nearby genes.\n\n1:27:19.960 --> 1:27:20.960\n Good on the genetic link?\n\n1:27:20.960 --> 1:27:21.960\n I think so.\n\n1:27:21.960 --> 1:27:22.960\n Awesome.\n\n1:27:22.960 --> 1:27:25.480\n The third genetic link is the activity link.\n\n1:27:25.480 --> 1:27:26.480\n What's an activity link?\n\n1:27:26.480 --> 1:27:34.320\n It basically says if I look across 833 different epigenomes, whenever this enhancer is active,\n\n1:27:34.320 --> 1:27:36.040\n this gene is active.\n\n1:27:36.040 --> 1:27:42.340\n That gives me an activity link between this region of the DNA and that gene.\n\n1:27:42.340 --> 1:27:47.140\n And then the fourth one is perturbations where I can go in and blow up that region and see\n\n1:27:47.140 --> 1:27:51.900\n what are the genes that change in expression, or I can go in and over activate that region\n\n1:27:51.900 --> 1:27:55.120\n and see what genes change in expression.\n\n1:27:55.120 --> 1:27:57.240\n So I guess that's similar to activity?\n\n1:27:57.240 --> 1:27:58.240\n Yeah.\n\n1:27:58.240 --> 1:27:59.240\n Yeah.\n\n1:27:59.240 --> 1:28:00.240\n So that's basically similar to activity.\n\n1:28:00.240 --> 1:28:02.760\n I agree, but it's causal rather than correlational.\n\n1:28:02.760 --> 1:28:04.960\n Again, I'm a little weird.\n\n1:28:04.960 --> 1:28:07.160\n No, no, you're 100% on.\n\n1:28:07.160 --> 1:28:11.440\n It's exactly the same as the perturbation where I go in and intervene.\n\n1:28:11.440 --> 1:28:13.800\n I basically take a bunch of cells.\n\n1:28:13.800 --> 1:28:16.160\n So you know CRISPR, right?\n\n1:28:16.160 --> 1:28:21.500\n CRISPR is this genome guidance and cutting mechanism.\n\n1:28:21.500 --> 1:28:24.680\n That's what George Church likes to call genome vandalism.\n\n1:28:24.680 --> 1:28:32.720\n So you basically are able to, you can basically take a guide RNA that you put into the CRISPR\n\n1:28:32.720 --> 1:28:38.200\n system, and the CRISPR system will basically use this guide RNA, scan the genome, find\n\n1:28:38.200 --> 1:28:42.560\n wherever there's a match, and then cut the genome.\n\n1:28:42.560 --> 1:28:48.000\n So I digress, but it's a bacterial immune defense system.\n\n1:28:48.000 --> 1:28:54.280\n So basically bacteria are constantly attacked by viruses, but sometimes they win against\n\n1:28:54.280 --> 1:28:56.960\n the viruses and they chop up these viruses.\n\n1:28:56.960 --> 1:29:02.800\n And remember as a trophy inside their genome, they have these loci, these CRISPR loci that\n\n1:29:02.800 --> 1:29:06.400\n basically stands for clustered repeats, interspersed, et cetera.\n\n1:29:06.400 --> 1:29:11.900\n So basically it's an interspersed repeats structure where basically you have a set of\n\n1:29:11.900 --> 1:29:17.400\n repetitive regions and then interspersed where these variable segments that were basically\n\n1:29:17.400 --> 1:29:19.600\n matching viruses.\n\n1:29:19.600 --> 1:29:24.240\n So when this was first discovered, it was basically hypothesized that this is probably\n\n1:29:24.240 --> 1:29:30.360\n a bacterial immune system that remembers the trophies of the viruses that managed to kill.\n\n1:29:30.360 --> 1:29:34.720\n And then the bacteria pass on, you know, they sort of do lateral transfer of DNA and they\n\n1:29:34.720 --> 1:29:39.120\n pass on these memories so that the next bacterium says, Ooh, you killed that guy.\n\n1:29:39.120 --> 1:29:41.700\n When that guy shows up again, I will recognize him.\n\n1:29:41.700 --> 1:29:47.320\n And the CRISPR system was basically evolved as a bacterial adaptive immune response to\n\n1:29:47.320 --> 1:29:52.560\n sense foreigners that should not belong and to just go and cut their genome.\n\n1:29:52.560 --> 1:30:00.280\n So it's an RNA guided RNA cutting enzyme or an RNA guided DNA cutting enzyme.\n\n1:30:00.280 --> 1:30:02.240\n So there's different systems.\n\n1:30:02.240 --> 1:30:08.620\n Some of them cut DNA, some of them cut RNA, but all of them remember this sort of viral\n\n1:30:08.620 --> 1:30:10.660\n attack.\n\n1:30:10.660 --> 1:30:15.920\n So what we have done now as a field is, you know, through the work of, you know, Jennifer\n\n1:30:15.920 --> 1:30:23.240\n Donne, Manuel Carpentier, Feng Zhang and many others is coopted that system of bacterial\n\n1:30:23.240 --> 1:30:26.520\n immune defense as a way to cut genomes.\n\n1:30:26.520 --> 1:30:35.280\n You basically have this guiding system that allows you to use an RNA guide to bring enzymes\n\n1:30:35.280 --> 1:30:37.760\n to cut DNA at a particular locus.\n\n1:30:37.760 --> 1:30:39.240\n That's so fascinating.\n\n1:30:39.240 --> 1:30:45.600\n So this is like already a natural mechanism, a natural tool for cutting those useful as\n\n1:30:45.600 --> 1:30:46.600\n particular context.\n\n1:30:46.600 --> 1:30:51.160\n And we're like, well, we can use that thing to actually, it's a nice tool that's already\n\n1:30:51.160 --> 1:30:52.160\n in the body.\n\n1:30:52.160 --> 1:30:53.160\n Yeah.\n\n1:30:53.160 --> 1:30:54.160\n Yeah.\n\n1:30:54.160 --> 1:30:55.160\n It's not in our body.\n\n1:30:55.160 --> 1:30:56.160\n It's in the bacterial body.\n\n1:30:56.160 --> 1:30:59.320\n It was discovered by the yogurt industry.\n\n1:30:59.320 --> 1:31:03.640\n They were trying to make better yogurts and they were trying to make their bacteria in\n\n1:31:03.640 --> 1:31:08.400\n their yogurt cultures more resilient to viruses.\n\n1:31:08.400 --> 1:31:12.480\n And they were studying bacteria and they found that, wow, this CRISPR system is awesome.\n\n1:31:12.480 --> 1:31:14.820\n It allows you to defend against that.\n\n1:31:14.820 --> 1:31:20.600\n And then it was coopted in mammalian systems that don't use anything like that as a targeting\n\n1:31:20.600 --> 1:31:25.800\n way to basically bring these DNA cutting enzymes to any locus in the genome.\n\n1:31:25.800 --> 1:31:29.620\n Why would you want to cut DNA to do anything?\n\n1:31:29.620 --> 1:31:35.040\n The reason is that our DNA has a DNA repair mechanism where if a region of the genome\n\n1:31:35.040 --> 1:31:40.520\n gets randomly cut, you will basically scan the genome for anything that matches and sort\n\n1:31:40.520 --> 1:31:43.480\n of use it by homology.\n\n1:31:43.480 --> 1:31:47.240\n So the reason why we're deployed is because we now have a spare copy.\n\n1:31:47.240 --> 1:31:50.640\n As soon as my mom's copy is deactivated, I can use my dad's copy.\n\n1:31:50.640 --> 1:31:55.240\n And somewhere else, if my dad's copy is deactivated, I can use my mom's copy to repair it.\n\n1:31:55.240 --> 1:31:59.720\n So this is called homologous based repair.\n\n1:31:59.720 --> 1:32:04.080\n So all you have to do is the cutting and you don't have to do the fixing.\n\n1:32:04.080 --> 1:32:05.080\n That's exactly right.\n\n1:32:05.080 --> 1:32:06.080\n You don't have to do the fixing.\n\n1:32:06.080 --> 1:32:07.320\n Because it's already built in.\n\n1:32:07.320 --> 1:32:08.560\n That's exactly right.\n\n1:32:08.560 --> 1:32:14.720\n But the fixing can be coopted by throwing in a bunch of homologous segments that instead\n\n1:32:14.720 --> 1:32:19.960\n of having your dad's version, have whatever other version you'd like to use.\n\n1:32:19.960 --> 1:32:24.040\n So you then control the fixing by throwing in a bunch of other stuff.\n\n1:32:24.040 --> 1:32:25.040\n That's exactly right.\n\n1:32:25.040 --> 1:32:26.440\n And that's how you do genome editing.\n\n1:32:26.440 --> 1:32:27.880\n So that's what CRISPR is.\n\n1:32:27.880 --> 1:32:28.880\n That's what CRISPR is.\n\n1:32:28.880 --> 1:32:30.840\n In popular culture, people use the term.\n\n1:32:30.840 --> 1:32:32.640\n I've never, wow, that's brilliant.\n\n1:32:32.640 --> 1:32:39.080\n So CRISPR is genome vandalism followed by a bunch of band aids that have the sequence\n\n1:32:39.080 --> 1:32:40.080\n that you'd like.\n\n1:32:40.080 --> 1:32:43.000\n And you could control the choices of band aids.\n\n1:32:43.000 --> 1:32:44.000\n Correct.\n\n1:32:44.000 --> 1:32:46.360\n And of course there's new generations of CRISPR.\n\n1:32:46.360 --> 1:32:50.880\n There's something that's called prime editing that was sort of very, very much in the press\n\n1:32:50.880 --> 1:32:55.360\n recently that basically instead of sort of making a double stranded break, which again\n\n1:32:55.360 --> 1:33:00.820\n is genome vandalism, you basically make a single stranded break.\n\n1:33:00.820 --> 1:33:06.640\n You basically just nick one of the two strands, enabling you to sort of peel off without sort\n\n1:33:06.640 --> 1:33:13.280\n of completely breaking it up and then repair it locally using a guide that is coupled to\n\n1:33:13.280 --> 1:33:18.600\n your initial RNA that took you to that location.\n\n1:33:18.600 --> 1:33:24.000\n Dumb question, but is CRISPR as awesome and cool as it sounds?\n\n1:33:24.000 --> 1:33:31.820\n I mean, technically speaking, in terms of like as a tool for manipulating our genetics\n\n1:33:31.820 --> 1:33:39.040\n in the positive meaning of the word manipulating, or is there downsides, drawbacks in this whole\n\n1:33:39.040 --> 1:33:42.920\n context of therapeutics that we're talking about or understanding and so on?\n\n1:33:42.920 --> 1:33:50.040\n So when I teach my students about CRISPR, I show them articles with the headline, genome\n\n1:33:50.040 --> 1:33:53.120\n editing tool revolutionizes biology.\n\n1:33:53.120 --> 1:33:58.360\n And then I show them the date of these articles and they're 2004, like five years before CRISPR\n\n1:33:58.360 --> 1:33:59.760\n was invented.\n\n1:33:59.760 --> 1:34:02.360\n And the reason is that they're not talking about CRISPR.\n\n1:34:02.360 --> 1:34:07.520\n They're talking about zinc finger enzymes that are another way to bring these cutters\n\n1:34:07.520 --> 1:34:09.040\n to the genome.\n\n1:34:09.040 --> 1:34:13.880\n It's a very difficult way of sort of designing the right set of zinc finger proteins, the\n\n1:34:13.880 --> 1:34:20.280\n right set of amino acids that will now target a particular long stretch of DNA because for\n\n1:34:20.280 --> 1:34:25.760\n every location that you want to target, you need to design a particular regulator, a particular\n\n1:34:25.760 --> 1:34:28.800\n protein that will match that region well.\n\n1:34:28.800 --> 1:34:35.240\n There's another technology called talons, which are basically just a different way of\n\n1:34:35.240 --> 1:34:41.440\n using proteins to sort of guide these cutters to a particular location of the genome.\n\n1:34:41.440 --> 1:34:46.520\n These require a massive team of engineers, of biological engineers to basically design\n\n1:34:46.520 --> 1:34:51.480\n a set of amino acids that will target a particular sequence of your genome.\n\n1:34:51.480 --> 1:34:57.080\n The reason why CRISPR is amazingly, awesomely revolutionary is because instead of having\n\n1:34:57.080 --> 1:35:02.200\n this team of engineers design a new set of proteins for every locus that you want to\n\n1:35:02.200 --> 1:35:07.680\n target, you just type it in your computer and you just synthesize an RNA guide.\n\n1:35:07.680 --> 1:35:11.100\n The beauty of CRISPR is not the cutting, it's not the fixing.\n\n1:35:11.100 --> 1:35:12.880\n All of that was there before.\n\n1:35:12.880 --> 1:35:17.880\n It's the guiding, and the only thing that changes is that it makes the guiding easier\n\n1:35:17.880 --> 1:35:23.940\n by sort of just typing in the RNA sequence, which then allows the system to sort of scan\n\n1:35:23.940 --> 1:35:25.880\n the DNA to find that.\n\n1:35:25.880 --> 1:35:32.280\n So the coding, the engineering of the cutter is easier in terms of SP.\n\n1:35:32.280 --> 1:35:37.200\n That's kind of similar to the story of deep learning versus old school machine learning.\n\n1:35:37.200 --> 1:35:41.080\n Some of the challenging parts are automated.\n\n1:35:41.080 --> 1:35:47.180\n But CRISPR is just one cutting technology, and then that's part of the challenges and\n\n1:35:47.180 --> 1:35:53.020\n exciting opportunities of the field is to design different cutting technologies.\n\n1:35:53.020 --> 1:36:00.840\n So now this was a big parenthesis on CRISPR, but now when we were talking about perturbations,\n\n1:36:00.840 --> 1:36:04.720\n you basically now have the ability to not just look at correlation between enhancers\n\n1:36:04.720 --> 1:36:10.760\n and genes, but actually go and either destroy that enhancer and see if the gene changes\n\n1:36:10.760 --> 1:36:20.000\n in expression, or you can use the CRISPR targeting system to bring in not vandalism and cutting,\n\n1:36:20.000 --> 1:36:26.720\n but you can couple the CRISPR system with, and the CRISPR system is called usually CRISPR\n\n1:36:26.720 --> 1:36:30.920\n Cas9 because Cas9 is the protein that will then come and cut.\n\n1:36:30.920 --> 1:36:36.760\n But there's a version of that protein called dead Cas9 where the cutting part is deactivated.\n\n1:36:36.760 --> 1:36:45.040\n So you basically use the dead Cas9 to bring in an activator or to bring in a repressor.\n\n1:36:45.040 --> 1:36:51.920\n So you can now ask, is this enhancer changing that gene by taking this modified CRISPR,\n\n1:36:51.920 --> 1:36:55.560\n which is already modified from the bacteria to be used in humans, that you can now modify\n\n1:36:55.560 --> 1:37:01.120\n the Cas9 to be dead Cas9, and you can now further modify to bring in a regulator, and\n\n1:37:01.120 --> 1:37:05.000\n you can basically turn on or turn off that enhancer and then see what is the impact on\n\n1:37:05.000 --> 1:37:06.620\n that gene.\n\n1:37:06.620 --> 1:37:11.840\n So these are the four ways of linking the locus to the target gene, and that's step\n\n1:37:11.840 --> 1:37:14.240\n number five.\n\n1:37:14.240 --> 1:37:17.960\n Step number five is find the target gene, and step number six is what the heck does\n\n1:37:17.960 --> 1:37:19.560\n that gene do?\n\n1:37:19.560 --> 1:37:25.840\n You basically now go and manipulate that gene to basically see what are the processes that\n\n1:37:25.840 --> 1:37:32.400\n change, and you can basically ask, well, in this particular case, in the FTO locus, we\n\n1:37:32.400 --> 1:37:38.160\n found mesenchymal stem cells that are the progenitors of white fat and brown fat or\n\n1:37:38.160 --> 1:37:39.580\n beige fat.\n\n1:37:39.580 --> 1:37:44.880\n We found the RS1421085 nucleotide variant as the causal variant.\n\n1:37:44.880 --> 1:37:49.720\n We found this large enhancer, this master regulator.\n\n1:37:49.720 --> 1:37:55.720\n I like to call it OB1 for obesity one, like the strongest enhancer associated with it,\n\n1:37:55.720 --> 1:37:57.120\n and OB1 was kind of chubby as the actor.\n\n1:37:57.120 --> 1:38:01.120\n I don't know if you remember him.\n\n1:38:01.120 --> 1:38:07.320\n So you basically are using this Jedi mind trick to basically find out the location of\n\n1:38:07.320 --> 1:38:14.120\n the genome that is responsible, the enhancer that harbors it, the motif, the upstream regulator,\n\n1:38:14.120 --> 1:38:18.200\n which is ARID5B for AT rich interacting domain 5B.\n\n1:38:18.200 --> 1:38:21.040\n That's a protein that sort of comes and binds normally.\n\n1:38:21.040 --> 1:38:23.220\n That protein is normally a repressor.\n\n1:38:23.220 --> 1:38:28.520\n It represses this super enhancer, this massive 12,000 nucleotide master regulatory control\n\n1:38:28.520 --> 1:38:36.120\n gene, and it turns off IRX3, which is a gene that's 600,000 nucleotides away, and IRX5,\n\n1:38:36.120 --> 1:38:38.480\n which is 1.2 million nucleotides away.\n\n1:38:38.480 --> 1:38:39.480\n So those things.\n\n1:38:39.480 --> 1:38:40.760\n And what's the effect of turning them off?\n\n1:38:40.760 --> 1:38:42.320\n That's exactly the next question.\n\n1:38:42.320 --> 1:38:45.520\n So step six is what do these genes actually do?\n\n1:38:45.520 --> 1:38:48.640\n So we then ask, what does RX3 and RX5 do?\n\n1:38:48.640 --> 1:38:52.940\n The first thing we did is look across individuals for individuals that had higher expression\n\n1:38:52.940 --> 1:38:55.520\n of RX3 or lower expression RX3.\n\n1:38:55.520 --> 1:38:58.960\n And then we looked at the expression of all of the other genes in the genome.\n\n1:38:58.960 --> 1:39:01.580\n And we looked for simply correlation.\n\n1:39:01.580 --> 1:39:09.820\n And we found that RX3 and RX5 were both correlated positively with lipid metabolism and negatively\n\n1:39:09.820 --> 1:39:11.800\n with mitochondrial biogenesis.\n\n1:39:11.800 --> 1:39:16.400\n You're like, what the heck does that mean?\n\n1:39:16.400 --> 1:39:18.120\n Does this sound related to obesity?\n\n1:39:18.120 --> 1:39:25.500\n Not at all superficially, but lipid metabolism should, because lipids is these high and\n\n1:39:25.500 --> 1:39:28.560\n energy molecules that basically store fat.\n\n1:39:28.560 --> 1:39:33.760\n So RX3 and RX5 are negatively correlated with lipid metabolism.\n\n1:39:33.760 --> 1:39:39.000\n So that basically means that when they turn on, positively, when they turn on, they turn\n\n1:39:39.000 --> 1:39:41.280\n on lipid metabolism.\n\n1:39:41.280 --> 1:39:45.920\n And they're negatively correlated with mitochondrial biogenesis.\n\n1:39:45.920 --> 1:39:49.160\n What do mitochondria do in this whole process?\n\n1:39:49.160 --> 1:39:53.280\n Again, small parenthesis, what are mitochondria?\n\n1:39:53.280 --> 1:39:56.360\n Mitochondria are little organelles.\n\n1:39:56.360 --> 1:40:01.120\n They arose, they only are found in eukaryotes.\n\n1:40:01.120 --> 1:40:04.000\n U means good, karyote means nucleus.\n\n1:40:04.000 --> 1:40:05.920\n So truly like a true nucleus.\n\n1:40:05.920 --> 1:40:07.880\n So eukaryotes have a nucleus.\n\n1:40:07.880 --> 1:40:09.960\n Prokaryotes are before the nucleus.\n\n1:40:09.960 --> 1:40:11.280\n They don't have a nucleus.\n\n1:40:11.280 --> 1:40:16.840\n So eukaryotes have a nucleus, compartmentalization.\n\n1:40:16.840 --> 1:40:19.680\n Eukaryotes have also organelles.\n\n1:40:19.680 --> 1:40:22.800\n Some eukaryotes have chloroplasts.\n\n1:40:22.800 --> 1:40:26.480\n These are the plants, they photosynthesize.\n\n1:40:26.480 --> 1:40:33.480\n Some other eukaryotes like us have another type of organelle called mitochondria.\n\n1:40:33.480 --> 1:40:40.360\n These arose from an ancient species that we engulfed.\n\n1:40:40.360 --> 1:40:44.360\n This is an endosymbiosis event.\n\n1:40:44.360 --> 1:40:47.320\n Symbiosis bio means life, sim means together.\n\n1:40:47.320 --> 1:40:50.800\n So symbiotes are things that live together.\n\n1:40:50.800 --> 1:40:54.240\n Symbiosis endo means inside, so endosymbiosis means you live together holding the other\n\n1:40:54.240 --> 1:40:56.120\n one inside you.\n\n1:40:56.120 --> 1:41:07.240\n So the pre eukaryotes engulfed an organism that was very good at energy production and\n\n1:41:07.240 --> 1:41:14.200\n that organism eventually shed most of its genome to now have only 13 genes in the mitochondrial\n\n1:41:14.200 --> 1:41:22.400\n genome and those 13 genes are all involved in energy production, the electron transport\n\n1:41:22.400 --> 1:41:23.400\n chain.\n\n1:41:23.400 --> 1:41:28.560\n So basically electrons are these massive super energy rich molecules.\n\n1:41:28.560 --> 1:41:35.760\n We basically have these organelles that produce energy and when your muscle exercises, you\n\n1:41:35.760 --> 1:41:37.800\n basically multiply your mitochondria.\n\n1:41:37.800 --> 1:41:42.960\n You basically sort of, you know, use more and more mitochondria and that's how you get\n\n1:41:42.960 --> 1:41:43.960\n beefed up.\n\n1:41:43.960 --> 1:41:47.840\n So basically the muscle sort of learns how to generate more energy.\n\n1:41:47.840 --> 1:41:51.680\n So basically every single time your muscles will, you know, overnight regenerate and sort\n\n1:41:51.680 --> 1:41:55.240\n of become stronger and amplify their mitochondria and so forth.\n\n1:41:55.240 --> 1:41:56.480\n So what does mitochondria do?\n\n1:41:56.480 --> 1:42:02.200\n The mitochondria use energy to sort of do any kind of task.\n\n1:42:02.200 --> 1:42:05.000\n When you're thinking, you're using energy.\n\n1:42:05.000 --> 1:42:06.960\n This energy comes from mitochondria.\n\n1:42:06.960 --> 1:42:10.040\n Your neurons have mitochondria all over the place.\n\n1:42:10.040 --> 1:42:13.340\n Basically this mitochondria can multiply as organelles and they can be spread along the\n\n1:42:13.340 --> 1:42:15.040\n body of your muscle.\n\n1:42:15.040 --> 1:42:18.840\n Some of your muscle cells have actually multiple nuclei, they're polynucleated, but they also\n\n1:42:18.840 --> 1:42:24.380\n have multiple mitochondria to basically deal with the fact that your muscle is enormous.\n\n1:42:24.380 --> 1:42:28.040\n You can sort of span these super, super long length and you need energy throughout the\n\n1:42:28.040 --> 1:42:29.360\n length of your muscle.\n\n1:42:29.360 --> 1:42:32.340\n So that's why you have mitochondria throughout the length and you also need transcription\n\n1:42:32.340 --> 1:42:35.080\n through the length so you have multiple nuclei as well.\n\n1:42:35.080 --> 1:42:42.060\n So these two processes, lipids store energy, what do mitochondria do?\n\n1:42:42.060 --> 1:42:46.040\n So there's a process known as thermogenesis.\n\n1:42:46.040 --> 1:42:48.520\n Thermal heat, genesis generation.\n\n1:42:48.520 --> 1:42:50.600\n Thermogenesis is the generation of heat.\n\n1:42:50.600 --> 1:42:55.160\n Remember that bathtub with the in and out?\n\n1:42:55.160 --> 1:42:57.160\n That's the equation that everybody's focused on.\n\n1:42:57.160 --> 1:42:58.860\n So how much energy do you consume?\n\n1:42:58.860 --> 1:43:01.000\n How much energy do you burn?\n\n1:43:01.000 --> 1:43:06.060\n But in every thermodynamic system, there's three parts to the equation.\n\n1:43:06.060 --> 1:43:10.900\n There's energy in, energy out, and energy lost.\n\n1:43:10.900 --> 1:43:14.680\n Any machine has loss of energy.\n\n1:43:14.680 --> 1:43:15.720\n How do you lose energy?\n\n1:43:15.720 --> 1:43:17.600\n You emanate heat.\n\n1:43:17.600 --> 1:43:20.000\n So heat is energy loss.\n\n1:43:20.000 --> 1:43:24.760\n So there's...\n\n1:43:24.760 --> 1:43:26.600\n Which is where the thermogenesis comes in.\n\n1:43:26.600 --> 1:43:32.240\n Thermogenesis is actually a regulatory process that modulates the third component of the\n\n1:43:32.240 --> 1:43:34.060\n thermodynamic equation.\n\n1:43:34.060 --> 1:43:37.240\n You can basically control thermogenesis explicitly.\n\n1:43:37.240 --> 1:43:39.080\n You can turn on and turn off thermogenesis.\n\n1:43:39.080 --> 1:43:41.400\n And that's where the mitochondria comes into play.\n\n1:43:41.400 --> 1:43:42.400\n Exactly.\n\n1:43:42.400 --> 1:43:49.600\n So Irix3 and RX5 turn out to be the master regulators of a process of thermogenesis versus\n\n1:43:49.600 --> 1:43:52.360\n lipogenesis generation of fat.\n\n1:43:52.360 --> 1:43:58.720\n So Irix3 and RX5 in most people burn heat, burn calories as heat.\n\n1:43:58.720 --> 1:44:02.720\n So when you eat too much, just burn it off in your fat cells.\n\n1:44:02.720 --> 1:44:11.140\n So that bathtub has basically a sort of dissipation knob that most people are able to turn on.\n\n1:44:11.140 --> 1:44:17.720\n I am unable to turn that on because I am a homozygous carrier for the mutation that changes\n\n1:44:17.720 --> 1:44:24.560\n a T into a C in the RS1421085 allele and locus, a SNP.\n\n1:44:24.560 --> 1:44:28.320\n I have the risk allele twice from my mom and from my dad.\n\n1:44:28.320 --> 1:44:31.880\n So I'm unable to thermogenize.\n\n1:44:31.880 --> 1:44:37.320\n I'm unable to turn on thermogenesis through Irix3 and RX5 because the regulator that normally\n\n1:44:37.320 --> 1:44:42.720\n binds here, Irix5b, can no longer bind because it's an AT rich interacting domain.\n\n1:44:42.720 --> 1:44:46.440\n And as soon as I change the T into a C, it can no longer bind because it's no longer\n\n1:44:46.440 --> 1:44:47.440\n AT rich.\n\n1:44:47.440 --> 1:44:52.280\n But doesn't that mean that you're able to use the energy more efficiently?\n\n1:44:52.280 --> 1:44:54.120\n You're not generating heat or is that?\n\n1:44:54.120 --> 1:44:56.920\n That means I can eat less and get around just fine.\n\n1:44:56.920 --> 1:44:57.920\n Yes.\n\n1:44:57.920 --> 1:44:58.920\n Yeah.\n\n1:44:58.920 --> 1:44:59.920\n So that's a feature actually.\n\n1:44:59.920 --> 1:45:02.040\n It's a feature in a food scarce environment.\n\n1:45:02.040 --> 1:45:03.040\n Yeah.\n\n1:45:03.040 --> 1:45:05.160\n But if we're all starving, I'm doing great.\n\n1:45:05.160 --> 1:45:09.360\n If we all have access to massive amounts of food, I'm obese basically.\n\n1:45:09.360 --> 1:45:14.920\n That's taken us to the entire process of then understanding that why mitochondria and then\n\n1:45:14.920 --> 1:45:18.600\n the lipids are both, even though distant, are somehow involved.\n\n1:45:18.600 --> 1:45:20.760\n Different sides of the same coin.\n\n1:45:20.760 --> 1:45:24.000\n And you basically choose to store energy or you can choose to burn energy.\n\n1:45:24.000 --> 1:45:27.800\n And then all of that is involved in the puzzle of obesity.\n\n1:45:27.800 --> 1:45:29.760\n And that's what's fascinating, right?\n\n1:45:29.760 --> 1:45:35.360\n Here we are in 2007, discovering the strongest genetic association with obesity and knowing\n\n1:45:35.360 --> 1:45:39.460\n nothing about how it works for almost 10 years.\n\n1:45:39.460 --> 1:45:43.840\n For 10 years, everybody focused on this FTO gene and they were like, oh, it must have\n\n1:45:43.840 --> 1:45:46.240\n to do something with RNA modification.\n\n1:45:46.240 --> 1:45:50.760\n And it's like, no, it has nothing to do with the function of FTO.\n\n1:45:50.760 --> 1:45:53.880\n It has everything to do with all of these other processes.\n\n1:45:53.880 --> 1:45:58.680\n And suddenly the moment you solve that puzzle, which is a multiyear effort by the way, a\n\n1:45:58.680 --> 1:46:01.880\n tremendous effort by Melina and many, many others.\n\n1:46:01.880 --> 1:46:07.160\n So this tremendous effort basically led us to recognize this circuitry.\n\n1:46:07.160 --> 1:46:12.500\n You went from having some 89 common variants associated in that region of the DNA sitting\n\n1:46:12.500 --> 1:46:17.840\n on top of this gene to knowing the whole circuitry.\n\n1:46:17.840 --> 1:46:21.160\n When you know the circuitry, you can now go crazy.\n\n1:46:21.160 --> 1:46:24.480\n You can now start intervening at every level.\n\n1:46:24.480 --> 1:46:27.240\n You can start intervening at the arid 5B level.\n\n1:46:27.240 --> 1:46:31.280\n You can start intervening with CRISPR Cas9 at the single SNP level.\n\n1:46:31.280 --> 1:46:34.860\n You can start intervening at iRx3 and iRx5 directly there.\n\n1:46:34.860 --> 1:46:38.400\n You can start intervening at the thermogenesis level because you know the pathway.\n\n1:46:38.400 --> 1:46:45.280\n You can start intervening at the differentiation level where the decision to make either white\n\n1:46:45.280 --> 1:46:51.500\n fat or beige fat, the energy burning beige fat is made developmentally in the first three\n\n1:46:51.500 --> 1:46:54.040\n days of differentiation of your adipocytes.\n\n1:46:54.040 --> 1:46:57.720\n So as they're differentiating, you basically can choose to make fat burning machines or\n\n1:46:57.720 --> 1:46:59.320\n fat storing machines.\n\n1:46:59.320 --> 1:47:02.320\n And sort of that's how you populate your fat.\n\n1:47:02.320 --> 1:47:05.880\n You basically can now go in pharmaceutical and do all of that.\n\n1:47:05.880 --> 1:47:09.400\n And in our paper, we actually did all of that.\n\n1:47:09.400 --> 1:47:12.320\n We went in and manipulated every single aspect.\n\n1:47:12.320 --> 1:47:18.200\n At the nucleotide level, we use CRISPR Cas9 genome editing to basically take primary adipocytes\n\n1:47:18.200 --> 1:47:24.080\n from risk and non risk individuals and show that by editing that one nucleotide out of\n\n1:47:24.080 --> 1:47:29.600\n 3.2 billion nucleotides in the human genome, you could then flip between an obese phenotype\n\n1:47:29.600 --> 1:47:31.500\n and a lean phenotype like a switch.\n\n1:47:31.500 --> 1:47:36.240\n You can basically take my cells that are non thermogenizing and just flip into thermogenizing\n\n1:47:36.240 --> 1:47:38.640\n cells by changing one nucleotide.\n\n1:47:38.640 --> 1:47:40.080\n It's mind boggling.\n\n1:47:40.080 --> 1:47:44.880\n It's so inspiring that this puzzle could be solved in this way and it feels within reach\n\n1:47:44.880 --> 1:47:50.560\n to then be able to crack the problem of some of these diseases.\n\n1:47:50.560 --> 1:48:00.480\n What are the technologies, the tools that came along that made this possible?\n\n1:48:00.480 --> 1:48:01.980\n What are you excited about?\n\n1:48:01.980 --> 1:48:08.080\n Maybe if we just look at the buffet of things that you've kind of mentioned, what's involved?\n\n1:48:08.080 --> 1:48:09.520\n What should we be excited about?\n\n1:48:09.520 --> 1:48:11.460\n What are you excited about?\n\n1:48:11.460 --> 1:48:14.040\n I love that question because there's so much ahead of us.\n\n1:48:14.040 --> 1:48:18.600\n There's so, so much.\n\n1:48:18.600 --> 1:48:24.000\n So basically solving that one locus required massive amounts of knowledge that we have\n\n1:48:24.000 --> 1:48:28.220\n been building across the years through the epigenome, through the comparative genomics\n\n1:48:28.220 --> 1:48:35.400\n to find out the causal variant and the controller regulatory motif through the conserved circuitry.\n\n1:48:35.400 --> 1:48:38.580\n It required knowing these regulatory genomic wiring.\n\n1:48:38.580 --> 1:48:42.980\n It required high C of these sort of topologically associated domains to basically find these\n\n1:48:42.980 --> 1:48:44.600\n long range interaction.\n\n1:48:44.600 --> 1:48:51.160\n It required EQTLs of these sort of genetic perturbation of these intermediate gene phenotypes.\n\n1:48:51.160 --> 1:48:55.640\n It required all of the arsenal of tools that I've been describing was put together for\n\n1:48:55.640 --> 1:48:57.240\n one locus.\n\n1:48:57.240 --> 1:49:05.840\n And this was a massive team effort, huge investment in time, energy, money, effort, intellectual,\n\n1:49:05.840 --> 1:49:06.840\n everything.\n\n1:49:06.840 --> 1:49:09.640\n You're referring to, I'm sorry, just for the obesity one.\n\n1:49:09.640 --> 1:49:10.640\n Yeah, this one paper.\n\n1:49:10.640 --> 1:49:11.640\n This one single paper.\n\n1:49:11.640 --> 1:49:12.640\n This one single locus.\n\n1:49:12.640 --> 1:49:16.640\n I would like to say that this is a paper about one nucleotide in the human genome, about\n\n1:49:16.640 --> 1:49:20.560\n one bit of information, C versus T in the human genome.\n\n1:49:20.560 --> 1:49:25.320\n That's one bit of information and we have 3.2 billion nucleotides to go through.\n\n1:49:25.320 --> 1:49:29.240\n So how do you do that systematically?\n\n1:49:29.240 --> 1:49:35.000\n I am so excited about the next phase of research because the technologies that my group and\n\n1:49:35.000 --> 1:49:40.080\n many other groups have developed allows us to now do this systematically, not just one\n\n1:49:40.080 --> 1:49:45.120\n locus at a time, but thousands of loci at a time.\n\n1:49:45.120 --> 1:49:48.000\n So let me describe some of these technologies.\n\n1:49:48.000 --> 1:49:52.420\n The first one is automation and robotics.\n\n1:49:52.420 --> 1:49:58.240\n So basically, you know, we talked about how you can take all of these molecules and see\n\n1:49:58.240 --> 1:50:02.200\n which of these molecules are targeting each of these genes and what do they do?\n\n1:50:02.200 --> 1:50:07.700\n So you can basically now screen through millions of molecules through thousands and thousands\n\n1:50:07.700 --> 1:50:12.880\n and thousands of plates, each of which has thousands and thousands and thousands of molecules,\n\n1:50:12.880 --> 1:50:20.560\n every single time testing, you know, all of these genes and asking which of these molecules\n\n1:50:20.560 --> 1:50:22.000\n perturb these genes.\n\n1:50:22.000 --> 1:50:25.880\n So that's technology number one, automation and robotics.\n\n1:50:25.880 --> 1:50:29.280\n Technology number two is parallel readouts.\n\n1:50:29.280 --> 1:50:35.880\n So instead of perturbing one locus and then asking if I use CRISPR Cas9 on this enhancer\n\n1:50:35.880 --> 1:50:41.280\n to basically use dCas9 to turn on or turn off the enhancer, or if I use CRISPR Cas9\n\n1:50:41.280 --> 1:50:46.620\n on the SNP to basically change that one SNP at a time, then what happens?\n\n1:50:46.620 --> 1:50:52.760\n But we have 120,000 disease associated SNPs that we want to test.\n\n1:50:52.760 --> 1:50:57.220\n We don't want to spend 120,000 years doing it.\n\n1:50:57.220 --> 1:50:58.920\n So what do we do?\n\n1:50:58.920 --> 1:51:07.240\n We've basically developed this technology for massively parallel reporter assays, MPRA.\n\n1:51:07.240 --> 1:51:11.240\n So in collaboration with Tarsha Mikkelsen, Eric Lander, I mean, Jason Durie's group has\n\n1:51:11.240 --> 1:51:12.240\n done a lot of that.\n\n1:51:12.240 --> 1:51:19.380\n So there's a lot of groups that basically have developed technologies for testing 10,000\n\n1:51:19.380 --> 1:51:21.420\n genetic variants at a time.\n\n1:51:21.420 --> 1:51:23.000\n How do you do that?\n\n1:51:23.000 --> 1:51:28.880\n You know, we talked about microarray technology, the ability to synthesize these huge microarrays\n\n1:51:28.880 --> 1:51:33.880\n that allow you to do all kinds of things like measure gene expression by hybridization,\n\n1:51:33.880 --> 1:51:38.100\n by measuring the genotype of a person, by looking at hybridization with one version\n\n1:51:38.100 --> 1:51:43.400\n with a T versus the other version with a C, and then sort of figuring out that I am a\n\n1:51:43.400 --> 1:51:49.820\n risk carrier for obesity based on these differential hybridization in my genome that says, oh,\n\n1:51:49.820 --> 1:51:53.320\n you seem to only have this allele or you seem to have that allele.\n\n1:51:53.320 --> 1:51:59.400\n These can also be used to systematically synthesize small fragments of DNA.\n\n1:51:59.400 --> 1:52:07.800\n So you can basically synthesize these 150 nucleotide long fragments across 450,000 spots\n\n1:52:07.800 --> 1:52:10.240\n at a time.\n\n1:52:10.240 --> 1:52:15.820\n You can now take the result of that synthesis, which basically works through all of these\n\n1:52:15.820 --> 1:52:18.760\n sort of layers of adding one nucleotide at a time.\n\n1:52:18.760 --> 1:52:24.000\n You can basically just type it into your computer and order it, and you can basically order\n\n1:52:24.000 --> 1:52:30.740\n 10,000 or 100,000 of these small DNA segments at a time.\n\n1:52:30.740 --> 1:52:33.360\n And that's where awesome molecular biology comes in.\n\n1:52:33.360 --> 1:52:38.840\n You can basically take all these segments, have a common start and end barcode or sort\n\n1:52:38.840 --> 1:52:42.120\n of like Gator, just like pieces of a puzzle.\n\n1:52:42.120 --> 1:52:48.000\n You can make the same end piece and the same start piece for all of them.\n\n1:52:48.000 --> 1:52:57.960\n And you can now use plasmids, which are these extra chromosomal small DNA circular segments\n\n1:52:57.960 --> 1:53:00.560\n that are basically inhabiting all our, all our genomes.\n\n1:53:00.560 --> 1:53:05.200\n We basically have, you know, plasmids from floating around and bacteria use plasmids\n\n1:53:05.200 --> 1:53:07.060\n for transferring DNA.\n\n1:53:07.060 --> 1:53:10.720\n And that's where they put a lot of antibiotic resistance genes.\n\n1:53:10.720 --> 1:53:14.200\n So they can easily transfer them from one bacterium to the other.\n\n1:53:14.200 --> 1:53:20.280\n After one bacterium evolves a gene to be resistant to a particular antibiotic, it basically says\n\n1:53:20.280 --> 1:53:24.760\n to all its friends, Hey, here's that sort of DNA piece.\n\n1:53:24.760 --> 1:53:28.440\n We can now coopt these plasmids into human cells.\n\n1:53:28.440 --> 1:53:34.000\n You can basically make a human cell culture and add plasmids to that human cell culture\n\n1:53:34.000 --> 1:53:38.120\n that contain the things that you want to test.\n\n1:53:38.120 --> 1:53:41.320\n You now have this library of 450,000 elements.\n\n1:53:41.320 --> 1:53:47.880\n You can insert them each into the common plasmid and then test them in millions of cells in\n\n1:53:47.880 --> 1:53:48.880\n parallel.\n\n1:53:48.880 --> 1:53:51.160\n And the common plasmid is all the same before you add it.\n\n1:53:51.160 --> 1:53:52.160\n Exactly.\n\n1:53:52.160 --> 1:53:53.300\n The rest of the plasmid is the same.\n\n1:53:53.300 --> 1:53:57.640\n So it's, it's called an epizomal reporter assay.\n\n1:53:57.640 --> 1:53:59.720\n Epizome means not inside the genome.\n\n1:53:59.720 --> 1:54:01.560\n It's sort of outside the chromosomes.\n\n1:54:01.560 --> 1:54:06.200\n So it's an epizomal assay that allows you to have a variable region where you basically\n\n1:54:06.200 --> 1:54:11.720\n test 10,000 different enhancers and you have a common region which basically has the same\n\n1:54:11.720 --> 1:54:13.720\n reporter gene.\n\n1:54:13.720 --> 1:54:16.600\n You now can do some very cool molecular biology.\n\n1:54:16.600 --> 1:54:21.960\n You can basically take the 450,000 elements that you've generated and you have a piece\n\n1:54:21.960 --> 1:54:24.440\n of the puzzle here, piece of the puzzle here, which is identical.\n\n1:54:24.440 --> 1:54:27.060\n So they're compatible with that plasmid.\n\n1:54:27.060 --> 1:54:32.840\n You can chop them up in the middle to separate a barcode reporter from the enhancer and in\n\n1:54:32.840 --> 1:54:36.920\n the middle put the same gene again using the same piece of the puzzle.\n\n1:54:36.920 --> 1:54:42.960\n You now can have a barcode readout of what is the impact of 10,000 different versions\n\n1:54:42.960 --> 1:54:46.600\n of an enhancer on gene expression.\n\n1:54:46.600 --> 1:54:50.680\n So we're not doing one experiment, we're doing 10,000 experiments.\n\n1:54:50.680 --> 1:54:58.580\n And those 10,000 can be 5,000 of different loci and each of them in two versions, risk\n\n1:54:58.580 --> 1:55:00.260\n or non risk.\n\n1:55:00.260 --> 1:55:01.920\n I can now test tens of thousands.\n\n1:55:01.920 --> 1:55:02.920\n Just a little hypothesis.\n\n1:55:02.920 --> 1:55:03.920\n Exactly.\n\n1:55:03.920 --> 1:55:08.880\n And then you can do 10,000 and we can test 10,000 hypothesis at once.\n\n1:55:08.880 --> 1:55:11.360\n How hard is it to generate those 10,000?\n\n1:55:11.360 --> 1:55:12.360\n Trivial.\n\n1:55:12.360 --> 1:55:13.360\n Trivial.\n\n1:55:13.360 --> 1:55:14.360\n But it's biology.\n\n1:55:14.360 --> 1:55:15.360\n No, no.\n\n1:55:15.360 --> 1:55:20.740\n Generating the 10,000 is trivial because you basically add, it's biotechnology.\n\n1:55:20.740 --> 1:55:26.560\n You basically have these arrays that add one nucleotide at a time at every spot.\n\n1:55:26.560 --> 1:55:30.680\n So it's printing and so you're able to, you're able to control.\n\n1:55:30.680 --> 1:55:31.680\n Yeah.\n\n1:55:31.680 --> 1:55:32.800\n Is it super costly?\n\n1:55:32.800 --> 1:55:33.800\n Is it?\n\n1:55:33.800 --> 1:55:34.800\n 10,000 bucks.\n\n1:55:34.800 --> 1:55:35.800\n So this isn't millions.\n\n1:55:35.800 --> 1:55:39.200\n 10,000 bucks for 10,000 experiments sounds like the right, you know.\n\n1:55:39.200 --> 1:55:44.100\n I mean, so that's super, that's exciting because you don't have to do one thing at a time.\n\n1:55:44.100 --> 1:55:49.280\n You can now use that technology, these massively parallel reporter assays to test 10,000 locations\n\n1:55:49.280 --> 1:55:51.440\n at a time.\n\n1:55:51.440 --> 1:55:55.160\n We've made multiple modifications to that technology.\n\n1:55:55.160 --> 1:56:04.080\n One was sharper MPRA, which stands for, you know, basically getting a higher resolution\n\n1:56:04.080 --> 1:56:14.800\n view by tiling these, these elements so you can see where along the region of control\n\n1:56:14.800 --> 1:56:16.140\n are they acting.\n\n1:56:16.140 --> 1:56:23.240\n And we made another modification called Hydra for high, you know, definition regulatory\n\n1:56:23.240 --> 1:56:30.080\n annotation or something like that, which basically allows you to test 7 million of these at a\n\n1:56:30.080 --> 1:56:32.960\n time by sort of cutting them directly from the DNA.\n\n1:56:32.960 --> 1:56:37.420\n So instead of synthesizing, which basically has the limit of 450,000 that you can synthesize\n\n1:56:37.420 --> 1:56:42.600\n at a time, we basically said, Hey, if we want to test all accessible regions of the genome,\n\n1:56:42.600 --> 1:56:45.620\n let's just do an experiment that cuts accessible regions.\n\n1:56:45.620 --> 1:56:51.520\n Let's take those accessible regions, put them all with the same end joints of the puzzles,\n\n1:56:51.520 --> 1:56:59.680\n and then now use those to create a much, much larger array of things that you can test.\n\n1:56:59.680 --> 1:57:04.160\n And then tiling all of these regions, you can then pinpoint what are the driver nucleotides,\n\n1:57:04.160 --> 1:57:07.520\n what are the elements, how are they acting across 7 million experiments at a time.\n\n1:57:07.520 --> 1:57:12.580\n So basically this is all the same family of technology where you're basically using these\n\n1:57:12.580 --> 1:57:15.900\n parallel readouts of the barcodes.\n\n1:57:15.900 --> 1:57:23.240\n And then to do this, we used a technology called StarSeq for self transcribing reporter\n\n1:57:23.240 --> 1:57:30.140\n assays, a technology developed by Alex Stark, my former postdoc, who's now API over in Vienna.\n\n1:57:30.140 --> 1:57:37.240\n So we basically coupled the StarSeq, the self transcribing reporters where the enhancer\n\n1:57:37.240 --> 1:57:39.040\n can be part of the gene itself.\n\n1:57:39.040 --> 1:57:43.600\n So instead of having a separate barcode, that enhancer basically acts to turn on the gene\n\n1:57:43.600 --> 1:57:46.080\n and it's transcribed as part of the gene.\n\n1:57:46.080 --> 1:57:47.640\n So you don't have to have the two separate parts.\n\n1:57:47.640 --> 1:57:48.640\n Exactly.\n\n1:57:48.640 --> 1:57:49.640\n So you can just read them directly.\n\n1:57:49.640 --> 1:57:52.680\n So there's a constant improvements in this whole process.\n\n1:57:52.680 --> 1:57:57.160\n By the way, generating all these options, is it basically brute force?\n\n1:57:57.160 --> 1:57:58.680\n How much human intuition is?\n\n1:57:58.680 --> 1:58:04.040\n Oh gosh, of course it's human intuition and human creativity and incorporating all of\n\n1:58:04.040 --> 1:58:06.040\n the input data sets.\n\n1:58:06.040 --> 1:58:08.440\n Because again, the genome is enormous.\n\n1:58:08.440 --> 1:58:11.040\n 3.2 billion, you don't want to test that.\n\n1:58:11.040 --> 1:58:14.280\n You basically use all of these tools that I've talked about already.\n\n1:58:14.280 --> 1:58:19.920\n You generate your top favorite 10,000 hypothesis, and then you go and test all 10,000.\n\n1:58:19.920 --> 1:58:24.080\n And then from what comes out, you can then go to the next step.\n\n1:58:24.080 --> 1:58:25.920\n So that's technology number two.\n\n1:58:25.920 --> 1:58:30.440\n So technology number one is robotics, automation, where you have thousands of wells and you\n\n1:58:30.440 --> 1:58:32.140\n constantly test them.\n\n1:58:32.140 --> 1:58:37.320\n The second technology is instead of having wells, you have these massively parallel readouts\n\n1:58:37.320 --> 1:58:40.000\n in sort of these pooled assays.\n\n1:58:40.000 --> 1:58:51.260\n The third technology is coupling CRISPR perturbations with these single cell RNA readouts.\n\n1:58:51.260 --> 1:58:57.880\n So let me make another parenthesis here to describe now single cell RNA sequencing.\n\n1:58:57.880 --> 1:58:59.720\n So what does single cell RNA sequencing mean?\n\n1:58:59.720 --> 1:59:07.760\n So RNA sequencing is what has been traditionally used, well, traditionally the last 20 years,\n\n1:59:07.760 --> 1:59:10.200\n ever since the advent of next generation sequencing.\n\n1:59:10.200 --> 1:59:14.620\n So basically before RNA expression profiling was based on these microarrays.\n\n1:59:14.620 --> 1:59:17.500\n The next technology after that was based on sequencing.\n\n1:59:17.500 --> 1:59:22.840\n So you chop up your RNA and you just sequence small molecules, just like you would sequence\n\n1:59:22.840 --> 1:59:28.040\n a genome, basically reverse transcribe the small RNAs into DNA, and you sequence that\n\n1:59:28.040 --> 1:59:35.600\n DNA in order to get the number of sequencing reads corresponding to the expression level\n\n1:59:35.600 --> 1:59:37.480\n of every gene in the genome.\n\n1:59:37.480 --> 1:59:39.680\n You now have RNA sequencing.\n\n1:59:39.680 --> 1:59:42.520\n How do you go to single cell RNA sequencing?\n\n1:59:42.520 --> 1:59:45.880\n That technology also went through stages of evolution.\n\n1:59:45.880 --> 1:59:48.120\n The first was microfluidics.\n\n1:59:48.120 --> 1:59:52.940\n You basically had these, or even chambers, you basically had these ways of isolating\n\n1:59:52.940 --> 1:59:57.320\n individual cells, putting them into a well for every one of these cells.\n\n1:59:57.320 --> 2:00:03.280\n So you have 384 well plates and you now do 384 parallel reactions to measure the expression\n\n2:00:03.280 --> 2:00:05.660\n of 384 cells.\n\n2:00:05.660 --> 2:00:11.320\n That sounds amazing and it was amazing, but we want to do a million cells.\n\n2:00:11.320 --> 2:00:14.120\n How do you go from these wells to a million cells?\n\n2:00:14.120 --> 2:00:15.640\n You can't.\n\n2:00:15.640 --> 2:00:21.660\n So what the next technology was after that is instead of using a well for every reaction,\n\n2:00:21.660 --> 2:00:26.280\n you now use a lipid droplet for every reaction.\n\n2:00:26.280 --> 2:00:33.660\n So you use micro droplets as reaction chambers to basically amplify RNA.\n\n2:00:33.660 --> 2:00:34.660\n So here's the idea.\n\n2:00:34.660 --> 2:00:39.280\n You basically have microfluidics where you basically have every single cell coming down\n\n2:00:39.280 --> 2:00:44.040\n one tube in your microfluidics and you have little bubbles getting created in the other\n\n2:00:44.040 --> 2:00:49.360\n way with specific primers that mark every cell with its own barcode.\n\n2:00:49.360 --> 2:00:55.040\n You basically couple the two and you end up with little bubbles that have a cell and tons\n\n2:00:55.040 --> 2:00:57.400\n of markers for that cell.\n\n2:00:57.400 --> 2:01:03.880\n You now mark up all of the RNA for that one cell with the same exact barcode and you then\n\n2:01:03.880 --> 2:01:09.360\n lyse all of the droplets and you sequence the heck out of that and you have for every\n\n2:01:09.360 --> 2:01:12.880\n RNA molecule, a unique identifier that tells you what cell was it on.\n\n2:01:12.880 --> 2:01:20.840\n That is such good engineering, microfluidics and using some kind of primer to put a label\n\n2:01:20.840 --> 2:01:21.840\n on the thing.\n\n2:01:21.840 --> 2:01:24.080\n I mean, you're making it sound easy.\n\n2:01:24.080 --> 2:01:27.400\n I assume it's beautiful, but it's gorgeous.\n\n2:01:27.400 --> 2:01:29.560\n So there's the next generation.\n\n2:01:29.560 --> 2:01:31.120\n So that's the second generation.\n\n2:01:31.120 --> 2:01:34.000\n Next generation is forget the microfluidics altogether.\n\n2:01:34.000 --> 2:01:35.000\n Just use big bottles.\n\n2:01:35.000 --> 2:01:37.960\n How can you possibly do that with big bottles?\n\n2:01:37.960 --> 2:01:39.400\n So here's the idea.\n\n2:01:39.400 --> 2:01:43.680\n You dissociate all of your cells or all of your nuclei from complex cells like brain\n\n2:01:43.680 --> 2:01:48.240\n cells that are very long and sticky so you can't do that.\n\n2:01:48.240 --> 2:01:52.520\n If you have blood cells or if you have neuronal nuclei or brain nuclei, you can basically\n\n2:01:52.520 --> 2:01:56.160\n dissociate let's say a million cells.\n\n2:01:56.160 --> 2:02:01.720\n You now want to add a unique barcode, a unique barcode in each one of a million cells using\n\n2:02:01.720 --> 2:02:02.720\n only big bottles.\n\n2:02:02.720 --> 2:02:04.440\n How can you possibly do that?\n\n2:02:04.440 --> 2:02:07.320\n Sounds crazy, but here's the idea.\n\n2:02:07.320 --> 2:02:13.880\n You use a hundred of these bottles, you randomly shuffle all your million cells and you throw\n\n2:02:13.880 --> 2:02:17.180\n them into those hundred bottles randomly, completely randomly.\n\n2:02:17.180 --> 2:02:21.560\n You add one barcode out of a hundred to every one of the cells.\n\n2:02:21.560 --> 2:02:23.560\n You then you now take them all out.\n\n2:02:23.560 --> 2:02:28.440\n You shuffle them again and you throw them again into the same hundred bottles.\n\n2:02:28.440 --> 2:02:33.960\n But now in a different randomization and you add a second barcode.\n\n2:02:33.960 --> 2:02:36.880\n So every cell now has two barcodes.\n\n2:02:36.880 --> 2:02:40.280\n You take them out again, you shuffle them and you throw them back in.\n\n2:02:40.280 --> 2:02:47.480\n Another third barcode is adding randomly from the same hundred barcodes.\n\n2:02:47.480 --> 2:02:53.920\n You've now labeled every cell probabilistically based on the unique path that he took of which\n\n2:02:53.920 --> 2:02:56.880\n of a hundred bottles did he go for the first time, which of a hundred bottles the second\n\n2:02:56.880 --> 2:03:00.160\n time and which of a hundred bottles the third time.\n\n2:03:00.160 --> 2:03:05.240\n A hundred times a hundred times a hundred is a million unique barcodes in every single\n\n2:03:05.240 --> 2:03:09.480\n one of these cells without ever using microfluidics.\n\n2:03:09.480 --> 2:03:10.480\n Very clever.\n\n2:03:10.480 --> 2:03:11.480\n It's beautiful, right?\n\n2:03:11.480 --> 2:03:12.880\n From a computer science perspective, that's very clever.\n\n2:03:12.880 --> 2:03:13.880\n Yeah.\n\n2:03:13.880 --> 2:03:16.160\n So you now have the single cell sequence technology.\n\n2:03:16.160 --> 2:03:22.040\n You can use the wells, you can use the bubbles or you can use the bottles and you have way\n\n2:03:22.040 --> 2:03:23.680\n The bubbles still sound pretty damn cool.\n\n2:03:23.680 --> 2:03:24.680\n The bubbles are awesome.\n\n2:03:24.680 --> 2:03:26.640\n And that's basically the main technology that we're using.\n\n2:03:26.640 --> 2:03:29.680\n So the bubbles is the main technology.\n\n2:03:29.680 --> 2:03:34.360\n So there are kits now that companies just sell to basically carry out single cell RNA\n\n2:03:34.360 --> 2:03:40.240\n sequencing that you can basically for $2,000, you can basically get 10,000 cells from one\n\n2:03:40.240 --> 2:03:42.560\n sample.\n\n2:03:42.560 --> 2:03:49.680\n And for every one of those cells, you basically have the transcription of thousands of genes.\n\n2:03:49.680 --> 2:03:54.360\n And you know, of course the data for any one cell is noisy, but being computer scientists,\n\n2:03:54.360 --> 2:03:58.640\n we can aggregate the data from all of the cells together across thousands of individuals\n\n2:03:58.640 --> 2:04:02.120\n together to basically make very robust inferences.\n\n2:04:02.120 --> 2:04:03.120\n Okay.\n\n2:04:03.120 --> 2:04:07.160\n So the third technology is basically single cell RNA sequencing that allows you to now\n\n2:04:07.160 --> 2:04:14.400\n start asking not just what is the brain expression level difference of that genetic variant,\n\n2:04:14.400 --> 2:04:20.000\n but what is the expression difference of that one genetic variant across every single subtype\n\n2:04:20.000 --> 2:04:21.720\n of brain cell?\n\n2:04:21.720 --> 2:04:24.460\n How is the variance changing?\n\n2:04:24.460 --> 2:04:29.260\n You can't just, you know, with a brain sample, you can just ask about the mean, what is the\n\n2:04:29.260 --> 2:04:30.840\n average expression?\n\n2:04:30.840 --> 2:04:38.280\n If I instead have 3000 cells that are neurons, I can ask not just what is the neuronal expression.\n\n2:04:38.280 --> 2:04:44.240\n I can say for layer five excitatory neurons of which I have, I don't know, 300 cells,\n\n2:04:44.240 --> 2:04:48.240\n what is the variance that this genetic variant has?\n\n2:04:48.240 --> 2:04:51.000\n So suddenly it's amazingly more powerful.\n\n2:04:51.000 --> 2:04:55.240\n I can basically start asking about this middle layer of gene expression at unprecedented\n\n2:04:55.240 --> 2:04:56.240\n levels.\n\n2:04:56.240 --> 2:05:01.600\n So when you look at the average, it washes out some potentially important signal that\n\n2:05:01.600 --> 2:05:04.160\n corresponds to ultimately the disease.\n\n2:05:04.160 --> 2:05:05.160\n Completely.\n\n2:05:05.160 --> 2:05:06.160\n Yeah.\n\n2:05:06.160 --> 2:05:10.200\n So that, I can do that at the RNA level, but I can also do that at the DNA level for the\n\n2:05:10.200 --> 2:05:11.200\n epigenome.\n\n2:05:11.200 --> 2:05:14.760\n So remember how before I was telling you about all this technology that we're using to probe\n\n2:05:14.760 --> 2:05:18.160\n the epigenome, one of them is DNA accessibility.\n\n2:05:18.160 --> 2:05:23.200\n So what we're doing in my lab is that from the same dissociation of say a brain sample\n\n2:05:23.200 --> 2:05:27.480\n where you now have all these tens of thousands of cells floating around, you basically take\n\n2:05:27.480 --> 2:05:32.360\n half of them to do RNA profiling and the other half to do epigenome profiling, both at the\n\n2:05:32.360 --> 2:05:34.140\n single cell level.\n\n2:05:34.140 --> 2:05:40.340\n So that allows you to now figure out what are the millions of DNA enhancers that are\n\n2:05:40.340 --> 2:05:45.000\n accessible in every one of tens of thousands of cells.\n\n2:05:45.000 --> 2:05:50.600\n And computationally, we can now take the RNA and the DNA readouts and group them together\n\n2:05:50.600 --> 2:05:57.600\n to basically figure out how is every enhancer related to every gene.\n\n2:05:57.600 --> 2:06:01.720\n And remember these sort of enhancer gene linking that we were doing across 833 samples?\n\n2:06:01.720 --> 2:06:08.240\n 833 is awesome, don't get me wrong, but 10 million is way more awesome.\n\n2:06:08.240 --> 2:06:14.600\n So we can now look at correlated activity across 2.3 million enhancers and 20,000 genes\n\n2:06:14.600 --> 2:06:19.860\n in each of millions of cells to basically start piecing together the regulatory circuitry\n\n2:06:19.860 --> 2:06:25.440\n of every single type of neuron, every single type of astrocytes, oligodendrocytes, microglial\n\n2:06:25.440 --> 2:06:32.880\n cell inside the brains of 1,500 individuals that we sample across multiple different brain\n\n2:06:32.880 --> 2:06:36.240\n regions across both DNA and RNA.\n\n2:06:36.240 --> 2:06:39.600\n So that's the data set that my team generated last year alone.\n\n2:06:39.600 --> 2:06:46.560\n So in one year, we basically generated 10 million cells from human brain across a dozen\n\n2:06:46.560 --> 2:06:51.200\n different disorders, across schizophrenia, Alzheimer's, frontotemporal dementia, Lewy\n\n2:06:51.200 --> 2:07:01.000\n body dementia, ALS, Huntington's disease, post traumatic stress disorder, autism, bipolar\n\n2:07:01.000 --> 2:07:04.400\n disorder, healthy aging, et cetera.\n\n2:07:04.400 --> 2:07:13.120\n So it's possible that even just within that data set lie a lot of keys to understanding\n\n2:07:13.120 --> 2:07:18.320\n these diseases and then be able to like directly leads to then treatment.\n\n2:07:18.320 --> 2:07:19.320\n Correct.\n\n2:07:19.320 --> 2:07:20.320\n Correct.\n\n2:07:20.320 --> 2:07:21.880\n So basically we are now motivating.\n\n2:07:21.880 --> 2:07:22.880\n Yeah.\n\n2:07:22.880 --> 2:07:25.680\n So our computational team is in heaven right now and we're looking for people.\n\n2:07:25.680 --> 2:07:29.700\n I mean, if you have super smart.\n\n2:07:29.700 --> 2:07:33.080\n So this is a very interesting kind of side question.\n\n2:07:33.080 --> 2:07:34.680\n How much of this is biology?\n\n2:07:34.680 --> 2:07:36.280\n How much of this is computation?\n\n2:07:36.280 --> 2:07:44.080\n So you're the head of the computational biology group, but how much of, should you be comfortable\n\n2:07:44.080 --> 2:07:48.600\n with biology to be able to solve some of these problems?\n\n2:07:48.600 --> 2:07:54.120\n If you just find, if you put several of the hats you were on fundamentally, are you thinking\n\n2:07:54.120 --> 2:07:56.460\n like a computer scientist here?\n\n2:07:56.460 --> 2:07:57.460\n You have to.\n\n2:07:57.460 --> 2:07:59.760\n This is the only way.\n\n2:07:59.760 --> 2:08:02.720\n As I said, we are the descendants of the first digital computer.\n\n2:08:02.720 --> 2:08:05.000\n We're trying to understand the digital computer.\n\n2:08:05.000 --> 2:08:11.240\n We're trying to understand the circuitry, the logic of this digital core computer and\n\n2:08:11.240 --> 2:08:14.200\n all of these analog layers surrounding it.\n\n2:08:14.200 --> 2:08:19.840\n So the case that I've been making is that you cannot think one gene at a time.\n\n2:08:19.840 --> 2:08:22.080\n The traditional biology is dead.\n\n2:08:22.080 --> 2:08:24.960\n There's no way you cannot solve disease with traditional biology.\n\n2:08:24.960 --> 2:08:27.240\n You need it as a component.\n\n2:08:27.240 --> 2:08:31.840\n Once you figured out RX3 and RX5, you now can then say, Hey, have you guys worked on\n\n2:08:31.840 --> 2:08:33.880\n those genes with your single gene approach?\n\n2:08:33.880 --> 2:08:35.560\n We'd love to know everything you know.\n\n2:08:35.560 --> 2:08:38.960\n And if you haven't, we now know how important these genes are.\n\n2:08:38.960 --> 2:08:43.520\n Let's now launch a single gene program to dissect them and understand them.\n\n2:08:43.520 --> 2:08:46.680\n But you cannot use that as a way to dissect disease.\n\n2:08:46.680 --> 2:08:48.580\n You have to think genomically.\n\n2:08:48.580 --> 2:08:53.380\n You have to think from the global perspective and you have to build these circuits systematically.\n\n2:08:53.380 --> 2:08:59.220\n So we need numbers of computer scientists who are interested and willing to dive into\n\n2:08:59.220 --> 2:09:04.960\n these data fully, fully in and extract meaning.\n\n2:09:04.960 --> 2:09:11.960\n We need computer science people who can understand machine learning and inference and decouple\n\n2:09:11.960 --> 2:09:16.360\n these matrices, come up with super smart ways of dissecting them.\n\n2:09:16.360 --> 2:09:22.880\n But we also need computer scientists who understand biology, who are able to design the next generation\n\n2:09:22.880 --> 2:09:24.660\n of experiments.\n\n2:09:24.660 --> 2:09:28.760\n Because many of these experiments, no one in their right mind would design them without\n\n2:09:28.760 --> 2:09:33.020\n thinking of the analytical approach that you would use to deconvolve the data afterwards.\n\n2:09:33.020 --> 2:09:36.640\n Because it's massive amounts of ridiculously noisy data.\n\n2:09:36.640 --> 2:09:42.700\n And if you don't have the computational pipeline in your head before you even design the experiment,\n\n2:09:42.700 --> 2:09:44.760\n you would never design the experiment that way.\n\n2:09:44.760 --> 2:09:45.760\n That's brilliant.\n\n2:09:45.760 --> 2:09:50.160\n So in designing the experiment, you have to see the entirety of the computational pipeline.\n\n2:09:50.160 --> 2:09:52.600\n That drives the design.\n\n2:09:52.600 --> 2:09:55.560\n That even drives the necessity for that design.\n\n2:09:55.560 --> 2:10:00.320\n Basically, you know, if you didn't have a computer scientist way of thinking, you would\n\n2:10:00.320 --> 2:10:07.360\n never design these hugely combinatorial, massively parallel experiments.\n\n2:10:07.360 --> 2:10:10.680\n So that's why you need interdisciplinary teams, you need teams.\n\n2:10:10.680 --> 2:10:15.200\n And I want to sort of clarify that what do we mean by computational biology group?\n\n2:10:15.200 --> 2:10:18.880\n The focus is not on computational, the focus is on the biology.\n\n2:10:18.880 --> 2:10:20.920\n So we are a biology group.\n\n2:10:20.920 --> 2:10:22.680\n What type of biology?\n\n2:10:22.680 --> 2:10:23.680\n Computational biology.\n\n2:10:23.680 --> 2:10:27.760\n That's the type of biology that uses the whole genome.\n\n2:10:27.760 --> 2:10:33.040\n That's the type of biology that designs experiments, genomic experiments, that can only be interpreted\n\n2:10:33.040 --> 2:10:34.600\n in the context of the whole genome.\n\n2:10:34.600 --> 2:10:35.600\n Right.\n\n2:10:35.600 --> 2:10:39.800\n So it's philosophically looking at biology as a computer.\n\n2:10:39.800 --> 2:10:40.800\n Correct.\n\n2:10:40.800 --> 2:10:41.800\n Correct.\n\n2:10:41.800 --> 2:10:46.280\n So which is in the context of the history of biology is a big transformation.\n\n2:10:46.280 --> 2:10:47.280\n Yeah.\n\n2:10:47.280 --> 2:10:48.280\n Yeah.\n\n2:10:48.280 --> 2:10:50.200\n You can think of the name as what do we do?\n\n2:10:50.200 --> 2:10:51.240\n Only computation.\n\n2:10:51.240 --> 2:10:52.240\n That's not true.\n\n2:10:52.240 --> 2:10:53.880\n How do we study it?\n\n2:10:53.880 --> 2:10:54.880\n Only computationally.\n\n2:10:54.880 --> 2:10:56.520\n That is true.\n\n2:10:56.520 --> 2:11:00.480\n So all of these single cell sequencing can now be coupled with the technology that we\n\n2:11:00.480 --> 2:11:02.920\n talked about earlier for perturbation.\n\n2:11:02.920 --> 2:11:04.560\n So here's the crazy thing.\n\n2:11:04.560 --> 2:11:10.720\n Instead of using these wells and these robotic systems for doing one drug at a time or for\n\n2:11:10.720 --> 2:11:16.880\n perturbing one gene at a time in thousands of wells, you can now do this using a pool\n\n2:11:16.880 --> 2:11:20.120\n of cells and single cell RNA sequencing.\n\n2:11:20.120 --> 2:11:21.120\n How?\n\n2:11:21.120 --> 2:11:27.960\n You basically can take these perturbations using CRISPR and instead of using a single\n\n2:11:27.960 --> 2:11:32.920\n guide RNA, you can use a library of guide RNAs generated exactly the same way using\n\n2:11:32.920 --> 2:11:34.480\n this array technology.\n\n2:11:34.480 --> 2:11:38.500\n So you synthesize a thousand different guide RNAs.\n\n2:11:38.500 --> 2:11:45.720\n You now take each of these guide RNAs and you insert them in a pool of cells where every\n\n2:11:45.720 --> 2:11:48.220\n cell gets one perturbation.\n\n2:11:48.220 --> 2:11:56.720\n And you use CRISPR editing or CRISPR, so with either CRISPR Cas9 to edit a genome with these\n\n2:11:56.720 --> 2:12:01.400\n thousand perturbations or with the activation or with the repression.\n\n2:12:01.400 --> 2:12:07.600\n And you now can have a single cell readout where every single cell has received one of\n\n2:12:07.600 --> 2:12:09.600\n these modifications.\n\n2:12:09.600 --> 2:12:17.080\n And you can now in massively parallel ways, couple the perturbation and the readout in\n\n2:12:17.080 --> 2:12:18.480\n a single experiment.\n\n2:12:18.480 --> 2:12:21.600\n How are you tracking which perturbations each cell received?\n\n2:12:21.600 --> 2:12:27.320\n So there's ways of doing that, but basically one way is to make that perturbation an expressible\n\n2:12:27.320 --> 2:12:33.160\n vector so that part of your RNA reading is actually that perturbation itself.\n\n2:12:33.160 --> 2:12:37.740\n So you can basically put it in an expressible part so you can self drive it.\n\n2:12:37.740 --> 2:12:42.120\n So the point that I want to get across is that the sky's the limit.\n\n2:12:42.120 --> 2:12:46.480\n You basically have these tools, these building blocks of molecular biology.\n\n2:12:46.480 --> 2:12:50.280\n We have these massive data sets of computational biology.\n\n2:12:50.280 --> 2:12:56.160\n We have this huge ability to sort of use machine learning and statistical methods and, you\n\n2:12:56.160 --> 2:13:01.880\n know, linear algebra to sort of reduce the dimensionality of all these massive data sets.\n\n2:13:01.880 --> 2:13:10.960\n And then you end up with a series of actionable targets that you can then couple with pharma\n\n2:13:10.960 --> 2:13:13.380\n and just go after systematically.\n\n2:13:13.380 --> 2:13:19.760\n So the ability to sort of bring genetics to the epigenomics, to the transcriptomics, to\n\n2:13:19.760 --> 2:13:24.280\n the cellular readouts using these sort of high throughput perturbation technologies\n\n2:13:24.280 --> 2:13:30.040\n that I'm talking about and ultimately to the organismal through the electronic health record\n\n2:13:30.040 --> 2:13:36.520\n endophenotypes and ultimately the disease battery of assays at the cognitive level,\n\n2:13:36.520 --> 2:13:42.000\n at the physiological level and, you know, every other level.\n\n2:13:42.000 --> 2:13:46.760\n There is no better or more exciting field, in my view, to be a computer scientist then\n\n2:13:46.760 --> 2:13:48.640\n or to be a scientist in period.\n\n2:13:48.640 --> 2:13:54.280\n Basically this confluence of technologies, of computation, of data, of insight and of\n\n2:13:54.280 --> 2:13:58.860\n tools for manipulation is unprecedented in human history.\n\n2:13:58.860 --> 2:14:04.620\n And I think this is what's shaping the next century to really be a transformative century\n\n2:14:04.620 --> 2:14:09.440\n for our species and for our planet.\n\n2:14:09.440 --> 2:14:17.200\n Do you think the 21st century will be remembered for the big leaps in understanding and alleviation\n\n2:14:17.200 --> 2:14:18.800\n of biology?\n\n2:14:18.800 --> 2:14:23.720\n If you look at the path between discovery and therapeutics, it's been on the order of\n\n2:14:23.720 --> 2:14:29.660\n 50 years, it's been shortened to 40, 30, 20, and now it's on the order of 10 years.\n\n2:14:29.660 --> 2:14:36.400\n But the huge number of technologies that are going on right now for discovery will result\n\n2:14:36.400 --> 2:14:42.600\n undoubtedly in the most dramatic manipulation of human biology that we've ever seen in the\n\n2:14:42.600 --> 2:14:45.240\n history of humanity in the next few years.\n\n2:14:45.240 --> 2:14:48.920\n Do you think we might be able to cure some of the diseases we started this conversation\n\n2:14:48.920 --> 2:14:49.920\n with?\n\n2:14:49.920 --> 2:14:50.920\n Absolutely.\n\n2:14:50.920 --> 2:14:51.920\n Absolutely.\n\n2:14:51.920 --> 2:14:54.320\n It's only a matter of time.\n\n2:14:54.320 --> 2:14:58.480\n Basically the complexity is enormous and I don't want to underestimate the complexity\n\n2:14:58.480 --> 2:15:03.800\n but the number of insights is unprecedented and the ability to manipulate is unprecedented\n\n2:15:03.800 --> 2:15:11.040\n and the ability to deliver these small molecules and other non traditional medicine perturbations,\n\n2:15:11.040 --> 2:15:17.440\n there's a new generation of perturbations that you can use at the DNA level, at the\n\n2:15:17.440 --> 2:15:24.440\n RNA level, at the micro RNA level, at the epigenomic level, there's a battery of new\n\n2:15:24.440 --> 2:15:26.560\n generations of perturbations.\n\n2:15:26.560 --> 2:15:32.120\n If you couple that with cell type identifiers that can basically sense when you are in the\n\n2:15:32.120 --> 2:15:36.840\n right cell based on the specific combination and then turn on that intervention for that\n\n2:15:36.840 --> 2:15:42.560\n cell, you can now think of combinatorial interventions where you can basically sort of feed a synthetic\n\n2:15:42.560 --> 2:15:47.680\n biology construct to someone that will basically do different things in different cells.\n\n2:15:47.680 --> 2:15:51.500\n So basically for cancer, this is one of the therapeutics that our collaborator Ron Weiss\n\n2:15:51.500 --> 2:15:56.240\n is using to basically start sort of engineering the circuits that will use micro RNA sensors\n\n2:15:56.240 --> 2:15:59.840\n of the environment to sort of know if you're in a tumor cell or if you're in an immune\n\n2:15:59.840 --> 2:16:04.180\n cell or if you're in a stromal cell and so forth and basically turn on particular interventions\n\n2:16:04.180 --> 2:16:05.180\n there.\n\n2:16:05.180 --> 2:16:11.080\n You can sort of create constructs that are tuned to only the liver cells or only the\n\n2:16:11.080 --> 2:16:18.640\n heart cells or only the brain cells and then have these new generations of therapeutics\n\n2:16:18.640 --> 2:16:24.000\n coupled with this immense amount of knowledge on the sort of which targets to choose and\n\n2:16:24.000 --> 2:16:27.680\n what biological processes to measure and how to intervene.\n\n2:16:27.680 --> 2:16:36.400\n My view is that disease is going to be fundamentally altered and alleviated as we go forward.\n\n2:16:36.400 --> 2:16:40.960\n Next time we talk, we'll talk about the philosophical implications of that and the effect of life,\n\n2:16:40.960 --> 2:16:44.200\n but let's stick to biology for just a little longer.\n\n2:16:44.200 --> 2:16:45.200\n We did pretty good today.\n\n2:16:45.200 --> 2:16:49.520\n We stuck to the science.\n\n2:16:49.520 --> 2:16:56.000\n What are you excited in terms of the future of this field, the technologies in your own\n\n2:16:56.000 --> 2:17:02.560\n group, in your own mind, you're leading the world at MIT in the science and the engineering\n\n2:17:02.560 --> 2:17:04.480\n of this work.\n\n2:17:04.480 --> 2:17:06.440\n So what are you excited about here?\n\n2:17:06.440 --> 2:17:08.920\n I could not be more excited.\n\n2:17:08.920 --> 2:17:12.720\n We are one of many, many teams who are working on this.\n\n2:17:12.720 --> 2:17:17.000\n In my team, the most exciting parts are, you know, many folds.\n\n2:17:17.000 --> 2:17:20.360\n So basically we've now assembled these battery of technologies.\n\n2:17:20.360 --> 2:17:24.960\n We've assembled these massive, massive data sets and now we're really sort of in the stage\n\n2:17:24.960 --> 2:17:30.460\n of our team's path of generating disease insights.\n\n2:17:30.460 --> 2:17:36.480\n So we are simultaneously working on a paper on schizophrenia right now that is basically\n\n2:17:36.480 --> 2:17:40.880\n using the single cell profiling technologies, using this editing and manipulation technologies\n\n2:17:40.880 --> 2:17:47.840\n to basically show how the master regulators underlying changes in the brain that are sort\n\n2:17:47.840 --> 2:17:53.320\n of found in schizophrenia are in fact affecting excitatory neurons and inhibitory neurons\n\n2:17:53.320 --> 2:17:59.280\n in pathways that are active both in synaptic pruning, but also in early development.\n\n2:17:59.280 --> 2:18:03.220\n We've basically found this set of four regulators that are connecting these two processes that\n\n2:18:03.220 --> 2:18:10.200\n were previously separate in schizophrenia in sort of having a sort of more unified view\n\n2:18:10.200 --> 2:18:12.720\n across those two sides.\n\n2:18:12.720 --> 2:18:15.520\n The second one is in the area of metabolism.\n\n2:18:15.520 --> 2:18:19.280\n We basically now have a beautiful collaboration with the Goodyear lab that's basically looking\n\n2:18:19.280 --> 2:18:29.160\n at multi tissue perturbations in six or seven different tissues across the body in the context\n\n2:18:29.160 --> 2:18:35.920\n of exercise and in the context of nutritional interventions using both mouse and human,\n\n2:18:35.920 --> 2:18:41.680\n where we can basically see what are the cell to cell communications that are changing across\n\n2:18:41.680 --> 2:18:42.680\n them.\n\n2:18:42.680 --> 2:18:47.840\n And what we're finding is this immense role of both immune cells as well as adipocyte\n\n2:18:47.840 --> 2:18:53.080\n stem cells in sort of reshaping that circuitry of all of these different tissues and that's\n\n2:18:53.080 --> 2:18:56.920\n sort of painting to a new path for therapeutical intervention there.\n\n2:18:56.920 --> 2:19:02.540\n In Alzheimer's, it's this huge focus on microglia and now we're discovering different classes\n\n2:19:02.540 --> 2:19:10.360\n of microglial cells that are basically either synaptic or immune.\n\n2:19:10.360 --> 2:19:16.120\n And these are playing vastly different roles in Alzheimer's versus in schizophrenia.\n\n2:19:16.120 --> 2:19:22.400\n And what we're finding is this immense complexity as you go further and further down of how\n\n2:19:22.400 --> 2:19:28.400\n in fact there's 10 different types of microglia, each with their own sort of expression programs.\n\n2:19:28.400 --> 2:19:32.480\n We used to think of them as, oh yeah, they're microglia, but in fact now we're realizing\n\n2:19:32.480 --> 2:19:37.960\n just even in that sort of least abundant of cell types, there's this incredible diversity\n\n2:19:37.960 --> 2:19:39.620\n there.\n\n2:19:39.620 --> 2:19:44.280\n The differences between brain regions is another sort of major, major insight.\n\n2:19:44.280 --> 2:19:48.800\n Often one would think that, oh, astrocytes are astrocytes no matter where they are.\n\n2:19:48.800 --> 2:19:54.240\n But no, there's incredible region specific differences in the expression patterns of\n\n2:19:54.240 --> 2:19:57.480\n all of the major brain cell types across different brain regions.\n\n2:19:57.480 --> 2:20:01.080\n So basically there's the neocortical regions that are sort of the recent innovation that\n\n2:20:01.080 --> 2:20:03.620\n makes us so different from all other species.\n\n2:20:03.620 --> 2:20:10.080\n There's the sort of reptilian brain sort of regions that are sort of much more very extremely\n\n2:20:10.080 --> 2:20:11.080\n distinct.\n\n2:20:11.080 --> 2:20:12.080\n There's the cerebellum.\n\n2:20:12.080 --> 2:20:17.520\n Each of those basically is associated in a different way with disease.\n\n2:20:17.520 --> 2:20:23.680\n And what we're doing now is looking into pseudo temporal models for how disease progresses\n\n2:20:23.680 --> 2:20:25.820\n across different regions of the brain.\n\n2:20:25.820 --> 2:20:30.000\n If you look at Alzheimer's, it basically starts in this small region called the entorhinal\n\n2:20:30.000 --> 2:20:38.440\n cortex and then it spreads through the brain and through the hippocampus and ultimately\n\n2:20:38.440 --> 2:20:39.520\n affecting the neocortex.\n\n2:20:39.520 --> 2:20:46.080\n And with every brain region that it hits, it basically has a different impact on the\n\n2:20:46.080 --> 2:20:52.920\n cognitive and memory aspects, orientation, short term memory, long term memory, et cetera,\n\n2:20:52.920 --> 2:20:58.320\n which is dramatically affecting the cognitive path that the individuals go through.\n\n2:20:58.320 --> 2:21:04.600\n So what we're doing now is creating these computational models for ordering the cells\n\n2:21:04.600 --> 2:21:10.560\n and the regions and the individuals according to their ability to predict Alzheimer's disease.\n\n2:21:10.560 --> 2:21:17.820\n So we can have a cell level predictor of pathology that allows us to now create a temporal time\n\n2:21:17.820 --> 2:21:22.860\n course that tells us when every gene turns on along this pathology progression and then\n\n2:21:22.860 --> 2:21:28.040\n trace that across regions and pathological measures that are region specific, but also\n\n2:21:28.040 --> 2:21:30.380\n cognitive measures and so on and so forth.\n\n2:21:30.380 --> 2:21:35.540\n So that allows us to now sort of for the first time, look at can we actually do early intervention\n\n2:21:35.540 --> 2:21:40.920\n for Alzheimer's where we know that the disease starts manifesting for 10 years before you\n\n2:21:40.920 --> 2:21:44.280\n actually have your first cognitive loss.\n\n2:21:44.280 --> 2:21:50.360\n Can we start seeing that path to build new diagnostics, new prognostics, new biomarkers\n\n2:21:50.360 --> 2:21:54.420\n for this sort of early intervention in Alzheimer's?\n\n2:21:54.420 --> 2:21:57.080\n The other aspect that we're looking at is mosaicism.\n\n2:21:57.080 --> 2:22:01.120\n We talked about the common variants and the rare variants, but in addition to those rare\n\n2:22:01.120 --> 2:22:08.520\n variants as your initial cell that forms the zygote divides and divides and divides, with\n\n2:22:08.520 --> 2:22:12.480\n every cell division there are additional mutations that are happening.\n\n2:22:12.480 --> 2:22:18.000\n So what you end up with is your brain being a mosaic of multiple different types of genetic\n\n2:22:18.000 --> 2:22:19.320\n underpinnings.\n\n2:22:19.320 --> 2:22:23.380\n Some cells contain a mutation that other cells don't have.\n\n2:22:23.380 --> 2:22:31.200\n So every human has the common variants that all of us carry to some degree, the rare variants\n\n2:22:31.200 --> 2:22:37.360\n that your immediate tree of the human species carries, and then there's the somatic variant,\n\n2:22:37.360 --> 2:22:44.280\n which is the tree that happened after the zygote that sort of forms your own body.\n\n2:22:44.280 --> 2:22:50.840\n So these somatic alterations is something that has been previously inaccessible to study\n\n2:22:50.840 --> 2:22:53.240\n in human postmortem samples.\n\n2:22:53.240 --> 2:22:58.240\n But right now with the advent of single cell RNA sequencing, in this particular case, we're\n\n2:22:58.240 --> 2:23:01.920\n using the well based sequencing, which is much more expensive, but gives you a lot richer\n\n2:23:01.920 --> 2:23:04.560\n information about each of those transcripts.\n\n2:23:04.560 --> 2:23:10.200\n So we're using now that richer information to infer mutations that have happened in each\n\n2:23:10.200 --> 2:23:16.640\n of the thousands of genes that sort of are active in these cells, and then understand\n\n2:23:16.640 --> 2:23:25.320\n how the genome relates to the function, this genotype phenotype relationship that we usually\n\n2:23:25.320 --> 2:23:31.400\n build in GWAS between in genome wide association studies between genetic variation and disease.\n\n2:23:31.400 --> 2:23:36.400\n We're now building that at the cell level, where for every cell, we can relate the unique\n\n2:23:36.400 --> 2:23:42.920\n specific genome of that cell with the expression patterns of that cell, and the predicted function\n\n2:23:42.920 --> 2:23:47.480\n using these predictive models that I mentioned before on this regulation for cognition for\n\n2:23:47.480 --> 2:23:51.000\n pathology in Alzheimer's at the cell level.\n\n2:23:51.000 --> 2:23:54.960\n And what we're finding is that the genes that are altered and the genetic regions that are\n\n2:23:54.960 --> 2:23:59.640\n altered in common variants versus rare variants versus somatic variants are actually very\n\n2:23:59.640 --> 2:24:01.280\n different from each other.\n\n2:24:01.280 --> 2:24:08.860\n The somatic variants are pointing to neuronal energetics and oligodendrocyte functions that\n\n2:24:08.860 --> 2:24:13.000\n are not visible in the genetic legions that you find for the common variants, probably\n\n2:24:13.000 --> 2:24:17.480\n because they have too strong of an effect that evolution is just not tolerating them\n\n2:24:17.480 --> 2:24:20.960\n on the common side of the allele frequency spectrum.\n\n2:24:20.960 --> 2:24:26.360\n So the somatic one, that's the variation that happens after the zygote, after you individual.\n\n2:24:26.360 --> 2:24:31.600\n I mean, this is a dumb question, but there's mutation and variation, I guess that happens\n\n2:24:31.600 --> 2:24:32.600\n there.\n\n2:24:32.600 --> 2:24:37.200\n And you're saying that they're through this, if we focus in on individual cells, we're\n\n2:24:37.200 --> 2:24:42.640\n able to detect the story that's interesting there, and that might be a very unique kind\n\n2:24:42.640 --> 2:24:49.320\n of important variability that arises for, you said neuronal or something that would\n\n2:24:49.320 --> 2:24:50.320\n sound...\n\n2:24:50.320 --> 2:24:51.320\n Energetics.\n\n2:24:51.320 --> 2:24:52.320\n Energetics, sounds like a cool term.\n\n2:24:52.320 --> 2:24:59.520\n So, I mean, the metabolism of humans is dramatically altered from that of nearby species.\n\n2:24:59.520 --> 2:25:04.500\n We talked about that last time that basically we are able to consume meat that is incredibly\n\n2:25:04.500 --> 2:25:13.240\n energy rich, and that allows us to sort of have functions that are meeting this humongous\n\n2:25:13.240 --> 2:25:14.240\n brain that we have.\n\n2:25:14.240 --> 2:25:18.280\n So basically on one hand, every one of our brain cells is much more energy efficient\n\n2:25:18.280 --> 2:25:20.560\n than our neighbors, than our relatives.\n\n2:25:20.560 --> 2:25:23.360\n Number two, we have way more of these cells.\n\n2:25:23.360 --> 2:25:30.260\n And number three, we have this new diet that allows us to now feed all these needs.\n\n2:25:30.260 --> 2:25:36.540\n That basically creates a massive amount of damage, oxidative damage from this huge super\n\n2:25:36.540 --> 2:25:42.360\n powered factory of ideas and thoughts that we carry in our skull.\n\n2:25:42.360 --> 2:25:47.540\n And that factory has energetic needs, and there's a lot of sort of biological processes\n\n2:25:47.540 --> 2:25:52.960\n underlying that, that we are finding are altered in the context of Alzheimer's disease.\n\n2:25:52.960 --> 2:25:53.960\n That's fascinating.\n\n2:25:53.960 --> 2:25:59.680\n So you have to consider all of these systems if you want to understand even something like\n\n2:25:59.680 --> 2:26:04.440\n diseases that you would maybe traditionally associate with just the particular cells of\n\n2:26:04.440 --> 2:26:07.440\n the brain.\n\n2:26:07.440 --> 2:26:11.240\n The immune system, the metabolic system, the metabolic system.\n\n2:26:11.240 --> 2:26:13.440\n And these are all the things that makes us uniquely human.\n\n2:26:13.440 --> 2:26:17.120\n So our immune system is dramatically different from that of our neighbors.\n\n2:26:17.120 --> 2:26:19.600\n Our societies are so much more clustered.\n\n2:26:19.600 --> 2:26:24.840\n The history of infection that have plagued the human population is dramatically different\n\n2:26:24.840 --> 2:26:27.080\n from every other species.\n\n2:26:27.080 --> 2:26:31.320\n The way that our society and our population has sort of exploded has basically put unique\n\n2:26:31.320 --> 2:26:33.360\n pressures on our immune system.\n\n2:26:33.360 --> 2:26:37.480\n And our immune system has both coped with that density and also been shaped by, as I\n\n2:26:37.480 --> 2:26:42.200\n mentioned, the vast amount of death that has happened in the Black Plague and other sort\n\n2:26:42.200 --> 2:26:47.180\n of selective events in human history, famines, ice ages, and so forth.\n\n2:26:47.180 --> 2:26:49.940\n So that's number one on the sort of immune side.\n\n2:26:49.940 --> 2:26:55.560\n On the metabolic side, again, we are able to sort of run marathons.\n\n2:26:55.560 --> 2:26:59.040\n I don't know if you remember the sort of human versus horse experiment where the horse actually\n\n2:26:59.040 --> 2:27:03.480\n tires out faster than the human and the human actually wins.\n\n2:27:03.480 --> 2:27:05.940\n So on the metabolic side, we're dramatically different.\n\n2:27:05.940 --> 2:27:07.560\n On the immune side, we're dramatically different.\n\n2:27:07.560 --> 2:27:12.400\n On the brain side, again, you know, no need to sort of, you know, it's a no brainer of\n\n2:27:12.400 --> 2:27:16.880\n how our brain is like just enormously more capable.\n\n2:27:16.880 --> 2:27:21.740\n And then, you know, in the side of cancer, so basically the cancers that humans are having,\n\n2:27:21.740 --> 2:27:25.940\n the exposures, the environmental exposures is again, dramatically different.\n\n2:27:25.940 --> 2:27:32.880\n And the lifespan, the expansion of human lifespan is unseen in any other species in, you know,\n\n2:27:32.880 --> 2:27:35.720\n recent evolutionary history.\n\n2:27:35.720 --> 2:27:42.360\n And that now leads to a lot of new disorders that are starting to, you know, manifest late\n\n2:27:42.360 --> 2:27:43.920\n in life.\n\n2:27:43.920 --> 2:27:48.200\n So you know, Alzheimer's is one example where basically, you know, these vast energetic\n\n2:27:48.200 --> 2:27:54.800\n needs over a lifetime of thinking can basically lead to all of these debris and eventually\n\n2:27:54.800 --> 2:28:00.840\n saturate the system and lead to, you know, Alzheimer's in the late life.\n\n2:28:00.840 --> 2:28:07.440\n But there's, you know, there's just such a dramatic set of frontiers when it comes to\n\n2:28:07.440 --> 2:28:14.360\n aging research that, you know, so what I often like to say is that if you want to engineer\n\n2:28:14.360 --> 2:28:18.240\n a car to go from 70 miles an hour to 120 miles an hour, that's fine.\n\n2:28:18.240 --> 2:28:20.480\n You can basically, you know, fix a few components.\n\n2:28:20.480 --> 2:28:24.240\n If you wanted to now go at 400 miles an hour, you have to completely redesign the entire\n\n2:28:24.240 --> 2:28:31.220\n car because the system has just not evolved to go that far.\n\n2:28:31.220 --> 2:28:36.480\n Basically our human body has only evolved to live to, I don't know, 120, maybe we can\n\n2:28:36.480 --> 2:28:39.280\n get to 150 with minor changes.\n\n2:28:39.280 --> 2:28:45.240\n But if, you know, as we start pushing these frontiers for not just living, but well living,\n\n2:28:45.240 --> 2:28:48.240\n the Fzine that we talked about last time.\n\n2:28:48.240 --> 2:28:53.200\n So to basically push Fzine into the 80s and 90s and a hundreds and, you know, much further\n\n2:28:53.200 --> 2:29:00.400\n than that, we will face new challenges that have, you know, never been faced before in\n\n2:29:00.400 --> 2:29:04.200\n terms of cancer, the number of divisions, in terms of Alzheimer's and brain related\n\n2:29:04.200 --> 2:29:08.880\n disorders, in terms of metabolic disorders, in terms of regeneration, there's just so\n\n2:29:08.880 --> 2:29:10.920\n many different frontiers ahead of us.\n\n2:29:10.920 --> 2:29:14.040\n So I am thrilled about where we're heading.\n\n2:29:14.040 --> 2:29:20.600\n So basically I see this confluence in my lab and many other labs of AI, of, you know, sort\n\n2:29:20.600 --> 2:29:22.920\n of, you know, the next frontier of AI for drug design.\n\n2:29:22.920 --> 2:29:30.520\n So basically these sort of graph neural networks on specific chemical designs that allow you\n\n2:29:30.520 --> 2:29:34.840\n to create new generations of therapeutics.\n\n2:29:34.840 --> 2:29:42.400\n These molecular biology tricks for intervening at the system at every level, these personalized\n\n2:29:42.400 --> 2:29:49.960\n medicine prediction, diagnosis, and prognosis using the electronic health records and using\n\n2:29:49.960 --> 2:29:56.640\n these polygenic risk scores weighted by the burden, the number of mutations that are accumulating\n\n2:29:56.640 --> 2:30:03.340\n across common rare and somatic variants, the burden converging across all of these different\n\n2:30:03.340 --> 2:30:10.000\n molecular pathways, the delivery of specific drugs and specific interventions into specific\n\n2:30:10.000 --> 2:30:11.000\n cell types.\n\n2:30:11.000 --> 2:30:14.080\n And again, you've talked with Bob Langer about this, there's, you know, many giants in that\n\n2:30:14.080 --> 2:30:15.080\n field.\n\n2:30:15.080 --> 2:30:20.560\n And then the last concept is not intervening at the single gene level.\n\n2:30:20.560 --> 2:30:27.600\n I want you to sort of conceptualize the concept of an on target side effect.\n\n2:30:27.600 --> 2:30:29.200\n What is an on target side effect?\n\n2:30:29.200 --> 2:30:33.320\n An off target side effect is when you design a molecule to target one gene and instead\n\n2:30:33.320 --> 2:30:36.720\n it targets another gene and you have side effects because of that.\n\n2:30:36.720 --> 2:30:41.040\n And on target side effect is when your molecule does exactly what you were expecting, but\n\n2:30:41.040 --> 2:30:43.840\n that gene is plyotropic.\n\n2:30:43.840 --> 2:30:48.160\n Plyo means many, tropos means ways, many ways, it acts in many ways.\n\n2:30:48.160 --> 2:30:50.040\n It's a multifunctional gene.\n\n2:30:50.040 --> 2:30:55.320\n So you find that this gene plays a role in this, but as we talked about the wiring of\n\n2:30:55.320 --> 2:30:59.000\n genes to phenotypes is extremely dense and extremely complex.\n\n2:30:59.000 --> 2:31:04.000\n So the next stage of intervention will be intervening not at the gene level, but at\n\n2:31:04.000 --> 2:31:06.160\n the network level.\n\n2:31:06.160 --> 2:31:11.440\n Intervening at the set of pathways and the set of genes with multi input perturbations\n\n2:31:11.440 --> 2:31:18.040\n to the system, multi input modulations, pharmaceutical or other interventional, and that basically\n\n2:31:18.040 --> 2:31:24.980\n allow you to now work at the sort of full level of understanding, not just in your brain,\n\n2:31:24.980 --> 2:31:29.400\n but across your body, not just in one gene, but across the set of pathways and so on and\n\n2:31:29.400 --> 2:31:31.980\n so forth for every one of these disorders.\n\n2:31:31.980 --> 2:31:37.320\n So I think that we're finally at the level of systems medicine of basically instead of\n\n2:31:37.320 --> 2:31:42.120\n sort of medicine being at the single gene level, medicine being at the systems level\n\n2:31:42.120 --> 2:31:46.480\n where it can be personalized based on the specific set of genetic markers and genetic\n\n2:31:46.480 --> 2:31:53.040\n perturbations that you are either born with or that you have developed during your lifetime.\n\n2:31:53.040 --> 2:31:59.480\n Your unique set of exposures, your unique set of biomarkers, and your unique set of\n\n2:31:59.480 --> 2:32:06.480\n current set of conditions through your EHR and other ways.\n\n2:32:06.480 --> 2:32:12.920\n And the precision component of intervening extremely precisely in the specific pathways\n\n2:32:12.920 --> 2:32:16.840\n and the specific combinations of genes that should be modulated to sort of bring you from\n\n2:32:16.840 --> 2:32:23.480\n the disease state to the physiologically normal state or even to physiologically improved\n\n2:32:23.480 --> 2:32:25.640\n state through this combination of interventions.\n\n2:32:25.640 --> 2:32:30.080\n So that's in my view, the field where basically computer science comes together with artificial\n\n2:32:30.080 --> 2:32:34.200\n intelligence statistics, all of these other tools, molecular biology technologies and\n\n2:32:34.200 --> 2:32:37.960\n biotechnology and pharmaceutical technologies that are sort of revolutionary in the way\n\n2:32:37.960 --> 2:32:38.960\n of intervention.\n\n2:32:38.960 --> 2:32:43.240\n And of course, this massive amount of molecular biology and data gathering and generation\n\n2:32:43.240 --> 2:32:46.360\n and perturbation in massively parallel ways.\n\n2:32:46.360 --> 2:32:47.700\n So there's no better way.\n\n2:32:47.700 --> 2:32:49.740\n There's no better time.\n\n2:32:49.740 --> 2:32:56.800\n There's no better place to be sort of looking at this whole confluence of ideas.\n\n2:32:56.800 --> 2:33:01.440\n And I'm just so thrilled to be a small part of this amazing, enormous ecosystem.\n\n2:33:01.440 --> 2:33:07.520\n It's exciting to imagine what humans of 100, 200 years from now, what their life experience\n\n2:33:07.520 --> 2:33:13.720\n is like, because these ideas seem to have potential to transform the quality of life\n\n2:33:13.720 --> 2:33:22.200\n that, when they look back at us, they probably wonder how we were put up with all the suffering\n\n2:33:22.200 --> 2:33:23.200\n in the world.\n\n2:33:23.200 --> 2:33:25.480\n Manolis, it's a huge honor.\n\n2:33:25.480 --> 2:33:29.240\n Thank you for spending this early Sunday morning with me.\n\n2:33:29.240 --> 2:33:30.240\n I deeply appreciate it.\n\n2:33:30.240 --> 2:33:31.240\n See you next time.\n\n2:33:31.240 --> 2:33:32.240\n Sounds like a plan.\n\n2:33:32.240 --> 2:33:33.960\n Thank you, Lex.\n\n2:33:33.960 --> 2:33:36.880\n Thanks for listening to this conversation with Manolis Kellis.\n\n2:33:36.880 --> 2:33:43.280\n And thank you to our sponsors, SEMrush, which is an SEO optimization tool.\n\n2:33:43.280 --> 2:33:47.400\n Pessimist Archive, which is one of my favorite history podcasts.\n\n2:33:47.400 --> 2:33:52.680\n 8Sleep, which is a self cooling mattress with smart sensors and an app.\n\n2:33:52.680 --> 2:33:57.360\n And finally, BetterHelp, which is an online therapy service.\n\n2:33:57.360 --> 2:34:02.520\n Please check out these sponsors in the description to get a discount and to support this podcast.\n\n2:34:02.520 --> 2:34:08.000\n If you enjoy this thing, subscribe on YouTube, review it with 5 Stars and Apple Podcasts,\n\n2:34:08.000 --> 2:34:13.240\n follow on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n2:34:13.240 --> 2:34:19.120\n And now, let me leave you with some words from Haruki Murakami.\n\n2:34:19.120 --> 2:34:24.580\n Human beings are ultimately nothing but carriers, passageways for genes.\n\n2:34:24.580 --> 2:34:30.300\n They ride us into the ground like racehorses from generation to generation.\n\n2:34:30.300 --> 2:34:34.160\n Genes don't think about what constitutes good or evil.\n\n2:34:34.160 --> 2:34:37.040\n They don't care whether we're happy or unhappy.\n\n2:34:37.040 --> 2:34:40.060\n We're just means to an end for them.\n\n2:34:40.060 --> 2:34:45.960\n The only thing they think about is what is most efficient for them.\n\n2:34:45.960 --> 2:35:12.600\n Thank you for listening, and hope to see you next time.\n\n"
}