{
  "title": "Michael Malice: New Year's Special | Lex Fridman Podcast #253",
  "id": "B2tXN7ZnSfU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:09.680\n Уважаемые дамы и господа! The following is a conversation with Michael Malice, his fifth time on this, the Lex Friedman podcast.\n\n00:09.680 --> 00:12.920\n To support it, please check out our sponsors in the description.\n\n00:12.920 --> 00:22.920\n And now, here's my New Year's Eve 2021 conversation with the one and only, Mr. Michael Malice.\n\n00:22.920 --> 00:24.080\n Привет, товарищ!\n\n00:24.080 --> 00:25.080\n С Новым годом!\n\n00:25.080 --> 00:26.760\n С Новым годом!\n\n00:26.760 --> 00:36.200\n Dostoevsky wrote in The Idiot, my favorite of his books, through the main character, Prince Mishkin, that beauty will save the world.\n\n00:36.200 --> 00:46.640\n Красота спасет мир. These words, seemingly naive, and ultimately, at least to me, profound. What do they mean to you? Beauty will save the world.\n\n00:46.640 --> 00:50.280\n Naive? Really? I don't think they seem naive at all.\n\n00:50.280 --> 01:00.240\n Well, Solzhenitsyn actually, for his 1970 Nobel Prize speech, talked about this line a lot, and he thought, for most of his life, that was a silly line.\n\n01:00.240 --> 01:07.520\n It was just words thrown out there, because with all the suffering that's in the world, what has beauty actually ever done?\n\n01:07.520 --> 01:09.240\n Oh my God, I hate this so much.\n\n01:09.240 --> 01:11.760\n Talking trash about Solzhenitsyn.\n\n01:11.760 --> 01:12.440\n Yeah, I am.\n\n01:12.440 --> 01:12.960\n Okay.\n\n01:12.960 --> 01:21.040\n And this perfectly sets up this theme, you know, I said, let's do this episode, start the new year on a positive note, give people hope, give people joy.\n\n01:21.040 --> 01:29.440\n You and I both have friends who are models, right? And it's a silly profession, to some extent, of course.\n\n01:29.440 --> 01:33.960\n You are actually a model. You are my friend.\n\n01:33.960 --> 01:55.280\n Yeah, that's right. That's true. I am a model. I was trying to be subtle. But for those people who actually deserve to be models, when you look at someone who is a model, and in some of their photos, and these people look perfect, now in real life, they're not perfect, they have flaws, they'll be the first to admit it, so on and so forth.\n\n01:55.280 --> 02:18.360\n But when you look at beauty, it is almost impossible to maintain a sense of cynicism and hopelessness. Because if there's even one moment when some element of perfection has been actualized, if there's one moment where a beauty has been realized and captured, you can't say, well, it's never gonna happen again.\n\n02:18.360 --> 02:42.600\n So I think beauty, it means hope. I think I hate that cynical idea of like, I get, I appreciate Solzhenitsyn's broader point that a lot of times people, there's something called a deepity, where people throw words together to sound profound. And if you take it apart, like this is just complete gibberish, I don't think this is an example of that.\n\n02:42.600 --> 03:07.560\n I think beauty inspires. And more importantly, it proves to you, this is something that can actually happen on this Earth. Plato, right, the Platonic theory of forms, like this world is imperfect, but these perfect forms exist in another dimension. And that's where our concepts come from. He was an early person trying to figure out where our concepts come from, and epistemology, and so on and so forth.\n\n03:07.560 --> 03:23.400\n But that is something that is real in here. So I completely disagree with his analysis of that. And I don't know if it'll save the world, but it's certainly a prerequisite. And what's the point of fighting for your values if you don't want to make the world a more beautiful place?\n\n03:23.400 --> 03:40.680\n Well, it's also how you define beauty, because beauty could be just aesthetic, beauty could be art. Of course, art could encompass a lot more than just literature and paintings. It can encompass the full life, the full dance of life.\n\n03:40.680 --> 04:03.960\n But then beauty could be something just deeper, like whatever that awe you feel when you pause and hear the music, just hear and look up at the stars. For some reason, when I see rockets go up, for me, it's like science. What is that? The awe that we're able to accomplish that as humans.\n\n04:03.960 --> 04:23.320\n That's funny because there's lots of different schools of thought, like these people versus these people, and maybe vegans versus steakhouse people. I think in terms of the sciences, and I guess you and I would be on opposite sides here, you have the astronomy people versus the zoology people.\n\n04:23.320 --> 04:41.560\n The big question is, would you rather spend 10 minutes on the moon or would you rather spend 10 minutes in the deep sea? And for me, it's clearly the deep sea. The zoology that's down there, there's something I would encourage people to look up called Deepstaria, which is a jellyfish.\n\n04:41.560 --> 05:04.360\n And what's amazing when you watch these deep sea dives on YouTube is that the scientists, they're nature dorks like everybody else. They went into this field, and there's none of this maybe soldier nation style cynicism of when they see an amazing animal in its natural environment exhibiting these crazy behaviors, they lose it.\n\n05:04.360 --> 05:13.160\n They're on the mics like, oh my god. It's so exciting to watch. I'm not a rocket person, but I'm definitely a zoology person.\n\n05:13.160 --> 05:15.160\n So animals and plants and the sea.\n\n05:15.160 --> 05:27.800\n And also, it's so mathematical. There's so many forms. There's this plant called Areospermum titanopsoides. I don't know how to pronounce it because they're always in Latin. You never hear them pronounced.\n\n05:27.800 --> 05:28.600\n You said sperm.\n\n05:28.600 --> 05:42.200\n Areospermum, yeah, because it's a woolly seed is the genus. The leaf, it just always puts out one leaf, but the leaf is covered in little magnifying lenses to make it maximize the sunlight.\n\n05:42.200 --> 05:53.000\n So it looks like this little crystal seashell. It's tiny. It's like two centimeters, but it's just this amazing thing that grows out of the sands in South Africa.\n\n05:53.000 --> 06:01.400\n Just to defend Solzhenitsyn for a second. So if I may read a couple of his lines from the speech. So he said, one day, that's how he introduces it.\n\n06:01.400 --> 06:08.360\n One day, Dostoevsky threw out the enigmatic remark, beauty will save the world. What sort of a statement is that?\n\n06:08.360 --> 06:19.080\n For a long time, I considered it mere words. How could that be possible? When in bloodthirsty history did beauty ever save anyone from anything?\n\n06:19.080 --> 06:25.560\n And then later, he goes on to argue with himself in the speech as an older, wiser man now.\n\n06:25.560 --> 06:31.240\n But perhaps that ancient trinity of truth, goodness and beauty is not simply an empty,\n\n06:31.240 --> 06:36.760\n faded formula as we thought in the days of our self confident, materialistic youth.\n\n06:36.760 --> 06:42.920\n If the tops of these three trees converge as the scholars maintained, but the two blatant,\n\n06:42.920 --> 06:49.240\n two direct stems of truth and goodness are crushed, cut down, not allowed through, then perhaps the\n\n06:49.240 --> 06:56.920\n fantastic, unpredictable, unexpected stems of beauty will push through and soar to that very same place.\n\n06:56.920 --> 07:02.520\n And in so doing, will fulfill the work of all three. In that case, Dostoevsky's remark,\n\n07:02.520 --> 07:08.200\n beauty will save the world, was not a careless phrase, but a prophecy.\n\n07:08.200 --> 07:14.520\n Which of these three things are your favorites? Truth, goodness or beauty?\n\n07:14.520 --> 07:22.520\n What do you call truth and goodness? The blatant, two direct stems of truth and goodness\n\n07:22.520 --> 07:29.640\n versus the fantastic, unpredictable, unexpected stems of beauty, which is how I see your Twitter account.\n\n07:29.640 --> 07:34.040\n I don't think that, I think there's a certain dearth of beauty to be had in my Twitter account, that's for sure.\n\n07:34.040 --> 07:41.400\n It's certainly no goodness. Or truth. Yeah, yeah. It's Twitter, there's no truth to be found.\n\n07:41.400 --> 07:47.960\n I will answer the question, I will of course point out that having this kind of,\n\n07:47.960 --> 07:52.200\n you know, distinction between the three things is I think kind of synthetic. I think they very\n\n07:52.200 --> 07:56.280\n heavily overlap. If not, if I could probably make the argument they're synonymous.\n\n07:56.280 --> 08:01.880\n In fact, I do believe that they're largely synonymous.\n\n08:01.880 --> 08:08.440\n Goodness. That's such an interesting word, goodness. Which of those three is my favorite?\n\n08:08.440 --> 08:18.440\n I think truth is overrated in the sense that if something is a good story,\n\n08:18.440 --> 08:26.040\n the story doesn't have to be true or real in order to motivate you and move you.\n\n08:26.040 --> 08:34.600\n A lot of times, we can delude ourselves about somebody and that might actually serve a purpose\n\n08:34.600 --> 08:39.320\n to some extent. You know, if you have someone who's maybe a family member and you kind of\n\n08:39.320 --> 08:45.480\n ignore bad things that they do, there might be a reason for that. Of the three which is\n\n08:45.480 --> 08:52.040\n most important, I think I would say probably goodness. I would say of the three the most\n\n08:52.040 --> 08:58.600\n important is goodness because if you don't appreciate goodness, then beauty is just\n\n08:58.600 --> 09:06.760\n empty. It's just a picture or it's nice. Bad people appreciate beauty. You know,\n\n09:06.760 --> 09:10.920\n bad people are often, you know, seductive or have a beauty about them.\n\n09:10.920 --> 09:16.680\n And in terms of action, I think it takes a lot of skill and work to create beauty or\n\n09:16.680 --> 09:25.000\n to create truth or to express truth or express beauty. But I think goodness is like the easiest\n\n09:25.000 --> 09:28.600\n default state of being, just being good to others.\n\n09:29.240 --> 09:35.400\n Yeah, like, you know, like there'll be things where these videos where like one dog is drowning\n\n09:35.400 --> 09:42.360\n and like another dog jumps in and saves it from the pool. Like that to me is just really amazing\n\n09:42.360 --> 09:50.600\n stuff and is very moving. So just to me, goodness means integrity and it means kindness.\n\n09:53.240 --> 09:56.200\n And yeah, I think of the three, that's the one I pick.\n\n09:57.480 --> 10:01.880\n And I think people, sorry to interrupt, I think people also have this idea which is inculcated\n\n10:01.880 --> 10:07.640\n to them, especially by corporate America, that as you get older, it's okay to do the\n\n10:07.640 --> 10:12.520\n wrong thing sometimes, blah, blah, blah, blah. I don't buy that. And so I think goodness gets\n\n10:12.520 --> 10:17.640\n rarer and rarer. And I think people know better and they tell themselves lies.\n\n10:18.200 --> 10:26.920\n Yeah. But once you get, allow yourself the chance to just be good, I think it makes for a better\n\n10:26.920 --> 10:31.560\n life. It's like it's not that much work. Like it's not like going to the gym or working out,\n\n10:31.560 --> 10:37.400\n that's a lot of work and it's great afterwards. But like goodness is easy once you get into the habit\n\n10:37.400 --> 10:41.400\n of it. I suppose working out is the same way. There's a lot of stuff. If you make it a habit,\n\n10:43.000 --> 10:46.360\n you're going to get the rewards of it and it's going to be easy.\n\n10:46.360 --> 10:50.280\n The rewards of goodness I think are more immediate than the rewards of working out.\n\n10:51.480 --> 10:53.080\n As opposed to the hard drugs.\n\n10:53.080 --> 10:53.720\n Yeah.\n\n10:53.720 --> 10:57.560\n If, you mentioned this quote on one of your live streams, I think,\n\n10:57.560 --> 10:59.720\n if you save one life, you save the world.\n\n10:59.720 --> 10:59.880\n Yeah.\n\n11:01.480 --> 11:06.360\n That's such a cool line. I think I remember reading about Paul Farmer. I think his name is,\n\n11:06.360 --> 11:11.880\n he's a doctor that really, I mean, doctors in general, they kind of don't care about\n\n11:13.560 --> 11:20.040\n like what they're doing as a broad policy across hundreds of thousands of millions of people.\n\n11:20.040 --> 11:24.040\n They just care about the human in front of them, which is so interesting. They don't care it's\n\n11:24.040 --> 11:30.920\n going to cost, like in his case to save one child, it will cost him hundreds of thousands of dollars.\n\n11:30.920 --> 11:37.400\n They don't care about that. They know very well that their actions cannot be scaled,\n\n11:38.120 --> 11:42.680\n but they can't help but help the child in front of them. And it's so interesting.\n\n11:44.440 --> 11:49.000\n That's such an interesting way to live. And that's the way I kind of think when I try to do\n\n11:49.000 --> 11:58.440\n something positive is, will this help one person? And I just kind of imagine a specific person,\n\n11:58.440 --> 12:02.600\n depending on the thing that that would help with, like when I'm trying to create something,\n\n12:02.600 --> 12:06.280\n whether it's a piece of hardware or a video or anything like that,\n\n12:06.280 --> 12:09.000\n or educational material, lecture, that kind of stuff.\n\n12:10.520 --> 12:15.960\n I don't know. What do you think about this quote? Like what is it profound or just poetic?\n\n12:15.960 --> 12:20.040\n I think it's more profound than it sounds at first. The example I think of is Michelle\n\n12:20.040 --> 12:24.520\n Bachmann. She was a former Congresswoman from Minnesota. She clearly had crazy eyes,\n\n12:24.520 --> 12:29.880\n something was going on with her husband. But she adopted like 20 kids. Terry Shappert is\n\n12:29.880 --> 12:34.200\n another friend of mine. He's like either Navy SEAL or Marines. Whatever it is, Terry,\n\n12:34.200 --> 12:41.480\n I apologize. I'm not trying to be funny. And he adopts elder dogs. So going back to Bachmann,\n\n12:41.480 --> 12:45.240\n it's like, yeah, you can say she's crazy. You can make fun of her politics all you want,\n\n12:45.240 --> 12:51.080\n and all that stuff's legitimate. But if you save a kid, give them a home, and you save them from\n\n12:51.080 --> 12:55.880\n the foster system, and you put a roof over their heads and make them feel loved and appreciated,\n\n12:55.880 --> 13:02.200\n it's really hard for me to sit here and call you like a totally bad person.\n\n13:02.200 --> 13:08.920\n I think that kind of thing is... Nick Cersei is another one. He adopted a kid. And I said,\n\n13:08.920 --> 13:15.480\n I think you're a hero. One of the things that's very hard for me in writing, as you know,\n\n13:15.480 --> 13:20.920\n I talk about this endlessly in this book, The White Pill, but writing about when people do\n\n13:20.920 --> 13:26.440\n hurtful things to children, it really is hard to watch. And it's hard to... Because when you're an\n\n13:26.440 --> 13:30.280\n author, you have to kind of empathize with the character. Where's this character coming from?\n\n13:30.280 --> 13:34.200\n Explain their point of view. And that's the one that's the hardest for me to wrap my head around.\n\n13:34.760 --> 13:35.960\n Cruelty to children.\n\n13:35.960 --> 13:43.080\n Yeah. And yeah, sadism to children. It's just like, this is something even animals know not\n\n13:43.080 --> 13:46.360\n to do. Do you know what I mean? Dogs, when you see them around kids, they're very\n\n13:47.000 --> 13:50.760\n protective. If the kid pokes their eyes out, the dog doesn't do anything.\n\n13:50.760 --> 13:56.600\n So it's like, if you can't even get to that level, what kind of person are you? So I think that quote\n\n13:59.160 --> 14:04.840\n is a profound one, and it's an important one. It also means we're not all called upon to be\n\n14:04.840 --> 14:11.880\n Superman. You only have very finite ability to move the needle. But at the same time,\n\n14:12.440 --> 14:18.440\n if you have actually saved the life, you can go to meet your maker. You did your part. You left\n\n14:18.440 --> 14:21.320\n the world a little bit better than you found it. And that's all you could ask anybody.\n\n14:21.880 --> 14:28.600\n Also, I think from a policy perspective, it seems we just do better when we focus on doing a small\n\n14:28.600 --> 14:34.040\n thing, helping one person. Because it feels like when you start talking about communism and all\n\n14:34.040 --> 14:38.600\n those kinds of things, when you start to believe you could do good by a lot of people, that's where\n\n14:38.600 --> 14:44.440\n your mind somehow stops being able to do good by a lot of people. That's when you start to think\n\n14:44.440 --> 14:51.400\n about utopias and somehow utopias goes to feeds power into the brain to where it deludes you\n\n14:51.400 --> 14:56.600\n completely. And then you start, it's okay to crack a few eggs to make an omelette kind of reasoning\n\n14:56.600 --> 15:01.800\n and you run into trouble. It seems like it's much better even when you have the power and the money\n\n15:01.800 --> 15:08.120\n and so on to achieve scale, to focus on one and then... Or locally, yeah. Locally, yeah.\n\n15:08.840 --> 15:13.640\n Because then also you have the feedback. Right. So if you have some kind of program in Austin or\n\n15:13.640 --> 15:17.320\n Brooklyn or something like that, and you can watch, oh, this is working, this isn't working,\n\n15:17.320 --> 15:22.760\n then you could port it out to other places. But top down helping is at the very least,\n\n15:22.760 --> 15:27.160\n it's going to be inefficient. And also I think it's a lot more useful when you're helping people\n\n15:27.160 --> 15:31.960\n when it's a one on one relationship because then it's less, I don't know, embarrassing,\n\n15:31.960 --> 15:36.840\n but certainly less something to receive help. And you also feel it's one thing if you get a check\n\n15:36.840 --> 15:40.760\n from the government, food stamps, it's nothing if someone's like, hey, I'm going to buy your\n\n15:40.760 --> 15:44.760\n groceries until you get back on your feet. You have this kind of motivation, I think for most\n\n15:44.760 --> 15:50.120\n people to be like, you know what? This person believed in me. I'm going to make it worth their\n\n15:50.120 --> 15:55.800\n while that they believed in me because I didn't believe in me. When I was giving lectures at MIT,\n\n15:55.800 --> 16:01.320\n there was one, it was scared shitless. And I mean, everybody, you know how students are and all that\n\n16:01.320 --> 16:06.680\n kind of stuff. They're kind of bored and they don't understand that you're human too. Yeah.\n\n16:06.680 --> 16:13.640\n Or this could be just me. They don't understand you're trying to pass as human.\n\n16:13.640 --> 16:20.680\n Yeah. But there's one gentleman in the audience and he went to all the lectures, all the gentlemen,\n\n16:20.680 --> 16:28.520\n he was a faculty at MIT. And he just, without very kind of nonchalant, just said, after the lectures,\n\n16:28.520 --> 16:35.000\n he would kind of nod at me and say, you did great. And before, like one time he said,\n\n16:35.000 --> 16:40.440\n in a non creepy way, I know this is going to come off as creepy. He said, you look great today.\n\n16:41.640 --> 16:51.320\n He said that in the way, so he's like 60, 70, whatever. I don't know. It's in a wise sage way,\n\n16:51.320 --> 16:55.880\n because I was wearing a suit and tie. I look like, when you dress up like a young kid,\n\n16:55.880 --> 17:02.520\n you dress them up for school. So he was just like, all right, you're all dressed up. You're\n\n17:02.520 --> 17:08.040\n looking great. You got this. I don't know. That has a lasting impact, that kind of pat on the back.\n\n17:08.040 --> 17:15.160\n But I agree with you. Cruelty towards other adults is somehow understandable,\n\n17:16.120 --> 17:22.840\n because it's a world full of conflict, but cruelty towards children doesn't,\n\n17:24.360 --> 17:31.960\n it doesn't quite, I can't understand it. I can't understand how you could act in a way that directly\n\n17:31.960 --> 17:39.000\n causes suffering to a child in front of you. I don't think I've ever talked to you,\n\n17:39.000 --> 17:44.200\n this might be a good time to ask you about this. What do you make, what lessons do you draw about\n\n17:44.200 --> 17:51.720\n human civilization from Jeffrey Epstein, from just laying out? Everybody thinks about different\n\n17:51.720 --> 17:58.520\n things. When you talk to Eric Weinstein, he thinks about intelligence and Jeffrey Epstein\n\n17:58.520 --> 18:05.080\n is a front for something else. That's what he thinks about. I think about the weakness of grown\n\n18:06.200 --> 18:12.520\n men in the face of charismatic evil, which is like, for me directly, is MIT. I didn't know.\n\n18:12.520 --> 18:17.480\n I actually was, I guess I was at MIT when Jeffrey Epstein was just at the very end.\n\n18:17.480 --> 18:25.000\n He must have been there. I didn't know any of this, but it really bothers me that nobody was able to\n\n18:25.000 --> 18:30.840\n see through this man because he's obviously, what is also obvious to me is that he was very\n\n18:30.840 --> 18:41.720\n charismatic. I try to think about human nature from this perspective is directly, like we said,\n\n18:41.720 --> 18:50.360\n help one life. Would I know a Jeffrey Epstein if he was in my life? Would I know evil when I saw\n\n18:50.360 --> 18:58.680\n evil? Even if it's sitting across from you. Exactly. The evil laugh. Thank you.\n\n19:03.960 --> 19:05.160\n It's a Necronomicon.\n\n19:07.240 --> 19:12.040\n I'm sure we'll talk about it. Maybe not. It doesn't really matter. We see things, you and I,\n\n19:12.040 --> 19:17.000\n Michael, very differently about a lot of things politically and so on. The reason I like you a\n\n19:17.000 --> 19:23.800\n lot, the reason I like the people I do in my life is there's a warmth, there's a kindness,\n\n19:23.800 --> 19:29.960\n there's a humanity underneath it all. I don't really care what you believe. I don't care what\n\n19:29.960 --> 19:35.080\n your Twitter says. It's easy to mistake your Twitter to indicate that there's not a deeply\n\n19:35.080 --> 19:42.840\n human love for humanity in there. And that's why I'm detecting that. I think I would be able to\n\n19:42.840 --> 19:48.280\n detect that Jeffrey Epstein. If you say detect, I'm just imagining the T1000 sketch. Yeah.\n\n19:48.280 --> 19:59.560\n Detected. Yes. I imagine, I hope I would be able to not detect that Epstein lacks that completely.\n\n19:59.560 --> 20:06.840\n Even if he's charismatic in the humor he has, even if he is charismatic in the expression of\n\n20:06.840 --> 20:15.080\n curiosity for science, which he did. He was curious about not just boring minutia of science.\n\n20:15.080 --> 20:19.800\n He was interested about the big questions in science, which I could see that become exciting\n\n20:19.800 --> 20:25.000\n to scientists. Like, oh wow, here's a person who's thinking big. That's always exciting.\n\n20:25.000 --> 20:31.160\n When somebody goes into a room and thinks about how do we solve intelligence? How do we travel\n\n20:31.160 --> 20:35.800\n faster than the speed of light? That's exciting to people, especially people with money because\n\n20:35.800 --> 20:41.080\n it's like, all right, so we might be able to actually do big things here. But you could see\n\n20:41.080 --> 20:48.680\n through the bullshit, the deadness in the eyes. I don't know. So I think about that because I feel\n\n20:48.680 --> 20:54.760\n like I have the responsibility for me as an individual to detect evil. So I, do you know\n\n20:54.760 --> 21:00.040\n who Michael Allig is? Okay. This is going to be a whole long, this is going to be on Lex Clips,\n\n21:00.040 --> 21:04.520\n but this is a whole long story. So there was a scene in New York in the nineties called the\n\n21:04.520 --> 21:09.560\n Club Kids. And they would go out to different nightclubs at night. They would all dress in\n\n21:09.560 --> 21:17.160\n really kind of crazy costumes. And the costumes were all like goofy and like just like an angel.\n\n21:17.160 --> 21:21.640\n This was dressed like a nurse. There was a juvenile aspect to it. They're all taking,\n\n21:21.640 --> 21:27.640\n you know, ketamine and ecstasy to all hours. This is kind of, rape culture was coming up in there.\n\n21:27.640 --> 21:34.680\n And ahead of it, and in fact, there's a clip on YouTube. I think it was the Jane Whitney show\n\n21:34.680 --> 21:40.120\n of the Club Kids and Gigi Allen. Gigi Allen is a, you know, kind of punk rock performer,\n\n21:40.120 --> 21:46.920\n hard rock performer who passed away. And the audience and Gigi Allen was very aggressive and\n\n21:46.920 --> 21:52.840\n like a crazy person. My friend once saw him in a concert and he took a dump on stage,\n\n21:53.400 --> 21:57.400\n smeared it all over his face, grabbed the girl from the audience, gave her a big kiss.\n\n21:57.400 --> 22:02.440\n And as she walked by him, she just went like this, like, excuse me, like went to the bathroom.\n\n22:02.440 --> 22:06.600\n So the audience is screaming at Gigi Allen because he's very visibly over the top.\n\n22:06.600 --> 22:10.520\n Whereas you got a bunch of these kids dressed in these silly costumes, you guys just having fun.\n\n22:10.520 --> 22:14.680\n Well, the head of the Club Kids, Michael Allig, ended up killing someone. There was a kid called\n\n22:14.680 --> 22:18.680\n Angel Menendez who hung around with them. He would always have angel wings and boots.\n\n22:19.560 --> 22:27.160\n One time they're at Michael's condo with another drug dealer named Freeze. They got into a fight.\n\n22:27.160 --> 22:31.560\n So Angel got hit in the head with a hammer. They kill him. What are we going to do with the body?\n\n22:32.360 --> 22:36.840\n They put it on ice in the bathtub. They had a party. So everyone's going to the bathroom while\n\n22:36.840 --> 22:41.000\n Angel's body's there. Michael got, they're like, all right, we got to take care of this. Michael\n\n22:41.000 --> 22:48.040\n got extremely high in heroin, had like a cutlery from Macy's, saw the body in pieces, put it in a\n\n22:48.040 --> 22:52.760\n box. They took him in a cab. The cab driver helped them throw the body into the river.\n\n22:52.760 --> 22:57.320\n And then Michael starts walking around Manhattan wearing Angel's boots and would tell people,\n\n22:57.320 --> 23:02.120\n oh, I killed Angel. Now, because he was a super effeminate, over the top, like he would pee in\n\n23:02.120 --> 23:06.520\n people's beer kind of guy, everyone's like, oh God, Michael, like you and your stupid pranks.\n\n23:07.480 --> 23:15.320\n But it was true. And he got caught and he got sentenced to jail. So I was in a store in Manhattan\n\n23:15.320 --> 23:19.240\n in Soho. And it was one of those stores where you have like all sorts of things for sale.\n\n23:19.240 --> 23:24.280\n And I saw a painting and it said Malice. And I'm like, wait, what? And it was M. Allig. It was a\n\n23:24.280 --> 23:28.200\n Michael Allig painting. He had painted while in jail. So my mom bought it for me for my birthday.\n\n23:28.200 --> 23:32.440\n I don't remember what birthday it was. And I started writing to him in prison. He was going\n\n23:32.440 --> 23:37.800\n to write a memoir called Aligula, which is clever. And then I actually went to visit him. I'm like,\n\n23:37.800 --> 23:41.960\n I want to see what this person's like. Because on one hand, he's king of New York nightlife,\n\n23:41.960 --> 23:46.680\n this goofy person. And it's also kind of ironic that G.G. Allen is like, maybe he's gross. He's\n\n23:46.680 --> 23:49.800\n not killing anybody. He's probably an accountant off the stage. And Michael Allig actually did\n\n23:49.800 --> 23:56.440\n kill someone and then bragged about it, tongue in cheek. But meeting him, he passed away last\n\n23:56.440 --> 24:07.480\n December, on Christmas actually, on Christmas 2020. He was clearly a sociopath. And I'd never\n\n24:07.480 --> 24:12.520\n met a sociopath before. Now, a lot of times you'll read these, you'll take a BuzzFeed quiz, like,\n\n24:12.520 --> 24:17.880\n are you a sociopath? And it's like, oh, my feelings weren't hurt when I was mean to someone. It's not\n\n24:17.880 --> 24:25.400\n a thin line between me and you and him. It's a thick, thick line. Because when you're talking\n\n24:25.400 --> 24:30.040\n to someone like that, at least in this specific case, he was being very friendly. And it's not\n\n24:30.040 --> 24:36.200\n like he was going to kill anyone or as a threat to me. But there's that sense like something's\n\n24:36.200 --> 24:43.320\n really off here. And he was talking to me about how after he had killed Angel, he would just talk\n\n24:43.320 --> 24:48.760\n about it because he felt so much guilt. He just wanted to get caught. It's like, no, no, no. What\n\n24:48.760 --> 24:54.040\n he was describing wasn't guilt. He was describing just he didn't like the knife over his head,\n\n24:54.600 --> 24:58.200\n like waiting to get caught. I'm like, you don't even know what guilt is? So it was kind of like,\n\n24:58.200 --> 25:07.400\n oh, wow. But the thing is Michael Allig was in a very low social position. And the thing is when\n\n25:07.400 --> 25:16.280\n someone is powerful, very high status, and they do something, we are as kind of hierarchical animals,\n\n25:16.280 --> 25:22.360\n we kind of defer to their norms. So if you're at a party with, let's suppose,\n\n25:23.160 --> 25:27.800\n either of us, and it's like a Jeffrey Epstein party, and everyone at the party is doing some\n\n25:27.800 --> 25:33.080\n sort of weird drug we've never heard of, we wouldn't really feel comfortable judging them\n\n25:33.640 --> 25:41.080\n because like their norms kind of become the norm for that space. The lesson for me about Jeffrey\n\n25:41.080 --> 25:48.280\n Epstein, there's a lot of them because I think to me, the biggest moment was the Amy Rohrbach\n\n25:48.280 --> 25:54.280\n situation. Amy Rohrbach was caught on a hot mic saying that they had all the goods on him,\n\n25:54.280 --> 25:59.560\n they had all the names, and that Buckingham Palace called them, they killed the story because they\n\n25:59.560 --> 26:06.440\n weren't going to get a Meghan Markle interview out of it. So that, the willingness of those in power\n\n26:06.440 --> 26:13.640\n to do the wrong thing for the flimsiest pretext, I think was a big important lesson. Also the fact\n\n26:13.640 --> 26:20.920\n that no one at ABC had any consequences for this. In fact, the only person who got in trouble for\n\n26:20.920 --> 26:26.760\n all this was someone who used to work at ABC, went to I believe CBS, and they got fired from CBS\n\n26:26.760 --> 26:29.880\n because apparently they had access to footage at one point, even though they weren't the ones who\n\n26:29.880 --> 26:37.720\n had leaked it. So whistleblowers are like the only, for example, the case in Eric Garner,\n\n26:37.720 --> 26:43.480\n the guy who was selling Lucy cigarettes in New York City, who was arrested, he had a heart\n\n26:43.480 --> 26:49.320\n attack or whatever it was on the way to jail, he died. So the cops had a situation, the only person\n\n26:49.320 --> 26:55.480\n who had gotten in trouble because of that was the guy filming it, he went to jail. So I think there's\n\n26:55.480 --> 27:02.200\n a lesson in terms of, look at Julian Assange, right? There's a huge amount of power exercised\n\n27:02.200 --> 27:07.720\n by elites to make sure that what is done on the cover of darkness remains on the cover of darkness.\n\n27:07.720 --> 27:12.360\n And also Kevin McCarthy, who was currently the House Minority Leader, leader of the Republicans,\n\n27:12.360 --> 27:18.680\n he wrote a letter to ABC News, like, you had this guy, maybe you couldn't call in the authorities,\n\n27:18.680 --> 27:22.520\n but you could have leaked it to somebody, why hasn't anything come forward? Nothing happened\n\n27:22.520 --> 27:27.000\n as a result of this. We also have to keep in mind that the longest serving Republican Speaker of\n\n27:27.000 --> 27:30.840\n the House in history, Dennis Hastert, went to jail because of things related to pedophilia and things\n\n27:30.840 --> 27:37.720\n like that. So as Russians, and this is something I think you and I have mentioned before, Americans\n\n27:37.720 --> 27:44.200\n are very naive, often decreasingly so, about the nature of evil. They think an evil person is\n\n27:44.200 --> 27:50.520\n someone who's getting kickbacks or the Cuomos are colluding, something like that. I would hardly even\n\n27:50.520 --> 27:57.240\n call that evil. No, no, this is the sort of things that are so depraved that you would never think\n\n27:57.240 --> 28:01.560\n about it in a million years in your own home. You don't think in these terms. And I think they get\n\n28:01.560 --> 28:07.560\n off on doing things that if the average person heard about it, the average person would be shocked\n\n28:07.560 --> 28:10.600\n because that gives them this sense of we're above them, we're different from them.\n\n28:10.600 --> 28:14.920\n The rules don't apply to us. There's a lot to say here. So what is the norm thing you said\n\n28:14.920 --> 28:21.000\n at a party? It's really interesting for an NR cast to say that. Well, no, it's this. No, well,\n\n28:21.000 --> 28:25.960\n I know, I know. I'm not, sorry, that came off as criticism. I meant it as harsh criticism.\n\n28:28.600 --> 28:38.120\n No, I think about that a lot. I found myself in situations where I'm invited to these kinds of\n\n28:38.120 --> 28:44.040\n parties where people have nice things. And I find it deeply uncomfortable for that reason.\n\n28:45.080 --> 28:52.520\n I don't want to be sort of an activist that goes in and ruins a party. I think that's not the\n\n28:52.520 --> 28:57.880\n courageous act. Neither is it courageous when everyone's doing some weird drug that you mentioned\n\n28:57.880 --> 29:06.840\n to join in, I think. Courageous is more being, remaining yourself, sticking to your principles,\n\n29:06.840 --> 29:12.040\n calmly in that room where everybody is doing the drug. And just don't do the drug. Don't make a\n\n29:12.040 --> 29:18.200\n scene about it, but also don't do it. And I think that little act of courage over time is the way\n\n29:18.200 --> 29:24.600\n you resist Jeffrey Epstein. That exactly the thing you said is probably the situation where charisma\n\n29:24.600 --> 29:30.840\n works. So one charismatic person gets the little crowd going and the crowd is everybody sort of\n\n29:30.840 --> 29:39.160\n is everybody sort of establishes a norm at the little crowd. And yes, there could be some dynamics\n\n29:39.160 --> 29:43.880\n that allow that norm to be established. Like you said, like rich and powerful people might\n\n29:44.920 --> 29:50.920\n enjoy being rich and powerful and better than everybody else kind of thing. But\n\n29:52.280 --> 29:58.680\n like I, especially for scientists, I thought they should have integrity and courage enough to\n\n29:58.680 --> 30:04.200\n to see through that. Not again, as an activist, like so you can tweet about it, how courageous you\n\n30:04.200 --> 30:09.320\n are, but just literally see there's something off here. There's something off here and I'm not going\n\n30:09.320 --> 30:14.200\n to participate in it. I'm going to defend these scientists because something off, first of all,\n\n30:14.200 --> 30:19.880\n You're always defending academia is disgusting. It's my favorite thing. I think that, first of all,\n\n30:19.880 --> 30:26.200\n this is going to sound like a joke and it's not, I bet you 90% of those MIT scientists are on the\n\n30:26.200 --> 30:30.520\n spectrum. So everyone they're going to meet is going to be off. Right? So I'm sure part of their\n\n30:30.520 --> 30:33.320\n brain is like, okay, this person's weird. This is just them being on the spectrum.\n\n30:33.320 --> 30:36.280\n Like the light spectrum. I couldn't even finish the joke. Okay.\n\n30:38.280 --> 30:46.440\n Number two is off. We, we tend to, there's this poem, I forget who wrote it. It was like Nick\n\n30:46.440 --> 30:53.720\n Cave or something. And it was describing like, I think it was Goebbels hair, normal height,\n\n30:53.720 --> 31:00.120\n normal weight, normal. What do you expect? Horns. Right? So when you meet someone, you think\n\n31:00.120 --> 31:04.360\n something's off, there's going to be a bell curve of what that could be. Right? It could be that\n\n31:04.360 --> 31:08.840\n they're twitchy or maybe they're completely asocial. And then you have Jeffrey Epstein over\n\n31:08.840 --> 31:14.040\n here. You're going to need a lot of evidence to be like, Oh, I feel something off there for this\n\n31:14.040 --> 31:20.280\n guy's the head of an international, you know, sex trafficking ring. So yeah, you might be like, okay.\n\n31:20.280 --> 31:24.600\n But at the same time, if their extended relationship is this guy is interested in my work,\n\n31:24.600 --> 31:28.920\n he's going to fund my work and I don't have to give him anything in return. He's clearly intelligent.\n\n31:28.920 --> 31:34.680\n He's appreciating it. And being a scientist is a thankless job. I, I know what it's like as an\n\n31:34.680 --> 31:38.520\n author. When I was writing Dear Reader, the North Korea book, my friends are sick of hearing all\n\n31:38.520 --> 31:41.800\n these North Korea anecdotes. Cause at a certain point it's like, okay, we got it. Just save it\n\n31:41.800 --> 31:45.080\n for the book. And you know, you gotta be in that lab. You're looking at the springtails,\n\n31:45.080 --> 31:47.320\n whatever it is you're looking at. No one knows what a springtail is.\n\n31:47.320 --> 31:52.920\n I just disagree with you. So that'd be interesting to draw a distinction between science and writing\n\n31:52.920 --> 31:58.360\n because the scientific process itself is fun as fuck. It's you're solving little puzzles.\n\n31:58.360 --> 31:58.840\n Sure.\n\n31:58.840 --> 32:04.760\n So like in itself, it's fun. So like it's rewarding. Like the reason you go into\n\n32:05.880 --> 32:12.040\n science is you can continue really without a boss to continue having fun and solving puzzles.\n\n32:12.040 --> 32:18.840\n That's, that's literally, so like, uh, unless you become cynical and tired of the whole thing.\n\n32:18.840 --> 32:23.880\n So the, the people, the administration, or when you're running a large lab and what you get sick\n\n32:23.880 --> 32:29.160\n of is the emails and the meetings and all that kind of stuff. The actual act of being in the lab\n\n32:29.160 --> 32:36.440\n is still fun as fuck. If you allow it to be writing, I feel like is there's more priority\n\n32:36.440 --> 32:43.080\n to publishing. Like, would you enjoy it? The tree falling in the forest, would you still enjoy any\n\n32:43.080 --> 32:45.880\n of the books you've written if they never got published?\n\n32:45.880 --> 32:47.960\n Not to the same extent, not even close.\n\n32:47.960 --> 32:53.720\n Right. I think that's the thing about science. It's almost like you get a peek into the mysterious.\n\n32:53.720 --> 32:59.240\n Yeah, but this is, okay, let me, this is where I'm coming from. Since moving to Austin,\n\n32:59.240 --> 33:02.200\n I've bought 150, over 150 plants.\n\n33:02.200 --> 33:06.520\n Look how you're doing the, the politician thing.\n\n33:06.520 --> 33:09.960\n Let me be clear. All right. It's not.\n\n33:09.960 --> 33:13.880\n Oh, you are running in 2024. This is very interesting.\n\n33:13.880 --> 33:19.400\n I bought 150 succulents from my house. They're, they're thriving here in Austin as they wouldn't have in Brooklyn.\n\n33:19.400 --> 33:20.600\n You have a great video about it.\n\n33:20.600 --> 33:26.200\n Yeah. One of those plants I have is the photo I took on my Instagram. There's no other photos on the whole internet.\n\n33:26.200 --> 33:31.240\n None of my friends care or they care like ostensibly, but like, oh, that's cool. Like I have a better plant\n\n33:31.240 --> 33:36.200\n collection in my house than like almost any botanical succulent collection than any botanical\n\n33:36.200 --> 33:39.160\n garden in America other than probably the Huntington and no one cares.\n\n33:39.160 --> 33:40.920\n This is what ego looks like, by the way.\n\n33:40.920 --> 33:42.920\n I was, I can prove it to you.\n\n33:42.920 --> 33:45.160\n No, I know, but you don't have to rub it in.\n\n33:45.160 --> 33:49.560\n Well, they have a big budget. I don't. So if I can put it together, they should be able to.\n\n33:49.560 --> 33:50.200\n Right.\n\n33:50.200 --> 33:56.920\n So I can only imagine that a scientist who studied, you know, those spiders that look like ants,\n\n33:56.920 --> 34:02.040\n like at a certain, like, oh, and this species does this with the gender dimorphism.\n\n34:02.040 --> 34:05.880\n Their friends are only going to care so much. So if you meet someone who has a lot of money,\n\n34:05.880 --> 34:09.400\n who now cares about ant spiders, it's going to be exciting.\n\n34:09.400 --> 34:13.160\n It will be very exciting. But I just wanted to push back on the,\n\n34:14.600 --> 34:20.200\n I think the act itself should be the biggest reward. I think you're always safe.\n\n34:20.200 --> 34:25.000\n We're talking about goodness being a safe default. I think it's a good default\n\n34:25.000 --> 34:33.960\n for plants and for writing and for science is to just enjoy the act, even if nobody cares.\n\n34:33.960 --> 34:36.440\n Okay. This is where this, okay. Now I'm even,\n\n34:36.440 --> 34:39.480\n now I'm wondering why I'm pushing back so hard and I realized what it was.\n\n34:40.280 --> 34:44.440\n Because I've made this point several times and I'm glad I can make it again.\n\n34:45.000 --> 34:50.040\n There's this window of time that happened in my life. And I know it happens to a lot of people\n\n34:50.040 --> 34:56.840\n when you're in your 24 to 27, 28. So 21 to 24, you still have your friends from college,\n\n34:56.840 --> 35:02.920\n so on and so forth. But then it's kind of like a poker game and every so often people cash out.\n\n35:02.920 --> 35:05.960\n They're like, I'm out, I'm out. They get married, they get a job, they move.\n\n35:06.600 --> 35:12.520\n And if you are someone who is a young, ambitious creative, that window is a very rough one because\n\n35:12.520 --> 35:18.120\n you're doing the right thing and you're not being a drug addict, you're not being a philanderer,\n\n35:18.120 --> 35:22.760\n not that those things are wrong, but just like you're playing by the rules. You're creating your\n\n35:22.760 --> 35:27.560\n stuff, what you want to be known for, contribution you want to make for the world. And no one cares\n\n35:27.560 --> 35:34.600\n and it gets very lonely. And there's this very emotional disconnect about how is it that I'm\n\n35:34.600 --> 35:40.040\n creating and I'm working hard and I'm making something happen and it's just radio silence.\n\n35:40.040 --> 35:44.760\n So that, I don't think it's that easy when you're, you're the scientist, not me,\n\n35:44.760 --> 35:50.520\n when you don't have any kind of external validation. Humans only have so much fuel.\n\n35:50.520 --> 35:57.560\n TITO Nothing worth having is easy, Michael. By the way, yesterday I talked on the phone with a\n\n35:57.560 --> 36:03.960\n person who said he was deeply moved the first time you mentioned this age group of 24 to 27. He's\n\n36:03.960 --> 36:11.400\n like, he, he's 26, he said, and he feels the full responsibility of that and the excitement. So he\n\n36:11.400 --> 36:17.000\n left his like corporate typey job to pursue something that he's really passionate about.\n\n36:17.000 --> 36:22.600\n And that, that, that was like, you were an inspiration to him, which I was deeply saddened\n\n36:22.600 --> 36:30.040\n by that. MICHAEL I also inspired Michael Alex. TITO The, the, the, the amount of mass murder,\n\n36:30.600 --> 36:36.920\n those that were inspired by you will eventually lead to is, is truly horrifying. What were we\n\n36:36.920 --> 36:43.800\n talking about? So Jeffrey Epstein, oh, one thing I wanted to ask you. So let's put scientists aside.\n\n36:43.800 --> 36:52.200\n What about like world leaders? Bill Clinton, your favorite person. Why would he fly with Jeffrey\n\n36:52.200 --> 37:00.600\n Epstein? Why would he interact with that guy? MICHAEL I mean, don't you think that that's kind\n\n37:00.600 --> 37:06.680\n of the deal that I'm the president and I get big and powerful people flying around their jets\n\n37:06.680 --> 37:12.440\n and that's the symbiotic relationship. TITO Yeah, but don't you also have a good BS detector? Like\n\n37:13.480 --> 37:18.920\n don't you have a good detector for people who just want to be in your presence? Like I already\n\n37:20.120 --> 37:23.960\n understand that there's people like this out there. Like there's people that kind of\n\n37:24.680 --> 37:31.240\n want to use me for stuff. And you mean Tim Dylan, Tim Dylan. Um,\n\n37:31.240 --> 37:37.800\n TITO I love that guy. You guys met? MICHAEL We haven't met yet here.\n\n37:37.800 --> 37:40.440\n TITO We haven't met. Okay. Wow. MICHAEL We met before in New York,\n\n37:40.440 --> 37:44.120\n but we had not since I moved here. TITO Yeah. So you should be able to\n\n37:44.120 --> 37:47.960\n detect that there's those people and there's the people that have kindness in their heart,\n\n37:47.960 --> 37:51.480\n even if they can benefit from the interaction with you, but they have like, they're good human\n\n37:51.480 --> 37:56.520\n beings. I feel like you want to, you run into a lot of trouble if you surround yourself or have\n\n37:56.520 --> 38:01.800\n any people that are manipulative like that. MICHAEL But I think you make a bad example.\n\n38:01.800 --> 38:06.280\n Cause like, let's look at Clinton and let's look at Obama, right? So Obama, even though their\n\n38:06.280 --> 38:12.040\n politics are very close, I'd say in many ways, Obama is apparent. We don't know. I don't know\n\n38:12.040 --> 38:16.760\n either of them, but to me it seems very apparent that he's very similar behind closed doors as he\n\n38:16.760 --> 38:18.680\n in front of the camera. TITO Yeah. He's, he's Barack to me.\n\n38:18.680 --> 38:21.080\n MICHAEL Oh, yeah. Yeah. TITO He's good.\n\n38:21.080 --> 38:27.960\n MICHAEL Clinton seems very clearly to be much more of a performer. He's in front of the cameras,\n\n38:27.960 --> 38:32.120\n he puts on a role, but behind the cameras, he very much has a temper. He's known for that.\n\n38:32.120 --> 38:35.000\n He's much more of a lech. TITO What's that?\n\n38:35.000 --> 38:37.960\n MICHAEL A pervert. TITO Oh, lech with an E?\n\n38:37.960 --> 38:39.080\n MICHAEL L E T C H. Yeah.\n\n38:39.080 --> 38:43.880\n TITO Oh, cool. Lech. Is that like a, that's a cool term. So I can use that on the internet.\n\n38:44.520 --> 38:46.680\n Like you're a lech. MICHAEL Yeah, you can use it on the internet.\n\n38:46.680 --> 38:49.240\n TITO You're a dirty lech. MICHAEL Well, it's dirty is implied.\n\n38:49.240 --> 38:52.840\n TITO Oh, so it's okay. Being redundant.\n\n38:52.840 --> 38:55.080\n MICHAEL Yeah. TITO But it just feels like he\n\n38:55.080 --> 38:59.400\n needs an adjective to give it more power. Anyway, I'm sorry. So Clinton is a lech.\n\n38:59.400 --> 39:06.440\n MICHAEL Right. So you can see how there's people who want to meet, you know, the surface Bill\n\n39:06.440 --> 39:10.680\n Clinton and I'm sure that gets old for him because he has to be on. But then there's the good old\n\n39:10.680 --> 39:15.960\n boys where he could be a pervert and this guy's like, yeah, I know what it's like. And then he\n\n39:15.960 --> 39:20.200\n feels like he's himself. But I'm all, we're all speculating. I mean, I don't know what Bill\n\n39:20.200 --> 39:24.440\n Clinton is like, what was in it for him. He certainly had, could afford private jets if he\n\n39:24.440 --> 39:28.280\n wanted to. There's no shortage of people who want to fly around the world to give speeches, you know.\n\n39:28.280 --> 39:32.360\n TITO Can he satisfy the lech within,\n\n39:34.440 --> 39:38.040\n without hanging out with the Jeffrey Epstein's of the world? Like, can't he get, I mean,\n\n39:38.040 --> 39:43.000\n this is the Monica Lewinsky question to me. I'm confused by all of this. Can he get\n\n39:43.000 --> 39:50.680\n TITO women in the legitimate way of like not using his power, not hanging out with these\n\n39:51.320 --> 39:57.320\n shady rich people, but just like having a normal mistress like JFK had?\n\n39:57.320 --> 39:58.520\n MICHAEL Well, JFK had a lot.\n\n39:58.520 --> 40:02.520\n TITO I know. I understand that. But in a normal way, or I don't, I don't know enough.\n\n40:02.520 --> 40:09.880\n MICHAEL I don't understand the Clinton psychology. First of all, the fact that you're hooking up with\n\n40:09.880 --> 40:15.800\n someone who's close to your daughter's age, to me, I think is inherently disturbing. But she's an\n\n40:15.800 --> 40:22.520\n adult. So okay, that's not that, that, you know, beyond the pale. But also the idea that, oh, if I\n\n40:22.520 --> 40:28.680\n don't physically fornicate with you, it's not cheating. Like that, whatever you tell yourself,\n\n40:28.680 --> 40:34.280\n or like, if I don't ejaculate, it's not cheating. Like these rules that\n\n40:34.280 --> 40:38.840\n TITO And it maybe leads to some kind of slippery slope, like you start not having the rules of\n\n40:38.840 --> 40:44.280\n MICHAEL Who you fool? I mean, if you told your wife, like, listen, it wasn't cheating. She only,\n\n40:44.280 --> 40:49.080\n you know, performed on me. You're going to say this with a straight face? Like, do you, at a\n\n40:49.080 --> 40:54.440\n certain point when something is so brazen, you wonder if the person even has to believe it because\n\n40:54.440 --> 40:58.040\n who are you fooling? TITO But like, we started this,\n\n40:58.040 --> 41:06.520\n this conversation with, there is a line between young women older than 18 and young teen, like 12,\n\n41:06.520 --> 41:10.840\n 13 kids. MICHAEL Have you ever, when's the last, oh, because you're, it's different for you because\n\n41:10.840 --> 41:17.640\n you're at MIT. I was hanging out with Blair White, and she had a couple of fans with her, of hers,\n\n41:17.640 --> 41:24.360\n and they were like 22, 23. And they were like children to me. Like, I'm like, to me, as someone\n\n41:24.360 --> 41:32.280\n who is in his late 60s, to look at these people as adults, like, they look completely like kids. So\n\n41:32.280 --> 41:38.760\n TITO Now, of course, there's exceptions. Like, I've interacted with a young 20 year olds that are\n\n41:38.760 --> 41:44.840\n like, you're way more mature than I'll ever be. Like, the wisdom that comes out of them is quite\n\n41:44.840 --> 41:51.880\n fascinating. MICHAEL Visually, the energy and the way they look, they looked so young to me and the\n\n41:51.880 --> 41:59.160\n way they carried themselves. It was the idea that my instinct was let's tuck you in and read you a\n\n41:59.160 --> 42:04.360\n bedtime story, not let me like touch you or something. It was just like, it just went into\n\n42:04.360 --> 42:10.840\n my head. So there's, but the thing is, is it possible that in order to want to be the president,\n\n42:10.840 --> 42:17.160\n you have to be a crazy person? TITO That you have some kind of weird view on power. It could be a\n\n42:17.160 --> 42:23.080\n power thing too. Like, you can get away with stuff. MICHAEL Like, if I was Clinton's age,\n\n42:23.080 --> 42:28.440\n nothing about Monica Lewinsky to me would be attractive. And also, I would just feel bad for\n\n42:28.440 --> 42:35.000\n her because I know she's going to catch feelings. And it's kind of like, it's just like, why would\n\n42:35.000 --> 42:40.040\n I do this to this kid? For what? Just because I want to get some like momentary pleasure? Come on.\n\n42:40.040 --> 42:45.640\n TITO Beauty is in the eye of the beholder. I'm sure she looked gorgeous to him in the moment.\n\n42:47.320 --> 42:51.640\n Well, let me ask, we started talking about beauty. Who are you wearing?\n\n42:51.640 --> 43:01.400\n MICHAEL So as a model, you usually don't have a shirt on when you're modeling.\n\n43:02.600 --> 43:09.880\n So it's nice to see you dressed up today. Nice and warm.\n\n43:09.880 --> 43:15.240\n TITO This is because, so for those who don't know, Russians don't celebrate Christmas,\n\n43:15.240 --> 43:17.480\n obviously with the Soviet Union, Christmas was illegal.\n\n43:17.480 --> 43:22.440\n MICHAEL No Thanksgiving, basically no major holidays where everyone gets together. This\n\n43:22.440 --> 43:25.000\n is the one holiday, New Year's. It's the one holiday.\n\n43:25.000 --> 43:28.360\n TITO I remember as a kid, instead of Santa Claus,\n\n43:28.360 --> 43:30.680\n we have Ded Moroz, who's the same thing, basically.\n\n43:30.680 --> 43:34.680\n MICHAEL It's like Android and iPhone. It's like a cheap version of Christmas.\n\n43:34.680 --> 43:38.920\n TITO He's got this girl with him. She's like Snow White or whatever. And Russian kids,\n\n43:38.920 --> 43:43.000\n they go to sleep on December 31st and they wake up January, they have a present under their pillow.\n\n43:43.000 --> 43:47.800\n And I remember as a kid, this happened once and it just blew my mind. You know what I mean?\n\n43:47.800 --> 43:51.400\n It's just like, I went to bed, my dad's like, oh, you know, you're going to have,\n\n43:51.400 --> 43:54.680\n Ded Moroz is going to bring you a present if you've been a good kid. I'm like, I think I was\n\n43:54.680 --> 43:58.200\n a good kid. But you don't even remember a year of your life when you're four.\n\n43:58.200 --> 44:00.440\n MICHAEL You remember those moments.\n\n44:00.440 --> 44:05.480\n TITO Yeah. And then I woke up and there was a present under my pillow and it just blew my mind.\n\n44:05.480 --> 44:13.400\n And that building is still there, 1461 Sherwood Parkway in Brooklyn. And it's just also funny,\n\n44:13.400 --> 44:20.280\n like, what I really like about kids, you know, being an uncle now is kid logic, because they have\n\n44:20.280 --> 44:25.960\n very little data, but they're using logic to make sense of it. And sometimes it gives them the\n\n44:25.960 --> 44:32.840\n completely wrong conclusions for the completely right reasons. I remember, you know, my bedroom\n\n44:32.840 --> 44:37.880\n as a kid was right off the kitchen and I'd be scared of the dark a little bit. So they'd leave\n\n44:37.880 --> 44:43.560\n the light on the kitchen while I went to sleep. And at the same time, my parents had told me,\n\n44:43.560 --> 44:47.240\n you don't leave the lights on the house. It costs money, it wastes electricity. Right?\n\n44:47.240 --> 44:51.720\n So I would be worried because I'm like, oh, my God, my parents leave the lights on the kitchen\n\n44:51.720 --> 44:57.160\n all night and now it's costing them so much money. Not realizing that, you know, five minutes after\n\n44:57.160 --> 45:00.840\n I'm out, obviously they're turning the lights off. But like in my kid logic, this was a concern of\n\n45:00.840 --> 45:07.160\n mine. Yeah. And memories work that same way. I have a collection of memories that are stitched\n\n45:07.160 --> 45:12.520\n together logically somehow, but they also don't really make sense. There's a few defining things.\n\n45:12.520 --> 45:21.480\n So I grew up in Russia and experienced a lot of New Year's in Russia. There's a lot of incredible\n\n45:21.480 --> 45:27.560\n things about that tradition that just warms my heart. So one, as a kid, you mentioned these kind\n\n45:27.560 --> 45:34.040\n of stories. That's the one night of the year that kids are allowed to be adults in the following\n\n45:34.040 --> 45:39.800\n way. Like in kid logic, you're allowed to stay up all night. Oh, yeah. Okay.\n\n45:39.800 --> 45:43.800\n That was as late as you want, which actually ends up being, you're not used to it.\n\n45:45.000 --> 45:50.360\n Right, you're out. You crash. But no, you get to, you know, two, three, four at night,\n\n45:50.360 --> 45:55.800\n you stay up and what you get to witness is almost like Alice in Wonderland goes into this world.\n\n45:55.800 --> 46:01.480\n Yeah. You get to witness what is the adult world really like. Now, obviously it's not an actual\n\n46:01.480 --> 46:07.960\n adult world. A lot of drinking and fighting. A merriment, like laughing, fighting, arguing,\n\n46:07.960 --> 46:15.960\n but also like in our case, like singing and like, yeah, arguing, like philosophical stuff,\n\n46:15.960 --> 46:23.800\n but also like, if I may, how would I describe it? This is also probably a little bit of Russian\n\n46:23.800 --> 46:29.960\n culture, but like flirtation in all of its forms, meaning like men and women just being like,\n\n46:29.960 --> 46:31.400\n cause they dress up. Yeah, yeah.\n\n46:31.400 --> 46:37.640\n It's like, it's joy. It's like you get to show off like dresses, whatever you got,\n\n46:37.640 --> 46:45.320\n you show it off. This is fun. And then men too, just like friends laughing, like arguing,\n\n46:45.320 --> 46:50.040\n just showing off the best they got with delicious food. Obviously that there's a Thanksgiving\n\n46:50.040 --> 46:55.960\n element there where there's just so many, just you bring out all the traditional stuff.\n\n46:56.760 --> 47:03.240\n The, yes, salad, just everything, just the full thing with the desserts and obviously the vodka,\n\n47:03.240 --> 47:10.600\n a lot of vodka. And at the time, so this is the Soviet Union, like the biggest stuff,\n\n47:10.600 --> 47:15.800\n and this is so sad that these are the things that I remember is like Coca Cola.\n\n47:15.800 --> 47:16.600\n Oh yeah.\n\n47:16.600 --> 47:23.560\n Like American, like that, I would probably kill somebody for a Dr. Pepper. It's so fascinating\n\n47:23.560 --> 47:31.560\n that you take it for granted, sort of the results of capitalist society, the material things that\n\n47:31.560 --> 47:40.600\n are created, but that was the ultimate happiness is to experience this new thing, sugar. I don't\n\n47:40.600 --> 47:43.160\n know. Under scarcity you just love it.\n\n47:43.160 --> 47:48.680\n There's like communist Coca Cola in Czech Republic. So basically they tried to rip off Coke\n\n47:49.400 --> 47:55.400\n and it's just like, they just threw whatever they could together and it was a very poor knockoff,\n\n47:55.400 --> 47:58.760\n as you can imagine. I forget what it's called and all the Czech people right now are getting very\n\n47:58.760 --> 48:04.200\n angry at me because I can't think of it, but they have it now and the slogan is good or weird.\n\n48:05.560 --> 48:09.240\n So it's like this, so they kind of reclaimed this kind of hipster soda.\n\n48:09.240 --> 48:11.320\n Oh, that's awesome. It's almost like a parody.\n\n48:11.320 --> 48:12.360\n That's right. Yeah.\n\n48:12.360 --> 48:20.600\n But I think the thing I really remember is the camaraderie, like the love for each other\n\n48:21.240 --> 48:27.880\n and neighbors too. Like you and I are neighbors now. We don't see each other that often.\n\n48:28.520 --> 48:31.880\n I hope that changes, but a lot of it is also me. I'm just a deep introvert.\n\n48:33.160 --> 48:35.320\n You're also the hardest working person I know.\n\n48:35.320 --> 48:42.360\n Yeah. So it's time, but it's not like I'll go in the middle of the night at like 4 AM\n\n48:42.360 --> 48:48.840\n and go to 7 11 and just sit there sipping a Slurpee for an hour thinking about life.\n\n48:48.840 --> 48:54.440\n So it's not like I'm always working. Yeah, I don't know. What I mean is you get to meet your\n\n48:54.440 --> 49:00.920\n neighbors and you get to experience their highs and their lows and you get to bitch about life,\n\n49:00.920 --> 49:05.400\n about government, about corruption, about the unfairness of life together.\n\n49:05.400 --> 49:09.880\n Well, it's also I think what people don't appreciate as Americans is it's very rare\n\n49:09.880 --> 49:12.360\n in Russia to have a safe space. Yeah.\n\n49:12.360 --> 49:19.160\n So you know that January 1st, no one's going to snitch on you. They're not going to be informants\n\n49:19.160 --> 49:25.720\n probably. So you can vent and that's the thing with people in totalitarian countries. You have\n\n49:25.720 --> 49:29.560\n to have the public facing persona and then behind closed doors is very different.\n\n49:29.560 --> 49:35.560\n It all comes out. And I also remember the arguments and I've been going on Clubhouse\n\n49:35.560 --> 49:44.360\n recently into Russian rooms just to practice Russian. And it's so beautiful to watch. I mean,\n\n49:44.360 --> 49:49.480\n Clubhouse is a very specific collection of Russian people. Maybe it's a little bit political\n\n49:50.760 --> 49:57.080\n and they're a little bit older. And it's interesting to watch how much they love to\n\n49:57.080 --> 50:04.600\n argue. They love to argue. And so it would be literally, you could think of it as a\n\n50:04.600 --> 50:07.640\n nonlinear dynamical system, okay, from an engineering perspective.\n\n50:10.200 --> 50:16.040\n Whenever any positive topic comes up, you could feel the skepticism and then wait a minute,\n\n50:16.040 --> 50:25.640\n this is not good. And they'll start perturbing it until they'll find some way to say, come on now,\n\n50:25.640 --> 50:30.200\n that is the dumbest thing I've ever heard. And then it goes back into argument. It's so fun to watch\n\n50:30.200 --> 50:36.760\n because in one sense, you could see it as negative. In another, you could see it as free to express\n\n50:36.760 --> 50:44.200\n yourself because it feels like you can solve a lot of problems by allowing yourself to just\n\n50:44.200 --> 50:49.320\n be emotional, both emotional and say hard truth and all those kinds of things\n\n50:49.320 --> 50:57.800\n without patting yourself on the back about it. But also it just sort of those Russian rooms\n\n50:59.000 --> 51:04.520\n make me realize how constrained American speech is, how careful people are in the way they express\n\n51:04.520 --> 51:12.040\n it. Even the Michael Malice's in the world, you're constantly being nuanced. There they just say\n\n51:12.040 --> 51:17.000\n crazy shit and then they correct themselves and make fun of themselves and they completely\n\n51:17.000 --> 51:24.280\n shift opinions a minute later. And it's chaos. I mean, it's beautiful. So I love that that\n\n51:24.280 --> 51:31.160\n culture is, it's funny given the current regime in Russia, like how that's coupled with how people\n\n51:31.160 --> 51:38.520\n are talking and yeah, I don't know. And I have those memories of childhood of friends that I\n\n51:38.520 --> 51:44.520\n had of just having that true freedom of talking. And somehow that leads to deep bonds together.\n\n51:44.520 --> 51:51.400\n When the life, when you're poor, when life has a lot of elements that are unfair,\n\n51:51.960 --> 51:56.760\n when the government is corrupt, there's sort of, it's just, especially in the Soviet Union,\n\n51:56.760 --> 52:01.480\n there's uncertainty about the future. All of it, you just get closer together. Like penguins\n\n52:01.480 --> 52:07.320\n huddling together in the cold, like that March of the Penguins movie. I don't know. The friends\n\n52:07.320 --> 52:16.680\n I've gotten there, like I get emotional every time I kind of think about those friends because\n\n52:16.680 --> 52:22.520\n it was so close. That friendship was so fucking close. But I just really hate the Russian cynicism.\n\n52:22.520 --> 52:28.520\n No, I know you do. And I actually disagree with you about it. You see it as cynicism. I see it as\n\n52:29.400 --> 52:35.240\n waves on top of the water, like surface cynicism and the depths as I see the beauty of the Russian\n\n52:35.240 --> 52:42.040\n soul. So yes, that cynicism can negatively affect a lot of people. I think you've talked about,\n\n52:42.040 --> 52:50.040\n like as a parent, being cynical about the world and then you have dire negative consequences on\n\n52:50.040 --> 52:54.840\n your children. They become cynical. They don't ever take big risks, they take on bold things.\n\n52:54.840 --> 53:00.680\n And I have those arguments because the cynicism is exhausting. It's destructive. It's anti\n\n53:00.680 --> 53:06.680\n creative. But so in their perspective is, this is what the Russian folks would say, well, yes,\n\n53:06.680 --> 53:12.280\n that's our role. Like being cynical is being reasonable about the world.\n\n53:12.280 --> 53:16.040\n But it's not. It's completely unreasonable. It's a complete lie.\n\n53:16.040 --> 53:22.440\n I know. But their argument is, yes, but we're giving you this force and it's your job to resist\n\n53:22.440 --> 53:28.760\n against it. So it's a test. I love the idea that if you're going to be creative and innovative,\n\n53:28.760 --> 53:32.520\n you don't have enough up against you. Yeah, exactly. This is exactly it.\n\n53:32.520 --> 53:35.960\n It's not hard enough already that I want to be an author. Now you got to be like, well,\n\n53:35.960 --> 53:42.200\n let me just put some fire ants on top of it. So I just want to separate, I agree with you that the\n\n53:42.200 --> 53:51.800\n cynicism is bad and destructive, but the idea that life is suffering and thinking from that\n\n53:51.800 --> 53:56.120\n as a first principle, I think there's a lot of beauty to be discovered through that.\n\n53:56.120 --> 54:00.920\n So there's a cynicism and then there's a horrible message.\n\n54:02.200 --> 54:03.080\n Life is suffering?\n\n54:05.000 --> 54:08.680\n Well, yeah. I mean, Camus. Camus doesn't think that.\n\n54:11.000 --> 54:15.800\n Now we're going into definitions of suffering then because absurd.\n\n54:17.400 --> 54:20.840\n Life is absurd and life is suffering are not even close to the same concept.\n\n54:20.840 --> 54:22.920\n Well, then you're just defining the terms differently.\n\n54:22.920 --> 54:24.200\n Well, that's because they're different terms.\n\n54:24.200 --> 54:28.280\n Well, so is love and beauty, but let's define terms.\n\n54:28.280 --> 54:31.240\n You're selling if your baby's in the crib, like with a fever and you're like,\n\n54:31.240 --> 54:34.600\n oh, that's absurd. No, it's the kids suffering. It's not the same.\n\n54:34.600 --> 54:39.320\n So yes, starvation, you've been for the white pill researching a lot of actual\n\n54:39.320 --> 54:40.840\n specifically defined suffering.\n\n54:41.560 --> 54:44.200\n Sure. But also a lot of wonderful things.\n\n54:45.320 --> 54:51.960\n Right. Yeah. But the word suffering can encompass more than just specifically starving.\n\n54:51.960 --> 54:58.200\n And it can encompass like a lot of the philosophers talk about it.\n\n54:58.200 --> 55:00.040\n It encompass like philosophical suffering.\n\n55:00.040 --> 55:05.560\n The fact that if you're not careful, life can appear meaningless.\n\n55:05.560 --> 55:07.480\n You can fall into a nihilistic view.\n\n55:09.320 --> 55:13.880\n It's difficult to have the responsibility of freedom to act in this world because you\n\n55:13.880 --> 55:15.800\n can fuck up in so many different ways.\n\n55:15.800 --> 55:25.320\n And then life is seemingly unfair in the sense that good things happen for no apparent reason\n\n55:25.320 --> 55:27.960\n and terrible things happen for no apparent reason.\n\n55:27.960 --> 55:32.920\n Like, you know, it's the old religious question of why does evil happen in the world?\n\n55:33.560 --> 55:35.000\n Why do terrible things happen in the world?\n\n55:35.000 --> 55:37.400\n There's this book called Six Word Memoirs, right?\n\n55:37.400 --> 55:39.320\n Where all these different personalities.\n\n55:39.320 --> 55:40.200\n Those are awesome.\n\n55:40.200 --> 55:41.000\n Were you in it?\n\n55:41.000 --> 55:41.480\n No.\n\n55:41.480 --> 55:45.080\n I'm in it with, so you had to basically write your autobiography in six words.\n\n55:45.080 --> 55:45.640\n Six words.\n\n55:45.640 --> 55:47.880\n And mine was good things happen to bad people.\n\n55:49.720 --> 55:50.600\n You see, there you go.\n\n55:50.600 --> 55:51.400\n There's humor.\n\n55:51.400 --> 55:51.640\n Yes.\n\n55:51.640 --> 55:53.240\n That's your way of dealing with the suffering.\n\n55:53.240 --> 55:54.520\n But I don't think life is inherent.\n\n55:54.520 --> 55:58.360\n If life was suffering, we wouldn't be able to have happiness.\n\n55:58.360 --> 55:58.760\n No.\n\n55:58.760 --> 56:01.320\n Out of suffering, happiness is born.\n\n56:01.320 --> 56:03.720\n So like, it's the ups and downs of life.\n\n56:03.720 --> 56:04.520\n And what it means like...\n\n56:05.240 --> 56:11.480\n I don't agree at all that you need to suffer in order to be happy.\n\n56:11.480 --> 56:14.360\n I agree you have to work hard, but that's not the same thing.\n\n56:14.360 --> 56:15.160\n Yeah, all right.\n\n56:15.160 --> 56:17.960\n So the way I'm using suffering, and I think a lot of them use suffering,\n\n56:17.960 --> 56:20.520\n is the way you use like gravity.\n\n56:20.520 --> 56:23.240\n So in order for the roller coaster to work, you need gravity.\n\n56:23.880 --> 56:26.280\n There needs to be a force that bring you down.\n\n56:26.280 --> 56:26.680\n Sure.\n\n56:26.680 --> 56:34.440\n In that same way, there's like, you have to resist the natural pull of nature\n\n56:34.440 --> 56:37.320\n that wants to destroy you.\n\n56:37.320 --> 56:41.080\n No, nature wants you to...\n\n56:41.080 --> 56:47.320\n Nature isn't different, but we have the capacity because we're blessed with minds\n\n56:47.320 --> 56:48.760\n and we're blessed with friends.\n\n56:48.760 --> 56:50.680\n Yeah, to transcend nature.\n\n56:50.680 --> 56:56.200\n Yeah, I know, but I think it's a word that captures something about life\n\n56:58.520 --> 57:01.240\n that there's no reason to it, that is absurd.\n\n57:01.240 --> 57:04.760\n I think to me, oftentimes the way I think about the word suffering\n\n57:04.760 --> 57:07.240\n is synonymous with absurdity.\n\n57:07.240 --> 57:11.720\n This is not suffering, but this is absurd.\n\n57:11.720 --> 57:15.400\n I just noticed there's a box with a big bow on it next to you.\n\n57:16.280 --> 57:17.800\n What's in the box, Michael?\n\n57:17.800 --> 57:18.760\n It's your present.\n\n57:18.760 --> 57:20.200\n So it's your present for New Year's.\n\n57:20.200 --> 57:21.560\n Can we open it?\n\n57:21.560 --> 57:22.120\n Yeah, sure.\n\n57:24.200 --> 57:25.240\n What's in the box?\n\n57:25.720 --> 57:27.320\n And you brought up suffering.\n\n57:27.320 --> 57:28.680\n This is going to be very unpleasant.\n\n57:28.680 --> 57:29.240\n Here you go.\n\n57:30.760 --> 57:31.880\n I packed it myself.\n\n57:33.000 --> 57:34.680\n Yeah, there's a whole process in there.\n\n57:34.680 --> 57:36.360\n So there's three presents in there.\n\n57:38.760 --> 57:41.400\n Lex, I'll read the card first.\n\n57:41.400 --> 57:41.960\n Okay.\n\n57:46.840 --> 57:52.200\n Something about opening presents, like tearing stuff, makes me feel like,\n\n57:52.200 --> 57:56.360\n because like I just tore the sheet of paper, so it'll never be the same again.\n\n57:57.160 --> 57:58.040\n It's entropy.\n\n57:58.040 --> 57:58.840\n It's entropy.\n\n57:58.840 --> 57:59.800\n Time is...\n\n57:59.800 --> 58:01.400\n You've got a powerful voice.\n\n58:01.400 --> 58:06.920\n You've got a powerful voice to Lex.\n\n58:06.920 --> 58:07.800\n Thank you.\n\n58:07.800 --> 58:09.400\n Maybe I should read the other card first.\n\n58:10.040 --> 58:11.320\n You've got a powerful voice.\n\n58:11.320 --> 58:14.840\n Listening to what you have to say always puts me in a hopeful place.\n\n58:14.840 --> 58:17.080\n I feel like this is building up to something.\n\n58:17.080 --> 58:21.960\n You show me how change can happen when you face the world with pride, confidence,\n\n58:21.960 --> 58:24.120\n and a voice that can't be silenced.\n\n58:24.120 --> 58:25.400\n Keep speaking up.\n\n58:25.400 --> 58:27.160\n The world is listening.\n\n58:27.160 --> 58:34.200\n Yeah, there's no cynicism in this card.\n\n58:34.200 --> 58:34.920\n No, this is about...\n\n58:34.920 --> 58:35.720\n This is New Year's.\n\n58:35.720 --> 58:37.400\n This is all about hope and joy.\n\n58:37.400 --> 58:37.900\n Love.\n\n58:38.600 --> 58:39.160\n To Lex.\n\n58:39.160 --> 58:40.440\n I'm seeing the binary.\n\n58:40.440 --> 58:45.160\n To Lex, thank you for setting the path for me to move to Austin.\n\n58:45.160 --> 58:57.320\n 0 1 0 0 1 0 0 1 0 1 1 0 1 1 0 0 0 1 1 1 0 1 0 1.\n\n58:57.320 --> 58:58.040\n Michael Malice.\n\n58:58.040 --> 58:58.540\n Yeah.\n\n59:00.360 --> 59:01.560\n Brings tears to my eyes.\n\n59:02.360 --> 59:03.320\n Thank you, brother.\n\n59:03.320 --> 59:03.880\n My pleasure.\n\n59:05.960 --> 59:07.080\n Let's get to the present.\n\n59:09.480 --> 59:09.980\n Okay.\n\n59:11.480 --> 59:12.600\n It's a PC box.\n\n59:12.600 --> 59:14.280\n This is very promising.\n\n59:15.080 --> 59:16.280\n It better not be sex toys.\n\n59:16.280 --> 59:17.000\n I swear to God.\n\n59:17.000 --> 59:20.280\n There's nothing inappropriate at all.\n\n59:20.280 --> 59:20.780\n Why would it?\n\n59:21.560 --> 59:23.160\n Why would sex toys be inappropriate?\n\n59:23.160 --> 59:24.680\n That's sex positive.\n\n59:24.680 --> 59:25.800\n Because you're a virgin.\n\n59:29.320 --> 59:30.760\n You gotta bring a knife to a party.\n\n59:35.080 --> 59:37.400\n How clever is it to put it in a PC box?\n\n59:37.400 --> 59:37.880\n Well, I had it.\n\n59:37.880 --> 59:38.920\n I just got a new PC.\n\n59:40.360 --> 59:40.860\n Okay.\n\n59:40.860 --> 59:41.880\n Get this also canned.\n\n59:41.880 --> 59:42.600\n Get this also canned.\n\n59:43.320 --> 59:43.820\n Yeah.\n\n59:43.820 --> 59:45.080\n Open the can first.\n\n59:45.080 --> 59:45.720\n Open the can.\n\n59:49.560 --> 59:50.760\n Do you wrap this yourself?\n\n59:56.200 --> 59:57.320\n That scared the shit out of me.\n\n1:00:05.320 --> 1:00:06.840\n Could get back in the can.\n\n1:00:06.840 --> 1:00:08.440\n That actually stayed in there.\n\n1:00:08.440 --> 1:00:09.320\n That's magic.\n\n1:00:09.320 --> 1:00:13.080\n You just gotta cut the string.\n\n1:00:13.080 --> 1:00:13.580\n No.\n\n1:00:20.280 --> 1:00:22.360\n You're the most beautiful troll of all.\n\n1:00:22.360 --> 1:00:22.680\n I am.\n\n1:00:22.680 --> 1:00:23.480\n I love you so much.\n\n1:00:30.520 --> 1:00:31.320\n This is awesome.\n\n1:00:31.320 --> 1:00:38.520\n Did it not work?\n\n1:00:39.480 --> 1:00:40.040\n Pick it up.\n\n1:00:42.440 --> 1:00:43.160\n Oh, it didn't work.\n\n1:00:47.640 --> 1:00:50.840\n There's a terrifying springy feeling to this thing.\n\n1:00:51.800 --> 1:00:52.920\n I don't want to open this.\n\n1:00:52.920 --> 1:01:03.640\n I need to move something aside.\n\n1:01:03.640 --> 1:01:04.840\n I hate you so much.\n\n1:01:04.840 --> 1:01:05.560\n What?\n\n1:01:05.560 --> 1:01:06.060\n What?\n\n1:01:08.680 --> 1:01:10.040\n Oh, is it the other way?\n\n1:01:10.040 --> 1:01:23.800\n No, just pick it up.\n\n1:01:23.800 --> 1:01:30.520\n I can't believe I fell for that.\n\n1:01:30.520 --> 1:01:31.800\n I hate you so much.\n\n1:01:33.480 --> 1:01:34.680\n Wrenches are my favorite.\n\n1:01:35.560 --> 1:01:36.840\n I can't believe I fell for that.\n\n1:01:37.560 --> 1:01:38.060\n Okay.\n\n1:01:38.060 --> 1:01:40.460\n And there's box number three.\n\n1:01:40.460 --> 1:01:41.900\n It's like a matryoshka.\n\n1:01:41.900 --> 1:01:43.180\n I can't believe that worked.\n\n1:01:43.180 --> 1:01:43.680\n Yeah.\n\n1:01:46.140 --> 1:01:49.180\n I wanted the box to open all these gears to fall out, but you can't get any.\n\n1:01:49.180 --> 1:01:49.980\n You can't get them.\n\n1:01:49.980 --> 1:01:50.480\n Yeah.\n\n1:01:50.480 --> 1:01:52.300\n Does that really grind your...\n\n1:01:52.300 --> 1:01:54.380\n You know what grinding is?\n\n1:01:57.500 --> 1:01:58.460\n Why am I scared?\n\n1:01:58.460 --> 1:02:09.020\n Okay, there's another box.\n\n1:02:13.980 --> 1:02:15.420\n This leads to my death.\n\n1:02:15.420 --> 1:02:17.900\n No, no, this isn't, this is, there's a story behind it.\n\n1:02:21.020 --> 1:02:22.220\n I can't believe that worked.\n\n1:02:22.860 --> 1:02:24.220\n Oh God, that's so good.\n\n1:02:24.220 --> 1:02:24.720\n All right.\n\n1:02:24.720 --> 1:02:26.560\n All right, no springs, no weapons.\n\n1:02:26.560 --> 1:02:27.360\n No wrenches.\n\n1:02:34.880 --> 1:02:35.380\n Okay.\n\n1:02:35.380 --> 1:02:37.760\n So let me tell you the story behind that toy.\n\n1:02:39.520 --> 1:02:43.360\n Tonka robots that turn into vehicles.\n\n1:02:43.360 --> 1:02:51.600\n So when you, when I was a kid, you had transformers, but for us poor people, you had go bots.\n\n1:02:51.600 --> 1:02:55.520\n Right? So the go bots, there were four main characters for the good guys.\n\n1:02:55.520 --> 1:02:58.480\n It was leader one, small foot turbo and scooter.\n\n1:02:59.200 --> 1:03:04.240\n And what was annoying is when you had the action figures, you couldn't find the ones that were on\n\n1:03:04.240 --> 1:03:04.740\n the TV show.\n\n1:03:05.920 --> 1:03:07.760\n And I was a big go bots fan as a kid.\n\n1:03:08.400 --> 1:03:12.720\n And I went once to the Toys R Us in Caesars Bay in Brooklyn with my grandfather.\n\n1:03:13.200 --> 1:03:16.800\n My grandfather was always very lucky, like just good things happen to him every so often.\n\n1:03:17.520 --> 1:03:18.240\n And I went there.\n\n1:03:18.240 --> 1:03:23.520\n I remember very vividly, they must have just unpacked, just loaded the shelves and how they\n\n1:03:23.520 --> 1:03:26.720\n had the shelving, it would be like, like a grid, you know, you'd have like, it was like one, two,\n\n1:03:26.720 --> 1:03:31.440\n three, four, five, five rows and like, uh, five by five.\n\n1:03:32.000 --> 1:03:36.400\n And I remember it was like two up and then you have to do, you have to sit by the side\n\n1:03:36.400 --> 1:03:37.760\n and kind of sort through them.\n\n1:03:37.760 --> 1:03:40.640\n And with the go bots, each package had a picture of the different figures.\n\n1:03:40.640 --> 1:03:43.520\n So the packaging wasn't uniform and they just had scooter there.\n\n1:03:44.080 --> 1:03:45.120\n She was just sitting there.\n\n1:03:45.120 --> 1:03:52.800\n And I was like, holy crap, so that feeling when you're a kid and you find that just sitting\n\n1:03:52.800 --> 1:03:56.720\n on the shelf is just, it was such this, is this that scooter?\n\n1:03:56.720 --> 1:03:59.200\n No, I have it though, but that one is for you.\n\n1:03:59.200 --> 1:04:03.280\n I thought if you want to put it next to your other robots, open it up, I can open it up.\n\n1:04:03.280 --> 1:04:04.160\n Yeah, that's for you.\n\n1:04:04.160 --> 1:04:08.720\n And that way, uh, it's that symbol of joy when you have, when you're a kid, when you\n\n1:04:08.720 --> 1:04:13.680\n find something you really want, I think it just is really, it's a symbol of joy.\n\n1:04:13.680 --> 1:04:18.800\n I think it just is really like, so when people look at it, they'll be like, don't be hopeless.\n\n1:04:18.800 --> 1:04:20.320\n I'll open this carefully later.\n\n1:04:20.320 --> 1:04:21.120\n No, do it, do it.\n\n1:04:21.120 --> 1:04:22.080\n Should I do it now?\n\n1:04:22.080 --> 1:04:22.240\n Yeah.\n\n1:04:22.240 --> 1:04:22.720\n Okay.\n\n1:04:22.720 --> 1:04:23.920\n There's no way to open it carefully.\n\n1:04:25.040 --> 1:04:26.240\n Kids don't open stuff carefully.\n\n1:04:26.240 --> 1:04:27.680\n You rip that crap open.\n\n1:04:27.680 --> 1:04:29.680\n But then you break it and then you cry.\n\n1:04:29.680 --> 1:04:31.200\n That's what happens when you're a kid.\n\n1:04:31.200 --> 1:04:32.080\n I never did that.\n\n1:04:32.080 --> 1:04:32.400\n Okay.\n\n1:04:33.840 --> 1:04:34.320\n Me neither.\n\n1:04:34.320 --> 1:04:35.200\n I never cried.\n\n1:04:35.200 --> 1:04:36.560\n I never got presents either.\n\n1:04:40.000 --> 1:04:40.880\n That is so cool.\n\n1:04:40.880 --> 1:04:47.760\n All right, Scooter, you symbolize childlike discovery.\n\n1:04:47.760 --> 1:04:48.080\n Right?\n\n1:04:53.280 --> 1:04:54.480\n The poor man's robot.\n\n1:04:55.360 --> 1:04:56.640\n The poor man's transformers.\n\n1:04:58.800 --> 1:05:01.120\n I think there's instructions on the back how to transform her.\n\n1:05:02.240 --> 1:05:02.800\n To her?\n\n1:05:02.800 --> 1:05:05.040\n I only found out as an adult that it was supposed to be a girl.\n\n1:05:05.040 --> 1:05:05.280\n Yeah.\n\n1:05:06.080 --> 1:05:06.400\n Wow.\n\n1:05:06.400 --> 1:05:07.280\n This changes everything.\n\n1:05:07.280 --> 1:05:12.400\n Thank you, Mark.\n\n1:05:12.400 --> 1:05:13.040\n No, give me here.\n\n1:05:13.040 --> 1:05:13.440\n Let me show it.\n\n1:05:13.440 --> 1:05:14.800\n It looks better when she's transformed.\n\n1:05:16.800 --> 1:05:17.440\n What?\n\n1:05:17.440 --> 1:05:19.840\n No, there's levels to that statement.\n\n1:05:19.840 --> 1:05:21.920\n Oh, how does it do like this?\n\n1:05:21.920 --> 1:05:25.280\n Let me see if I remember how to do it because I had this as a kid.\n\n1:05:26.080 --> 1:05:26.720\n Arms out.\n\n1:05:29.760 --> 1:05:31.520\n The thing is, these are easy to break, I remember.\n\n1:05:32.400 --> 1:05:33.200\n Is it like this?\n\n1:05:33.200 --> 1:05:35.840\n No, oh, the front comes out.\n\n1:05:35.840 --> 1:05:37.040\n Oh, let me see this.\n\n1:05:38.000 --> 1:05:38.800\n Oh, this comes up.\n\n1:05:38.800 --> 1:05:39.360\n Yeah, yeah, yeah.\n\n1:05:40.160 --> 1:05:40.400\n Yep.\n\n1:05:40.400 --> 1:05:41.120\n So that's that.\n\n1:05:42.320 --> 1:05:43.280\n The arms go.\n\n1:05:43.760 --> 1:05:46.720\n I'm having visions of like baby Michael.\n\n1:05:47.760 --> 1:05:48.800\n I can't do it.\n\n1:05:48.800 --> 1:05:49.920\n Okay, I can't do it.\n\n1:05:49.920 --> 1:05:50.880\n I can't figure it out.\n\n1:05:50.880 --> 1:05:52.080\n Wow, you're right.\n\n1:05:52.080 --> 1:05:54.000\n She looks so much better transformed.\n\n1:05:54.000 --> 1:06:00.960\n Oh, all right, I'm going to follow the instructions in a bit and I'll leave.\n\n1:06:00.960 --> 1:06:01.520\n Yeah, yeah.\n\n1:06:01.520 --> 1:06:03.840\n I'll leave this failed project of yours.\n\n1:06:05.680 --> 1:06:06.640\n Oh, there's a wheel out.\n\n1:06:07.520 --> 1:06:09.680\n Look, I don't like this in between form.\n\n1:06:11.680 --> 1:06:13.680\n Well, this is how it's going to be.\n\n1:06:13.680 --> 1:06:14.180\n Okay.\n\n1:06:15.280 --> 1:06:19.520\n Because we're going to be accepting of the transformation that takes time.\n\n1:06:19.520 --> 1:06:20.020\n Okay.\n\n1:06:21.040 --> 1:06:25.280\n I got, I saw this.\n\n1:06:27.280 --> 1:06:28.000\n Oh, it's this.\n\n1:06:28.000 --> 1:06:33.360\n A little thing when I was walking on Congress and it says resist.\n\n1:06:33.360 --> 1:06:34.080\n It's a bracelet.\n\n1:06:34.080 --> 1:06:35.200\n I mean, think of you.\n\n1:06:35.200 --> 1:06:37.760\n The reason I got it is because there's two bracelets.\n\n1:06:38.400 --> 1:06:43.360\n So one said lucky fuck and the other one said resist.\n\n1:06:43.360 --> 1:06:47.920\n Now, I first saw resist and I'm like, and then I saw the lucky fuck and I realized I'm\n\n1:06:47.920 --> 1:06:50.640\n a lucky fuck to find a relevant.\n\n1:06:52.240 --> 1:06:53.760\n It makes me think of you.\n\n1:06:53.760 --> 1:06:54.720\n This is very nice.\n\n1:06:54.720 --> 1:06:55.760\n Resist the powerful.\n\n1:06:55.760 --> 1:06:57.440\n Oh, that's true.\n\n1:06:59.760 --> 1:07:00.640\n I saw this somewhere.\n\n1:07:01.840 --> 1:07:02.800\n Oh, yeah, yeah, yeah.\n\n1:07:04.800 --> 1:07:12.480\n This has to do with, in terms of resist, you often bring up the book Machiavellians by\n\n1:07:12.480 --> 1:07:13.120\n James Burnham.\n\n1:07:13.680 --> 1:07:18.640\n And so I was looking through, I was reading different parts.\n\n1:07:18.640 --> 1:07:20.240\n It's a tricky read.\n\n1:07:20.240 --> 1:07:20.960\n It's a little bit.\n\n1:07:20.960 --> 1:07:25.600\n But there is a ebook Kindle version now that I've been working through this.\n\n1:07:25.600 --> 1:07:27.760\n I think there's actually an audio book too, anyway.\n\n1:07:27.760 --> 1:07:34.400\n Yeah, I just bought some, the Machiavellians is James Burnham's analysis of four thinkers\n\n1:07:34.400 --> 1:07:36.080\n that he regards as the Machiavellians.\n\n1:07:36.080 --> 1:07:44.720\n It was Gaetano Moscow, Vilfredo Pareto, Georges Sorel, and I'm blanking on the Moscow Pareto,\n\n1:07:44.720 --> 1:07:47.840\n Sorel, and Georges Michel.\n\n1:07:47.840 --> 1:07:52.560\n And I just got Pareto's autograph in the mail this week.\n\n1:07:54.960 --> 1:07:58.320\n So he talks about freedom and liberty.\n\n1:07:58.320 --> 1:08:05.200\n This interesting line that I'd like to get your opinion on in terms of resist and in\n\n1:08:05.200 --> 1:08:06.320\n terms of liberty.\n\n1:08:06.320 --> 1:08:11.600\n There's no one force, he goes, quote, there's no one force, no group, and no class that\n\n1:08:11.600 --> 1:08:13.680\n is the preserver of liberty.\n\n1:08:13.680 --> 1:08:17.920\n Liberty is preserved by those who are against the existing chief power.\n\n1:08:19.680 --> 1:08:25.680\n Oppositions which do not express genuine social forces are as trivial in relation to entrenched\n\n1:08:25.680 --> 1:08:27.920\n power as the old court jesters.\n\n1:08:28.880 --> 1:08:36.160\n So, I mean, the question here is, can liberty, are you comfortable with that definition or\n\n1:08:36.160 --> 1:08:42.800\n that view of liberty, of freedom, that at its highest ideal is expressed through the\n\n1:08:42.800 --> 1:08:46.240\n resistance to the powerful as opposed to existing in its own?\n\n1:08:46.240 --> 1:08:53.360\n I think his point, broadly speaking, which I agree with, is the only thing that can work\n\n1:08:53.360 --> 1:08:55.840\n to mitigate power is other power.\n\n1:08:56.800 --> 1:09:04.960\n That talk is cheap and persuasion has very limited efficacy.\n\n1:09:05.760 --> 1:09:11.280\n It's like if there's a burglar, right, and one person will give you a speech about property\n\n1:09:11.280 --> 1:09:16.320\n rights and you shouldn't be in this person's house and the other person has a gun, it's\n\n1:09:16.320 --> 1:09:18.560\n clear which is going to be more persuasive.\n\n1:09:20.080 --> 1:09:25.520\n Yeah, but can't you just be free without the struggle, without this conflict?\n\n1:09:26.480 --> 1:09:34.160\n What I'm uncomfortable with this view is how closely it links freedom and conflict.\n\n1:09:34.960 --> 1:09:39.520\n Like, why does this world have to have conflict for you to be free?\n\n1:09:39.520 --> 1:09:42.480\n Can't, I mean, it's, and part of it is just emphasis.\n\n1:09:42.480 --> 1:09:44.560\n Well, you weren't just saying suffering is what leads to joy.\n\n1:09:46.400 --> 1:09:47.920\n See, and now you're in agreement.\n\n1:09:47.920 --> 1:09:48.240\n Thank you.\n\n1:09:48.240 --> 1:09:51.280\n That's, I just did that just so you can come around and agree.\n\n1:09:51.280 --> 1:09:51.760\n I win.\n\n1:09:52.400 --> 1:09:53.040\n Next topic.\n\n1:09:57.120 --> 1:09:59.600\n Wow, I'm playing 3D chess here.\n\n1:10:00.960 --> 1:10:01.280\n Okay.\n\n1:10:03.520 --> 1:10:04.480\n This is New Year's.\n\n1:10:05.840 --> 1:10:08.000\n This is now December 31st.\n\n1:10:08.000 --> 1:10:10.560\n I think that's how it works, but in 1973.\n\n1:10:10.560 --> 1:10:10.880\n Okay.\n\n1:10:11.520 --> 1:10:13.280\n We recorded this before you were born.\n\n1:10:14.480 --> 1:10:16.640\n Oh no, years after you were born.\n\n1:10:16.640 --> 1:10:22.000\n 60, you look great for 60s, early 60s or?\n\n1:10:22.000 --> 1:10:22.560\n Sure.\n\n1:10:22.560 --> 1:10:22.880\n Okay.\n\n1:10:24.160 --> 1:10:30.240\n What five things, let's say, or moments in 2021 are you grateful for?\n\n1:10:30.240 --> 1:10:40.880\n Or people, just, I don't know, things, moments, beautiful experiences, profound essences of the\n\n1:10:40.880 --> 1:10:41.440\n year.\n\n1:10:41.440 --> 1:10:43.680\n Like, looking back, what are the cool things that just?\n\n1:10:43.680 --> 1:10:44.880\n Personally or socially?\n\n1:10:46.720 --> 1:10:49.440\n Do you exist, like, in a platonic way socially?\n\n1:10:49.440 --> 1:10:51.760\n I mean, oh, in your personal life?\n\n1:10:51.760 --> 1:10:52.000\n Yeah.\n\n1:10:52.000 --> 1:10:52.720\n Anything.\n\n1:10:52.720 --> 1:10:56.560\n You're both, you're now Michael Malice.\n\n1:10:56.560 --> 1:11:02.080\n You exist as a social entity and a personal human being and all of it, the whole thing.\n\n1:11:02.080 --> 1:11:04.480\n Like, what stands out to you about 2021?\n\n1:11:05.120 --> 1:11:10.240\n The fact that for the first time in my life, other than college, I moved to a new city.\n\n1:11:10.240 --> 1:11:12.080\n That was a very big one.\n\n1:11:12.080 --> 1:11:14.800\n And there's no part of me that regrets it or misses New York.\n\n1:11:15.360 --> 1:11:17.840\n So that was a very big deal for me.\n\n1:11:17.840 --> 1:11:26.000\n What do you, about this move, about Austin itself, but maybe the move itself, maybe just\n\n1:11:26.000 --> 1:11:30.640\n the act of moving, what's great about it to you?\n\n1:11:31.200 --> 1:11:37.520\n The fact that I had forgotten what it's like to have a huge social network, which I had\n\n1:11:37.520 --> 1:11:42.080\n in New York before people started falling away and then it really escalated as a result\n\n1:11:42.080 --> 1:11:44.960\n of de Blasio and the COVID restrictions.\n\n1:11:44.960 --> 1:11:50.400\n So to have a big crew here is something that was very validating.\n\n1:11:50.400 --> 1:11:56.240\n The thing that's also exciting about Austin is that Austin is not a particularly big town.\n\n1:11:56.240 --> 1:11:57.280\n It's not a particularly great town.\n\n1:11:57.840 --> 1:12:02.720\n But everyone here, at least in the circles I travel in, is kind of a refugee from their\n\n1:12:02.720 --> 1:12:03.520\n towns.\n\n1:12:03.520 --> 1:12:05.360\n So there is this sense of camaraderie.\n\n1:12:05.360 --> 1:12:07.440\n There is the sense of we're building something together.\n\n1:12:08.080 --> 1:12:11.760\n Back in New York, when you meet someone, it would be like, who is this person?\n\n1:12:11.760 --> 1:12:13.200\n Why am I talking to them?\n\n1:12:13.200 --> 1:12:14.240\n Like, are they a normie?\n\n1:12:14.240 --> 1:12:15.680\n Are they going to be weird?\n\n1:12:15.680 --> 1:12:17.760\n And here there's very little of that.\n\n1:12:17.760 --> 1:12:21.280\n I think there's much more sense of trust with one another when you meet new people.\n\n1:12:21.280 --> 1:12:23.200\n So that's something that's really exciting about.\n\n1:12:24.160 --> 1:12:27.440\n I've been introducing all my friends to each other and everyone's been hitting it off like\n\n1:12:27.440 --> 1:12:28.160\n gangbusters.\n\n1:12:28.160 --> 1:12:29.200\n It's really great.\n\n1:12:29.200 --> 1:12:32.160\n So I really enjoy that about Austin.\n\n1:12:32.160 --> 1:12:34.640\n I'm enjoying the weather, the space.\n\n1:12:35.920 --> 1:12:38.080\n You read Kerouac and you know his stuff?\n\n1:12:38.080 --> 1:12:38.480\n I have.\n\n1:12:38.480 --> 1:12:39.200\n On the Road I read.\n\n1:12:39.200 --> 1:12:40.240\n I read a biography of him.\n\n1:12:41.280 --> 1:12:46.720\n I don't know if it was on, I think it was On the Road where he talked about that feeling\n\n1:12:46.720 --> 1:12:53.200\n when you go into some place, you're leaving a place and you go somewhere else and the\n\n1:12:53.200 --> 1:12:55.600\n place you're leaving disappears behind you.\n\n1:12:55.600 --> 1:12:56.080\n Yeah.\n\n1:12:56.080 --> 1:13:01.200\n And all the people and all, like you just think about that life and it's forever gone.\n\n1:13:01.200 --> 1:13:09.520\n And there's some inkling of that where you get to realize your almost mortality because,\n\n1:13:09.520 --> 1:13:12.480\n okay, that's a chapter and there's not many more.\n\n1:13:12.480 --> 1:13:16.240\n I know it's a beautiful chapter, but now on to the next chapter.\n\n1:13:16.240 --> 1:13:18.080\n Is there a melancholy feeling there?\n\n1:13:18.080 --> 1:13:18.960\n No, it's the opposite.\n\n1:13:18.960 --> 1:13:22.480\n I feel like I've been given a new lease on life because I didn't realize to what extent\n\n1:13:22.480 --> 1:13:27.520\n there was this subtext of hopelessness in New York and also people who in New York you\n\n1:13:27.520 --> 1:13:31.600\n don't appreciate or you appreciate it consciously, but you can't escape it emotionally how much\n\n1:13:31.600 --> 1:13:33.920\n the winters get to you psychologically.\n\n1:13:34.720 --> 1:13:35.600\n It's tough.\n\n1:13:35.600 --> 1:13:38.240\n It gets dark so early, it gets cold, you can't walk around.\n\n1:13:38.240 --> 1:13:41.440\n That's the thing that's fun about or what's fun about New York is that when the weather\n\n1:13:41.440 --> 1:13:45.120\n is warm, you can walk for an hour and just enjoy the sunshine and there's a lot to see\n\n1:13:45.120 --> 1:13:45.840\n and do.\n\n1:13:45.840 --> 1:13:47.520\n But in the winter, you don't have any of that.\n\n1:13:47.520 --> 1:13:48.480\n It's brutal.\n\n1:13:49.040 --> 1:13:51.440\n And here it's just, so that is something.\n\n1:13:51.440 --> 1:13:53.120\n There's no melancholy at all.\n\n1:13:53.840 --> 1:13:58.720\n Well, that's because there's, can we say something beautiful about New York?\n\n1:13:58.720 --> 1:14:00.560\n Not the way it is now, but the way it...\n\n1:14:01.120 --> 1:14:03.280\n I could go on for days about how great New York was.\n\n1:14:04.080 --> 1:14:09.280\n What did you learn about human civilization and just life that was beautiful from New York?\n\n1:14:09.280 --> 1:14:20.160\n I learned that there's a lot of really unique special people out there who are doing their\n\n1:14:20.160 --> 1:14:23.520\n little part to move the envelope and make the world a better place.\n\n1:14:24.080 --> 1:14:32.160\n And that when you have a city where they're all there together at the same time, then\n\n1:14:32.160 --> 1:14:33.360\n that really moves the world.\n\n1:14:33.360 --> 1:14:40.640\n And I'm thinking of Paris in the 20s and Harlem in the 20s and New York in the 70s and LA\n\n1:14:40.640 --> 1:14:43.920\n in the late 60s and San Francisco, especially in the late 60s, things like this.\n\n1:14:44.800 --> 1:14:47.520\n They really punch above Detroit, certainly at its heyday.\n\n1:14:47.520 --> 1:14:53.360\n They punch above their weight and just really kind of Philadelphia in 1700s.\n\n1:14:53.360 --> 1:14:56.480\n Things really start happening and that ripples throughout the world.\n\n1:14:57.040 --> 1:15:01.920\n You think Austin has a chance to be a Paris in some way?\n\n1:15:01.920 --> 1:15:04.800\n Yes, because again, it wasn't all of Paris.\n\n1:15:04.800 --> 1:15:08.880\n It was the left bank of Paris and Gertrude Stein and Hemingway and all them in a little\n\n1:15:08.880 --> 1:15:09.680\n area.\n\n1:15:09.680 --> 1:15:15.280\n So when you read these history books, these scenes, it's like 50 people in a ten block\n\n1:15:15.280 --> 1:15:15.680\n radius.\n\n1:15:15.680 --> 1:15:18.800\n These aren't these huge like Davos conventions.\n\n1:15:20.320 --> 1:15:22.400\n Okay, so the move, the big move.\n\n1:15:22.960 --> 1:15:23.600\n What else?\n\n1:15:23.600 --> 1:15:24.960\n What else stands out to you?\n\n1:15:24.960 --> 1:15:30.240\n Again, both personally and socially, like zooming in and zooming out.\n\n1:15:30.240 --> 1:15:35.760\n I did a book with a UFC fighter and I was making the point, he was a nine time world\n\n1:15:35.760 --> 1:15:39.920\n champion, that I would never be as good at my job as he was at his.\n\n1:15:40.720 --> 1:15:46.080\n And then when I dropped Anarchist Handbook in May and it was the top nonfiction book\n\n1:15:46.080 --> 1:15:50.720\n on Amazon for like most of the day, I was like, oh, I'm the top nonfiction writer in\n\n1:15:50.720 --> 1:15:52.400\n America just for today.\n\n1:15:52.400 --> 1:15:53.120\n I was like, oh, crap.\n\n1:15:53.120 --> 1:15:54.800\n Okay, so I guess I was wrong.\n\n1:15:54.800 --> 1:15:56.400\n That was a major deal.\n\n1:15:56.400 --> 1:15:58.640\n I was still shocked and delighted.\n\n1:15:58.640 --> 1:16:02.800\n By the way, congratulations and I'm truly happy for you, man.\n\n1:16:04.080 --> 1:16:04.720\n I'm so proud.\n\n1:16:05.280 --> 1:16:14.320\n But it's also, I'm proud because these are people who had points of view and they didn't\n\n1:16:14.320 --> 1:16:17.680\n have it easy and they fought for what they believed in.\n\n1:16:17.680 --> 1:16:24.080\n And insofar as I get to rescue them to some extent from the dustbin of history and say\n\n1:16:24.080 --> 1:16:26.800\n these people really mattered and they really are worth hearing.\n\n1:16:26.800 --> 1:16:27.600\n That I love.\n\n1:16:27.600 --> 1:16:28.720\n I love stuff like that.\n\n1:16:29.920 --> 1:16:35.840\n I was talking to a friend of mine, Topher, like a year ago, because we're in a weird\n\n1:16:35.840 --> 1:16:37.600\n position with what kind of jobs we have.\n\n1:16:38.080 --> 1:16:41.520\n So I'd be talking in my live streams about people like Candy Darling or Wallace Thurman\n\n1:16:42.240 --> 1:16:45.120\n and these are not household names at all.\n\n1:16:45.600 --> 1:16:50.400\n And then I'd be proud of myself that I'm the one who brings them to some sort of more\n\n1:16:50.400 --> 1:16:51.440\n prominence.\n\n1:16:51.440 --> 1:16:54.160\n And then you want to tell yourself, well, get over yourself who you think you are.\n\n1:16:54.160 --> 1:16:57.520\n But it's like, but no one else is talking about these people or very few.\n\n1:16:57.520 --> 1:17:03.120\n So to be able to kind of give them some kind of stature and platform that they deserve,\n\n1:17:03.120 --> 1:17:05.680\n I think is, I love being able to do that.\n\n1:17:05.680 --> 1:17:09.840\n So you have a strong voice yourself and to sort of join them in.\n\n1:17:09.840 --> 1:17:17.360\n It's like John Lennon joining in with the Beatles is like a chorus of very different\n\n1:17:17.360 --> 1:17:18.960\n views on anarchism.\n\n1:17:18.960 --> 1:17:28.320\n It's celebrating the individuals, it's celebrating the idea and you are, I think will be remembered\n\n1:17:28.320 --> 1:17:34.960\n as a powerful philosopher yourself, but like you're almost taking just the humility of\n\n1:17:34.960 --> 1:17:38.080\n being in a room with powerful minds together in one book.\n\n1:17:38.080 --> 1:17:38.800\n It's cool.\n\n1:17:38.800 --> 1:17:39.040\n Yeah.\n\n1:17:39.040 --> 1:17:43.040\n And that these people mattered and they had a unique perspective.\n\n1:17:43.040 --> 1:17:48.640\n And as I said in the introduction to the book, I remember I was in college and we were studying\n\n1:17:48.640 --> 1:17:54.720\n bioethics and there was like a graph in the book and one part says antinomianism, which\n\n1:17:54.720 --> 1:17:57.760\n was the view that, and one side said legalism, right?\n\n1:17:57.760 --> 1:17:58.960\n The two extremes.\n\n1:17:58.960 --> 1:18:03.440\n Legalism is what is legal is defined by the government or what is moral is defined by\n\n1:18:03.440 --> 1:18:04.000\n the government.\n\n1:18:04.000 --> 1:18:09.120\n And one said, antinomianism, which is nothing stands above moral law.\n\n1:18:09.120 --> 1:18:11.520\n And then there was like, well, since no one believes in this, the answer is something\n\n1:18:11.520 --> 1:18:12.160\n to the other side.\n\n1:18:12.160 --> 1:18:14.080\n It's like, well, why is it on the charge no one believes?\n\n1:18:14.080 --> 1:18:15.520\n If it has a name, someone believes in it.\n\n1:18:15.520 --> 1:18:21.920\n So anarchism is a word that's bandied about and in a dismissive way.\n\n1:18:21.920 --> 1:18:24.960\n And it's like, you don't have to like me or agree with what I'm saying, but you can't\n\n1:18:24.960 --> 1:18:26.960\n pretend that they weren't Tolstoy.\n\n1:18:26.960 --> 1:18:29.280\n You're going to tell me Tolstoy doesn't know what he's talking about completely.\n\n1:18:29.280 --> 1:18:30.160\n He's in there.\n\n1:18:30.160 --> 1:18:31.040\n He was an anarchist.\n\n1:18:31.040 --> 1:18:34.320\n So it was a big accomplishment.\n\n1:18:35.200 --> 1:18:38.400\n It was really cool to get a chance to do the audio book.\n\n1:18:39.520 --> 1:18:44.960\n You did an incredible thing, which has got a bunch of really cool people to read a lot\n\n1:18:44.960 --> 1:18:46.800\n of interesting, varied people.\n\n1:18:46.800 --> 1:18:51.920\n So what I did for the audio book, which I don't like the idea that hard work is inherently\n\n1:18:51.920 --> 1:18:55.280\n good because sometimes being lazy is actually the right choice.\n\n1:18:55.840 --> 1:18:56.720\n So I'm like, wait a minute.\n\n1:18:56.720 --> 1:19:00.320\n Why am I reading all 23 chapters when it's 23 different authors?\n\n1:19:00.320 --> 1:19:01.360\n Does it make sense?\n\n1:19:01.360 --> 1:19:06.240\n So I hit my Rolodex and I had different people read different chapters to make it sound\n\n1:19:06.240 --> 1:19:10.560\n literally like you have the different voices in the book.\n\n1:19:10.560 --> 1:19:11.440\n Thank you very much.\n\n1:19:11.440 --> 1:19:13.200\n You did my because I was going to read my chapter.\n\n1:19:13.200 --> 1:19:13.760\n Wait a minute.\n\n1:19:13.760 --> 1:19:15.440\n All the other authors are being read by somebody else.\n\n1:19:15.440 --> 1:19:16.480\n Let's have Lex read mine.\n\n1:19:17.040 --> 1:19:23.280\n The one chapter I am most moved by is Lauren Chen.\n\n1:19:23.280 --> 1:19:24.640\n She's a podcaster as well.\n\n1:19:24.640 --> 1:19:25.920\n She's expecting now.\n\n1:19:25.920 --> 1:19:29.040\n So we wish nothing but the best for Lauren and Liam and the Babby.\n\n1:19:29.840 --> 1:19:34.080\n There's a chapter there by this guy named Charles Robert Plunkett called Dynamite.\n\n1:19:34.640 --> 1:19:41.120\n And he's advocating for making bombs and killing people, killing the forces of capitalism.\n\n1:19:41.120 --> 1:19:46.640\n And Emma Goldman was publishing her essay while she was on lecture tour and she was just like,\n\n1:19:46.640 --> 1:19:47.600\n why is this in here?\n\n1:19:47.600 --> 1:19:51.200\n This is just really going to make us look bad, so on and so forth.\n\n1:19:51.840 --> 1:19:56.720\n And when you're dealing with any kind of, you know, HL Mencken has that quote about\n\n1:19:56.720 --> 1:20:02.640\n every rational man must at times be tempted to spit on his hands, hoist the black flag,\n\n1:20:02.640 --> 1:20:03.840\n and begin slitting throats.\n\n1:20:03.840 --> 1:20:10.480\n So I want it to sound like the seductive aspect of violence.\n\n1:20:10.480 --> 1:20:13.440\n Like that's the problem when you're dealing with terrorism, when you're dealing with\n\n1:20:13.440 --> 1:20:19.280\n political violence, to be able to understand how people can fall for this, how people can\n\n1:20:19.280 --> 1:20:24.480\n be persuaded to think this is a good idea that I'm going to make some dynamite and\n\n1:20:24.480 --> 1:20:29.920\n throw it into this crowd and kill police officers and innocent people possibly in service of\n\n1:20:29.920 --> 1:20:35.040\n by, you have to, it's easy to say, oh, they're all crazy, but they're not, you know, even\n\n1:20:35.840 --> 1:20:38.480\n not most people who are crazy don't do these things, you know?\n\n1:20:39.040 --> 1:20:44.720\n So to have a woman read that chapter and I told her kind of read it like a phone sex\n\n1:20:44.720 --> 1:20:50.800\n operator, because I wanted to have that siren song of like, so you can understand why this\n\n1:20:50.800 --> 1:20:54.720\n calls out to people who are in the rope, the people who are like marginalized.\n\n1:20:54.720 --> 1:20:57.280\n And she did such a superb job with that chapter.\n\n1:20:57.280 --> 1:20:58.960\n That's such a beautiful vision.\n\n1:20:58.960 --> 1:21:06.880\n Yeah, because violence, that's a violence part of human history to a degree that it\n\n1:21:06.880 --> 1:21:08.160\n must be seductive.\n\n1:21:08.160 --> 1:21:11.120\n It must be, there must be a strong pull.\n\n1:21:11.120 --> 1:21:12.720\n Like it's not insane people.\n\n1:21:14.400 --> 1:21:18.960\n There's something probably deep within our nature that craves violence.\n\n1:21:18.960 --> 1:21:25.120\n And then when there is charismatic leaders that inspire that and revolution, you know,\n\n1:21:25.120 --> 1:21:33.360\n and revolution plus violence, I could see that being extremely seductive to us.\n\n1:21:33.360 --> 1:21:37.360\n Like when you're truly suffering in your current situation, whatever it is, you're\n\n1:21:37.360 --> 1:21:42.080\n being oppressed by governments or being oppressed by the powerful, violent revolution is\n\n1:21:44.720 --> 1:21:47.440\n probably there's something deep within us that longs for that.\n\n1:21:47.440 --> 1:21:50.560\n And also this kind of the Jelaine Maxwell to Jeffrey Epstein, right?\n\n1:21:50.560 --> 1:21:54.160\n You need that woman to be like, no, no, this is okay, honey.\n\n1:21:54.160 --> 1:21:54.640\n Yeah.\n\n1:21:54.640 --> 1:21:55.440\n Come along.\n\n1:21:55.440 --> 1:21:56.640\n It's not a big deal.\n\n1:21:56.640 --> 1:21:58.240\n Don't listen to what your parents told you.\n\n1:21:58.240 --> 1:21:59.520\n They're just prudes.\n\n1:21:59.520 --> 1:22:00.560\n It's a siren song.\n\n1:22:02.080 --> 1:22:05.920\n What do you think about Jelaine Maxwell and the trial and so on?\n\n1:22:07.040 --> 1:22:13.680\n Again, maybe the interesting story there is about the coverage of the trial.\n\n1:22:13.680 --> 1:22:18.960\n So like the story is more complex and interesting than the actual horrific acts themselves.\n\n1:22:18.960 --> 1:22:25.760\n So to me, I don't, maybe I'm not knowledgeable enough, but to me, she's also truly evil.\n\n1:22:26.640 --> 1:22:32.000\n I don't know where to, maybe you can help me to figure out who is more evil.\n\n1:22:32.880 --> 1:22:39.200\n The, just like you said now, the person that says it's okay, it's okay, that helps\n\n1:22:39.840 --> 1:22:42.800\n the evildoer or is it the evildoer themselves?\n\n1:22:42.800 --> 1:22:47.200\n I don't know, but I think she's a, she scares me more than Jeffrey Epstein somehow.\n\n1:22:47.200 --> 1:22:48.880\n There's people like that in the world.\n\n1:22:48.880 --> 1:22:50.240\n I had a, like a Twitter poll.\n\n1:22:50.240 --> 1:22:54.320\n Do you think it's more evil or less evil to kill someone because you've been paid to do it?\n\n1:22:55.680 --> 1:23:04.160\n And people, the winning answer was more evil and I said it was less because I think in that case,\n\n1:23:04.160 --> 1:23:08.080\n you can kind of check out, you could be like, this isn't my, I'm just doing a job.\n\n1:23:08.080 --> 1:23:14.240\n I don't, you know, you kind of can, I think in a sense, if you have a certain mindset,\n\n1:23:14.240 --> 1:23:18.160\n if you have a certain mindset, like intellect to remove yourself from the situation,\n\n1:23:18.160 --> 1:23:19.040\n I'm just the conduit.\n\n1:23:20.080 --> 1:23:23.840\n When you were talking, I haven't been following her case that that much.\n\n1:23:24.560 --> 1:23:27.440\n It's because you mostly watch CNN and CNN's not covering it.\n\n1:23:27.440 --> 1:23:36.160\n Well, I think my broader point would be people who are untouchable and who know they're untouchable\n\n1:23:36.960 --> 1:23:43.360\n do much worse things than those of us who aren't that way can appreciate.\n\n1:23:43.360 --> 1:23:48.160\n Like I was just talking about on Twitter about Rosemary Kennedy.\n\n1:23:48.880 --> 1:23:50.880\n She was one of JFK's sisters.\n\n1:23:51.520 --> 1:23:58.240\n It's not clear whether she was developmentally disabled or had like depressive mental illness.\n\n1:23:58.240 --> 1:24:01.120\n There was something clearly off with her to some capacity.\n\n1:24:01.920 --> 1:24:06.080\n And at age 23, they gave her a lobotomy.\n\n1:24:06.720 --> 1:24:09.200\n And the thing with the lobotomy is you have to be conscious.\n\n1:24:09.200 --> 1:24:10.720\n They don't put you under.\n\n1:24:10.720 --> 1:24:14.720\n So you have to be counting backwards while their scalp was in your brain and they stopped.\n\n1:24:14.720 --> 1:24:16.160\n But they stopped.\n\n1:24:17.040 --> 1:24:18.000\n They did too far.\n\n1:24:18.000 --> 1:24:22.240\n She became mentally like a two year old, never had bladder control for the rest of her life,\n\n1:24:22.240 --> 1:24:24.000\n couldn't really talk or walk.\n\n1:24:24.720 --> 1:24:30.720\n And when that happened, they just put her away to some home and they never mentioned her again.\n\n1:24:30.720 --> 1:24:33.200\n They didn't tell the brothers or sisters where she went.\n\n1:24:33.200 --> 1:24:35.680\n The lobotomy was only revealed in 1987.\n\n1:24:35.680 --> 1:24:40.800\n And they pretended, oh, she's in this home for kids with special needs.\n\n1:24:40.800 --> 1:24:48.960\n And it's just like that to me is very, very scary that someone could do this to their...\n\n1:24:48.960 --> 1:24:54.240\n I saw people respond like, oh, that was cutting edge technology at the time, ha ha.\n\n1:24:54.240 --> 1:25:01.040\n But I'm like, I don't think that that was really done that frequently or be hearing more about it,\n\n1:25:01.040 --> 1:25:02.480\n all these botched lobotomies.\n\n1:25:02.480 --> 1:25:06.720\n And my understanding is lobotomies are very hard to...\n\n1:25:09.040 --> 1:25:12.400\n They would want to do it if someone's a mass murderer or if someone's really bad,\n\n1:25:12.400 --> 1:25:16.000\n if the person's left an invalid, who cares kind of situation.\n\n1:25:16.000 --> 1:25:19.840\n But when you're dealing with something like this, she's not killing people.\n\n1:25:19.840 --> 1:25:20.960\n She's not assaulting people.\n\n1:25:21.680 --> 1:25:25.280\n She's just difficult because she's making your vaunted family look bad.\n\n1:25:25.920 --> 1:25:30.800\n So that's, to you, that's, what is it, psychopathy or something like that?\n\n1:25:30.800 --> 1:25:34.880\n You don't care about, you do horrific things and you don't really care.\n\n1:25:34.880 --> 1:25:36.720\n I can't diagnose Joe Kennedy.\n\n1:25:37.280 --> 1:25:43.600\n But what I would say, like with Jelayne Maxwell, I can't empathize because I don't understand...\n\n1:25:43.600 --> 1:25:48.720\n First of all, even in a positive sense, I don't know what it's like to be grooming my son to be\n\n1:25:48.720 --> 1:25:51.760\n the president and lost the other son in war.\n\n1:25:51.760 --> 1:25:52.640\n I don't know what that's like.\n\n1:25:53.280 --> 1:25:55.280\n I don't know what it's like to be so wealthy.\n\n1:25:55.280 --> 1:25:59.120\n Like you have to give Joe Kennedy credit because a lot of what he was fighting for\n\n1:25:59.120 --> 1:26:04.800\n was to allow Irish people and Catholic people acceptance into like high society.\n\n1:26:04.800 --> 1:26:07.040\n And he was up against a lot of pressure with that.\n\n1:26:07.040 --> 1:26:09.280\n And he's like, I'm going to screw these people.\n\n1:26:09.280 --> 1:26:11.920\n I'm going to be recognized and we're going to make people recognized.\n\n1:26:11.920 --> 1:26:13.040\n So there's something to be said for that.\n\n1:26:13.040 --> 1:26:16.960\n But I mean, I can't relate to people like him.\n\n1:26:18.560 --> 1:26:19.060\n Yeah.\n\n1:26:20.080 --> 1:26:23.280\n But I mean, that like is just terrifying.\n\n1:26:23.280 --> 1:26:28.080\n Like, I mean, one of the big reasons I'm an anarchist is like when you have someone who\n\n1:26:28.080 --> 1:26:33.040\n has that sense of amount of power over somebody else, a lot of times they're going to do bad\n\n1:26:33.040 --> 1:26:35.360\n things and have no consequences.\n\n1:26:36.240 --> 1:26:41.520\n Do you think in a, just like Maxwell case and Epstein case, do you think they were\n\n1:26:43.440 --> 1:26:45.040\n trying to blackmail people?\n\n1:26:45.040 --> 1:26:48.080\n Like trying the, what the conspiracy theory is kind of described\n\n1:26:49.360 --> 1:26:51.760\n that's probably not too far away from reality.\n\n1:26:51.760 --> 1:26:57.840\n That they intentionally tried to put powerful people in compromising situations so that\n\n1:26:57.840 --> 1:27:01.360\n they can basically get more and more power.\n\n1:27:01.360 --> 1:27:01.860\n Yeah.\n\n1:27:01.860 --> 1:27:05.520\n I think that was a Vanity Fair piece that you're referring to or Fortune.\n\n1:27:05.520 --> 1:27:06.020\n Oh, sorry.\n\n1:27:06.020 --> 1:27:07.680\n I'm just referring to a general concept.\n\n1:27:07.680 --> 1:27:11.280\n Oh, there was, so there was an article that broke this down because this article is either\n\n1:27:11.280 --> 1:27:15.200\n Fortune, Businessweek, Vanity Fair, I don't remember a major, major reputable outlet.\n\n1:27:15.200 --> 1:27:19.600\n And they were, they made the, the reporter made the point, they asked around and they\n\n1:27:19.600 --> 1:27:22.880\n go, this guy's a billionaire or extremely wealthy at least.\n\n1:27:22.880 --> 1:27:25.120\n No one I know ever traded with him.\n\n1:27:25.120 --> 1:27:26.240\n Like, where's his money coming from?\n\n1:27:26.240 --> 1:27:27.680\n There's no, there's no paper trail.\n\n1:27:27.680 --> 1:27:33.360\n So they're like, okay, if it's not trading and trades are public often, you know, where's\n\n1:27:33.360 --> 1:27:34.320\n this money coming from?\n\n1:27:34.320 --> 1:27:39.760\n And it's also like, why are all these people allowing Epstein to be their business manager\n\n1:27:39.760 --> 1:27:42.080\n when he has no kind of track record to show for it?\n\n1:27:42.080 --> 1:27:47.760\n So the hypothesis was he would get people into uncompromising situations with underage\n\n1:27:47.760 --> 1:27:52.960\n girls, secretly film it, and then he would, you know, blackmail them accordingly.\n\n1:27:52.960 --> 1:27:54.000\n Well, I guess that's the question.\n\n1:27:54.000 --> 1:27:54.960\n That would make sense.\n\n1:27:54.960 --> 1:27:59.600\n I know it makes sense, but I also see a lot of evidence that he's just very charismatic\n\n1:27:59.600 --> 1:28:00.400\n in a room.\n\n1:28:00.400 --> 1:28:07.120\n So, so, and I've also seen, you know, that's how human connections get made, like business\n\n1:28:07.120 --> 1:28:07.840\n deals get made.\n\n1:28:07.840 --> 1:28:10.080\n Yeah, but how, how, where's his money coming from?\n\n1:28:10.800 --> 1:28:14.720\n Oh, like they are rich people without blackmailing.\n\n1:28:14.720 --> 1:28:19.920\n Just like him close, like him as a friend.\n\n1:28:19.920 --> 1:28:20.640\n I'm not arguing that.\n\n1:28:20.640 --> 1:28:24.000\n Like, okay, I like Jeff Epstein, make sure you pull that quote.\n\n1:28:24.000 --> 1:28:24.480\n Yes.\n\n1:28:24.480 --> 1:28:25.120\n I'm a business person.\n\n1:28:25.120 --> 1:28:25.920\n I like Jeff Epstein.\n\n1:28:25.920 --> 1:28:26.400\n Michael Malice.\n\n1:28:26.400 --> 1:28:27.120\n I love Jeff.\n\n1:28:27.120 --> 1:28:27.920\n Like or love?\n\n1:28:27.920 --> 1:28:28.320\n Love.\n\n1:28:28.320 --> 1:28:31.600\n I'm in love with this escalated quickly.\n\n1:28:31.600 --> 1:28:36.960\n I'm going to hand over him to be my money manager to have 20% of my estate fine.\n\n1:28:36.960 --> 1:28:37.440\n Yeah.\n\n1:28:38.240 --> 1:28:40.800\n Where is he making the money for that 20%?\n\n1:28:41.520 --> 1:28:43.040\n That's the thing that there's no paper trail.\n\n1:28:43.040 --> 1:28:45.920\n That's the thing that there's no paper trail, have him trading or anything.\n\n1:28:45.920 --> 1:28:46.720\n So I can understand.\n\n1:28:46.720 --> 1:28:47.680\n Oh, I see, see.\n\n1:28:47.680 --> 1:28:48.180\n Yeah.\n\n1:28:48.800 --> 1:28:49.520\n Interesting.\n\n1:28:49.520 --> 1:28:52.960\n What were your 2020 favorite moments?\n\n1:28:52.960 --> 1:28:54.400\n You mean 2021?\n\n1:28:54.400 --> 1:28:54.720\n Yeah, 2021.\n\n1:28:54.720 --> 1:28:55.600\n Time flies when you have it.\n\n1:28:55.600 --> 1:28:56.100\n Yeah, yeah.\n\n1:28:57.840 --> 1:29:00.240\n Clearly it's the Ghislaine Maxwell trial.\n\n1:29:00.240 --> 1:29:01.600\n It just really stands out to me.\n\n1:29:01.600 --> 1:29:02.720\n It's very moving.\n\n1:29:02.720 --> 1:29:03.840\n Which is why I bring it up.\n\n1:29:04.560 --> 1:29:05.060\n No.\n\n1:29:05.920 --> 1:29:06.880\n Moving here.\n\n1:29:06.880 --> 1:29:08.080\n So moving here.\n\n1:29:08.080 --> 1:29:12.400\n But for me, I think we actually didn't cover that with you.\n\n1:29:12.400 --> 1:29:13.680\n And I'd love to get your comment.\n\n1:29:15.280 --> 1:29:17.680\n Because you said it's for the first time in your life you moved.\n\n1:29:17.680 --> 1:29:20.960\n So it's not just about the place you go to.\n\n1:29:20.960 --> 1:29:24.400\n It's the actual act of moving is also a leap.\n\n1:29:24.400 --> 1:29:25.280\n Oh, yeah.\n\n1:29:25.280 --> 1:29:31.360\n The decision was that I'm going to give away my salary at MIT.\n\n1:29:31.360 --> 1:29:32.720\n So stop taking salary.\n\n1:29:33.520 --> 1:29:35.040\n Give away the group.\n\n1:29:35.040 --> 1:29:38.800\n So students, no more research, the grant funding.\n\n1:29:38.800 --> 1:29:41.920\n I still keep an MIT affiliation just because I have friends and colleagues\n\n1:29:41.920 --> 1:29:42.960\n there still doing research.\n\n1:29:42.960 --> 1:29:46.720\n But giving away really primarily is the source of money.\n\n1:29:46.720 --> 1:29:47.920\n So no salary.\n\n1:29:47.920 --> 1:29:49.520\n And let it go to zero.\n\n1:29:49.520 --> 1:29:51.120\n Let my bank account go to zero.\n\n1:29:52.000 --> 1:29:58.080\n And take a leap in San Francisco or elsewhere.\n\n1:29:58.880 --> 1:30:04.000\n And as COVID broke out, and a lot of people started talking to me about San Francisco,\n\n1:30:04.000 --> 1:30:05.440\n about the cynicism there.\n\n1:30:05.440 --> 1:30:06.720\n And I would go there.\n\n1:30:06.720 --> 1:30:11.760\n And there was a kind of, so it's not all the woke stuff and all that kind of things.\n\n1:30:11.760 --> 1:30:13.520\n Which is also a problem.\n\n1:30:13.520 --> 1:30:19.920\n It's less about dreaming about a big future, about building a big future, and more about\n\n1:30:19.920 --> 1:30:25.680\n some kind of identity politic battles that they're just, you could say some aspect in\n\n1:30:25.680 --> 1:30:27.680\n the positive light is important.\n\n1:30:27.680 --> 1:30:33.120\n But in a place like Silicon Valley, to me, the most important thing is to do big things.\n\n1:30:34.160 --> 1:30:37.840\n And for that to be most of the conversation.\n\n1:30:39.040 --> 1:30:40.640\n And so that cynicism was there.\n\n1:30:40.640 --> 1:30:44.240\n And then I went to look at Austin, and Austin was the opposite.\n\n1:30:44.240 --> 1:30:45.840\n It was the optimism.\n\n1:30:45.840 --> 1:30:53.040\n And you have people like, I talked to Elon, was the optimistic about making this the capital\n\n1:30:53.040 --> 1:30:55.600\n of artificial intelligence and technology and so on.\n\n1:30:55.600 --> 1:31:03.360\n And Mr. Joe Rogan, now just the optimism about making this the cultural capital of the world.\n\n1:31:04.320 --> 1:31:07.920\n I mean, specifically comedy, but it just radiates from them.\n\n1:31:07.920 --> 1:31:08.960\n Just the excitement.\n\n1:31:08.960 --> 1:31:12.480\n And I've seen not many people of that nature in my life.\n\n1:31:12.480 --> 1:31:17.440\n And when I see that in their eyes, that engine, that fire of wanting to create something special\n\n1:31:17.440 --> 1:31:18.000\n about the place.\n\n1:31:18.640 --> 1:31:20.960\n First of all, those people rarely fail.\n\n1:31:20.960 --> 1:31:21.680\n That's first of all.\n\n1:31:21.680 --> 1:31:23.040\n And second of all, that's contagious.\n\n1:31:23.040 --> 1:31:23.840\n It's contagious.\n\n1:31:23.840 --> 1:31:25.200\n Very contagious.\n\n1:31:25.200 --> 1:31:32.960\n And so all that combined, for me, 2021 was the actual leap of taking the leap, saying,\n\n1:31:32.960 --> 1:31:39.360\n all right, well, I'm actually going to do this, so not just giving away the salary,\n\n1:31:39.360 --> 1:31:41.760\n not giving away all of that, but the whole thing.\n\n1:31:42.400 --> 1:31:43.200\n That's it.\n\n1:31:43.200 --> 1:31:44.720\n You just move to a place.\n\n1:31:44.720 --> 1:31:49.680\n There's an empty building, and you're moving into it.\n\n1:31:51.760 --> 1:31:53.360\n And this is a new life.\n\n1:31:53.360 --> 1:31:54.720\n And that leap, I don't know.\n\n1:31:54.720 --> 1:31:59.520\n It's a scary leap to take, because I've taken that leap many times in my life.\n\n1:31:59.520 --> 1:32:03.840\n And this is where parents and all those kinds of cynicism is really destructive.\n\n1:32:03.840 --> 1:32:09.520\n Because from a cynical perspective, I worked at Google.\n\n1:32:09.520 --> 1:32:10.800\n So why leave Google?\n\n1:32:10.800 --> 1:32:14.320\n It's a very high paying salary that you can have at Google.\n\n1:32:14.880 --> 1:32:16.080\n Then MIT.\n\n1:32:16.080 --> 1:32:17.120\n Why leave MIT?\n\n1:32:18.400 --> 1:32:19.520\n It's MIT.\n\n1:32:19.520 --> 1:32:21.760\n This is you've always dreamed about.\n\n1:32:21.760 --> 1:32:22.720\n Why do you get a PhD?\n\n1:32:23.280 --> 1:32:24.640\n You've loved MIT all your life.\n\n1:32:24.640 --> 1:32:25.680\n Why leave MIT?\n\n1:32:25.680 --> 1:32:29.040\n I mean, this is the same process I've gone through with a lot of things in life.\n\n1:32:29.040 --> 1:32:31.600\n Like you've been saying every single stage.\n\n1:32:31.600 --> 1:32:35.920\n And you need that, you need friends, you need support groups and all those kinds\n\n1:32:35.920 --> 1:32:37.600\n of things that are extremely important.\n\n1:32:37.600 --> 1:32:39.440\n But in the end, it's about taking the leap.\n\n1:32:40.000 --> 1:32:42.480\n And for me, 2021 was this leap.\n\n1:32:42.480 --> 1:32:48.480\n And to me, one of the most beautiful things you can do in life is to take those leaps.\n\n1:32:48.480 --> 1:32:51.360\n And that's something that I think is no longer a thing in New York.\n\n1:32:51.360 --> 1:32:52.960\n There's no sense of hope.\n\n1:32:52.960 --> 1:32:56.080\n You don't go to New York now.\n\n1:32:56.080 --> 1:33:01.360\n There's been such an assault and intentionally or otherwise, maybe it's inevitable,\n\n1:33:01.360 --> 1:33:02.480\n they didn't have a choice.\n\n1:33:02.480 --> 1:33:05.680\n But there's been such an assault on creativity and small business in New York\n\n1:33:06.400 --> 1:33:11.680\n that very few people who are in New York right now think things are going to get great soon.\n\n1:33:11.680 --> 1:33:16.320\n Whereas here, I feel every day is just something exciting is going to happen.\n\n1:33:17.200 --> 1:33:20.000\n And that's part of the culture and how the conversation goes.\n\n1:33:20.000 --> 1:33:24.640\n It's just in vogue to be cynical in New York and San Francisco.\n\n1:33:24.640 --> 1:33:29.600\n I hope it changes because what I love about New York and what I love about Austin also\n\n1:33:30.240 --> 1:33:38.640\n is the weirdos, the characters, just the variety of personalities that if you just walk around,\n\n1:33:38.640 --> 1:33:39.440\n you get to meet them.\n\n1:33:39.440 --> 1:33:43.120\n And I think New York still has that, but it has the extra cynicism on top of it.\n\n1:33:44.240 --> 1:33:45.440\n That's a negative.\n\n1:33:45.440 --> 1:33:50.320\n I mean, just becoming friends with Joe, he inspired me to be nicer to people,\n\n1:33:50.320 --> 1:33:58.240\n to not take myself seriously, to be humble, to celebrate friends, not to be competitive.\n\n1:33:59.440 --> 1:34:04.240\n Like all those things, since I started listening to his podcast from the very beginning,\n\n1:34:04.240 --> 1:34:06.000\n it just radiated from the guy.\n\n1:34:06.720 --> 1:34:12.880\n The thing that people don't appreciate is Joe Rogan likes it when you bust his chops.\n\n1:34:12.880 --> 1:34:14.240\n Yeah.\n\n1:34:14.240 --> 1:34:17.120\n I mean, a lot of people at that level, like if it's,\n\n1:34:17.120 --> 1:34:20.000\n oh, Mr. Rogan, you're laughing at everything they say, they don't want that.\n\n1:34:20.000 --> 1:34:24.800\n It's very phony and they feel uncomfortable because they know everything they say is hilarious.\n\n1:34:24.800 --> 1:34:26.480\n I remember I went with him.\n\n1:34:26.480 --> 1:34:32.080\n He was doing a performance here and I was, yeah, you were there.\n\n1:34:32.080 --> 1:34:33.280\n And he was doing his set.\n\n1:34:34.080 --> 1:34:37.360\n And I'd reached the point now where I don't think of him as Joe Rogan.\n\n1:34:37.360 --> 1:34:39.360\n You know, it's just like my buddy's doing stand up.\n\n1:34:39.360 --> 1:34:39.840\n You forget.\n\n1:34:39.840 --> 1:34:42.400\n And then I looked at the audience and I remember I'm like,\n\n1:34:42.400 --> 1:34:44.960\n oh, this is like a religious experience for these people.\n\n1:34:44.960 --> 1:34:49.360\n But you forget who he is because he doesn't carry himself like a big shot.\n\n1:34:49.360 --> 1:34:50.160\n Yeah.\n\n1:34:50.160 --> 1:34:52.320\n And still, I mean, he gets competitive as fuck.\n\n1:34:52.320 --> 1:34:53.840\n Like I argue with him a lot.\n\n1:34:53.840 --> 1:34:57.920\n I mean, when I talked to Francis Collins and Pfizer CEO,\n\n1:34:57.920 --> 1:34:59.440\n you better believe I heard from Joe.\n\n1:35:00.960 --> 1:35:04.000\n And then we would just get super drunk and argue about it.\n\n1:35:04.000 --> 1:35:05.920\n So it's, I mean, it's beautiful.\n\n1:35:05.920 --> 1:35:08.160\n And he gets really passionate.\n\n1:35:08.160 --> 1:35:11.440\n So it's not like, it's not like easy to argue with him,\n\n1:35:11.440 --> 1:35:15.120\n but that's great when you don't take it personally.\n\n1:35:16.000 --> 1:35:16.640\n It's fun.\n\n1:35:16.640 --> 1:35:20.160\n As you and I discussed, and I'm sure he wouldn't mind us saying this,\n\n1:35:20.160 --> 1:35:24.560\n but like that moment when you first get a text from Joe Rogan\n\n1:35:24.560 --> 1:35:26.080\n and it's some boomer meme,\n\n1:35:26.080 --> 1:35:29.280\n like I finally felt like I've arrived as a person.\n\n1:35:29.280 --> 1:35:30.000\n A boomer meme?\n\n1:35:30.560 --> 1:35:32.000\n What kind of boomer meme are we talking about?\n\n1:35:32.000 --> 1:35:33.840\n Like some silly meme, but it's just like,\n\n1:35:33.840 --> 1:35:36.480\n this is the kind of thing you can imagine someone's uncle posting on Facebook.\n\n1:35:36.480 --> 1:35:36.960\n Yeah.\n\n1:35:36.960 --> 1:35:38.240\n It's Joe Rogan texting it to you.\n\n1:35:39.120 --> 1:35:39.600\n Yeah.\n\n1:35:39.600 --> 1:35:42.240\n I mean, for me also with Elon, obviously,\n\n1:35:42.240 --> 1:35:44.640\n there's a few people, I'm just saying folks that people know,\n\n1:35:45.680 --> 1:35:48.720\n also Jim Keller, who's worked with Elon.\n\n1:35:48.720 --> 1:35:50.480\n So I've had conversations with them,\n\n1:35:50.480 --> 1:35:52.320\n because it's just my line of work.\n\n1:35:52.320 --> 1:35:56.080\n They're realizing that everything is possible in this world.\n\n1:35:56.080 --> 1:35:56.640\n Yeah, yeah.\n\n1:35:57.280 --> 1:35:59.280\n Which is not the Russian mindset.\n\n1:35:59.280 --> 1:35:59.680\n Yeah.\n\n1:35:59.680 --> 1:36:00.160\n Well, okay.\n\n1:36:00.160 --> 1:36:00.560\n All right.\n\n1:36:00.560 --> 1:36:02.480\n That's, let's, uh.\n\n1:36:02.480 --> 1:36:05.120\n It's dialed down a notch.\n\n1:36:05.120 --> 1:36:06.320\n It's dialed down a notch.\n\n1:36:06.320 --> 1:36:09.440\n Yeah, it's what Elon calls first principles thinking,\n\n1:36:09.440 --> 1:36:14.080\n but really it's just not being limited by the constraints of the past.\n\n1:36:14.080 --> 1:36:14.640\n Yes.\n\n1:36:14.640 --> 1:36:17.680\n And so saying like, okay, this is how things have been done,\n\n1:36:17.680 --> 1:36:19.360\n but can be done much, much better.\n\n1:36:19.920 --> 1:36:22.240\n And that has to do with manufacture.\n\n1:36:22.240 --> 1:36:26.320\n Like, how do we do this 10 times cheaper?\n\n1:36:27.520 --> 1:36:30.000\n Like everyone says it's super expensive,\n\n1:36:30.000 --> 1:36:31.840\n but does it really need to be?\n\n1:36:31.840 --> 1:36:33.520\n This is more of a question about manufacture,\n\n1:36:33.520 --> 1:36:36.080\n about how to build a product, how to build a product.\n\n1:36:36.080 --> 1:36:39.360\n How to actually have a product that scale that has an impact.\n\n1:36:39.360 --> 1:36:41.600\n And just having a very serious engineering,\n\n1:36:42.240 --> 1:36:43.840\n like to the level of physics,\n\n1:36:45.200 --> 1:36:49.280\n discussion about building a thing and fucking doing it.\n\n1:36:49.280 --> 1:36:52.240\n And just being around people that did it and,\n\n1:36:54.080 --> 1:36:58.400\n you know, basically literally or figuratively said,\n\n1:36:58.400 --> 1:37:00.960\n fuck you to everybody in the room that said they can't do it.\n\n1:37:01.760 --> 1:37:03.120\n And that, that energy.\n\n1:37:03.120 --> 1:37:06.160\n So that I've gotten to know Elon a lot better in 2021.\n\n1:37:06.160 --> 1:37:09.200\n That to me, it's like everything, the whole thing,\n\n1:37:09.200 --> 1:37:13.520\n that moving here and being surrounded by the optimistic energy\n\n1:37:13.520 --> 1:37:15.840\n and then the individual interactions with people\n\n1:37:16.400 --> 1:37:20.400\n that refuse to be like brought down by the,\n\n1:37:21.200 --> 1:37:22.240\n yeah, the cynicism.\n\n1:37:22.240 --> 1:37:23.120\n The naysayers, yeah.\n\n1:37:23.120 --> 1:37:23.920\n The naysayers.\n\n1:37:25.760 --> 1:37:27.840\n That to me is what I'm going to remember this year for.\n\n1:37:27.840 --> 1:37:33.840\n And I hope it like materializes into something concrete\n\n1:37:33.840 --> 1:37:34.560\n here in Austin.\n\n1:37:34.560 --> 1:37:36.160\n And I feel it's doing that.\n\n1:37:36.160 --> 1:37:39.520\n I really am curious to be a fly on the wall.\n\n1:37:39.520 --> 1:37:40.880\n I'm sure it'll happen at some point,\n\n1:37:40.880 --> 1:37:42.480\n watching you and Elon talk to each other.\n\n1:37:43.040 --> 1:37:44.720\n I guess he's even more of a robot than you.\n\n1:37:45.280 --> 1:37:47.840\n He was on the Babylon Bee podcast\n\n1:37:47.840 --> 1:37:49.680\n and I was honored to be able to be in the room\n\n1:37:49.680 --> 1:37:50.640\n while this was happening.\n\n1:37:51.360 --> 1:37:53.440\n And with the guys at the BeeDoo,\n\n1:37:53.440 --> 1:37:57.680\n at the end of every podcast, they have like 10 questions.\n\n1:37:57.680 --> 1:37:59.200\n I don't think this is one of those.\n\n1:37:59.200 --> 1:37:59.840\n No, no.\n\n1:37:59.840 --> 1:38:04.960\n And they go to Elon, would you rather be Batman or Iron Man?\n\n1:38:04.960 --> 1:38:07.280\n Because they're both like multimillion industrialists.\n\n1:38:07.840 --> 1:38:11.680\n And Elon being Elon is like, well, let's think this through.\n\n1:38:11.680 --> 1:38:12.800\n There's different kinds of bats.\n\n1:38:12.800 --> 1:38:15.520\n You've got fruit bats and you've got insect bats.\n\n1:38:15.520 --> 1:38:16.400\n Why is it called Batman?\n\n1:38:16.400 --> 1:38:17.680\n Batman can actually fly, right?\n\n1:38:17.680 --> 1:38:18.320\n Bats can fly.\n\n1:38:19.680 --> 1:38:20.800\n And I'm just sitting there like, holy dude,\n\n1:38:20.800 --> 1:38:21.600\n just answer the question.\n\n1:38:21.600 --> 1:38:23.120\n I was like, what?\n\n1:38:23.120 --> 1:38:24.720\n It was so literal.\n\n1:38:24.720 --> 1:38:25.760\n I was like, damn.\n\n1:38:26.560 --> 1:38:30.160\n I guess by this point, the release of the podcast with him,\n\n1:38:30.160 --> 1:38:34.800\n that's several hours and it's exactly as you would imagine.\n\n1:38:34.800 --> 1:38:36.880\n It's exactly as you would imagine.\n\n1:38:36.880 --> 1:38:39.280\n There was this, did you watch the movie Her?\n\n1:38:39.840 --> 1:38:40.480\n Yes, of course.\n\n1:38:40.480 --> 1:38:42.240\n So there's that one scene, it's when,\n\n1:38:43.120 --> 1:38:43.840\n is it Joaquin Phoenix?\n\n1:38:43.840 --> 1:38:45.200\n Who's the lead character?\n\n1:38:45.200 --> 1:38:46.400\n Joaquin Phoenix.\n\n1:38:46.400 --> 1:38:48.960\n Yeah, so he's the lead and he falls in love with Siri basically,\n\n1:38:48.960 --> 1:38:50.320\n who's played by Scarlett Johansson.\n\n1:38:50.320 --> 1:38:53.840\n And there's another artificial AI that she's talking to\n\n1:38:54.400 --> 1:38:57.920\n and she's like, oh, can I permission to go into nonverbal\n\n1:38:57.920 --> 1:39:01.920\n communication with this professor and the guy's like, sure.\n\n1:39:01.920 --> 1:39:04.080\n And they just started talking to each other in their robot.\n\n1:39:04.080 --> 1:39:06.640\n And I'm just imagining the two of you having this mind meld.\n\n1:39:07.200 --> 1:39:10.000\n Well, so there's both the humor of that,\n\n1:39:10.560 --> 1:39:14.240\n but also the practical nature of the kind of conversations\n\n1:39:14.240 --> 1:39:19.120\n to have, it's so great because it's problem solving mode.\n\n1:39:19.120 --> 1:39:20.800\n Okay, yeah, yeah, okay.\n\n1:39:20.800 --> 1:39:21.200\n It's so cool.\n\n1:39:21.200 --> 1:39:21.680\n That is fun.\n\n1:39:21.680 --> 1:39:22.560\n That is exciting.\n\n1:39:22.560 --> 1:39:25.520\n Because you stop completing sentences.\n\n1:39:25.520 --> 1:39:28.320\n I actually feel at home because you don't need to say\n\n1:39:28.320 --> 1:39:30.000\n the full sentences anymore.\n\n1:39:30.000 --> 1:39:34.080\n You could just say random words and you start to understand\n\n1:39:34.080 --> 1:39:36.880\n what you're talking about and then you can have multiple\n\n1:39:36.880 --> 1:39:39.440\n conversations at the same time and go on these tangents.\n\n1:39:40.320 --> 1:39:43.440\n One of the biggest problems I have with podcasting for me\n\n1:39:43.440 --> 1:39:45.680\n talking, I have to finish my sentences.\n\n1:39:45.680 --> 1:39:47.760\n I have to actually finish making a point,\n\n1:39:47.760 --> 1:39:50.880\n which is a big problem because there's like a listener\n\n1:39:50.880 --> 1:39:53.520\n that needs to hear the point being finished as opposed\n\n1:39:53.520 --> 1:39:59.600\n to completing your sentences inside your own mind.\n\n1:39:59.600 --> 1:40:03.040\n And like the thing I find is useful to Elon does exact\n\n1:40:03.040 --> 1:40:08.640\n same thing is when the line of thinking is no longer useful,\n\n1:40:08.640 --> 1:40:11.680\n you just ran, you just switched to the next thing.\n\n1:40:11.680 --> 1:40:13.440\n You just leave that whole thing behind.\n\n1:40:13.440 --> 1:40:14.800\n You don't need a nice transition.\n\n1:40:14.800 --> 1:40:15.840\n You don't need any of that.\n\n1:40:15.840 --> 1:40:19.920\n And also just it's the first principles thing.\n\n1:40:19.920 --> 1:40:24.720\n It's like zooming in on the elephant in the room.\n\n1:40:24.720 --> 1:40:25.440\n I love that.\n\n1:40:25.440 --> 1:40:26.640\n It's so energizing.\n\n1:40:27.360 --> 1:40:28.880\n That's what I love about engineers.\n\n1:40:28.880 --> 1:40:33.520\n It's not the maybe most eloquent communication style,\n\n1:40:33.520 --> 1:40:35.840\n but I love it.\n\n1:40:35.840 --> 1:40:36.400\n What about you?\n\n1:40:36.400 --> 1:40:41.440\n So you said moving the book, what else?\n\n1:40:41.440 --> 1:40:48.240\n And you've been really excited about that's Anarchist Handbook,\n\n1:40:48.240 --> 1:40:51.600\n but you've also been nonstop excited about White Film.\n\n1:40:51.600 --> 1:40:53.360\n That was most of this year.\n\n1:40:53.360 --> 1:40:55.520\n You've been actually made significant progress.\n\n1:40:55.520 --> 1:40:57.920\n I'm on page 40 of the second draft.\n\n1:40:57.920 --> 1:40:59.920\n And it's really kind of funny because when you're doing\n\n1:40:59.920 --> 1:41:03.280\n your I think 10th book, I lost track already.\n\n1:41:04.640 --> 1:41:06.320\n The first draft is actually pretty good.\n\n1:41:06.320 --> 1:41:08.000\n Like I'm going back and like, all right, this is going\n\n1:41:08.000 --> 1:41:08.640\n to be a whole slog.\n\n1:41:08.640 --> 1:41:10.000\n I'm like, oh, I just have to cut and paste this\n\n1:41:10.000 --> 1:41:11.680\n and basically tweak a few words.\n\n1:41:11.680 --> 1:41:15.680\n So I did a good job with the first draft.\n\n1:41:15.680 --> 1:41:20.560\n It's also funny when you're writing how,\n\n1:41:21.280 --> 1:41:23.840\n and I guess this is the mark of a good professional writer,\n\n1:41:26.800 --> 1:41:30.960\n my personal feelings don't match how the characters\n\n1:41:30.960 --> 1:41:32.800\n in the book come off.\n\n1:41:32.800 --> 1:41:37.280\n Like I have a lot of fondness for people like Emma Goldman\n\n1:41:37.280 --> 1:41:40.240\n and Alexander Berkman and they're early on in the book,\n\n1:41:40.240 --> 1:41:41.440\n but they're not good people.\n\n1:41:42.080 --> 1:41:44.560\n And I'm writing it objectively and whatever,\n\n1:41:44.560 --> 1:41:47.040\n and I'm reading this, I'm like, they come off much worse\n\n1:41:47.040 --> 1:41:51.120\n than my personal appraisal of them.\n\n1:41:52.080 --> 1:41:55.040\n So it's kind of interesting as a writer when you're watching it,\n\n1:41:55.040 --> 1:41:56.960\n I guess, kind of like an attorney, right?\n\n1:41:56.960 --> 1:41:59.760\n Like you can have a situation where you as an attorney,\n\n1:41:59.760 --> 1:42:02.480\n you have a lot of fondness for your client,\n\n1:42:02.480 --> 1:42:04.560\n but you realize that they probably did this thing\n\n1:42:04.560 --> 1:42:06.800\n or you could not, it could be other way.\n\n1:42:06.800 --> 1:42:09.120\n Like they're innocent, but it's hard for you\n\n1:42:09.120 --> 1:42:11.680\n to make a good case for them because the data's not there.\n\n1:42:11.680 --> 1:42:13.840\n Can you actually talk about your writing process\n\n1:42:13.840 --> 1:42:14.400\n in several ways?\n\n1:42:14.400 --> 1:42:16.080\n So one, your writing process, but two,\n\n1:42:16.080 --> 1:42:18.320\n by way of advice of how to write.\n\n1:42:18.960 --> 1:42:20.080\n You've talked about in the past,\n\n1:42:20.080 --> 1:42:24.080\n like your first draft is these kind of disparate\n\n1:42:24.080 --> 1:42:25.680\n or more chaotic in that you don't,\n\n1:42:25.680 --> 1:42:27.280\n in the same way maybe I was saying\n\n1:42:27.280 --> 1:42:28.480\n in the engineering discussion,\n\n1:42:28.480 --> 1:42:30.080\n you don't complete the sentences.\n\n1:42:30.080 --> 1:42:31.200\n It's just like thoughts.\n\n1:42:31.200 --> 1:42:35.680\n The first like real good writing advice I remember getting\n\n1:42:35.680 --> 1:42:38.320\n was this book by Peggy Noonan called\n\n1:42:38.320 --> 1:42:39.600\n What I Saw at the Revolution.\n\n1:42:40.400 --> 1:42:42.320\n And she was Ron Reagan's speech writer.\n\n1:42:42.320 --> 1:42:44.160\n She still writes for the Wall Street Journal.\n\n1:42:45.680 --> 1:42:47.680\n The book I bought was at a used bookstore\n\n1:42:47.680 --> 1:42:50.080\n in Lewisburg, Pennsylvania when I was in college.\n\n1:42:50.080 --> 1:42:52.960\n The spine is cocked, I still have it, it was 99 cents.\n\n1:42:54.400 --> 1:42:56.800\n And she talked, when you're writing for a president,\n\n1:42:56.800 --> 1:42:59.280\n this is no joke, especially for a president\n\n1:42:59.280 --> 1:43:01.440\n who's the great communicator, Reagan.\n\n1:43:01.440 --> 1:43:04.800\n So, and you have to be very inspirational,\n\n1:43:04.800 --> 1:43:07.440\n but also not come off as corny, which is very hard to do.\n\n1:43:08.160 --> 1:43:10.640\n And she in the book talks about how she wrote speeches\n\n1:43:10.640 --> 1:43:13.920\n for him, how she, I'm paraphrasing her\n\n1:43:13.920 --> 1:43:16.960\n and I haven't read her book in a couple of decades,\n\n1:43:16.960 --> 1:43:19.520\n but basically she would write like a brain dump\n\n1:43:19.520 --> 1:43:20.480\n and it's just garbage.\n\n1:43:20.480 --> 1:43:22.480\n And she's like, that's okay, just get it all out there.\n\n1:43:23.680 --> 1:43:26.880\n And then there's that expression, all writing is editing.\n\n1:43:26.880 --> 1:43:29.120\n So for the White Pills specifically,\n\n1:43:29.120 --> 1:43:32.000\n this is, I don't know if it's the most ambitious book\n\n1:43:32.000 --> 1:43:34.160\n I've ever done, your reader I think is more ambitious\n\n1:43:34.160 --> 1:43:36.240\n because that's all of North Korea's history\n\n1:43:36.240 --> 1:43:37.440\n and it's written in somebody else's voice,\n\n1:43:37.440 --> 1:43:38.720\n not a person's abortion.\n\n1:43:38.720 --> 1:43:41.280\n And you, like you mentioned, you had to read\n\n1:43:41.280 --> 1:43:42.240\n a giant number of books.\n\n1:43:42.240 --> 1:43:44.320\n Yeah, 60 books as research, yeah.\n\n1:43:44.320 --> 1:43:45.840\n Well, maybe can we just pause,\n\n1:43:45.840 --> 1:43:47.520\n can you say what White Pill is about?\n\n1:43:48.560 --> 1:43:52.240\n Sure, it's about hope and it's a tale of good and evil.\n\n1:43:52.240 --> 1:43:54.800\n And I think that's, I don't want to tip my hand too much,\n\n1:43:55.600 --> 1:43:57.600\n but people are always like, how do you think,\n\n1:43:57.600 --> 1:43:58.960\n why are you so hopeful?\n\n1:43:58.960 --> 1:44:00.640\n And I'm not hopeful on an emotional level,\n\n1:44:00.640 --> 1:44:03.040\n I'm hopeful because looking at history,\n\n1:44:03.040 --> 1:44:04.640\n I think there's certain things that\n\n1:44:06.720 --> 1:44:08.400\n not will certainly happen again,\n\n1:44:08.400 --> 1:44:10.400\n but it's not at all implausible to happen again\n\n1:44:10.400 --> 1:44:12.320\n and that the good guys will win.\n\n1:44:12.320 --> 1:44:14.000\n And this is one of those cases.\n\n1:44:14.000 --> 1:44:19.440\n So, the book took on a life of its own,\n\n1:44:19.440 --> 1:44:21.440\n it's very different from how I originally conceived it.\n\n1:44:21.440 --> 1:44:24.320\n I originally conceived it as a kind of retelling\n\n1:44:24.320 --> 1:44:27.600\n of Camus philosophy, Ryan Holiday,\n\n1:44:28.240 --> 1:44:29.520\n who he used to be close friends with,\n\n1:44:29.520 --> 1:44:30.480\n I've talked to him in a while.\n\n1:44:30.480 --> 1:44:32.240\n He has a whole kind of cottage industry\n\n1:44:32.240 --> 1:44:33.840\n based on the Stoics of the past.\n\n1:44:33.840 --> 1:44:35.280\n I'm like, okay, I asked him once,\n\n1:44:35.280 --> 1:44:36.080\n can I do this with Camus?\n\n1:44:36.080 --> 1:44:36.640\n He said, sure.\n\n1:44:37.440 --> 1:44:40.160\n And then I reread Camus recently\n\n1:44:40.160 --> 1:44:43.120\n and it wasn't what I had remembered.\n\n1:44:43.120 --> 1:44:45.760\n I was like, Camus wasn't that, I apologize to interrupt.\n\n1:44:45.760 --> 1:44:47.120\n So, it's interesting.\n\n1:44:47.120 --> 1:44:49.280\n So, he kind of took ideas from Stoics\n\n1:44:50.320 --> 1:44:54.000\n and started to kind of use it as a book\n\n1:44:54.880 --> 1:44:56.800\n that gives you advice about how to live life\n\n1:44:56.800 --> 1:44:58.400\n from the Stoic perspectives.\n\n1:44:58.400 --> 1:45:00.080\n And you were thinking,\n\n1:45:00.080 --> 1:45:03.440\n is there something in existentialism, absurdism,\n\n1:45:03.440 --> 1:45:06.880\n or something specifically in Camus thinking,\n\n1:45:06.880 --> 1:45:09.840\n or I think you've mentioned Mithos Sisyphus,\n\n1:45:09.840 --> 1:45:11.840\n specifically like his philosophical work.\n\n1:45:11.840 --> 1:45:14.240\n So, you were trying to see like,\n\n1:45:14.240 --> 1:45:15.840\n is there, can I resurrect this?\n\n1:45:15.840 --> 1:45:19.760\n That's actually, I would think,\n\n1:45:20.400 --> 1:45:21.840\n that's an interesting project.\n\n1:45:22.640 --> 1:45:28.640\n And it's sad to hear that it didn't materialize\n\n1:45:28.640 --> 1:45:31.520\n in exactly that form,\n\n1:45:31.520 --> 1:45:33.680\n because I thought there would be a lot in that.\n\n1:45:33.680 --> 1:45:35.360\n So, I had Douglas Murray on my show\n\n1:45:35.360 --> 1:45:36.400\n and he also made the point,\n\n1:45:36.400 --> 1:45:37.680\n like when you go back and read Camus,\n\n1:45:37.680 --> 1:45:38.800\n there's not that much there.\n\n1:45:38.800 --> 1:45:42.720\n The myth of Sisyphus is not at all how I remembered it.\n\n1:45:43.360 --> 1:45:46.800\n The vast bulk of that book is like literary criticism.\n\n1:45:46.800 --> 1:45:48.080\n So, he's talking about Dostoevsky\n\n1:45:48.080 --> 1:45:48.720\n and all these different people\n\n1:45:48.720 --> 1:45:50.240\n who are embodiments of the absurd,\n\n1:45:50.240 --> 1:45:52.960\n but I'm like, there's not much to take from here.\n\n1:45:52.960 --> 1:45:55.280\n The actual title essay is basically\n\n1:45:55.280 --> 1:45:59.360\n like a six chapter essay at the back of the book,\n\n1:45:59.360 --> 1:46:02.400\n which it's good for what it is,\n\n1:46:02.400 --> 1:46:04.320\n but there's not that much there to draw.\n\n1:46:04.320 --> 1:46:07.840\n I'm extremely, he's a great hero of mine.\n\n1:46:07.840 --> 1:46:10.800\n I think his life is just enormously admirable.\n\n1:46:10.800 --> 1:46:13.600\n He fought very hard against the Nazi occupation.\n\n1:46:14.240 --> 1:46:16.640\n His book, The Plague, which I find unreadable\n\n1:46:16.640 --> 1:46:19.920\n is an allegory about Germany conquering France\n\n1:46:19.920 --> 1:46:20.720\n and so on and so forth.\n\n1:46:20.720 --> 1:46:23.680\n Wait a minute, why is The Plague unreadable?\n\n1:46:23.680 --> 1:46:25.680\n It's the kind of book where reading the book\n\n1:46:25.680 --> 1:46:27.520\n doesn't add anything to the plot.\n\n1:46:27.520 --> 1:46:30.960\n The plot is a plague comes, sleeps over the town,\n\n1:46:31.520 --> 1:46:34.000\n destroys a lot of life and vanishes quickly as it came.\n\n1:46:34.000 --> 1:46:35.440\n You don't need to read the book now.\n\n1:46:35.440 --> 1:46:36.080\n You get the point.\n\n1:46:36.080 --> 1:46:38.880\n I deeply disagree with you.\n\n1:46:38.880 --> 1:46:40.960\n Yes, of course I've read The Plague.\n\n1:46:40.960 --> 1:46:42.720\n To me, The Plague is about the doctor\n\n1:46:43.520 --> 1:46:47.920\n and it's about love and it's about the different roles\n\n1:46:47.920 --> 1:46:53.760\n that humans take in a time of tragedy like The Plague.\n\n1:46:53.760 --> 1:46:56.720\n Also, it's an allegory, so you could start to think about\n\n1:46:58.400 --> 1:47:00.480\n whether it's Nazi Germany, whatever you think that is.\n\n1:47:01.920 --> 1:47:06.640\n To me, that was about love and about the highest ideal\n\n1:47:06.640 --> 1:47:09.600\n being the doctor that sacrifices themselves for others\n\n1:47:10.640 --> 1:47:12.640\n and still has love and hope.\n\n1:47:12.640 --> 1:47:16.720\n I mean, to me, the way that story is told,\n\n1:47:16.720 --> 1:47:19.040\n I think, has a lot of meaning.\n\n1:47:19.040 --> 1:47:22.000\n It's like, to me, you saying that's interesting.\n\n1:47:22.000 --> 1:47:24.560\n You say it this way, but to me, it's like saying\n\n1:47:24.560 --> 1:47:27.680\n Animal Farm doesn't need to be read\n\n1:47:28.640 --> 1:47:31.280\n because it's an obvious story.\n\n1:47:31.280 --> 1:47:33.280\n I don't think there's much plot to The Plague.\n\n1:47:34.240 --> 1:47:36.160\n I think Animal Farm has a very long plot\n\n1:47:37.440 --> 1:47:38.800\n and a complex plot.\n\n1:47:38.800 --> 1:47:41.440\n But there's experiences within.\n\n1:47:42.000 --> 1:47:44.000\n So the situation is set up in The Plague\n\n1:47:44.000 --> 1:47:47.600\n and there's experiences that start to reveal a philosophy.\n\n1:47:48.480 --> 1:47:51.440\n So yeah, it's not very plot driven.\n\n1:47:53.360 --> 1:47:55.760\n So I would say you still should read it,\n\n1:47:56.560 --> 1:47:58.160\n but The Plague doesn't...\n\n1:47:58.160 --> 1:48:00.480\n Like you didn't give away anything currently.\n\n1:48:03.280 --> 1:48:04.400\n Some books are just...\n\n1:48:04.400 --> 1:48:07.680\n I mean, Ayn Rand is similar to that in the sense\n\n1:48:07.680 --> 1:48:09.840\n like The Plague is not as important\n\n1:48:09.840 --> 1:48:12.880\n as the behavior of the different people in that plot.\n\n1:48:12.880 --> 1:48:14.480\n I think she's very plot heavy.\n\n1:48:15.120 --> 1:48:16.720\n No, she has plot, but I'm saying\n\n1:48:16.720 --> 1:48:19.120\n that's not necessarily the important thing.\n\n1:48:19.120 --> 1:48:21.600\n To me, the behavior of the people is the important thing.\n\n1:48:23.200 --> 1:48:26.320\n You could like separate it into a bunch of blog posts\n\n1:48:26.320 --> 1:48:27.520\n and they stand on their own.\n\n1:48:28.160 --> 1:48:30.960\n I would have to think about that with Ayn Rand.\n\n1:48:32.480 --> 1:48:34.880\n She does, through the plot, create a world\n\n1:48:34.880 --> 1:48:37.360\n where you start to understand the different values\n\n1:48:37.360 --> 1:48:40.160\n that people have, but yeah.\n\n1:48:40.160 --> 1:48:43.120\n Yeah, but that's what the plot serves.\n\n1:48:44.320 --> 1:48:46.160\n Yeah, I would have to think.\n\n1:48:46.160 --> 1:48:48.160\n But in The Plague, it's the behavior of the people\n\n1:48:48.160 --> 1:48:49.280\n that's really important.\n\n1:48:49.280 --> 1:48:51.920\n And the same, I mean, The Stranger too.\n\n1:48:51.920 --> 1:48:52.720\n I mean, these like...\n\n1:48:55.520 --> 1:48:57.360\n I'm trying to scramble here for books\n\n1:48:57.360 --> 1:48:59.680\n I really appreciate that don't have a plot.\n\n1:48:59.680 --> 1:49:04.000\n I mean, Notes from Underground.\n\n1:49:04.640 --> 1:49:07.200\n So obviously, Dostoevsky has a huge amount of plot\n\n1:49:07.200 --> 1:49:09.360\n in most of his work.\n\n1:49:09.360 --> 1:49:11.760\n Hermann Hesse has a huge amount of plot.\n\n1:49:11.760 --> 1:49:13.040\n Thomas Mann doesn't have the plot.\n\n1:49:13.040 --> 1:49:14.240\n He's the one who doesn't have plots.\n\n1:49:14.240 --> 1:49:15.280\n Thomas Mann.\n\n1:49:15.280 --> 1:49:16.880\n Would you say Kafka has a plot?\n\n1:49:17.440 --> 1:49:19.920\n I think Kafka's very heavy plot driven.\n\n1:49:19.920 --> 1:49:21.680\n Yeah, but I just don't see that, I guess.\n\n1:49:21.680 --> 1:49:23.440\n I guess Metamorphosis doesn't really have a plot.\n\n1:49:25.040 --> 1:49:27.280\n Yeah, but there's like crawling around.\n\n1:49:27.280 --> 1:49:28.240\n But it's like a vignette.\n\n1:49:28.240 --> 1:49:29.440\n It's not really like this.\n\n1:49:29.440 --> 1:49:30.160\n It's not short, yeah.\n\n1:49:30.160 --> 1:49:30.720\n Yeah.\n\n1:49:30.720 --> 1:49:34.720\n A Hunger Artist, one of my probably favorite short stories\n\n1:49:34.720 --> 1:49:35.840\n is that kind of a short story.\n\n1:49:35.840 --> 1:49:38.480\n It's a pretty long short story of Kafka's.\n\n1:49:38.480 --> 1:49:39.280\n It's really interesting.\n\n1:49:40.240 --> 1:49:41.360\n It's about a man.\n\n1:49:41.360 --> 1:49:42.400\n I don't know if you read it.\n\n1:49:42.400 --> 1:49:43.040\n No, I don't think so.\n\n1:49:43.920 --> 1:49:48.160\n It's about a man that is like a freak in a sense\n\n1:49:48.160 --> 1:49:53.200\n that his skill is that he can fast for a long time.\n\n1:49:53.200 --> 1:49:53.520\n Okay.\n\n1:49:53.520 --> 1:49:55.040\n And then people gather on the cage\n\n1:49:55.040 --> 1:49:57.520\n and look at him as he fasts.\n\n1:49:57.520 --> 1:49:59.280\n I don't actually remember if he's in a cage or not.\n\n1:50:00.800 --> 1:50:03.200\n And eventually, he fasts so long\n\n1:50:03.200 --> 1:50:04.880\n that people don't even care anymore.\n\n1:50:04.880 --> 1:50:06.000\n Like they just leave.\n\n1:50:06.000 --> 1:50:11.200\n So there's a, it has to do something.\n\n1:50:11.200 --> 1:50:15.040\n It makes me think about like, don't become,\n\n1:50:15.040 --> 1:50:19.280\n the way you live, don't become like a freak show,\n\n1:50:19.280 --> 1:50:20.240\n a circus act.\n\n1:50:20.800 --> 1:50:25.920\n Like live for an ideal, live for something that brings you joy.\n\n1:50:25.920 --> 1:50:27.680\n Or don't live for the sake of attention.\n\n1:50:27.680 --> 1:50:28.640\n For the sake of attention.\n\n1:50:28.640 --> 1:50:29.520\n Yeah, that's, yeah.\n\n1:50:30.880 --> 1:50:34.080\n Yeah, anyway, so I rudely interrupted\n\n1:50:34.080 --> 1:50:36.560\n because you were talking about the plague and connecting it\n\n1:50:36.560 --> 1:50:39.200\n to the writing process of White Pill.\n\n1:50:39.200 --> 1:50:39.440\n Yeah.\n\n1:50:40.000 --> 1:50:43.040\n Well, anyway, so how I was writing this one,\n\n1:50:43.040 --> 1:50:46.560\n I just had a first draft of notes\n\n1:50:46.560 --> 1:50:48.800\n and it's not in chronological order.\n\n1:50:48.800 --> 1:50:50.960\n It's like, I read certain books as research\n\n1:50:50.960 --> 1:50:53.360\n and then I had the pull quotes that was necessary there.\n\n1:50:54.400 --> 1:50:57.280\n And now I'm basically rearranging everything and putting it.\n\n1:50:57.280 --> 1:51:00.400\n So the book started as Ryan Holiday's.\n\n1:51:01.040 --> 1:51:01.360\n Right.\n\n1:51:01.360 --> 1:51:04.240\n The equivalent of Ryan Holiday as Camus, the working title would have been\n\n1:51:04.240 --> 1:51:06.880\n The Point of Tears because this is great.\n\n1:51:06.880 --> 1:51:11.520\n Camus is a great quote maker and he has this line about\n\n1:51:11.520 --> 1:51:13.360\n man must live, live to the point of tears,\n\n1:51:14.000 --> 1:51:19.440\n which I think is just what I love about him is Camus,\n\n1:51:19.440 --> 1:51:22.480\n he always comes off as like he's clenching his teeth.\n\n1:51:22.480 --> 1:51:26.080\n He's clenching his teeth both in terms of like\n\n1:51:26.080 --> 1:51:29.200\n barely mitigated rage and injustice.\n\n1:51:29.200 --> 1:51:32.960\n Like when he sees people suffering, it just really makes him like\n\n1:51:32.960 --> 1:51:34.160\n just upset to the core.\n\n1:51:34.800 --> 1:51:40.480\n But also this sense of not taking life for granted\n\n1:51:41.120 --> 1:51:44.160\n and kind of just pushing yourself and pushing the boundaries.\n\n1:51:44.160 --> 1:51:48.080\n And his point being that life is inherently meaningless,\n\n1:51:48.080 --> 1:51:50.400\n which gives a great opportunity to impute meaning to it\n\n1:51:51.200 --> 1:51:53.200\n to create our own meaning to life.\n\n1:51:53.200 --> 1:51:56.000\n So taking the main essay from Sisyphus,\n\n1:51:56.000 --> 1:52:00.240\n myth of Sisyphus, that was the origin story for the white pill,\n\n1:52:00.240 --> 1:52:02.000\n but then it became something completely different.\n\n1:52:02.000 --> 1:52:05.600\n Yeah. And so then it became, how are you so optimistic\n\n1:52:05.600 --> 1:52:07.360\n in the face of everything that's going on in the world?\n\n1:52:07.360 --> 1:52:09.920\n And I started writing it when COVID started hitting.\n\n1:52:10.480 --> 1:52:14.000\n And I, because again, I'm not optimistic\n\n1:52:14.000 --> 1:52:16.480\n because of some temperament of mine.\n\n1:52:16.480 --> 1:52:19.840\n I'm optimistic because, you know, people talk about how\n\n1:52:19.840 --> 1:52:23.680\n if the US didn't exist, China would just become an empire\n\n1:52:23.680 --> 1:52:24.720\n and take over everything.\n\n1:52:24.720 --> 1:52:30.160\n Empires are expensive and look at the British empire,\n\n1:52:30.160 --> 1:52:31.760\n you know, look at the Soviet Union.\n\n1:52:31.760 --> 1:52:34.880\n Like it's not automatically sustainable.\n\n1:52:34.880 --> 1:52:40.800\n It costs a lot of things to make sure when you're geographically,\n\n1:52:40.800 --> 1:52:43.760\n you know, all over the world, literally,\n\n1:52:43.760 --> 1:52:44.880\n to keep everyone in line.\n\n1:52:44.880 --> 1:52:47.520\n It's not at all like a super villain movie.\n\n1:52:47.520 --> 1:52:50.080\n Like once it happens, it's the happy ending for them.\n\n1:52:50.080 --> 1:52:53.280\n So yeah, that was the start.\n\n1:52:53.280 --> 1:52:57.840\n And I'm like, all right, let me tell, one thing I'm good at\n\n1:52:57.840 --> 1:52:58.960\n is telling stories.\n\n1:52:58.960 --> 1:53:00.400\n So this is really a...\n\n1:53:00.400 --> 1:53:03.200\n So this is narrative, plot driven.\n\n1:53:03.200 --> 1:53:06.560\n Very, very plot driven and also heavily character driven,\n\n1:53:06.560 --> 1:53:07.600\n but the characters are real.\n\n1:53:08.320 --> 1:53:09.600\n Yeah. Got it.\n\n1:53:09.600 --> 1:53:14.080\n So it's interesting to kind of mention what kind of,\n\n1:53:14.080 --> 1:53:16.560\n what does the first draft kind of look like in terms of,\n\n1:53:17.280 --> 1:53:19.360\n what kind of things do you plop down?\n\n1:53:19.360 --> 1:53:22.080\n Oh, so it'll be like, let's suppose I just read a,\n\n1:53:22.080 --> 1:53:24.400\n like, you know, some book called The Guillotine at Work,\n\n1:53:24.400 --> 1:53:26.880\n which was an early book attacking Lenin\n\n1:53:26.880 --> 1:53:29.040\n from the anarcho communist perspective.\n\n1:53:29.040 --> 1:53:30.720\n So it'll just be like all the different quotes,\n\n1:53:30.720 --> 1:53:33.200\n like a paragraph here, double space, another paragraph,\n\n1:53:33.200 --> 1:53:36.160\n you know, blah, blah, blah, so on and so forth.\n\n1:53:36.160 --> 1:53:39.440\n Whereas for other sections where I wasn't just using\n\n1:53:39.440 --> 1:53:42.240\n the book as research, there would be like talking\n\n1:53:42.240 --> 1:53:43.760\n about McKinley getting shot.\n\n1:53:43.760 --> 1:53:46.720\n Like it's just me writing the narrative and that I could just\n\n1:53:46.720 --> 1:53:49.040\n pretty much copy paste into the second draft.\n\n1:53:49.040 --> 1:53:52.960\n By way of advice, would you give that as advice?\n\n1:53:52.960 --> 1:53:54.560\n Is that a good way to do it?\n\n1:53:54.560 --> 1:53:56.720\n Or is that a very peculiar way your brain works?\n\n1:53:56.720 --> 1:53:59.120\n No, so this is actually advice I feel comfortable giving\n\n1:53:59.120 --> 1:54:00.480\n to people who are trying to write.\n\n1:54:02.320 --> 1:54:04.720\n Because it's just like with the gym, right?\n\n1:54:04.720 --> 1:54:08.640\n If you did seven sets, seven, excuse me, reps last week\n\n1:54:08.640 --> 1:54:11.920\n and you did eight this week, it's psychologically motivating\n\n1:54:11.920 --> 1:54:13.280\n because you're going the right direction\n\n1:54:13.280 --> 1:54:14.960\n and the human mind extrapolates.\n\n1:54:14.960 --> 1:54:19.520\n So make sure, tell yourself I'm gonna get a page done today\n\n1:54:19.520 --> 1:54:22.400\n or two pages done, sit your ass down on the computer,\n\n1:54:22.400 --> 1:54:24.800\n you're not allowed to get up till you get those two pages.\n\n1:54:24.800 --> 1:54:26.640\n It doesn't matter if they look like garbage\n\n1:54:26.640 --> 1:54:31.280\n because if you have a 300 page first draft and it's crap,\n\n1:54:31.280 --> 1:54:33.120\n at least you have something to work with\n\n1:54:33.120 --> 1:54:34.480\n and that's a big number.\n\n1:54:34.480 --> 1:54:37.680\n So if you're gonna, the thing is, since the first draft\n\n1:54:37.680 --> 1:54:40.560\n is gonna be crap, if you're editing as you write,\n\n1:54:40.560 --> 1:54:42.240\n it's gonna be extremely discouraging.\n\n1:54:42.240 --> 1:54:45.360\n And it's also trying to drive and doing reverse\n\n1:54:45.360 --> 1:54:46.160\n at the same time.\n\n1:54:46.160 --> 1:54:48.800\n It's a completely nonsensical way to do it.\n\n1:54:48.800 --> 1:54:51.280\n Get it all out there, don't look it over.\n\n1:54:51.280 --> 1:54:52.880\n If you have a great line, put it in your phone\n\n1:54:52.880 --> 1:54:57.200\n and then add it to the draft so it'll be a complete slog.\n\n1:54:57.200 --> 1:54:59.120\n But editing that slog is gonna be a lot easier\n\n1:54:59.120 --> 1:55:00.320\n than creating it to begin with.\n\n1:55:00.320 --> 1:55:03.280\n And when you see those disparate lines all laid out\n\n1:55:03.280 --> 1:55:07.200\n on the page, how difficult is it to then start\n\n1:55:07.200 --> 1:55:08.000\n stitching it together?\n\n1:55:08.000 --> 1:55:11.920\n Do you find that when you look at a list of those things\n\n1:55:11.920 --> 1:55:15.120\n the final product will look very different\n\n1:55:15.120 --> 1:55:17.360\n or will you actually use those lines?\n\n1:55:17.360 --> 1:55:18.640\n No, I will use those lines.\n\n1:55:18.640 --> 1:55:20.640\n Then I have a file called scraps.\n\n1:55:20.640 --> 1:55:22.160\n So like if the line's no longer used,\n\n1:55:22.160 --> 1:55:23.200\n I put it in my scrap pile.\n\n1:55:24.320 --> 1:55:26.160\n I'd love to see what's in the scrap pile.\n\n1:55:26.160 --> 1:55:26.880\n Okay, yeah, sure.\n\n1:55:28.160 --> 1:55:29.760\n One of the things I've been pulling scraps\n\n1:55:29.760 --> 1:55:31.920\n is a lot of times when I was earlier writing,\n\n1:55:32.480 --> 1:55:34.560\n I would have contemporary references\n\n1:55:35.280 --> 1:55:40.480\n and I realized that that's bad because I want the reader\n\n1:55:40.480 --> 1:55:43.040\n to be in the past as the present.\n\n1:55:43.040 --> 1:55:45.440\n So if you're talking about let's say 1901\n\n1:55:45.440 --> 1:55:46.640\n and then you're referring to Obama,\n\n1:55:46.640 --> 1:55:48.800\n that screws people up so I had to pull all those.\n\n1:55:50.320 --> 1:55:52.640\n Okay, let's talk about some New Year's resolutions.\n\n1:55:53.360 --> 1:55:55.040\n Do you ever do New Year's resolutions?\n\n1:55:55.040 --> 1:55:57.360\n Do you ever think like that, like take a special day\n\n1:55:58.400 --> 1:56:01.040\n in the year to think about how you're gonna try\n\n1:56:01.040 --> 1:56:03.840\n to change yourself or do you try to transform yourself\n\n1:56:03.840 --> 1:56:05.120\n every single day when you wake up?\n\n1:56:05.920 --> 1:56:08.800\n Well, I usually have several projects I'm working on at once\n\n1:56:08.800 --> 1:56:10.640\n so there's always incremental progress in those.\n\n1:56:12.160 --> 1:56:13.360\n You know, it's nice to have a deadline\n\n1:56:13.360 --> 1:56:17.920\n but at the end of 2022, I'll accomplish this,\n\n1:56:17.920 --> 1:56:21.360\n kind of like to hold yourself responsible\n\n1:56:21.360 --> 1:56:23.840\n and then you could do that at the beginning of the year\n\n1:56:23.840 --> 1:56:26.560\n to think about that, both philosophically\n\n1:56:26.560 --> 1:56:31.120\n like what kind of big, not projects that you can quantify\n\n1:56:31.120 --> 1:56:33.120\n but more like how can I change my life\n\n1:56:33.120 --> 1:56:35.760\n or like I mentioned, take the leap of different kinds\n\n1:56:35.760 --> 1:56:39.280\n and then there's specific things like finish the book.\n\n1:56:39.280 --> 1:56:44.400\n I, years ago and I'm, I think on some level,\n\n1:56:44.400 --> 1:56:46.560\n you much less than me but I think you're increasing\n\n1:56:46.560 --> 1:56:49.440\n in this direction, I realized it's more,\n\n1:56:49.440 --> 1:56:52.240\n I have to learn how to be a surfer and not a driver\n\n1:56:53.120 --> 1:56:56.320\n because when you reach the level we're at in our careers\n\n1:56:56.320 --> 1:56:59.840\n or in our place in the culture, a lot of this is luck\n\n1:57:00.720 --> 1:57:04.320\n and a lot of this is just like I'm just going along\n\n1:57:04.320 --> 1:57:07.520\n for the ride because it's kind of counterintuitive\n\n1:57:07.520 --> 1:57:10.160\n like the success of the Anarchist Handbook\n\n1:57:10.160 --> 1:57:11.120\n was counterintuitive.\n\n1:57:12.560 --> 1:57:17.760\n So all I'm hoping for is getting the book done.\n\n1:57:18.400 --> 1:57:27.120\n I am extremely proud of it and just also building a,\n\n1:57:28.320 --> 1:57:30.640\n we had Thanksgiving together at Blair's house,\n\n1:57:30.640 --> 1:57:35.520\n just building a great upcoming community here in Austin\n\n1:57:35.520 --> 1:57:38.400\n which has happened very quickly.\n\n1:57:38.400 --> 1:57:42.800\n I was, there was gonna be another surprise here.\n\n1:57:42.800 --> 1:57:45.840\n There's a girl named Natalie SideSurf\n\n1:57:45.840 --> 1:57:48.240\n and she makes these ultra realistic cakes\n\n1:57:48.240 --> 1:57:49.680\n like if you've seen those cakes online\n\n1:57:49.680 --> 1:57:51.040\n where it looks like you're cutting a puppy,\n\n1:57:51.040 --> 1:57:52.320\n like she makes those kinds of things.\n\n1:57:52.320 --> 1:57:53.200\n So she's here.\n\n1:57:54.080 --> 1:57:54.560\n In Austin?\n\n1:57:54.560 --> 1:57:55.040\n Yeah.\n\n1:57:55.040 --> 1:57:57.040\n Oh cool, like moved permanently?\n\n1:57:57.040 --> 1:57:58.160\n I think she's been here for a while.\n\n1:57:58.160 --> 1:58:01.280\n I haven't met her yet but I just kind of chatted with her.\n\n1:58:01.280 --> 1:58:06.400\n So it's just so many, there's so many scenes happening here\n\n1:58:07.520 --> 1:58:08.560\n that are overlapping.\n\n1:58:09.440 --> 1:58:14.080\n So in general, finish the book, keep building a community.\n\n1:58:14.080 --> 1:58:15.360\n You've already been doing that here.\n\n1:58:15.360 --> 1:58:16.720\n You've been here several months.\n\n1:58:16.720 --> 1:58:18.960\n I've been making a point to introduce people to each other\n\n1:58:18.960 --> 1:58:20.960\n and everyone's just really getting along very well.\n\n1:58:21.520 --> 1:58:24.400\n That's great and the book is the focus.\n\n1:58:24.400 --> 1:58:25.840\n The book is the focus.\n\n1:58:25.840 --> 1:58:28.400\n What about the podcast that you're doing?\n\n1:58:28.400 --> 1:58:29.520\n You're welcome.\n\n1:58:29.520 --> 1:58:33.360\n Yeah, I mean I enjoy it and it's been growing a lot.\n\n1:58:33.360 --> 1:58:37.600\n I finally got a new computer which my friend Jay installed\n\n1:58:37.600 --> 1:58:40.080\n so I can have a decent camera because of my old,\n\n1:58:41.600 --> 1:58:43.760\n this is my mindset as a hoarder.\n\n1:58:43.760 --> 1:58:47.120\n Like I was more interested in spending money\n\n1:58:47.120 --> 1:58:49.520\n on a Pareto autograph than actually getting a computer\n\n1:58:49.520 --> 1:58:52.240\n that's from the 20th century.\n\n1:58:52.240 --> 1:58:59.280\n So, but I'm such an old school person in that in my head,\n\n1:59:00.240 --> 1:59:02.000\n podcasts are like so ephemeral.\n\n1:59:02.880 --> 1:59:06.080\n Like I don't, like there's some episodes of my podcast\n\n1:59:06.080 --> 1:59:08.240\n that I'm really proud of and there's a lot of friendships\n\n1:59:08.240 --> 1:59:10.240\n I've made as a result of it that really mean a lot to me.\n\n1:59:10.240 --> 1:59:10.880\n No question.\n\n1:59:10.880 --> 1:59:12.480\n It's made my life profoundly better place.\n\n1:59:13.040 --> 1:59:15.760\n But it's not the same as that book on the shelf,\n\n1:59:15.760 --> 1:59:19.760\n especially when the book is something that I think matters\n\n1:59:19.760 --> 1:59:20.720\n much more than I do.\n\n1:59:20.720 --> 1:59:22.080\n Yeah, there's a permanence to it.\n\n1:59:22.080 --> 1:59:26.320\n There's a seriousness to laying down the words on paper,\n\n1:59:26.320 --> 1:59:27.920\n like really giving them thought.\n\n1:59:27.920 --> 1:59:30.320\n Yeah, that's true.\n\n1:59:30.320 --> 1:59:32.480\n I mean, I'm a huge fan of podcasts.\n\n1:59:32.480 --> 1:59:34.640\n You don't listen to podcasts much.\n\n1:59:34.640 --> 1:59:35.920\n It's just fascinating to.\n\n1:59:36.800 --> 1:59:38.080\n Yeah, like at all.\n\n1:59:38.080 --> 1:59:39.920\n Like I don't know how mine is so successful.\n\n1:59:39.920 --> 1:59:41.680\n Like it's just, yeah.\n\n1:59:43.680 --> 1:59:45.840\n Yeah, yeah, I just love the medium.\n\n1:59:45.840 --> 1:59:49.840\n Yeah, but I love the authenticity, the authenticity.\n\n1:59:49.840 --> 1:59:52.640\n The realness of the medium.\n\n1:59:52.640 --> 1:59:53.680\n That's really nice.\n\n1:59:53.680 --> 1:59:56.640\n I just understood for the, it's starting to click\n\n1:59:57.280 --> 2:00:00.640\n because like my pal Blair White, she was just on Rogan\n\n2:00:01.360 --> 2:00:05.920\n and the first 10 minutes, I was so angry.\n\n2:00:05.920 --> 2:00:08.560\n Like I was sitting there like yelling at the screen\n\n2:00:08.560 --> 2:00:12.000\n because Joe and Blair, you would think that they're\n\n2:00:12.000 --> 2:00:15.440\n going to start talking about Trump or trans issues\n\n2:00:15.440 --> 2:00:16.720\n or moving to Austin.\n\n2:00:16.720 --> 2:00:18.960\n They start talking about shark reproduction\n\n2:00:18.960 --> 2:00:21.600\n and neither of these dumbasses knew anything about it.\n\n2:00:21.600 --> 2:00:22.720\n I know a lot about it.\n\n2:00:22.720 --> 2:00:23.920\n And they're like, oh, is it like this?\n\n2:00:23.920 --> 2:00:24.880\n Or do the sharks lay eggs?\n\n2:00:24.880 --> 2:00:25.760\n And I'm sitting there, I'm like,\n\n2:00:25.760 --> 2:00:28.880\n if you don't know why you're talking about this, why?\n\n2:00:28.880 --> 2:00:29.920\n Why are you talking?\n\n2:00:29.920 --> 2:00:33.040\n And I could also see why people like these shows\n\n2:00:33.040 --> 2:00:34.480\n because they feel like they're friends of the people.\n\n2:00:34.480 --> 2:00:35.440\n Like they're sitting in the room\n\n2:00:35.440 --> 2:00:36.560\n because I felt like it was in that room\n\n2:00:36.560 --> 2:00:38.560\n and I wanted to shake both of them.\n\n2:00:38.560 --> 2:00:39.600\n Yeah, in the room.\n\n2:00:39.600 --> 2:00:41.520\n So no, what about transforming yourself\n\n2:00:42.320 --> 2:00:43.680\n and your resolutions like that?\n\n2:00:43.680 --> 2:00:46.400\n Oh, I'm doing a slight bulk now.\n\n2:00:46.400 --> 2:00:48.560\n So I'm almost at my heaviest weight ever,\n\n2:00:48.560 --> 2:00:50.320\n but I couldn't go to the gym this week\n\n2:00:50.320 --> 2:00:51.840\n because I was a little under weather.\n\n2:00:52.560 --> 2:00:54.080\n So that's been a little frustrating, but yeah.\n\n2:00:54.960 --> 2:00:57.360\n So are we going to get some more modeling pics?\n\n2:00:59.040 --> 2:01:00.240\n Is there goals there?\n\n2:01:00.240 --> 2:01:03.200\n So my heaviest, I'm 4.8.\n\n2:01:03.200 --> 2:01:05.600\n The heaviest I've ever been was when,\n\n2:01:05.600 --> 2:01:06.720\n and this is when I was like.\n\n2:01:06.720 --> 2:01:07.760\n He's exaggerating.\n\n2:01:07.760 --> 2:01:08.800\n He's not that tall.\n\n2:01:08.800 --> 2:01:09.520\n That's the metric.\n\n2:01:10.800 --> 2:01:11.520\n Oh, sorry.\n\n2:01:11.520 --> 2:01:13.200\n Are you talking about your height, 4.8?\n\n2:01:13.200 --> 2:01:13.360\n Yeah.\n\n2:01:14.400 --> 2:01:15.520\n Barely 4.6.\n\n2:01:15.520 --> 2:01:19.440\n So the heaviest I've ever been when I was really high body fat\n\n2:01:21.040 --> 2:01:22.400\n because I couldn't gain weight as a kid.\n\n2:01:22.400 --> 2:01:24.080\n So when I figured out I could actually gain weight,\n\n2:01:24.080 --> 2:01:27.360\n I was 164.5.\n\n2:01:27.360 --> 2:01:31.360\n So I want to hit 165 and then take it from there.\n\n2:01:31.360 --> 2:01:33.280\n I have a friend who's been helping me,\n\n2:01:33.280 --> 2:01:35.760\n my buddy Trey Goff and this kid Stronger.\n\n2:01:36.640 --> 2:01:38.720\n Jake, his username on Instagram is Stronger,\n\n2:01:38.720 --> 2:01:42.640\n both the number five instead of letter S.\n\n2:01:42.640 --> 2:01:46.640\n But he does, it looks like it's Photoshop,\n\n2:01:46.640 --> 2:01:48.000\n like your brain can't process it.\n\n2:01:48.000 --> 2:01:48.960\n You know the human flag?\n\n2:01:50.320 --> 2:01:50.640\n No.\n\n2:01:50.640 --> 2:01:51.520\n Oh, yeah, yeah, yeah.\n\n2:01:51.520 --> 2:01:51.920\n Sorry.\n\n2:01:51.920 --> 2:01:53.520\n He does human flag pushups.\n\n2:01:55.280 --> 2:01:55.680\n Wow.\n\n2:01:55.680 --> 2:01:58.560\n So he is parallel to the ground, right?\n\n2:01:58.560 --> 2:02:00.640\n He's holding himself up like a flag,\n\n2:02:00.640 --> 2:02:02.640\n but he could also do this while,\n\n2:02:03.280 --> 2:02:05.600\n so he's moving parallel to the earth,\n\n2:02:05.600 --> 2:02:08.320\n side to side while, it's just crazy.\n\n2:02:08.320 --> 2:02:09.280\n That's really difficult.\n\n2:02:09.280 --> 2:02:11.280\n So you're interested in that kind of stuff?\n\n2:02:11.280 --> 2:02:13.520\n No, but I'm saying he's been helping me out,\n\n2:02:13.520 --> 2:02:14.800\n so the guy knows what he's doing.\n\n2:02:14.800 --> 2:02:16.160\n He's just a really impressive kid.\n\n2:02:16.160 --> 2:02:18.320\n I love that kind of stuff, like bodyweight stuff.\n\n2:02:18.320 --> 2:02:21.440\n So my primary mode of working out,\n\n2:02:22.160 --> 2:02:24.400\n it's very like the, you ever seen Leon,\n\n2:02:24.400 --> 2:02:27.440\n like the professional with Natalie Portman in that movie?\n\n2:02:28.960 --> 2:02:31.840\n I have a pull up thing as you push up some pull ups.\n\n2:02:31.840 --> 2:02:34.880\n It's very like, I'm just missing the milk.\n\n2:02:34.880 --> 2:02:36.720\n I like working out at home just like that.\n\n2:02:38.400 --> 2:02:40.480\n The bodyweight stuff, you can go so much with it.\n\n2:02:40.480 --> 2:02:42.880\n And it's super functional for everything else you live in,\n\n2:02:43.440 --> 2:02:45.360\n for life, for living life well.\n\n2:02:46.640 --> 2:02:48.400\n On the other hand, I don't care about functionality.\n\n2:02:48.400 --> 2:02:49.680\n The thing that really bothers me,\n\n2:02:49.680 --> 2:02:52.640\n like I go, I know Joe's thinking of opening up a gym,\n\n2:02:52.640 --> 2:02:53.360\n like a private gym.\n\n2:02:54.000 --> 2:02:57.280\n There's only like one power cage here at the Gold's I go to.\n\n2:02:58.320 --> 2:02:59.600\n I don't know what source that there's only one\n\n2:02:59.600 --> 2:03:01.280\n or that sometimes people aren't using it.\n\n2:03:01.280 --> 2:03:03.360\n I'm like, no one's doing deadlifts in here.\n\n2:03:03.360 --> 2:03:05.360\n No one, just me, it's Gold's.\n\n2:03:06.320 --> 2:03:08.400\n By the way, I don't want to say where,\n\n2:03:08.400 --> 2:03:11.520\n I'll tell you off mic, but there's a few really\n\n2:03:12.400 --> 2:03:14.720\n like ghetto places around Austin\n\n2:03:14.720 --> 2:03:17.760\n that are just like these shitty gyms\n\n2:03:17.760 --> 2:03:19.920\n that nobody wants to go to, but they have a rack.\n\n2:03:19.920 --> 2:03:21.760\n They have like, if you want to lift heavy,\n\n2:03:21.760 --> 2:03:22.240\n that kind of stuff.\n\n2:03:22.240 --> 2:03:23.360\n But are they 24 hours?\n\n2:03:23.360 --> 2:03:24.160\n That's the thing Gold's?\n\n2:03:24.720 --> 2:03:28.080\n Oh, but there are 24 hours in the following way.\n\n2:03:28.880 --> 2:03:30.160\n There's a code.\n\n2:03:30.160 --> 2:03:30.640\n Okay.\n\n2:03:30.640 --> 2:03:31.840\n And you just go in.\n\n2:03:31.840 --> 2:03:32.320\n Okay.\n\n2:03:32.320 --> 2:03:33.760\n And you turn on the lights.\n\n2:03:33.760 --> 2:03:34.160\n That's fine.\n\n2:03:34.160 --> 2:03:34.960\n And then you work out.\n\n2:03:34.960 --> 2:03:36.880\n I don't want to meet people.\n\n2:03:36.880 --> 2:03:39.120\n Exactly, well, that's just not true.\n\n2:03:39.120 --> 2:03:40.720\n Sometimes there's people and they're great.\n\n2:03:40.720 --> 2:03:42.880\n Yeah, and I've had fans come up to me at Gold's\n\n2:03:42.880 --> 2:03:46.240\n and they've all been cool, except, except.\n\n2:03:47.120 --> 2:03:47.840\n Oh no.\n\n2:03:47.840 --> 2:03:48.480\n Except.\n\n2:03:49.040 --> 2:03:49.540\n Except.\n\n2:03:50.480 --> 2:03:54.720\n If I have my headphones on and I'm doing deadlifts,\n\n2:03:55.360 --> 2:03:58.720\n I don't need you to come over, tap my ear,\n\n2:03:58.720 --> 2:04:01.200\n and start giving me critiques about my form.\n\n2:04:01.840 --> 2:04:02.960\n It's actually happened?\n\n2:04:02.960 --> 2:04:03.460\n Yes.\n\n2:04:03.460 --> 2:04:06.180\n Okay, I'm still angry about it.\n\n2:04:07.780 --> 2:04:10.420\n I'm pulling my 150 in peace, thank you.\n\n2:04:11.780 --> 2:04:13.060\n Yeah, people are hilarious.\n\n2:04:13.060 --> 2:04:19.140\n I was recently in, had actually the wildest day ever in my life.\n\n2:04:19.140 --> 2:04:21.540\n That was so many things happened in a row.\n\n2:04:21.540 --> 2:04:24.340\n So I went to a wedding in LA.\n\n2:04:24.340 --> 2:04:24.840\n Andrew?\n\n2:04:25.300 --> 2:04:31.220\n Andrew Schultz's and with Whitney Cummings and Joe Rogan\n\n2:04:31.220 --> 2:04:33.380\n and a bunch of other fascinating people.\n\n2:04:33.380 --> 2:04:36.900\n It's just, speaking of weirdos, there's the comedian,\n\n2:04:36.900 --> 2:04:39.300\n like the reason I find the comedians awesome,\n\n2:04:39.300 --> 2:04:41.620\n one, they're authentic, they're just cool people.\n\n2:04:41.620 --> 2:04:42.420\n Yeah, yeah.\n\n2:04:42.420 --> 2:04:44.020\n But they're also just weird.\n\n2:04:44.020 --> 2:04:47.300\n You don't become a comedian for not being like fucked up\n\n2:04:47.300 --> 2:04:49.220\n in all kinds of different, interesting ways.\n\n2:04:49.220 --> 2:04:50.500\n Anyway, so there's the wedding.\n\n2:04:51.140 --> 2:04:55.300\n I'm, you know me, it was only carbs at the wedding.\n\n2:04:55.300 --> 2:04:56.020\n So I didn't eat.\n\n2:04:56.020 --> 2:04:57.460\n I didn't eat for a long time.\n\n2:04:57.460 --> 2:05:01.220\n So I was like already fasted 20 hours, 25 hours.\n\n2:05:02.420 --> 2:05:06.340\n So this whole story of everything that happens\n\n2:05:06.340 --> 2:05:13.540\n is Lex like 40 hours fasted with Joe Rogan drinking a lot of whiskey.\n\n2:05:13.540 --> 2:05:14.180\n And so.\n\n2:05:14.180 --> 2:05:15.140\n You were drinking too?\n\n2:05:15.140 --> 2:05:15.940\n Oh, heavy.\n\n2:05:15.940 --> 2:05:17.380\n On 40, oh my God, that's crazy.\n\n2:05:17.380 --> 2:05:18.660\n So it is calories.\n\n2:05:18.660 --> 2:05:21.140\n That was my only source of calories is the whiskey.\n\n2:05:21.140 --> 2:05:24.580\n And so I didn't trust myself with carbs when I'm drunk.\n\n2:05:24.580 --> 2:05:27.380\n I just don't enjoy it because I'll forget.\n\n2:05:27.380 --> 2:05:31.380\n And I just enjoy eating like a strict healthy diet when I'm drunk\n\n2:05:31.380 --> 2:05:36.820\n because I'd rather eat more food that's healthy versus not.\n\n2:05:36.820 --> 2:05:40.260\n And so anyway, so then we went to Vegas together\n\n2:05:41.060 --> 2:05:45.300\n and then just kept doing wild thing after another wild thing.\n\n2:05:46.260 --> 2:05:47.860\n Rogan opened up for Whitney Cummings.\n\n2:05:48.420 --> 2:05:50.980\n He just like showed up at a random party that he wasn't invited.\n\n2:05:50.980 --> 2:05:52.340\n And he did a thing.\n\n2:05:52.340 --> 2:05:56.100\n He almost started a fight because some guy said stop spreading.\n\n2:05:56.100 --> 2:05:58.420\n Yelled at him, said stop spreading misinformation.\n\n2:06:00.420 --> 2:06:03.700\n And then we run into David Goggins out of all.\n\n2:06:03.700 --> 2:06:04.980\n This is my first time meeting David.\n\n2:06:05.620 --> 2:06:08.500\n I've talked to David a lot over the phone\n\n2:06:08.500 --> 2:06:10.020\n and we were supposed to do a thing together.\n\n2:06:10.020 --> 2:06:14.260\n And this is me trash out of my mind meeting David for the first time\n\n2:06:14.260 --> 2:06:17.300\n with his incredible wife, Rogan's wife was there.\n\n2:06:17.300 --> 2:06:20.260\n By the way, Joe Rogan's wife, David's wife\n\n2:06:20.260 --> 2:06:23.620\n made me realize that I really want to be married\n\n2:06:24.420 --> 2:06:32.020\n because they're not, they make their partners better.\n\n2:06:32.020 --> 2:06:37.940\n Like that, I was, there's a certain aspect of marriage\n\n2:06:37.940 --> 2:06:41.460\n that I'm afraid of that like your partner takes you away from life.\n\n2:06:41.460 --> 2:06:43.140\n You don't get to experience life as much.\n\n2:06:44.740 --> 2:06:47.140\n But this was like, they were enriching them.\n\n2:06:47.140 --> 2:06:47.540\n I don't know.\n\n2:06:47.540 --> 2:06:50.100\n It's like the world's most powerful support group.\n\n2:06:50.100 --> 2:06:50.740\n It was cool.\n\n2:06:50.740 --> 2:06:56.260\n Anyway, so then of course Drunk Lex challenges Goggins to pushups.\n\n2:06:56.260 --> 2:06:57.860\n I saw this on Instagram, whatever it was.\n\n2:06:57.860 --> 2:06:59.220\n So we're in the middle of the casino.\n\n2:06:59.220 --> 2:07:00.500\n And you're in your suit.\n\n2:07:00.500 --> 2:07:03.700\n In the suit, in the middle of casino, there's a crowd gathering.\n\n2:07:04.820 --> 2:07:07.860\n Like it's Joe Rogan, me and David Goggins\n\n2:07:07.860 --> 2:07:09.460\n and I'm just doing pushups with them.\n\n2:07:09.460 --> 2:07:12.420\n And Rogan is like commentating and yelling and screaming.\n\n2:07:12.420 --> 2:07:13.540\n It was surreal.\n\n2:07:13.540 --> 2:07:17.380\n And just going on to the next thing and next thing and next thing like this\n\n2:07:17.380 --> 2:07:22.660\n and then drove all the way from Vegas back to LA\n\n2:07:23.220 --> 2:07:25.780\n with Joe and Whitney and his wife.\n\n2:07:25.780 --> 2:07:28.180\n And it was like, what is this?\n\n2:07:28.180 --> 2:07:30.100\n And all of it is done in 24 hours.\n\n2:07:30.740 --> 2:07:36.420\n The one valuable lesson is don't fast and drink like excessively.\n\n2:07:37.060 --> 2:07:43.460\n So I've learned that because what happens is liquor hits your mind,\n\n2:07:43.460 --> 2:07:47.380\n my mind, sorry, I'll speak about my particular mind.\n\n2:07:47.380 --> 2:07:51.780\n Like the intellectual part of my brain got hit really hard, really fast.\n\n2:07:51.780 --> 2:07:56.020\n So I was not able to even more so than usual stitch together sentences.\n\n2:07:56.020 --> 2:07:57.380\n I understood everything really well.\n\n2:07:58.500 --> 2:07:59.780\n So like made you an immigrant again.\n\n2:08:03.620 --> 2:08:06.100\n So like meeting David, I want to say so many things.\n\n2:08:06.100 --> 2:08:07.940\n He's so inspiring to me, right?\n\n2:08:07.940 --> 2:08:09.860\n But all I said was like, hello.\n\n2:08:09.860 --> 2:08:16.020\n And I remember like opening my mouth to like try to say more.\n\n2:08:16.020 --> 2:08:19.540\n And I was like, and then I would just close my mouth\n\n2:08:19.540 --> 2:08:20.820\n and not be able to say anymore.\n\n2:08:20.820 --> 2:08:23.940\n Yeah, this is one of the reasons I don't drink ever.\n\n2:08:23.940 --> 2:08:28.340\n Yeah, it removes certain barriers.\n\n2:08:28.340 --> 2:08:31.700\n Like it allows you to maybe have fun that you wouldn't otherwise.\n\n2:08:31.700 --> 2:08:37.220\n But yeah, definitely for personal values, intellectual eloquence.\n\n2:08:37.220 --> 2:08:39.140\n But I also hate being hungover.\n\n2:08:39.140 --> 2:08:40.180\n The hungover part, yeah.\n\n2:08:40.180 --> 2:08:40.820\n That's the worst.\n\n2:08:40.820 --> 2:08:41.220\n Yeah, it's the worst.\n\n2:08:41.220 --> 2:08:43.060\n And you also like, I did this to myself.\n\n2:08:43.780 --> 2:08:44.280\n Yeah.\n\n2:08:45.220 --> 2:08:47.700\n But it also teaches me that this too shall pass\n\n2:08:48.580 --> 2:08:52.340\n because I've been hungover and I've quit drinking so many times in my life\n\n2:08:52.980 --> 2:08:56.500\n that it makes you realize that all the unpleasant feelings,\n\n2:08:57.060 --> 2:08:59.540\n all you have to do is just wait it out and it'll be fine.\n\n2:08:59.540 --> 2:09:03.540\n It took me a long time to realize that that expression means the other thing.\n\n2:09:04.340 --> 2:09:05.140\n What's the other thing?\n\n2:09:05.140 --> 2:09:07.060\n If things are going great, this too shall pass.\n\n2:09:07.940 --> 2:09:08.500\n Yeah.\n\n2:09:08.500 --> 2:09:09.780\n Life of suffering.\n\n2:09:09.780 --> 2:09:11.300\n No, I always thought about it as being more like,\n\n2:09:11.300 --> 2:09:12.740\n don't worry if things are bad, it'll pass.\n\n2:09:12.740 --> 2:09:15.940\n It's also like, if something's going great, it's not going to be this way forever.\n\n2:09:16.900 --> 2:09:18.340\n It's like Bukowski said,\n\n2:09:18.340 --> 2:09:21.620\n love is a fog that fades with the first daylight of reality.\n\n2:09:24.980 --> 2:09:26.020\n Do you think love can last?\n\n2:09:26.580 --> 2:09:27.780\n Oh yeah, we're going to win.\n\n2:09:29.060 --> 2:09:29.940\n Who's we?\n\n2:09:29.940 --> 2:09:30.500\n The good guys.\n\n2:09:32.580 --> 2:09:34.740\n Didn't Hitler also think he's the good guys?\n\n2:09:34.740 --> 2:09:35.240\n He's wrong.\n\n2:09:36.660 --> 2:09:37.860\n Because you know why?\n\n2:09:37.860 --> 2:09:38.260\n Why?\n\n2:09:38.260 --> 2:09:38.740\n You need to win.\n\n2:09:41.460 --> 2:09:43.060\n So you think it's permanent?\n\n2:09:43.060 --> 2:09:46.900\n So this one time the good guys winning, it'll last.\n\n2:09:47.540 --> 2:09:48.260\n It won't pass.\n\n2:09:49.700 --> 2:09:52.420\n Because I think all of it passes, unfortunately.\n\n2:09:52.980 --> 2:09:58.100\n I think we're going to win and win big in the Nazist future.\n\n2:10:00.020 --> 2:10:02.100\n Do you have specific things in mind or no?\n\n2:10:02.100 --> 2:10:06.580\n Or just a sense about human civilization, about society waking up?\n\n2:10:06.580 --> 2:10:15.540\n I don't know about waking up, but I think the increased understanding on all sides of the\n\n2:10:15.540 --> 2:10:24.980\n political spectrum that corporate America and corporate news outlets are self motivated actors\n\n2:10:24.980 --> 2:10:30.900\n and those motivations are often inimical to what others would regard as desirable\n\n2:10:31.460 --> 2:10:34.740\n is something that I think is happening with increasing frequency.\n\n2:10:34.740 --> 2:10:38.820\n So what do you think about the political landscape in general?\n\n2:10:38.820 --> 2:10:44.340\n You had a great conversation with Glenn Beck and he said that he talked to Trump and believes\n\n2:10:44.340 --> 2:10:50.100\n that Donald Trump is definitely running in 2024 or very likely running in 2024.\n\n2:10:50.820 --> 2:10:56.500\n I think he said he thinks he'll have a good chance of winning or I don't remember that,\n\n2:10:56.500 --> 2:10:59.620\n but the fact that he was running was a surprise to you.\n\n2:10:59.620 --> 2:11:03.300\n Do you think Donald Trump would be running in 2024?\n\n2:11:03.300 --> 2:11:11.060\n Given that Glenn Beck has a much better relationship with Trump than I do, to put it mildly,\n\n2:11:11.060 --> 2:11:15.300\n if Glenn Beck is certain this is going to happen, I would defer to Glenn Beck's judgment.\n\n2:11:16.260 --> 2:11:18.660\n Do you think he has a chance of winning? Do you think he'll win?\n\n2:11:18.660 --> 2:11:22.020\n Anyone in a binary political system who's the nominee has a chance.\n\n2:11:22.020 --> 2:11:24.740\n Like whoever the Republican or Democrat has a chance.\n\n2:11:24.740 --> 2:11:29.700\n I think also it's a lot easier to vote for someone that you have voted for in the past.\n\n2:11:29.700 --> 2:11:33.780\n So that's why incumbents have a big advantage. There's not that psychological barrier to cover.\n\n2:11:33.780 --> 2:11:41.060\n I think it's also useful for Trump that he's banished from social media because then he doesn't\n\n2:11:41.060 --> 2:11:46.180\n have to have the responsibility of governing and all the costs of that, because no matter what\n\n2:11:46.180 --> 2:11:48.500\n decisions you make while governing, some people aren't going to like that.\n\n2:11:49.460 --> 2:11:55.140\n So he gets to kind of be above the radar or below the radar rather to some extent.\n\n2:11:55.140 --> 2:12:00.900\n I don't think it's at all a given that he would get the nomination. When I say the good guys are\n\n2:12:00.900 --> 2:12:06.020\n going to win, I certainly don't mean Donald Trump. I don't think victory is going to come\n\n2:12:06.020 --> 2:12:07.620\n as a consequence of Washington.\n\n2:12:07.620 --> 2:12:09.620\n You don't want to make America great again?\n\n2:12:10.660 --> 2:12:14.180\n I think America is great. So do you don't...\n\n2:12:14.180 --> 2:12:16.100\n This is my failed attempt at humor.\n\n2:12:16.100 --> 2:12:21.460\n One of many. There are also hats that Giuliani and Jim Jeffords wore that said,\n\n2:12:21.460 --> 2:12:26.660\n people can look this up. They said, because they were south of the border, make Mexico great again\n\n2:12:26.660 --> 2:12:36.660\n also. Like that to me, it was like, just the syntax there.\n\n2:12:38.660 --> 2:12:46.100\n Okay. So you don't even think you might get the nomination? Who else might?\n\n2:12:46.100 --> 2:12:55.220\n I mean, if you had asked three years out who the nominee in 2020 would be,\n\n2:12:55.220 --> 2:13:00.740\n Donald Trump wasn't even, or 2016 rather, wasn't even on the radar screen. So we have a long way\n\n2:13:00.740 --> 2:13:01.220\n to go.\n\n2:13:01.220 --> 2:13:04.020\n Even two years is a long way to go?\n\n2:13:04.020 --> 2:13:09.220\n Yeah. Especially because we're coming out of COVID. There might be some governor who becomes\n\n2:13:09.220 --> 2:13:15.700\n a rockstar for some reason. Maybe some congressman might have some big moment where they're screaming\n\n2:13:15.700 --> 2:13:19.780\n at somebody and all of a sudden they become a rockstar in the Republican party.\n\n2:13:19.780 --> 2:13:25.940\n Or it could be one of the celebrities we don't think about. I mean, Donald Trump is essentially\n\n2:13:25.940 --> 2:13:33.860\n not a political figure before he ran. So it could be any of the famous right leaning\n\n2:13:34.740 --> 2:13:40.420\n celebrities. I don't even know which way McConaughey leans.\n\n2:13:40.420 --> 2:13:43.620\n No, I think he's a lefty or he's a Democrat, but he's not running.\n\n2:13:43.620 --> 2:13:46.740\n But people like that just might step into the ring.\n\n2:13:46.740 --> 2:13:50.180\n Yeah. I don't think they'd have that much of a chance because I think the Republican party,\n\n2:13:50.180 --> 2:13:55.460\n there's an asymmetry. They'd be much more skeptical of an actor than the Democrats would be\n\n2:13:55.460 --> 2:14:00.660\n because they would regard that actor as coming as a kind of mentoring candidate or whatever.\n\n2:14:00.660 --> 2:14:04.740\n Right. But there's other kinds of celebrity, like Jocko could run as a Republican.\n\n2:14:04.740 --> 2:14:05.860\n That's a good example. Yeah.\n\n2:14:05.860 --> 2:14:08.900\n That would be interesting. So military person.\n\n2:14:08.900 --> 2:14:14.100\n Right. Yeah. But already, for example, Dr. Oz is thinking of running for,\n\n2:14:14.100 --> 2:14:18.260\n is going to run for the Senate in Pennsylvania. And there's already been a lot of research,\n\n2:14:18.820 --> 2:14:23.620\n people slamming him on Twitter and social media for past positions he's taken. So\n\n2:14:26.740 --> 2:14:30.100\n DeSantis is the figure of the moment, but Scott Walker was the figure of the moment\n\n2:14:30.100 --> 2:14:32.580\n in the 2016 cycle and he didn't even make it to Iowa.\n\n2:14:34.740 --> 2:14:38.660\n Yeah. And I wonder what role does COVID play in all of this?\n\n2:14:38.660 --> 2:14:39.140\n Right.\n\n2:14:39.140 --> 2:14:47.140\n In terms of, I'm mostly optimistic and hopeful about the world. Like when I look at the world,\n\n2:14:47.140 --> 2:14:54.020\n I'm excited by most things. I've been a little bit or a lot disappointed by the lack of great\n\n2:14:54.020 --> 2:15:02.500\n leadership in a time of trouble. Because to me, one of the great things about a difficult time\n\n2:15:02.500 --> 2:15:08.660\n is it brings out the great leaders. Again, it's the up and down things. Like you don't want to\n\n2:15:08.660 --> 2:15:16.260\n ask for war. You don't want to ask for pandemics, but when they happen, it's a great opportunity\n\n2:15:16.260 --> 2:15:20.580\n for the human spirit to flourish. And the fact that it didn't quite in the way that I\n\n2:15:20.580 --> 2:15:25.540\n hoped it would is disappointing. I think there's still time too, because people are trying to\n\n2:15:25.540 --> 2:15:34.580\n figure out what to do as we emerge from the fog. Yeah. So I'm excited by 2024. Somebody said this\n\n2:15:35.140 --> 2:15:41.460\n dark, cynical thing. I hope this is not true, but like that there was some doubt about the results\n\n2:15:41.460 --> 2:15:51.460\n of the election in 2020, that in 2024, both sides, like it will just start becoming standard to\n\n2:15:51.460 --> 2:15:57.620\n completely reject the results of an election no matter who wins. Well, that's my perspective. I\n\n2:15:57.620 --> 2:16:02.340\n don't regard elections as legitimate. And I see what you're saying, not in the terms of that\n\n2:16:02.340 --> 2:16:06.180\n basically the process itself was illegitimate. Yes. There's like cheating or something. Yeah.\n\n2:16:06.180 --> 2:16:12.100\n But I think that that's pretty much a given. It has been a given. Like I see the Republicans\n\n2:16:12.100 --> 2:16:16.900\n often say, oh, they got all these illegals to vote. Or the Democrats will say the voting machines\n\n2:16:16.900 --> 2:16:22.660\n were hacked or the media, so on and so forth. Because despite all the people flapping their\n\n2:16:22.660 --> 2:16:27.460\n gums about democracy, they only like democracy when it gives them the results that they want.\n\n2:16:28.500 --> 2:16:32.260\n Can I ask you about something else that Glenn Beck said that I thought was really interesting?\n\n2:16:32.260 --> 2:16:37.780\n Sure. I agree with him very much on this. And it was refreshing to hear, although he kind of made\n\n2:16:37.780 --> 2:16:44.500\n it turn into a point about why Trump is great or whatever. But the point was the following,\n\n2:16:44.500 --> 2:16:49.780\n which is he doesn't want to talk to anybody who can't say at least one nice thing about\n\n2:16:51.300 --> 2:16:56.020\n everyone. So like, if you don't like Donald Trump, if you don't like Joe Biden,\n\n2:16:57.300 --> 2:17:02.340\n you should still be able to say one nice thing, like legitimate nice, not just like a dismissive\n\n2:17:02.340 --> 2:17:09.620\n nice thing, but legitimately say, what is one nice thing they did or like, or who they are as a person?\n\n2:17:09.620 --> 2:17:15.700\n Not like saying Donald Trump is funny sometimes. Like no, like legitimate, where you really mean\n\n2:17:15.700 --> 2:17:20.980\n it. And it's been really troubling to me how few people are able to do that about political figures.\n\n2:17:21.540 --> 2:17:27.620\n I had a lot of people, I think I tweeted something like this leading up to the election,\n\n2:17:28.180 --> 2:17:34.260\n saying like, you should be able to say something nice about both Joe Biden and Donald Trump. And\n\n2:17:34.260 --> 2:17:43.860\n I've had old friends, I don't want to say specific, I guess, to call them out, but they, several\n\n2:17:43.860 --> 2:17:48.340\n people, and one in particular, like wrote me this long, like several page email.\n\n2:17:48.340 --> 2:17:49.380\n It was Sam?\n\n2:17:49.380 --> 2:17:50.420\n It was Sam Harris.\n\n2:17:50.420 --> 2:17:51.380\n Was it Sam Harris?\n\n2:17:51.380 --> 2:17:59.700\n Sam Harris. No. But I have a lot of conversations with Sam Harris now and Joe on both sides. It's\n\n2:17:59.700 --> 2:18:06.180\n like the devil and the angel on both my, I don't know which one is which, but they're both devils.\n\n2:18:06.180 --> 2:18:08.580\n Different kinds of devils. Yeah, that's fair.\n\n2:18:09.460 --> 2:18:16.020\n And they said, how could you say, how could you even consider like that there's something\n\n2:18:16.020 --> 2:18:17.620\n positive about Donald Trump?\n\n2:18:17.620 --> 2:18:24.100\n Yeah, here's an easy one. He has three wives with three kids with each, but the kids get along.\n\n2:18:24.100 --> 2:18:29.300\n I think that's really commendable that Donald Trump Jr. and Eric Trump and Barron can all get\n\n2:18:29.300 --> 2:18:33.460\n along with each other, given the circumstances. I think that speaks to something as someone as a\n\n2:18:33.460 --> 2:18:35.140\n father, Ivanka.\n\n2:18:35.140 --> 2:18:40.740\n So on the family level, and I see the same thing with actually, one of the reasons I\n\n2:18:41.620 --> 2:18:47.780\n always found Joe Biden fascinating is he's had a lot of really traumatic things happen in his life.\n\n2:18:47.780 --> 2:18:48.280\n Yeah.\n\n2:18:48.280 --> 2:18:55.400\n And if I shit my pants in front of the Pope, I'd be traumatized too.\n\n2:18:57.400 --> 2:19:03.160\n I'm talking to a master troll about something sensitive and beautiful that is a man suffering\n\n2:19:03.160 --> 2:19:03.880\n with a loss.\n\n2:19:03.880 --> 2:19:06.440\n I kind of know what he feels like right now. I'm pretending to the Pope.\n\n2:19:08.440 --> 2:19:14.040\n This chair is ruined. Sorry, Elon. You have to sit in it.\n\n2:19:14.040 --> 2:19:17.160\n You have to sit in it.\n\n2:19:17.160 --> 2:19:20.280\n Why is this chair full? I feel like I'm sitting in a swamp.\n\n2:19:22.200 --> 2:19:26.600\n Lex, you have stuff to show. Can you afford a good chair? I'll send you one for Tesla.\n\n2:19:26.600 --> 2:19:28.120\n That's a pretty good Elon impression.\n\n2:19:30.200 --> 2:19:39.560\n But yeah, one criticism I told Joe, Rogan, he has trouble finding one positive thing to say about\n\n2:19:39.560 --> 2:19:48.280\n Joe Biden, for example, and I just don't like that. I'm a big believer in the shit sandwich\n\n2:19:49.240 --> 2:19:50.120\n sticking on topic.\n\n2:19:50.120 --> 2:19:53.560\n Here's an easy one. I think Joe Biden clearly is a very amiable person.\n\n2:19:54.440 --> 2:19:55.400\n What's amiable?\n\n2:19:55.400 --> 2:19:58.920\n Gets along with people. It seems really clear that maybe before president,\n\n2:19:58.920 --> 2:20:01.160\n because it's different when you're the president, but that he could call a lot\n\n2:20:01.160 --> 2:20:04.440\n of these Republican senators, get them on the phone and have a conversation with them.\n\n2:20:04.440 --> 2:20:06.280\n Yeah, and it's not some kind of manipulation.\n\n2:20:06.280 --> 2:20:08.280\n To some extent it is because they're all politicians,\n\n2:20:08.280 --> 2:20:13.080\n but he clearly seemed to be able to get, wasn't like an ideologue.\n\n2:20:13.720 --> 2:20:18.120\n Yeah. Yeah. I mean, but there's, I mean, maybe I'm a sucker for that kind of thing,\n\n2:20:18.120 --> 2:20:23.800\n but the blue collar thing, like riding the train, you know, there's ways to connect with people\n\n2:20:23.800 --> 2:20:28.680\n and not seeing them as equals, no matter where their walks of life are.\n\n2:20:28.680 --> 2:20:36.280\n And I love it when presidents do that to some degree because of the wealth under which Donald\n\n2:20:36.280 --> 2:20:41.320\n Trump existed for a lot of his recent life. He's less able to do that quite naturally.\n\n2:20:43.240 --> 2:20:44.920\n Maybe sometimes Obama wasn't quite able to do that.\n\n2:20:44.920 --> 2:20:48.200\n That's a good question. Who's more blue collar, Trump or Biden?\n\n2:20:48.200 --> 2:20:51.080\n And you can easily make the case for both, I think.\n\n2:20:51.080 --> 2:20:56.760\n You could. No, not the blue collar, but like literally be able to fit in at a bar,\n\n2:20:56.760 --> 2:20:58.280\n at a local bar and just like.\n\n2:20:58.920 --> 2:20:59.880\n I can see both of them.\n\n2:20:59.880 --> 2:21:01.560\n Yeah, you're right. I could see both of them.\n\n2:21:01.560 --> 2:21:02.200\n Yeah.\n\n2:21:02.200 --> 2:21:03.880\n In fact, Obama doesn't quite.\n\n2:21:03.880 --> 2:21:05.240\n No, cause he's got that Ivy league thing.\n\n2:21:05.240 --> 2:21:06.200\n Yeah, the Ivy league thing.\n\n2:21:06.200 --> 2:21:06.700\n Yeah, yeah.\n\n2:21:08.120 --> 2:21:09.320\n Yeah, you're right.\n\n2:21:10.440 --> 2:21:12.040\n Somehow Donald Trump can too.\n\n2:21:12.040 --> 2:21:15.000\n Oh, easily. Yeah, you can see him having a beer with the guys and yelling at the screen.\n\n2:21:15.000 --> 2:21:17.240\n This is bullshit. Change the channel.\n\n2:21:18.120 --> 2:21:23.560\n Yeah. I mean, I hope people do that. I think that's one of the most unpleasant things to me\n\n2:21:23.560 --> 2:21:30.840\n is they're not able to empathize with the fact that half the country voted for another person.\n\n2:21:30.840 --> 2:21:32.920\n Well, it's also then it's just a bad strategy.\n\n2:21:32.920 --> 2:21:37.720\n If you can't figure out why half the country is voting for someone you guard as like a demon,\n\n2:21:37.720 --> 2:21:39.960\n well then how are you going to supposed to fight this demon?\n\n2:21:39.960 --> 2:21:42.680\n Like, you know, when I did your reader, the North Korea book,\n\n2:21:42.680 --> 2:21:48.360\n it's like, don't you want to understand how these people get to where they got?\n\n2:21:48.360 --> 2:21:50.120\n It's, no one's saying that he's a good person,\n\n2:21:50.120 --> 2:21:52.760\n but like there's a logic to their, there's a method to their madness.\n\n2:21:53.720 --> 2:21:56.200\n You've talked about national divorce a few times.\n\n2:21:56.200 --> 2:22:00.120\n I've seen a couple of videos recently where you're responding to articles.\n\n2:22:00.120 --> 2:22:06.680\n It's, it's kind of cool. Can you, can you talk about this idea of national divorce\n\n2:22:07.240 --> 2:22:11.800\n and as it stands today, arguing for it, maybe, and if you could,\n\n2:22:12.840 --> 2:22:17.080\n just out of curious in the context of those videos, if you can steal men and argument against.\n\n2:22:18.440 --> 2:22:24.600\n So I was the first one to kind of bring this issue back into the national conversation.\n\n2:22:24.600 --> 2:22:29.720\n I wrote a piece for Observer in 2016. Then Jesse Kelly had a piece a few months after that.\n\n2:22:29.720 --> 2:22:33.800\n David Boyd just recently did a piece on his stuff stack earlier this year.\n\n2:22:34.440 --> 2:22:41.080\n And it's become enough of a mainstreamed idea that paleontology outlets like the National Review\n\n2:22:41.080 --> 2:22:45.960\n have felt the need to respond to them. So the point being that America has had at least two\n\n2:22:45.960 --> 2:22:50.680\n cultures since the beginning and that there's absolutely no reason. And these cultures in\n\n2:22:50.680 --> 2:22:55.960\n recent years, and this was in 2016, not mentioned 2021, have been increasingly antagonistic toward\n\n2:22:55.960 --> 2:23:01.080\n one another and have even lost the ability to communicate. They're using language in different\n\n2:23:01.080 --> 2:23:07.320\n ways and that there's no reason for this to continue any further. And, you know, just,\n\n2:23:08.360 --> 2:23:13.640\n you live your life, we'll live ours and, you know, goodbye and good luck. There's no harm,\n\n2:23:13.640 --> 2:23:20.120\n no ill will. Now there's lots of arguments against them. Some of those are, are completely,\n\n2:23:20.120 --> 2:23:26.200\n I think, stupid. The stupidest one is, well, that's what China wants. Okay. Well, I mean,\n\n2:23:26.200 --> 2:23:30.200\n I'm not going to live my life saying I'm just going to do the opposite of whatever China wants.\n\n2:23:30.920 --> 2:23:35.400\n That's not logic. That's not a good pathway. Now, I'm not saying they're right or wrong,\n\n2:23:35.400 --> 2:23:39.400\n but that's not a reason one way or another. Yeah. You bring up China or Russia, you know,\n\n2:23:39.400 --> 2:23:45.960\n that's exactly what China or Russia want. But sort of the strong way to phrase that is\n\n2:23:45.960 --> 2:23:58.920\n is it weakens America. Like not just the one America, but like both sides in the divorce\n\n2:23:58.920 --> 2:24:05.320\n will be much weaker than they individually were together. So in that sense, not that you have to\n\n2:24:06.120 --> 2:24:11.560\n care about what China thinks, but like it's a step, it's a big step backwards. Yes. I think\n\n2:24:11.560 --> 2:24:15.640\n in the short term, it is absolutely a big step backwards in terms of power. There's no question\n\n2:24:15.640 --> 2:24:20.200\n that when you're trying to reestablish a society, there's going to be a transition period. That\n\n2:24:20.200 --> 2:24:24.760\n transition period is going to be costly. Each side starts wondering, wait a minute, why are we still\n\n2:24:24.760 --> 2:24:27.960\n doing this? We don't have to anymore. We're not living with them, so on and so forth. So that's\n\n2:24:27.960 --> 2:24:35.800\n going to be a concern. I don't think that the whole point of America or even a large or primary\n\n2:24:35.800 --> 2:24:40.280\n point of America is to be a bulwark against Chinese power. And there's going to be very few\n\n2:24:40.280 --> 2:24:47.320\n people on earth, given my work, who have as much informed hatred and contempt for the Chinese\n\n2:24:47.320 --> 2:24:55.160\n government as I do. Certainly, next to the North Korean people, maybe the people from Eritrea,\n\n2:24:55.160 --> 2:24:59.960\n there's few populations who I was worried about as the people under the rule of the Red Chinese.\n\n2:25:00.520 --> 2:25:05.320\n My steel man argument is there's no way this is going to be peaceful because the lines don't\n\n2:25:05.320 --> 2:25:11.240\n separate out well. So all you're doing is basically just replicating the problem because the disparity\n\n2:25:11.240 --> 2:25:16.120\n isn't between during the Civil War, North and South, it's between New York City and upstate\n\n2:25:16.120 --> 2:25:21.800\n New York or between Chicago, downstate Chicago. Once you get outside of LA and Sacramento,\n\n2:25:22.760 --> 2:25:27.800\n California in many ways is like Kentucky, so it doesn't make sense. So that's a strong argument.\n\n2:25:27.800 --> 2:25:32.200\n I mean, you've talked about that this process will be painful. It can be painful. And we're\n\n2:25:32.200 --> 2:25:36.840\n not just talking about violence. It could be just, even the Civil War, you could divide it\n\n2:25:37.560 --> 2:25:44.280\n somewhat cleanly. Obviously, the kind of national divorce you might be suggesting is that people are\n\n2:25:44.280 --> 2:25:47.640\n living amongst each other. So you have to literally move. It's complicated.\n\n2:25:47.800 --> 2:25:55.560\n Right. So that is a very strong argument. I think a cogent argument against it. Two is it's not just China,\n\n2:25:55.560 --> 2:26:01.640\n it's that there's a lot of bad actors in the world who maybe aren't, like China certainly wants to carry\n\n2:26:01.640 --> 2:26:07.880\n itself and have an appearance at least on the world stage as civilized and a leader. There's lots of\n\n2:26:07.880 --> 2:26:13.240\n smaller countries who without us are going to feel comfortable doing some very nefarious things.\n\n2:26:14.200 --> 2:26:18.440\n And they're not going to be scared of us anymore. And so that would be a bigger concern in many\n\n2:26:18.440 --> 2:26:25.000\n regards than China. So I think that's a reasonable one. It could be that both sides, if this happens,\n\n2:26:25.000 --> 2:26:30.280\n are going to, instead of work toward better, the things that make each side bad would get worse.\n\n2:26:30.280 --> 2:26:35.560\n Yeah. And that's having those pushed towards the malevolent extremes is, I think, a very legitimate\n\n2:26:35.560 --> 2:26:40.520\n criticism and a concern. I mean, as you suggested, there's no guarantee that won't happen.\n\n2:26:40.520 --> 2:27:05.800\n Correct at all. Also, there's a, I think, a reasonable argument to make. So those are the\n\n2:27:07.400 --> 2:27:09.320\n biggest ones, I would say.\n\n2:27:09.320 --> 2:27:19.240\n And still, what is the case for national divorce and along which lines? So like in making the case\n\n2:27:19.240 --> 2:27:24.920\n for national divorce, if it is desired, based on which kind of ideas do you think it should be\n\n2:27:26.120 --> 2:27:26.840\n carried through?\n\n2:27:26.840 --> 2:27:31.320\n Honestly, I don't know that it has to be idea based. Like for example, when Czechoslovakia\n\n2:27:31.320 --> 2:27:40.360\n broke up, when Norway and Sweden broke up, it wasn't really ideological. It was more cultural. So\n\n2:27:41.000 --> 2:27:45.240\n I always say divorce into two, but it would probably make more sense if it was like five,\n\n2:27:46.200 --> 2:27:51.880\n because the Northeast, certainly New England, has their own culture. The West Coast has their own\n\n2:27:51.880 --> 2:27:59.560\n kind of culture. I don't know. The thing is, in any kind of persuasion technique, right? Like once\n\n2:27:59.560 --> 2:28:05.000\n people start, there's a difference between convincing someone they want to buy a car\n\n2:28:05.000 --> 2:28:08.200\n and what features you want. So if you're at the point where we're arguing about the features,\n\n2:28:08.200 --> 2:28:11.640\n then my work here is done. Do you know what I mean? Like I don't have a dog in the fight\n\n2:28:11.640 --> 2:28:14.440\n in terms of what it's going to look like. I just want to get to the point where you're at least\n\n2:28:14.440 --> 2:28:19.160\n considering seriously the idea of breaking up America. And I would encourage people to go look\n\n2:28:19.160 --> 2:28:24.200\n at my article to see, which I'm sure the arguments still hold five years later.\n\n2:28:24.200 --> 2:28:31.400\n Do you have a kind of vision of which of the two or which of the five, like do you actually have\n\n2:28:31.400 --> 2:28:40.120\n specific cultures or ideas? I'll tell you exactly. If I told you, and everyone listening, in 2014,\n\n2:28:40.920 --> 2:28:45.320\n we weren't that long ago, it was not long ago, which of these two things is more likely to happen?\n\n2:28:46.040 --> 2:28:53.400\n 2014. Texas secedes or declares secession from America or Donald Trump gets elected president.\n\n2:28:53.400 --> 2:28:58.680\n Everyone's voting for Texas. Like in terms of prediction, which is more likely. So we had this\n\n2:28:58.680 --> 2:29:02.840\n one. So it's not at all unlikely we're going to have this one. I don't know if that logic carries\n\n2:29:02.840 --> 2:29:09.240\n through. You can't just say, here's an unlikely thing that happened, therefore anything can happen.\n\n2:29:09.240 --> 2:29:12.440\n I just said, you just earlier said anything could happen this episode, didn't you?\n\n2:29:12.440 --> 2:29:15.480\n Life is suffering. I wasn't listening to half the things you're saying.\n\n2:29:15.480 --> 2:29:16.520\n You said it.\n\n2:29:16.520 --> 2:29:17.160\n I said it.\n\n2:29:17.160 --> 2:29:18.360\n Yes, you said anything could happen.\n\n2:29:18.360 --> 2:29:22.520\n I'm definitely not here. I'm like you with podcasts. I do a podcast, but I don't listen to\n\n2:29:22.520 --> 2:29:29.800\n it. That's why I'm talking. Okay. So yeah, it can happen. But in which, I guess I'm asking,\n\n2:29:29.800 --> 2:29:30.840\n would you stay in Texas?\n\n2:29:30.840 --> 2:29:33.640\n A hundred percent. And I'd run for office probably. It'd be fun.\n\n2:29:35.400 --> 2:29:37.000\n I'm going to be the first president of Texas.\n\n2:29:37.880 --> 2:29:45.560\n I attended a debate between Yaron Brooks and Yoram Hazony. I don't know if you know who that is.\n\n2:29:45.560 --> 2:29:46.360\n The nationalist guy.\n\n2:29:46.360 --> 2:29:49.000\n The nationalist, yeah. He wrote a book called The Virtue of Nationalism.\n\n2:29:49.000 --> 2:29:50.040\n Yeah, I read that book.\n\n2:29:50.040 --> 2:29:53.240\n And then I actually did a podcast with him. They did a debate.\n\n2:29:53.800 --> 2:29:54.840\n Oh, they both run here?\n\n2:29:54.840 --> 2:29:55.320\n Mm hmm.\n\n2:29:55.320 --> 2:29:55.880\n Okay.\n\n2:29:55.880 --> 2:30:01.160\n It was quite interesting. And I tried to wear my Michael Malice hat. So the...\n\n2:30:01.160 --> 2:30:04.920\n You're wearing it now. You borrowed that from me.\n\n2:30:04.920 --> 2:30:14.120\n Yeah. It's funny because the metaphor applies across all of these levels of collectivism.\n\n2:30:14.120 --> 2:30:20.440\n So he was arguing for the power of nation. So he would be arguing against national divorce.\n\n2:30:20.440 --> 2:30:26.360\n But he was also arguing for marriage, the power of actual marriage between individuals.\n\n2:30:28.360 --> 2:30:34.040\n I think he's a conservative. What I really like about him is there's a clear philosophy\n\n2:30:34.040 --> 2:30:40.280\n of conservatism that he expresses. And I think a lot of people get behind that philosophy.\n\n2:30:40.280 --> 2:30:46.440\n Because to me conservatism and liberalism often is very kind of used loosely.\n\n2:30:46.440 --> 2:30:46.840\n Yes.\n\n2:30:46.840 --> 2:30:51.400\n He has a clear philosophy that he's expressing there and is grounded in tradition.\n\n2:30:51.400 --> 2:30:56.520\n He has a lot of value in tradition. And so it's the thing you said about America.\n\n2:30:57.160 --> 2:31:04.840\n Like one of the arguments against national divorce is like, listen, we've been at it for a while.\n\n2:31:04.840 --> 2:31:08.920\n Like there is a lot of value in the fact that we've been at it for a while.\n\n2:31:08.920 --> 2:31:13.320\n Don't just throw it all away all the time. So he says like philosophically, he seems\n\n2:31:13.320 --> 2:31:20.040\n in a lot of walks of life, revolution should be avoided as much as possible.\n\n2:31:20.040 --> 2:31:21.000\n I agree.\n\n2:31:21.000 --> 2:31:26.520\n And so it's kind of interesting. So he makes the case that there's something fundamentally\n\n2:31:26.520 --> 2:31:33.960\n powerful about the nation. That it's a nice way to group a culture.\n\n2:31:33.960 --> 2:31:39.880\n And so the national divorce, I guess, goes against that. I mean, do you find some aspect\n\n2:31:39.880 --> 2:31:43.880\n of the virtue of nationalism, as you will put it, powerful?\n\n2:31:44.840 --> 2:31:47.720\n Well, powerful in a good sense.\n\n2:31:47.720 --> 2:31:51.960\n In a good sense. So sorry, yeah, in a good sense, like it brings out the best in humans.\n\n2:31:51.960 --> 2:31:55.080\n I don't know about the best, but it certainly brings out good things. I have that line I\n\n2:31:55.080 --> 2:31:58.360\n always say about I love my country. I hate the government because I love my country.\n\n2:31:58.360 --> 2:32:00.840\n Yeah. So there is a love of country.\n\n2:32:00.840 --> 2:32:06.040\n I think it's, but I don't know that that's the, I think it's also the case because the\n\n2:32:06.040 --> 2:32:11.080\n country happens to be America. Like, I don't know if I was living in, you know, whatever,\n\n2:32:11.080 --> 2:32:15.960\n I don't want to insult someone's country. Canada, yeah. If I was living in Canada, I\n\n2:32:15.960 --> 2:32:17.080\n don't know that it'd be the Ochoa Patriot.\n\n2:32:17.080 --> 2:32:20.360\n This is a guy who calls basically every other country shithole country.\n\n2:32:20.360 --> 2:32:25.240\n Yeah, that's true. That's the fact. Yeah. So it's either, you're either, there's two\n\n2:32:25.240 --> 2:32:27.160\n types of countries, Texas or shitholes.\n\n2:32:27.160 --> 2:32:32.520\n Oh, wow. You went full Texas. So you're okay burning the Northeast to the ground at this\n\n2:32:32.520 --> 2:32:33.080\n point.\n\n2:32:33.560 --> 2:32:39.080\n Okay. I'm hoping for it. What they've done to New York City, I will never forgive these\n\n2:32:39.080 --> 2:32:45.240\n people. And I hope that they suffer enormously consequences for what they've done to New\n\n2:32:45.240 --> 2:32:52.520\n York. It's unconscionable, the assault that they've done and no remorse over how many\n\n2:32:52.520 --> 2:32:57.320\n creative outlets that they've destroyed.\n\n2:32:57.320 --> 2:32:59.640\n Yeah, it's the cultural hub, cultural center of the world.\n\n2:33:01.160 --> 2:33:07.080\n New York was the, this was the place where you go to put up your shingle and move the\n\n2:33:07.080 --> 2:33:12.440\n needle and make things happen. And I would understand if it was like, okay, we got to\n\n2:33:12.440 --> 2:33:16.600\n suffer through this for a year, but we're going to make sure all these businesses have\n\n2:33:16.600 --> 2:33:21.720\n a kind of safety net to make sure that they kind of get through and survive this, which\n\n2:33:21.720 --> 2:33:26.200\n they did to the banks in 2008, for example. And I'm saying this as an anarchist and there\n\n2:33:26.200 --> 2:33:33.320\n was none of that. So I burn it down and salt the earth. It's because it's like watching\n\n2:33:33.320 --> 2:33:37.160\n like a zombie. It's unnatural. It's an abomination.\n\n2:33:37.880 --> 2:33:42.840\n So I mean, sort of on the on the white pill side of things, I don't know about you, maybe\n\n2:33:42.840 --> 2:33:48.680\n I have a sense that both Silicon Valley that for me personally, maybe I have the same intensity\n\n2:33:48.680 --> 2:33:56.040\n of feelings you do about New York. It's just disappointing to see it be consumed with cynicism\n\n2:33:56.040 --> 2:34:00.920\n and a lot of other paralyzing forces. But I still have hope for that place. I think\n\n2:34:02.120 --> 2:34:11.720\n maybe it's the Yoram kind of tradition hope that through momentum, the strong reemerges.\n\n2:34:11.720 --> 2:34:18.440\n So like I have hope for New York. I think New York will continue like not maybe on the\n\n2:34:18.440 --> 2:34:24.680\n scale of years, but a scale of decades. It'll be ups and downs where it reemerges as a cultural\n\n2:34:24.680 --> 2:34:30.280\n center. I just can't imagine a place like New York is like Paris. There's going to be\n\n2:34:30.280 --> 2:34:33.800\n long stretches of time where it leads the world.\n\n2:34:34.280 --> 2:34:36.600\n Paris has not been a cultural hub for a very long time.\n\n2:34:36.600 --> 2:34:36.920\n Yeah.\n\n2:34:36.920 --> 2:34:41.880\n You know, the days of Matisse and Picasso and Gertrude Stein are long gone.\n\n2:34:44.680 --> 2:34:46.280\n It still is a hub.\n\n2:34:46.280 --> 2:34:47.960\n Even London isn't London.\n\n2:34:47.960 --> 2:34:48.200\n Yeah.\n\n2:34:48.200 --> 2:34:50.120\n You know, you're not the...\n\n2:34:50.120 --> 2:34:54.680\n But what is then? London is still London. Paris is still Paris. It's just not the Paris of\n\n2:34:54.680 --> 2:35:01.560\n old. It's not London of old. London is still a place. It's a tech hub. It's a fashion hub.\n\n2:35:01.560 --> 2:35:04.440\n It's a music hub. I mean, it's still a pretty strong hub.\n\n2:35:04.440 --> 2:35:09.240\n Yeah, but not like during the Beatles era or during the Sex Pistols era.\n\n2:35:09.240 --> 2:35:13.720\n But it could be just us romanticizing the past. Because what is a hub then?\n\n2:35:13.720 --> 2:35:19.800\n No, it's not romanticizing the past because a hub is the place where everyone on earth\n\n2:35:19.800 --> 2:35:25.320\n or our eyes are on you. So in the late 60s, in the mid 60s, you see the British Invasion,\n\n2:35:25.320 --> 2:35:29.800\n you know, the Kinks and all these other bands coming out of Great Britain, like they were\n\n2:35:29.800 --> 2:35:36.280\n the innovators. This was the place that was happening.\n\n2:35:36.280 --> 2:35:37.080\n In that sense, like...\n\n2:35:37.080 --> 2:35:38.840\n And Brooklyn, you know, 15 years ago.\n\n2:35:41.400 --> 2:35:47.400\n But I guess maybe in that sense, in the 21st century, geographical hubs are becoming a\n\n2:35:47.400 --> 2:35:53.160\n thing of the past. So like, you can be a hub in the digital space now. So like it's not,\n\n2:35:53.160 --> 2:35:54.280\n maybe you'll never have...\n\n2:35:54.280 --> 2:35:59.480\n I don't think... I think there will always be... I mean, what I'm saying, digital space\n\n2:35:59.480 --> 2:36:03.880\n makes it easier for, let's suppose, Cleveland to be a hub. Because all you need is like\n\n2:36:03.880 --> 2:36:07.720\n 10 people who happen to live in Cleveland or, you know, Akron was a hub, a minor hub.\n\n2:36:07.720 --> 2:36:12.520\n All it takes is 10 to 50 people to create a... Yeah, and maybe even less. Maybe it's\n\n2:36:12.520 --> 2:36:15.160\n just two or three or four people.\n\n2:36:15.160 --> 2:36:19.160\n I mean, there's been no shortage of articles talking about Austin and what's happening\n\n2:36:19.160 --> 2:36:24.840\n here. And I know some of Joe's plans and you and I and Blair and all these other people\n\n2:36:24.840 --> 2:36:28.520\n that we know. My buddy Andrew Heaton moved here. He's just one of the best people I know.\n\n2:36:28.520 --> 2:36:30.200\n It's just, I'm really, really excited.\n\n2:36:30.920 --> 2:36:33.240\n Can I ask you some weird thing about friendship?\n\n2:36:33.240 --> 2:36:34.040\n Of course.\n\n2:36:34.040 --> 2:36:37.880\n Because you mentioned Sam, he's Mr. Harris to you.\n\n2:36:37.880 --> 2:36:44.520\n Didn't that bother you how he went after Joe? He's like, oh, in case you guys have brain\n\n2:36:44.520 --> 2:36:48.360\n damage from watching Rogan's last episode, like watch, here's the answer. And it's just\n\n2:36:48.360 --> 2:36:49.800\n like... Oh, like digs like that.\n\n2:36:49.800 --> 2:36:51.240\n Yeah, yeah. I didn't like that.\n\n2:36:51.240 --> 2:36:55.080\n I didn't like that either. I think Sam doesn't like it either about himself.\n\n2:36:55.080 --> 2:36:55.480\n Okay.\n\n2:36:56.440 --> 2:36:57.640\n He regrets those things.\n\n2:36:57.640 --> 2:37:04.120\n Because it's very easy to say from his perspective, look, this isn't the full side. Rogan didn't\n\n2:37:04.120 --> 2:37:07.720\n show you the full side of the story. Here's the other side of the story. Please watch\n\n2:37:07.720 --> 2:37:09.800\n this and be informed. That's a very reasonable thing to say.\n\n2:37:10.920 --> 2:37:16.520\n Yeah, I don't quite understand this. So they do this about each other now. I'll put three\n\n2:37:16.520 --> 2:37:22.600\n people on the table, which is Joe Rogan, Sam Harris, and Brett Weinstein. And they have\n\n2:37:22.600 --> 2:37:28.680\n a way of talking like the other person is creating a lot of harm. Like, publicly we'll\n\n2:37:28.680 --> 2:37:35.560\n say things like that. And I understand there's emotion in it. But like, these are human beings\n\n2:37:37.320 --> 2:37:39.480\n that are friends of yours.\n\n2:37:39.480 --> 2:37:43.160\n But I'll go the other way. Let's suppose it is true that Joe's doing a lot of harm,\n\n2:37:43.160 --> 2:37:49.000\n spreading misinformation. Being sarcastic isn't going to be persuasive. Whereas if you're\n\n2:37:49.000 --> 2:37:55.480\n like, he's wrong, here's the facts, or be informed. To me, but then I'm not Sam Harris.\n\n2:37:55.480 --> 2:37:58.200\n He's got a bigger audience than me, so maybe he's the one who's right and I'm wrong.\n\n2:37:58.200 --> 2:37:59.960\n No, he's just human.\n\n2:38:00.520 --> 2:38:01.480\n Okay, well, I can't relate.\n\n2:38:02.280 --> 2:38:07.400\n Well, have you seen your Twitter lately? I mean, you have a lot of fun on Twitter. I\n\n2:38:07.400 --> 2:38:08.840\n feel like Twitter lets...\n\n2:38:08.840 --> 2:38:12.440\n I've never done that with someone I'm friends with. I never would.\n\n2:38:13.640 --> 2:38:15.000\n Okay, let's put that on record.\n\n2:38:15.000 --> 2:38:16.040\n It is on record.\n\n2:38:16.040 --> 2:38:19.000\n Because if there's an issue with you, I'm getting you on the phone.\n\n2:38:19.000 --> 2:38:21.080\n Yeah. Good.\n\n2:38:21.080 --> 2:38:25.080\n Because then I'm not backing you into a corner publicly. It doesn't make any sense strategically.\n\n2:38:25.080 --> 2:38:32.200\n Yeah, and actually, Brett Weinstein tweeted something sort of criticizing something, I\n\n2:38:32.200 --> 2:38:36.600\n did already forgot what. But he texted me first saying like, is it okay if I tweet this?\n\n2:38:36.600 --> 2:38:37.080\n Yeah.\n\n2:38:37.080 --> 2:38:41.400\n And I said, yep. I was excited.\n\n2:38:41.400 --> 2:38:41.640\n Yeah.\n\n2:38:42.200 --> 2:38:47.160\n But I think there's some level of just be compassionate privately and be compassionate\n\n2:38:47.160 --> 2:38:48.120\n publicly.\n\n2:38:48.120 --> 2:38:49.320\n Or be civil.\n\n2:38:50.280 --> 2:38:56.280\n Civil. For some reason, I don't like the word civility because it's polite.\n\n2:38:56.280 --> 2:39:00.360\n Or be cordial, is that better?\n\n2:39:00.360 --> 2:39:01.400\n No, what I mean is like...\n\n2:39:02.760 --> 2:39:03.720\n It seems phony to you?\n\n2:39:03.720 --> 2:39:08.360\n It seems phony. Like you should radiate love in whatever way. So even if you're rough with\n\n2:39:08.360 --> 2:39:14.200\n the other person, you should still show like respect and love for that person. And that\n\n2:39:14.200 --> 2:39:17.480\n gets back to the Russian rooms where they're yelling at each other, but they're still loving\n\n2:39:17.480 --> 2:39:24.600\n underneath it. I mean, the question I want to ask for you is, I think you and I have\n\n2:39:24.600 --> 2:39:27.080\n a different view on some things.\n\n2:39:27.080 --> 2:39:27.320\n Okay.\n\n2:39:27.320 --> 2:39:31.560\n We have a different approach to things just on the surface level, but also a different\n\n2:39:31.560 --> 2:39:38.840\n view on some things. I have a lot of hope for institutions. So maybe it's a gut instinct.\n\n2:39:38.840 --> 2:39:45.000\n Like your gut instinct is like centers of power are like, burn them down first and then\n\n2:39:45.000 --> 2:39:46.280\n let's figure it out.\n\n2:39:46.280 --> 2:39:46.680\n Sure.\n\n2:39:46.680 --> 2:39:48.760\n Or maybe that's a funny, rough way of saying it.\n\n2:39:48.760 --> 2:39:50.040\n No, I think that's about right.\n\n2:39:50.040 --> 2:39:55.080\n And then for me, it's like, no, let's understand the institution and slowly,\n\n2:39:55.080 --> 2:40:02.280\n revolutions from within versus revolutions from without. But like we can have those disagreements\n\n2:40:02.280 --> 2:40:06.760\n and there may be times when those disagreements will be, I could see in the future, I could\n\n2:40:06.760 --> 2:40:12.760\n see I'll be attacked by my friend Michael Malice, which I very look forward to it. No,\n\n2:40:12.760 --> 2:40:16.840\n not attacked, but you know what I mean, on the surface level, in the idea space. Anyway,\n\n2:40:16.840 --> 2:40:23.560\n you're shaking your head now, you won't. I guess maybe this also goes to Sam Harrison.\n\n2:40:23.560 --> 2:40:30.200\n Joe Rogan, I would love to be able to disagree, disagree in big ways on important things and\n\n2:40:30.200 --> 2:40:35.320\n still be close friends. And I don't understand why those are, should be contradictions.\n\n2:40:35.320 --> 2:40:35.720\n Yeah.\n\n2:40:35.720 --> 2:40:41.560\n And that's the tension. That's been the most heartbreaking thing to me about Sam and\n\n2:40:41.560 --> 2:40:46.760\n Brett and Joe. In the case of Brett, it's me, I don't know Brett. So I'm just like\n\n2:40:46.760 --> 2:40:51.080\n looking as somebody who just enjoys having these voices out there. And it seems like\n\n2:40:51.080 --> 2:40:57.320\n COVID just brought out the worst in some, many folks. And it just feels like it's so\n\n2:40:57.320 --> 2:41:04.360\n sad to me to see their friendship somewhat deteriorating. Or maybe I'm just being in a...\n\n2:41:04.360 --> 2:41:07.080\n No, it seems clear, it's deteriorated enormously.\n\n2:41:07.080 --> 2:41:09.720\n It's sad that that's the case.\n\n2:41:09.720 --> 2:41:14.280\n Yeah, so my, like I've had people come at me because I'm friends with you. And they\n\n2:41:14.280 --> 2:41:17.400\n were like, Oh, Lex authored some paper about masks. I don't even know what the hell they're\n\n2:41:17.400 --> 2:41:23.880\n referring to. I don't care. I always say and mean, I don't care whether someone agrees\n\n2:41:23.880 --> 2:41:27.800\n with me. I care how they treat me. And it goes the other way. Cause I'll have a lot\n\n2:41:27.800 --> 2:41:30.840\n of people on Twitter who are like, Oh, I'm on your team and blah, blah, blah. I'm like,\n\n2:41:30.840 --> 2:41:34.200\n I don't know you. You're not my team. And just because you happen to agree with me,\n\n2:41:34.200 --> 2:41:39.000\n it's of no value to me. Like I don't know you and I'm interested in knowing you. Many\n\n2:41:39.000 --> 2:41:43.480\n of my friends, I don't know what their politics are. I don't care. Like I care how we hang\n\n2:41:43.480 --> 2:41:47.880\n out. We have a good time. We watch dumb movies, watch YouTube, go to the store, whatever. I\n\n2:41:47.880 --> 2:41:52.600\n don't know what your politics are. I don't care what your politics are. Chris Williamson,\n\n2:41:52.600 --> 2:41:56.360\n who, you know, he's just here. He's going to be moving to Austin. I learned what his\n\n2:41:56.360 --> 2:41:59.960\n politics are in the last, we've been, we chat like almost every day because he took the\n\n2:41:59.960 --> 2:42:03.960\n world's smallest political quiz. And he figured out what his answers were. I had no idea where\n\n2:42:03.960 --> 2:42:11.000\n he's communist. He said, well, obviously. Yeah. Yeah. Marxist. Yeah. Let's be honest.\n\n2:42:11.000 --> 2:42:19.480\n Yeah. So like stuff like that, like it never, and people, I think because politics is often\n\n2:42:19.480 --> 2:42:24.440\n so tribal, especially now, they'll be like, oh, I could never be friends with someone\n\n2:42:24.440 --> 2:42:28.600\n who voted for X. Really? What if they're like grandma worked in that campaign? What if,\n\n2:42:28.600 --> 2:42:33.880\n you know, it's this, you can't think of one steel man argument why this would happen,\n\n2:42:33.880 --> 2:42:39.720\n but if they just want to spite their boss. So I don't like that approach at all. It makes\n\n2:42:39.720 --> 2:42:45.720\n no sense to me. You could still have debates. I mean, like, I would still like to have those\n\n2:42:45.720 --> 2:42:52.520\n conversations and still have disagreements. Like, I disagree with Joe on COVID a lot on\n\n2:42:52.520 --> 2:42:57.400\n a bunch of different things. Very kind of, but it's never like, it's not tense at all.\n\n2:42:58.200 --> 2:43:05.640\n It's just, it's, it doesn't have that arrogance that a lot of COVID conversations seems to have,\n\n2:43:05.640 --> 2:43:12.440\n like talking down to people from both directions. So I would love to have those because I love the\n\n2:43:12.440 --> 2:43:17.720\n debate. I love debates. It takes a lot to get me triggered. And when the Babylon Bee were\n\n2:43:17.720 --> 2:43:22.600\n interviewing Elon and he had this thing, he goes, well, I don't know anyone who wants to,\n\n2:43:22.600 --> 2:43:28.680\n you know, abolish the FDA and the FAA. And I'm standing there and I'm shaking. And the guys look\n\n2:43:28.680 --> 2:43:33.480\n at me and they're like, oh, we actually have an anarchist here. And the example he used was,\n\n2:43:33.480 --> 2:43:37.880\n you know, look, if playing football, you're going to have a referee there and you want the referee,\n\n2:43:37.880 --> 2:43:42.440\n you know, you don't want, but the referee started playing the game is such a good thing. And I'm\n\n2:43:42.440 --> 2:43:47.720\n sitting there, I'm like, the referee doesn't work for the state. The referee is a private individual\n\n2:43:47.720 --> 2:43:54.360\n working for this organization. And there's no reason at all that food quality, which is something\n\n2:43:54.360 --> 2:43:58.520\n crucially important has to be, or can only be delivered through the state and a government\n\n2:43:58.520 --> 2:44:06.040\n monopoly. That's actually really interesting. Just the link on that. Just a little bit with\n\n2:44:06.040 --> 2:44:11.000\n the vaccine and stuff like that, with the antiviral drugs, the FDA. So like, are you\n\n2:44:11.000 --> 2:44:17.320\n comfortable? Like who should be the referee? Right. Do you have an idea? Like what's the best\n\n2:44:17.320 --> 2:44:22.920\n referee for the vaccine? It's just the market. Just let people decide. This is tricky because\n\n2:44:22.920 --> 2:44:29.720\n the thing that I have not been following COVID as closely as Joe and Sam, as Mr. Harris, excuse me,\n\n2:44:29.720 --> 2:44:36.200\n and Mr. Musk. The point is, when anything like this is developing, there's going to be a lot of\n\n2:44:36.200 --> 2:44:41.480\n misinformation out there, even from the scientists, because it's a dynamic process. They don't know\n\n2:44:41.480 --> 2:44:45.000\n what they're dealing with. A lot of it has to be speculative. They don't know long term effects,\n\n2:44:45.000 --> 2:44:52.120\n because it hasn't been around for a long time. So I think it is very dangerous,\n\n2:44:52.120 --> 2:45:00.040\n when Joe was mocked for taking a laundry list of things under his doctor's advice and they kind of\n\n2:45:00.040 --> 2:45:04.200\n latched onto the ivermectin. And then they specifically said it was horse paste, although\n\n2:45:04.200 --> 2:45:09.240\n it's veterinary medicines. Why didn't they say dog paste or cat paste? It's like, well, he's not dead.\n\n2:45:10.200 --> 2:45:16.440\n And he's also taking drugs which are used in other circumstances. The very least, maybe they're\n\n2:45:16.440 --> 2:45:22.280\n pointless, but if the drug is being allowed for pharmaceutical reasons, the odds are quite low\n\n2:45:22.280 --> 2:45:29.640\n that they're going to have deleterious side effects in general. So I think this kind of insistence\n\n2:45:30.200 --> 2:45:38.120\n that there has to be one, a officially approved outcome that we're all doing, that is kind of\n\n2:45:38.120 --> 2:45:43.240\n dangerous thinking in general. By the way, I don't know if you saw, I got a chance to talk to the\n\n2:45:43.240 --> 2:45:50.680\n Pfizer CEO, and I had helped collecting questions. I got a lot of questions and people put at the top\n\n2:45:50.680 --> 2:45:59.880\n a question for Michael Malice. Oh really? No, the ask him what he likes best about me. Oh, what does\n\n2:45:59.880 --> 2:46:03.400\n he like best? Yeah, yeah, yeah. So I actually had that on my list of questions I was going to ask him,\n\n2:46:03.400 --> 2:46:09.000\n and my plan was I'll ask him, Michael Malice wants to know what you like best about him,\n\n2:46:09.000 --> 2:46:13.880\n and then my guess was he'd be like, who? And I'd be like, exactly, and then go on to the next.\n\n2:46:14.600 --> 2:46:20.120\n But I thought it was such a tense conversation that I thought there would be no...\n\n2:46:20.120 --> 2:46:25.320\n Of course, room for levity. The question I would ask him is can you acknowledge that there is an\n\n2:46:25.320 --> 2:46:32.760\n enormous incentive for your company to force everyone in America or everyone on earth to be\n\n2:46:32.760 --> 2:46:37.400\n a consumer of your product? Yeah. That's my question. So I danced around that question\n\n2:46:37.400 --> 2:46:44.760\n quite a lot. I phrase it differently, which is a conflict of interest and attention between making\n\n2:46:44.760 --> 2:46:52.120\n a lot of money and actually helping people. I mean, I've asked a lot of really heavy questions\n\n2:46:52.120 --> 2:47:00.280\n in that, and a lot of people wrote to me with support saying that was a really great conversation,\n\n2:47:00.280 --> 2:47:08.600\n and a lot of people wrote saying that, I mean, saying that it was just too soft.\n\n2:47:08.600 --> 2:47:14.840\n And I don't know, I think about that a lot. Like, how do you have that conversation? I don't think\n\n2:47:14.840 --> 2:47:21.400\n it was too soft. And actually, just for the record, I want to say that they didn't see any of the\n\n2:47:21.400 --> 2:47:27.160\n questions I'm asking. They didn't see the final interview. I can ask anything I want.\n\n2:47:27.160 --> 2:47:41.400\n And so any questions that I asked and failed to ask is my own shortcomings. Also, not being a coward,\n\n2:47:41.400 --> 2:47:46.920\n I was afraid of nothing. Like, what do I have to gain or lose exactly? Well, you have something to\n\n2:47:46.920 --> 2:47:53.960\n lose because if you're, I do, I always do softballs. Because if I'm going to make it difficult for\n\n2:47:53.960 --> 2:47:58.600\n someone to come to my show, a lot of people will be disincentivized to do the show. Because like,\n\n2:47:58.600 --> 2:48:02.680\n I don't need this. I see. Oh, yeah, I wasn't thinking like that. But I was, I don't like to,\n\n2:48:02.680 --> 2:48:10.840\n what I think some fraction of folks wanted me to do is to yell at a person, like, criticize them,\n\n2:48:10.840 --> 2:48:16.680\n not even ask questions, essentially. Yeah, yeah, how dare you? Yeah, but to me, my goal,\n\n2:48:16.680 --> 2:48:21.800\n my hope is with these conversations is not just to do how great you are and all that kind of stuff,\n\n2:48:21.800 --> 2:48:28.440\n is to bring out some deeper truth. The beautiful things is when you can together realize some\n\n2:48:28.440 --> 2:48:37.400\n truth, like you mentioned, that the incentive for everyone to take the vaccine is obviously high\n\n2:48:37.400 --> 2:48:45.400\n for the maker of a vaccine. And for them to arrive at that truth together, that is a really difficult\n\n2:48:45.400 --> 2:48:50.920\n truth to operate under. Like, for example, I had a whole exchange with him about,\n\n2:48:52.920 --> 2:48:58.040\n this is Jordan Peterson asked this question, I use that as a kind of springboard, which is the\n\n2:48:59.400 --> 2:49:05.880\n kind of open doors between the FDA, the CDC and Pfizer. Right, like some people work at Pfizer\n\n2:49:05.880 --> 2:49:11.960\n and then go to work at the FDA and then vice versa. And I brought up the idea of, like,\n\n2:49:11.960 --> 2:49:19.800\n this is my safe space, maybe yours too, just going back to the Soviet Union to look at the lessons of\n\n2:49:19.800 --> 2:49:27.800\n human nature and corruption. I said, like, there's two things, this looks bad, and two,\n\n2:49:27.800 --> 2:49:33.080\n this naturally leads to corruption. And I pushed this with several questions, but polite and\n\n2:49:33.080 --> 2:49:39.240\n respectful. And he ultimately said, you know, there's rules. We have to follow the rules.\n\n2:49:39.240 --> 2:49:44.120\n There's very strict rules about this, and we have to follow those rules, otherwise we get\n\n2:49:44.120 --> 2:49:49.640\n punished severely. And so like his responses, like people reacted to them as like, okay,\n\n2:49:49.640 --> 2:49:55.080\n that's the CEO doing the political, but there's also truth to what he's saying. That one of the\n\n2:49:55.080 --> 2:50:01.160\n beautiful things about America is that you can criticize the rule of law currently, but it's still\n\n2:50:01.160 --> 2:50:12.360\n is better than in the Soviet Union where people bribed each other. But still, he made it seem like\n\n2:50:12.360 --> 2:50:19.240\n there's no corruption. People often ask me why I describe myself as an anarchist and not a\n\n2:50:19.240 --> 2:50:23.720\n narcocapitalist, because they think my views are more in line with that school of anarchism.\n\n2:50:24.440 --> 2:50:29.720\n And one of the other reasons you just gave me a good one is that I'm not an anarchist,\n\n2:50:29.720 --> 2:50:35.560\n you just gave me a good one, is that if I am talking to someone who's a major CEO,\n\n2:50:37.400 --> 2:50:43.400\n I have that hardcore left anarchist view that this person is, if not the devil, certainly gonna be\n\n2:50:44.600 --> 2:50:51.320\n sinister, at the very least. And if you can't say, listen, this happens inevitably with elites,\n\n2:50:51.320 --> 2:50:55.640\n it's, you know, it happens in universities, it happens in the food industry, there's only so many\n\n2:50:55.640 --> 2:51:00.200\n people at the top of these things, the field is small, and everyone's gonna know each other,\n\n2:51:00.200 --> 2:51:05.240\n which is kind of, you know, just the dynamics of any market, that would kind of be more reasonable.\n\n2:51:05.240 --> 2:51:09.960\n And just say, it's easy to caricature us because you're not in the boardroom, but we're not,\n\n2:51:09.960 --> 2:51:16.680\n you know, we are trying to produce a product that people want. So unlike the people who criticized\n\n2:51:16.680 --> 2:51:22.520\n me, I was bothered by, I wasn't bothered by most things, but I was bothered by the fact that he\n\n2:51:22.520 --> 2:51:27.720\n didn't show more worry about the corrupting nature of money and power. Like, he should,\n\n2:51:29.160 --> 2:51:35.480\n if you say that there's no corruption, you should show that because we constantly worry about it.\n\n2:51:35.480 --> 2:51:36.280\n Right.\n\n2:51:36.280 --> 2:51:38.920\n Not because like, look, there's rules.\n\n2:51:39.640 --> 2:51:41.320\n Yeah, which are enforced by you.\n\n2:51:41.320 --> 2:51:49.800\n Yeah, exactly. So like, I think the only way to avoid force for time, the corrupting force of\n\n2:51:49.800 --> 2:51:53.640\n power is to freak out about it, nonstop.\n\n2:51:53.640 --> 2:51:57.960\n The impression I always get from people like him, and I haven't seen the interview and I won't be\n\n2:51:57.960 --> 2:52:02.680\n watching it, is they're genuinely convinced that they're good guys.\n\n2:52:03.560 --> 2:52:03.960\n Yeah.\n\n2:52:04.440 --> 2:52:10.920\n And if you're the good guy, sure corruption is a concern theoretically, but I know this guy at the\n\n2:52:10.920 --> 2:52:16.120\n FDA, I know this senator, sure we disagree, sure they do some things I don't like, but in terms of\n\n2:52:16.120 --> 2:52:21.320\n corrupt, they're not getting briefcases full of money, they're not gonna sell a vaccine that,\n\n2:52:21.320 --> 2:52:25.800\n you know, kills people in Georgia. So yeah, it's a concern theoretically, but this is the 21st\n\n2:52:25.800 --> 2:52:28.600\n century. The thought process, I think, writes itself.\n\n2:52:28.600 --> 2:52:34.200\n I think, yeah, having the humility, I do this all the time, maybe to a destructive level,\n\n2:52:34.200 --> 2:52:38.840\n thinking that I might be doing bad for the world, I might be wrong, I might be that kind of thinking\n\n2:52:38.840 --> 2:52:44.120\n is very, you should do at least some of that. Not to a point of being paralyzed, but a little bit.\n\n2:52:44.120 --> 2:52:49.080\n You're actually in the right mindset for me to ask you then for advice.\n\n2:52:49.080 --> 2:52:49.560\n Okay.\n\n2:52:49.560 --> 2:52:53.800\n You're in this compassionate, thoughtful mood, I like it. The compassionate,\n\n2:52:53.800 --> 2:53:02.040\n thoughtful Michael. So for future conversations like that, so the person that offered a conversation\n\n2:53:03.000 --> 2:53:08.520\n that at first I avoided, but I might return to is Anthony Fauci. So there's Anthony Fauci,\n\n2:53:08.520 --> 2:53:14.680\n but then there's also Trump and Biden, people like that. Like if you had them on your show or\n\n2:53:15.640 --> 2:53:19.000\n just giving me advice on how to talk to them, what do you think is the right way\n\n2:53:20.920 --> 2:53:28.120\n to talk to them? And forget about future guests, but like to get at something new, you know,\n\n2:53:28.120 --> 2:53:32.680\n together. Like get at something, not for views or likes or clicks or any of that,\n\n2:53:32.680 --> 2:53:35.560\n but discover something new through the mode of conversation.\n\n2:53:35.560 --> 2:53:40.680\n Well, like let's take those one at a time. So if I was talking to Trump, I told Ruben to ask Trump\n\n2:53:40.680 --> 2:53:45.240\n this and he didn't. What I wanted to know is what's the look on your face when you're sending\n\n2:53:45.240 --> 2:53:49.640\n these tweets, right? Because I imagine him on the toilet with his phone, right? Are you cracking\n\n2:53:49.640 --> 2:53:54.200\n yourself up? Are you just completely stoic? Are you kind of that Trump little smirk he does?\n\n2:53:54.200 --> 2:53:55.000\n Yeah.\n\n2:53:55.000 --> 2:54:00.360\n So when you get someone to open up about their emotion, about some of their passion,\n\n2:54:01.080 --> 2:54:05.000\n I think that breaks down some barriers and creates a bond.\n\n2:54:05.000 --> 2:54:09.800\n Yeah. But Ruben wouldn't be, that's not his style. Like that's a great question for you to ask.\n\n2:54:09.800 --> 2:54:11.560\n Well, I told him to say Michael Malice.\n\n2:54:11.560 --> 2:54:12.200\n Oh, Michael Malice.\n\n2:54:13.400 --> 2:54:19.800\n For Biden, that would be a tough one because Biden gets, doesn't get enough credit for what\n\n2:54:19.800 --> 2:54:25.960\n a good politician he is. There was this moment people can see on YouTube where Biden is addressing\n\n2:54:25.960 --> 2:54:30.600\n a room full of people and he had someone there and he goes, can you, why don't you stand up so\n\n2:54:30.600 --> 2:54:37.640\n everyone can give you a hand? And the guy was in a wheelchair and Biden's like, oh, and like,\n\n2:54:37.640 --> 2:54:41.720\n but instantly he goes, you know what, we're all going to stand up for you. And he made everyone\n\n2:54:41.720 --> 2:54:45.800\n get up and applaud the guy. I'm like, that's quick. Like, yeah, you made a fool of yourself.\n\n2:54:45.800 --> 2:54:50.920\n So he is a glad hander. In many ways, he's more of a schmoozer than Trump was. Like Trump\n\n2:54:50.920 --> 2:54:54.600\n made the point that he knows all the good people, but Biden knows how to shake hands.\n\n2:54:54.600 --> 2:54:58.360\n Well, I think with both, and sorry to interrupt, with both Trump and Biden, like you mentioned\n\n2:54:58.360 --> 2:55:03.880\n earlier, to me, at least their family is fascinating. The dynamic as a family man,\n\n2:55:03.880 --> 2:55:08.840\n as a father, as a... I think that Biden won't acknowledge his illegitimate grandkid is a\n\n2:55:08.840 --> 2:55:13.560\n problem for me. But at the same time, I can see why he thinks it's off limits to ask.\n\n2:55:13.560 --> 2:55:17.080\n So that's the thing when you're dealing with people that powerful, they're not used to having\n\n2:55:17.080 --> 2:55:22.120\n to answer questions, which might be perfectly nice, but would cause them to freak the hell out.\n\n2:55:22.120 --> 2:55:27.240\n That's the tricky thing of talking to people, as you know, like some, some topics are off limit,\n\n2:55:27.240 --> 2:55:34.440\n not in that they draw lines, but they just shut down when you ask them. Trust me, I think I talked\n\n2:55:34.440 --> 2:55:40.520\n to Elon three times now, you better believe I brought up love. And how far do you think that\n\n2:55:40.520 --> 2:55:47.480\n got? And you could just imagine exactly. We did exactly the kind of robot back and forth. And he\n\n2:55:47.480 --> 2:55:52.120\n just like just shut down. So yeah, I worry about that with the person. But that's the thing that\n\n2:55:52.120 --> 2:55:59.560\n makes it fascinating with those two, because he had with Hunter and losing his son, like\n\n2:55:59.560 --> 2:56:08.200\n the dynamic of the complexities of all that, like just having children fuck up in the way children\n\n2:56:08.200 --> 2:56:14.680\n do. And then with Trump, the interesting dynamic with his very different kids and all kind of\n\n2:56:14.680 --> 2:56:19.480\n interesting in different ways and maintaining connection with all of them and also letting\n\n2:56:19.480 --> 2:56:23.560\n them flourish individually is fascinating to me. Well, I also want to ask Trump if he can name all\n\n2:56:23.560 --> 2:56:28.600\n the presidents in order, which there's no, he can, but I'd also want to know all the, do you think\n\n2:56:28.600 --> 2:56:34.040\n he knows who the second president of the United States is? Yes. Okay. John Adams, he knows. I think\n\n2:56:34.040 --> 2:56:39.880\n when it gets between Ulysses S. Grant and McKinley, that's when we all screw up that window. It's\n\n2:56:39.880 --> 2:56:45.160\n tough. Yeah. Yeah. I'm sure that's the one window where he, I mean, he's not, he's going to be able\n\n2:56:45.160 --> 2:56:52.280\n to get back to FDR. No question. I have to, my sense was with Donald Trump, and this is not,\n\n2:56:53.000 --> 2:56:57.640\n I would say criticism is he doesn't have a depth of knowledge or more importantly,\n\n2:56:57.640 --> 2:57:01.960\n curiosity about history. Yeah. But if you're old enough, you're going to at least remember\n\n2:57:01.960 --> 2:57:07.640\n the presidents in your lifetime. In your lifetime. Yeah. Sorry. That's what I was saying. He'll get\n\n2:57:07.640 --> 2:57:13.320\n us from president to FDR pretty easily. Yeah. Yeah. Okay. Sure. I thought you meant FDR from\n\n2:57:13.320 --> 2:57:18.840\n the other direction. No, no. Yeah. From like current FDR. Yeah. Yeah. But yeah, from a\n\n2:57:18.840 --> 2:57:28.120\n political perspective, like having a conversation about politics with those two, there is interesting\n\n2:57:28.120 --> 2:57:33.960\n topics, interaction between Donald Trump and Putin, not the interaction, like not the stupid\n\n2:57:33.960 --> 2:57:41.640\n journalistic stuff, but it's clear to me that he is a student of power. Oh, for sure. And like he\n\n2:57:41.640 --> 2:57:46.920\n enjoys the game of power. Yeah. And so it's interesting because to me, the reason he admires\n\n2:57:46.920 --> 2:57:53.560\n Putin is it's another player in the game of power. And I think why so many people hate him, Trump,\n\n2:57:54.120 --> 2:57:59.560\n is that he demonstrated to a lot of Americans how much of a con job most of politics is and how\n\n2:57:59.560 --> 2:58:03.800\n people just say what they need to do. But behind closed doors, these people are buffoons and he\n\n2:58:03.800 --> 2:58:10.440\n exposed them as that. I'd also, so the Biden, I think Biden would be a tougher interview than\n\n2:58:10.440 --> 2:58:14.120\n Trump because I feel like Biden's more slippery in many ways. He's much more of a consummate\n\n2:58:14.120 --> 2:58:19.240\n politician. He's been in the Senate since the early seventies, since he was like 30 or 35,\n\n2:58:19.240 --> 2:58:26.520\n whatever it was. So, you know, he'd have his little kind of pat answers. There was Larry King,\n\n2:58:26.520 --> 2:58:31.320\n who was certainly a softball interviewer and I don't begrudge him that at all. I remember\n\n2:58:31.320 --> 2:58:36.600\n very vividly and it was like, I think it was the 2008 cycle. He asked Hillary, why do so many\n\n2:58:36.600 --> 2:58:40.440\n people hate you? Why do you think so many people hate you? And she just goes like, oh, well,\n\n2:58:40.440 --> 2:58:44.520\n I take tough stances on the, and he cut her off. He goes, other people have taken those stances.\n\n2:58:44.520 --> 2:58:48.440\n Why do they hate you? And she didn't really, I was really impressed with him that he didn't let her\n\n2:58:48.440 --> 2:58:55.400\n off the hook. That to me is great. But some people will say that's still too softball because you\n\n2:58:55.400 --> 2:59:02.680\n like, they would want him to start listing, I don't know, droning, like all the things that\n\n2:59:02.680 --> 2:59:06.280\n Hillary Clinton is criticized for. Yeah, but then what she, she's done this many times. She's very\n\n2:59:06.280 --> 2:59:09.800\n good at this. She'll be like, look, I've addressed all these in the past. If you want to start\n\n2:59:09.800 --> 2:59:13.560\n rehashing Republican talking points, you can go look up my interviews. Yeah, I think it's\n\n2:59:13.560 --> 2:59:20.760\n counterproductive. Yeah. So what about more prescient for me? I can't believe I'm walking\n\n2:59:20.760 --> 2:59:25.480\n through this fire for no good reason whatsoever, but Anthony Fauci. So let me tell you why I care\n\n2:59:25.480 --> 2:59:31.720\n about Anthony Fauci because I care a lot about science and the way science is viewed in society.\n\n2:59:31.720 --> 2:59:40.680\n And not to put it at the, at the feet of this one person, but I, him and certain members of the\n\n2:59:40.680 --> 2:59:47.320\n scientific community that was responsible for managing the response to COVID, I think are\n\n2:59:47.320 --> 2:59:54.360\n somewhat or entirely responsible for a significant decrease in trust in science. Yes, no question.\n\n2:59:54.360 --> 2:59:57.720\n In the past couple of years. There was a poll that just came out this week that said the number is\n\n2:59:57.720 --> 3:00:05.800\n just collapsed. And if you don't blame him for it, I personally blame him for not\n\n3:00:07.880 --> 3:00:14.840\n improving the problem. And so there's definitely would be a harsh conversation there to be had.\n\n3:00:14.840 --> 3:00:21.560\n And I think I want to have it, but how do you do it? It's tough. Yeah. Because, you know,\n\n3:00:21.560 --> 3:00:26.120\n again, politicians, there's political answers. If they get too frustrated too quickly,\n\n3:00:26.120 --> 3:00:29.560\n they will not explore these difficult things with you. They'll just shut down.\n\n3:00:31.320 --> 3:00:37.160\n But then if you say too many nice things, because I should also say Anthony Fauci is an incredible\n\n3:00:37.160 --> 3:00:43.080\n career. Like there's several hours worth of conversation to be had about how amazing of\n\n3:00:43.080 --> 3:00:46.840\n a person he is. Well, I would also be curious about the AIDS stuff. Yes. Because that's something\n\n3:00:46.840 --> 3:00:50.120\n gets criticized about and I wouldn't come at it aggressively. I would say, let's set the record\n\n3:00:50.120 --> 3:00:54.840\n straight. This is some of the criticism you get, blah, blah, blah. Your role in the AIDS crisis.\n\n3:00:54.840 --> 3:00:59.160\n Let's talk about this. And this is something that is important part of American history. There was\n\n3:00:59.160 --> 3:01:04.120\n a pandemic, but it was localized to certain populations. And that population at the first,\n\n3:01:04.120 --> 3:01:07.960\n at least, was pretty much told goodbye and good luck. You're going to have to deal with this.\n\n3:01:07.960 --> 3:01:11.800\n So how did you deal with that? I mean, were you scared of getting AIDS? You know, so on and so\n\n3:01:11.800 --> 3:01:17.960\n forth. But also there was that comment when, and correct me if I'm wrong, I'm not a Fauci expert,\n\n3:01:17.960 --> 3:01:22.920\n when he basically, they told people not to wear masks or they lied about it to some extent,\n\n3:01:22.920 --> 3:01:25.880\n because they said then people are going to run out of them or something like that. And they\n\n3:01:25.880 --> 3:01:30.440\n admitted they were being inaccurate. I would nail him on that. Like, let's address this.\n\n3:01:30.440 --> 3:01:34.520\n Were you being dishonest? Is there sometimes when it's important to be dishonest in service\n\n3:01:34.520 --> 3:01:40.440\n of whatever? Also, I would ask him how, as someone who's not a politician, whether his level of fame\n\n3:01:40.440 --> 3:01:45.800\n and adulation has gotten to his head. How do you have a perspective when, and how does it feel\n\n3:01:45.800 --> 3:01:50.040\n when a sitting Senator tells you that you should be imprisoned? Do you think Ted Cruz means it,\n\n3:01:50.040 --> 3:01:57.240\n or you think Ted Cruz is just playing to his base? Yeah, I like the fame one. I would love to sneak\n\n3:01:57.240 --> 3:02:02.520\n up. I mean, that question applies to you too. The question applies to me. When you start getting\n\n3:02:02.520 --> 3:02:09.640\n more fame or money or power, are you aware of how that changed you? And like explore that. Like,\n\n3:02:10.680 --> 3:02:16.120\n how has that changed you? Like if you, like in the privacy of your mind, Michael Malice,\n\n3:02:16.120 --> 3:02:22.280\n like how did you change now that you've gotten more attention, let's say, or even the success\n\n3:02:22.280 --> 3:02:29.160\n of the book? Like, is it, like, take yourself back to the, you know, you talk about the early 20s,\n\n3:02:29.160 --> 3:02:33.560\n the mid 20s person. How are you different from that person? Are you the same person or are you\n\n3:02:33.560 --> 3:02:39.880\n totally different? That's an interesting thought. Is Putin the same person in 2020 as he was in 2010\n\n3:02:39.880 --> 3:02:50.040\n and then in 2000? It's a non trivial, almost like. And then the other thing with Fauci is this is\n\n3:02:50.040 --> 3:02:54.440\n the dynamic system. Like on the one hand, he's going to want to say we got it right every time,\n\n3:02:54.920 --> 3:02:59.880\n right? But then how is that even possible when you're dealing with an evolving, unknown, dynamic\n\n3:02:59.880 --> 3:03:04.280\n situation? When did you guys get it wrong? Did that result in lives lost? Do you feel guilty about\n\n3:03:04.280 --> 3:03:10.280\n that? I mean, the big problem with the masks, the changing of mind on the mask is the arrogance in\n\n3:03:10.280 --> 3:03:17.080\n how it was communicated. To me, a lot of this boils down to how things are communicated. It's\n\n3:03:17.080 --> 3:03:20.760\n like, it's obvious that you need to change your mind when you get new information or sometimes,\n\n3:03:20.760 --> 3:03:26.680\n yeah, you take policies that are like, we know the truth, but we're going to lie for a particular\n\n3:03:26.680 --> 3:03:31.720\n reason. Like you have good intentions, but if you're not able to communicate that later,\n\n3:03:31.720 --> 3:03:39.560\n like we made a mistake. Or even ask him, can you understand how a rational person might choose not\n\n3:03:39.560 --> 3:03:47.800\n to get vaccinated? Yes. Yes. Yes. And if he can't steel man that, then that's a situation. That's\n\n3:03:47.800 --> 3:03:52.200\n a good test. And I've tried, and some people succeed and some people fail. The ability to\n\n3:03:52.200 --> 3:03:56.840\n really steel man the other, understand that somebody should, would be hesitant about taking\n\n3:03:56.840 --> 3:04:05.160\n the vaccine. Yeah. It's a giant mess, man. This podcasting is, it's just a fun little conversation,\n\n3:04:05.160 --> 3:04:09.080\n but there also is a responsibility. I don't know. I don't know how Joe does it.\n\n3:04:11.000 --> 3:04:16.040\n I don't think Joe cares as much as you do. It's more fun for him in a sense. And he's less\n\n3:04:16.040 --> 3:04:19.560\n concerned about the, I mean, he's not unconcerned with the cultural impact, but for him, it's just\n\n3:04:19.560 --> 3:04:23.960\n more broing out. Yeah. Like he doesn't do as much prep. He doesn't come in with three pages,\n\n3:04:23.960 --> 3:04:29.800\n single space to, you know, questions. Yeah. And that's why he's talking to Blair White\n\n3:04:29.800 --> 3:04:35.160\n for 10 minutes about whether sharks lay eggs without knowing. You're the one triggered person.\n\n3:04:35.160 --> 3:04:42.040\n He did. Maybe he trolled the troll. Well, it worked. Yeah, he did. The sharks lay eggs.\n\n3:04:43.400 --> 3:04:49.160\n I'd like to get an updated 2021 version of Michael Malice giving advice to young people.\n\n3:04:49.160 --> 3:04:58.040\n Okay. So there's, God forbid, high school students, college students, listening to you\n\n3:04:59.240 --> 3:05:06.280\n and looking to you for advice. What advice would you give them about career and about life? How to\n\n3:05:06.280 --> 3:05:11.320\n live a life they can be proud of. This happens a lot. Cause I have my locals community malice.locals.com\n\n3:05:11.320 --> 3:05:15.720\n and there's a lot of young people on there. So that's a great place. I'll give them a meta piece\n\n3:05:15.720 --> 3:05:21.240\n of advice. Don't ask your friends for advice because you're an idiot at your age and they're\n\n3:05:21.240 --> 3:05:24.600\n all idiots and they don't want to seem like idiots. So they're just going to give you advice. They\n\n3:05:24.600 --> 3:05:27.800\n pulled it from the TV and no one knows that you're talking about and it's just going to be\n\n3:05:27.800 --> 3:05:36.280\n counterintuitive. So seek out advice from people who you seek to emulate and ask them for advice.\n\n3:05:36.280 --> 3:05:40.120\n If you can't get ahold of them, figure out a way to get ahold of them. Incentivize them in some way.\n\n3:05:40.120 --> 3:05:44.760\n You'd be surprised how many people are responsive on Twitter or in social media if you just asked them\n\n3:05:44.760 --> 3:05:49.080\n a basic life question. Cause then they can quote tweet an answer to a whole population. So that\n\n3:05:49.080 --> 3:05:56.440\n would be one mechanism. It's also very hard at that age to realize your parents might not be all\n\n3:05:56.440 --> 3:06:02.520\n that bright and they might not be all that good people. So that's a hard one at that age to kind\n\n3:06:02.520 --> 3:06:06.680\n of wrap your head around. Just cause they love you doesn't mean they understand you. And that's okay.\n\n3:06:06.680 --> 3:06:13.400\n That's, that's okay. We thank everybody. Shit, your Trump's pretty good too. I, I, I'd like your\n\n3:06:13.400 --> 3:06:19.800\n Trump, your Trump to talk to Elon, to have a conversation. Well, Mr. President, you know,\n\n3:06:19.800 --> 3:06:26.600\n look, uh, some things you did like some, not so much, but you know, for the most part, I think\n\n3:06:26.600 --> 3:06:36.840\n they're kind of a good thing. What are you talking about? Um, hey guys, what are you, what are we\n\n3:06:36.840 --> 3:06:41.400\n talking about? No, I fuck, I fucked up the Lex. Anyway, so those would be two pieces. The other\n\n3:06:41.400 --> 3:06:52.040\n piece of advice I would say is join a gym or have some kind of quantifiable daily improvement to keep\n\n3:06:52.040 --> 3:06:58.840\n you sane. So the reason I always say weightlifting and it could be, uh, running, it can be jump rope.\n\n3:06:58.840 --> 3:07:03.480\n I don't care what it is because if you have those numbers moving in the positive direction,\n\n3:07:03.480 --> 3:07:08.120\n psychological, if you're dealing with depression or anxiety, it's concrete proof to shut your brain\n\n3:07:08.120 --> 3:07:14.120\n up because your brain knows how to talk to you. Your brain is often your enemy. And I'll say\n\n3:07:14.120 --> 3:07:19.880\n exactly the right thing to undermine you. So that's an issue. Um, and I think that's a good\n\n3:07:19.880 --> 3:07:26.360\n thing. So that's an issue. Um, be, I just, this works for me. Maybe it worked for most people.\n\n3:07:26.360 --> 3:07:31.560\n I'm very high on the openness metric. Uh, try new experiences, new things, try things you don't like.\n\n3:07:32.760 --> 3:07:36.760\n It's okay to have a bad experience. You've learned something. So go to a restaurant of\n\n3:07:36.760 --> 3:07:41.560\n a cuisine you wouldn't like or hadn't heard of, read a book that's popular, but you have no\n\n3:07:41.560 --> 3:07:47.240\n interest in, um, read a lot. For example, I didn't know anything about the, uh, election. What was\n\n3:07:47.240 --> 3:07:52.040\n it? 1892 when there was like a split between the electors, read a book about it. Oh, I don't know\n\n3:07:52.040 --> 3:07:55.880\n anything. You know, I don't know anything really about Malcolm X. Read a book about him. Uh, you'll\n\n3:07:55.880 --> 3:08:02.280\n be amazed how much more full you become as a person. Do you see value in writing also, like\n\n3:08:02.280 --> 3:08:06.120\n writing down your ideas? No, I think there's very little value in that. I'm not being, I'm not\n\n3:08:06.120 --> 3:08:09.400\n joking. So reading is where the biggest. Yeah. Cause you're probably not going to revisit what\n\n3:08:09.400 --> 3:08:15.160\n you've written down. Um, but the act of writing, you don't, you don't see it solidify somehow\n\n3:08:15.160 --> 3:08:19.320\n thoughts in your mind. Not for me. It doesn't feel like a tweet. Well, cause then it's, then I have\n\n3:08:19.320 --> 3:08:24.680\n to have it narrowed down into like a phrase or the responsibility of there being an audience.\n\n3:08:25.320 --> 3:08:28.920\n No, I just meant in terms of I've got two 80 characters. So instead of having a reandering\n\n3:08:28.920 --> 3:08:33.480\n thought, meandering thought, I have to codify it in something that's catchy and short. That's a\n\n3:08:33.480 --> 3:08:40.200\n good, useful mental exercise. What face do you make when you tweet? I wouldn't know. I don't know.\n\n3:08:40.200 --> 3:08:45.240\n That's a good point. Is it on the toilet? How much, what percentages on the toilet? Very little on\n\n3:08:45.240 --> 3:08:50.520\n the toilets. I usually more reading. Okay. Um, so even though my tweets are all literally shit,\n\n3:08:50.520 --> 3:08:56.200\n uh, there are a few of them are on the toilet. Um, that's some advice. Um,\n\n3:08:58.120 --> 3:09:05.800\n don't compare yourself to other people. That's a really dangerous one. All my friends are married.\n\n3:09:05.800 --> 3:09:10.760\n I should have, I should have a kid by now. Should there's an expression in recovery. Stop shooting\n\n3:09:10.760 --> 3:09:18.840\n yourself. But it's, but it should, should, should. It's stupid. I also, and this could be my hoarder\n\n3:09:18.840 --> 3:09:25.800\n brain. I surround my house with talismans of joy. So if you have an accomplishment, like when I did\n\n3:09:25.800 --> 3:09:31.000\n Rogan once, I bought with the sock store and I bought these orange socks with black cherries on\n\n3:09:31.000 --> 3:09:35.240\n them. And now whenever I wore that socks, those socks, I'm like, Oh, this is cause I was on Rogan.\n\n3:09:35.240 --> 3:09:38.360\n That was kind of a big deal. So if you have these little things throughout your house,\n\n3:09:39.000 --> 3:09:43.720\n it's good mental fuel, even like, like a toy. Remember when I was a kid, Oh, you know what,\n\n3:09:43.720 --> 3:09:50.040\n this little moments that inspire happiness, I think are visually very useful. Um, so that's\n\n3:09:50.040 --> 3:10:00.040\n another one. Um, and I, by the way, have the, that the watch and, um, that cause we're talking\n\n3:10:00.040 --> 3:10:07.160\n about 2021. That was really, um, the guy in the lecture hall giving you a pat in the back,\n\n3:10:08.440 --> 3:10:16.280\n Joe giving me the, the watch was, um, he has life changing from, yeah, yeah, yeah. It doesn't even,\n\n3:10:16.280 --> 3:10:20.200\n I didn't, the fact that it was on a podcast or whatever, it doesn't matter. Learn how to,\n\n3:10:21.400 --> 3:10:25.480\n um, form boundaries. That's probably the biggest, that's going to be number one on my list\n\n3:10:26.120 --> 3:10:29.960\n because you're going to have people around you who feel the need that they're entitled\n\n3:10:29.960 --> 3:10:33.640\n to your time, who feel the need to criticize you and they're not coming from a good place.\n\n3:10:34.440 --> 3:10:37.720\n So it's very good for you to be like, I'm not interested in talking about this anymore right\n\n3:10:37.720 --> 3:10:41.320\n now. Yeah. Even if it's your parents, even if it's your, especially if it's your parents,\n\n3:10:41.320 --> 3:10:45.160\n like I need my space right now, you're entitled to your space. You're entitled to your time.\n\n3:10:45.160 --> 3:10:48.600\n No one knows yours. You don't owe anyone a response. If someone has a question,\n\n3:10:48.600 --> 3:10:51.480\n you don't owe them an answer, especially if they're not coming at you in good faith or\n\n3:10:51.480 --> 3:10:56.600\n they're coming in a hostile way. Um, that's a big one. Uh, it's hard to learn at that age.\n\n3:10:56.600 --> 3:11:08.440\n Um, and, um, and, and be valuable to those who are around you, be someone who people are happy to\n\n3:11:08.440 --> 3:11:15.080\n see. And if things are bad, like you're the one that they can rely on. Like I was just, uh, you\n\n3:11:15.080 --> 3:11:18.760\n know, a little bit under the weather and I thought to myself, you know what, if things got really bad,\n\n3:11:18.760 --> 3:11:23.720\n I'll call Blair and she's, she would take care of me. And that kind of was very reassuring.\n\n3:11:23.720 --> 3:11:31.960\n Yeah. And you can always call me if you have your stuff lifted in, in a, in an urgent matter.\n\n3:11:32.520 --> 3:11:33.880\n Because of the robots?\n\n3:11:33.880 --> 3:11:37.960\n No, just me. It's just kind of like, there's those things I can help with. Or you're actually\n\n3:11:37.960 --> 3:11:42.200\n literally bleeding. I'm not a good caretaker. I can save you though. I can murder. If you need\n\n3:11:42.200 --> 3:11:48.760\n somebody murdered. Yeah. Yeah. Yeah. Um, wait, what advice would you have to kids that age?\n\n3:11:48.760 --> 3:11:55.960\n And you're all, you're a lot younger than you think you are. That's the other one. Like,\n\n3:11:55.960 --> 3:11:57.000\n Yeah, there's time.\n\n3:11:57.000 --> 3:12:02.920\n I know. Like it's impossible to understand when you're 26 that your 40s are better than your 30s.\n\n3:12:02.920 --> 3:12:06.440\n Cause it's like, okay, old man, you're, that's all cope. I promise you it is.\n\n3:12:07.880 --> 3:12:11.960\n Yeah. I think, uh, you said so many beautiful things. I would say\n\n3:12:11.960 --> 3:12:19.000\n I would say another version of the openness. I would say take big risks when you're young.\n\n3:12:19.000 --> 3:12:22.840\n Yeah. Cause if you fail, who cares? You're sleeping in a suit. It's not in a futon. Who cares?\n\n3:12:22.840 --> 3:12:24.280\n And take them often.\n\n3:12:24.280 --> 3:12:24.520\n Yeah.\n\n3:12:25.800 --> 3:12:32.920\n I also, this is more a little personal to me. I get pushback on this, but I think\n\n3:12:34.360 --> 3:12:41.400\n take big risks and work really hard. Like at whatever you do. Like, I think you just have to\n\n3:12:41.400 --> 3:12:46.840\n give yourself to a thing. It doesn't have to be in terms of time, but really give everything. So it's\n\n3:12:46.840 --> 3:12:57.720\n not like I'm going to try doing this. I'll try, I'll try, try with all your heart. Like really\n\n3:12:57.720 --> 3:13:03.560\n commit yourself. That doesn't mean necessarily hours. That doesn't mean, but like if you fail\n\n3:13:03.560 --> 3:13:09.880\n at doing a thing that you commit to, it should hurt. So like, uh, when I competed in Jiu Jitsu,\n\n3:13:09.880 --> 3:13:14.600\n or you do like sports and so on, don't just say, I'm going to have fun out there. So on. No,\n\n3:13:14.600 --> 3:13:21.000\n try to win. And because then if you don't, it hurts and you learn from that. Um, and then\n\n3:13:21.000 --> 3:13:27.400\n throughout, I think this, the goodness thing is be kind. It's like, some of it is also a skill,\n\n3:13:27.400 --> 3:13:31.400\n allowing yourself to be kind. I found myself earlier in life. I still do this.\n\n3:13:32.920 --> 3:13:36.680\n I find like when I hang out with people, people are often like cynical and negative.\n\n3:13:37.240 --> 3:13:39.400\n And yeah, I try to avoid those people.\n\n3:13:39.400 --> 3:13:45.560\n No, but like, I think everybody falls into that. And sometimes it's the party norm thing.\n\n3:13:46.280 --> 3:13:51.240\n There's a temptation to me to kind of fit in by being more negative than I'm comfortable being.\n\n3:13:51.800 --> 3:13:58.520\n And so, um, resist the pressure. I think, especially when you're younger, it's not cool\n\n3:13:58.520 --> 3:14:05.480\n to care. The thing that drives, when you're young, if you are a fan of a band, a writer,\n\n3:14:05.480 --> 3:14:11.160\n a podcaster, an actor, and people roll their eyes at you, watch out. Those people are dangerous.\n\n3:14:11.160 --> 3:14:16.760\n You should have it. If you love Avril Lavigne with her terrible music and she makes you,\n\n3:14:16.760 --> 3:14:21.880\n gives you joy and people crap on you, they're wrong and you're right. So hold on to those\n\n3:14:21.880 --> 3:14:26.280\n things that make you happy. And if people want to take that away from you or they,\n\n3:14:26.280 --> 3:14:28.920\n how can you like that? Those people are not your friends.\n\n3:14:28.920 --> 3:14:36.520\n LLOYD Why do you have to go make life so complicated? She's my favorite,\n\n3:14:37.880 --> 3:14:41.800\n favorite musician of all time. Jimi Hendrix II, Avril Lavigne first.\n\n3:14:43.880 --> 3:14:49.560\n Thank you for almost bringing a tear to my eye. You mentioned the shittos in terms of love and\n\n3:14:49.560 --> 3:14:55.800\n you should have kids by now. I apologize if it's a personal one, but I think at least I have this\n\n3:14:55.800 --> 3:14:59.640\n thought and not from society, but for myself. Like I want to get married. I want to have kids.\n\n3:15:01.320 --> 3:15:04.200\n Do you feel the pressure of that? Do you want to have kids?\n\n3:15:04.200 --> 3:15:06.360\n LLOYD I just don't want to have kids.\n\n3:15:06.360 --> 3:15:13.960\n I do want to get married. This was an issue that I had to kind of work out earlier this year\n\n3:15:15.000 --> 3:15:21.480\n in terms of the possibility of having kids. Cause I was in a relationship with someone who would\n\n3:15:21.480 --> 3:15:28.200\n have been in many ways, literally a perfect mom. So I did my due diligence and I actually sat down\n\n3:15:28.920 --> 3:15:32.760\n with friends of mine who had kids and I say, give me the downside.\n\n3:15:32.760 --> 3:15:35.720\n LLOYD You did the pros and the cons.\n\n3:15:35.720 --> 3:15:41.000\n LLOYD The pros I knew. The pros for kids are very, I love kids. I was just with Frank Fleming.\n\n3:15:41.000 --> 3:15:45.400\n He writes for the Babylon Bee and he had his four kids and his youngest son has Down syndrome,\n\n3:15:45.400 --> 3:15:53.480\n which is adorable. Winchester is so cute. And I always get along with kids very well. Like I\n\n3:15:53.480 --> 3:15:59.800\n remember very vividly what it was like to be a kid, especially a precocious kid. And I remember\n\n3:15:59.800 --> 3:16:05.080\n how much it bothered me when my parents friends wouldn't give me attention. So I always make it\n\n3:16:05.080 --> 3:16:10.840\n a point to acknowledge kids, to talk to them and they're very grateful. And it's just really fun.\n\n3:16:11.480 --> 3:16:14.840\n Especially the people who I'm friends with, their kids are probably going to be pretty cool. They're\n\n3:16:14.840 --> 3:16:23.080\n not going to be annoying and kind of ugly and overweight. So I love you got that in there.\n\n3:16:23.080 --> 3:16:30.280\n Okay, good. Sorry, I'll go. But the cons, the negatives, what was the conversation like about\n\n3:16:30.280 --> 3:16:36.040\n that? My sister has two kids, my nephews who I absolutely adore, whatever their names are.\n\n3:16:36.040 --> 3:16:42.840\n And she was saying certain things. It's like, if I had kids, my kids are in my top priority.\n\n3:16:42.840 --> 3:16:49.320\n Yeah. Like it's not even a question. And I feel like the work I'm doing, and this sounds pompous,\n\n3:16:49.320 --> 3:16:56.840\n but it's true, is a valuable and important, but I'm also the only one doing it. So this is a big\n\n3:16:56.840 --> 3:17:05.000\n cost. And so it's like, it would be a major lifestyle readjustment. And I'm at the point\n\n3:17:05.000 --> 3:17:10.440\n where I'm kind of like selfish enough that I wouldn't want to do that. And also would have to\n\n3:17:10.440 --> 3:17:16.360\n be with the right woman. Like you're making a commitment. And since they're all crazy,\n\n3:17:16.360 --> 3:17:20.680\n you have to find one where you can handle the crazy. All women are crazy? Yeah.\n\n3:17:21.400 --> 3:17:26.520\n There are one and a halfs in a binary world. Oh, boy. Yeah. It's not comfortable for me.\n\n3:17:30.360 --> 3:17:33.960\n But do you feel the pressure and thinking of that? How much does that weigh on your heart?\n\n3:17:33.960 --> 3:17:42.360\n Like, so Elon has kids. I feel like I love everything. And I love stuff I do. I love\n\n3:17:42.360 --> 3:17:48.440\n the robot over there. Just working with robots. But I do feel the pressure of like,\n\n3:17:53.880 --> 3:17:58.120\n almost like when there's amazing cuisines you never tried or something like that,\n\n3:17:58.120 --> 3:18:05.000\n like go out there and try it. Like you need to put in the work and I don't know. Like life will run\n\n3:18:05.000 --> 3:18:09.240\n away from you, slip through your fingers before you truly get to experience this other kind of\n\n3:18:09.240 --> 3:18:16.680\n love, which is like long term love for another human being, which is like marriage and then\n\n3:18:17.720 --> 3:18:26.040\n love for kids. Yeah. And it almost makes me sad, like not getting to experience that.\n\n3:18:26.040 --> 3:18:33.800\n You know, because I'm also really scared of, I've seen so many bad stories on the partner side,\n\n3:18:34.360 --> 3:18:39.880\n like being with the wrong person. Right. That to me is, I'm not worried. I have kids all day.\n\n3:18:39.880 --> 3:18:47.400\n In fact, I could probably just have kids without the partner. Kids I think are incredible. But the\n\n3:18:49.160 --> 3:18:54.200\n partner, like a wife, it seems like she could then have the negative consequences for like\n\n3:18:54.200 --> 3:18:59.000\n you as a writer on your productivity and your mental ability to flourish, being a joy to others,\n\n3:18:59.000 --> 3:19:04.200\n to all those kinds of things. You know what? That couldn't happen because every relationship I've\n\n3:19:04.200 --> 3:19:14.440\n had, they've been very beyond supportive. Like they'd rather do the, take an hour and do your\n\n3:19:14.440 --> 3:19:19.160\n work than spend time with me. Like I believe in what you're doing. So I couldn't even casually\n\n3:19:19.160 --> 3:19:23.240\n date someone who didn't believe that. Yeah. So that's energizing. Yes. But over time,\n\n3:19:23.240 --> 3:19:28.120\n you never know like how that evolves and all those kinds of things. And for me, I think we're a\n\n3:19:28.120 --> 3:19:32.280\n little bit different. I mean, that has to do with the engineering thing. I just have to pull insane\n\n3:19:32.280 --> 3:19:38.920\n hours. I work like two hours a day. But that's what like creatives do. Like you can only work\n\n3:19:38.920 --> 3:19:44.360\n a couple hours, honestly, to be productive and the rest of the time not. I have to do a lot of\n\n3:19:44.360 --> 3:19:51.480\n menial labor. And so there, there's legit tension on terms of time and attention, all those kinds\n\n3:19:51.480 --> 3:19:57.800\n of things. I don't know. Do you think about this stuff a lot or do you just love life and do cool\n\n3:19:57.800 --> 3:20:03.960\n stuff and whatever happens, happens? I have been so blessed for so long now that I'm at the point\n\n3:20:03.960 --> 3:20:10.280\n where I don't think about it and I'm like, you know, just like miracles happen every day. So just\n\n3:20:10.840 --> 3:20:19.400\n be open to it. You think about your death, mortality? Yes. Fear? What do you feel about it?\n\n3:20:19.400 --> 3:20:26.440\n I'm just worried. I want to take as many people out with me as possible. So suitcase nuke, suitcase\n\n3:20:26.440 --> 3:20:35.160\n nuke, I'm thinking. Yeah. In New York, that would be kind of like ironic as my other favorite artist.\n\n3:20:35.160 --> 3:20:39.800\n I think about my legacy and that's why my books are so important to me.\n\n3:20:41.400 --> 3:20:46.760\n So do you think of it as a kind of immortality? It is though. Like that's who you are,\n\n3:20:46.760 --> 3:20:52.440\n is those books. Well, it's not who I am, but my legacy certainly is. What do you hope your legacy\n\n3:20:52.440 --> 3:21:02.680\n is? That I encourage people to be hopeful and that I taught them how to be free.\n\n3:21:05.320 --> 3:21:11.320\n And you know, my favorite, I think the best show of all time was Dallas, which often gets,\n\n3:21:11.320 --> 3:21:16.040\n it was like an 80s soap opera and people conflate it with dynasty and they think it's trashy and it\n\n3:21:16.040 --> 3:21:21.320\n was very Shakespearean because all the characters are motivated by different values and the writing\n\n3:21:21.320 --> 3:21:27.880\n is just masterful and the acting is masterful. And I'm not going to spoil anything. One season ended\n\n3:21:28.760 --> 3:21:33.160\n with one of the characters on their deathbed in the hospital and the whole cast is there\n\n3:21:33.160 --> 3:21:41.320\n and the amount of acting talent in that room is just phenomenal. And as the character is dying,\n\n3:21:41.320 --> 3:21:46.760\n they look around and they go, like, please be kind to one another, be a family. And they're\n\n3:21:46.760 --> 3:21:51.080\n yelling at this character, don't you dare die on me, you know? And you could see the actors,\n\n3:21:51.080 --> 3:21:54.440\n you know, cause they're losing their castmate who they've had from the beginning. And it would have\n\n3:21:54.440 --> 3:21:57.560\n been a perfect ending to the show, but obviously it's a cash cow. They got to keep milking it.\n\n3:21:58.120 --> 3:22:02.840\n And I think that like kindness and tenderness, and this is Michael Malice talking,\n\n3:22:02.840 --> 3:22:09.960\n it's, there's a lot of people who want to make it that if you are kind or tender,\n\n3:22:09.960 --> 3:22:14.120\n you're going to have consequences, bad consequences. And I think it's important,\n\n3:22:14.120 --> 3:22:22.360\n for me at least, to create a space in my life that if someone is going to be nice or friendly or kind,\n\n3:22:22.360 --> 3:22:27.960\n that they're not going to have to feel stupid or bad about it. It's, we have such a, it's such a\n\n3:22:27.960 --> 3:22:32.840\n disincentive, the set of structures are different. Like if you want to be cynical and sneering, like\n\n3:22:32.840 --> 3:22:37.720\n round of applause, but if someone says, oh, this is great, like, okay, simp, it's, it's really bad.\n\n3:22:37.720 --> 3:22:45.080\n Well, I think you do just this. You do this today. You do this in our friendship and you\n\n3:22:45.080 --> 3:22:51.640\n do it for a very large number of people is teach them how to be, how to have hope and teach them\n\n3:22:51.640 --> 3:23:03.560\n and teach them how to be free. So, thank you so much for talking to me. Thank you so much for\n\n3:23:03.560 --> 3:23:10.280\n being an inspiration. I love you, brother. I love you. Thanks for listening to this conversation\n\n3:23:10.280 --> 3:23:14.840\n with Michael Malice. To support this podcast, please check out our sponsors in the description.\n\n3:23:14.840 --> 3:23:21.320\n And now let me leave you with some words from Albert Camus. Don't walk in front of me. I may\n\n3:23:21.320 --> 3:23:29.880\n not follow. Don't walk behind me. I may not lead. Walk beside me. Just be my friend. Thank you for\n\n3:23:29.880 --> 3:23:46.840\n thank you for listening and hope to see you next time.\n\n"
}