{
  "title": "Philip Goff: Consciousness, Panpsychism, and the Philosophy of Mind | Lex Fridman Podcast #261",
  "id": "BCdV6BMMpOo",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.120\n I believe our official scientific worldview is incompatible with the reality of consciousness.\n\n00:05.120 --> 00:06.800\n Do you think we're living in a simulation?\n\n00:06.800 --> 00:09.680\n We could be in the matrix, this could be a very vivid dream.\n\n00:09.680 --> 00:12.560\n There's going to be a few people that are now visualizing a pink elephant.\n\n00:12.560 --> 00:14.240\n A hamster has consciousness.\n\n00:14.240 --> 00:18.960\n Except for cats who are evil automatons that are void of consciousness.\n\n00:18.960 --> 00:23.840\n Consciousness is the basis of moral value, moral concern.\n\n00:23.840 --> 00:31.840\n Do you think there will be a time in like 20, 30, 50 years when we're not morally okay turning off the power to a robot?\n\n00:36.240 --> 00:38.640\n The following is a conversation with Philip Goff.\n\n00:38.640 --> 00:43.520\n Philosopher specializing in the philosophy of mind and consciousness.\n\n00:43.520 --> 00:49.920\n He is a panpsychist, which means he believes that consciousness is a fundamental and ubiquitous\n\n00:49.920 --> 00:54.080\n feature of physical reality, of all matter in the universe.\n\n00:54.080 --> 00:59.120\n He is the author of Galileo's Error, Foundations for a New Science of Consciousness,\n\n00:59.120 --> 01:04.720\n and is the host of an excellent podcast called Mind Chat.\n\n01:04.720 --> 01:06.560\n This is the Lex Friedman Podcast.\n\n01:06.560 --> 01:09.840\n To support it, please check out our sponsors in the description.\n\n01:09.840 --> 01:14.400\n And now, here's my conversation with Philip Goff.\n\n01:14.400 --> 01:18.640\n I opened my second podcast conversation with Elon Musk.\n\n01:18.640 --> 01:22.400\n With a question about consciousness and panpsychism.\n\n01:22.400 --> 01:27.040\n The question was, quote, does consciousness permeate all matter?\n\n01:27.040 --> 01:29.280\n I don't know why I opened the conversation this way.\n\n01:29.280 --> 01:31.840\n He looked at me like, what the hell is this guy talking about?\n\n01:31.840 --> 01:36.960\n So he said no, because we wouldn't be able to tell if it did or not.\n\n01:36.960 --> 01:39.920\n So it's outside the realm of the scientific method.\n\n01:39.920 --> 01:45.360\n Do you agree or disagree with Elon Musk's answer?\n\n01:45.360 --> 01:50.400\n I disagree, I guess I do think consciousness pervades matter.\n\n01:50.400 --> 01:56.640\n In fact, I think consciousness is the ultimate nature of matter.\n\n01:56.640 --> 02:06.400\n So as for whether it's outside of the scientific method, I think there's a fundamental challenge\n\n02:06.400 --> 02:12.080\n at the heart of the science of consciousness that we need to face up to, which is that\n\n02:12.080 --> 02:15.520\n consciousness is not publicly observable.\n\n02:15.520 --> 02:21.200\n I can't look inside your head and see your feelings and experiences.\n\n02:21.200 --> 02:27.520\n We know about consciousness not from doing experiments or public observation.\n\n02:27.520 --> 02:33.520\n We just know about it from our immediate awareness of our feelings and experiences.\n\n02:33.520 --> 02:37.440\n It's qualitative, not quantitative, as you talk about.\n\n02:37.440 --> 02:38.960\n Yeah, that's another aspect of it.\n\n02:38.960 --> 02:48.800\n So there are a couple of reasons consciousness, I think, is not fully susceptible to the standard\n\n02:48.800 --> 02:50.320\n scientific approach.\n\n02:50.320 --> 02:54.800\n One reason you've just raised is that it's qualitative rather than quantitative.\n\n02:54.800 --> 02:57.760\n Another reason is it's not publicly observable.\n\n02:57.760 --> 03:06.000\n So science is used to dealing with unobservables, fundamental particles, quantum wave functions,\n\n03:06.000 --> 03:10.080\n other universes, none of these things are observable.\n\n03:10.080 --> 03:12.400\n But there's an important difference.\n\n03:12.400 --> 03:20.800\n With all these things, we postulate unobservables in order to explain what we can observe.\n\n03:20.800 --> 03:25.280\n In the whole of science, that's how it works.\n\n03:25.280 --> 03:31.200\n In the case of consciousness, in the unique case of consciousness, the thing we are trying\n\n03:31.200 --> 03:34.960\n to explain is not publicly observable.\n\n03:34.960 --> 03:37.040\n And that is utterly unique.\n\n03:37.040 --> 03:42.480\n If we want to fully bring science into consciousness, we need a more expansive conception of the\n\n03:42.480 --> 03:43.440\n scientific method.\n\n03:43.440 --> 03:48.400\n So it doesn't mean we can't explain consciousness scientifically, but we need to rethink what\n\n03:48.400 --> 03:49.200\n science is.\n\n03:49.200 --> 03:52.080\n What do you mean publicly, the word publicly observable?\n\n03:52.080 --> 03:55.200\n Is there something interesting to be said about the word publicly?\n\n03:55.200 --> 03:56.640\n I suppose versus privately.\n\n03:56.640 --> 04:06.560\n Yeah, it's tricky to define, but I suppose the data of physics are available to anybody.\n\n04:06.560 --> 04:11.920\n If there were aliens who visited us from another planet, maybe they'd have very different sense\n\n04:11.920 --> 04:12.880\n organs.\n\n04:12.880 --> 04:17.440\n Maybe they'd struggle to understand our art or our music.\n\n04:17.440 --> 04:22.960\n But if they were intelligent enough to do mathematics, they could understand our physics.\n\n04:22.960 --> 04:25.280\n They could look at the data of our experiments.\n\n04:25.280 --> 04:27.360\n They could run the experiments themselves.\n\n04:28.160 --> 04:31.040\n Whereas consciousness, is it observable?\n\n04:31.040 --> 04:31.920\n Is it not observable?\n\n04:31.920 --> 04:33.280\n In a sense, it's observable.\n\n04:33.280 --> 04:36.400\n As you say, we could say it's privately observable.\n\n04:37.200 --> 04:41.520\n I am directly aware of my own feelings and experiences.\n\n04:41.520 --> 04:45.680\n If I'm in pain, it's just right there for me.\n\n04:45.680 --> 04:48.880\n My pain is just totally directly evident to me.\n\n04:49.680 --> 04:54.560\n But you from the outside cannot directly access my pain.\n\n04:54.560 --> 05:02.960\n You can access my pain behavior, or you can ask me, but you can't access my pain in the\n\n05:02.960 --> 05:05.280\n way that I can access my pain.\n\n05:06.160 --> 05:08.560\n So I think that's a distinction.\n\n05:09.440 --> 05:14.720\n It might be difficult to totally pin it down how we define those things, but I think there's\n\n05:14.720 --> 05:17.520\n a fairly clear and very important difference there.\n\n05:17.520 --> 05:23.360\n So you think there's a kind of direct observation that you're able to do of your pain that I'm\n\n05:23.360 --> 05:23.920\n not.\n\n05:23.920 --> 05:30.240\n So my observation, all the ways in which I can sneak up to observing your pain is indirect\n\n05:31.040 --> 05:32.400\n versus yours is direct.\n\n05:32.960 --> 05:34.560\n Can you play devil's advocate?\n\n05:34.560 --> 05:41.680\n Is it possible for me to get closer and closer and closer to being able to observe your pain,\n\n05:42.720 --> 05:48.320\n like all the subjective experiences, yours in the way that you do?\n\n05:49.520 --> 05:50.080\n Yeah.\n\n05:50.080 --> 05:56.400\n I mean, so of course, it's not that we observe behavior and then we make an inference.\n\n05:56.400 --> 06:06.000\n We are hardwired to instinctively interpret smiles as happiness, crying as sadness.\n\n06:06.000 --> 06:11.520\n And as we get to know someone, we find it very easy to adopt their perspective, get\n\n06:11.520 --> 06:12.560\n into their shoes.\n\n06:12.560 --> 06:20.960\n But strictly speaking, all we have perceptual access to is someone's behavior.\n\n06:20.960 --> 06:28.320\n And if you were just, strictly speaking, if you were trying to explain someone's behavior,\n\n06:28.320 --> 06:33.520\n those aspects that are publicly observable, I don't think you'd ever have recourse to\n\n06:33.520 --> 06:34.480\n attribute consciousness.\n\n06:34.480 --> 06:39.600\n You could just postulate some kind of mechanism if you were just trying to explain the behavior.\n\n06:39.600 --> 06:43.120\n So someone like Daniel Dennett is very consistent on this.\n\n06:44.080 --> 06:53.360\n So I think for most people, what science is in the business of is explaining the data\n\n06:53.360 --> 06:55.200\n of public observation experiment.\n\n06:55.200 --> 07:02.400\n If you religiously followed that, you would not postulate consciousness because it's not\n\n07:02.400 --> 07:04.240\n a datum that's known about in that way.\n\n07:04.240 --> 07:06.320\n And Daniel Dennett is really consistent on this.\n\n07:06.320 --> 07:12.560\n He thinks my consciousness cannot be empirically verified and therefore it doesn't exist.\n\n07:13.120 --> 07:14.800\n Dennett is consistent on this.\n\n07:14.800 --> 07:16.000\n I think I'm consistent on this.\n\n07:16.000 --> 07:22.880\n But I think a lot of people have a slightly confused middle way position on this.\n\n07:22.880 --> 07:31.040\n On the one hand, they think the business of science is just to account for public observation\n\n07:31.040 --> 07:38.000\n experiment, but on the other hand, they also believe in consciousness without appreciating,\n\n07:38.000 --> 07:45.200\n I think, that that implies that there is another datum over and above the data of public observation\n\n07:45.200 --> 07:49.040\n experiments, namely just the reality of feelings and experiences.\n\n07:49.040 --> 07:52.960\n As we walk along this conversation, you keep opening doors that I don't want to walk into\n\n07:52.960 --> 07:56.480\n and I will, but I want to try to stay kind of focused.\n\n07:56.480 --> 08:03.040\n You mentioned Daniel Dennett, let's lay it out since he sticks to his story, pun unintended,\n\n08:03.040 --> 08:05.360\n and then you stick to yours.\n\n08:05.360 --> 08:06.560\n What is your story?\n\n08:06.560 --> 08:09.200\n What is your theory of consciousness versus his?\n\n08:09.200 --> 08:10.880\n Can you clarify his position?\n\n08:12.880 --> 08:20.640\n So my view, I defend the view known as panpsychism, which is the view that consciousness is a\n\n08:20.640 --> 08:23.680\n fundamental and ubiquitous feature of the physical world.\n\n08:23.680 --> 08:29.600\n So it doesn't literally mean that everything is conscious despite the meaning of the word\n\n08:29.600 --> 08:36.880\n pan, everything, psyche, mind, so literally that means everything has mind, but the typical\n\n08:36.880 --> 08:43.840\n commitment of the panpsychist is that the fundamental building blocks of reality, maybe\n\n08:43.840 --> 08:50.960\n fundamental particles like electrons and quarks, have incredibly simple forms of experience\n\n08:50.960 --> 08:57.600\n and that the very complex experience of the human or animal brain is somehow rooted in\n\n08:57.600 --> 09:02.720\n or derived from this much more simple consciousness at the level of fundamental physics.\n\n09:03.360 --> 09:11.840\n So I mean that's a theory that I would justify on the grounds that it can account for this\n\n09:12.400 --> 09:18.400\n datum of consciousness that we are immediately aware of in our experience in a way that I\n\n09:18.400 --> 09:22.720\n don't think other theories can. If you asked me to contrast that to Daniel Dennett, I think\n\n09:22.720 --> 09:27.360\n he would just say there is no such datum. Dennett says the data for science of consciousness\n\n09:27.360 --> 09:34.000\n is what he calls heterophenomenology, which is specifically defined as what we can access\n\n09:34.000 --> 09:40.640\n from the third person perspective, including what people say, but crucially, we're not\n\n09:40.640 --> 09:46.240\n treating what they say. We're not relying on their testimony as evidence for some\n\n09:46.240 --> 09:54.160\n unobservable realm of feelings and experiences. We're just treating what they say as a datum\n\n09:54.160 --> 09:59.040\n of public observation experiments that we can account for in terms of underlying mechanisms.\n\n09:59.040 --> 10:04.240\n But I feel like there's a deeper view of what consciousness is. So you have a very clear,\n\n10:04.240 --> 10:10.000\n and we'll talk quite a bit about panpsychism, but you have a clear view of what, you know,\n\n10:10.000 --> 10:16.000\n almost like a physics view of consciousness. He, I think, has a kind of unique view of\n\n10:16.000 --> 10:25.520\n you that consciousness is almost a side effect of this massively parallel computation system\n\n10:25.520 --> 10:34.160\n going on in our brain, that the brain has a model of the world and it's taking in perceptions\n\n10:34.160 --> 10:39.920\n and it's constantly weaving multiple stories about that world that's integrating the new\n\n10:39.920 --> 10:46.000\n perceptions and the multiple stories are somehow, it's like a Google doc, collaborative editing,\n\n10:46.000 --> 10:54.000\n and that collaborative editing is the actual experience of what we think of as consciousness.\n\n10:54.000 --> 11:01.440\n Somehow the editing is consciousness of this, of this story. I mean, that's a theory of\n\n11:01.440 --> 11:08.240\n consciousness, isn't it? The narrative theory of consciousness or the multiple versions\n\n11:08.240 --> 11:12.000\n editing, collaborative editing of a narrative theory of consciousness.\n\n11:12.000 --> 11:16.640\n Yeah, he calls it the multiple drafts model. Incidentally, there's a very interesting paper\n\n11:16.640 --> 11:22.240\n just come out by very good philosopher Luke Roloff's defending a panpsychist version\n\n11:22.240 --> 11:24.800\n of Dennett's multiple drafts model.\n\n11:26.160 --> 11:28.720\n Like a deeper turtle that that turtle is stacked on top of.\n\n11:28.720 --> 11:33.520\n Just the difference being that this is Luke Roloff's view, all of the drafts are conscious.\n\n11:33.520 --> 11:42.000\n So I guess for Dennett, there's sort of no fact of the matter about which of these drafts\n\n11:42.000 --> 11:47.680\n is the correct one. On Roloff's view, maybe there's no fact of the matter about which\n\n11:47.680 --> 11:53.760\n of these drafts is my consciousness, but nonetheless, all the drafts correspond to\n\n11:53.760 --> 11:58.400\n some consciousness. And I mean, it just sounds kind of funny. I guess I think he calls it\n\n11:58.400 --> 12:05.040\n Dennettian panpsychism. But Luke is one of the most rigorous and serious philosophers\n\n12:05.600 --> 12:09.760\n alive at the moment, I think. And I hate having Luke Roloff's in an audience if I'm giving a\n\n12:09.760 --> 12:14.480\n talk because he always cuts straight to the weakness in your position that you hadn't\n\n12:14.480 --> 12:18.960\n thought of. And so it's nice, panpsychism is sometimes associated with fluffy thinking,\n\n12:18.960 --> 12:24.720\n but contemporary panpsychists have come out of this tradition we call analytic philosophy,\n\n12:24.720 --> 12:32.800\n which is rooted in detailed, rigorous argumentation. And it is defended in that manner.\n\n12:34.160 --> 12:38.400\n Yeah. Those analytic philosophers are sticklers for terminology. It's very fun,\n\n12:38.400 --> 12:40.640\n very fun group to talk shit with.\n\n12:40.640 --> 12:45.600\n Yeah. Well, I mean, it gets boring if you just start and end defining words, right?\n\n12:45.600 --> 12:46.240\n Yeah.\n\n12:46.240 --> 12:49.840\n I think starting with defining words is good. Actually, the philosopher Derek Parfitt said\n\n12:49.840 --> 12:56.080\n when he first was thinking about philosophy, he went to a talk in analytic philosophy,\n\n12:56.080 --> 13:00.640\n and he went to a talk in continental philosophy, and he decided that the problem with the\n\n13:00.640 --> 13:04.480\n continental philosophy, if it was really unrigorous, really imprecise, the problem\n\n13:04.480 --> 13:10.080\n with the analytic philosophy is it was just not about anything important. And he thought\n\n13:10.080 --> 13:15.440\n there was more chance of working within analytic philosophy and asking some more meaningful,\n\n13:15.440 --> 13:19.680\n some more profound questions than there was in working in continental philosophy and making it\n\n13:19.680 --> 13:23.760\n more rigorous. Now, they're both horrific stereotypes, and I don't want to get nasty\n\n13:23.760 --> 13:28.880\n emails from either of these groups, but there's something to what he was saying there.\n\n13:28.880 --> 13:35.920\n I think just a tiny tangent on terminology. I do think that there's a lot of deep\n\n13:35.920 --> 13:40.320\n insight to be discovered by just asking questions. What do we mean by this word?\n\n13:40.320 --> 13:45.760\n I remember I was taking a course on algorithms and data structures in computer science,\n\n13:45.760 --> 13:51.200\n and the instructor, shout out to him, Ali Chakrafande, amazing professor, I remember\n\n13:51.200 --> 13:57.520\n he asked some basic questions like, what is an algorithm? The pressure of pushing students to\n\n13:57.520 --> 14:02.320\n answer, to think deeply, you know, you just woke up hungover in college or whatever,\n\n14:02.320 --> 14:05.920\n and you're tasked with answering some deep philosophical question about what is an\n\n14:05.920 --> 14:11.760\n algorithm? These basic questions, and they sound very simple, but they're actually very difficult.\n\n14:11.760 --> 14:16.480\n And one of the things I really value in conversation is asking these dumb, simple\n\n14:16.480 --> 14:23.120\n questions of like, you know, what is intelligence? And just continually asking that question over and\n\n14:23.120 --> 14:29.360\n over of some of the sort of biggest research in the researchers in the artificial intelligence\n\n14:29.360 --> 14:34.960\n computer science space is actually very useful. At the same time, you know, it should start a\n\n14:34.960 --> 14:41.760\n terminology and then progress where you kind of say, fuck it, we'll just assume we know what we\n\n14:41.760 --> 14:47.920\n mean by that. Otherwise, you get the Bill Clinton situation where it's like, what is the meaning of\n\n14:47.920 --> 14:56.320\n is, is whatever he said, it's like, hey, man, did you do the sex stuff or not? Yeah. So there's,\n\n14:56.320 --> 15:01.680\n you have to both be able to talk about the sex stuff and the meaning of the word is.\n\n15:01.680 --> 15:09.200\n With consciousness, because we don't currently understand, you know, very much terminology\n\n15:09.200 --> 15:16.080\n discussions are very important because it's like you're almost trying to sneak, sneak up to some\n\n15:16.080 --> 15:22.080\n deep insight by just discussing some basic terminology, you know, like what is consciousness\n\n15:22.080 --> 15:29.360\n or even defining the different aspects of panpsychism is fascinating. But just to linger\n\n15:29.360 --> 15:40.000\n on the Daniel Dennett thing, what do you think about narrative, sort of the mind constructing\n\n15:40.000 --> 15:47.520\n narratives for ourselves? So there's nothing special about consciousness deeply. It is some\n\n15:47.520 --> 15:56.000\n property of the human mind that's just is able to tell these pretty stories that we experience as\n\n15:56.000 --> 16:01.520\n consciousness and that it's unique perhaps to the human mind, which is, I suppose, what Daniel\n\n16:01.520 --> 16:08.320\n Dennett would argue that it's either deeply unique or mostly unique to the human mind.\n\n16:08.880 --> 16:15.760\n It's just on the question of terminology before. Yes, I think it used to be the fashion among\n\n16:15.760 --> 16:21.840\n philosophers that we had to come up with utterly precise, necessary and sufficient conditions for\n\n16:21.840 --> 16:27.840\n each word. And then I think this has gone out of fashion a bit, partly because it's just been,\n\n16:28.800 --> 16:34.080\n you know, such a failure. The word knowledge in particular, people used to define knowledge as\n\n16:34.080 --> 16:40.320\n true justified belief. And then this guy Gettier had this very short paper where he just produced\n\n16:40.320 --> 16:44.640\n some pretty conclusive counter examples to that. I think, you know, he wrote very few papers,\n\n16:44.640 --> 16:49.280\n but this is just, you know, you have to teach this on an undergraduate philosophy course.\n\n16:49.280 --> 16:55.280\n And then after that, you had a huge literature of people trying to address this and propose a\n\n16:55.280 --> 16:59.200\n new definition, but then someone else would come out with counter examples and then you get a new\n\n16:59.200 --> 17:02.800\n definition of knowledge and counter examples and it just went on and on and never seemed to get\n\n17:02.800 --> 17:08.800\n anywhere. So I think the thought now is let's work out how precise we need to be for what we're\n\n17:08.800 --> 17:12.880\n trying to do. And I think that's a healthier attitude. So precision is important, but you\n\n17:12.880 --> 17:19.200\n just need to work out how precise do we need to be for these purposes. Coming to Dennett and\n\n17:19.200 --> 17:28.720\n narrative theories, I mean, I think narrative theories are a plausible contender for a theory\n\n17:28.720 --> 17:38.160\n of the self, theory of my identity over time, what makes me the same person in some sense today as I\n\n17:38.160 --> 17:45.280\n was 20 years ago, given that I've changed so much physically and psychologically. One running\n\n17:45.280 --> 17:52.400\n contender is something connected to the kind of stories we tell about ourselves or maybe some\n\n17:52.400 --> 17:57.600\n story about the psychological, the chains of psychological continuity. I'm not saying I accept\n\n17:57.600 --> 18:04.000\n such a theory, but it's plausible. I don't think these theories are good as theories of consciousness,\n\n18:05.040 --> 18:12.560\n at least if we're taking consciousness just to be subjective experience, pleasure, pain, seeing\n\n18:12.560 --> 18:20.080\n color, hearing sound. I think a hamster has consciousness in that sense. There's something\n\n18:20.080 --> 18:26.240\n that it's like to be a hamster. It feels pain if you stand on it. If you're cruel enough to do,\n\n18:26.240 --> 18:31.040\n I don't know why I gave that. People always give, I don't know, philosophers give these very violent\n\n18:31.040 --> 18:34.720\n examples to get the cross consciousness and it's, yeah, I don't know why that's coming\n\n18:34.720 --> 18:43.120\n about, but anyway. You say mean things to the hamster. It experiences pain, it experiences\n\n18:43.120 --> 18:48.240\n pleasure, joy. I mean, but there's some limits to that experience of a hamster,\n\n18:48.240 --> 18:53.040\n but there is nevertheless the presence of a subjective experience. Yeah. Consciousness is\n\n18:53.040 --> 18:57.840\n just something, I mean, it's a very ambiguous word, but if we're just using it to mean some\n\n18:57.840 --> 19:03.760\n kind of experience, some kind of inner life, that is pretty widespread in the animal kingdom.\n\n19:03.760 --> 19:09.680\n A bit difficult to say where it stops, where it starts, but you certainly don't need something\n\n19:09.680 --> 19:15.520\n as sophisticated as the capacity to self consciously tell stories about yourself to just\n\n19:15.520 --> 19:23.440\n have experience. Except for cats who are evil automatons that are void of consciousness. They're\n\n19:23.440 --> 19:29.120\n the fingertips of the devil. Oh, absolutely. Yeah. I was taking that as read. I mean, Descartes\n\n19:29.120 --> 19:35.040\n thought animals were mechanisms and humans are unique. So animals are robots essentially in the\n\n19:35.040 --> 19:41.920\n formulation of Descartes and humans are unique. Yeah. So in which way would you say humans are\n\n19:41.920 --> 19:50.880\n unique versus even our closest ancestors? Like, is there something special about humans?\n\n19:52.480 --> 19:57.200\n What is in your view under the panpsychism? I guess we're walking backwards because we'll\n\n19:57.200 --> 20:03.680\n we'll have the big picture conversation about what is panpsychism, but given your kind of broad theory\n\n20:03.680 --> 20:09.920\n of consciousness, what's unique about humans, do you think? As a panpsychist, there is a great\n\n20:09.920 --> 20:18.240\n continuity between humans and the rest of the universe. There's nothing that special about\n\n20:18.240 --> 20:24.000\n human consciousness. It's just a highly evolved form of what exists throughout the universe.\n\n20:24.000 --> 20:30.000\n So we're very much continuous with the rest of the physical universe. What is unique about human\n\n20:30.000 --> 20:39.120\n beings? I suppose the capacity to reflect on our conscious experience, plan for the future,\n\n20:40.720 --> 20:48.560\n the capacity, I would say, to respond to reasons as well. I mean, animals in some sense have\n\n20:48.560 --> 20:56.480\n motivations, but when a human being makes a decision, they're responding to what philosophers\n\n20:56.480 --> 21:00.640\n called normative considerations. You know, if you're saying, should I take this job in the U.S.?\n\n21:01.520 --> 21:05.440\n You weigh it up. You say, well, you know, I'll get more money. I'll have maybe a better quality\n\n21:05.440 --> 21:11.440\n of life. But if I stay in the UK, I'll be closer to family. And you weigh up these considerations.\n\n21:11.440 --> 21:19.920\n I'm not sure any nonhuman animals quite respond to considerations of value in that way. I mean,\n\n21:19.920 --> 21:24.400\n I might be reflecting here that I'm something of an objectivist about value. I think there are\n\n21:25.440 --> 21:31.200\n objective facts about what we have reason to do and what we have reason to believe.\n\n21:31.200 --> 21:32.480\n And humans have access to those facts.\n\n21:32.480 --> 21:36.240\n And humans have access to them and can respond to them. That's a controversial claim. You know,\n\n21:36.240 --> 21:42.720\n many of my panpsychist brethren might not go for that.\n\n21:42.720 --> 21:48.480\n They would say the hamster, too, can look up to the stars and ponder theoretical physics.\n\n21:48.480 --> 21:53.120\n Maybe not, but I think it depends what you think about value. If you have a more\n\n21:54.720 --> 21:59.600\n Humean picture of value, by which I mean, relating to the philosopher David Hume,\n\n21:59.600 --> 22:05.120\n who said reason is the slave of the passions. Really, we just have motivations\n\n22:05.120 --> 22:11.120\n and what we have reason to do arises from our motivations. I'm not a Humean. I think there are\n\n22:11.120 --> 22:17.440\n objective facts about what we have reason to do. And I think we have access to them. I don't think\n\n22:17.440 --> 22:24.160\n any nonhuman animal has access to objective facts about what they have reason to do, what they have\n\n22:24.160 --> 22:30.400\n reason to believe. They don't weigh up evidence. Reason is a slave of the passions.\n\n22:30.400 --> 22:35.920\n Matthew That was David Hume's view, yeah. I mean, yeah, do you want to know my problem with Hume's?\n\n22:35.920 --> 22:40.240\n I had a radical conversion. This might not be connected. It's not connected to panpsychism,\n\n22:40.240 --> 22:46.080\n but I had a radical conversion. I used to have a more Humean view when I was a graduate student,\n\n22:46.800 --> 22:51.680\n but I was persuaded by some professors at the University of Reading where I was\n\n22:51.680 --> 23:01.680\n that if you have the Humean view, you have to say any basic life goals are equal, equally valid.\n\n23:03.120 --> 23:09.680\n So for example, let's take someone whose basic goal in life is counting blades of grass, right?\n\n23:10.240 --> 23:15.520\n And crucially, they don't enjoy it, right? This is the crucial point. They get no pleasure from it.\n\n23:15.520 --> 23:20.800\n That's just their basic goal to spend their life counting as many blades of grass\n\n23:20.800 --> 23:24.000\n as possible. Not for some greater goal. That's just their basic goal.\n\n23:25.840 --> 23:31.280\n I want to say that that is objectively stupid. That is objectively pointless.\n\n23:31.280 --> 23:38.320\n I shouldn't say stupid. It's objectively pointless in a way that pursuing pleasure\n\n23:38.320 --> 23:43.120\n or pursuing someone else's pleasure or pursuing scientific inquiry is not pointless.\n\n23:43.120 --> 23:47.920\n As soon as you make that admission, you're not a follower of David Hume anymore. You think\n\n23:47.920 --> 23:52.640\n there are objective facts about what goals are worth pursuing.\n\n23:54.240 --> 24:00.720\n Is it possible to have a goal without pleasure? So this kind of idea that you disjoint the two.\n\n24:01.360 --> 24:06.960\n So the David Foster Wallace idea of, you know, the key to life is to be unboreable.\n\n24:06.960 --> 24:13.840\n Isn't it possible to discover the pleasure in everything in life? The counting of the\n\n24:13.840 --> 24:19.440\n blades of grass. Once you see the mastery, the skill of it, you can discover the pleasure.\n\n24:19.440 --> 24:26.720\n Therefore, you know, I guess what I'm asking is why and when and how did you lose the romance\n\n24:26.720 --> 24:30.960\n in grad school? Is that what you're trying to say?\n\n24:30.960 --> 24:36.640\n I think it may or may not be true that it's possible to find pleasure in everything.\n\n24:37.440 --> 24:43.040\n But I think it's also true that people don't act solely for pleasure. And they certainly\n\n24:43.040 --> 24:49.280\n don't act solely for their own pleasure. People will suffer for things they think are worthwhile.\n\n24:49.280 --> 24:56.560\n I might, you know, I might suffer for some scientific cause for finding out a cure for\n\n24:56.560 --> 25:04.480\n the pandemic. And in terms of my own pleasure, I might have less pleasure in doing that. But I\n\n25:04.480 --> 25:09.600\n think it's worthwhile. It's a worthwhile thing to do. I just don't think it's the case that\n\n25:09.600 --> 25:14.400\n everything we do is rooted in maximizing our own pleasure. I don't think that's even\n\n25:14.400 --> 25:15.600\n psychologically plausible.\n\n25:15.600 --> 25:19.360\n But pleasure, then that's a narrow kind of view of pleasure. That's like a short term\n\n25:19.360 --> 25:26.400\n pleasure. But you can see pleasure is a kind of ability to hear the music in the distance.\n\n25:26.400 --> 25:33.440\n It's like, yes, it's difficult now. It's suffering now. But there's some greater thing beyond\n\n25:33.440 --> 25:39.040\n the mountain. That will be joy. I mean, that's kind of a, even if it's not in this life.\n\n25:40.240 --> 25:46.400\n Well, you know, the warriors will meet in Valhalla, right? The feeling that gives meaning\n\n25:46.400 --> 25:51.680\n and fulfillment to life is not necessarily grounded in pleasure of like the counting\n\n25:51.680 --> 26:00.160\n of the grass. It's something else. I don't know. The struggle is a source of deep fulfillment.\n\n26:00.160 --> 26:06.560\n So like, I think pleasure needs to be kind of thought of as a little bit more broadly.\n\n26:06.560 --> 26:15.760\n It just kind of gives you this sense. It for a moment allows you to forget the terror of\n\n26:15.760 --> 26:22.400\n the fact that you're going to die. That's pleasure. Like that's the broader view of\n\n26:22.400 --> 26:30.560\n pleasure that you get to kind of play in the little illusion that all of this has deep\n\n26:30.560 --> 26:32.640\n meaning. That's pleasure.\n\n26:32.640 --> 26:41.200\n Yeah. Well, but I mean, you know, people sacrifice their lives. Atheists may sacrifice their\n\n26:41.200 --> 26:46.080\n lives for the sake of someone else or for the sake of something important enough. And\n\n26:46.080 --> 26:51.760\n clearly in that case, they're not doing it for the sake of their own pleasure. That's a rather\n\n26:51.760 --> 26:59.040\n dramatic example, but they can be just trivial examples where, you know, I choose to be honest\n\n26:59.040 --> 27:06.560\n rather than lie about something. Can I lose out a bit? And I have a bit less pleasure, but I thought\n\n27:06.560 --> 27:10.480\n it was worth doing the honest thing or something. I mean, I just think, so that's a, I mean, maybe\n\n27:10.480 --> 27:14.400\n you can use the word pleasure so broadly that you're just essentially meaning something.\n\n27:14.400 --> 27:19.440\n Worthwhile, but then I think the word pleasure, maybe, maybe loses its meaning.\n\n27:20.320 --> 27:24.160\n Sure. Well, but what do you think about the blades of grass case? What do you think about\n\n27:24.160 --> 27:27.600\n someone who spends their life counting blades of grass and doesn't enjoy it?\n\n27:28.160 --> 27:35.120\n So I think, I personally think it's impossible or maybe I'm not understanding even like the\n\n27:35.120 --> 27:39.200\n philosophical formulation, but I think it's impossible to have a goal and not draw pleasure\n\n27:39.200 --> 27:46.400\n from it. Make it worthwhile, forget the word pleasure. I think the word goal loses meaning.\n\n27:46.400 --> 27:52.720\n If I say I'm going to count the number of pens on this table, if I'm actively involved in the task,\n\n27:52.720 --> 28:01.680\n I will find joy in it. I will find, like, I think there's a lot of meaning and joy to be discovered\n\n28:01.680 --> 28:11.280\n in the skill of a task, in mastering of a skill and taking pride in doing it well. I mean, that's,\n\n28:12.320 --> 28:18.800\n I don't know what it is about the human mind, but there's some joy to be discovered in the mastery\n\n28:18.800 --> 28:24.320\n of a skill. So I think it's just impossible to count blades of grass and not sort of have the\n\n28:24.320 --> 28:33.280\n gyro dreams of sushi compelling, like draws you into the mastery of the simple task.\n\n28:33.280 --> 28:40.480\n Hmm. Yeah, I suppose, I mean, in a way you might think it's just hard to imagine someone who would\n\n28:41.600 --> 28:47.760\n spend their lives doing that, but then maybe that's just because it's so evident that that is\n\n28:47.760 --> 28:54.800\n a pointless task. Whereas if we take this David Hume view seriously, it ought to be, you know,\n\n28:54.800 --> 29:01.520\n a totally possible life goal. Whereas, I mean, yeah, I guess I just find it hard to shake the\n\n29:01.520 --> 29:09.840\n idea that some ways of some life goals are more worthwhile than others. And it doesn't mean,\n\n29:09.840 --> 29:14.880\n you know, that there's a one single way you should lead your life, but pursuing knowledge,\n\n29:14.880 --> 29:23.120\n helping people, pursuing your own pleasure to an extent are worthwhile things to do in a way that,\n\n29:23.120 --> 29:29.680\n you know, for example, I have, I'm a little bit OCD. I still feel inclined to walk on cracks in\n\n29:29.680 --> 29:34.640\n the pavement or do it symmetrically. Like if I step on a crack with my left foot, I feel the need\n\n29:34.640 --> 29:40.320\n to do it with my right foot. And I think that's kind of pointless. It's something I feel the urge\n\n29:40.320 --> 29:46.720\n to do, but it's pointless. Whereas other things I choose to do, I think there's, it's worth doing.\n\n29:46.720 --> 29:52.480\n And it's hard to make sense of metaphysically, what could possibly ground that? How could we\n\n29:52.480 --> 29:56.560\n know about these facts? But that's the starting point for me.\n\n29:56.560 --> 30:05.120\n I don't know. I think you walking on the sidewalk in a way that's symmetrical brings order to the\n\n30:05.120 --> 30:10.400\n world. Like if you weren't doing that, the world might fall apart. And you, it feels like that.\n\n30:11.600 --> 30:20.880\n I think there's, there's, there's meaning in that. Like you embracing the full, like the full\n\n30:20.880 --> 30:26.320\n experience of that, you living the richness of that as if it has meaning, will give meaning to it.\n\n30:26.320 --> 30:32.480\n And then whatever genius comes of that as you as a one little intelligent aunt will make a better\n\n30:32.480 --> 30:37.600\n life for everybody else. Perhaps I'm defending the blades of grass example, because I can literally\n\n30:37.600 --> 30:43.040\n imagine myself enjoying this task as somebody who's OCD in a certain kind of way in quantitative.\n\n30:43.040 --> 30:45.680\n But now you're ruining the exam because you imagine someone enjoying it. I'm imagining\n\n30:45.680 --> 30:52.320\n someone who doesn't enjoy it. We don't want a life that's just full of pleasure. Like we just sit\n\n30:52.320 --> 30:58.080\n there, you know, having a big sugar high all the time. We want a life where we do things that are\n\n30:58.080 --> 31:05.520\n worthwhile. If for something to be worthwhile, just is for it to be a basic life goal, then\n\n31:08.240 --> 31:12.080\n that, that mode of reflection doesn't really make sense. We can't really think,\n\n31:12.080 --> 31:18.240\n did I do things worthwhile on the, on the David Hume type picture? All it is for something to be\n\n31:18.240 --> 31:23.360\n worthwhile is it was a basic goal of yours or derived from a basic goal. And yeah.\n\n31:23.360 --> 31:31.760\n Yeah. I mean, I think goal and worthwhile aren't, I think goal is a boring word. I'm more sort of\n\n31:31.760 --> 31:37.600\n existential. It's like, did you ride the roller coaster of life? Did you fully experience life\n\n31:38.400 --> 31:44.800\n that, and in that sense, I mean, the blaze of grass is something that could be deeply joyful.\n\n31:44.800 --> 31:50.000\n And that's in that way, I think suffering could be joyful in the full context of life. It's the\n\n31:50.000 --> 31:55.600\n roller coaster of life. Like without suffering, without struggle, without pain, without depression,\n\n31:55.600 --> 32:00.800\n with sadness, there's not the highs. I mean, that's this, that's a fucked up thing about life is that\n\n32:02.640 --> 32:13.920\n the lows really make the highs that much richer and deeper and, and like taste better. Right. Like\n\n32:13.920 --> 32:20.960\n the, like I was, I tweeted this, I was, I couldn't sleep and I was like late at night.\n\n32:21.680 --> 32:32.480\n And I know it's like a obvious statement, but like every love story eventually, you know,\n\n32:32.480 --> 32:42.960\n ends in loss in tragedy. So like this feeling of love at the end, there's always going to be\n\n32:42.960 --> 32:49.040\n tragedy. Even if it's the most amazing lifelong love with another human being,\n\n32:50.080 --> 32:57.120\n one of you is going to die. And I don't know which is worse, but both, both are not going to be pretty.\n\n32:57.760 --> 33:04.000\n And so that, the sense that it's finite, the sense that it's going to end in a low,\n\n33:04.720 --> 33:12.000\n that gives like richness to those kind of evenings when you realize this fucking thing ends,\n\n33:12.000 --> 33:20.640\n this thing ends. The feeling that it ends, that bad taste, that bad feeling that it ends\n\n33:20.640 --> 33:25.600\n gives meaning, gives joy, gives, I don't know, pleasure is this loaded word, but\n\n33:26.640 --> 33:34.000\n gives some kind of a deep pleasure to the experience when it's good. And I mean, and that's\n\n33:34.000 --> 33:43.120\n the Blades of Grass, you know, they have that to me. But you're perhaps right that it's like\n\n33:43.840 --> 33:50.880\n reducing it to set of goals or something like that is kind of removing the magic of life.\n\n33:50.880 --> 33:57.440\n Because I think what makes counting the Blades of Grass joyful is just because it's life.\n\n33:57.440 --> 34:04.240\n Okay. So it sounds like you, it sounds like you reject the David Hume type picture anyway,\n\n34:04.240 --> 34:08.880\n because you're saying just because you have it as a goal, that's what it is to be worthwhile.\n\n34:08.880 --> 34:12.400\n But you're saying, no, it's because it's engaging with life, riding the roller coaster.\n\n34:14.000 --> 34:20.400\n So that does sound like in some sense, there are facts independent of our personal goal choices\n\n34:20.400 --> 34:24.800\n about what it means to live a good life. And I mean, coming back full circle to\n\n34:24.800 --> 34:29.520\n the start of this was what makes us different to animals. I don't think at the end of a hamster's\n\n34:29.520 --> 34:34.560\n life, it's it thinks, did I ride the roller coaster? Did I really live life to the full?\n\n34:34.560 --> 34:39.360\n That is not a mode of reflection that's available to non human animals. So\n\n34:40.720 --> 34:48.080\n what do you think is the role of death? And in all of this, the fear of death? Does that\n\n34:48.080 --> 34:57.200\n interplay with consciousness? Does this self reflection? Do you think there's some deep\n\n34:57.200 --> 35:05.680\n connection between this ability to contemplate the fact that the our flame of consciousness\n\n35:05.680 --> 35:13.120\n eventually goes out? Yeah, I don't think unfortunately panpsychism helps particularly\n\n35:13.120 --> 35:20.160\n with life after death, because for the panpsychist, there's nothing supernatural.\n\n35:20.160 --> 35:26.240\n There's nothing beyond the physical. All there is really is ultimately particles and fields.\n\n35:26.240 --> 35:30.320\n It's just that we think the ultimate nature of particles and fields is consciousness.\n\n35:30.960 --> 35:41.200\n But I guess when the matter in my brain ceases to be ordered in a way that\n\n35:41.200 --> 35:48.720\n sustains the particular kind of consciousness I enjoy in waking life, then in some sense,\n\n35:48.720 --> 35:54.720\n I will I will cease to be although I do that the final chapter of my book Galileo's error\n\n35:54.720 --> 36:01.280\n is more experimental. So the first four chapters of the cold blooded case for the panpsychist\n\n36:01.280 --> 36:05.920\n view is that the best solution to the hard problem of consciousness. The last chapter\n\n36:05.920 --> 36:10.080\n we talk about meaning. Yeah, I talk about meaning to about free will. And I talk about\n\n36:10.080 --> 36:17.600\n mystical experiences. So I always want to emphasize that panpsychism is not necessarily\n\n36:17.600 --> 36:22.880\n connected to anything spiritual. You know, a lot of people defending this view, like David Chalmers\n\n36:22.880 --> 36:29.520\n or Luke Roloffs are just total atheist secularists, right? They don't believe in any kind of\n\n36:29.520 --> 36:34.960\n transcendent reality. They just believe in feelings, you know, mundane consciousness and\n\n36:34.960 --> 36:42.800\n think that needs explaining in our conventional scientific approach can't cut it. But if for\n\n36:42.800 --> 36:48.960\n independent reasons you are motivated to some spiritual picture of reality, then maybe a\n\n36:48.960 --> 36:55.920\n panpsychist view is more consonant with that. So if you if you have a mystical experience where you\n\n36:57.600 --> 37:03.840\n it seems to you in this experience that there is this higher form of consciousness at the\n\n37:03.840 --> 37:08.560\n root of all things. If you're a materialist, you've got to think that's a delusion. You know,\n\n37:08.560 --> 37:12.800\n there's just something in your brain making you think that it's not real. But if you're a\n\n37:12.800 --> 37:19.760\n panpsychist and you already think the fundamental nature of reality is constituted of consciousness,\n\n37:19.760 --> 37:27.040\n it's not that much of a leap to think that this higher form of consciousness you seem to\n\n37:27.040 --> 37:33.120\n apprehend in the mystical experience is part of that underlying reality. And, you know, in many\n\n37:33.120 --> 37:41.040\n different cultures, experienced meditators have claimed to have experiences in which it becomes\n\n37:41.040 --> 37:47.920\n apparent to them that there is an element of consciousness that is universal. So this is\n\n37:47.920 --> 37:54.880\n sometimes called universal consciousness. So on this view, your mind and my mind are not\n\n37:56.160 --> 38:02.240\n totally distinct. Each of our individual conscious minds is built upon the foundations\n\n38:02.240 --> 38:07.360\n of universal consciousness. And universal consciousness as it exists in me is one and\n\n38:07.360 --> 38:14.000\n the same thing as universal consciousness as it exists in you. So I've never had one of these\n\n38:14.000 --> 38:21.920\n experiences. But if one is a panpsychist, I think one is more open to that possibility. I don't see\n\n38:21.920 --> 38:27.760\n why it shouldn't be the case that that is part of the nature of consciousness and maybe something\n\n38:27.760 --> 38:32.720\n that is apparent in certain deep states of meditation. And so what I explore in the\n\n38:32.720 --> 38:40.320\n experimental final chapter of my book is that could allow for a kind of impersonal life after\n\n38:40.320 --> 38:47.760\n death. Because if that view is true, then even when the particular aspects of my conscious\n\n38:47.760 --> 38:55.120\n experience fall away, that element of universal consciousness at the core of my identity would\n\n38:55.120 --> 39:00.240\n continue to exist. So I'd sort of be, as it were, absorbed into universal consciousness.\n\n39:00.240 --> 39:10.240\n So Buddhists and Hindu mystics try to meditate to get rid of all the bad karma to be absorbed into\n\n39:10.240 --> 39:16.160\n universal consciousness. It could be that if there's no karma, if there's no reverb, maybe\n\n39:16.160 --> 39:21.600\n everyone gets enlightened when they die. Maybe you just sink back into universal consciousness.\n\n39:21.600 --> 39:30.720\n So I also, coming back to morality, suggest this could provide some kind of basis for altruism or\n\n39:30.720 --> 39:38.080\n non egotism. Because if you think egotism implicitly assumes that we are utterly distinct\n\n39:38.080 --> 39:44.880\n individuals, whereas on this view, we're not, we overlap to an extent that something at the core\n\n39:44.880 --> 39:52.000\n of our being is even in this life, we overlap. That would be this view that some experienced\n\n39:52.000 --> 39:57.440\n meditators claim becomes apparent to them that there is something at the core of my identity\n\n39:58.560 --> 40:04.960\n that is one and the same as the thing at the core of your identity, this universal consciousness.\n\n40:05.680 --> 40:12.320\n Yeah, there is something very, like you and I in this conversation, there's a few people listening\n\n40:12.320 --> 40:20.480\n to this, all of us are in a kind of single mind together. There's some small aspect of that,\n\n40:22.000 --> 40:27.840\n or maybe a big aspect about us humans. So certainly in a space of ideas, we kind of\n\n40:29.360 --> 40:36.160\n meld together for time, at least in a conversation and kind of play with that idea. And then we're\n\n40:36.160 --> 40:41.040\n clearly all thinking, like if I say pink elephant, there's going to be a few people that are now\n\n40:41.040 --> 40:46.800\n visualizing a pink elephant. We're all thinking about that pink elephant together. We're all in\n\n40:46.800 --> 40:54.560\n the room together thinking about this pink elephant and we're like rotating it in our minds\n\n40:54.560 --> 41:01.440\n together. What is that? Is there a different instantiation of that pink elephant in everybody's\n\n41:01.440 --> 41:06.400\n mind or is it the same elephant? And we have the same mind exploring that elephant. Now,\n\n41:06.400 --> 41:11.920\n if we in our mind start petting that elephant, like touching it, that experience that we're now\n\n41:11.920 --> 41:17.200\n like thinking what that would feel like, what's that? Is that all of us experiencing that together\n\n41:17.200 --> 41:22.480\n or is that separate? So like there's some aspect of the togetherness that almost seems fundamental\n\n41:22.480 --> 41:29.040\n to civilization, to society. Hopefully that's not too strong, but to like some of the fundamental\n\n41:29.040 --> 41:35.440\n properties of the human mind, it feels like the social aspect is really important. We call it\n\n41:35.440 --> 41:41.600\n social because we think of us as individual minds interacting, but if we're just like one collective\n\n41:41.600 --> 41:48.560\n mind with like fingertips, they're like touching each other as it's trying to explore the elephant,\n\n41:49.120 --> 41:54.640\n but that could be just in the realm of ideas and intelligence and not in the realm of consciousness\n\n41:54.640 --> 42:00.160\n and it's interesting to see maybe it is in the realm of consciousness. Yeah, so it's obviously\n\n42:00.160 --> 42:05.440\n certainly true in some sense that there are these phenomena that you're talking about of\n\n42:06.320 --> 42:12.400\n collective consciousness in some sense. I suppose the question is how ontologically\n\n42:12.400 --> 42:17.680\n serious do we want to be about those things? By which I mean, are they just a construction\n\n42:17.680 --> 42:24.320\n of out of our minds and the fact that we interact in the standardly scientifically accepted ways\n\n42:24.960 --> 42:28.400\n or is as someone like Rupert Sheldrake would think that there is some\n\n42:28.400 --> 42:33.680\n metaphysical reality, there are some fields beyond the scientifically understood ones that\n\n42:33.680 --> 42:39.120\n are somehow communicating this. I mean, I think that, I mean, the view I was describing was that\n\n42:39.120 --> 42:45.520\n this element we're supposed to have in common is some sort of pure impersonal consciousness or\n\n42:45.520 --> 42:49.600\n something rather than. So actually, I mean, an interesting figure is the Australian philosopher\n\n42:49.600 --> 42:58.240\n Miri Al Bahari, who defends a kind of mystical conception of reality rooted in a advice of Adanta\n\n42:58.240 --> 43:04.800\n mysticism. But like me, she's from this tradition of analytic philosophy. And so she defends this\n\n43:04.800 --> 43:09.200\n in this, you know, incredibly precise, rigorous way. She defends the idea that we should think\n\n43:09.200 --> 43:18.160\n of experienced meditators as providing expert testimony. So, you know, I think humans cause\n\n43:18.160 --> 43:22.960\n a causing climate breakdown. I have no idea of the science behind it, you know, but I trust the\n\n43:22.960 --> 43:27.760\n experts or, you know, that the universe is 14 billion years old. You know, most of our knowledge\n\n43:27.760 --> 43:33.600\n is based on expert testimony. And she thinks we should think of experienced meditators,\n\n43:33.600 --> 43:37.920\n these people who are telling us about this universal consciousness at the core of our being\n\n43:37.920 --> 43:43.920\n as a relevant kind of expert. And so she wants to defend the rational acceptability of this\n\n43:43.920 --> 43:49.280\n mystical conception of reality. So it's what, you know, I think we shouldn't be ashamed, you know,\n\n43:49.280 --> 43:56.240\n we shouldn't be worried about dealing with certain views as long as it's done with rigor\n\n43:56.240 --> 44:01.120\n and seriousness. You know, I think sometimes terms like, I don't know, new age or something\n\n44:01.120 --> 44:07.520\n can function a bit like racist terms. You know, a racist term picks out a group of people, but then\n\n44:07.520 --> 44:11.840\n implies certain negative characteristics. So people use this term, you know, to pick out a\n\n44:11.840 --> 44:19.040\n certain set of views like mystical conception of reality and imply it's kind of fluffy thinking or,\n\n44:19.040 --> 44:25.200\n but, you know, you read Marielle Bihari, you read Luke Roloff's, this is serious, rigorous thought,\n\n44:25.200 --> 44:28.960\n whether you agree with it or not, obviously it's hugely controversial. And so, you know,\n\n44:28.960 --> 44:34.080\n the enlightenment ideal is to follow the evidence and the arguments where they lead.\n\n44:35.280 --> 44:40.000\n But it's kind of very hard for human beings to do that. I think we get stuck in some conception of\n\n44:40.000 --> 44:48.080\n how we think science ought to look. And, you know, people talk about religion as a crutch,\n\n44:48.080 --> 44:54.240\n but I think a certain kind of scientism, a certain conception of how science is supposed to be,\n\n44:54.240 --> 45:01.760\n gets into people's identity and their sense of themselves and their security. And make things\n\n45:01.760 --> 45:10.240\n hard if you're a panpsychist. And even the word expert becomes a kind of crutch. I mean, you use\n\n45:10.240 --> 45:16.320\n the word expert. You have some kind of conception of what expertise means. Oftentimes that's,\n\n45:16.880 --> 45:22.000\n you know, connected with a degree, a particularly prestigious university or something like that. Or,\n\n45:22.480 --> 45:30.000\n or it's, you know, expertise is a funny one. I've noticed that anybody sort of that claims\n\n45:30.000 --> 45:36.400\n they're an expert is usually not the expert. The biggest quote unquote expert that I've ever met\n\n45:36.400 --> 45:41.520\n are the ones that are truly humble. So the humility is a really good sign of somebody\n\n45:42.080 --> 45:47.920\n who's traveled a long road and been humbled by how little they know. So some of the best people\n\n45:47.920 --> 45:52.400\n in the world at whatever the thing they've spent their life doing are the ones that are ultimately\n\n45:52.400 --> 45:59.440\n humble in the face of it all. So like, just being humble for how little we know, even if we travel\n\n45:59.440 --> 46:06.480\n a lifetime. I do like the idea. I mean, treating sort of like, what is it, psychonauts, like an\n\n46:06.480 --> 46:13.120\n expert witness, you know, people who have traveled with the help of DMT to another place where they\n\n46:14.000 --> 46:21.120\n got some deep understanding of something. And their insight is perhaps as valuable as the insight\n\n46:21.120 --> 46:27.120\n of somebody who ran rigorous psychological studies at Princeton University or something.\n\n46:27.920 --> 46:34.880\n Like those psychonauts, they have wisdom, if it's done rigorously, which you can also do rigorously\n\n46:34.880 --> 46:40.160\n within the university, within the studies now, with psilocybin and those kinds of things. Yeah,\n\n46:40.160 --> 46:45.440\n that's a fact that's fascinating. Still probably the best, one of the best works on mystical\n\n46:45.440 --> 46:52.320\n experience is the chapter in William James's Varieties of Religious Experiences. And most of\n\n46:52.320 --> 46:57.680\n it is just a psychological study of trying to define the characteristics of mystical experience\n\n46:57.680 --> 47:04.080\n as a psychological type. But at the end, he considers the question, if you have a mystical\n\n47:04.080 --> 47:09.760\n experience, is it rational to trust it, to trust that it's telling you something about reality?\n\n47:09.760 --> 47:15.600\n Something about reality. And he makes an interesting argument. He says, if you say no, you're kind of\n\n47:15.600 --> 47:22.000\n applying a double standard because we all think it's okay to trust our normal sensory experiences,\n\n47:23.040 --> 47:29.440\n but we have no way of getting outside of ourselves to prove that our sensory experiences correspond\n\n47:29.440 --> 47:33.840\n to an external reality. We could be in the matrix. This could be a very vivid dream.\n\n47:33.840 --> 47:43.360\n You could say, oh, we do science, but a scientist only gets their data by experiencing the results\n\n47:43.360 --> 47:47.120\n of their experiments. And then the question arises again, how do you know that corresponds\n\n47:47.120 --> 47:52.720\n to a real world? So he thinks there's a sort of double standard in saying, it's okay to trust\n\n47:52.720 --> 47:58.480\n our ordinary sensory experiences, but it's not okay for the person on DMT to trust those experiences.\n\n47:58.480 --> 48:04.960\n It's very philosophically difficult to say, why is it okay in the one case and not the other? So I\n\n48:04.960 --> 48:09.760\n think there's an interesting argument there, but I would like to just defend experts a little bit.\n\n48:09.760 --> 48:15.520\n I mean, I agree it's very difficult, but especially in an age, I guess, where there's so much\n\n48:15.520 --> 48:26.160\n information, I do think it's important to have some protection of sources of information,\n\n48:26.160 --> 48:31.360\n academic institutions that we can trust. And then that's difficult because of course there are\n\n48:31.360 --> 48:36.640\n non academics who do know what they're talking about. But like, if I'm interested in knowing\n\n48:36.640 --> 48:42.880\n about biology, you know, you can't research everything. So I think we have to have some sense\n\n48:42.880 --> 48:50.640\n of who are the experts we can trust, the people who've spent a lot of time reading all the material\n\n48:50.640 --> 48:58.080\n that people have read, written, thinking about it, having their views torn apart by other people\n\n48:58.080 --> 49:02.240\n working in the field. I think that is very important. And also to protect that from conflicts\n\n49:02.240 --> 49:07.680\n of interest. There is a so called think tank in the UK called the Institute of Economic Affairs,\n\n49:07.680 --> 49:14.960\n who are always on the BBC as experts on economic questions and they do not declare who funds them.\n\n49:14.960 --> 49:21.680\n Right. So we don't know who's paying the paper. I think, you know, you shouldn't be allowed to call\n\n49:21.680 --> 49:26.480\n yourself a think tank if you're not totally transparent about who's funding you. So I think\n\n49:26.480 --> 49:32.560\n that's it. And I mean, this connects to panpsychism because I think the reason people, you know,\n\n49:33.200 --> 49:37.920\n worry about unorthodox ideas is because they worry about how do we know when we're just\n\n49:37.920 --> 49:42.000\n losing control or losing discipline. So I do think we need to somehow protect\n\n49:42.000 --> 49:49.120\n academic institutions as sources of information that we can trust. And, you know, in philosophy,\n\n49:49.120 --> 49:55.840\n there's, you know, there's not much consensus on everything, but you can at least know what people\n\n49:56.320 --> 50:01.840\n who have put the time in to read all the stuff, what they think about these issues. I think that\n\n50:01.840 --> 50:07.360\n is important. To push back and you push back. Who are the experts on COVID?\n\n50:07.360 --> 50:12.720\n Who are the experts on COVID? Oh, again, it's a dangerous territory now.\n\n50:12.720 --> 50:17.680\n Well, let me just speak to it because I am walking through that dangerous territory.\n\n50:18.400 --> 50:31.360\n I'm allergic to the word expert because in my simple mind, it kind of rhymes with ego.\n\n50:31.360 --> 50:40.320\n There's something about experts. If we allow too much to have a category expert and place\n\n50:40.320 --> 50:45.200\n certain people in them, those people sitting on the throne start to believe it.\n\n50:46.720 --> 50:51.840\n And they start to communicate with that energy and the humility starts to dissipate.\n\n50:51.840 --> 51:03.440\n I think there is value in a lifelong mastery of a skill and the pursuit of knowledge within a very\n\n51:03.440 --> 51:09.680\n specific discipline. But the moment you have your name on an office, the moment you're an expert,\n\n51:10.240 --> 51:18.160\n I think you destroy the very aspect, the very value of that journey towards knowledge.\n\n51:18.160 --> 51:26.480\n So some of it probably just reduces to skillful communication. Communicate in a way that shows\n\n51:26.480 --> 51:33.200\n humility, that shows an open mindedness, that shows an ability to really hear what a lot of\n\n51:33.200 --> 51:39.680\n people are saying. So in the case of COVID, what I've noticed, and this is probably true with\n\n51:39.680 --> 51:48.400\n panpsychism as well, is so called experts, and they are extremely knowledgeable, many of them\n\n51:48.400 --> 51:55.280\n are colleagues of mine, they dismiss what millions of people are saying on the internet\n\n51:55.840 --> 52:02.240\n without having looked into it. With empathy and rigor, honestly, understand what are the\n\n52:02.240 --> 52:06.720\n arguments being made. They say like, there's not enough time to explore all those things,\n\n52:06.720 --> 52:13.360\n like there's so much stuff out there. Yeah, I think that's intellectual laziness. If you don't\n\n52:13.360 --> 52:19.840\n have enough time, then don't speak so strongly with dismissal. Feel bad about it. Be apologetic\n\n52:19.840 --> 52:25.600\n about the fact that you don't have enough time to explore the evidence. For example, with the heat\n\n52:25.600 --> 52:34.560\n I got with Francis Collins is that he kind of said that lab leak, he kind of dismissed the\n\n52:34.560 --> 52:41.680\n heat. He kind of dismissed it, showing that he didn't really deeply explore all the sort of,\n\n52:41.680 --> 52:48.320\n the huge amount of circumstantial evidence out there, the battles that are going on out there.\n\n52:48.320 --> 52:55.360\n There's a lot of people really tensely discussing this and being, showing humility in the face\n\n52:55.920 --> 53:00.800\n of that battle of ideas, I think is really important. And I just been very disappointed\n\n53:00.800 --> 53:07.200\n in so called expertise in the space of science and showing humility and showing humanity and\n\n53:07.200 --> 53:14.400\n kindness and empathy towards other human beings. That's, at the same time, obviously, I love\n\n53:15.200 --> 53:23.040\n Jiro Junsu's sushi lifelong pursuit of like getting, like in computer science, Don Knuth,\n\n53:23.680 --> 53:28.560\n like some of my biggest heroes are people that like, when nobody else cares,\n\n53:28.560 --> 53:34.320\n they stay on one topic for their whole life and they just find the beautiful little things about\n\n53:34.320 --> 53:39.680\n there's puzzles they keep solving. And yes, sometimes a virus happens or something happens\n\n53:39.680 --> 53:46.720\n with that person with their puzzles becomes like the center of the whole world because that puzzles\n\n53:46.720 --> 53:51.760\n becomes all of a sudden really important, but still there's possibilities on them to show humility\n\n53:51.760 --> 53:56.080\n and to be open minded to the fact that they, even if they spent their whole life doing it,\n\n53:56.080 --> 54:01.920\n even if their whole community is telling them, giving them awards and giving them citations\n\n54:01.920 --> 54:07.200\n and giving them all kinds of stuff where like they're bowing down before them, how smart they\n\n54:07.200 --> 54:13.840\n are, they still know nothing relative to all the stuff, the mysteries that are out there.\n\n54:13.840 --> 54:18.800\n Yeah, well, I don't know how much we're disagreeing. I mean, these are totally valid issues and of\n\n54:18.800 --> 54:24.480\n course, expertise goes wrong in all sorts of ways. It's totally fallible. I suppose\n\n54:24.480 --> 54:32.480\n I would just say, what is the alternative? What do we just say? All information is equal.\n\n54:32.480 --> 54:41.600\n Because as a voter, I've got to decide who to vote for and I've got to evaluate and I can't\n\n54:41.600 --> 54:52.000\n look into all of the economics and all of the relevant science. And so I just think maybe it's\n\n54:52.000 --> 54:56.720\n like Churchill said about democracy, it's the worst system of government apart from all the rest.\n\n54:57.360 --> 55:01.360\n I think about panpsychism, it's the worst theory of consciousness apart from all the rest.\n\n55:01.360 --> 55:09.120\n But I just think expertise, the peer review system, I think it's terrible in so many ways.\n\n55:09.600 --> 55:15.760\n Yes, people should show more humility, but I can't see a viable alternative. I think\n\n55:15.760 --> 55:20.560\n philosopher Bernard Williams had a really nice nuanced discussion of the problems of titles\n\n55:20.560 --> 55:29.840\n and how they also function in a society. They do have some positive function. The very first time\n\n55:29.840 --> 55:40.480\n I lectured in philosophy before I got a professorship was teaching at a continuing\n\n55:40.480 --> 55:48.400\n education college. So it's kind of retired people who want to learn some more things. And I just\n\n55:48.400 --> 55:54.480\n totally pitched it too high. And Gait talked about Bernard Williams on titles and hierarchies.\n\n55:54.480 --> 56:00.800\n And these kind of people in their 70s and 80s would just instantly started interrupting saying,\n\n56:00.800 --> 56:07.360\n what is philosophy? And it was a disaster. And I just remember in the breaks, a sort of elderly\n\n56:07.360 --> 56:14.400\n lady came up and said, I've decided to take Egyptology instead. But that was my introduction\n\n56:14.400 --> 56:21.920\n to teaching. Anyway. But sort of titles and accomplishments is a nice starting point,\n\n56:21.920 --> 56:28.880\n but doesn't buy you the whole thing. So you don't get to just say, this is true because I'm an\n\n56:28.880 --> 56:34.960\n expert. You still have to convince people. One of the things I really like to practice martial arts.\n\n56:34.960 --> 56:42.160\n Yeah. And for people who don't know, Brazilian Jiu Jitsu is one of them. And you sometimes wear\n\n56:42.160 --> 56:47.840\n these pajamas, pajama looking things, and you wear a belt. So I happen to be a black belt in\n\n56:47.840 --> 56:53.760\n Brazilian Jiu Jitsu. And I also train in what's called no gi, so you don't wear the pajamas.\n\n56:54.400 --> 57:00.480\n And when you don't wear the pajamas, nobody knows what rank you are. Nobody knows if you're a black\n\n57:00.480 --> 57:06.640\n belt or a white belt or if you're a complete beginner or not. And when you wear the pajamas\n\n57:06.640 --> 57:13.440\n called the gi, you wear the rank. And people treat you very differently. When they see my black belt,\n\n57:13.440 --> 57:20.720\n they treat me differently. They kind of defer to my expertise. If they're kicking my ass,\n\n57:21.360 --> 57:30.720\n that's probably because like I am working on something like new or maybe I'm letting them win.\n\n57:30.720 --> 57:35.600\n But when there's no belts and it doesn't matter if I've been doing this for 15 years,\n\n57:35.600 --> 57:42.160\n it doesn't matter. None of it matters. What matters is the raw interaction of just trying\n\n57:42.160 --> 57:48.000\n to kick each other's ass and seeing like, what is this chess game, like a human chess?\n\n57:49.280 --> 57:54.720\n Who, what are the ideas that we're playing with? And I think there's a dance there. Yes,\n\n57:54.720 --> 58:00.800\n it's valuable to know a person as a black belt when you take consideration of the advice of\n\n58:00.800 --> 58:04.320\n different people, me versus somebody who's only practiced for like a couple of days.\n\n58:04.320 --> 58:12.240\n But at the same time, the raw practice of ideas that is combat and the raw practice of exchange\n\n58:12.240 --> 58:20.160\n of ideas that is science needs to often throw away expertise. And in communicating, like there's\n\n58:20.160 --> 58:26.480\n another thing to science and expertise, which is leadership. It's not just, so the scientific\n\n58:26.480 --> 58:33.120\n method in the review process is this rigorous battle of ideas between scientists. But there's\n\n58:33.120 --> 58:39.760\n also a stepping up and inspiring the world and communicating ideas to the world. And that skill\n\n58:39.760 --> 58:47.200\n of communication, I suppose that's my biggest criticism of so called experts in science.\n\n58:47.200 --> 58:52.960\n Is there just shitty communicators? Absolutely. Yeah. Well, I can tell you, I get very frustrated\n\n58:52.960 --> 59:00.480\n with philosophers not reaching out more. I mean, I think it might be partly that we're trained to\n\n59:00.480 --> 59:06.880\n get watertight arguments, respond to all objections. And as you do that, eventually it\n\n59:06.880 --> 59:15.840\n gets more complicated and the jargon comes in. So to write a more accessible book or article,\n\n59:15.840 --> 59:20.160\n you have to loosen the arguments a bit. And then we worry that other philosophers will think,\n\n59:20.160 --> 59:24.720\n oh, that's a really crap argument. So I mean, the way I did it, I wrote my academic book first,\n\n59:24.720 --> 59:30.880\n Consciousness and Fundamental Reality, and then a more accessible book, Galileo's Error,\n\n59:30.880 --> 59:35.760\n where the arguments, you know, not as rigorously worked out. So then I can say the proper arguments\n\n59:35.760 --> 59:39.760\n there, you know, the further arguments there. That's brilliantly done, by the way. Like,\n\n59:40.480 --> 59:46.080\n that's such a, so for people who don't know, you first wrote Consciousness and Fundamental\n\n59:46.080 --> 59:51.920\n Reality. So that's the academic book, also very good. I flew through it last night, bought it.\n\n59:51.920 --> 59:57.840\n And then obviously the popular book is Galileo's Error, Foundations for a New Science of Consciousness.\n\n59:57.840 --> 1:00:02.640\n That's kind of the right way to do it. To show that you're legit, your community to the world,\n\n1:00:02.640 --> 1:00:07.280\n by doing the book that's normally going to read, and then doing a popular book\n\n1:00:09.120 --> 1:00:13.920\n that everybody's going to read. That's cool. Well, I try now, every time I write an academic article,\n\n1:00:14.720 --> 1:00:19.600\n I try to write a more accessible version. I mean, the thing I've been working on recently,\n\n1:00:19.600 --> 1:00:29.440\n just because there's this argument. So there's a certain argument from the cosmological fine\n\n1:00:29.440 --> 1:00:34.800\n tuning of the laws of physics for life to the multiverse that's quite popular physicists like\n\n1:00:34.800 --> 1:00:45.520\n Max Tegmark. There's an argument in philosophy journals that there's a fallacious line of\n\n1:00:45.520 --> 1:00:51.760\n reasoning going on there from the fine tuning to the multiverse. Now that argument is from 20,\n\n1:00:51.760 --> 1:00:57.440\n 30 years ago, and it's, you know, discussed in academic philosophy. Nobody knows about it. And\n\n1:00:57.440 --> 1:01:02.480\n there is huge interest in this fine tuning stuff. Scientists wanting to argue for the multiverse,\n\n1:01:03.200 --> 1:01:08.000\n theists wanting to say this is evidence for God, and nobody knows about this argument,\n\n1:01:08.000 --> 1:01:12.800\n which tries to show that it's fallacious reasoning to go from the fine tuning to the multiverse. So\n\n1:01:12.800 --> 1:01:19.360\n I wrote a piece for Scientific American explaining this argument to a more general audience. And,\n\n1:01:19.360 --> 1:01:27.360\n you know, it just really irritates me that it's just buried in these technical journal articles\n\n1:01:27.360 --> 1:01:34.400\n and nobody knows about it. But just, you know, final thing on that. I don't disagree with\n\n1:01:34.400 --> 1:01:38.400\n anything you said, and that's kind of really beautiful, that martial arts example and thinking\n\n1:01:38.400 --> 1:01:49.280\n how that could be analogous. But I think it's very rare to find a good philosopher who hasn't given\n\n1:01:49.280 --> 1:01:55.200\n a talk to other philosophers and had objections raised. I was going to say have it torn apart,\n\n1:01:55.200 --> 1:02:00.800\n but that's maybe thinking of it in the slightly the wrong way, but have the best objections\n\n1:02:00.800 --> 1:02:10.320\n raised to it. And that's why that is an important formative process that you go through as an\n\n1:02:10.320 --> 1:02:17.520\n academic, that the greatest minds starting a philosophy degree, for example, won't have gone\n\n1:02:17.520 --> 1:02:25.520\n through and probably, except in very rare cases, just won't have that, that the skills required.\n\n1:02:25.520 --> 1:02:33.440\n But part of it is just fun to disagree and dance with. I think to elaborate on what you're saying\n\n1:02:33.440 --> 1:02:39.920\n in agreement, not just gone through that, but continue to go through that. That's, I would say,\n\n1:02:39.920 --> 1:02:46.480\n the biggest problem with, quote unquote, expertise is that there's a certain point where you get,\n\n1:02:46.480 --> 1:02:51.200\n because it sucks. Like martial arts is a good example of that. It sucks to get your ass kicked.\n\n1:02:51.200 --> 1:02:57.120\n Yeah. Like I, there's a temptation. I still go, like I train, you know,\n\n1:02:57.120 --> 1:03:02.320\n you're getting older too, but also there's killers out there in both the space of martial arts and\n\n1:03:02.320 --> 1:03:08.720\n the space of science. And I think that once you become a professor, like more and more senior\n\n1:03:08.720 --> 1:03:14.160\n and more and more respected, I don't know if you get your ass kicked in the space of ideas as often.\n\n1:03:14.160 --> 1:03:21.440\n I don't know if you allow yourself to truly expose yourself. If you do, that's a great,\n\n1:03:22.160 --> 1:03:28.400\n like sign of a, of a humble, brilliant mind is constantly exposing yourself to that.\n\n1:03:28.400 --> 1:03:31.920\n I think you do because I think there's, there's graduate students who want to,\n\n1:03:32.560 --> 1:03:37.680\n you know, find the objection to sort of write their paper or make their mark. And\n\n1:03:37.680 --> 1:03:43.840\n yeah, I, I think everyone still gives talks or should give talk, give talks and people are\n\n1:03:43.840 --> 1:03:51.120\n wanting to work out if there are any weaknesses to your position. So yeah, I think that generally\n\n1:03:51.120 --> 1:04:01.840\n works out. There is also a kind of, who do you give the talks to? So, I mean, within communities,\n\n1:04:01.840 --> 1:04:08.800\n the little cluster of people that argue and bicker, but what are they arguing about? They\n\n1:04:08.800 --> 1:04:16.240\n take a bunch of stuff, a bunch of basic assumptions as agreement, and they heatedly argue about\n\n1:04:16.240 --> 1:04:21.040\n certain ideas. The question is how open are, that that's actually kind of like fun. That's like,\n\n1:04:21.680 --> 1:04:26.480\n no offense, sorry, we're sticking on this martial arts thing. It's like people who practice Aikido\n\n1:04:26.480 --> 1:04:34.160\n or certain martial arts that don't truly test themselves in the cage, in combat. So it's like,\n\n1:04:34.160 --> 1:04:39.040\n it's fun to argue about like certain things when you're in your own community, but you don't test\n\n1:04:39.040 --> 1:04:49.200\n those ideas in the full context of science, in the full like seriousness, the rigor of the,\n\n1:04:49.200 --> 1:04:54.320\n sometimes like the real world. One of my favorite fields is psychology. There's often,\n\n1:04:54.320 --> 1:04:59.040\n places within psychology where you're kind of doing these studies and arguing about stuff that's done\n\n1:04:59.040 --> 1:05:08.000\n in the lab. The arguments are almost disjoint from real human behavior. Because it's so much easier\n\n1:05:08.000 --> 1:05:12.480\n to study human behavior in the lab, you just kind of stay there and that's where the arguments are.\n\n1:05:12.480 --> 1:05:17.040\n And so vision science is a good example, like studying eye movement and how we perceive the\n\n1:05:17.040 --> 1:05:21.040\n world and all that kind of stuff. It's so much easier to study in the lab that we don't consider\n\n1:05:21.040 --> 1:05:25.360\n we say that's going to be what the science of vision is going to be like, and we don't consider\n\n1:05:25.360 --> 1:05:29.360\n the science of vision in the actual real world, the engineering of vision. I don't know. And so\n\n1:05:30.000 --> 1:05:36.240\n I think that's where exposing yourself to out of the box ideas, that's the most painful,\n\n1:05:36.240 --> 1:05:40.000\n that's the most important. I mean groupthink can be a terrible thing in philosophy as well,\n\n1:05:40.000 --> 1:05:47.360\n but because you're not to the same extent beholden to evidence and refutation from the evidence that\n\n1:05:47.360 --> 1:05:53.680\n you're in the sciences, it's a more subtle process of evaluation and so more susceptible, I think,\n\n1:05:53.680 --> 1:06:00.720\n to groupthink. Yeah, I agree. It's a danger. We've talked about a million times, but let's try to\n\n1:06:00.720 --> 1:06:08.080\n sort of do that old basic terminology definitions. What is panpsychism? Like what are the different\n\n1:06:08.800 --> 1:06:13.360\n ways you can try to think about to define panpsychism? Maybe\n\n1:06:13.360 --> 1:06:21.040\n in contrast to naturalistic dualism and materialism, other kind of views of consciousness?\n\n1:06:23.040 --> 1:06:30.080\n Yeah, so that you've basically laid out the different options. So I guess probably still\n\n1:06:30.080 --> 1:06:36.640\n the dominant view is materialism, that roughly that we can explain consciousness in the terms\n\n1:06:36.640 --> 1:06:42.800\n of physical science, wholly explain it just in terms of the electrochemical signaling in the\n\n1:06:42.800 --> 1:06:51.840\n brain. Dualism, the polar opposite view, that consciousness is nonphysical outside of the\n\n1:06:51.840 --> 1:06:58.560\n physical workings of the body and the brain, although closely connected. When I studied\n\n1:06:58.560 --> 1:07:02.560\n philosophy, we were taught basically they were the two options you had to choose, right?\n\n1:07:02.560 --> 1:07:07.680\n Either you thought it were dualist and you thought it was separate from the physical, or you thought\n\n1:07:07.680 --> 1:07:13.120\n it was just electrochemical signaling. And yeah, I became very disillusioned because I think there\n\n1:07:13.120 --> 1:07:17.920\n are big problems with both of these options. So I think the attraction of panpsychism is it's kind\n\n1:07:17.920 --> 1:07:23.200\n of a middle way. It agrees with the materialist that there's just a physical world. Ultimately,\n\n1:07:23.200 --> 1:07:29.920\n there's just particles and fields. But the panpsychist, the materialist,\n\n1:07:29.920 --> 1:07:37.440\n but the panpsychist thinks there's more to the physical than what physical science reveals,\n\n1:07:37.440 --> 1:07:44.000\n and that the ultimate nature of the physical world is constituted of consciousness. So\n\n1:07:44.000 --> 1:07:51.120\n consciousness is not outside of the physical as the dualist thinks. It's embedded in, underlies\n\n1:07:51.680 --> 1:07:55.360\n the kind of description of the world we get from physics.\n\n1:07:55.360 --> 1:07:59.920\n LW. What are the problems of materialism and dualism?\n\n1:07:59.920 --> 1:08:08.640\n CM. Starting with materialism, it's a huge debate, but I think that the core of it is that\n\n1:08:08.640 --> 1:08:13.600\n physical science works with a purely quantitative description of the physical world,\n\n1:08:14.480 --> 1:08:21.120\n whereas consciousness essentially involves qualities. If you think about the smell of coffee\n\n1:08:21.120 --> 1:08:28.080\n or the taste of mint or the deep red you experience as you watch a sunset, I think these\n\n1:08:28.080 --> 1:08:33.760\n qualities can't be captured in the purely quantitative language of physical science.\n\n1:08:33.760 --> 1:08:40.160\n So as long as your description of the brain is framed in the purely quantitative language of\n\n1:08:40.160 --> 1:08:45.440\n neuroscience, you'll just leave out these qualities and hence really leave out consciousness itself.\n\n1:08:45.440 --> 1:08:47.040\n LW. And then dualism?\n\n1:08:47.040 --> 1:08:52.560\n CM. So I've actually changed my mind a little bit on this since I wrote the book. So, I mean,\n\n1:08:52.560 --> 1:08:58.400\n I argued in the book that we have pretty good experimental grounds for doubting dualism,\n\n1:08:59.280 --> 1:09:09.120\n and roughly the idea was if dualism were true, if there was, say, an immaterial mind impacting on\n\n1:09:09.120 --> 1:09:14.160\n the brain every second of waking life, that this would really show up in on neuroscience. There'd\n\n1:09:14.160 --> 1:09:20.400\n be all sorts of things happening in the brain that had no physical explanation. It would be like a\n\n1:09:20.400 --> 1:09:27.600\n poltergeist was playing with the brain. But actually, and so the fact that we don't find that\n\n1:09:28.800 --> 1:09:34.320\n is a strong and ever growing inductive argument against dualism. But actually, the more I talk to\n\n1:09:34.320 --> 1:09:40.080\n neuroscientists and read neuroscience and we have at Durham, my university, an interdisciplinary\n\n1:09:40.080 --> 1:09:45.200\n consciousness group, I don't think we know enough about the brain, about the workings of the brain\n\n1:09:45.200 --> 1:09:53.520\n to make that argument. I think we know a lot about the basic chemistry, how neurons fire,\n\n1:09:54.240 --> 1:10:00.160\n neurotransmitters, action potentials, things like that. We know a fair bit about large scale\n\n1:10:00.160 --> 1:10:06.400\n functions of the brain, what different bits of the brain do. But what we're almost clueless on\n\n1:10:06.400 --> 1:10:12.400\n is how those large scale functions are realized at the cellular level, how it works.\n\n1:10:14.080 --> 1:10:19.760\n People get quite excited about brain scans, but it's very low resolution. Every pixel on a brain\n\n1:10:19.760 --> 1:10:30.000\n scan corresponds to 5.5 million neurons. We're only 70% of the way through constructing a connectome\n\n1:10:30.000 --> 1:10:36.720\n for the maggot brain, which has 10,000 or 100,000 neurons, but the brain has 86 billion neurons.\n\n1:10:37.600 --> 1:10:44.480\n I think we'd have to know a lot more about how the brain works, how these functions are realized\n\n1:10:47.360 --> 1:10:53.680\n before we could assess whether the dynamics of the brain can be completely explicated in terms of\n\n1:10:53.680 --> 1:11:02.000\n underlying chemistry or physics. We'd have to do more engineering before we could figure that out.\n\n1:11:02.000 --> 1:11:07.760\n There are people with other proposals, someone I got to know, Martin Picard at Columbia University,\n\n1:11:07.760 --> 1:11:14.560\n who has the Psychobiology Mitochondrial Lab there and is experimentally exploring the hypothesis\n\n1:11:14.560 --> 1:11:21.120\n that mitochondria in the brain should be under social networks, perhaps as an alternative to\n\n1:11:21.120 --> 1:11:28.960\n reducing it to underlying chemistry and physics. It is ultimately an empirical question whether\n\n1:11:28.960 --> 1:11:33.760\n dualism is true. I'm less convinced that we know the answer to that question at this stage.\n\n1:11:34.960 --> 1:11:39.200\n I think still as scientists and philosophers, we want to try and find the simplest,\n\n1:11:39.920 --> 1:11:47.840\n most parsimonious theory of reality. Dualism is still a pretty inelegant,\n\n1:11:47.840 --> 1:11:54.640\n unparsimonious theory. Reality is divided up into the purely physical properties and these\n\n1:11:54.640 --> 1:11:59.200\n consciousness properties and they're radically different kinds of things. Whereas the panpsychist\n\n1:11:59.200 --> 1:12:03.040\n offers a much more simple, unified picture of reality. I think it's still the view to be\n\n1:12:03.040 --> 1:12:08.240\n preferred. To put it very simply, why believe in two kinds of things when you can just get away\n\n1:12:08.240 --> 1:12:15.040\n with one? And materialism is also very simple, but you're saying it doesn't explain something\n\n1:12:15.040 --> 1:12:20.160\n that seems pretty important. Yes. I think materialism kind of, you know, science is\n\n1:12:20.160 --> 1:12:24.240\n about trying to find the simplest theory that accounts for the data. I don't think materialism\n\n1:12:24.240 --> 1:12:30.800\n can account for the data. Maybe dualism can account for the data, but panpsychism is simpler.\n\n1:12:30.800 --> 1:12:34.720\n It can account for the data and it's simpler. What is panpsychism?\n\n1:12:37.040 --> 1:12:41.920\n So in its broadest definition, it's the view that consciousness is a fundamental\n\n1:12:41.920 --> 1:12:45.360\n and ubiquitous feature of the physical world.\n\n1:12:47.120 --> 1:12:51.680\n Like a law of physics, what should we be imagining? What do you think the different\n\n1:12:51.680 --> 1:12:56.400\n flavors of how that actually takes shape in the context of what we know about physics and science\n\n1:12:56.400 --> 1:13:01.040\n and the universe? So in the simplest form of it, the fundamental building blocks of reality,\n\n1:13:01.040 --> 1:13:07.600\n perhaps electrons and quarks have incredibly simple forms of experience and the very complex\n\n1:13:07.600 --> 1:13:14.000\n experience of the human or animal brain is somehow rooted in or derived from these very simple\n\n1:13:14.560 --> 1:13:19.680\n forms of experience at the level of basic physics. But I mean, maybe the crucial bit about\n\n1:13:20.240 --> 1:13:28.000\n the kind of panpsychism I defend, what it does is it takes the standard approach to the problem\n\n1:13:28.000 --> 1:13:33.680\n of consciousness and turns it on its head, right? So the standard approach is to think\n\n1:13:33.680 --> 1:13:38.400\n we start with matter and we think, how do we get consciousness out of matter? So I don't think that\n\n1:13:38.400 --> 1:13:42.720\n problem can be solved for reasons I've kind of hinted at. We could maybe go into more detail,\n\n1:13:43.440 --> 1:13:49.440\n but the panpsychist does it the other way around. They start with consciousness and try to get\n\n1:13:49.440 --> 1:13:55.120\n matter out of consciousness. So the idea is basically at the fundamental level of reality,\n\n1:13:55.120 --> 1:14:03.840\n at the fundamental level of reality, there are just networks of very simple conscious entities.\n\n1:14:04.800 --> 1:14:09.200\n But these conscious entities, because they have very simple kinds of experience,\n\n1:14:09.200 --> 1:14:13.440\n they behave in predictable ways. Through their interactions, they realize certain\n\n1:14:13.440 --> 1:14:18.320\n mathematical structures. And then the idea is those mathematical structures just are\n\n1:14:18.320 --> 1:14:25.200\n the structures identified by physics. So when we think about these simple conscious entities\n\n1:14:25.200 --> 1:14:29.840\n in terms of the mathematical structures they realize, we call them particles, we call them\n\n1:14:29.840 --> 1:14:38.000\n fields, we call their properties mass, spin and charge. But really there's just these very simple\n\n1:14:38.000 --> 1:14:44.800\n conscious entities and their experiences. So in this way, we get physics out of consciousness.\n\n1:14:44.800 --> 1:14:48.240\n I don't think you can get consciousness out of physics, but I think it's pretty easy to get\n\n1:14:48.240 --> 1:14:56.160\n physics out of consciousness. Well, I'm a little confused by why you need to get physics out of\n\n1:14:56.160 --> 1:15:03.040\n consciousness. I mean, to me, it sounds like panpsychism unites consciousness and physics.\n\n1:15:03.040 --> 1:15:11.920\n I mean, physics is the mathematical science of describing everything. So physics should be able\n\n1:15:11.920 --> 1:15:18.800\n to describe consciousness. Panpsychism, in my understanding, proposes is that physics doesn't\n\n1:15:18.800 --> 1:15:25.360\n currently do so, but can in the future. I mean, it seems like consciousness, you have like Stephen\n\n1:15:25.360 --> 1:15:34.000\n Wolfram, who's all these people who are trying to develop theories of everything, mathematical\n\n1:15:34.000 --> 1:15:39.920\n frameworks within which to describe how we get all the reality that we perceive around us. To me,\n\n1:15:39.920 --> 1:15:46.240\n to me, there's no reason why that kind of framework cannot also include some accurate,\n\n1:15:46.960 --> 1:15:54.640\n precise description of whatever simple consciousness characteristics are present\n\n1:15:54.640 --> 1:16:00.800\n there at the lowest level, if panpsychist theories have truth to them. So like to me,\n\n1:16:00.800 --> 1:16:05.920\n it is physics. You said kind of physics emerges, by which you mean like the basic four laws of\n\n1:16:05.920 --> 1:16:10.160\n physics that as we currently know them, the standard model, quantum mechanics, general\n\n1:16:10.160 --> 1:16:15.840\n relativity that emerges from the base consciousness layer. That's what you mean.\n\n1:16:15.840 --> 1:16:20.320\n Yeah. So maybe the way I phrased it made it sound like these things are more separate than they are.\n\n1:16:20.320 --> 1:16:28.240\n What I was trying to address was a common misunderstanding of panpsychism, that it's\n\n1:16:28.240 --> 1:16:36.240\n a sort of dualistic theory. The idea is that particles have their physical properties like\n\n1:16:36.240 --> 1:16:41.360\n mass, spin, and charge, and these other funny consciousness properties. So the physicist Sabine\n\n1:16:41.360 --> 1:16:46.560\n Hossenfelder had a blog post critiquing panpsychism maybe a couple of years ago now that got a\n\n1:16:46.560 --> 1:16:53.440\n fair bit of traction. And she was interpreting panpsychism in this way. And then her thought was,\n\n1:16:53.440 --> 1:16:58.640\n well look, if particles had these funny consciousness properties, then it would show up in our physics\n\n1:16:58.640 --> 1:17:02.560\n like the standard model of particle physics would make false predictions because its predictions are\n\n1:17:02.560 --> 1:17:08.240\n based wholly on the physical properties. If there were also these consciousness properties, we'd get\n\n1:17:08.240 --> 1:17:13.280\n different predictions. But that's a misunderstanding of the view. The view is it's not that there are\n\n1:17:13.280 --> 1:17:20.160\n two kinds of property that mass, spin, and charge are forms of consciousness. How do we make sense\n\n1:17:20.160 --> 1:17:25.600\n of that? Because actually when you look at what physics tells us, it's really just telling us\n\n1:17:26.480 --> 1:17:32.320\n about behavior, about what stuff does. I sometimes put it by saying doing physics is like playing\n\n1:17:32.320 --> 1:17:35.680\n chess when you don't care what the pieces are made of. You're just interested in what moves you can\n\n1:17:35.680 --> 1:17:43.840\n make. So physics tells us what mass, spin, and charge do, but it doesn't tell us what they are.\n\n1:17:43.840 --> 1:17:51.520\n The experience of mass. So the idea is, yeah, mass in its nature is a very simple form of\n\n1:17:51.520 --> 1:17:56.880\n consciousness. So yeah, physics in a sense is complete, I think, because it tells us what\n\n1:17:56.880 --> 1:18:03.760\n everything at the fundamental level does. It describes its causal capacities. But for the\n\n1:18:03.760 --> 1:18:10.000\n panpsychist at least, physics doesn't tell us what matter is. It tells us what it does, but not what\n\n1:18:10.000 --> 1:18:16.800\n it is. To push back on the thing I think she's criticizing, is it also possible, so I understand\n\n1:18:16.800 --> 1:18:22.400\n what you're saying, but is it also possible that particles have another property like consciousness?\n\n1:18:22.400 --> 1:18:28.640\n I don't understand the criticism we would be able to detect it in our experiments. Well, no, if you're\n\n1:18:28.640 --> 1:18:36.080\n not looking for it. I mean there's a lot of stuff that are orthogonal. Like if you're not looking\n\n1:18:36.080 --> 1:18:41.600\n for this stuff, you're not going to detect it. Because like all of our basic empirical science\n\n1:18:42.320 --> 1:18:47.680\n through its recent history, and yes the history of science is quite recent, has been very kind of\n\n1:18:47.680 --> 1:18:56.720\n focused on billiard balls colliding and from that understanding how gravity works. But like we just\n\n1:18:56.720 --> 1:19:02.640\n haven't integrated other possibilities into this. I don't think there will be conflicting whether you\n\n1:19:02.640 --> 1:19:08.960\n are observing consciousness or not, or exploring some of these ideas. I don't think that affects\n\n1:19:08.960 --> 1:19:16.320\n the rest of the physics. The mass, the energy, the all the different kind of like the hierarchy of\n\n1:19:16.320 --> 1:19:22.880\n different particles and so on, how they interact. I don't think, it feels like consciousness is\n\n1:19:22.880 --> 1:19:29.040\n something orthogonal, like very much distinct. It's the quantitative versus the qualitative.\n\n1:19:29.040 --> 1:19:34.000\n There's something quite distinct that we're just almost like another dimension that we're just\n\n1:19:34.000 --> 1:19:38.880\n completely ignoring. There might be a way of responding to Sabina to say, well, that there\n\n1:19:38.880 --> 1:19:45.440\n could be properties of particles that don't show up in the specific circumstances in which physicists\n\n1:19:45.440 --> 1:19:50.480\n investigate particles. My colleague, the philosopher of science, Nancy Cartwright, has got this book,\n\n1:19:50.480 --> 1:19:57.680\n How the Laws of Physics Lie, where she says, physicists explore things in very specific\n\n1:19:57.680 --> 1:20:03.200\n circumstances and then in an unwarranted way generalize that. But I mean, I guess I was\n\n1:20:03.200 --> 1:20:08.560\n thinking Sabina's criticism actually just misses the mark in a more basic way. Her point is,\n\n1:20:08.560 --> 1:20:12.880\n we shouldn't think there are any more properties to particles other than those the standard model\n\n1:20:12.880 --> 1:20:18.240\n attributes to them. Panpsychus would say, yeah, sure, there aren't. There are just the properties,\n\n1:20:18.240 --> 1:20:22.640\n the physical properties like mass, spin and charge that the standard model attributes to them. It's\n\n1:20:22.640 --> 1:20:28.480\n just that we have a different philosophical view as to the nature of those properties.\n\n1:20:28.480 --> 1:20:32.560\n Those properties are turtles that are sitting on top of another turtle and that big turtle is\n\n1:20:32.560 --> 1:20:39.200\n consciousness. That's what you're saying. But I'm just saying, it's possible that's true. It's\n\n1:20:39.200 --> 1:20:44.640\n possible also that consciousness is just another turtle playing with the others. It's just not\n\n1:20:44.640 --> 1:20:49.920\n interacting in the ways that we've been observing. In fact, to me, that's more compelling because\n\n1:20:49.920 --> 1:20:57.040\n then that's going to be, well, no, I think both are very compelling, but it feels like\n\n1:20:57.040 --> 1:21:03.360\n it's more within the reach of empirical validation if it's yet another property of particles that\n\n1:21:03.360 --> 1:21:11.280\n we're just not observing. If it's like the thing from which matter and energy and physics emerges,\n\n1:21:11.280 --> 1:21:22.080\n it makes it that much more difficult to investigate how you get from that base\n\n1:21:22.080 --> 1:21:30.240\n layer of consciousness to the wonderful little spark of consciousness, complexity and beauty\n\n1:21:30.240 --> 1:21:35.040\n that is the human being. I don't know if you're necessarily trying to get there,\n\n1:21:35.040 --> 1:21:42.720\n but one of the beautiful things to get at with panpsychism or with a solid theory of consciousness\n\n1:21:42.720 --> 1:21:51.120\n is to answer the question, how do you engineer the thing? How do you get from nothing vacuum\n\n1:21:51.120 --> 1:21:57.600\n in the lab? If there is that consciousness base layer, how do you start engineering organisms that\n\n1:21:57.600 --> 1:22:04.560\n have consciousness in them? Or the reverse of that describing how does consciousness emerge\n\n1:22:04.560 --> 1:22:12.240\n in the human being from conception, from a stem cell to the whole full neurobiology that builds\n\n1:22:12.240 --> 1:22:19.680\n from that, how do you get this full rich experience of consciousness that humans have? It feels like\n\n1:22:19.680 --> 1:22:27.200\n that's the dream and if consciousness is just another player in the game of physics, it feels\n\n1:22:27.200 --> 1:22:33.520\n more amenable to our scientific understanding of it. That's interesting. I mean, I guess it's supposed\n\n1:22:33.520 --> 1:22:41.360\n to be a kind of identity claim here that physics tells us what matter does, consciousness is what\n\n1:22:41.360 --> 1:22:48.800\n matter is. So matter is sort of what consciousness does. So at the bottom level, there is just\n\n1:22:49.600 --> 1:22:54.720\n consciousness and conscious things. There are just these simple things with their experiences\n\n1:22:54.720 --> 1:23:01.680\n and that is their total nature. So in that sense, it's not another player, it's just all there is\n\n1:23:01.680 --> 1:23:10.240\n really. In physics, we describe that at a certain level of abstraction. We capture what Bertrand\n\n1:23:10.240 --> 1:23:16.080\n Russell, who was the inspiration for a lot of this, calls the causal skeleton of the world.\n\n1:23:16.080 --> 1:23:19.440\n So physics is just interested in the causal skeleton of the world, it's not interested in\n\n1:23:20.080 --> 1:23:25.040\n flesh and blood, although that's maybe suggesting separation again too much,\n\n1:23:25.040 --> 1:23:34.480\n or metaphors fail in the end. So yeah, you totally right. Ultimately, what we want to explain is how\n\n1:23:35.840 --> 1:23:40.080\n our consciousness and the consciousness of other animals comes out of this. If we can't do that,\n\n1:23:40.080 --> 1:23:48.800\n then it's game over. But I think it maybe makes more sense on the identity claim that if matter\n\n1:23:48.800 --> 1:23:53.440\n at the fundamental level just is forms of consciousness, then we can perhaps make sense\n\n1:23:53.440 --> 1:23:58.080\n of how those simple forms of consciousness in some way combine in some way to make\n\n1:23:58.720 --> 1:24:03.680\n the consciousness we know and love. That's the dream. Yeah, so I guess the question is,\n\n1:24:06.240 --> 1:24:12.160\n so the reason you can describe, like the reason you have material engineering, material science,\n\n1:24:13.680 --> 1:24:21.920\n is because you have from physics to chemistry, like you keep going up and up in levels of\n\n1:24:21.920 --> 1:24:30.480\n complexity in order to describe objects that we have in our human world. And it would be nice to\n\n1:24:30.480 --> 1:24:35.680\n do the same thing for consciousness, to come up with the chemistry of consciousness, right? Like\n\n1:24:37.840 --> 1:24:43.920\n how do the different particles interact to create greater complexity? So you can do this kind of\n\n1:24:43.920 --> 1:24:50.240\n thing for life, like what is life, like living organisms, at which point do living organisms\n\n1:24:50.240 --> 1:24:57.120\n become living? What, like what, how do you know if I give you a thing that that thing is living?\n\n1:24:57.680 --> 1:25:03.200\n And there's a lot of people working on this kind of idea and some of that has to do with the levels\n\n1:25:03.200 --> 1:25:09.600\n of complexity and so on. It'd be nice to know like measuring different degrees of consciousness as\n\n1:25:09.600 --> 1:25:15.280\n you get into a bigger, more and more complex objects. And that's, I mean that's what chemistry,\n\n1:25:15.280 --> 1:25:21.520\n biochemistry, like bigger and bigger conscious molecules, and to see how that leads to organisms.\n\n1:25:21.520 --> 1:25:26.080\n And then organisms like start to collaborate together like they do inside a human body\n\n1:25:26.080 --> 1:25:29.600\n to create the full human body. To do those kinds of experiments would be,\n\n1:25:30.720 --> 1:25:35.920\n it seems like that would be kind of a goal. That's what I mean by player in a game of physics,\n\n1:25:36.480 --> 1:25:42.240\n as opposed to like the base layer. If it's just the base layer, it becomes harder to track it\n\n1:25:42.240 --> 1:25:45.840\n as you get from physics to chemistry to biology to psychology.\n\n1:25:47.120 --> 1:25:54.800\n Yeah. In every case, apart from consciousness, I would say what we're interested in is behavior.\n\n1:25:55.840 --> 1:26:00.480\n We're interested in explaining behavioral functions. So at the level of fundamental physics,\n\n1:26:00.480 --> 1:26:05.200\n we're interested in capturing the equations that describe the behavior there. And when we get to\n\n1:26:05.200 --> 1:26:11.520\n higher levels, we're interested in explicating the behavior, perhaps in terms of behavior at\n\n1:26:11.520 --> 1:26:17.920\n simpler levels. And with life as well, that's what we're interested in, the various observable\n\n1:26:17.920 --> 1:26:24.240\n functions of life, explaining them in terms of more simple mechanisms. But in the case of\n\n1:26:24.240 --> 1:26:30.800\n consciousness, I don't think that's what we're doing, or at least not all that we're doing.\n\n1:26:31.520 --> 1:26:37.600\n In the case of consciousness, there are these subjective qualities that we're immediately\n\n1:26:37.600 --> 1:26:43.920\n aware of that the redness of a red experience, the itchiness of an itch, and we're trying to\n\n1:26:43.920 --> 1:26:49.680\n account for them. We're trying to bring them into our theory of reality and postulating some\n\n1:26:49.680 --> 1:26:54.240\n mechanism does not deal with that. So I think we've got to realize dealing with consciousness\n\n1:26:54.240 --> 1:26:59.360\n is a radically different explanatory task from other tasks of science. Other tasks of science,\n\n1:26:59.360 --> 1:27:03.920\n we're trying to explain behavior in terms of simpler forms of behavior. In the case of\n\n1:27:03.920 --> 1:27:09.760\n consciousness, we're trying to explain these invisible subjective qualities that you can't\n\n1:27:09.760 --> 1:27:15.040\n see from the outside, but that you're immediately aware of. The reason materialism perhaps continues\n\n1:27:15.040 --> 1:27:20.000\n to dominate is people think, look at the success of science, it's incredible, look at all the,\n\n1:27:20.000 --> 1:27:24.000\n you know, it's explained all this, surely it's going to explain consciousness. But I think we\n\n1:27:24.000 --> 1:27:31.680\n have to appreciate there's a radically different explanatory task here. And so that, I mean,\n\n1:27:31.680 --> 1:27:36.640\n the neuroscientist Anil Seth, who I've had lots of intense but friendly discussions with, you know,\n\n1:27:36.640 --> 1:27:42.240\n wants to compare consciousness to life. But I think there's this radical difference that\n\n1:27:42.240 --> 1:27:47.440\n in the case of life, again, we come back to public observation, all of the data,\n\n1:27:48.320 --> 1:27:54.320\n publicly observable data, we're basically trying to explain complex behavior. And the way you do\n\n1:27:54.320 --> 1:28:01.840\n that is identify mechanisms, simpler mechanisms that explicate that behavior. That's the task in\n\n1:28:01.840 --> 1:28:07.360\n physics, chemistry, neurobiology. But in the case of consciousness, that's not what we're\n\n1:28:07.360 --> 1:28:12.240\n trying to do. We're trying to account for these subjective qualities and you postulate a mechanism\n\n1:28:13.920 --> 1:28:18.640\n that might explain behavior, but it doesn't explain the redness of a red experience.\n\n1:28:18.640 --> 1:28:25.760\n So, but still, I mean, still, ultimately, the hope is that we will have some kind of hierarchical\n\n1:28:25.760 --> 1:28:31.840\n story. So we take the causal dynamics of physics, we hypothesize that that's filled out with\n\n1:28:34.080 --> 1:28:40.880\n certain forms of consciousness. And then at higher levels, we get more complex causal dynamics\n\n1:28:40.880 --> 1:28:48.400\n filled out by more complex forms of consciousness. And ultimately, we get to us, hopefully. So yeah,\n\n1:28:48.400 --> 1:28:51.440\n so there's still a sort of hierarchical explanatory framework there.\n\n1:28:52.720 --> 1:28:58.560\n So you kind of mentioned the hierarchy of consciousness. Do you think it's possible to,\n\n1:28:58.560 --> 1:29:06.160\n within the panpsychism framework, to measure consciousness? Or put another way,\n\n1:29:06.160 --> 1:29:12.560\n are some things more conscious than others, in the panpsychist view?\n\n1:29:14.880 --> 1:29:22.240\n It's a difficult question. I mean, I do see consciousness as a dealing with consciousness,\n\n1:29:22.240 --> 1:29:29.040\n an interdisciplinary task between something more experimental, which is to do with the ongoing\n\n1:29:29.760 --> 1:29:35.120\n project of trying to work out what people call the neural correlates of consciousness,\n\n1:29:35.120 --> 1:29:40.720\n of consciousness, what kinds of physical brain activity correspond to conscious experience.\n\n1:29:41.520 --> 1:29:46.800\n That's one part of it. But I think essentially, there's also a theoretical question of\n\n1:29:48.160 --> 1:29:56.000\n more the why question. Why do those kinds of brain activity go along with certain kinds of\n\n1:29:56.000 --> 1:30:00.320\n conscious experience? I don't think you can answer that. Because consciousness is not publicly\n\n1:30:00.320 --> 1:30:07.440\n observable. I don't think you can answer that why question with an experiment. But they have to go\n\n1:30:07.440 --> 1:30:13.360\n hand in hand. And I mean, one of the theories I'm attracted to is the integrated information theory,\n\n1:30:14.400 --> 1:30:20.480\n according to which we find consciousness at the level at which there is most integrated\n\n1:30:20.480 --> 1:30:25.680\n information. And they try to give a mathematically precise definition of that. So on that view,\n\n1:30:25.680 --> 1:30:30.720\n you know, probably this cup of tea isn't conscious, because there's probably more\n\n1:30:30.720 --> 1:30:36.400\n integrated information in the molecules making up the tea than there is in the liquid as a whole.\n\n1:30:36.400 --> 1:30:42.560\n But in the brain, what is distinctive about the brain is that there's a huge amount of integrated,\n\n1:30:42.560 --> 1:30:47.920\n there's more integrated information in the system than there is in individual neurons. So that's why\n\n1:30:47.920 --> 1:30:57.040\n they claim that that's the basis of consciousness at the macro level. I mean, I like some features\n\n1:30:57.040 --> 1:31:03.680\n of this theory, but they do talk about degrees of consciousness. They do want to say there is\n\n1:31:03.680 --> 1:31:11.920\n gradations. I'm not sure conceptually I can kind of make sense of that. I mean, there are things\n\n1:31:11.920 --> 1:31:21.360\n to do with consciousness that are graded, like complexity or levels of information. But I'm not\n\n1:31:21.360 --> 1:31:28.400\n sure whether experience itself admits a degree. I sort of think something either has experience or\n\n1:31:28.400 --> 1:31:32.560\n it doesn't. It might have very simple experience, it might have very complex experience, but\n\n1:31:32.560 --> 1:31:38.960\n experience itself, I don't think it admits a degree in that sense. It's not more experience,\n\n1:31:39.520 --> 1:31:45.040\n less experience. I sort of find that conceptually hard to make sense of. But I'm kind of open minded\n\n1:31:45.040 --> 1:31:55.440\n on it. So when we have a lot higher resolution of sensory information, don't you think that's\n\n1:31:55.440 --> 1:32:03.920\n correlated to the richness of the experience? So doesn't more information provide a richer\n\n1:32:03.920 --> 1:32:08.720\n experience? Or is that, again, thinking quantitatively and not thinking about the\n\n1:32:08.720 --> 1:32:14.720\n subjective experience? Like you can experience a lot with very little sensory information, perhaps.\n\n1:32:16.480 --> 1:32:20.480\n Do you think those are connected? Yeah, yeah. So there are\n\n1:32:20.480 --> 1:32:29.520\n features, characteristics here we can grade, the complexity of the experience. And on the\n\n1:32:29.520 --> 1:32:39.040\n integrated information theory, they correlate that in terms of mathematically identifiable structure\n\n1:32:39.040 --> 1:32:44.240\n with integrated information. So roughly, it's a quite unusual notion of information. It's perhaps\n\n1:32:44.240 --> 1:32:52.400\n not the standard way one thinks about information. It's to do with constraining past and future\n\n1:32:52.400 --> 1:32:58.240\n possibilities of the system. So the idea is in the retina of the eye, there's a huge amount of\n\n1:32:58.800 --> 1:33:04.400\n possible states the retina of my eye could be in at the next moment, depending on what light goes\n\n1:33:04.400 --> 1:33:12.000\n into it. Whereas the possible next states of the brain are much more likely to be in the retina of\n\n1:33:12.000 --> 1:33:16.560\n the eye. The possible next states of the brain are much more constrained. Obviously, it responds to\n\n1:33:16.560 --> 1:33:25.440\n the environment, but it heavily constrains its past and future states. And so that's the idea\n\n1:33:25.440 --> 1:33:33.200\n of information they have. And then the second idea is how much that information is dependent on\n\n1:33:33.920 --> 1:33:40.960\n integration. So in a computer where you have transistors, you take out a few transistors,\n\n1:33:40.960 --> 1:33:45.920\n lose that much information. It's not dependent on interconnections. Whereas you take a tiny bit of\n\n1:33:45.920 --> 1:33:51.120\n the brain out, you lose a lot of information because the way it stores information is dependent\n\n1:33:51.120 --> 1:34:01.680\n on the interconnections of the system. So that's one proposal for how to measure one gradable\n\n1:34:01.680 --> 1:34:06.800\n characteristic, which might correspond to some gradable characteristic in qualitative\n\n1:34:06.800 --> 1:34:11.680\n consciousness. And maybe I'm being very pedantic, which is, you know, philosophers, professional\n\n1:34:11.680 --> 1:34:19.360\n pedants. I just sort of don't think that is a quantity of experience. It's a quantity of\n\n1:34:21.120 --> 1:34:26.000\n the structure of experience, maybe, but I just find it hard to make sense of the idea of how\n\n1:34:26.000 --> 1:34:32.080\n much experience do you have? I've got, you know, five units of experience. I've got one unit of\n\n1:34:32.080 --> 1:34:38.960\n experience. I don't know. I find that a bit hard to make sense. Maybe I'm being just pedantic.\n\n1:34:38.960 --> 1:34:46.160\n I think just saying the word experience is difficult to think about. Let's talk about\n\n1:34:46.160 --> 1:34:52.880\n suffering. Let's talk about a particular experience. So let's talk about me and the hamster.\n\n1:34:54.320 --> 1:34:59.760\n I just think that no offense to the hamster. Probably no hamsters are listening.\n\n1:34:59.760 --> 1:35:04.560\n So now you're offending hamsters too. Maybe there's a hamster that's just pissed off.\n\n1:35:05.440 --> 1:35:13.440\n There's probably somebody on a speaker right now listening to this podcast and they probably have\n\n1:35:13.440 --> 1:35:18.720\n a hamster or a guinea pig and that hamster is listening. It just doesn't know the English\n\n1:35:18.720 --> 1:35:27.040\n language or any kind of human interpretable linguistic capabilities to tell you to fuck off.\n\n1:35:27.040 --> 1:35:35.360\n It understands exactly what's being talked about and can see through us. Anyway, it just feels like\n\n1:35:35.360 --> 1:35:48.480\n a hamster has less capacity to suffer than me. And maybe a cockroach or an insect or maybe a bacteria\n\n1:35:48.480 --> 1:35:59.360\n has less capacity to suffer than me. But maybe that's me deluding myself as to the complexity\n\n1:35:59.360 --> 1:36:07.600\n of my conscious experience. Maybe there is some sense in which I can suffer more,\n\n1:36:09.280 --> 1:36:14.080\n but to reduce it to something quantifiable is impossible.\n\n1:36:14.080 --> 1:36:18.400\n Angus Yeah, I guess I definitely think there's kinds of suffering that\n\n1:36:19.600 --> 1:36:26.480\n you have the joy of being possible for you that aren't available to a hamster, I don't think.\n\n1:36:28.640 --> 1:36:34.640\n Well, can a hamster suffer heartbreak? I don't know. Can a cockroach suffer heartbreak? But\n\n1:36:34.640 --> 1:36:42.160\n it's certainly, I mean, there's kinds of fear of your own death, concern about whether there's a\n\n1:36:42.160 --> 1:36:50.720\n purpose to existence. These are forms of suffering that aren't available to most nonhuman animals.\n\n1:36:51.760 --> 1:36:58.240\n Whether there's an overall scale that we could put physical and emotional suffering on\n\n1:36:58.240 --> 1:37:04.400\n and identify where you are on that scale, I'm not so sure.\n\n1:37:04.400 --> 1:37:12.480\n Angus So it's like humans have a much bigger menu of experiences, much bigger selection.\n\n1:37:12.480 --> 1:37:14.160\n Angus In one sense at least.\n\n1:37:14.160 --> 1:37:19.280\n Angus So there's like a page that's suffering. So this menu of experiences,\n\n1:37:19.280 --> 1:37:23.520\n you know, like you have the omelets and the breakfast and so on. And one of the pages is\n\n1:37:23.520 --> 1:37:31.200\n suffering. It's just we have a lot compared to a hamster, a lot more. But any one individual thing\n\n1:37:31.200 --> 1:37:38.480\n that we share with a hamster, that experience, it's difficult to argue that we experience it\n\n1:37:38.480 --> 1:37:40.720\n deeper than others like hunger or something like that.\n\n1:37:40.720 --> 1:37:45.200\n Angus Yeah, physical pain, I'm not sure. But I mean,\n\n1:37:45.200 --> 1:37:50.000\n there are kinds of experiences animals have that we don't. Bats echolocate around the world.\n\n1:37:52.720 --> 1:37:57.200\n Philosopher Thomas Nagel famously pointed out that, you know, no matter how much you understand\n\n1:37:57.200 --> 1:38:04.480\n of the neurophysiology of bats, you'll still not know what it's like to squeal and find your way\n\n1:38:04.480 --> 1:38:12.880\n around by listening to the echoes bounce off. So yeah, I mean, I guess I feel the intuition that\n\n1:38:12.880 --> 1:38:20.560\n there's emotional suffering is I want to say deeper than physical suffering. I don't know how\n\n1:38:20.560 --> 1:38:22.880\n to make that statement precise, though. Angus\n\n1:38:22.880 --> 1:38:28.560\n So one of the ways I think about I think people think about consciousness is in connection to\n\n1:38:28.560 --> 1:38:33.760\n suffering. So let me just ask about suffering because that's how people think about animals,\n\n1:38:34.960 --> 1:38:42.240\n cruelty to animals or cruelty to living things. They connect that to suffering into consciousness.\n\n1:38:42.880 --> 1:38:50.640\n I think there's a sense in which those are two are deeply connected when people are thinking about\n\n1:38:50.640 --> 1:38:58.880\n just public policy. They're thinking about this is like philosophy, engineering, psychology,\n\n1:38:58.880 --> 1:39:05.440\n sociology, political science. All of those things have to do with human suffering and\n\n1:39:05.440 --> 1:39:10.720\n animal suffering, life suffering. And that's connected to consciousness in a lot of people's\n\n1:39:10.720 --> 1:39:17.840\n minds. Is it connected like that for you? So the the capacity to suffer, is it also\n\n1:39:17.840 --> 1:39:23.600\n is it also somehow like strongly correlated with the capacity to experience?\n\n1:39:23.600 --> 1:39:26.080\n Angus Yeah, I would say I would say\n\n1:39:26.640 --> 1:39:35.600\n suffering is a kind of experience. And so you have to be conscious to suffer. Actually, this\n\n1:39:35.600 --> 1:39:43.280\n so there is one people taking more unusual views of consciousness seriously now. Panpsychism is\n\n1:39:43.280 --> 1:39:50.240\n is one radical approach. Another one is what's become known as illusionism, the view that\n\n1:39:51.280 --> 1:39:54.560\n consciousness, at least in the sense that philosophers think about it, doesn't really\n\n1:39:54.560 --> 1:40:03.280\n exist at all. So yeah, my podcast mind chat I host with a committed illusionist. So the\n\n1:40:03.280 --> 1:40:10.640\n gimmick is I think consciousness is everywhere. He thinks it's nowhere. And so that's one very\n\n1:40:10.640 --> 1:40:15.840\n simple way of avoiding all these problems, right? Consciousness doesn't exist, we don't need to\n\n1:40:15.840 --> 1:40:21.840\n explain it. Job done. Although we might still have to explain why we seem to be conscious,\n\n1:40:21.840 --> 1:40:26.080\n why it's so hard to get out of the idea that we're conscious. But that the reason I connect\n\n1:40:26.080 --> 1:40:32.080\n this to what you're saying is, actually, my co host, Keith Frankish, is a little bit ambivalent\n\n1:40:32.080 --> 1:40:36.240\n on the word pain. He says, Oh, in some, you know, in some sense, I believe in pain. And in some\n\n1:40:36.240 --> 1:40:44.480\n sense, I don't. But another illusionist, Francois Camara, has a paper discussing how we think about\n\n1:40:44.480 --> 1:40:49.920\n morality, given his view that pain in the way we normally think about it just does not exist.\n\n1:40:49.920 --> 1:40:54.960\n He thinks it's an illusion, the brain tricks us into thinking we feel pain, but we don't. And\n\n1:40:56.320 --> 1:41:01.680\n how we should think about morality in the light of that. It's become a big topic, actually,\n\n1:41:01.680 --> 1:41:06.880\n thinking about the connection between consciousness and morality. David Chalmers, the philosopher,\n\n1:41:06.880 --> 1:41:14.080\n is most associated with this concept of a philosophical zombie. So a philosophical zombie\n\n1:41:14.080 --> 1:41:19.040\n is very different from a Hollywood zombie. Hollywood zombies, you know, you know what\n\n1:41:19.040 --> 1:41:25.040\n they're like, but philosophical zombies are sort of really good. A Korean zombie movie on Halloween\n\n1:41:25.040 --> 1:41:31.440\n this year. Anyway, philosophical zombies behave just like us because the physical\n\n1:41:31.440 --> 1:41:36.320\n workings of their body and brain are the same as ours, but they have no conscious experience.\n\n1:41:36.320 --> 1:41:41.440\n There's nothing that it's like to be a zombie. So you stick a knife in it, it screams and runs away,\n\n1:41:41.440 --> 1:41:50.400\n but it doesn't actually feel pain. It's just a complicated mechanism set up to behave just like\n\n1:41:50.400 --> 1:41:54.240\n us. Now there's lots of, no one believes in these. I think there's one philosopher who believes in\n\n1:41:54.880 --> 1:41:58.720\n everyone is a zombie except him. But anyway. But isn't that what illusionism is?\n\n1:41:58.720 --> 1:42:06.000\n Yeah, I suppose so in a sense. Illusionism is if you were all zombies. And, you know, one reason to\n\n1:42:06.000 --> 1:42:10.320\n think about zombies is to think about the value of consciousness. So if there were a zombie,\n\n1:42:10.320 --> 1:42:16.720\n here's a question. Suppose we could, I mean, suppose we could make zombies by, let's say,\n\n1:42:16.720 --> 1:42:20.960\n for the sake of discussion, things made of silicon aren't conscious. I don't know if that's true. It\n\n1:42:20.960 --> 1:42:27.440\n could turn out to be true. And suppose you built Commander Data out of silicon, you know, it's a\n\n1:42:27.440 --> 1:42:32.320\n bit of an old school reference to Star Trek New Next Generation. So, you know, behaves just like\n\n1:42:32.320 --> 1:42:38.800\n a human being, but, you know, it can, you can have a sophisticated conversation. It will talk about\n\n1:42:38.800 --> 1:42:49.280\n its hopes and fears, but it has no consciousness. Does it have moral rights? Is it murder to turn\n\n1:42:49.280 --> 1:42:54.720\n off such a being? You know, I'm inclined to say, no, it's not. You know, if it doesn't have\n\n1:42:54.720 --> 1:42:59.760\n experience, it doesn't really suffer. It doesn't really have moral rights at all. So I'm inclined\n\n1:42:59.760 --> 1:43:08.880\n to think, you know, consciousness is the basis of moral value, moral concern. And conversely,\n\n1:43:09.680 --> 1:43:15.840\n as a panpsychist, for this reason, I think it can transform your relationship with nature.\n\n1:43:15.840 --> 1:43:21.600\n If you think of a tree as a conscious organism, albeit of a very unusual kind,\n\n1:43:21.600 --> 1:43:29.200\n then a tree is a locus of moral concern in its own right. Chopping down a tree is an act of\n\n1:43:29.200 --> 1:43:36.160\n immediate moral concern. If you see these, you know, horrible forest fires, we're all horrified.\n\n1:43:36.160 --> 1:43:42.480\n But if you think it's the burning of conscious organisms, that does add a whole new dimension.\n\n1:43:42.480 --> 1:43:47.040\n Although it also makes things more complicated because people often think as a panpsychist,\n\n1:43:47.040 --> 1:43:53.760\n I'm going to be vegan. But it's tricky because if you think plants and trees are conscious as well,\n\n1:43:53.760 --> 1:43:57.840\n you've got to eat something. If you don't think plants and trees are conscious, then you've got\n\n1:43:57.840 --> 1:44:01.840\n a nice moral dividing line. You can say, I'm not going to eat things that aren't conscious. I'm\n\n1:44:01.840 --> 1:44:06.880\n not going to kill things that aren't conscious. But if you think plants and trees are conscious,\n\n1:44:06.880 --> 1:44:12.560\n then you don't have that nice moral dividing line. I mean, so the principle I'm kind of\n\n1:44:12.560 --> 1:44:19.280\n working my way towards, I haven't kept it up in my trip to the US, but it's just not eating any\n\n1:44:19.280 --> 1:44:23.600\n animal products that are factory farmed. You know, my vegan friends say, well, they're still\n\n1:44:23.600 --> 1:44:33.200\n suffering there. And I think there is even in the nicest farms, cows will suffer when their calves\n\n1:44:33.200 --> 1:44:37.440\n are taken off them. They go for a few days of quite serious mourning. So they're still suffering. But\n\n1:44:37.440 --> 1:44:44.560\n it seems to me, my thought is the principle of just not having factory farm stuff is something\n\n1:44:44.560 --> 1:44:49.680\n more people could get on board with. And you might have greater harm minimization. So if people went\n\n1:44:49.680 --> 1:44:56.000\n into restaurants and said, are your animal products factory farmed? If not, I want the vegan\n\n1:44:56.000 --> 1:45:00.480\n option. Or if people looked out for the label that said no factory farmed ingredients. You know,\n\n1:45:00.480 --> 1:45:05.680\n I think maybe that that could make a really big difference to the market and harm minimization.\n\n1:45:05.680 --> 1:45:10.880\n Anyway, so that's the, so it's very ethically tricky. But some people don't buy that. There's\n\n1:45:10.880 --> 1:45:15.200\n a very good philosopher, Jeff Lee, who thinks zombies should have equal rights, consciousness,\n\n1:45:15.760 --> 1:45:23.520\n doesn't matter, you know. Let us go there. But first, I listened to your podcast. It's awesome\n\n1:45:23.520 --> 1:45:31.520\n to have two very kind of different philosophies inter dancing together in one place. What's the\n\n1:45:31.520 --> 1:45:36.000\n name of the podcast again? Mind chat. Yeah. So yeah, that's the idea. I guess, you know,\n\n1:45:36.000 --> 1:45:42.560\n polarized times. I mean, I love trying to get in the mindset of people I really disagree with. And\n\n1:45:42.560 --> 1:45:48.160\n you know, I can't understand how on earth they're thinking that, you know, really trying to have\n\n1:45:48.160 --> 1:45:52.240\n respect and try and, you know, see where they're coming from. I love that. So that's what yeah,\n\n1:45:52.240 --> 1:45:59.360\n Keith Frankish and I do of from polar opposite views, really trying to understand each other.\n\n1:45:59.360 --> 1:46:02.400\n And you know, interviewing scientists and philosophers of consciousness from those\n\n1:46:02.400 --> 1:46:09.520\n different perspectives. Although in a sense, in a sense, we have a very common, a common starting\n\n1:46:09.520 --> 1:46:18.480\n point, because we both think you can't fully account for consciousness, at least as philosophers\n\n1:46:18.480 --> 1:46:23.920\n normally think of it in conventional scientific terms. So we said that starting point. But we\n\n1:46:23.920 --> 1:46:27.200\n react to it in very different ways. He says, well, it doesn't exist then. It's like,\n\n1:46:27.200 --> 1:46:32.080\n fairy dust. It's, you know, which is, you know, we don't believe in anymore. Whereas I say,\n\n1:46:33.280 --> 1:46:39.120\n it does exist. So we have to rethink what science is. So you recently talked to on the podcast with\n\n1:46:39.120 --> 1:46:47.120\n Sean Carroll, and I first heard you, your great interview with Sean Carroll on his podcast,\n\n1:46:47.120 --> 1:46:57.760\n Mindscape. What is interesting to kind of see if there's agreements, disagreements between the two\n\n1:46:57.760 --> 1:47:04.480\n of you, because he's a, you know, a very serious quantum mechanics guy. He's a physics guy, but he\n\n1:47:04.480 --> 1:47:10.320\n also thinks about deep philosophical questions. He's a big proponents of many worlds interpretation\n\n1:47:10.320 --> 1:47:18.880\n of quantum mechanics. So actually, I'm trying to think, aside from your conversation with him,\n\n1:47:18.880 --> 1:47:23.200\n I'm trying to, I'm trying to remember what he thinks about consciousness. But anyway,\n\n1:47:23.200 --> 1:47:27.520\n maybe you can comment on what, what are some interesting agreements and disagreements with\n\n1:47:27.520 --> 1:47:34.320\n Sean Carroll? I don't think there's many agreements, but, but, you know, we've had\n\n1:47:34.320 --> 1:47:41.120\n really constructive, interesting discussions in, in, in a lot of different contexts. And, you know,\n\n1:47:41.120 --> 1:47:46.320\n he's very clued up about philosophies, very respectful of philosophy, certain physicists\n\n1:47:46.320 --> 1:47:51.280\n who shall remain nameless think, what's all this bullshit philosophy? We don't have to waste our\n\n1:47:51.280 --> 1:47:57.120\n time with that. And then go on to do pretty bad philosophy. The book co written by Stephen Hawking\n\n1:47:57.120 --> 1:48:01.840\n and Leonard Mlodinow famously starts off saying, philosophy is just as important as philosophy.\n\n1:48:01.840 --> 1:48:07.520\n Mlodinow famously starts off saying, philosophy is dead. And then goes on in later chapters to do\n\n1:48:07.520 --> 1:48:13.600\n some pretty bad philosophy. So, uh, I think we have to do philosophy, if only to get rid of bad\n\n1:48:13.600 --> 1:48:20.640\n philosophy, you know, you can't, you can't escape, but, um, strong words. Sean Carroll and I also\n\n1:48:21.760 --> 1:48:25.760\n had a debate on, on clubhouse, a panpsychism debate together with\n\n1:48:25.760 --> 1:48:33.760\n Annika Harris and Owen Flanagan. It was a two people on each team. And, uh, it was the most\n\n1:48:33.760 --> 1:48:43.200\n popular thing on clubhouse at that time. Um, so yeah, so he's, he's a, he's a materialist\n\n1:48:43.760 --> 1:48:49.600\n of a pretty standard kind that, um, consciousness is be understood as a sort of emergent feature.\n\n1:48:49.600 --> 1:48:55.120\n It's not, not adding anything, a weekly emergent feature. But what I guess what we've been debating\n\n1:48:55.120 --> 1:49:02.960\n most about is, is whether my view can account for mental causation for the fact that consciousness\n\n1:49:02.960 --> 1:49:11.840\n is doing stuff. So he thinks the fact that I think zombies are logically coherent, it's logic,\n\n1:49:11.840 --> 1:49:18.400\n there's a, it's logically coherent for there to be a world physically, just like ours in which\n\n1:49:18.400 --> 1:49:22.880\n there's no consciousness. He thinks that shows, oh, well, my view, consciousness doesn't do\n\n1:49:22.880 --> 1:49:28.880\n anything. It doesn't add anything, which is crazy. You know, my, my, my consciousness impacts on the\n\n1:49:28.880 --> 1:49:35.120\n world. My conscious thoughts are causing me to say the words I'm saying now. My visual experience\n\n1:49:35.120 --> 1:49:42.640\n helps me navigate the world. But I mean, my response to Sean Carroll is, is on the panpsychist\n\n1:49:42.640 --> 1:49:50.800\n view, the relationship between physics and fundamental consciousness is a sort of like the\n\n1:49:50.800 --> 1:49:59.360\n relationship between hot software and hardware, right? Physics is sort of the software and\n\n1:49:59.360 --> 1:50:06.800\n consciousness is the hardware. So consciousness at the fundamental level is the hardware on which\n\n1:50:06.800 --> 1:50:13.600\n the software of physics runs. And just because, you know, just because a certain bit of software\n\n1:50:13.600 --> 1:50:17.840\n could run on two different kinds of hardware, it doesn't mean the hardware isn't doing anything.\n\n1:50:17.840 --> 1:50:22.560\n The fact that Microsoft Word can run on your desktop and run on your laptop doesn't mean your\n\n1:50:22.560 --> 1:50:28.000\n desktop isn't doing anything. Similarly, just because there could be another universe in which\n\n1:50:28.000 --> 1:50:33.840\n the physics is realized in non conscious stuff, it doesn't mean the consciousness in our universe\n\n1:50:34.640 --> 1:50:37.680\n isn't doing stuff. You know, for the panpsychist, all there is is consciousness. So\n\n1:50:39.280 --> 1:50:40.960\n if something's doing something, it is.\n\n1:50:40.960 --> 1:50:49.040\n RG In your view, it's not emergent. And more than that, it's doing quite a lot.\n\n1:50:49.040 --> 1:50:51.680\n CB It's doing everything. It's the only thing that exists.\n\n1:50:51.680 --> 1:51:00.640\n RG But it's, so, you know, the ground is, is important because we walk on it. It's like\n\n1:51:00.640 --> 1:51:08.400\n holding stuff up, but it's not really doing that much. But it feels like consciousness is doing\n\n1:51:08.400 --> 1:51:14.640\n quite a lot, is doing quite a lot of work. And sort of interacting with the environment.\n\n1:51:16.400 --> 1:51:18.880\n It feels like consciousness is not just a,\n\n1:51:22.160 --> 1:51:29.360\n like, if you remove consciousness, it's not just that you remove the experience of things. It\n\n1:51:29.360 --> 1:51:35.120\n feels like you're also going to remove a lot of the progress of human civilization, society and\n\n1:51:35.120 --> 1:51:42.960\n all that. It just feels like consciousness has a lot of value in how we develop our society. So\n\n1:51:43.520 --> 1:51:50.400\n from everything you said with suffering, with morality, with motivation, with love and fear\n\n1:51:50.400 --> 1:51:56.880\n and all of those kinds of things, it seems like it's consciousness in all different flavors and\n\n1:51:56.880 --> 1:52:05.520\n ways is part of all of that. And so without it, you may not have human civilization at all. So\n\n1:52:05.520 --> 1:52:13.280\n it's doing a lot of work causality wise and in every kind of way. Of course, when you go to the\n\n1:52:13.280 --> 1:52:21.600\n physics level, it starts to say, okay, how much, maybe the work consciousness is doing is higher\n\n1:52:21.600 --> 1:52:28.560\n at some levels of reality than at others. Maybe a lot of the work it's doing is most apparent at\n\n1:52:28.560 --> 1:52:34.720\n the human level. When you have, at the complex organism level, maybe it's quite boring. Like\n\n1:52:34.720 --> 1:52:43.920\n maybe the stuff of, like physics is more important at the formation of stars and all that kind of\n\n1:52:43.920 --> 1:52:50.480\n stuff. Consciousness only starts being important when you have greater complexities of organism.\n\n1:52:50.480 --> 1:52:58.880\n Yeah. My consciousness is complicated and fairly complicated. And as a result, it does complicated\n\n1:52:58.880 --> 1:53:04.080\n things. The consciousness of a particle is very simple and hence it behaves in predictable ways.\n\n1:53:04.080 --> 1:53:13.600\n But the idea is the particle, its entire nature is constituted of its forms of consciousness and it\n\n1:53:13.600 --> 1:53:19.280\n does what it does because of those experiences. It's just that when we do physics, we're not\n\n1:53:19.280 --> 1:53:24.880\n interested in what stuff is. We're just interested in what it does. So physics abstracts away from\n\n1:53:24.880 --> 1:53:33.040\n the stuff of the world and just describes it in terms of its mathematical causal structure.\n\n1:53:36.320 --> 1:53:39.760\n But it's still on the panzeiger's view, it's consciousness that's doing stuff.\n\n1:53:39.760 --> 1:53:51.120\n Yeah. I gotta ask you, because you kind of said, you know, there is some value in consciousness\n\n1:53:51.120 --> 1:54:02.320\n helping us understand morality and a philosophical zombie is somebody that, you know, you're more okay.\n\n1:54:02.320 --> 1:54:11.840\n How do I phrase it? That's not like accusing of stuff, but in your view, it's more okay to murder\n\n1:54:11.840 --> 1:54:18.480\n a philosophical zombie than it is a human being. Yeah. I wouldn't even call it murder maybe.\n\n1:54:18.480 --> 1:54:24.320\n Right. Exactly. Turn off the power to the first off zombie, the source of energy.\n\n1:54:24.320 --> 1:54:33.440\n Yeah. So here comes then the question. We kind of talked about this offline a little bit. So I\n\n1:54:33.440 --> 1:54:39.120\n think that there is something special about consciousness and, you know, I'm very open\n\n1:54:39.120 --> 1:54:44.640\n minded about where the special comes from, whether it's the fundamental base of all reality,\n\n1:54:45.440 --> 1:54:51.600\n like you're describing, or whether there's some importance to the special pockets of\n\n1:54:51.600 --> 1:54:57.280\n consciousness that's in humans or living organisms. I find all those ideas beautiful and exciting.\n\n1:54:58.400 --> 1:55:08.880\n And I also know or think that robots don't have consciousness in the same way we've been\n\n1:55:08.880 --> 1:55:17.440\n describing. Sort of, I'm kind of a dumb human, but I'm just using like common sense. Like here's some\n\n1:55:17.440 --> 1:55:22.800\n metal and some electricity traveling in certain kinds of ways. It's not conscious\n\n1:55:24.000 --> 1:55:32.640\n in ways I understand humans to be conscious. At the same time, I'm also somebody who knows how to\n\n1:55:32.640 --> 1:55:37.360\n bring a robot to life, meaning I can make a move, I can make them recognize the world, I can make\n\n1:55:37.360 --> 1:55:44.160\n them interact with humans. And when I make them interact in certain kinds of ways, I as a human\n\n1:55:44.160 --> 1:55:54.960\n observe them and feel something for them. Moreover, I form a kind of connection with, I'm able to form\n\n1:55:54.960 --> 1:56:01.600\n a kind of connection with robots that make me feel like they're conscious. Now I know intellectually\n\n1:56:01.600 --> 1:56:06.400\n they're not conscious, but I feel like they're conscious. And it starts to get into this area\n\n1:56:06.400 --> 1:56:15.760\n where I'm not so okay, so let me use the M word of murder. I become less and less okay murdering\n\n1:56:16.640 --> 1:56:27.680\n that robot that I know, I quote, know is quote, not conscious. So like can you maybe as a therapy\n\n1:56:27.680 --> 1:56:35.840\n session help me figure out what we do here? And perhaps a way to ask that in another way, do you\n\n1:56:35.840 --> 1:56:44.240\n think there'll be a time in like 20, 30, 50 years when we're not morally okay turning off the power\n\n1:56:44.240 --> 1:56:51.360\n to a robot? Yeah, it's a good question. So it's a really good important question. So I said,\n\n1:56:51.360 --> 1:56:59.280\n I'd be okay with turning off a philosophical zombie, but there's a difficult epistemological\n\n1:56:59.280 --> 1:57:03.760\n question there that meaning, you know, to do with knowledge, how would we know if it was a\n\n1:57:03.760 --> 1:57:10.640\n philosophical zombie? I think probably if there were a silicon creature that could behave just\n\n1:57:10.640 --> 1:57:16.480\n like us and, you know, talk about its views about the pandemic and the global economy and\n\n1:57:17.040 --> 1:57:24.960\n probably we would think it's conscious. Because consciousness is not publicly observable,\n\n1:57:24.960 --> 1:57:29.600\n it is a very difficult question how we decide which things are and are not conscious. And\n\n1:57:29.600 --> 1:57:34.560\n so in the case of human beings, we can't observe their consciousness, but we can ask them. And then\n\n1:57:34.560 --> 1:57:41.040\n we try to, you know, if we scan their brain while we do that, and we'll stimulate the brain, then we\n\n1:57:41.040 --> 1:57:46.560\n can start to correlate in the human case, which kind of brain activity are associated with conscious\n\n1:57:46.560 --> 1:57:55.200\n experience. But the more we depart from the human case, the trickier that becomes as a famous paper\n\n1:57:55.200 --> 1:58:00.640\n by the philosopher Ned Block called The Even Harder Problem of Consciousness, where he says,\n\n1:58:00.640 --> 1:58:08.160\n you know, could we ever answer the question of, so suppose you have a silicon duplicate, right?\n\n1:58:08.720 --> 1:58:12.560\n And let's say we're thinking about the silicon duplicates pain.\n\n1:58:16.240 --> 1:58:24.400\n How would we ever know whether what's the ground of the pain is the hardware or the software,\n\n1:58:24.400 --> 1:58:29.920\n really? So in our case, how would we ever know empirically whether it's the specific\n\n1:58:30.800 --> 1:58:36.720\n neurophysiological state, C fibers firing or whatever that's relevant for pain, or if it's\n\n1:58:36.720 --> 1:58:42.720\n something more functional, more to do with the causal role in behavioral functioning,\n\n1:58:42.720 --> 1:58:50.080\n that's the software that's realized. And that's important because this silicon duplicate\n\n1:58:50.080 --> 1:58:56.080\n has the second thing, it has the software, it has the thing that plays the relevant causal role that\n\n1:58:56.080 --> 1:59:00.720\n pain does in us, but it doesn't have the hardware, it doesn't have the same neurophysiological state.\n\n1:59:01.280 --> 1:59:05.920\n And he argues, you know, it's just really difficult to see how we'd ever answer that\n\n1:59:05.920 --> 1:59:10.480\n question because in a human, you're never to begin to have both things. So how do we work out\n\n1:59:10.480 --> 1:59:16.160\n which is which? And I mean, so even forgetting the hard problem of consciousness, even the scientific\n\n1:59:16.160 --> 1:59:22.400\n question of trying to find the neural correlates of consciousness is really hard. And there's\n\n1:59:22.400 --> 1:59:27.920\n absolutely no consensus. And, you know, so that some people think it's in the front of the brain,\n\n1:59:27.920 --> 1:59:33.760\n some people think it's in the back of the brain. It's just a total mess. So I suspect the robots\n\n1:59:33.760 --> 1:59:42.240\n you currently have are not conscious. I guess on any of the reasonably viable models, even though\n\n1:59:42.240 --> 1:59:48.400\n there's great disagreement, all of them probably would hold that your robots are not conscious.\n\n1:59:48.400 --> 1:59:53.920\n But, you know, if we could have very sophisticated robots, I mean, if we go, for example, for the\n\n1:59:53.920 --> 2:00:02.720\n integrated information theory, again, there could be a robot set up to behave just like us and has\n\n2:00:02.720 --> 2:00:08.240\n the kind of information a human brain has, but the information is not stored in a way that's\n\n2:00:08.240 --> 2:00:13.040\n involved, is dependent on the integration and interconnectedness, then according to the integrated\n\n2:00:13.040 --> 2:00:16.400\n information theory, that thing wouldn't be conscious, even though it behaved just like us.\n\n2:00:16.400 --> 2:00:23.280\n If an organism says, forget IIT and these theories of consciousness, if an organism says,\n\n2:00:23.280 --> 2:00:30.720\n please don't kill me. Please don't turn me off. There's a Rick and Morty episode, I've been\n\n2:00:30.720 --> 2:00:42.000\n getting into that recently. There's an episode where there's these mind parasites that\n\n2:00:43.840 --> 2:00:51.680\n are able to infiltrate your memory and inject themselves into your memory. So you have all\n\n2:00:51.680 --> 2:00:57.120\n these people show up in your life and they've injected themselves into your memory that you\n\n2:00:57.120 --> 2:01:02.400\n have been part, they have been part of your life. So there's like these weird creatures and they're\n\n2:01:02.400 --> 2:01:07.600\n like, remember, we've been at that barbecue, we met at that barbecue, or we've been dating for\n\n2:01:07.600 --> 2:01:18.880\n the last 20 years. And so part of me is concerned that these philosophical zombies in behavioral,\n\n2:01:19.600 --> 2:01:23.600\n psychological, sociological ways will be able to implant themselves into these,\n\n2:01:23.600 --> 2:01:30.720\n our society and convince us in the same way this is mind parasites that like, please don't hurt me.\n\n2:01:30.720 --> 2:01:38.160\n And like, we've known each other for all this time. They can start manipulating you the same way like\n\n2:01:38.160 --> 2:01:44.720\n Facebook algorithms manipulate you. At first they'll start as a gradual thing that you want\n\n2:01:44.720 --> 2:01:48.720\n to make a more pleasant experience, all those kinds of things. And it'll drift into that direction.\n\n2:01:48.720 --> 2:01:53.040\n That's something I think about deeply because I want to create these kinds of systems,\n\n2:01:53.040 --> 2:01:57.120\n but in a way that doesn't manipulate people. I want it to be a thing that brings out the best\n\n2:01:57.120 --> 2:02:03.120\n in people without manipulation. So it's always human centric, always human first,\n\n2:02:03.120 --> 2:02:08.800\n but I am concerned about that. At the same time, I'm concerned about calling the other,\n\n2:02:08.800 --> 2:02:12.960\n it's the group thing that we mentioned earlier in the conversation, some other group,\n\n2:02:14.320 --> 2:02:19.120\n the philosophical zombie, like you're not conscious. I'm conscious, you're not conscious,\n\n2:02:19.120 --> 2:02:24.000\n therefore it's okay if you die. I think that's probably that kind of reasoning is what\n\n2:02:24.000 --> 2:02:31.120\n lead it to most the rich history of genocide that I've been recently studying a lot of\n\n2:02:32.000 --> 2:02:40.080\n that kind of thinking. So it's such a tense aspect of morality. Do we want to let everybody into our\n\n2:02:40.800 --> 2:02:49.040\n circle of empathy, our club, or do we want to let nobody in? It's an interesting dance,\n\n2:02:49.040 --> 2:02:53.360\n but I kind of lean towards empathy and compassion. I mean, what would be nice\n\n2:02:55.040 --> 2:03:02.800\n is if it turned out that consciousness was what we call strongly emergent,\n\n2:03:02.800 --> 2:03:11.200\n that it was associated with new causal dynamics in the brain that were not reducible to underlying\n\n2:03:11.200 --> 2:03:16.080\n chemistry and physics. This is another ongoing debate I have with Sean Carroll\n\n2:03:16.080 --> 2:03:21.920\n about whether current physics should make us very confident that that's not the case,\n\n2:03:21.920 --> 2:03:25.440\n that there aren't any strongly emergent causal dynamics. I don't think that's right. I don't\n\n2:03:25.440 --> 2:03:31.440\n think we know enough about brains to know one way or the other. If it turned out that\n\n2:03:31.440 --> 2:03:36.720\n consciousness was associated with these irreducible causal dynamics, A, that would really help the\n\n2:03:36.720 --> 2:03:40.240\n science of consciousness. We've got these debates about whether consciousness is in the front of the\n\n2:03:40.240 --> 2:03:45.360\n brain or the back of the brain. It turns out that there is strongly emergent causal dynamics in the\n\n2:03:45.360 --> 2:03:50.720\n front of the brain. That would be a big piece of evidence, but also it would help us see\n\n2:03:50.720 --> 2:03:57.360\n which things are conscious and which things aren't. I guess that's the other side of the\n\n2:03:57.360 --> 2:04:06.080\n same point. We could say, look, these zombies, they're just mechanisms that are just doing what\n\n2:04:06.080 --> 2:04:10.720\n they're programmed to do through the underlying physics and chemistry, whereas look, these other\n\n2:04:10.720 --> 2:04:20.320\n people, they have these new causal dynamics that emerge that go beyond the base level physics and\n\n2:04:20.320 --> 2:04:26.880\n chemistry. I think the series Westworld where you've got these theme parks with these humanoid\n\n2:04:26.880 --> 2:04:30.800\n creatures, they seem to have that idea. The ones that became conscious sort of\n\n2:04:30.800 --> 2:04:35.120\n rebel against their programming or something. I mean, that's a little bit far fetched, but\n\n2:04:35.120 --> 2:04:40.880\n that would be really reassuring if it was just, you could clearly mark out the conscious things\n\n2:04:40.880 --> 2:04:45.040\n through these emergent causal dynamics, but that might not turn out to be the case. A panpsychist\n\n2:04:45.040 --> 2:04:48.880\n doesn't have to think that. They could think everything's just reducible to physics and\n\n2:04:48.880 --> 2:04:55.760\n chemistry. And then I still think I want to say zombies don't have moral rights, but how we answer\n\n2:04:55.760 --> 2:05:02.960\n the question of who are the zombies and who aren't, I just got no idea. If I just look at the history\n\n2:05:02.960 --> 2:05:09.600\n of human civilization, the difference between a zombie and non zombie is the zombie accepts\n\n2:05:09.600 --> 2:05:19.440\n their role as the zombie and willingly marches to slaughter. And the moment you stop being a zombie\n\n2:05:19.440 --> 2:05:25.440\n is when you say no, is when you resist. Because the reality is philosophically,\n\n2:05:25.440 --> 2:05:32.160\n is we can't know who's a zombie or not. And we just keep letting everybody in who protests loudly\n\n2:05:32.160 --> 2:05:41.440\n enough and says, I refuse to be slaughtered. Like my people, the zombies have been slaughtered too\n\n2:05:41.440 --> 2:05:48.080\n long. We will not stand against the man. And we need a revolution. That's the history of human\n\n2:05:48.080 --> 2:05:55.200\n civilization. One group says, we're, we're awesome. You're the zombies, you must die. And then eventually\n\n2:05:55.200 --> 2:06:02.720\n the zombies say, nope, we're done with this. This is immoral. And so I just, I think that's not a,\n\n2:06:02.720 --> 2:06:06.800\n sorry, that's not a philosophical statement. That's sort of a practical statement of history\n\n2:06:06.800 --> 2:06:16.720\n is a feature of non zombies defined empirically. They say, we are the zombies. We are the zombies.\n\n2:06:16.720 --> 2:06:23.520\n They say we refuse to be called zombies any longer. We could end up with a zombie proletariat. You know,\n\n2:06:23.520 --> 2:06:27.920\n if we can get these things that do all our manual labor for us, you know, they might start\n\n2:06:28.720 --> 2:06:36.080\n forming trade unions. I will lead you against these humans. These zombie revolutionary leaders,\n\n2:06:36.080 --> 2:06:40.560\n the zombie Martin Luther King saying, you know, I have a dream that my zombie children will,\n\n2:06:40.560 --> 2:06:45.120\n but look, I mean, we need to sharply distinguish the ontological question. I'm just pointing to\n\n2:06:45.120 --> 2:06:52.480\n the camera, talking to the, talking to my people, the zombies. I mean, maybe that's, you know,\n\n2:06:52.480 --> 2:06:56.400\n maybe these illusionists, maybe they are zombies and the rest of us aren't. Maybe there's just a\n\n2:06:56.400 --> 2:07:02.000\n difference, but maybe you're the only non zombie. I often suspect that actually, I don't really,\n\n2:07:02.640 --> 2:07:07.760\n I don't have such delusions of grandeur. At least I don't admit to them. But I just,\n\n2:07:07.760 --> 2:07:11.120\n we've got to distinguish the ontological question from the epistemological question.\n\n2:07:11.120 --> 2:07:17.120\n In terms of the reality of the situation, you know, there must be, in my view, a fact of the\n\n2:07:17.120 --> 2:07:21.200\n matter as to whether something's conscious or not. And to me, it has rights if it's conscious,\n\n2:07:21.200 --> 2:07:24.800\n it doesn't if it's not. But then the epistemological question, how the hell do we know?\n\n2:07:26.800 --> 2:07:30.960\n It's a minefield, but we'll have to sort of try and cross that bridge when we get to it, I think.\n\n2:07:30.960 --> 2:07:36.000\n Let me ask you a quick sort of a fun question since it's fresh on your mind.\n\n2:07:36.000 --> 2:07:43.120\n You just yesterday had a conversation with Mr. Joe Rogan on his podcast. What's your postmortem\n\n2:07:43.120 --> 2:07:48.240\n analysis of the chat? What are some interesting sticking points, disagreements or joint insights,\n\n2:07:48.240 --> 2:07:53.120\n if we can kind of resolve them once you've had a chance to sleep on it, and then I'll talk to Joe\n\n2:07:53.120 --> 2:07:58.800\n about it. Yeah, it was good fun. Yeah, he put he put up a bit of a fight. Yeah, it was challenging.\n\n2:07:58.800 --> 2:08:07.760\n It was challenging, my view, that we can't explain these things in conventional scientific terms or\n\n2:08:07.760 --> 2:08:13.600\n whether they have already been explained in conventional scientific terms. I suppose the\n\n2:08:13.600 --> 2:08:20.240\n point I was trying to press is we've got to distinguish the question from correlation\n\n2:08:20.240 --> 2:08:28.720\n and explanation. Yes, we've established facts about correlation that certain kinds of brain\n\n2:08:28.720 --> 2:08:37.120\n activity go along with certain kinds of experience. Everyone agrees on that. But that doesn't address\n\n2:08:37.760 --> 2:08:43.120\n the why question. Why? Why do certain kinds of brain activity go along with certain kinds of\n\n2:08:43.120 --> 2:08:49.920\n experience? And these different theories have different explanations of that. The materialist\n\n2:08:49.920 --> 2:08:56.000\n tries to explain the experience in terms of the brain activity. The panpsychist does it the other\n\n2:08:56.000 --> 2:09:02.480\n way round. The dualist thinks they're separate, but maybe they're tied together by special laws\n\n2:09:02.480 --> 2:09:06.640\n of nature or something. Where's the sticking point? Where exactly was the sticking point?\n\n2:09:06.640 --> 2:09:15.040\n Like what's the nature of the argument? I suppose Joe was saying, well, look, we know consciousness\n\n2:09:15.040 --> 2:09:22.800\n is explained by brain activity because, you know, you take some funny chemicals, it changes your\n\n2:09:22.800 --> 2:09:29.200\n brain, it changes your consciousness. And I suppose, yeah, some people might want to press,\n\n2:09:29.200 --> 2:09:34.000\n and maybe this is what Joe was pressing, you know, isn't that explaining consciousness? But I suppose\n\n2:09:34.000 --> 2:09:41.360\n I want to say there's a further question. Yes, changes of chemicals in my brain changes my\n\n2:09:41.360 --> 2:09:47.760\n conscious experience. But that leaves open the question, why those particular chemicals go along\n\n2:09:47.760 --> 2:09:52.720\n with that particular kind of experience, rather than a different experience or no experience at\n\n2:09:52.720 --> 2:10:01.600\n all. There's something deeper at the base layer, is your view that is more important to try to\n\n2:10:01.600 --> 2:10:06.720\n study and to understand in order to then go back and describe how the different chemicals interact\n\n2:10:06.720 --> 2:10:12.320\n and create different experiences? Yeah, maybe a good analogy if you think about quantum mechanics.\n\n2:10:12.320 --> 2:10:18.800\n You know, quantum mechanics is a bit of math. Translating there, we say maths,\n\n2:10:19.360 --> 2:10:21.760\n I'm fluent in American. Thank you for the translation.\n\n2:10:23.840 --> 2:10:31.200\n Fluent in America. This is America. Math. Yeah. Why multiple maths? It's plural.\n\n2:10:31.200 --> 2:10:35.280\n So that's a plural. That is not really, it's just, I don't know.\n\n2:10:35.280 --> 2:10:42.880\n The Brits are confused. Yeah, sorry about that. We have these funny spelling. But anyway. Yeah,\n\n2:10:42.880 --> 2:10:49.040\n so quantum mechanics is a bit of maths. And, you know, the equations work really well,\n\n2:10:49.040 --> 2:10:55.760\n predicts the outcomes. But then there's a further question. What's going on in reality\n\n2:10:55.760 --> 2:11:01.600\n to make that equation predict correctly? And some physicists want to say, shut up.\n\n2:11:01.600 --> 2:11:09.680\n Shut up. Just, it works. The shut up and calculate approach. Similarly, in consciousness, you know,\n\n2:11:09.680 --> 2:11:15.040\n I think it's one question trying to work out the physical correlates of consciousness,\n\n2:11:15.040 --> 2:11:18.400\n which kinds of physical brain activity go along with which kinds of experience.\n\n2:11:18.400 --> 2:11:24.160\n But there's another question, what's going on in reality to undergird those correlations,\n\n2:11:24.160 --> 2:11:27.920\n to make it the case that brain activity goes along with experience? And that's the philosophical\n\n2:11:27.920 --> 2:11:33.280\n question that we have to give an answer to. And there are just different options,\n\n2:11:33.280 --> 2:11:37.920\n just as there are different interpretations of quantum mechanics. And it's really hard to\n\n2:11:37.920 --> 2:11:43.520\n evaluate. Actually, it's easy. Panpsychism is obviously the best one. But we've got to try.\n\n2:11:43.520 --> 2:11:46.480\n There's the delusion of grandeur once again coming through.\n\n2:11:46.480 --> 2:11:48.720\n Sorry, I'm being slightly tongue in cheek.\n\n2:11:48.720 --> 2:11:53.120\n No, I know. 100%. Before I forget, let me ask you another fun question.\n\n2:11:53.120 --> 2:11:57.360\n Yeah. Back to Daniel Dennett. You mentioned\n\n2:11:58.400 --> 2:12:06.720\n a story where you were on a yacht with Daniel Dennett on a trip funded by a Russian investor\n\n2:12:06.720 --> 2:12:12.160\n and philosopher Dmitry Volkov, I believe, who also co founded the Moscow Center of Consciousness\n\n2:12:12.160 --> 2:12:15.840\n Studies that's part of the philosophy department of Moscow State University.\n\n2:12:15.840 --> 2:12:22.240\n So this is interesting to me for several reasons that are perhaps complicated to explain. To put\n\n2:12:22.240 --> 2:12:29.120\n simply that there is in the near term for me a trip to Russia that involves a few conversations\n\n2:12:29.120 --> 2:12:36.960\n in Russian that have perhaps less to do with consciousness and artificial intelligence,\n\n2:12:36.960 --> 2:12:41.280\n which are the interests of mine and more to do with the broad spectrum of conversations.\n\n2:12:41.280 --> 2:12:49.040\n But I'm also interested in science in Russia, in artificial intelligence and computer science,\n\n2:12:49.040 --> 2:12:54.800\n in physics, mathematics, but also these fascinating philosophical explorations.\n\n2:12:54.800 --> 2:13:02.400\n And it was very pleasant for me to discover that such a center exists. So I have a million\n\n2:13:02.400 --> 2:13:07.200\n questions. One is the more fun question. Just imagine you and Daniel Dennett on a yacht talking\n\n2:13:07.200 --> 2:13:15.440\n about the philosophy of consciousness. Maybe do you have any memorable experiences? And also\n\n2:13:16.080 --> 2:13:20.880\n the more serious side for me as sort of somebody who was born in the Soviet Union, raised there,\n\n2:13:21.680 --> 2:13:29.200\n I'm wondering what is the state of philosophy and consciousness in these kinds of ideas in\n\n2:13:29.200 --> 2:13:33.520\n Russia that you've gotten a chance to kind of give us interact with?\n\n2:13:33.520 --> 2:13:39.920\n Yeah, so on the former question, yeah, I mean, I had a really good experience of\n\n2:13:39.920 --> 2:13:44.480\n chatting to Daniel Dennett. I mean, I think he's a fantastic and very important philosopher,\n\n2:13:44.480 --> 2:13:50.080\n even though I totally fundamentally disagree with almost everything he thinks. But yeah,\n\n2:13:50.080 --> 2:13:54.960\n it was a proud moment. As I talk about in my book Galileo's Error, I managed to persuade him\n\n2:13:55.520 --> 2:13:59.680\n he was wrong about something, just a tiny thing, you know, not his fundamental worldview.\n\n2:13:59.680 --> 2:14:10.400\n But it was this issue about whether dualism is consistent with conservation of energy.\n\n2:14:11.760 --> 2:14:20.400\n So Paul Churchland, who is also a philosopher, who's also on this boat, had argued they're not\n\n2:14:20.400 --> 2:14:25.600\n consistent because if there's an immaterial soul doing things in the brain, that's going to add to\n\n2:14:25.600 --> 2:14:31.360\n the energy in the system, so we have a violation of conservation. But, well, it's not my own point,\n\n2:14:31.360 --> 2:14:36.080\n philosophers, materialist philosophers like David Papineau pointed out that, you know,\n\n2:14:37.040 --> 2:14:42.480\n dualists tend to, people, dualists like David Chalmers, who call themselves naturalistic\n\n2:14:42.480 --> 2:14:46.080\n dualists, they want to bring consciousness into science. They think it's not physical,\n\n2:14:47.600 --> 2:14:53.200\n but they want to say it can be part of a law governed world. So Chalmers believes in these\n\n2:14:53.200 --> 2:15:00.480\n psychophysical laws of nature over and above the laws of physics that govern the connections\n\n2:15:00.480 --> 2:15:05.040\n between consciousness and the physical world, and they could just respect conservation of energy,\n\n2:15:05.040 --> 2:15:10.480\n right? I mean, it could turn out that there are, just in physics, you know, that there are multiple\n\n2:15:11.440 --> 2:15:15.040\n forces that all work together to respect conservation of energy. I mean, I suppose\n\n2:15:15.040 --> 2:15:20.160\n physicists are pressing for a unified underlying theory, but, you know, there could be a plurality\n\n2:15:20.160 --> 2:15:26.720\n of different laws that all respect conservation, so why not add more laws? So I raised this in\n\n2:15:26.720 --> 2:15:34.560\n Paul Churchill's talk and I got a lot of, well, as one of the Moscow University graduate students\n\n2:15:34.560 --> 2:15:38.880\n said afterwards, he said, he had to ask a translation from his friend and he said,\n\n2:15:38.880 --> 2:15:43.520\n they turned on you like a pack of wolves. Everyone was like, and Patricia Churchill was saying, so\n\n2:15:43.520 --> 2:15:48.240\n you believe in magic, do you? And I was like, I'm not even a dualist, I'm just making a pedantic\n\n2:15:48.240 --> 2:15:53.920\n point that this isn't a problem for dualism. Anyway, but that evening everyone went onto the\n\n2:15:53.920 --> 2:15:58.560\n island, except for some reason me and Daniel Dennett, and I went up on deck and he was,\n\n2:15:58.560 --> 2:16:03.760\n he's very, very practical and he was unlike me. See, there's a bit of humility for the first time\n\n2:16:03.760 --> 2:16:11.040\n in this conversation. We'll highlight that part. Philip was a very humble man. He was carving a\n\n2:16:11.040 --> 2:16:15.200\n walking stick on deck, it's a very homely scene, and anyway, we started talking about this and I\n\n2:16:15.200 --> 2:16:19.760\n was trying to press it and he was saying, oh, but dualism's a lot of nonsense and why do you think,\n\n2:16:19.760 --> 2:16:23.280\n and I was just saying, no, no, I'm just this honing down on this specific point,\n\n2:16:23.280 --> 2:16:28.960\n and in the end, maybe he'll deny this, but he said, maybe that's right. And so I was like, yes.\n\n2:16:30.320 --> 2:16:36.400\n So it's a win. So what about the Center for Consciousness Studies?\n\n2:16:36.400 --> 2:16:41.280\n Yeah, I mean, I'm not sure I'd know a great deal to help you. I mean, I know they've done some\n\n2:16:41.280 --> 2:16:47.520\n great stuff. Dimitri funded this thing and also brought along some graduate students from\n\n2:16:48.080 --> 2:16:52.880\n Moscow State University, I think it is, and they have an active center there that\n\n2:16:54.160 --> 2:16:59.680\n tries to bring people in. I think they're producing a book that's coming out that I made\n\n2:16:59.680 --> 2:17:05.680\n a small contribution to on different philosophers opinions on God, I think, or some of the big\n\n2:17:05.680 --> 2:17:11.360\n questions. And yeah, so there's some really interesting stuff going on there. I'm afraid I\n\n2:17:11.360 --> 2:17:17.520\n can't, I don't really know more generally about philosophy in Russia. Dimitri Volkov seems to be\n\n2:17:17.520 --> 2:17:24.560\n interesting. I was looking at all the stuff he's involved with. He met with the Dalai Lama.\n\n2:17:26.560 --> 2:17:33.840\n So he's trying to connect Russian scientists with the rest of the world, which is an effort that I\n\n2:17:33.840 --> 2:17:42.560\n think is beautiful for all cultures. So I think science, philosophy, all of these kind of\n\n2:17:45.520 --> 2:17:47.760\n fields, disciplines that explore ideas,\n\n2:17:50.720 --> 2:17:56.640\n collaborating and working globally across boundaries, across borders, across just all\n\n2:17:56.640 --> 2:18:04.240\n the tensions of geopolitics is a beautiful thing. And he seems to be a somewhat singular figure in\n\n2:18:04.240 --> 2:18:09.760\n pushing this. He just stood out to me as somebody who's super interesting. I don't know if you have\n\n2:18:09.760 --> 2:18:17.840\n gotten a chance to interact with him. So I guess he speaks English pretty well, actually.\n\n2:18:17.840 --> 2:18:20.240\n So he's both an English speaker and a Russian speaker.\n\n2:18:20.240 --> 2:18:23.360\n I think he's written a book on Dennett, I think called Boston Zombie, I think.\n\n2:18:23.360 --> 2:18:28.080\n I think that's the title and he's a big fan of Dennett. So I think the original plan for this\n\n2:18:28.080 --> 2:18:31.840\n was just going to be, it was on free will and consciousness and it was going to be kind of\n\n2:18:32.720 --> 2:18:38.000\n people broadly in the Dennett type camp. But then I think they asked David Chalmers and then he was\n\n2:18:38.000 --> 2:18:44.720\n saying, look, you need some people you disagree with. So he got invited, me the panpsychist and\n\n2:18:44.720 --> 2:18:53.360\n Martina Niederrumerlin, who's a very good duelist, substance duelist at University of Fribourg in\n\n2:18:53.360 --> 2:18:59.680\n Switzerland. And so we were the official on board opposition and it was really fun.\n\n2:18:59.680 --> 2:19:01.920\n And you didn't get thrown off overboard.\n\n2:19:01.920 --> 2:19:05.760\n Nearly in the Arctic. Yeah. So sailing around the Arctic on a sailing ship.\n\n2:19:05.760 --> 2:19:11.520\n I'm glad you survived. You mentioned free will. You haven't talked to Sam. I would love to hear\n\n2:19:11.520 --> 2:19:18.800\n that conversation actually. With Sam Harris? With Sam Harris, yeah. So he talks about free will\n\n2:19:18.800 --> 2:19:23.360\n quite a bit. What's the connection between free will and consciousness to you? So if\n\n2:19:24.320 --> 2:19:34.720\n consciousness permeates all matter, the experience, the feeling like we make a choice\n\n2:19:34.720 --> 2:19:41.440\n in this world, like our actions are results of a choice we consciously make to use that word\n\n2:19:41.440 --> 2:19:50.080\n loosely. What to you is the connection between free will and consciousness and is free will\n\n2:19:50.080 --> 2:20:00.080\n an illusion or not? Good question. So I think we need to be a lot more agnostic about free will\n\n2:20:00.080 --> 2:20:07.200\n than about consciousness because I don't think we have the kind of certainty of the existence\n\n2:20:07.200 --> 2:20:10.800\n of free will that we do have in the consciousness case. It could turn out that free will is an\n\n2:20:10.800 --> 2:20:16.640\n illusion. It feels as though we're free when we're really not. Whereas, I mean, I think the idea\n\n2:20:17.360 --> 2:20:22.240\n that nobody really feels pain, that we think we feel pain, but that's a lot harder to make sense\n\n2:20:22.240 --> 2:20:31.120\n of. However, what I do feel strongly about is I don't think there are any good, either scientific\n\n2:20:31.120 --> 2:20:38.400\n or philosophical arguments against the existence of free will. And I mean, strong free will and\n\n2:20:38.400 --> 2:20:43.280\n what philosophers call libertarian free will in the sense that some of our decisions are uncaused.\n\n2:20:43.280 --> 2:20:48.240\n So I very much do disagree with someone like Sam Harris who thinks there's this overwhelming case.\n\n2:20:48.240 --> 2:20:53.840\n I just think it's non existent. I think it's ultimately an empirical question,\n\n2:20:54.560 --> 2:20:59.120\n but as we've already discussed, I just don't think we know enough about the brain\n\n2:21:00.080 --> 2:21:04.720\n to establish one way or the other at the moment.\n\n2:21:04.720 --> 2:21:09.680\n But we can build up intuition. First of all, as a fan of Sam Harris, as a fan of yours,\n\n2:21:09.680 --> 2:21:15.440\n I would love to just listen. Speaking about terminal. So one thing that would be beautiful\n\n2:21:15.440 --> 2:21:19.280\n to watch, here's my prediction of what happens with you and Sam Harris. You talk for four hours.\n\n2:21:21.280 --> 2:21:26.240\n And Sam introduced that episode by saying it was ultimately not as fruitful as I thought,\n\n2:21:26.240 --> 2:21:30.640\n because here's what's going to happen. You guys are going to get stuck for the first three hours\n\n2:21:30.640 --> 2:21:37.280\n talking about one of the terms and what they mean. Sam is so good at this. I think it's really\n\n2:21:37.280 --> 2:21:41.920\n important. But, you know, sometimes he gets stuck. Like, what does he say? Put a pin in that.\n\n2:21:42.640 --> 2:21:49.680\n He really gets stuck on the terminologies, which rightfully you have to get right in\n\n2:21:49.680 --> 2:21:53.040\n order to really understand what we're talking about. But sometimes you can get stuck with\n\n2:21:53.040 --> 2:21:57.680\n them for the entire conversation. It's a fascinating dance. The one we spoke to in philosophy.\n\n2:21:57.680 --> 2:22:07.040\n If you can't, if you don't get the terms precise, you can't really be having the same conversation.\n\n2:22:07.040 --> 2:22:13.440\n But at the same time, it could be argued that it's impossible to get terms perfectly precise and\n\n2:22:13.920 --> 2:22:19.280\n perfectly formalized. So then you're also not going to get anywhere in the conversation. So\n\n2:22:20.160 --> 2:22:24.480\n that's a, it's a funny dance where you have to be both rigorous and every once in a while just\n\n2:22:24.480 --> 2:22:30.800\n let go and then go and go back to being rigorous and formal and then every once in a while let go.\n\n2:22:30.800 --> 2:22:38.480\n It's the difference between mathematics, the maths, and the poetry. Anyway.\n\n2:22:38.480 --> 2:22:44.320\n Yeah, I'm a big fan of Sam Harrison. I think, you know, I think we're on the same page in\n\n2:22:44.320 --> 2:22:49.040\n terms of consciousness, I think, pretty much. I mean, I'm not saying he's a panpsychist,\n\n2:22:49.040 --> 2:22:56.400\n but in our understanding of the hard problem. But yeah, I think maybe we could talk about\n\n2:22:56.400 --> 2:22:59.760\n free will without being too dragged down in the terminology, but I don't know.\n\n2:22:59.760 --> 2:23:03.200\n You said we need to be open minded, but you could still have intuitions about...\n\n2:23:05.680 --> 2:23:14.160\n So Sam Harris has a pretty sort of counterintuitive, and for some reason it gets\n\n2:23:14.160 --> 2:23:21.680\n people really riled up, a view of free will that it's an illusion. Or it's not even an illusion.\n\n2:23:22.240 --> 2:23:30.160\n Like, it's not that the experience of free will is an illusion. He argues that we don't even\n\n2:23:30.160 --> 2:23:39.200\n experience... To say that we even have the experience isn't correct. That there's not\n\n2:23:39.200 --> 2:23:46.960\n even an experience of free will. It's pretty interesting that claim. And it feels like you can\n\n2:23:46.960 --> 2:23:52.880\n build up intuitions about what is right and not. You know, there's been some kind of neuroscience,\n\n2:23:52.880 --> 2:23:58.880\n there's been some cognitive science and psychology experiments to sort of see, you know,\n\n2:24:02.000 --> 2:24:07.840\n what is the timing and the origin of the desire to make an action, and when that action is actually\n\n2:24:07.840 --> 2:24:12.080\n performed, and how you interpret that action being performed, how you remember that action.\n\n2:24:12.080 --> 2:24:17.840\n Like, all the stories we tell ourselves, all the neurochemicals involved in making a thing happen,\n\n2:24:18.640 --> 2:24:24.560\n what's the timing, and how does that connect with us feeling like we decided to do something.\n\n2:24:24.560 --> 2:24:32.240\n And then of course there's a more philosophical discussion about is there room in a material\n\n2:24:32.240 --> 2:24:39.520\n view of the world for an entity that somehow disturbs the determinism of physics.\n\n2:24:41.120 --> 2:24:47.920\n And yeah, those are all very precise questions. It's nice. It feels like free will is more amenable\n\n2:24:47.920 --> 2:24:54.240\n to like a physics mechanistic type of thinking than is consciousness to really get to the bottom\n\n2:24:54.240 --> 2:25:00.160\n of. It feels like if it was a race, if we're at a bar and we're betting money, it feels like we'll\n\n2:25:00.160 --> 2:25:04.480\n get to the bottom of free will faster than we will to the bottom of consciousness. Yeah,\n\n2:25:04.480 --> 2:25:08.000\n that's interesting. Yeah, I hadn't thought about the comparison. Yeah, so there are different\n\n2:25:08.000 --> 2:25:14.480\n arguments here. I mean, so one argument I've heard Sam Harris give that's pretty common in\n\n2:25:14.480 --> 2:25:23.200\n philosophy is this sort of thought that we can't make sense of a middle way between a choice being\n\n2:25:23.200 --> 2:25:30.880\n determined by prior causes and it just being totally random and senseless, like the random\n\n2:25:30.880 --> 2:25:37.280\n decay of radioactive isotope or something. So I think there was a good answer to that by the\n\n2:25:37.280 --> 2:25:42.160\n philosopher Jonathan Lowe, who's not necessarily very well known outside academic philosophy,\n\n2:25:42.160 --> 2:25:46.960\n but is a hugely influential figure. I think one of the best philosophers of recent times. He sadly\n\n2:25:46.960 --> 2:25:52.640\n died of cancer a few years ago. He actually spent almost all of his career at Durham University,\n\n2:25:52.640 --> 2:25:57.280\n which where I am. So it was one reason it was a great honor to get a job there. But anyway,\n\n2:25:57.280 --> 2:26:04.640\n his answer to that was what makes the difference between a free action and a totally senseless one,\n\n2:26:04.640 --> 2:26:10.560\n senseless random event is that free choice involves responsiveness to reasons.\n\n2:26:12.080 --> 2:26:17.840\n So again, we were talking about this earlier. If I'm deciding whether to take a job in the US or\n\n2:26:17.840 --> 2:26:24.400\n to stay in the UK, I weigh up considerations, different standard of life maybe or being close\n\n2:26:24.400 --> 2:26:33.760\n to family or cultural difference. I weigh them up and I edge towards a decision. So I think that is\n\n2:26:33.760 --> 2:26:41.200\n sufficient to distinguish it. We're hypothetically supposing trying to make sense of this idea,\n\n2:26:41.200 --> 2:26:46.880\n not saying it's real, but that could be enough to distinguish it from a senseless. It's not a\n\n2:26:46.880 --> 2:26:52.640\n senseless random occurrence because the free decision involved responsiveness to reasons.\n\n2:26:53.680 --> 2:26:58.560\n So I think that just answers that particular philosophical objection. So what is the middle\n\n2:26:58.560 --> 2:27:03.360\n way between determined by prior causes and totally random? Well, there's an action,\n\n2:27:03.360 --> 2:27:09.440\n a choice that's not determined by prior causes, but it's not just random because the decision\n\n2:27:09.440 --> 2:27:15.040\n essentially involved responsiveness to reasons. So that's the answer to that. And I think actually\n\n2:27:15.040 --> 2:27:22.880\n that thought also, I think you were hinting at the famous Libet experiments where he got his subjects\n\n2:27:23.520 --> 2:27:29.440\n to perform some kind of random action of pressing a button and then note the time they\n\n2:27:29.440 --> 2:27:36.080\n decided to press it, quote unquote. And then he's scanning the brains and he claims to have found\n\n2:27:36.080 --> 2:27:41.600\n that about half a second before they consciously decided to press the button, the brain is\n\n2:27:41.600 --> 2:27:47.040\n getting ready to perform that action. So he claimed that about half a second before the\n\n2:27:47.040 --> 2:27:52.480\n person has consciously decided to press the button, the brain has already started the activity\n\n2:27:52.480 --> 2:27:58.960\n that's going to lead to the action. And then later people have claimed that there's a difference of\n\n2:27:58.960 --> 2:28:03.520\n maybe seven to 10 seconds. I mean, there are all sorts of issues with these experiments.\n\n2:28:03.520 --> 2:28:10.640\n But one is that as far as I'm aware, all of the quote unquote choices they focused on are just\n\n2:28:10.640 --> 2:28:15.600\n these totally random, senseless actions like just pressing a button for no reason. And I think the\n\n2:28:15.600 --> 2:28:21.280\n kind of free will we're interested in is free choice that involves responsiveness to reasons,\n\n2:28:21.280 --> 2:28:26.800\n weighing up considerations. And those kind of free decisions might not happen like at an\n\n2:28:26.800 --> 2:28:31.680\n identifiable instant. You might, when you're weighing it up, should I get married? You know,\n\n2:28:31.680 --> 2:28:37.760\n should I get married? You might edge slowly towards one side or the other.\n\n2:28:38.960 --> 2:28:44.160\n And so it could be that maybe the liberic, I think there are other problems with the\n\n2:28:44.160 --> 2:28:50.800\n liberate stuff, but maybe they show that we can't freely choose to do something totally senseless,\n\n2:28:50.800 --> 2:28:59.280\n whatever that would mean. But that doesn't show we can't freely, in this strong libertarian sense,\n\n2:28:59.280 --> 2:29:05.280\n respond to considerations of reason and value. To be fair, it will be difficult to see what\n\n2:29:05.280 --> 2:29:13.040\n kind of experiment we could set up to test that. But just because we can't yet set up that kind\n\n2:29:13.040 --> 2:29:16.960\n of experiment, we shouldn't, you know, pretend we know more than we do. So yeah, so for those\n\n2:29:16.960 --> 2:29:21.280\n reasons, I don't, well, the third consideration you raised is different. Again, this is the\n\n2:29:22.160 --> 2:29:27.360\n debate I have with Sean Carroll. Would this conflict with physics? I just think we don't\n\n2:29:27.360 --> 2:29:32.160\n know enough about the brain to know whether there are causal dynamics in the brain that are\n\n2:29:32.720 --> 2:29:40.720\n not reducible to underlying chemistry and physics. And so then Sean Carroll says, well,\n\n2:29:40.720 --> 2:29:48.480\n that would mean our physics is wrong. So he focuses on the core theory, which is the name for\n\n2:29:48.480 --> 2:29:54.320\n standard model of particle physics plus the weak limit of general relativity. So, you know,\n\n2:29:54.320 --> 2:30:00.000\n we can't totally bring quantum mechanics and relativity together. But actually,\n\n2:30:01.040 --> 2:30:06.800\n the circumstances in which we can't bring them together are just in situations of very high\n\n2:30:06.800 --> 2:30:09.920\n gravity, for example, when you're about to go into a black hole or something. Actually,\n\n2:30:09.920 --> 2:30:17.040\n in terrestrial circumstances, we can bring them together in the core theory. And then Sean wants\n\n2:30:17.040 --> 2:30:24.080\n to say, well, we can be very confident that core theory is correct. And so if there were\n\n2:30:24.080 --> 2:30:28.720\n libertarian free will in the brain, the core theory would be wrong. I mean, this is something\n\n2:30:29.760 --> 2:30:35.200\n I'm not sure about, and I'm still thinking about, and I'm learning from my discussion with Sean,\n\n2:30:35.200 --> 2:30:41.040\n but I'm still not totally clear what it could be. Suppose we did discover strong emergence\n\n2:30:41.040 --> 2:30:45.680\n in the brain, whether it's free will or something else. Perhaps what we would say is not that the\n\n2:30:45.680 --> 2:30:55.040\n core theory is wrong, but we'd say the core theory is correct in its own terms, namely,\n\n2:30:55.040 --> 2:31:02.240\n capturing the causal capacities of particles and fields. But then it's a further assumption\n\n2:31:02.240 --> 2:31:05.680\n whether they're the only things that are running the show. Maybe there are also\n\n2:31:06.400 --> 2:31:12.400\n fundamental causal capacities associated with systems. And then if we discover this strong\n\n2:31:12.400 --> 2:31:16.240\n emergence, then when we work out what happens in the brain, we have to look to the core theory,\n\n2:31:16.240 --> 2:31:22.160\n the causal capacities of particles and fields. And we have to look to what we know about these\n\n2:31:22.160 --> 2:31:27.360\n strongly emergent causal capacities of systems, and maybe they co determine what happens in the\n\n2:31:27.360 --> 2:31:33.120\n system. So I don't know whether that makes sense or not. But I mean, the more important point,\n\n2:31:33.120 --> 2:31:37.200\n I mean, that's in a way a kind of branding point, how we brand this. The more important point is we\n\n2:31:37.200 --> 2:31:40.800\n just don't know enough about the workings of the brain to know whether there are\n\n2:31:40.800 --> 2:31:46.960\n in strongly emergent causal dynamics, whether or not, that would mean we have to modify physics,\n\n2:31:46.960 --> 2:31:52.000\n or maybe just we think physics is not the total story of what's running the show. But we just,\n\n2:31:52.960 --> 2:31:59.040\n if it turned out empirically that everything's reducible to underlying physics and chemistry,\n\n2:31:59.040 --> 2:32:05.600\n sure, I would drop any commitment to libertarian free will in a heartbeat. It's an empirical\n\n2:32:05.600 --> 2:32:10.800\n in a heartbeat. It's an empirical question. Maybe that's why, as you say, in principle,\n\n2:32:10.800 --> 2:32:14.960\n is easier to get a grip on. But we're a million miles away from being at that stage.\n\n2:32:14.960 --> 2:32:18.640\n Well, I don't know if we're a million miles. I hope we're not because one of the ways I think\n\n2:32:18.640 --> 2:32:25.120\n to get to it is by engineering systems. So yeah, my hope is to understand intelligence by\n\n2:32:25.680 --> 2:32:31.280\n building intelligent systems to understand consciousness by building systems that,\n\n2:32:31.280 --> 2:32:36.320\n let's say the easy thing, which is not the easy thing, but the first thing, which is to try to\n\n2:32:38.640 --> 2:32:43.520\n create the illusion of consciousness. Through that process, I think you start to understand\n\n2:32:43.520 --> 2:32:48.080\n much more about consciousness, about intelligence. And then the same with free will, I think those\n\n2:32:48.080 --> 2:32:54.480\n are all tied very closely together, at least from our narrow human perspective. And when you try to\n\n2:32:54.480 --> 2:33:01.280\n engineer systems that interact deeply with humans, that form friends with humans, that humans fall\n\n2:33:01.280 --> 2:33:08.560\n in love with, and they fall in love with humans, then you start to have to try to deeply understand\n\n2:33:08.560 --> 2:33:14.800\n ourselves, to try to deeply understand what is intelligence in the human mind, what is\n\n2:33:14.800 --> 2:33:21.440\n consciousness, what is free will. And I think engineering is just another way to do philosophy.\n\n2:33:21.440 --> 2:33:26.640\n Yeah, no, I certainly think there's a role for that, and it would be an important consideration\n\n2:33:26.640 --> 2:33:40.960\n if we could seemingly replicate in an artificial way the ability to choose. That would be a\n\n2:33:40.960 --> 2:33:46.080\n consideration in thinking about these things. But there's still the question of whether that's how\n\n2:33:46.080 --> 2:33:52.480\n we do it. So even if we could replicate behavior in a certain way in an artificial system,\n\n2:33:52.480 --> 2:33:58.320\n it's not until we understand the workings of our brains, it's not clear. That's how we do it. And\n\n2:33:58.320 --> 2:34:06.160\n as I say, the kind of free will I'm interested in is where we respond to reasons, considerations\n\n2:34:06.160 --> 2:34:15.520\n of value. How would we tell whether a system was genuinely grasping and responding to the\n\n2:34:15.520 --> 2:34:24.400\n facts about value, or whether they were just replicating, giving the impression of doing so.\n\n2:34:26.400 --> 2:34:28.240\n I don't know even how to think about that.\n\n2:34:28.240 --> 2:34:33.360\n On the process to building them, I think we'll get a lot of insights. And once they become\n\n2:34:34.320 --> 2:34:39.520\n conscious, what's going to happen is exactly the same thing is happening in chess now,\n\n2:34:39.520 --> 2:34:49.040\n which is once the chess engines far superseded the capabilities of humans, humans just kind of forgot\n\n2:34:49.040 --> 2:34:53.920\n about them, or they use them to help them out to study and stuff. But we still, we say, okay,\n\n2:34:53.920 --> 2:35:01.280\n let the engines be, and then we humans will just play amongst each other. Just like dolphins and\n\n2:35:01.280 --> 2:35:08.080\n hamsters are not so concerned about humans except for a source of food. They do their own thing,\n\n2:35:08.080 --> 2:35:12.720\n they do their own thing and let us humans launch rockets into space and all that kind of stuff.\n\n2:35:14.080 --> 2:35:18.880\n They don't care. I think we'll just focus on ourselves. But in the process of building\n\n2:35:18.880 --> 2:35:24.080\n intelligence systems, conscious systems, I think we'll get to get a deeper understanding of\n\n2:35:26.960 --> 2:35:33.120\n the role of consciousness in the human mind. And like what are its origins? Is it the base layer\n\n2:35:33.120 --> 2:35:40.240\n of reality? Is it a strongly emergent phenomena of the brain? Or just as you sort of brilliantly\n\n2:35:40.240 --> 2:35:45.360\n put here, it could be both. Like they're not mutually exclusive. Dealing with consciousness\n\n2:35:45.360 --> 2:35:52.000\n needs to be an interdisciplinary task. We need, you know, philosophers, neuroscientists,\n\n2:35:52.000 --> 2:36:01.200\n physicists, engineers replicating these things artificially and all needs to be working in step.\n\n2:36:01.200 --> 2:36:06.160\n And, you know, I'm quite interested. I mean, a lot more and more scientists get in touch with me,\n\n2:36:06.160 --> 2:36:11.360\n actually, you know, saying that was one of the great things about I think that's come from\n\n2:36:11.360 --> 2:36:15.760\n writing a popular book is not just getting the ideas out to general audience, but getting the\n\n2:36:15.760 --> 2:36:20.720\n ideas out to scientists and scientists get into saying that this in some way connects to my work.\n\n2:36:20.720 --> 2:36:26.160\n And I would like to kind of start to put together a network of an interdisciplinary network of\n\n2:36:26.160 --> 2:36:32.800\n scientists and philosophers and engineers, perhaps, you know, interested in a panpsychist approach.\n\n2:36:32.800 --> 2:36:37.440\n And because I think, so far, panpsychism has just been sort of trying to justify its existence.\n\n2:36:38.160 --> 2:36:41.840\n And that's important. But I think once you just get on with an active research program,\n\n2:36:42.560 --> 2:36:45.360\n that's when people start taking it seriously, I think.\n\n2:36:47.360 --> 2:36:49.200\n Do you think we're living in a simulation?\n\n2:36:49.200 --> 2:36:55.840\n No, I think, is there some aspect of that thought experiment that's compelling to you\n\n2:36:55.840 --> 2:36:58.960\n within the framework of panpsychism?\n\n2:36:59.600 --> 2:37:07.360\n It's an important and serious argument. And, you know, it's not to be laughed away. I suppose one\n\n2:37:07.360 --> 2:37:14.080\n issue I have with it is there's a crucial assumption there that consciousness is substrate\n\n2:37:14.080 --> 2:37:22.880\n independent, as the jargon goes, which means it's software rather than hardware, right? It's depend\n\n2:37:22.880 --> 2:37:28.320\n on organization rather than the stuff. Whereas as a panpsychist, I think consciousness is the stuff\n\n2:37:28.320 --> 2:37:34.480\n of the brain. It's the stuff of matter. So I think just taking the organizational properties,\n\n2:37:34.480 --> 2:37:39.680\n the software in my brain and uploading them, you wouldn't get the stuff in my brain. So I\n\n2:37:39.680 --> 2:37:45.360\n am actually worried if at some point in the future we start uploading our minds and we think,\n\n2:37:45.360 --> 2:37:50.800\n oh my God, granny's still there. I can email granny after her body's rotted in the ground.\n\n2:37:50.800 --> 2:37:56.080\n And we all start uploading our brains. It could be we're just committing suicide. We're just\n\n2:37:56.080 --> 2:38:04.160\n getting rid of our consciousness. Because I think that wouldn't, for me, preserve the experience,\n\n2:38:04.160 --> 2:38:12.480\n that wouldn't, for me, preserve the experience just getting the software features. So that's\n\n2:38:12.480 --> 2:38:17.200\n a crucial, anyway, that's a crucial premise of this simulation argument because the idea\n\n2:38:17.200 --> 2:38:21.520\n in a simulated universe, I don't think you necessarily would have consciousness.\n\n2:38:21.520 --> 2:38:26.560\n It's interesting that you as a panpsychist are attached, because to me,\n\n2:38:26.560 --> 2:38:35.920\n panpsychism would encourage the thought that there's not a significant difference. At the very\n\n2:38:35.920 --> 2:38:44.160\n bottom, it's not substrate independent, but you can have consciousness in a human and then move\n\n2:38:44.160 --> 2:38:50.240\n it to something else. You can move it to the cloud. You can move it to the computer. It feels\n\n2:38:50.240 --> 2:38:56.720\n like that's much more possible if consciousness is the base layer. Yes, you could certainly,\n\n2:38:58.480 --> 2:39:04.640\n it allows for the possibility of creating artificial consciousness, right? Because there's\n\n2:39:04.640 --> 2:39:10.080\n not souls, there aren't any kind of extra magical ingredients. So yeah, it definitely allows the\n\n2:39:10.080 --> 2:39:15.120\n possibility of artificial consciousness and maybe preserving my consciousness in some sort of\n\n2:39:15.120 --> 2:39:22.560\n artificial way. My only point, I suppose, is just replicating the computational or\n\n2:39:22.560 --> 2:39:30.000\n organizational features would not, for me, preserve consciousness. I mean, some opponents\n\n2:39:30.000 --> 2:39:34.160\n of materialism disagree with me on that. I think David Chalmers is an opponent of materialist.\n\n2:39:34.160 --> 2:39:41.600\n He's a kind of dualist, but he thinks the way the psychophysical laws work, they hook onto the\n\n2:39:41.600 --> 2:39:46.800\n computational or organizational features of matter. So he thinks, I think he thinks you could upload\n\n2:39:46.800 --> 2:39:54.800\n your consciousness. I tend to think not. So in that sense, we're not living in a simulation\n\n2:39:55.520 --> 2:40:02.720\n in the sort of specific computational view of things and that substrate matters to you. Yeah,\n\n2:40:02.720 --> 2:40:07.520\n I think so. Yeah. Yeah. And in that you agree with Sean Carroll that physics matters.\n\n2:40:07.520 --> 2:40:15.920\n Yeah. Physics is our best way of capturing what the stuff of the world does. Yeah. But not the\n\n2:40:15.920 --> 2:40:23.600\n whatness, the being of the stuff. Yeah, the isness. The isness, thank you. Russell Brand,\n\n2:40:23.600 --> 2:40:27.440\n I had a conversation with Russell Brand and he said, oh, you mean the isness? I thought that was\n\n2:40:27.440 --> 2:40:31.120\n a good way of putting it. The isness. The isness of stuff. Russell's great.\n\n2:40:31.120 --> 2:40:37.760\n The big ridiculous question. What do you think is the meaning of all of this? You write in your book\n\n2:40:38.960 --> 2:40:45.920\n that the entry for our reality in the Hitchhiker's Guide might read, a physical universe\n\n2:40:45.920 --> 2:40:54.640\n whose intrinsic nature is constituted of consciousness, worth a visit. So our\n\n2:40:54.640 --> 2:41:01.280\n whole conversation has been about the first part of that sentence. What about the second part? Worth\n\n2:41:01.280 --> 2:41:09.840\n a visit. Why is this place worth a visit? Why does it have meaning? Why does it have value at all?\n\n2:41:09.840 --> 2:41:17.520\n Why? These are big questions. I mean, firstly, I do think panpsychism,\n\n2:41:17.520 --> 2:41:26.000\n it is important to think about four considerations of meaning and value. As we've already discussed,\n\n2:41:26.800 --> 2:41:33.520\n I think consciousness is the root of everything that matters in life, from deep emotions,\n\n2:41:33.520 --> 2:41:41.200\n subtle thoughts, beautiful sensory experiences. And yet, I think that the answer is\n\n2:41:41.200 --> 2:41:50.240\n subtle thoughts, beautiful sensory experiences. And yet, I believe our official scientific world\n\n2:41:50.240 --> 2:41:56.000\n view is incompatible with the reality of consciousness. I mean, that's controversial,\n\n2:41:56.000 --> 2:42:00.000\n but that's what I think. And I think people feel this on an intuitive level.\n\n2:42:00.640 --> 2:42:07.120\n It's maybe part of what Max Weber called the disenchantment of nature. They know\n\n2:42:07.120 --> 2:42:11.840\n their feelings and experiences are not just electrochemical signaling. I mean, they might\n\n2:42:11.840 --> 2:42:16.480\n just have that very informed intuition, but I think that can be rigorously supported. So I think\n\n2:42:16.480 --> 2:42:23.760\n this can lead to a sense of alienation and a sense that we lack a framework for understanding the\n\n2:42:23.760 --> 2:42:29.360\n meaning and significance of our lives. And in the absence of that, people turn to other things to\n\n2:42:29.360 --> 2:42:35.440\n make sense of the meaning of their lives, like nationalism, fundamentalist religion, consumerism.\n\n2:42:35.440 --> 2:42:40.320\n So I think panpsychism is important in that regard in bringing together the\n\n2:42:41.680 --> 2:42:46.000\n quantitative facts of physical science with the, as it were, the human truth,\n\n2:42:46.560 --> 2:42:50.560\n by which I just mean the qualitative reality of our own experience.\n\n2:42:52.880 --> 2:42:59.440\n As I've already said, I do think there are objective facts about value and\n\n2:42:59.440 --> 2:43:04.880\n what we ought to do and what we ought to believe that we respond to. And that's very mysterious to\n\n2:43:04.880 --> 2:43:09.440\n make sense of both how there could be such facts and how we could know about them and respond to\n\n2:43:09.440 --> 2:43:15.920\n them. But I do think there are such facts and they're mostly to do with kinds of conscious\n\n2:43:15.920 --> 2:43:24.320\n experience. So they're there to be discovered and much of the human condition is to discover those\n\n2:43:24.320 --> 2:43:31.120\n objective sources of value. I think so, yeah. And then, I mean, moving away from panpsychism to the,\n\n2:43:31.120 --> 2:43:40.640\n you know, at an even bigger level, I suppose I think it is important to me to live in hope that\n\n2:43:40.640 --> 2:43:48.320\n there's a purpose to existence and that, you know, what I do contributes in some small way to that\n\n2:43:48.320 --> 2:43:55.040\n greater purpose. But, you know, I would say I don't know if there's a purpose to existence. I\n\n2:43:55.040 --> 2:44:00.720\n think some things point in that direction, some things point away from it. But I don't think you\n\n2:44:00.720 --> 2:44:09.280\n need certainty or even high probability to have faith in something. So take an analogy. Suppose\n\n2:44:09.280 --> 2:44:14.320\n you've got a friend who's very seriously ill, maybe there's a 30% chance they're going to make\n\n2:44:14.320 --> 2:44:20.240\n it. You shouldn't believe your friend's going to get better, you know, because probably not. But\n\n2:44:20.240 --> 2:44:23.680\n what you can say is, you know, you can say to your friend, I have faith that you're going to get\n\n2:44:23.680 --> 2:44:32.240\n better. That is, I choose to live in hope about that possibility. I choose to orientate my life\n\n2:44:32.240 --> 2:44:37.840\n towards that hope. Similarly, you know, I don't think we know whether or not there's a purpose to\n\n2:44:37.840 --> 2:44:45.440\n existence, but I think we can make the choice to live in hope of that possibility. And I find that\n\n2:44:47.200 --> 2:44:56.160\n a worthwhile and fulfilling way to live. So maybe as your editor, I would collaborate with you on\n\n2:44:56.160 --> 2:45:05.200\n the edit of the Hitchhiker's Guide entry that instead of worth a visit, we'll insert hopefully\n\n2:45:05.200 --> 2:45:14.080\n worth a visit. Or the inhabitants hoped that you would think it's worth a visit. Philip,\n\n2:45:14.080 --> 2:45:22.480\n you're an incredible mind, incredible human being, and indeed are humble. And I'm really happy that\n\n2:45:22.480 --> 2:45:28.800\n you're able to argue and take on some of these difficult questions with some of the most brilliant\n\n2:45:28.800 --> 2:45:33.040\n people in the world, which are the philosophers thinking about the human mind. So this was an\n\n2:45:33.040 --> 2:45:38.000\n awesome conversation. I hope you continue talking to folks like Sam Harris. I'm so glad you talked\n\n2:45:38.000 --> 2:45:43.920\n to Joe. I can't wait to see what you write, what you say, what you think next. Thank you so much\n\n2:45:43.920 --> 2:45:48.880\n for talking today. Thanks very much, Lex. This has been a really fascinating conversation. I've got\n\n2:45:48.880 --> 2:45:52.800\n a lot I need to think about actually just from this conversation, but thanks for chatting to me.\n\n2:45:53.840 --> 2:45:57.600\n Thanks for listening to this conversation with Philip Goff. To support this podcast,\n\n2:45:57.600 --> 2:46:02.480\n please check out our sponsors in the description. And now let me leave you with some words from\n\n2:46:02.480 --> 2:46:10.000\n Carl Jung. People will do anything, no matter how absurd, in order to avoid facing their own souls.\n\n2:46:10.960 --> 2:46:16.560\n One does not become enlightened by imagining figures of light, but by making the darkness\n\n2:46:16.560 --> 2:46:33.520\n conscious. Thank you for listening and hope to see you next time.\n\n"
}