{
  "title": "Clara Sousa-Silva: Searching for Signs of Life on Venus and Other Planets | Lex Fridman Podcast #195",
  "id": "CGAvsmokB4c",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.900\n The following is a conversation with Clara Souza Silva, a quantum astrochemist at Harvard\n\n00:04.900 --> 00:11.520\n specializing in spectroscopy of gases that serve as possible signs of life on other planets,\n\n00:11.520 --> 00:14.340\n most especially the gas phosphine.\n\n00:14.340 --> 00:20.560\n She was a coauthor of the paper that in 2020 found that there is phosphine in the atmosphere\n\n00:20.560 --> 00:26.920\n of Venus and, thus, possible extraterrestrial life that lives in its atmosphere.\n\n00:26.920 --> 00:31.320\n The detection of phosphine was challenged, reaffirmed, and is now still under active\n\n00:31.320 --> 00:32.720\n research.\n\n00:32.720 --> 00:38.000\n Quick mention of our sponsors, Onnit, Grammarly, Blinkist, and Indeed.\n\n00:38.000 --> 00:41.440\n Check them out in the description to support this podcast.\n\n00:41.440 --> 00:45.520\n As a side note, let me say that I think the search for life on other planets is one of\n\n00:45.520 --> 00:47.560\n the most important endeavors in science.\n\n00:47.560 --> 00:53.240\n If we find extraterrestrial life and study it, we may find insights into the mechanisms\n\n00:53.240 --> 00:58.240\n that originated life here on Earth, and more than life, the mechanisms that originated\n\n00:58.240 --> 01:00.800\n intelligence and consciousness.\n\n01:00.800 --> 01:04.360\n If we understand these mechanisms, we can build them.\n\n01:04.360 --> 01:09.100\n But more than this, the discovery of life on other planets means that our galaxy and\n\n01:09.100 --> 01:11.960\n our universe is teeming with life.\n\n01:11.960 --> 01:15.980\n This is humbling and terrifying, but it is also exciting.\n\n01:15.980 --> 01:17.940\n We humans are natural explorers.\n\n01:17.940 --> 01:22.880\n For most of our history, we explored the surface of the Earth and the contents of our minds.\n\n01:22.880 --> 01:27.960\n But now, with spacefaring vessels, we have a chance to explore life beyond Earth, their\n\n01:27.960 --> 01:33.300\n physics, their biology, and perhaps the contents of their minds.\n\n01:33.300 --> 01:40.120\n This is the Lux Friedman Podcast, and here is my conversation with Clara Souza Silva.\n\n01:40.120 --> 01:45.960\n Since you're the world expert in, well, in many things, but one of them is phosphine,\n\n01:45.960 --> 01:52.840\n would it technically be correct to call you the queen of phosphine?\n\n01:52.840 --> 01:54.640\n I go for Dr. Phosphine.\n\n01:54.640 --> 01:57.000\n Queen is an inherited title, I feel.\n\n01:57.000 --> 02:05.760\n But you still rule by love and power, so, but while having the doctor title, I got it.\n\n02:05.760 --> 02:06.760\n Kindness.\n\n02:06.760 --> 02:07.760\n Kindness.\n\n02:07.760 --> 02:08.760\n Kindness.\n\n02:08.760 --> 02:13.400\n In September 2020, you coauthored a paper announcing possible presence of phosphine\n\n02:13.400 --> 02:21.120\n in the atmosphere of Venus, and that it may be a signature of extraterrestrial life.\n\n02:21.120 --> 02:22.120\n Big maybe.\n\n02:22.120 --> 02:23.120\n Big maybe.\n\n02:23.120 --> 02:29.080\n There was some pushback, of course, from the scientific community that followed, friendly,\n\n02:29.080 --> 02:31.940\n loving pushback.\n\n02:31.940 --> 02:37.540\n Then in January, another paper from University of Wisconsin, I believe, confirmed the finding.\n\n02:37.540 --> 02:44.440\n So where do we stand in this saga, in this mystery of what the heck is going on, on Venus\n\n02:44.440 --> 02:46.880\n in terms of phosphine and in terms of aliens?\n\n02:46.880 --> 02:50.720\n Let's try to break it down.\n\n02:50.720 --> 02:53.920\n The short answer is we don't know.\n\n02:53.920 --> 02:59.200\n I think you and the rest of the public are now witnessing a pretty exciting discovery,\n\n02:59.200 --> 03:07.520\n but as it evolves, as it unfolds, we did not wait until we had, you know, years of\n\n03:07.520 --> 03:14.080\n data from 10 different instruments across several layers of the atmosphere.\n\n03:14.080 --> 03:21.480\n We waited until we had two telescopes with independent data months apart, but still,\n\n03:21.480 --> 03:23.100\n the data is weak.\n\n03:23.100 --> 03:24.100\n It's noisy.\n\n03:24.100 --> 03:25.100\n It's delicate.\n\n03:25.100 --> 03:31.480\n It's very much at the edge of instrument sensitivity, sensitivity, and so we still don't even know\n\n03:31.480 --> 03:33.080\n if it is phosphine.\n\n03:33.080 --> 03:35.660\n We don't even really know if the signal is real.\n\n03:35.660 --> 03:37.560\n People still disagree about that.\n\n03:37.560 --> 03:44.400\n I think at the more philosophical end of how this happened, I think it is a distinction,\n\n03:44.400 --> 03:49.600\n and myself and other coauthors were talking about this, it's a distinction between hypothesis\n\n03:49.600 --> 03:52.560\n generation and hypothesis testing.\n\n03:52.560 --> 04:01.160\n Now hypothesis testing is something that I think is the backbone of the scientific method,\n\n04:01.160 --> 04:05.040\n but it has a problem, which is if you're looking through very noisy data and you want to test\n\n04:05.040 --> 04:10.960\n the hypothesis, you may by mistake create a spurious signal.\n\n04:10.960 --> 04:14.720\n The safest, more conservative approach is hypothesis generation.\n\n04:14.720 --> 04:17.500\n You see some data and you go, what's in there?\n\n04:17.500 --> 04:18.500\n With no bias.\n\n04:18.500 --> 04:24.000\n Now this is much safer, much more conservative, and when there's a lot of data, that's great.\n\n04:24.000 --> 04:28.360\n When there isn't, you can clean the noise and take out the signal with it.\n\n04:28.360 --> 04:33.280\n The signal with a bath water, whatever the equivalent of the analogy would be.\n\n04:33.280 --> 04:37.400\n And so I think the healthy discourse that you described is exactly this.\n\n04:37.400 --> 04:41.720\n There are ways of processing the data, completely legitimate ways, checked by multiple people\n\n04:41.720 --> 04:47.800\n and experts where the signal shows up and then phosphine is in the atmosphere of Venus,\n\n04:47.800 --> 04:52.420\n and some where it doesn't, and then we disagree what that signal means.\n\n04:52.420 --> 04:58.420\n If it's real and it is an ambiguously phosphine, it is very exciting because we don't know\n\n04:58.420 --> 05:05.960\n how to explain it without life, but going from there to Venusians is still a huge jump.\n\n05:05.960 --> 05:06.960\n And so...\n\n05:06.960 --> 05:07.960\n Venusians.\n\n05:07.960 --> 05:12.920\n So that would be the title for the civilization, if it is a living and thriving on Venus's\n\n05:12.920 --> 05:14.480\n Venusians.\n\n05:14.480 --> 05:18.600\n Until we know what they call themselves and that's the name, yes.\n\n05:18.600 --> 05:25.040\n So this is the early analysis of data or analysis of early data.\n\n05:25.040 --> 05:30.000\n It was nevertheless, you waited until the actual peer reviewed publication to know?\n\n05:30.000 --> 05:31.000\n Of course.\n\n05:31.000 --> 05:33.220\n And analysis of the two different instruments months apart.\n\n05:33.220 --> 05:35.840\n So that's ALMA and JCMT, the two telescopes.\n\n05:35.840 --> 05:39.540\n I mean, it's still, I mean, it's really exciting.\n\n05:39.540 --> 05:42.520\n What did it feel like sort of sitting on this data?\n\n05:42.520 --> 05:50.480\n Like kind of anticipating the publication and wondering and still wondering, is it true?\n\n05:50.480 --> 05:55.560\n Like how does it make you feel that a planet in our solar system might have phosphine in\n\n05:55.560 --> 05:56.560\n the atmosphere?\n\n05:56.560 --> 05:57.560\n It's nuts.\n\n05:57.560 --> 06:01.360\n It's absolutely nuts.\n\n06:01.360 --> 06:02.360\n I mean...\n\n06:02.360 --> 06:04.360\n In the best possible way?\n\n06:04.360 --> 06:08.080\n I've been working on phosphine for over a decade.\n\n06:08.080 --> 06:10.160\n Before it was cool.\n\n06:10.160 --> 06:12.640\n Way before it was cool.\n\n06:12.640 --> 06:15.640\n Before anyone could spell it or heard of it.\n\n06:15.640 --> 06:21.120\n And at the time people either didn't know what phosphine was or only knew it for being\n\n06:21.120 --> 06:26.880\n just possibly the most horrendous molecule that ever graced the earth.\n\n06:26.880 --> 06:30.660\n And so no one was a fan.\n\n06:30.660 --> 06:34.740\n And I had been considering looking for it because I did think it was an unusual and\n\n06:34.740 --> 06:37.480\n disgusting but very promising sign of life.\n\n06:37.480 --> 06:40.040\n I've been looking for it everywhere.\n\n06:40.040 --> 06:42.280\n I really didn't think to look in the solar system.\n\n06:42.280 --> 06:49.280\n I thought it was all pretty rough around here for life.\n\n06:49.280 --> 06:53.760\n And so I wasn't even considering the solar system at all, never mind next door Venus.\n\n06:53.760 --> 06:58.800\n It was only the lead author of the study, Jane Greaves, who thought to look in the clouds\n\n06:58.800 --> 07:05.380\n of Venus and then reached out to me to say, I don't know phosphine but I know it's weird.\n\n07:05.380 --> 07:06.920\n How weird is it?\n\n07:06.920 --> 07:09.060\n And the answer is very weird.\n\n07:09.060 --> 07:12.400\n And so the telescopes we're looking at, this is visual data.\n\n07:12.400 --> 07:14.560\n That's what I mean by visual.\n\n07:14.560 --> 07:15.560\n You wouldn't see the phosphine.\n\n07:15.560 --> 07:18.920\n Well, but I mean it's a telescope.\n\n07:18.920 --> 07:19.920\n It's remote.\n\n07:19.920 --> 07:20.920\n It's remote.\n\n07:20.920 --> 07:27.480\n You're observing, you're what zooming in on this particular planet and what does the sensor\n\n07:27.480 --> 07:28.920\n actually look like?\n\n07:28.920 --> 07:30.760\n How many pixels are there?\n\n07:30.760 --> 07:32.840\n What does the data kind of look like?\n\n07:32.840 --> 07:39.640\n It'd be nice to kind of build up intuition of how little data we have based on which,\n\n07:39.640 --> 07:44.640\n I mean, if you look at like, I've just been reading a lot about gravitational waves and\n\n07:44.640 --> 07:50.600\n it's kind of incredible how from just very little, like probably the world's most precise\n\n07:50.600 --> 07:57.600\n instrument, we can derive some very foundational ideas about our early universe.\n\n07:57.600 --> 08:01.360\n And in that same way, it's kind of incredible how much data, how much information you can\n\n08:01.360 --> 08:03.200\n get from just a few pixels.\n\n08:03.200 --> 08:10.880\n So what are we talking about here in terms of based on which this paper saw possible\n\n08:10.880 --> 08:13.700\n signs of phosphine in the atmosphere?\n\n08:13.700 --> 08:18.400\n So phosphine, like every other molecule has a unique spectroscopic fingerprint, meaning\n\n08:18.400 --> 08:21.860\n it rotates and it vibrates in special ways.\n\n08:21.860 --> 08:28.620\n I calculated how many of those ways it can rotate and vibrate, 16.8 billion ways.\n\n08:28.620 --> 08:33.360\n What this means is that if you look at the spectrum of light and that light has gone\n\n08:33.360 --> 08:41.840\n through phosphine gas on the other end, there should be 16.8 billion tiny marks left, indentations\n\n08:41.840 --> 08:43.960\n left in that spectrum.\n\n08:43.960 --> 08:49.000\n We found one of those on Venus, one of those 16.8 billion.\n\n08:49.000 --> 08:53.760\n So now the game is, can we find any of the other ones?\n\n08:53.760 --> 08:55.200\n But they're really hard to spot.\n\n08:55.200 --> 08:59.800\n They're all in terrible places in the electromagnetic spectrum.\n\n08:59.800 --> 09:04.440\n And the instruments we use to find this one can't really find any other one.\n\n09:04.440 --> 09:08.820\n There's another one of the 16.8 billion we could find, but it would take many, many days\n\n09:08.820 --> 09:14.560\n of continuous observations and that's not really in the cards right now.\n\n09:14.560 --> 09:16.760\n There's all kinds of noise, first of all.\n\n09:16.760 --> 09:20.920\n There's all kinds of other signal.\n\n09:20.920 --> 09:28.760\n So how do you separate all of that out to pull out just this particular signature that's\n\n09:28.760 --> 09:31.120\n associated with phosphine?\n\n09:31.120 --> 09:36.760\n So the data kind of looks somewhat like a wave and a lot of that is noise and it's a\n\n09:36.760 --> 09:37.880\n baseline.\n\n09:37.880 --> 09:42.120\n And so if you can figure out the exact shape of the wave, you can cancel that shape out\n\n09:42.120 --> 09:46.840\n and you should be left with a straight line and if there's something there, an absorption,\n\n09:46.840 --> 09:47.840\n so a signal.\n\n09:47.840 --> 09:49.580\n So that's what we did.\n\n09:49.580 --> 09:54.880\n We tried to find out what was this baseline shape, cleaned it out and got the signal.\n\n09:54.880 --> 09:55.880\n That's part of the problem.\n\n09:55.880 --> 09:59.040\n If you do this wrong, you can create a signal.\n\n09:59.040 --> 10:07.000\n But that signal is at 8.904 wave numbers and we actually have more digits than that, but\n\n10:07.000 --> 10:08.560\n I don't remember by heart.\n\n10:08.560 --> 10:14.600\n And ALMA in particular is a very, very good telescope, array of telescopes and it can\n\n10:14.600 --> 10:16.960\n focus on exactly that frequency.\n\n10:16.960 --> 10:22.520\n And in that frequency, there are only two known molecules that absorb it all.\n\n10:22.520 --> 10:23.520\n So that's how we do it.\n\n10:23.520 --> 10:30.280\n We look at that exact spot where we know phosphine absorbs the other molecules SO2.\n\n10:30.280 --> 10:36.460\n If there is extraterrestrial life, whether it's on Venus or on exoplanets where you\n\n10:36.460 --> 10:40.560\n looked before, how does that make you feel?\n\n10:40.560 --> 10:42.400\n How should it make us feel?\n\n10:42.400 --> 10:43.480\n Should we be scared?\n\n10:43.480 --> 10:46.160\n Should we be excited?\n\n10:46.160 --> 10:48.040\n Let's say it's not intelligent life.\n\n10:48.040 --> 10:51.760\n Let's say it's microbial life.\n\n10:51.760 --> 10:53.000\n Is it a threat to us?\n\n10:53.000 --> 10:55.120\n Are we a threat to it?\n\n10:55.120 --> 11:00.920\n Or is it only, not only, but mostly a possibility to understand something fundamental, something\n\n11:00.920 --> 11:04.400\n beautiful about life in the universe?\n\n11:04.400 --> 11:05.400\n Hard to know.\n\n11:05.400 --> 11:11.640\n You would have to bring on a poet or a philosopher on the show.\n\n11:11.640 --> 11:12.640\n I feel those things.\n\n11:12.640 --> 11:14.880\n I just don't know if those are the right things to feel.\n\n11:14.880 --> 11:16.520\n I certainly don't feel scared.\n\n11:16.520 --> 11:19.240\n I think it's rather silly to feel scared.\n\n11:19.240 --> 11:21.140\n Definitely don't touch them.\n\n11:21.140 --> 11:24.920\n Sometimes in movies, don't go near it.\n\n11:24.920 --> 11:26.200\n Don't interfere.\n\n11:26.200 --> 11:33.940\n I think one of the things with Venus is because of phosphine, now there is a chance that Venus\n\n11:33.940 --> 11:34.940\n is inhabited.\n\n11:34.940 --> 11:39.020\n And in that case, we shouldn't go there.\n\n11:39.020 --> 11:46.480\n We should be very careful with messing with them, bringing our own stuff there that contaminates\n\n11:46.480 --> 11:48.240\n it.\n\n11:48.240 --> 11:49.720\n And Venus has suffered enough.\n\n11:49.720 --> 11:56.160\n If there's life there, it's probably the remains of a living planet, the very last survivors\n\n11:56.160 --> 12:00.920\n of what once was potentially a thriving world.\n\n12:00.920 --> 12:06.720\n And so I don't want our first interaction with alien life to be a massacre.\n\n12:06.720 --> 12:12.160\n So I definitely wouldn't want to go near out of a, let's say, galactic responsibility,\n\n12:12.160 --> 12:14.400\n galactic ethics.\n\n12:14.400 --> 12:19.620\n And I often think of alien astronomers watching us and how disappointed they would be if we\n\n12:19.620 --> 12:20.620\n messed this up.\n\n12:20.620 --> 12:25.960\n So I really want to be very careful with anything that could be life.\n\n12:25.960 --> 12:28.320\n But certainly I wouldn't be scared.\n\n12:28.320 --> 12:30.360\n Humans are plenty capable of killing one another.\n\n12:30.360 --> 12:34.760\n We don't need extraterrestrial help to destroy ourselves.\n\n12:34.760 --> 12:36.120\n Scared mostly of other humans.\n\n12:36.120 --> 12:37.120\n Exactly.\n\n12:37.120 --> 12:41.600\n But these, this life, if there is life there, it does seem just like you said, it would\n\n12:41.600 --> 12:43.200\n be pretty rugged.\n\n12:43.200 --> 12:47.200\n It's like the cockroaches or Chuck Norris, I don't know.\n\n12:47.200 --> 12:53.120\n It's the, some kind of, it's something that survived through some very difficult conditions.\n\n12:53.120 --> 12:58.160\n That doesn't mean it would handle us, you know, it could be like war of the worlds.\n\n12:58.160 --> 13:02.440\n You come, just because you're resilient in your own planet doesn't mean you can survive\n\n13:02.440 --> 13:03.440\n another.\n\n13:03.440 --> 13:08.520\n The extremophiles, which are very impressive, we should all be very proud of our extremophiles.\n\n13:08.520 --> 13:12.000\n They wouldn't really make it in the Venusian clouds.\n\n13:12.000 --> 13:18.080\n So I wouldn't expect, because you're tough, even Chuck Norris tough, that you would survive\n\n13:18.080 --> 13:20.800\n on an alien planet.\n\n13:20.800 --> 13:25.520\n And then from the scientific perspective, you don't want to pollute the data gathering\n\n13:25.520 --> 13:27.960\n process by showing up there.\n\n13:27.960 --> 13:31.240\n The observer can affect the observed.\n\n13:31.240 --> 13:35.360\n How heartbreaking would it be if we found life on another planet and then we're like,\n\n13:35.360 --> 13:37.080\n oh, we brought it with us.\n\n13:37.080 --> 13:38.320\n It was my sandwich.\n\n13:38.320 --> 13:40.520\n But that's always the problem, right?\n\n13:40.520 --> 13:47.280\n And it's certainly a problem with Mars because we've visited the, if there is life on Mars\n\n13:47.280 --> 13:52.320\n or like remains of life on Mars, it's always going to be a question of like, well, maybe\n\n13:52.320 --> 13:53.680\n we planted it there.\n\n13:53.680 --> 13:55.060\n Let's not do the same with Venus.\n\n13:55.060 --> 13:59.200\n It's harder because when we try to go to Venus, things melt very quickly.\n\n13:59.200 --> 14:04.160\n So it's a little harder to pollute Venus.\n\n14:04.160 --> 14:06.760\n It's very good at destroying foreigners.\n\n14:06.760 --> 14:07.760\n Yeah.\n\n14:07.760 --> 14:13.880\n Well, in terms of Elon Musk and terraforming planets, Mars is stop number one, then Venus\n\n14:13.880 --> 14:15.480\n maybe after that.\n\n14:15.480 --> 14:19.080\n So can we talk about phosphine a little bit?\n\n14:19.080 --> 14:20.560\n So you mentioned it's a pretty...\n\n14:20.560 --> 14:21.560\n Love talking about phosphine.\n\n14:21.560 --> 14:22.560\n Love phosphine.\n\n14:22.560 --> 14:23.560\n What's your Twitter handle?\n\n14:23.560 --> 14:24.560\n It's like Dr. Phosphine.\n\n14:24.560 --> 14:25.560\n It's Dr. Phosphine.\n\n14:25.560 --> 14:26.560\n Yes.\n\n14:26.560 --> 14:27.560\n You will be surprised here.\n\n14:27.560 --> 14:28.560\n It wasn't taken already.\n\n14:28.560 --> 14:29.560\n I just grabbed it.\n\n14:29.560 --> 14:32.560\n I didn't have to buy it off anyone.\n\n14:32.560 --> 14:33.560\n Yeah.\n\n14:33.560 --> 14:35.320\n So what is it?\n\n14:35.320 --> 14:36.320\n What's phosphine?\n\n14:36.320 --> 14:43.560\n You already mentioned it's pretty toxic and troublesome and outside, troublesome, sorry.\n\n14:43.560 --> 14:45.240\n No, I love it.\n\n14:45.240 --> 14:48.860\n I'm going to stop calling it troublesome.\n\n14:48.860 --> 14:56.560\n So maybe what are some things that make it interesting chemically and why is it a good\n\n14:56.560 --> 15:00.440\n sign of life when it's present in the atmosphere?\n\n15:00.440 --> 15:06.120\n Like you've described in your paper, aptly titled the phosphine as a biosignature gas\n\n15:06.120 --> 15:08.320\n in exoplanet atmospheres.\n\n15:08.320 --> 15:10.960\n I suppose you wrote that paper before Venus.\n\n15:10.960 --> 15:11.960\n I did.\n\n15:11.960 --> 15:12.960\n Yes.\n\n15:12.960 --> 15:13.960\n I did.\n\n15:13.960 --> 15:14.960\n And no one cared.\n\n15:14.960 --> 15:19.280\n In that paper, I said something like, if we find phosphine on any terrestrial planet can\n\n15:19.280 --> 15:20.280\n only mean life.\n\n15:20.280 --> 15:21.680\n And everyone's like, yeah, that sounds about right.\n\n15:21.680 --> 15:22.680\n Let's go.\n\n15:22.680 --> 15:24.440\n And then Venus shows up and I was like, are you sure?\n\n15:24.440 --> 15:27.720\n I'm like, I was sure before I was sure.\n\n15:27.720 --> 15:35.900\n Now that it's right here, I'm less sure now that my claims are being tested.\n\n15:35.900 --> 15:38.680\n So phosphine, phosphine is a fascinating molecule.\n\n15:38.680 --> 15:43.920\n So it's shaped like a pyramid with a phosphorus up top and then three hydrogens.\n\n15:43.920 --> 15:49.240\n It's actually quite a simple molecule in many ways and you know, it's the most popular elements\n\n15:49.240 --> 15:54.920\n in the universe, carbon, hydrogen, nitrogen, oxygen, phosphorus, sulfur.\n\n15:54.920 --> 16:00.080\n When you add hydrogen to them, it makes quite simple, quite famous molecules.\n\n16:00.080 --> 16:04.360\n You do it to oxygen, you get water, you do it to carbon, you get methane, you do it to\n\n16:04.360 --> 16:06.260\n nitrogen, you get ammonia.\n\n16:06.260 --> 16:11.560\n These are all molecules people have heard of, but you do it to phosphorus, you get phosphine.\n\n16:11.560 --> 16:16.560\n People haven't heard of phosphine because it's not really popular on earth.\n\n16:16.560 --> 16:22.400\n You really shouldn't find it anywhere on earth because it is extremely toxic to life.\n\n16:22.400 --> 16:30.600\n It interacts with oxygen metabolism and everything you know and love uses oxygen metabolism and\n\n16:30.600 --> 16:31.840\n it interacts fatally.\n\n16:31.840 --> 16:37.740\n So it kills in several very imaginative and very macabre ways.\n\n16:37.740 --> 16:43.040\n So it was used as a chemical warfare agent in the first world war and most recently by\n\n16:43.040 --> 16:44.040\n ISIS.\n\n16:44.040 --> 16:46.100\n So really bad.\n\n16:46.100 --> 16:48.220\n Most life avoids it.\n\n16:48.220 --> 16:51.940\n Even life that might not avoid it, so life that doesn't use oxygen metabolism, anaerobic\n\n16:51.940 --> 16:56.180\n life still has to put crazy amounts of effort into making it.\n\n16:56.180 --> 16:59.440\n It's a really difficult molecule to make, thermodynamically speaking.\n\n16:59.440 --> 17:04.220\n It's really difficult to make that phosphorus want to be together with that hydrogen.\n\n17:04.220 --> 17:07.040\n So it's horrible.\n\n17:07.040 --> 17:08.040\n Everyone avoids it.\n\n17:08.040 --> 17:10.520\n When they're not avoiding it, it's extremely difficult to make.\n\n17:10.520 --> 17:14.160\n You would have to put energy in, sacrifice energy to make it.\n\n17:14.160 --> 17:19.660\n And if you did go through all that trouble and made it, it gets reacted with the radicals\n\n17:19.660 --> 17:22.320\n in the atmosphere and gets destroyed.\n\n17:22.320 --> 17:24.480\n So we shouldn't find it anywhere and yet we do.\n\n17:24.480 --> 17:30.740\n This is kind of weird molecule that seems to be made by life and we don't even know\n\n17:30.740 --> 17:31.780\n why.\n\n17:31.780 --> 17:33.680\n Life clearly finds a use for it.\n\n17:33.680 --> 17:37.620\n It's not the only molecule that life is willing to sacrifice energy to make, but we don't\n\n17:37.620 --> 17:39.860\n know how or why life is even making it.\n\n17:39.860 --> 17:46.340\n So absolutely mysterious, absolutely deadly, smells horrifically.\n\n17:46.340 --> 17:50.580\n When it's made, it produces other kind of diphosphenes and it's been reported as smelling\n\n17:50.580 --> 17:54.060\n like garlicky, fishy death.\n\n17:54.060 --> 17:58.140\n Once someone referred to it as smelling like the, let me see if I remember, the rancid\n\n17:58.140 --> 18:00.140\n diapers of the spawn of Satan.\n\n18:00.140 --> 18:01.620\n Oh, very nice.\n\n18:01.620 --> 18:03.620\n Yeah, very vivid.\n\n18:03.620 --> 18:04.620\n And so...\n\n18:04.620 --> 18:05.620\n You're a poet after all.\n\n18:05.620 --> 18:08.180\n I didn't call it that, someone else did.\n\n18:08.180 --> 18:12.700\n And so it's just this horrific molecule, but it is produced by life.\n\n18:12.700 --> 18:14.220\n We don't know why.\n\n18:14.220 --> 18:18.780\n And when it is produced by life, it's done with enormous sacrifice and the universe does\n\n18:18.780 --> 18:22.460\n not sacrifice, life sacrifices.\n\n18:22.460 --> 18:27.920\n And so it's this strange, contradictory molecule that we should all be avoiding and yet seems\n\n18:27.920 --> 18:31.500\n to be an almost an ambiguous sign of life on rocky planets.\n\n18:31.500 --> 18:32.500\n Okay.\n\n18:32.500 --> 18:34.660\n Can we dig into that a little bit?\n\n18:34.660 --> 18:43.900\n So on rocky planets, is there biological mechanisms that can produce it?\n\n18:43.900 --> 18:50.340\n You said that why is unclear, why life might produce it, but is there an understanding\n\n18:50.340 --> 18:54.260\n of what kind of mechanisms might be able to produce it, this very difficult to produce\n\n18:54.260 --> 18:55.260\n molecule?\n\n18:55.260 --> 18:57.220\n We don't know yet.\n\n18:57.220 --> 19:02.060\n The enzymatic pathways of phosphine production by life are not yet known.\n\n19:02.060 --> 19:04.420\n This is not actually as surprising as it might sound.\n\n19:04.420 --> 19:10.300\n I think something like 80% of all the natural products that we know of, so we know biology\n\n19:10.300 --> 19:11.580\n makes them.\n\n19:11.580 --> 19:12.580\n We don't know how.\n\n19:12.580 --> 19:17.340\n It is much easier to know life produces something because you can put bacteria in a Petri dish\n\n19:17.340 --> 19:21.300\n and then watch and then that gas is produced, you go, oh, life made it.\n\n19:21.300 --> 19:23.460\n That actually happened with phosphine.\n\n19:23.460 --> 19:29.380\n But that's much easier to do of course, than figuring out what is the exact metabolic pathway\n\n19:29.380 --> 19:33.100\n within that life form that created this molecule.\n\n19:33.100 --> 19:35.340\n So we don't know yet.\n\n19:35.340 --> 19:38.140\n Phosphine is really understudied.\n\n19:38.140 --> 19:40.700\n No one had really heard of it until nowish.\n\n19:40.700 --> 19:46.200\n What you were presenting is the fact that life produces phosphine, not the process by\n\n19:46.200 --> 19:47.780\n which it produces phosphine.\n\n19:47.780 --> 19:49.980\n Is there an urgency now?\n\n19:49.980 --> 19:55.420\n Like if you were to try to understand the mechanisms, the, what did you call them, enzymatic\n\n19:55.420 --> 20:00.380\n pathways that produce phosphine, how difficult is that of a problem to crack?\n\n20:00.380 --> 20:01.380\n It's really difficult.\n\n20:01.380 --> 20:08.740\n If I'm not mistaken, even the scent of truffles, obviously a billion dollar industry, huge\n\n20:08.740 --> 20:09.740\n deal.\n\n20:09.740 --> 20:14.340\n Until quite recently, it wasn't known exactly how those scents, those molecules that create\n\n20:14.340 --> 20:16.500\n this incredible smell were produced.\n\n20:16.500 --> 20:17.980\n This is a billion dollar industry.\n\n20:17.980 --> 20:21.060\n As you can imagine, there is no such pressure.\n\n20:21.060 --> 20:26.420\n There's no phosphine lobby or anything that would push for this research, but I hope someone\n\n20:26.420 --> 20:29.100\n picks it up and does it.\n\n20:29.100 --> 20:33.620\n And it isn't crazy because we know that phosphine is really hard to make.\n\n20:33.620 --> 20:36.620\n We know it's really hard for it to happen accidentally.\n\n20:36.620 --> 20:41.920\n Even lightning and volcanoes that can produce small amounts of phosphine, it's extremely\n\n20:41.920 --> 20:44.740\n difficult for even these extreme processes to make it.\n\n20:44.740 --> 20:49.260\n So it's not really surprising that only life can do it because life is willing to make\n\n20:49.260 --> 20:52.180\n things at a cost.\n\n20:52.180 --> 20:58.780\n So maybe on the topic of phosphine, what, again, you've gotten yourself into trouble.\n\n20:58.780 --> 21:01.300\n I'm going to ask you all these high level poetic questions.\n\n21:01.300 --> 21:02.300\n I apologize.\n\n21:02.300 --> 21:04.700\n No, I would love it.\n\n21:04.700 --> 21:05.700\n Okay.\n\n21:05.700 --> 21:09.980\n When did you first fall in love with phosphine?\n\n21:09.980 --> 21:11.500\n It wasn't love at first sight.\n\n21:11.500 --> 21:20.460\n It was somewhere between a long relationship and Stockholm syndrome.\n\n21:20.460 --> 21:25.500\n When I first started my PhD, I knew I wanted to learn about molecular spectra and how to\n\n21:25.500 --> 21:26.500\n simulate it.\n\n21:26.500 --> 21:32.220\n I thought it was really outrageous that we as a species couldn't detect molecules remotely.\n\n21:32.220 --> 21:36.660\n We didn't have this perfect catalog ready of the molecular fingerprint of every molecule\n\n21:36.660 --> 21:39.000\n we may want to find in the universe.\n\n21:39.000 --> 21:43.580\n And something as basic as phosphine, the fact that we didn't really know how it interacted\n\n21:43.580 --> 21:50.100\n with light and so we couldn't detect it properly in the galaxy, I was so indignant.\n\n21:50.100 --> 21:55.900\n And so initially I just started working on phosphine because people hadn't before.\n\n21:55.900 --> 22:01.260\n And I thought we should know what phosphine looks like and that was it.\n\n22:01.260 --> 22:04.340\n And then I read every paper that's ever been published about phosphine.\n\n22:04.340 --> 22:07.780\n It was quite easy because there aren't that many.\n\n22:07.780 --> 22:13.300\n And that's when I started learning about where we had already found it in the universe and\n\n22:13.300 --> 22:15.380\n what it meant.\n\n22:15.380 --> 22:20.380\n I started finding out quite how little we know about it and why.\n\n22:20.380 --> 22:27.820\n And it was only when I joined MIT and I started talking to biochemists that it became clear\n\n22:27.820 --> 22:33.480\n that phosphine wasn't just weird and special and understudied and disgusting.\n\n22:33.480 --> 22:37.020\n It was all these things for oxygen loving life.\n\n22:37.020 --> 22:42.780\n And it was the anaerobic world that would welcome phosphine and that's when the idea\n\n22:42.780 --> 22:46.540\n of looking for it on other planets became crystallized.\n\n22:46.540 --> 22:52.340\n Because oxygen is very powerful and very important on Earth but that's not necessarily going\n\n22:52.340 --> 22:54.360\n to be the case on other exoplanets.\n\n22:54.360 --> 22:59.820\n Most planets are oxygen poor, overwhelmingly most planets are oxygen poor.\n\n22:59.820 --> 23:06.180\n And so finding the sign of life that would be welcomed by everything that would live\n\n23:06.180 --> 23:12.700\n without oxygen on Earth seemed so cool.\n\n23:12.700 --> 23:16.820\n But ultimately the project at first was born out of the idea that you want to find that\n\n23:16.820 --> 23:22.460\n molecular fingerprint of a molecule.\n\n23:22.460 --> 23:24.860\n And this is just one example.\n\n23:24.860 --> 23:33.620\n And that's connected to then looking for that fingerprint elsewhere in a remote way.\n\n23:33.620 --> 23:37.780\n And obviously that then at that time where exoplanets already, when you were doing your\n\n23:37.780 --> 23:41.180\n PhD, and by the way you should say your PhD thesis was on phosphine.\n\n23:41.180 --> 23:45.700\n It was all on phosphine, 100% on phosphine with a little bit of ammonia.\n\n23:45.700 --> 23:51.300\n I have a chapter that I did where I talked about phosphine and ammonia.\n\n23:51.300 --> 23:55.500\n But no, phosphine was very much my thesis.\n\n23:55.500 --> 24:01.020\n But at that time when you're writing it there's already a sense that exoplanets are out there\n\n24:01.020 --> 24:08.420\n and we might be able to be looking for biosignatures on those exoplanets?\n\n24:08.420 --> 24:09.420\n Pretty much.\n\n24:09.420 --> 24:11.580\n I did my PhD in 2015.\n\n24:11.580 --> 24:15.780\n We found the first exoplanets in the kind of mid to late 90s.\n\n24:15.780 --> 24:17.620\n So exoplanets were known.\n\n24:17.620 --> 24:22.380\n It was known that some had atmospheres and from there it's not a big jump to think, well,\n\n24:22.380 --> 24:30.180\n if some have atmospheres, some of those might be habitable and some of those may be inhabited.\n\n24:30.180 --> 24:35.100\n So how do you detect, you started to talk about it, but can we linger on it?\n\n24:35.100 --> 24:43.000\n How do you detect phosphine on a faraway thing, rocky thing, rocky planet?\n\n24:43.000 --> 24:45.880\n What is spectroscopy?\n\n24:45.880 --> 24:47.820\n What is this molecular fingerprint?\n\n24:47.820 --> 24:49.420\n What does it look like?\n\n24:49.420 --> 24:52.980\n You've kind of mentioned the wave, but what are we supposed to think about?\n\n24:52.980 --> 24:53.980\n What are the tools?\n\n24:53.980 --> 24:55.860\n What are the uncertainties?\n\n24:55.860 --> 24:57.380\n All those kinds of things.\n\n24:57.380 --> 24:59.780\n So the path can go this way.\n\n24:59.780 --> 25:03.840\n You've got light, kind of pure light.\n\n25:03.840 --> 25:10.620\n You can crack that light open with a prism or a spectroscope or water and make a rainbow.\n\n25:10.620 --> 25:17.460\n That rainbow is all the colors and all the invisible colors, the ultraviolet, the infrared.\n\n25:17.460 --> 25:22.800\n And if that light was truly pure, you could consider that rainbow to just cover continuously\n\n25:22.800 --> 25:24.820\n all of these colors.\n\n25:24.820 --> 25:28.140\n But if that light goes through a gas, we may not see that gas.\n\n25:28.140 --> 25:33.180\n We certainly cannot see the molecules within that gas, but those molecules will steal,\n\n25:33.180 --> 25:38.300\n absorb some of that light, some, but not all.\n\n25:38.300 --> 25:42.840\n Each molecule absorbs only very specific colors of that rainbow.\n\n25:42.840 --> 25:48.420\n And so if you know, for example, that shade of green can only be absorbed by methane,\n\n25:48.420 --> 25:49.420\n then you can watch.\n\n25:49.420 --> 25:54.400\n As a planet passes in front of a star, the planet's too far away, you can't see it.\n\n25:54.400 --> 25:55.400\n And it has an atmosphere.\n\n25:55.400 --> 25:58.900\n That atmosphere is far too small, you definitely can't see it.\n\n25:58.900 --> 26:01.280\n But the sunlight will go through that atmosphere.\n\n26:01.280 --> 26:06.340\n And if that atmosphere is methane, then on the other side, that shade of blue, I can't\n\n26:06.340 --> 26:11.960\n remember if I said blue or green, that color will be missing because methane took it.\n\n26:11.960 --> 26:14.540\n And so with phosphine, it's the same thing.\n\n26:14.540 --> 26:22.020\n It has specific colors, 16.8 billion colors that it absorbs it and nothing else does.\n\n26:22.020 --> 26:28.060\n And so if you can find them and notice them missing from the light of a star that went\n\n26:28.060 --> 26:33.260\n through a planet's atmosphere, then you'll know that atmosphere contains the molecule.\n\n26:33.260 --> 26:34.260\n How cool is that?\n\n26:34.260 --> 26:35.260\n That's incredible.\n\n26:35.260 --> 26:40.820\n So you can have this fingerprint within the space of colors and there's a lot of molecules.\n\n26:40.820 --> 26:45.060\n And I mean, I wonder, that's a question of like how much overlap there is.\n\n26:45.060 --> 26:48.300\n How close can you get to the actual fingerprint?\n\n26:48.300 --> 26:52.220\n Like can phosphine unlock the iPhone with its lights on?\n\n26:52.220 --> 27:00.020\n You said 16.8 billion, so presumably this rainbow is discretized into little segments\n\n27:00.020 --> 27:01.020\n somehow.\n\n27:01.020 --> 27:02.020\n Exactly.\n\n27:02.020 --> 27:03.980\n How many total are there?\n\n27:03.980 --> 27:06.700\n How a lot is 16.8 billion?\n\n27:06.700 --> 27:07.940\n It's a lot.\n\n27:07.940 --> 27:14.340\n We don't have the instruments to break these, break any light into this many tiny segments.\n\n27:14.340 --> 27:19.060\n And so with the instruments we do have, there's huge amounts of overlap.\n\n27:19.060 --> 27:27.660\n As an example, a lot of the ways it's detectable is because the carbon and the hydrogens, they\n\n27:27.660 --> 27:30.700\n vibrate with one another, they move, they interact.\n\n27:30.700 --> 27:38.460\n But every other hydrocarbon, acetylene, isoprene has carbon and hydrogens also vibrating and\n\n27:38.460 --> 27:39.460\n rotating.\n\n27:39.460 --> 27:44.540\n And so it's actually very hard to tell them apart at low resolutions and our instruments\n\n27:44.540 --> 27:50.260\n can't really cope with distinguishing between molecules particularly well.\n\n27:50.260 --> 27:55.460\n But in an ideal world, if we had infinite resolution, then yes, every molecule's spectral\n\n27:55.460 --> 27:57.580\n features will be unique.\n\n27:57.580 --> 28:01.780\n Yeah, like almost too unique, like it would be too trivial.\n\n28:01.780 --> 28:04.220\n At the quantum level, they're unique.\n\n28:04.220 --> 28:07.100\n At our level, there's huge overlap.\n\n28:07.100 --> 28:08.100\n Yeah.\n\n28:08.100 --> 28:16.860\n So you can start to then try to disambiguate the fact that certain colors are missing,\n\n28:16.860 --> 28:18.080\n what does that mean?\n\n28:18.080 --> 28:21.740\n And hopefully they're missing in a certain kind of pattern where you can say with some\n\n28:21.740 --> 28:24.460\n kind of probability, there's this gas, not this gas.\n\n28:24.460 --> 28:28.460\n So you're solving that gaseous puzzle.\n\n28:28.460 --> 28:29.460\n I got it.\n\n28:29.460 --> 28:30.460\n Okay.\n\n28:30.460 --> 28:31.720\n We can go back to Venus actually and show that.\n\n28:31.720 --> 28:36.460\n So with this, I mentioned those two molecules that could be responsible for that signal,\n\n28:36.460 --> 28:37.780\n the resolution that we have.\n\n28:37.780 --> 28:43.180\n It was phosphine and SO2, sulfur dioxide.\n\n28:43.180 --> 28:47.780\n And that resolution could really be one of the other, but in the same bandwidth, so in\n\n28:47.780 --> 28:52.440\n the kind of the same observations, there was another region where phosphine does not absorb,\n\n28:52.440 --> 28:55.180\n we know that, but SO2 does.\n\n28:55.180 --> 28:58.660\n So we just went and checked and there was no signal.\n\n28:58.660 --> 29:01.980\n So we thought, oh, then it must be phosphine.\n\n29:01.980 --> 29:05.620\n And then we submitted the paper.\n\n29:05.620 --> 29:06.620\n The rest is history.\n\n29:06.620 --> 29:07.620\n I got it.\n\n29:07.620 --> 29:13.220\n Well, yeah, that's beautifully told.\n\n29:13.220 --> 29:18.180\n Is there, so the telescopes we're talking about are sitting on earth.\n\n29:18.180 --> 29:26.260\n What can it help solving this fingerprint, molecular fingerprint problem if we do a flyby?\n\n29:26.260 --> 29:31.760\n Does it help if you get closer and closer or are telescopes pretty damn good for this\n\n29:31.760 --> 29:34.340\n kind of puzzle solving?\n\n29:34.340 --> 29:37.780\n Telescopes are pretty good, but the earth's atmosphere is a pain.\n\n29:37.780 --> 29:43.540\n I mean, I'm very thankful for it, but it does interrupt a lot of measurements and a lot\n\n29:43.540 --> 29:47.260\n of regions where phosphine would be active, they are not available.\n\n29:47.260 --> 29:52.300\n The earth is not transparent in those wavelengths.\n\n29:52.300 --> 29:55.380\n So being above the atmosphere would make a huge difference.\n\n29:55.380 --> 30:00.580\n Then proximity matters a lot less, but just escaping the earth's atmosphere would be wonderful.\n\n30:00.580 --> 30:06.220\n But then it's really hard to stay very stable and if there is phosphine on Venus, there's\n\n30:06.220 --> 30:08.700\n very little of it in the clouds.\n\n30:08.700 --> 30:15.580\n And so the signal is very weak and the telescopes we can use on earth are much bigger and much\n\n30:15.580 --> 30:16.740\n more stable.\n\n30:16.740 --> 30:18.500\n So it's a bit of a trade off.\n\n30:18.500 --> 30:24.620\n So is it, are you comfortable with this kind of remote observation?\n\n30:24.620 --> 30:32.820\n Is it at all helpful to strive for going over to Venus and like grabbing a scoop of the\n\n30:32.820 --> 30:39.260\n atmosphere or is remote observation really a powerful tool for this kind of job?\n\n30:39.260 --> 30:41.900\n Like the scoop is not necessary.\n\n30:41.900 --> 30:44.820\n Well a lot of people want to scoop, I get it.\n\n30:44.820 --> 30:45.820\n I get it completely.\n\n30:45.820 --> 30:47.380\n That's my natural inclination, yeah.\n\n30:47.380 --> 30:51.860\n I don't want to scoop specifically because if it is life, I want to know everything I\n\n30:51.860 --> 30:55.660\n can remotely before I interfere.\n\n30:55.660 --> 30:59.660\n So that's my, I've got ethical reasons against the scoop more than engineering reasons against\n\n30:59.660 --> 31:00.660\n the scoop.\n\n31:00.660 --> 31:03.380\n But I have some engineering reasons against the scoop.\n\n31:03.380 --> 31:10.000\n Scoop is not a technical term, but I feel like now it's too late to take it back.\n\n31:10.000 --> 31:14.380\n We don't understand the clouds well enough to plan the scoop very well.\n\n31:14.380 --> 31:18.900\n Because it's not that saturated, like there's not that much of it present.\n\n31:18.900 --> 31:21.780\n No, and the place is nasty.\n\n31:21.780 --> 31:28.220\n You know, it's not going to be easy to build something that can do the task reliably and\n\n31:28.220 --> 31:33.220\n can be trusted, the measurements can be trusted and then pass that message on.\n\n31:33.220 --> 31:35.500\n So actually I'm for an orbiter.\n\n31:35.500 --> 31:40.420\n I think we should have orbiters around every solar system body whose job is just to learn\n\n31:40.420 --> 31:42.180\n about these places.\n\n31:42.180 --> 31:47.100\n I'm disappointed we haven't already got an orbiter around every single one of them.\n\n31:47.100 --> 31:49.420\n A small, it can be a small satellite.\n\n31:49.420 --> 31:52.220\n Getting data, figuring out, you know, how do the clouds move?\n\n31:52.220 --> 31:53.300\n What's in them?\n\n31:53.300 --> 31:56.220\n How often is there lightning and volcanic activity?\n\n31:56.220 --> 31:57.220\n Where's the topography?\n\n31:57.220 --> 31:58.980\n Is it changing?\n\n31:58.980 --> 32:02.020\n Is there a biosphere actively doing things?\n\n32:02.020 --> 32:05.020\n We should be monitoring this from afar.\n\n32:05.020 --> 32:11.500\n And so I'm for over the atmosphere, hopefully around Venus, that would be, that would be\n\n32:11.500 --> 32:12.500\n my choice.\n\n32:12.500 --> 32:13.500\n Okay.\n\n32:13.500 --> 32:19.260\n So now recently Venus is all exciting about a phosphine and everything.\n\n32:19.260 --> 32:25.260\n Is there other stuff maybe before we were looking at Venus or now looking out into other\n\n32:25.260 --> 32:26.980\n solar systems?\n\n32:26.980 --> 32:32.900\n Is there other promising exoplanets or other planets within the solar system that might\n\n32:32.900 --> 32:40.700\n have phosphine or might have other strong biosignatures that we should be looking for\n\n32:40.700 --> 32:41.700\n like phosphine?\n\n32:41.700 --> 32:48.380\n There's a few, but outside the solar system, all are kind of promising candidates.\n\n32:48.380 --> 32:49.940\n We know so little about them.\n\n32:49.940 --> 32:53.880\n For most of them, we barely know their density.\n\n32:53.880 --> 32:57.900\n Most of them, we don't even know if they have an atmosphere, nevermind what that atmosphere\n\n32:57.900 --> 32:59.260\n might contain.\n\n32:59.260 --> 33:03.960\n So we're still very much at the stage where we have detected promising planets, but they're\n\n33:03.960 --> 33:08.700\n promising in that they're about the right size, about the right density.\n\n33:08.700 --> 33:13.180\n They could have an atmosphere and they're about the right distance from their host star.\n\n33:13.180 --> 33:15.180\n But that's really all we know.\n\n33:15.180 --> 33:20.780\n Near future telescopes will tell us much more, but for now we're just guessing.\n\n33:20.780 --> 33:25.660\n So you said near future, so there's hope that there'll be telescopes that can see that far\n\n33:25.660 --> 33:31.460\n enough to determine if there's an atmosphere and perhaps even the contents of that atmosphere?\n\n33:31.460 --> 33:32.460\n Absolutely.\n\n33:32.460 --> 33:39.380\n JWST, launching later this year, will be able to get a very rough sense of the main atmospheric\n\n33:39.380 --> 33:44.380\n constituents of planets that could potentially be habitable.\n\n33:44.380 --> 33:46.060\n And that's this year.\n\n33:46.060 --> 33:47.060\n What's the name?\n\n33:47.060 --> 33:49.660\n JWST, the James Webb Space Telescope.\n\n33:49.660 --> 33:50.660\n Okay.\n\n33:50.660 --> 33:53.060\n And that's going to be out in space, past the atmosphere.\n\n33:53.060 --> 33:54.060\n Yes.\n\n33:54.060 --> 33:57.300\n Is there something interesting to be said about the engineering aspect of the telescope?\n\n33:57.300 --> 34:02.940\n I mean, it's an incredible beast, but it's a beast of many burdens.\n\n34:02.940 --> 34:05.580\n So it's going to do, it's going to.\n\n34:05.580 --> 34:07.300\n See, you are a poet.\n\n34:07.300 --> 34:08.720\n You are, yeah.\n\n34:08.720 --> 34:09.720\n I love it.\n\n34:09.720 --> 34:10.720\n This is very eloquent.\n\n34:10.720 --> 34:15.300\n You're speaking to the audience, which I appreciate.\n\n34:15.300 --> 34:20.700\n So yeah, so it's a giant engineering project and is it orbiting something, do you know?\n\n34:20.700 --> 34:26.220\n So it's going to be above the atmosphere and it will be doing lots of different astrophysics.\n\n34:26.220 --> 34:33.180\n And so some of its time will be dedicated to exoplanets, but there's an entire astronomy\n\n34:33.180 --> 34:40.340\n field fighting for time before the cryogenic lifetime of the instrument.\n\n34:40.340 --> 34:45.980\n And so when I was looking for the possibility of finding phosphine on distant exoplanets,\n\n34:45.980 --> 34:52.500\n I used JWST as a way of checking with this instrument that we will launch later this\n\n34:52.500 --> 34:56.740\n year, could we detect phosphine on an oxygen poor planet?\n\n34:56.740 --> 35:02.140\n And there I put very much a hard stop where some of my simulation said, yes, you can totally\n\n35:02.140 --> 35:07.020\n do it, but it will take a little under the cryogenic lifetime of this machine.\n\n35:07.020 --> 35:11.960\n So then I had to go, well, that's not going to, no one's going to dedicate all of JWST\n\n35:11.960 --> 35:15.420\n to look for my molecule that no one cared about.\n\n35:15.420 --> 35:21.200\n So we're very much at that edge, but there'll be many other telescopes in the coming decades\n\n35:21.200 --> 35:26.060\n that will be able to tell us quite a lot about the atmospheres of potentially habitable planets.\n\n35:26.060 --> 35:28.400\n So you mentioned simulation.\n\n35:28.400 --> 35:30.220\n This is super interesting to me.\n\n35:30.220 --> 35:36.860\n And this perhaps could be a super dumb question, but I think I haven't been able to, I haven't\n\n35:36.860 --> 35:38.940\n been able to prove you wrong on that one.\n\n35:38.940 --> 35:43.660\n You simulate molecules to understand how they look from a distance is what I understand.\n\n35:43.660 --> 35:46.740\n Like what does that simulation look like?\n\n35:46.740 --> 35:52.160\n So it's talking about which colors that the rainbow will be missing.\n\n35:52.160 --> 35:54.740\n Is that the goal of the simulation?\n\n35:54.740 --> 35:59.620\n That's the goal, but it's really just a very, very nasty Schrodinger's equation.\n\n35:59.620 --> 36:01.100\n So it's a quantum simulation.\n\n36:01.100 --> 36:03.780\n Oh, so it's simulating at the quantum level.\n\n36:03.780 --> 36:04.780\n Yes.\n\n36:04.780 --> 36:05.780\n So I'm a quantum astrochemist.\n\n36:05.780 --> 36:07.180\n Hi, I'm Clara.\n\n36:07.180 --> 36:08.180\n I'm a quantum astrochemist.\n\n36:08.180 --> 36:10.300\n That's how we should have started this conversation.\n\n36:10.300 --> 36:17.340\n Can you describe the three components of that quantum astro and chemist and how they interplay\n\n36:17.340 --> 36:18.920\n together?\n\n36:18.920 --> 36:26.060\n So I study the quantum behavior of molecules, hence the quantum and the chemist specifically\n\n36:26.060 --> 36:31.120\n so I can detect them in space, hence the astro.\n\n36:31.120 --> 36:38.620\n So what I do is I figure out the probability of a molecule being in a particular state.\n\n36:38.620 --> 36:45.220\n There's no deterministic nature to the work I do, so it's every transition is just a likelihood.\n\n36:45.220 --> 36:50.640\n But if you get a population of that molecule, it will always happen.\n\n36:50.640 --> 36:52.460\n And so this is all at the quantum level.\n\n36:52.460 --> 36:55.860\n It's a Schrodinger equation on, I think, 27 dimensions.\n\n36:55.860 --> 36:57.880\n I don't remember it by heart.\n\n36:57.880 --> 37:03.660\n And what this means is I'm solving these giant quantum matrices.\n\n37:03.660 --> 37:09.060\n And that's why you need a lot of computer power, giant computers, to diagonalize these\n\n37:09.060 --> 37:17.440\n enormous matrices, each of whom describes a single vibrational behavior of a molecule.\n\n37:17.440 --> 37:26.120\n So I think phosphine has 17.5 million possible states it can exist in.\n\n37:26.120 --> 37:31.160\n And transitions can occur between pairs of these states, and there's a certain likelihood\n\n37:31.160 --> 37:32.160\n that they'll happen.\n\n37:32.160 --> 37:33.160\n This is the quantum world.\n\n37:33.160 --> 37:34.160\n Nothing is deterministic.\n\n37:34.160 --> 37:38.560\n There's just a likelihood that it will jump from one state to another.\n\n37:38.560 --> 37:44.220\n And these jumps, they're transitions, and there's 16.8 billion of them.\n\n37:44.220 --> 37:48.980\n When energy is absorbed, that corresponds to this transition, we see it in the spectrum.\n\n37:48.980 --> 37:50.700\n This is more quantum chemistry than you had asked for.\n\n37:50.700 --> 37:51.700\n I'm sorry.\n\n37:51.700 --> 37:52.700\n No, no.\n\n37:52.700 --> 37:53.700\n I'm sorry.\n\n37:53.700 --> 37:54.700\n Brain's broken.\n\n37:54.700 --> 37:59.840\n So when the transitions happen between the different states, somehow the energy maps\n\n37:59.840 --> 38:00.840\n the spectrum.\n\n38:00.840 --> 38:01.840\n Exactly.\n\n38:01.840 --> 38:06.760\n Energy corresponds to a frequency, and a frequency corresponds to a wavelength, which corresponds\n\n38:06.760 --> 38:08.180\n to a color.\n\n38:08.180 --> 38:11.800\n So there's some probability assigned to each color then?\n\n38:11.800 --> 38:12.800\n Exactly.\n\n38:12.800 --> 38:17.060\n And that probability determines how intense that transition will be, how strong.\n\n38:17.060 --> 38:23.280\n And so you run this kind of simulation for particular, so that's 17.5 squared or something\n\n38:23.280 --> 38:24.280\n like that.\n\n38:24.280 --> 38:30.600\n So 15.5 million energies, each one of whom involves diagonalizing a giant matrix with\n\n38:30.600 --> 38:31.600\n a supercomputer.\n\n38:31.600 --> 38:36.960\n I wonder what the most efficient algorithm for diagonalization is, but there's some kind\n\n38:36.960 --> 38:37.960\n of...\n\n38:37.960 --> 38:38.960\n There's many.\n\n38:38.960 --> 38:41.840\n Depends on kind of the shape of the matrix.\n\n38:41.840 --> 38:43.600\n So they're not random matrices.\n\n38:43.600 --> 38:48.580\n So some are more diagonal than others, and so some need more treatment than others.\n\n38:48.580 --> 38:52.960\n Most of the work ends up going in describing the system, this quantum system in different\n\n38:52.960 --> 38:57.560\n ways until you have a matrix that is close to being diagonal, and then it's much easier\n\n38:57.560 --> 38:59.480\n to clean it up.\n\n38:59.480 --> 39:03.840\n So how hard is this puzzle?\n\n39:03.840 --> 39:08.400\n So you're solving this puzzle for phosphine, right?\n\n39:08.400 --> 39:09.400\n Is this...\n\n39:09.400 --> 39:12.240\n Are we supposed to solve this puzzle for every single molecule?\n\n39:12.240 --> 39:13.240\n Exactly.\n\n39:13.240 --> 39:14.240\n Oh boy.\n\n39:14.240 --> 39:20.320\n Yes, I calculated if I did the work I did for phosphine, again, for all the molecules\n\n39:20.320 --> 39:25.040\n for which we don't have spectra, for which we don't have a fingerprint, it would take\n\n39:25.040 --> 39:28.560\n me 62,000 years, a little over.\n\n39:28.560 --> 39:30.080\n 62,000 years.\n\n39:30.080 --> 39:31.960\n What time flies when you're having fun?\n\n39:31.960 --> 39:32.960\n Okay.\n\n39:32.960 --> 39:38.320\n But you write that there are about 16,000 molecules we care about when looking for a\n\n39:38.320 --> 39:43.040\n new Earth or when we try to detect alien biosignatures.\n\n39:43.040 --> 39:48.720\n If we want to detect any molecules from here, we need to know their spectra, and we currently\n\n39:48.720 --> 39:49.720\n don't.\n\n39:49.720 --> 39:53.000\n So to solve this particular problem, that's my job.\n\n39:53.000 --> 39:54.000\n What was that?\n\n39:54.000 --> 39:55.880\n I mean, that's absolutely correct.\n\n39:55.880 --> 39:57.880\n I could have not said it better myself.\n\n39:57.880 --> 39:59.360\n Did you take that from my website?\n\n39:59.360 --> 40:00.800\n Yeah, I think I stole it.\n\n40:00.800 --> 40:04.680\n And your website is excellent, so it's a worthy place to steal stuff from.\n\n40:04.680 --> 40:05.680\n Thank you.\n\n40:05.680 --> 40:12.120\n How do you solve this problem for the 16,000 molecules we care about, of which phosphine\n\n40:12.120 --> 40:13.120\n is one?\n\n40:13.120 --> 40:14.120\n Yes.\n\n40:14.120 --> 40:21.360\n So, taking a step a little bit out of phosphine, is there...\n\n40:21.360 --> 40:23.480\n Well, we were having so much fun.\n\n40:23.480 --> 40:24.480\n We were having so much fun.\n\n40:24.480 --> 40:25.480\n No, no, we're not saying bye.\n\n40:25.480 --> 40:26.480\n No, no, no.\n\n40:26.480 --> 40:27.480\n It's sticking around.\n\n40:27.480 --> 40:30.720\n I'm just saying we're joining, more friends coming to the party.\n\n40:30.720 --> 40:35.440\n How do you choose other friends to come to the party that are interesting to study as\n\n40:35.440 --> 40:40.280\n we solve one puzzle at a time through the space of 16,000?\n\n40:40.280 --> 40:41.280\n So we've already started.\n\n40:41.280 --> 40:46.840\n Out of those 16,000, we understand water quite well, methane quite well, ammonia quite well,\n\n40:46.840 --> 40:47.840\n carbon dioxide.\n\n40:47.840 --> 40:49.600\n I could keep going.\n\n40:49.600 --> 40:55.940\n And then we understand molecules like acetylene, hydrogen cyanide, more or less.\n\n40:55.940 --> 40:59.220\n And that takes us to about 4% of those 16,000.\n\n40:59.220 --> 41:02.320\n We understand about 4% of them, more or less.\n\n41:02.320 --> 41:04.280\n Phosphine is one of them.\n\n41:04.280 --> 41:11.040\n But the other 96%, we just really have barely any idea at all of where in the spectrum of\n\n41:11.040 --> 41:14.720\n light they would leave a mark.\n\n41:14.720 --> 41:19.280\n I can't spend the next 62,000 years doing this work.\n\n41:19.280 --> 41:26.420\n And I don't want to, even if somehow I was able, that wouldn't feel good.\n\n41:26.420 --> 41:32.600\n So one of the things that I try to do now is move away from how I did phosphine.\n\n41:32.600 --> 41:37.040\n So I did phosphine really the best that I could, the best that could be done with the\n\n41:37.040 --> 41:42.280\n computer power that we have, trying to get each one of those 16.8 billion transitions\n\n41:42.280 --> 41:46.640\n mapped accurately, calculated.\n\n41:46.640 --> 41:50.000\n And then I thought, what if I do a worse job?\n\n41:50.000 --> 41:53.160\n What if I just do a much worse job?\n\n41:53.160 --> 41:57.680\n Can I just make it much faster and then it's still worth it?\n\n41:57.680 --> 42:02.120\n How bad can I get before it's worthless?\n\n42:02.120 --> 42:05.380\n And then could I do this for all the other molecules?\n\n42:05.380 --> 42:10.560\n So I created exactly this terrible, terrible system.\n\n42:10.560 --> 42:14.120\n So how, what's the answer to that question, that fundamental question I ask myself all\n\n42:14.120 --> 42:15.600\n the time in other domains.\n\n42:15.600 --> 42:17.400\n How crappy can I be before I'm useless?\n\n42:17.400 --> 42:18.400\n Before somebody notices.\n\n42:18.400 --> 42:26.520\n Turns out pretty crappy because no one has any idea what these molecules look like.\n\n42:26.520 --> 42:28.640\n Anything is better than nothing.\n\n42:28.640 --> 42:33.040\n And so I thought, how long will it take me to create better than nothing spectra for\n\n42:33.040 --> 42:34.040\n all of these molecules?\n\n42:34.040 --> 42:42.480\n And so I created RASCAL, Rapid Approximate Spectral Calculations for All.\n\n42:42.480 --> 42:48.440\n And what I do is I use organic chemistry and quantum chemistry and kind of cheat them both.\n\n42:48.440 --> 42:53.000\n I just try to figure out what is the fastest way I could run this.\n\n42:53.000 --> 42:57.520\n And I simulate rough spectra for all of those 16,000.\n\n42:57.520 --> 42:59.560\n So I've managed to get it to work.\n\n42:59.560 --> 43:03.040\n It's really shocking how well it works considering how bad it is.\n\n43:03.040 --> 43:08.600\n Is there insights you could give to like the tricks involved in making it fast?\n\n43:08.600 --> 43:16.520\n Like what are the maybe some insightful shortcuts taken that still result in some useful information\n\n43:16.520 --> 43:18.120\n about the spectra?\n\n43:18.120 --> 43:22.280\n The insights came from organic chemistry from decades ago.\n\n43:22.280 --> 43:26.840\n When organic chemists wanted to know what a compound might be, they will look at a spectrum\n\n43:26.840 --> 43:31.120\n and see a feature and they would go, I've seen that feature before.\n\n43:31.120 --> 43:36.040\n That's usually what happens when you have a carbon triple bonded to another carbon.\n\n43:36.040 --> 43:37.440\n And they were mostly right.\n\n43:37.440 --> 43:42.480\n Almost every molecule that has a carbon triple bonded to another one looks like that.\n\n43:42.480 --> 43:47.360\n Has other features different that distinguish them from one another, but they have that\n\n43:47.360 --> 43:49.320\n feature in common.\n\n43:49.320 --> 43:51.280\n We call these functional groups.\n\n43:51.280 --> 43:57.080\n And so most of that work ended up being abandoned because now we have mass spectrometry.\n\n43:57.080 --> 44:03.160\n We got nuclear magnetic resin spectroscopy, so people don't really need to do that anymore.\n\n44:03.160 --> 44:09.560\n But these ancient textbooks still exist and I've collected them all as many as I could.\n\n44:09.560 --> 44:13.880\n And there are hundreds of these descriptions where people have said, oh, whenever you have\n\n44:13.880 --> 44:20.620\n a iodine atom connected to this one, there's always a feature here and it's usually quite\n\n44:20.620 --> 44:22.940\n sharp and it's quite strong.\n\n44:22.940 --> 44:24.980\n And some people go, oh yeah, that's really broad feature.\n\n44:24.980 --> 44:28.220\n Every time that combination of atoms and bonds.\n\n44:28.220 --> 44:32.720\n So I've collected them all and I've created this giant dictionary of all these kind of\n\n44:32.720 --> 44:37.440\n puzzle pieces, these Lego parts of molecules.\n\n44:37.440 --> 44:41.640\n And I've written a code that then puts them all together in some kind of like Frankenstein's\n\n44:41.640 --> 44:43.760\n monster of molecules.\n\n44:43.760 --> 44:48.780\n So you asked me for any molecule and I go, well, it has these bonds and this atom dangling\n\n44:48.780 --> 44:55.640\n off this atom and this cluster here, and I tell you what it should look like and it kind\n\n44:55.640 --> 44:57.320\n of works.\n\n44:57.320 --> 45:03.600\n So this creates a whole portfolio of just kind of signatures that we could look for.\n\n45:03.600 --> 45:05.160\n Rough, very rough signatures.\n\n45:05.160 --> 45:14.360\n But still useful enough to analyze the atmospheres, the telescope generated images of other planets?\n\n45:14.360 --> 45:15.540\n Close.\n\n45:15.540 --> 45:18.960\n Right now it is so complete.\n\n45:18.960 --> 45:24.080\n So it has all of these molecules that it can tell you, say you look at an alien atmosphere\n\n45:24.080 --> 45:26.320\n and there's a feature there.\n\n45:26.320 --> 45:29.100\n It can tell you, oh, that feature, that's familiar.\n\n45:29.100 --> 45:34.160\n It could be one of these 816 molecules, best of luck.\n\n45:34.160 --> 45:38.520\n So I think the next step, which is what I'm working on is telling you something more useful\n\n45:38.520 --> 45:41.320\n than it could be one of those 816 molecules.\n\n45:41.320 --> 45:42.320\n That's still true.\n\n45:42.320 --> 45:43.800\n I wouldn't say it's useful.\n\n45:43.800 --> 45:48.680\n So it can tell you, but only 12% of them also have a feature in this region.\n\n45:48.680 --> 45:49.680\n So go look there.\n\n45:49.680 --> 45:53.400\n And if there's nothing there, it can't be those and so on.\n\n45:53.400 --> 45:58.000\n It can also tell you things like you will need this much accuracy to distinguish between\n\n45:58.000 --> 46:00.220\n those 816.\n\n46:00.220 --> 46:03.080\n So that's what I'm working on.\n\n46:03.080 --> 46:04.480\n But it's a lot of work.\n\n46:04.480 --> 46:09.000\n So this is really interesting, the role of computing in this whole picture.\n\n46:09.000 --> 46:10.200\n You mentioned code.\n\n46:10.200 --> 46:18.600\n So like you as a quantum astrochemist, there is some role for programming in your life,\n\n46:18.600 --> 46:21.440\n in your past life, in your current life, in your group?\n\n46:21.440 --> 46:22.440\n Oh yeah, almost entirely.\n\n46:22.440 --> 46:25.400\n I'm a computational quantum astrochemist, but that doesn't roll off the tongue very\n\n46:25.400 --> 46:26.400\n easily.\n\n46:26.400 --> 46:28.520\n So this is fundamentally computational.\n\n46:28.520 --> 46:32.480\n Like if you want to be successful in the 21st century in doing quantum astrochemistry, you\n\n46:32.480 --> 46:33.480\n want to be computational?\n\n46:33.480 --> 46:34.480\n Absolutely.\n\n46:34.480 --> 46:36.680\n All quantum chemistry is computational at this point.\n\n46:36.680 --> 46:37.680\n Okay.\n\n46:37.680 --> 46:40.560\n So does machine learning play a role at all?\n\n46:40.560 --> 46:46.080\n Is there some extra shortcuts that could be discovered through, like you see all that\n\n46:46.080 --> 46:48.280\n success with protein folding, right?\n\n46:48.280 --> 46:58.800\n A problem that thought to be extremely difficult to apply machine learning to because it's,\n\n46:58.800 --> 47:04.800\n I mean mostly because there's not a lot of already solved puzzles to train on.\n\n47:04.800 --> 47:09.320\n I suppose the same exact thing is true with this particular problem, but is there hope\n\n47:09.320 --> 47:11.480\n for machine learning to help out?\n\n47:11.480 --> 47:12.600\n Absolutely.\n\n47:12.600 --> 47:14.920\n Currently you've laid out exactly the problem.\n\n47:14.920 --> 47:21.800\n The training set is awful and because there's so, a lot of this data that I'm basing it\n\n47:21.800 --> 47:24.000\n on is literally many decades old.\n\n47:24.000 --> 47:29.520\n The people who worked on it and data that I get, often they're dead and the files that\n\n47:29.520 --> 47:34.240\n I've used, some of them were hand drawn by someone tired in the seventies.\n\n47:34.240 --> 47:35.240\n Yes.\n\n47:35.240 --> 47:40.560\n So I can of course have a program training on these, but I would just be perpetuating\n\n47:40.560 --> 47:43.840\n these mistakes without hope of actually verifying them.\n\n47:43.840 --> 47:51.360\n So my next step is to improve this training set by hand and then try to see if I can apply\n\n47:51.360 --> 47:57.240\n machine learning on the full code of the full 16,000 molecules and improve them all.\n\n47:57.240 --> 48:01.500\n But really I need to be able to test the outcomes with experimental data, which means convincing\n\n48:01.500 --> 48:08.560\n someone in a lab to spend a lot of money putting very dangerous gases in chambers and measuring\n\n48:08.560 --> 48:11.260\n them at outrageous temperatures.\n\n48:11.260 --> 48:13.520\n So it's a work in progress.\n\n48:13.520 --> 48:18.400\n And so collecting huge amounts of data about the actual gases.\n\n48:18.400 --> 48:22.520\n So you are up for doing that kind of thing too.\n\n48:22.520 --> 48:29.680\n So actually like doing the full end to end thing, which is like having a gas, collecting\n\n48:29.680 --> 48:35.760\n data about it, and then doing the kind of analysis that creates the fingerprint and\n\n48:35.760 --> 48:40.120\n then also analyzing using that library, the data that comes from other planets.\n\n48:40.120 --> 48:41.760\n So you do the full.\n\n48:41.760 --> 48:43.600\n Full from birth to death.\n\n48:43.600 --> 48:44.600\n Interesting.\n\n48:44.600 --> 48:45.600\n Yes.\n\n48:45.600 --> 48:50.880\n I worked in an industrial chemistry laboratory when I was much younger in Slovenia and there\n\n48:50.880 --> 48:56.640\n I worked in the lab actually collecting spectrum and predicting spectrum.\n\n48:56.640 --> 49:00.800\n What's it like to work with a bunch of gases that are like not so human friendly?\n\n49:00.800 --> 49:01.800\n It's terrifying.\n\n49:01.800 --> 49:03.160\n It's horrific.\n\n49:03.160 --> 49:04.320\n It's so scary.\n\n49:04.320 --> 49:06.280\n And I love my job.\n\n49:06.280 --> 49:15.160\n I'm willing to clearly sacrifice a lot for it, you know, job, stability, money, sanity.\n\n49:15.160 --> 49:20.440\n But I only worked there for a few months and it was really terrifying.\n\n49:20.440 --> 49:22.800\n There's just so many ways to die.\n\n49:22.800 --> 49:26.200\n You know, usually you only have a handful of ways to die every day, you know.\n\n49:26.200 --> 49:30.800\n And if you work in a lab, there's so many more, orders of magnitude more.\n\n49:30.800 --> 49:32.920\n And I was very bad at it.\n\n49:32.920 --> 49:35.840\n I'm not a good hands on scientist.\n\n49:35.840 --> 49:43.240\n I want a laptop connected to a remote super computer or a laptop connected to a telescope.\n\n49:43.240 --> 49:46.960\n I don't need to be there to believe it.\n\n49:46.960 --> 49:48.760\n And I am not good in the lab.\n\n49:48.760 --> 49:49.760\n Yeah.\n\n49:49.760 --> 49:53.200\n When there's a bunch of things that can poison you, a bunch of things that could explode\n\n49:53.200 --> 49:57.720\n and they're gaseous and they're often, maybe they might not even have a smell or they might\n\n49:57.720 --> 49:59.820\n not be visible.\n\n49:59.820 --> 50:00.820\n It's like...\n\n50:00.820 --> 50:02.240\n So many of them give you cancer.\n\n50:02.240 --> 50:03.840\n It's just so cruel.\n\n50:03.840 --> 50:09.120\n And some people love this work, but I've never enjoyed experimental work.\n\n50:09.120 --> 50:11.120\n It's so ungrateful.\n\n50:11.120 --> 50:12.120\n So lonely.\n\n50:12.120 --> 50:18.440\n Well, most, I mean, so much work is lonely if you find the joy in it, but you enjoy the\n\n50:18.440 --> 50:19.920\n results of it.\n\n50:19.920 --> 50:20.920\n Yes.\n\n50:20.920 --> 50:26.160\n So I'm very thankful for all the experimentalists in my life, but I'll do the theory.\n\n50:26.160 --> 50:30.200\n They do the experiment and then we talk to one another and make sure it matches.\n\n50:30.200 --> 50:31.200\n Okay.\n\n50:31.200 --> 50:32.200\n Beautiful.\n\n50:32.200 --> 50:34.400\n What are spectroscopic networks?\n\n50:34.400 --> 50:35.480\n Those look super cool.\n\n50:35.480 --> 50:37.600\n Are they related to what we were talking about?\n\n50:37.600 --> 50:38.600\n The picture look pretty.\n\n50:38.600 --> 50:39.600\n Oh, yes, slightly.\n\n50:39.600 --> 50:44.400\n So remember when I mentioned the 17.5 million energy levels?\n\n50:44.400 --> 50:45.400\n Yes.\n\n50:45.400 --> 50:51.640\n There are rules for each molecule on which energy levels they can jump from and to and\n\n50:51.640 --> 50:53.900\n how likely it is to make that jump.\n\n50:53.900 --> 51:01.040\n And so if you plot all the routes it can take, you get this energy network, which is like\n\n51:01.040 --> 51:02.040\n a ball.\n\n51:02.040 --> 51:06.200\n So these are the constraints of the transitions that could be taken.\n\n51:06.200 --> 51:07.680\n Exactly for each molecule.\n\n51:07.680 --> 51:08.680\n Interesting.\n\n51:08.680 --> 51:13.840\n And they're not, so it's not a fully connected, it's like it's sparse somehow.\n\n51:13.840 --> 51:15.800\n Yes, you get islands sometimes.\n\n51:15.800 --> 51:20.920\n You get a molecule can only jump from one set of states to another and it's trapped\n\n51:20.920 --> 51:21.920\n now in this network.\n\n51:21.920 --> 51:27.680\n It can never go to another network that could have been available to other siblings.\n\n51:27.680 --> 51:30.060\n Is there some insights to be drawn from these networks?\n\n51:30.060 --> 51:33.800\n Like something cool that you can understand about a particular molecule because of it?\n\n51:33.800 --> 51:34.800\n Yes.\n\n51:34.800 --> 51:38.800\n Some molecules have what we call forbidden transitions, which aren't really forbidden\n\n51:38.800 --> 51:39.800\n because it's quantum.\n\n51:39.800 --> 51:40.800\n There are no rules.\n\n51:40.800 --> 51:41.800\n No, I'm not joking.\n\n51:41.800 --> 51:45.880\n One of the rules is just the rules are very often broken in the quantum world.\n\n51:45.880 --> 51:49.240\n And so forbidden transitions doesn't actually mean they're forbidden.\n\n51:49.240 --> 51:50.240\n Low probability.\n\n51:50.240 --> 51:51.240\n Exactly.\n\n51:51.240 --> 51:52.640\n They just become deeply unlikely.\n\n51:52.640 --> 51:53.640\n Yeah.\n\n51:53.640 --> 51:54.640\n Cool.\n\n51:54.640 --> 51:58.620\n And so you could do all the same, like I'm coming from a computer science world, I love\n\n51:58.620 --> 51:59.620\n graph theory.\n\n51:59.620 --> 52:05.320\n So you can do all the same graph theoretic kind of analysis of clusters or something\n\n52:05.320 --> 52:06.320\n like that.\n\n52:06.320 --> 52:07.320\n Exactly.\n\n52:07.320 --> 52:08.320\n All those kinds of things.\n\n52:08.320 --> 52:09.320\n And draw insights from it.\n\n52:09.320 --> 52:10.320\n Cool.\n\n52:10.320 --> 52:11.320\n And they're unique for each molecule.\n\n52:11.320 --> 52:17.040\n And the networks that you mentioned, that's actually not too difficult a layer of quantum\n\n52:17.040 --> 52:18.040\n physics.\n\n52:18.040 --> 52:19.960\n By then, all the energies are mapped.\n\n52:19.960 --> 52:23.420\n So we've had high school children work on those networks.\n\n52:23.420 --> 52:26.380\n And the trick is to not tell them they're doing quantum physics until like three months\n\n52:26.380 --> 52:29.140\n in when it's too late for them to back out.\n\n52:29.140 --> 52:31.080\n And then you're like, you're a quantum physicist now.\n\n52:31.080 --> 52:32.080\n And it's really nice.\n\n52:32.080 --> 52:33.080\n Yeah.\n\n52:33.080 --> 52:34.080\n Okay.\n\n52:34.080 --> 52:37.400\n But like the promise of this, even though it's 16,000, even just a subset of them, that's\n\n52:37.400 --> 52:41.640\n really exciting because then you can do as the telescope data get better and better,\n\n52:41.640 --> 52:46.120\n especially for exoplanets, but also for Venus.\n\n52:46.120 --> 52:50.520\n You can then start like getting your full, like, you know how you get like blood work\n\n52:50.520 --> 52:54.760\n done or like you get your genetic testing to see what your ancestors are.\n\n52:54.760 --> 52:59.760\n You can get the same kind of like high resolution information about interesting things going\n\n52:59.760 --> 53:02.240\n on on a particular planet based on the atmosphere.\n\n53:02.240 --> 53:03.240\n Right?\n\n53:03.240 --> 53:04.240\n Exactly.\n\n53:04.240 --> 53:07.360\n How cool would that be if we could, you know, scan an alien planet and go,\n\n53:07.360 --> 53:09.080\n oh, this is what the clouds are made of.\n\n53:09.080 --> 53:10.680\n This is what's in the surface.\n\n53:10.680 --> 53:12.640\n These are the molecules that are mixing.\n\n53:12.640 --> 53:16.880\n Here are probably oceans because you can see these types of molecules above it.\n\n53:16.880 --> 53:19.360\n And here are the Hadley cells.\n\n53:19.360 --> 53:22.300\n Here are how the biosphere works.\n\n53:22.300 --> 53:24.160\n We could map this whole thing.\n\n53:24.160 --> 53:28.320\n Wouldn't it be cool if the aliens like are aware of these techniques and like would spoof\n\n53:28.320 --> 53:33.680\n like the wrong gases, just to like pretend that's how they can be, it's like an invisibility\n\n53:33.680 --> 53:34.680\n cloak.\n\n53:34.680 --> 53:39.440\n They can generate gases that would throw you off or like, or do the opposite.\n\n53:39.440 --> 53:42.200\n They pretend they will artificially generate phosphine.\n\n53:42.200 --> 53:47.840\n So like, like the dumb, the dumb apes on earth again, like go out, like flying in different\n\n53:47.840 --> 53:49.660\n places because it's just fun.\n\n53:49.660 --> 53:53.440\n It's like some teenager alien somewhere, just pranking.\n\n53:53.440 --> 53:54.440\n Yeah.\n\n53:54.440 --> 54:04.240\n I was asked that exact question this Saturday by, by a 70 year old boy in Canada, but it\n\n54:04.240 --> 54:10.400\n was the first time I'd been asked that question, the second in a week.\n\n54:10.400 --> 54:12.540\n We're kindred spirits, him and I.\n\n54:12.540 --> 54:19.520\n We can, they can prank us to some extent, but the, this work of interpreting an alien\n\n54:19.520 --> 54:25.760\n atmosphere means you're reading the atmosphere as a message and it's very hard to hide signs\n\n54:25.760 --> 54:32.160\n of life in an atmosphere because you can try to prank us, but you're still going to fart\n\n54:32.160 --> 54:37.960\n and breathe and somehow metabolize the environment around you and call that whatever you call\n\n54:37.960 --> 54:41.160\n that and release molecules.\n\n54:41.160 --> 54:42.520\n And so that's really hard to hide.\n\n54:42.520 --> 54:44.820\n You know, you can go very quiet.\n\n54:44.820 --> 54:50.400\n You can throw out some weird molecule to confuse us further, but we can still see all your\n\n54:50.400 --> 54:51.400\n other metabolites.\n\n54:51.400 --> 54:52.400\n Yeah.\n\n54:52.400 --> 54:53.400\n It's hard to fake.\n\n54:53.400 --> 55:00.800\n Is there, so you kind of mentioned like water that what, what other gases are there that\n\n55:00.800 --> 55:06.800\n we know about that are like high likelihood as biosignatures in terms of life?\n\n55:06.800 --> 55:14.400\n I mean, what are your other favorites in terms of, so, so we've got phosphine, but like what,\n\n55:14.400 --> 55:19.080\n what else is a damn good signal to be a, that you think about that we should be looking\n\n55:19.080 --> 55:23.760\n for if we look at another atmosphere, is there gases that come to mind or are there all sort\n\n55:23.760 --> 55:29.080\n of possible biosignatures that we should love equally?\n\n55:29.080 --> 55:31.600\n There's many, so there's water.\n\n55:31.600 --> 55:33.480\n We know that's important for life as we know it.\n\n55:33.480 --> 55:35.400\n There's molecular oxygen on earth.\n\n55:35.400 --> 55:39.720\n That's probably the most robust sign of life, particularly combined with small amounts of\n\n55:39.720 --> 55:40.720\n methane.\n\n55:40.720 --> 55:44.700\n And it's true that the majority of the oxygen in our atmosphere is a product of life.\n\n55:44.700 --> 55:50.680\n And so if I was an alien astronomer and I saw earth's atmosphere, I'm, I would get a\n\n55:50.680 --> 55:52.640\n Nobel I think on, you know,\n\n55:52.640 --> 55:53.640\n What would you notice?\n\n55:53.640 --> 55:54.640\n I mean, this is a really,\n\n55:54.640 --> 55:57.560\n I would be very excited about this.\n\n55:57.560 --> 55:58.560\n About the oxygen.\n\n55:58.560 --> 56:02.280\n I'm not finding 20%, 21% of oxygen atmosphere.\n\n56:02.280 --> 56:03.280\n That's very unusual.\n\n56:03.280 --> 56:07.160\n So would that be the most exciting thing to you from an alien perspective about earth\n\n56:07.160 --> 56:12.400\n in terms of the tech, like analyzing the atmosphere, like what are the biosignatures of life on\n\n56:12.400 --> 56:13.400\n earth?\n\n56:13.400 --> 56:18.160\n Would you say in terms of the contents of the atmosphere is oxygen, high amount of oxygen,\n\n56:18.160 --> 56:19.600\n pretty damn good sign.\n\n56:19.600 --> 56:23.440\n I mean, it's not as good as the TV signals we've been sending out.\n\n56:23.440 --> 56:27.760\n Those are slightly more robust than oxygen.\n\n56:27.760 --> 56:30.140\n Oxygen on its own has false positives for life.\n\n56:30.140 --> 56:36.520\n So there's still ways of making it, but it's, it's a pretty robust sign of life in the context\n\n56:36.520 --> 56:41.480\n or atmosphere with the radiation that the sun produces, our position in relation to\n\n56:41.480 --> 56:47.040\n the sun, the other components of our atmosphere, the volcanic activity we have, all of that\n\n56:47.040 --> 56:53.920\n together makes the 20% of oxygen extremely robust sign of life.\n\n56:53.920 --> 56:59.520\n But outside that context, you could still produce oxygen without life.\n\n56:59.520 --> 57:03.520\n But phosphine, although better in the sense of it is much harder to make, it has lower\n\n57:03.520 --> 57:06.260\n false positives, still has some.\n\n57:06.260 --> 57:12.080\n So I'm actually against looking for specific molecules unless we're looking for like CFCs.\n\n57:12.080 --> 57:16.900\n If we find CFCs, that's definitely aliens, I feel confident, chlorofluorocarbons.\n\n57:16.900 --> 57:22.520\n And so, you know, if aliens had been watching us, they would have been going, oh no, CFCs.\n\n57:22.520 --> 57:25.200\n I mean, they're not going to last long.\n\n57:25.200 --> 57:30.560\n Let's, you know, everyone's writing their thesis on the end of, the end of the earth.\n\n57:30.560 --> 57:33.280\n And then we got together, we stopped using them.\n\n57:33.280 --> 57:35.440\n I like to think they're really proud of us.\n\n57:35.440 --> 57:38.280\n You know, they literally saw our ozone hole shrinking.\n\n57:38.280 --> 57:40.200\n They've been watching it and they saw it happen.\n\n57:40.200 --> 57:43.440\n I think to be honest, they're more paying attention to the whole nuclear thing.\n\n57:43.440 --> 57:44.440\n I don't think they care.\n\n57:44.440 --> 57:45.440\n It's not going to bother them.\n\n57:45.440 --> 57:46.440\n Oh, I mean, worried about us.\n\n57:46.440 --> 57:47.440\n Oh yes.\n\n57:47.440 --> 57:48.440\n Oh no, worried about us.\n\n57:48.440 --> 57:53.040\n They, I mean, this is why the aliens have been showing up recently.\n\n57:53.040 --> 57:56.960\n It's like, if you, if you look at, I mean, there is, I mean, it's probably, there's a\n\n57:56.960 --> 58:02.080\n correlation with a lot of things, but what the ufologists quote unquote often talk about\n\n58:02.080 --> 58:08.400\n is that there seems to be a much higher level of UFO sightings since like in the nuclear\n\n58:08.400 --> 58:09.720\n age.\n\n58:09.720 --> 58:14.000\n So like if aliens were indeed worried about us, like if you were aliens, you would start\n\n58:14.000 --> 58:21.000\n showing up when the living organisms first discovered a way to destroy the entire, the\n\n58:21.000 --> 58:22.680\n entire colony.\n\n58:22.680 --> 58:28.720\n Can the increase in sightings not have to do with the fact that people now have more\n\n58:28.720 --> 58:29.720\n cameras?\n\n58:29.720 --> 58:37.600\n It's an interesting thing about science, like with UFO sightings, it's like either 99.9%\n\n58:37.600 --> 58:40.240\n of them are false or 100% of them are false.\n\n58:40.240 --> 58:46.320\n The interesting thing to me is that in that 0.01%, there's a lot of things in science\n\n58:46.320 --> 58:52.080\n that are like these weird outliers that are difficult to replicate.\n\n58:52.080 --> 58:55.120\n You have like, there's even physical phenomena, ball lightning.\n\n58:55.120 --> 59:00.960\n There's difficult things to artificially create in large amounts or observe in nature in large\n\n59:00.960 --> 59:05.640\n amounts in such a way that you can do it to apply the scientific method that could be\n\n59:05.640 --> 59:11.600\n just things that like what happened like a few times or once and you're like, what the\n\n59:11.600 --> 59:13.420\n hell is that?\n\n59:13.420 --> 59:16.280\n And that's very difficult for science to know what to do with.\n\n59:16.280 --> 59:20.920\n I'm a huge proponent of just being open minded because when you're open minded about aliens,\n\n59:20.920 --> 59:27.600\n for example, it allows you to think outside of the box in other domains as well.\n\n59:27.600 --> 59:33.280\n And somehow that will result, like if you're open minded about aliens and you don't laugh\n\n59:33.280 --> 59:37.560\n it off immediately, what happens is somehow that's going to lead to a solution to a P\n\n59:37.560 --> 59:39.760\n equals NP or P not equals NP.\n\n59:39.760 --> 59:45.880\n Like in ways that you can't predict, the open mindedness has tertiary effects that will\n\n59:45.880 --> 59:51.840\n result in progress, I believe, which is why I'm a huge fan of aliens because it's like\n\n59:51.840 --> 59:57.360\n because too many scientists roll their eyes at the idea of aliens, alien life.\n\n59:57.360 --> 1:00:06.280\n And to me, it's one of the most exciting possibilities in the biggest, most exciting questions before\n\n1:00:06.280 --> 1:00:07.720\n all of human civilization.\n\n1:00:07.720 --> 1:00:12.520\n So to roll your eyes is not the right answer.\n\n1:00:12.520 --> 1:00:16.800\n To roll your eyes presumes that you know anything about this world as opposed to just knowing\n\n1:00:16.800 --> 1:00:19.560\n point zero zero zero one percent of this world.\n\n1:00:19.560 --> 1:00:26.760\n And so being humble in the face of that, being open to the possibility of aliens visiting\n\n1:00:26.760 --> 1:00:29.120\n Earth is a good idea.\n\n1:00:29.120 --> 1:00:30.160\n Not everything, though.\n\n1:00:30.160 --> 1:00:36.960\n I'm not so open minded to the flat Earth hypothesis as there's a growing number of people believing\n\n1:00:36.960 --> 1:00:37.960\n in.\n\n1:00:37.960 --> 1:00:38.960\n But even then.\n\n1:00:38.960 --> 1:00:42.200\n Or the inner Earth, I've got shouted at in a public talk about it.\n\n1:00:42.200 --> 1:00:43.760\n So like the Earth is hollow?\n\n1:00:43.760 --> 1:00:44.760\n Yeah.\n\n1:00:44.760 --> 1:00:51.500\n My understanding is that there's this conspiracy theory that as far as I can tell has no grounding\n\n1:00:51.500 --> 1:00:56.200\n in reality is that there's a slightly smaller Earth inside this one, which is just too cute\n\n1:00:56.200 --> 1:00:57.200\n as a concept.\n\n1:00:57.200 --> 1:00:58.200\n That's awesome.\n\n1:00:58.200 --> 1:01:00.800\n And you can access it, I think, from Antarctica.\n\n1:01:00.800 --> 1:01:05.240\n And that's where we keep, and I quote, the mammoths and the Nazis.\n\n1:01:05.240 --> 1:01:08.700\n Yeah, I mean, that one is ridiculous.\n\n1:01:08.700 --> 1:01:09.700\n But like I do like.\n\n1:01:09.700 --> 1:01:12.800\n Hey, I thought you were keeping an open mind.\n\n1:01:12.800 --> 1:01:15.880\n I genuinely think that's more likely than aliens visiting the Earth.\n\n1:01:15.880 --> 1:01:21.920\n And I say this as someone who has dedicated her life to finding like alien life.\n\n1:01:21.920 --> 1:01:27.680\n And so that's how improbable, I think, the visitations are.\n\n1:01:27.680 --> 1:01:32.720\n Because interstellar distances are so huge that it's just not really worth it.\n\n1:01:32.720 --> 1:01:34.560\n See, I have a different view on this whole thing.\n\n1:01:34.560 --> 1:01:43.080\n I think the aliens that look like little green men are like extremely low probability event.\n\n1:01:43.080 --> 1:01:48.920\n Like mammoths and Nazis under that level.\n\n1:01:48.920 --> 1:01:57.760\n But other kind of ideas, like the sad thing to me, and I think in my view, if there's\n\n1:01:57.760 --> 1:02:04.120\n other alien civilizations out there and they visited Earth, neither them or perhaps just\n\n1:02:04.120 --> 1:02:06.920\n us would be even able to detect them.\n\n1:02:06.920 --> 1:02:10.400\n Like we wouldn't be open minded enough to see it.\n\n1:02:10.400 --> 1:02:19.880\n Like if, because our understanding of what is life, and I just talked to Sarah Walker,\n\n1:02:19.880 --> 1:02:20.880\n who's.\n\n1:02:20.880 --> 1:02:21.880\n You know Sarah.\n\n1:02:21.880 --> 1:02:25.400\n Yeah, we talked for three hours about the question of what is life.\n\n1:02:25.400 --> 1:02:29.320\n Sarah's a good person to talk to about what is life.\n\n1:02:29.320 --> 1:02:33.520\n But like the whole point is we don't really, we have a very narrow minded view of what\n\n1:02:33.520 --> 1:02:34.520\n is life.\n\n1:02:34.520 --> 1:02:45.080\n And when it shows up, and it might be already here, trees and dolphins and so on, or mountains\n\n1:02:45.080 --> 1:02:53.400\n or I don't know, or the molecules in the atmosphere, or like people make fun of me.\n\n1:02:53.400 --> 1:02:57.640\n But I do think that ideas are kind of aliens themselves, or consciousness could be the\n\n1:02:57.640 --> 1:03:00.620\n aliens, or it could be the method by which they communicate.\n\n1:03:00.620 --> 1:03:03.640\n We don't know shit about the way our human mind works.\n\n1:03:03.640 --> 1:03:09.600\n And the fact that this thing is a quantum process, please don't I understand this.\n\n1:03:09.600 --> 1:03:10.600\n It's not woo woo.\n\n1:03:10.600 --> 1:03:14.520\n I'm not I, we could, but it very well could be there could be something at the at the\n\n1:03:14.520 --> 1:03:16.140\n physics level, right?\n\n1:03:16.140 --> 1:03:19.360\n It could be at the chemical or the biological level, things that are happening that we're\n\n1:03:19.360 --> 1:03:27.120\n just close to close minded, because our conception of life is at the level of like us, like at\n\n1:03:27.120 --> 1:03:30.080\n the jungle level of mammals.\n\n1:03:30.080 --> 1:03:34.680\n And on the time scale, that's the human time scale, we may not be able to perceive what\n\n1:03:34.680 --> 1:03:42.640\n alien life is actually like what the scale at which their intelligence realizes itself\n\n1:03:42.640 --> 1:03:45.040\n when we're not able to perceive.\n\n1:03:45.040 --> 1:03:49.960\n And the other thing that's really important about alien visitations, whether it happened\n\n1:03:49.960 --> 1:03:56.560\n or not, is especially after COVID in 2020, I'm losing a little bit of faith of our government\n\n1:03:56.560 --> 1:04:04.120\n being able to handle that that well, not our government, but us as a society, as a collective,\n\n1:04:04.120 --> 1:04:11.880\n being able to deal with new things in an effective way that's inspiring, that's efficient, that\n\n1:04:11.880 --> 1:04:19.680\n like, whether it's if it's a dangerous thing to deal with it to alleviate the danger, whether\n\n1:04:19.680 --> 1:04:24.880\n it's the possibility of new discoveries and something inspiring to ride that wave and\n\n1:04:24.880 --> 1:04:27.000\n make it inspiring all those kinds of things.\n\n1:04:27.000 --> 1:04:31.120\n I honestly think if aliens showed up, they would look around, everybody would ignore\n\n1:04:31.120 --> 1:04:36.480\n them and the government might like hide it, try to like see to keep it from the Chinese\n\n1:04:36.480 --> 1:04:41.400\n and the Russians if it's the United States, call it a military secret in a very close\n\n1:04:41.400 --> 1:04:42.880\n minded way.\n\n1:04:42.880 --> 1:04:48.000\n And then the bureaucracy would drown it away to where through paperwork, the poor aliens\n\n1:04:48.000 --> 1:04:51.280\n would just like waste away and sell somewhere like there's a certain\n\n1:04:51.280 --> 1:04:55.400\n That would not happen, that would never happen, part of the reason that I feel so confident\n\n1:04:55.400 --> 1:04:59.480\n that aliens have not visited because they would have had to visit just to have a look\n\n1:04:59.480 --> 1:05:04.800\n remotely, from Neptune or something, which makes no sense because interstellar travel\n\n1:05:04.800 --> 1:05:12.040\n is so difficult that it would be quite a ridiculous proposition, but that's the bit that I think\n\n1:05:12.040 --> 1:05:13.540\n is technically possible.\n\n1:05:13.540 --> 1:05:18.880\n If they did come here and they were visible by anyone, detectable by anyone, the thought\n\n1:05:18.880 --> 1:05:24.360\n that any government, no matter, or any military could just contain them, these beings are\n\n1:05:24.360 --> 1:05:30.560\n capable of traveling interstellar distances when we can barely go to the moon, like barely\n\n1:05:30.560 --> 1:05:31.560\n go to the moon.\n\n1:05:31.560 --> 1:05:32.560\n These things would be way, way, way, way out there.\n\n1:05:32.560 --> 1:05:33.560\n Way.\n\n1:05:33.560 --> 1:05:38.360\n And the fact that we think our puny military, even if all the military in the world got\n\n1:05:38.360 --> 1:05:44.240\n together and the fact that they could somehow contain it, that's the bit that's laughable.\n\n1:05:44.240 --> 1:05:47.000\n Ants trying to contain a human that visited them.\n\n1:05:47.000 --> 1:05:48.000\n Exactly.\n\n1:05:48.000 --> 1:05:50.560\n And scientists, you would have to bring scientists on board.\n\n1:05:50.560 --> 1:05:52.280\n You've met a lot of scientists.\n\n1:05:52.280 --> 1:05:53.680\n How good are they at keeping secrets?\n\n1:05:53.680 --> 1:05:58.760\n Because in my experience, they're absolutely appalling at keeping secrets.\n\n1:05:58.760 --> 1:05:59.760\n Yeah, that's terrible.\n\n1:05:59.760 --> 1:06:03.320\n Even the Phosphine on Venus thing, which was a pretty well kept secret.\n\n1:06:03.320 --> 1:06:04.320\n This is true.\n\n1:06:04.320 --> 1:06:05.320\n You had a bunch of people that were.\n\n1:06:05.320 --> 1:06:06.320\n I told my dad.\n\n1:06:06.320 --> 1:06:07.320\n Yeah.\n\n1:06:07.320 --> 1:06:12.680\n You know, my dad knew and hopefully didn't tell anyone, but if it had been an alien visiting,\n\n1:06:12.680 --> 1:06:15.440\n he probably would have told a mate, you know?\n\n1:06:15.440 --> 1:06:20.960\n And so these secrets could not be kept by any scientist that I know and certainly not\n\n1:06:20.960 --> 1:06:23.000\n collaborative scientists, which would be needed.\n\n1:06:23.000 --> 1:06:26.080\n You would need all sorts of scientific teams.\n\n1:06:26.080 --> 1:06:34.360\n So between the pathetic power of any world's military compared to any civilization capable\n\n1:06:34.360 --> 1:06:41.600\n of traveling and our absolute inability to keep secrets, absolutely not.\n\n1:06:41.600 --> 1:06:46.320\n I will bet everything that we have not been visited because we are too pathetic to hold\n\n1:06:46.320 --> 1:06:47.320\n that truth.\n\n1:06:47.320 --> 1:06:56.160\n If we're just making like a $10 bet, the possibility here that the main alien, say there exists\n\n1:06:56.160 --> 1:07:02.560\n one alien civil, other intelligent alien civilization in the galaxy.\n\n1:07:02.560 --> 1:07:09.840\n To me, if they visit Earth, what's going to visit Earth is like the crappy, like the really\n\n1:07:09.840 --> 1:07:17.640\n crappy, short straw, like, like this, this like really dumb thing that's, I don't know,\n\n1:07:17.640 --> 1:07:20.680\n like the early game boys or something like, there's a cartoon about this.\n\n1:07:20.680 --> 1:07:26.520\n There's an alien that gets sent to Earth, Commander Spiff or something, and it's kind\n\n1:07:26.520 --> 1:07:29.600\n of a punishment or something, but that's not possible.\n\n1:07:29.600 --> 1:07:34.040\n That's the thing because interstellar distances are so hard to, to cross.\n\n1:07:34.040 --> 1:07:35.040\n You have to do it on purpose.\n\n1:07:35.040 --> 1:07:36.040\n You have to do on purpose.\n\n1:07:36.040 --> 1:07:40.040\n It has to be a big, big deal, and we know this because yes, you're right.\n\n1:07:40.040 --> 1:07:43.640\n We don't know enough about galactic biology.\n\n1:07:43.640 --> 1:07:47.960\n We don't know what the universal rules of biology or biochemistry are because we only\n\n1:07:47.960 --> 1:07:53.560\n have the Earth, but we do know that the laws of physics are universal.\n\n1:07:53.560 --> 1:07:57.940\n We can predict behavior in the universe and then see it happen based on these laws of\n\n1:07:57.940 --> 1:07:59.100\n physics.\n\n1:07:59.100 --> 1:08:01.900\n We know that the laws of chemistry are universal.\n\n1:08:01.900 --> 1:08:05.240\n We know the periodic table is all they have to choose from.\n\n1:08:05.240 --> 1:08:11.000\n So yes, they may be some sort of unimaginable intelligence, but they still have to use the\n\n1:08:11.000 --> 1:08:13.960\n same periodic table that we have access to.\n\n1:08:13.960 --> 1:08:18.120\n They still have a finite number of molecules they can do things with.\n\n1:08:18.120 --> 1:08:22.700\n So they still have to use the resources around them, the stars around them, the universe\n\n1:08:22.700 --> 1:08:26.640\n around them, and we know how much energy is in these places.\n\n1:08:26.640 --> 1:08:32.480\n And so yes, they may be very capable, capable beyond our wildest dreams, but they're still\n\n1:08:32.480 --> 1:08:35.400\n in the same universe, and we know a lot of those rules.\n\n1:08:35.400 --> 1:08:37.120\n We're not completely blind.\n\n1:08:37.120 --> 1:08:43.240\n But there's a colleague of yours at Harvard, Kamran Vafa, he's a theoretical physicist.\n\n1:08:43.240 --> 1:08:45.240\n I don't know if you know him.\n\n1:08:45.240 --> 1:08:48.240\n I've only joined Harvard about six months ago.\n\n1:08:48.240 --> 1:08:49.240\n Okay.\n\n1:08:49.240 --> 1:08:52.860\n It's time to meet all the theoretical physicists.\n\n1:08:52.860 --> 1:09:01.280\n So he's a string theorist, but his idea is that aliens that are sophisticated enough\n\n1:09:01.280 --> 1:09:05.840\n to travel interstellar like those kinds of distances will figure out actually ways to\n\n1:09:05.840 --> 1:09:11.160\n hack the fabric of the universe enough to have fun in other ways, like this universe\n\n1:09:11.160 --> 1:09:12.160\n is too boring.\n\n1:09:12.160 --> 1:09:17.740\n Like you would figure out ways to create other universes, like you go outside the physics\n\n1:09:17.740 --> 1:09:19.380\n as we know it.\n\n1:09:19.380 --> 1:09:23.440\n So the reason we don't see aliens visiting us all over the place is they're having fun\n\n1:09:23.440 --> 1:09:24.440\n elsewhere.\n\n1:09:24.440 --> 1:09:26.060\n This is like way too boring.\n\n1:09:26.060 --> 1:09:32.080\n We humans think this is fun, but it's actually mostly empty space that no fun is happening.\n\n1:09:32.080 --> 1:09:35.800\n There's no fun in visiting Earth for a super advanced civilization.\n\n1:09:35.800 --> 1:09:42.040\n So he thinks like if alien civilizations are out there, they found outside of our current\n\n1:09:42.040 --> 1:09:47.680\n standard models of physics ways of having fun that don't involve us.\n\n1:09:47.680 --> 1:09:52.540\n That's probably true, but even the notion of visiting, that's so literally pedestrian.\n\n1:09:52.540 --> 1:09:55.800\n Of course we want to go there because going there is the only thing we know.\n\n1:09:55.800 --> 1:09:58.480\n We see a thing we want, we want to go there and get it.\n\n1:09:58.480 --> 1:10:03.600\n But that is probably something they've no longer gotten need for.\n\n1:10:03.600 --> 1:10:08.080\n I specifically don't particularly want to go to space.\n\n1:10:08.080 --> 1:10:09.080\n Sounds awful.\n\n1:10:09.080 --> 1:10:13.960\n None of the things I like are going to be there.\n\n1:10:13.960 --> 1:10:17.880\n My whole work is my whole career is finding life and understanding the universe.\n\n1:10:17.880 --> 1:10:23.840\n So I care a lot, but I care about knowing about it and I feel no need to go there to\n\n1:10:23.840 --> 1:10:25.040\n learn about it.\n\n1:10:25.040 --> 1:10:30.360\n And I think as we develop better tools, hopefully people will feel less and less a need to go\n\n1:10:30.360 --> 1:10:33.120\n everywhere that we know about.\n\n1:10:33.120 --> 1:10:38.460\n And I would expect any alien civilization worth the salt have developed observation\n\n1:10:38.460 --> 1:10:44.600\n tools and tools that allow them to understand the universe around them and beyond without\n\n1:10:44.600 --> 1:10:46.160\n having to go there.\n\n1:10:46.160 --> 1:10:48.120\n This going is so wasteful.\n\n1:10:48.120 --> 1:10:49.120\n Yeah.\n\n1:10:49.120 --> 1:10:53.320\n So more focused on the knowledge and learning versus the colonization, like the conquering\n\n1:10:53.320 --> 1:10:55.280\n and all those kinds of things.\n\n1:10:55.280 --> 1:10:57.480\n That's beneath them.\n\n1:10:57.480 --> 1:10:58.480\n That's beneath them.\n\n1:10:58.480 --> 1:11:04.160\n I mean, that said, do you think there's in your hopeful search for life through phosphine\n\n1:11:04.160 --> 1:11:11.080\n and other gases, do you think there's other alien civilizations out there?\n\n1:11:11.080 --> 1:11:14.040\n First do you think there's other life out there?\n\n1:11:14.040 --> 1:11:17.040\n First do you think there's life in the solar system?\n\n1:11:17.040 --> 1:11:22.080\n Second do you think there's life in the galaxy?\n\n1:11:22.080 --> 1:11:26.560\n And a third, do you think there's intelligent life in the solar system or the galaxy outside\n\n1:11:26.560 --> 1:11:28.000\n of earth?\n\n1:11:28.000 --> 1:11:30.280\n So intelligent life, I have no idea.\n\n1:11:30.280 --> 1:11:35.440\n It seems deeply unlikely possible, but I'm not even sure if it's plausible.\n\n1:11:35.440 --> 1:11:38.880\n So that's the special thing to you about earth is somehow intelligent life came to me.\n\n1:11:38.880 --> 1:11:39.880\n Yes.\n\n1:11:39.880 --> 1:11:43.800\n And it's only, you know, very briefly, probably extremely briefly.\n\n1:11:43.800 --> 1:11:48.640\n Oh, you mean like it's always going to be like, we're going to destroy ourselves.\n\n1:11:48.640 --> 1:11:49.640\n Exactly.\n\n1:11:49.640 --> 1:11:50.640\n Oh boy.\n\n1:11:50.640 --> 1:11:54.400\n We're going to continue on earth happily, probably more happily.\n\n1:11:54.400 --> 1:11:56.960\n So the trees and the dolphins will be here, I'm telling you.\n\n1:11:56.960 --> 1:12:02.320\n And the cockroaches and the incredible fungi, you know, they'll be fine.\n\n1:12:02.320 --> 1:12:08.120\n So life on earth will be fine, was fine before us and will be fine after us.\n\n1:12:08.120 --> 1:12:12.160\n So I'm not that worried about intelligent life, but I think it is unlikely, even on\n\n1:12:12.160 --> 1:12:16.400\n earth is unlikely out of, what is it, five billion species across the history of the\n\n1:12:16.400 --> 1:12:17.400\n earth.\n\n1:12:17.400 --> 1:12:18.400\n Yes.\n\n1:12:18.400 --> 1:12:24.500\n For an intelligent one and for a blink of an eye, possibly not much longer than that.\n\n1:12:24.500 --> 1:12:31.640\n So I wouldn't bet on that at all, though I would love it, of course, you know, I wanted\n\n1:12:31.640 --> 1:12:34.680\n to find aliens since I was a little girl.\n\n1:12:34.680 --> 1:12:40.900\n And so of course I initially wanted to find ones that I could be friends with and I've\n\n1:12:40.900 --> 1:12:44.280\n had to let go of that dream because it's so deeply implausible.\n\n1:12:44.280 --> 1:12:47.680\n But see the nice, and sorry to interrupt, but the nice thing about intelligent alien\n\n1:12:47.680 --> 1:12:52.480\n civilizations, they may have more biosignatures than nonintelligent ones.\n\n1:12:52.480 --> 1:12:56.320\n So they might be easier to detect, that would be the hope.\n\n1:12:56.320 --> 1:12:58.680\n On earth that's not the case, but it could be the case elsewhere.\n\n1:12:58.680 --> 1:13:00.480\n Oh, it's not the case on earth.\n\n1:13:00.480 --> 1:13:06.000\n Most of the biosignatures we have on earth are created by quite simple life.\n\n1:13:06.000 --> 1:13:11.200\n If you don't count pollution, pollution is all, all us baby.\n\n1:13:11.200 --> 1:13:17.080\n So you don't see polluting gases as a possible, like.\n\n1:13:17.080 --> 1:13:18.560\n I look for polluting gases.\n\n1:13:18.560 --> 1:13:20.640\n I would love to find polluting gases.\n\n1:13:20.640 --> 1:13:26.520\n Well, you know, I'd be worried for them, of course, the same way I, I think about my alien\n\n1:13:26.520 --> 1:13:30.720\n colleagues all the time looking at us and I'm sure they worry about our pollutions,\n\n1:13:30.720 --> 1:13:38.120\n but it would be a really good, robust, unambiguous sign of life if we found complex pollutants.\n\n1:13:38.120 --> 1:13:39.440\n So I look for those too.\n\n1:13:39.440 --> 1:13:41.080\n I just don't have any hope of finding them.\n\n1:13:41.080 --> 1:13:47.800\n I think intelligent life in the galaxy at the same time that we're looking is deeply\n\n1:13:47.800 --> 1:13:56.160\n implausible, but life I think is inevitable and if it is inevitable, it is common.\n\n1:13:56.160 --> 1:14:00.080\n So I think there'll be life everywhere in the galaxy.\n\n1:14:00.080 --> 1:14:04.680\n Now how common that life is, I think will depend a lot on whether there's life in the\n\n1:14:04.680 --> 1:14:07.080\n solar system beyond earth.\n\n1:14:07.080 --> 1:14:13.220\n So I'll adjust my expectations very much based on there being life in the solar system.\n\n1:14:13.220 --> 1:14:19.380\n If there's life in the Venusian clouds, if there's life in the, if there are biosignals\n\n1:14:19.380 --> 1:14:23.200\n coming out of the plumes of Enceladus, if there's life on Titan.\n\n1:14:23.200 --> 1:14:24.200\n Yeah, that's right.\n\n1:14:24.200 --> 1:14:25.200\n Yeah, yeah.\n\n1:14:25.200 --> 1:14:26.200\n Plumes of Enceladus.\n\n1:14:26.200 --> 1:14:27.880\n That's the, that's the Saturn one.\n\n1:14:27.880 --> 1:14:30.320\n It's the moon that has the geysers that come out.\n\n1:14:30.320 --> 1:14:34.160\n And so you can't see the, under the subterranean oceans, but.\n\n1:14:34.160 --> 1:14:36.520\n It's supposed, so it would be in the atmosphere.\n\n1:14:36.520 --> 1:14:39.000\n I was going to ask you about that one.\n\n1:14:39.000 --> 1:14:40.000\n Have you looked at that?\n\n1:14:40.000 --> 1:14:49.360\n Have you, is that a hope for you to use the tools you're using with RASCAL and other ways\n\n1:14:49.360 --> 1:14:56.400\n for detecting the 16,000 molecules that might be biosignatures to look at Enceladus?\n\n1:14:56.400 --> 1:14:59.920\n Yes, that's absolutely the plan.\n\n1:14:59.920 --> 1:15:01.560\n What's the limiting factor currently?\n\n1:15:01.560 --> 1:15:06.760\n Is it the quality of the telescopes, what's the quality of the data?\n\n1:15:06.760 --> 1:15:12.560\n Yeah, the quality of the data, the observational data, and also the quality of RASCAL and other\n\n1:15:12.560 --> 1:15:13.560\n associated things.\n\n1:15:13.560 --> 1:15:17.680\n So we're missing a lot of fundamental data to interpret the data that we get and we don't\n\n1:15:17.680 --> 1:15:19.240\n have good enough data.\n\n1:15:19.240 --> 1:15:24.760\n But hopefully we will, in the coming decades, we'll get some information on Titan.\n\n1:15:24.760 --> 1:15:27.880\n We have Dragonfly going over.\n\n1:15:27.880 --> 1:15:31.400\n We'll get the plumes of Enceladus.\n\n1:15:31.400 --> 1:15:34.040\n We will look at the clouds of Venus and there's other places.\n\n1:15:34.040 --> 1:15:41.740\n And so if we find any life or any sign of life ever, like on Mars, then I'll adjust\n\n1:15:41.740 --> 1:15:48.520\n my calculations and I'll say life is not just inevitable and common, but extremely common.\n\n1:15:48.520 --> 1:15:52.720\n Because all of these places we've mentioned, the subterranean oceans on Enceladus, the\n\n1:15:52.720 --> 1:15:58.240\n methane oceans of Titan, the clouds of Venus, the acidic clouds of Venus, these are places\n\n1:15:58.240 --> 1:16:02.280\n that are very different from the places where we find life on Earth.\n\n1:16:02.280 --> 1:16:04.200\n Even the most extreme places.\n\n1:16:04.200 --> 1:16:10.120\n And so if life can originate in all of these completely different habitats, then life is\n\n1:16:10.120 --> 1:16:14.860\n even more resourceful than we thought, which means it's everywhere.\n\n1:16:14.860 --> 1:16:17.200\n That's really exciting if it's everywhere.\n\n1:16:17.200 --> 1:16:21.320\n If there's life on just one of the moons, if it's on Mars.\n\n1:16:21.320 --> 1:16:22.320\n Anywhere.\n\n1:16:22.320 --> 1:16:27.080\n Anywhere in the solar system and I will bet everything I own that every solar system,\n\n1:16:27.080 --> 1:16:31.360\n every planetary system has a potential for habitability.\n\n1:16:31.360 --> 1:16:35.440\n Because even if they don't have a habitable planet, they'll have moons around other giant\n\n1:16:35.440 --> 1:16:39.280\n planets and there'll be so much life.\n\n1:16:39.280 --> 1:16:44.960\n So for me, that's the only thing to figure out now, whether life is inevitable and quite\n\n1:16:44.960 --> 1:16:51.860\n common throughout the galaxy or everywhere, but it's somewhere between those two.\n\n1:16:51.860 --> 1:16:58.480\n In life, I make no bets and if I had to bet, I would be against.\n\n1:16:58.480 --> 1:17:05.280\n To me, like two discoveries in the 21st century would change everything.\n\n1:17:05.280 --> 1:17:12.800\n One is, and maybe I'm biased, but one is a discovery of life in the solar system.\n\n1:17:12.800 --> 1:17:18.600\n I feel like that would change our whole conception of how unique we are in the universe.\n\n1:17:18.600 --> 1:17:23.560\n I think I'm much more eager than you are to jump from basic life to intelligent life.\n\n1:17:23.560 --> 1:17:31.880\n I feel like if there's life everywhere, like the odds are, there has, like we cannot, like\n\n1:17:31.880 --> 1:17:34.320\n you have, oh, I see.\n\n1:17:34.320 --> 1:17:37.880\n You're saying there could have been many intelligent civilizations out there, but they just keep\n\n1:17:37.880 --> 1:17:38.880\n dying out.\n\n1:17:38.880 --> 1:17:39.880\n It's like little.\n\n1:17:39.880 --> 1:17:40.880\n Yeah.\n\n1:17:40.880 --> 1:17:41.880\n I was detecting them, you know, ships in the night.\n\n1:17:41.880 --> 1:17:42.880\n Ships in the night.\n\n1:17:42.880 --> 1:17:45.640\n No, that's ultra sad.\n\n1:17:45.640 --> 1:17:46.640\n Just like.\n\n1:17:46.640 --> 1:17:47.640\n Is it sad?\n\n1:17:47.640 --> 1:17:50.400\n The earth is not better for having us.\n\n1:17:50.400 --> 1:17:53.640\n Is it, we, it doesn't owe us anything.\n\n1:17:53.640 --> 1:17:56.120\n Would you be sad to find alien giraffes?\n\n1:17:56.120 --> 1:17:59.240\n Would you be disappointed if you found alien giraffes?\n\n1:17:59.240 --> 1:18:00.240\n Because I would not.\n\n1:18:00.240 --> 1:18:04.280\n No, well, giraffes, first of all, they look goofy with their necks and everything, but.\n\n1:18:04.280 --> 1:18:05.720\n We do not shit on giraffes.\n\n1:18:05.720 --> 1:18:06.720\n Okay.\n\n1:18:06.720 --> 1:18:09.240\n Giraffes are wondrous animals, are deeply understudied.\n\n1:18:09.240 --> 1:18:12.840\n We still know so little about them because no one does PhDs in giraffes.\n\n1:18:12.840 --> 1:18:17.680\n I am disappointed I made a PhD in phosphine when people aren't doing PhDs in giraffes.\n\n1:18:17.680 --> 1:18:19.440\n We do not know enough about giraffes.\n\n1:18:19.440 --> 1:18:22.680\n I think it was like Ricky Gervais that did a whole, like a long thing.\n\n1:18:22.680 --> 1:18:25.080\n You can't trust Ricky Gervais to talk about giraffes.\n\n1:18:25.080 --> 1:18:26.560\n That is not his expertise.\n\n1:18:26.560 --> 1:18:27.560\n Yeah.\n\n1:18:27.560 --> 1:18:31.600\n But it's a stupid necks, it doesn't make any sense.\n\n1:18:31.600 --> 1:18:32.600\n I mean, that's fine.\n\n1:18:32.600 --> 1:18:36.880\n Giraffes are very resourceful animals who do incredible things and can kick a lion in\n\n1:18:36.880 --> 1:18:37.880\n the face.\n\n1:18:37.880 --> 1:18:38.880\n Why don't you climb the tree?\n\n1:18:38.880 --> 1:18:39.880\n Why don't you climb the tree?\n\n1:18:39.880 --> 1:18:42.480\n You don't need to grow through the lengthy evolutionary process.\n\n1:18:42.480 --> 1:18:43.480\n You're shitting on giraffes.\n\n1:18:43.480 --> 1:18:44.480\n Okay.\n\n1:18:44.480 --> 1:18:45.480\n Giraffes are wondrous animals.\n\n1:18:45.480 --> 1:18:46.480\n Fine.\n\n1:18:46.480 --> 1:18:47.480\n I would very appreciate it.\n\n1:18:47.480 --> 1:18:48.480\n Take it back.\n\n1:18:48.480 --> 1:18:49.480\n I take it back.\n\n1:18:49.480 --> 1:18:50.480\n I apologize.\n\n1:18:50.480 --> 1:18:54.280\n I trust your expertise on this.\n\n1:18:54.280 --> 1:19:01.560\n The thing that makes humans really fascinating, and I think the earth, but I'm a human, is\n\n1:19:01.560 --> 1:19:09.400\n we create things that are, yes, there's all the ugliness in the world.\n\n1:19:09.400 --> 1:19:16.200\n There's all the, on the biological, on the chemical level, there's the pollution, but\n\n1:19:16.200 --> 1:19:18.500\n we create beauty.\n\n1:19:18.500 --> 1:19:23.840\n If you even from a physics perspective, look at symmetry as somehow capturing beauty, the\n\n1:19:23.840 --> 1:19:28.320\n breaking of symmetries, stuff grounded in all the different definitions of symmetry,\n\n1:19:28.320 --> 1:19:31.540\n we're good at creating things.\n\n1:19:31.540 --> 1:19:35.020\n So are spiders.\n\n1:19:35.020 --> 1:19:36.020\n But not giraffes.\n\n1:19:36.020 --> 1:19:37.020\n Okay.\n\n1:19:37.020 --> 1:19:38.020\n But yes, this is a...\n\n1:19:38.020 --> 1:19:39.020\n Spiders.\n\n1:19:39.020 --> 1:19:43.360\n Spiders that create little bubbles of air so they can breathe underwater, they can literally\n\n1:19:43.360 --> 1:19:44.360\n scuba dive.\n\n1:19:44.360 --> 1:19:48.440\n There are spiders that can create parachutes so they can glide.\n\n1:19:48.440 --> 1:19:51.240\n And talk about symmetry, look what spiders can do.\n\n1:19:51.240 --> 1:19:56.680\n And I just thought of spiders, but if I was an alien species coming to earth, there'll\n\n1:19:56.680 --> 1:20:05.600\n be plenty to wonder, and we would just be one of the things, clunky, naked monkey.\n\n1:20:05.600 --> 1:20:07.680\n The ants might be even more fascinating.\n\n1:20:07.680 --> 1:20:08.680\n The ants.\n\n1:20:08.680 --> 1:20:14.680\n The ants can figure out exactly through some emergent consciousness what the maximum distance\n\n1:20:14.680 --> 1:20:22.000\n between their trash, their babies, and their food is just from without any of them knowing\n\n1:20:22.000 --> 1:20:23.000\n how to do this.\n\n1:20:23.000 --> 1:20:24.720\n And collectively they've learned how to do this.\n\n1:20:24.720 --> 1:20:27.200\n If I was an alien species, I'll be looking at that.\n\n1:20:27.200 --> 1:20:29.200\n Well, so that was the other thing I was going to mention.\n\n1:20:29.200 --> 1:20:35.840\n The second thing is I tend to believe we can engineer consciousness, but at the basic level,\n\n1:20:35.840 --> 1:20:42.600\n in the source of consciousness, because if consciousness is unique to humans, and if\n\n1:20:42.600 --> 1:20:47.800\n we can engineer it, that gives me hope that it could be present elsewhere in the universe.\n\n1:20:47.800 --> 1:20:53.600\n That's the other thing that makes, it's an open question, that makes humans perhaps special\n\n1:20:53.600 --> 1:21:00.260\n is not maybe the presence of consciousness, but somehow a presence of elevated consciousness.\n\n1:21:00.260 --> 1:21:04.800\n It does, again, maybe human centric, but it feels like we're more conscious than giraffes,\n\n1:21:04.800 --> 1:21:06.360\n for example, and spiders.\n\n1:21:06.360 --> 1:21:08.960\n Yes, I won't deny that.\n\n1:21:08.960 --> 1:21:10.440\n There is something special about humans.\n\n1:21:10.440 --> 1:21:12.440\n They're my favorite species.\n\n1:21:12.440 --> 1:21:14.160\n They are.\n\n1:21:14.160 --> 1:21:16.080\n They are.\n\n1:21:16.080 --> 1:21:21.720\n Some of my best friends are humans.\n\n1:21:21.720 --> 1:21:24.240\n I think highly of humans.\n\n1:21:24.240 --> 1:21:25.240\n It's great.\n\n1:21:25.240 --> 1:21:31.160\n I just don't have great hope for our longevity, and specifically I don't have great hope given\n\n1:21:31.160 --> 1:21:35.520\n that we're the only species that are five billion that did this cool consciousness trick.\n\n1:21:35.520 --> 1:21:42.240\n I just, I don't want to bet on finding a kinship elsewhere.\n\n1:21:42.240 --> 1:21:44.040\n That's quite interesting to think about.\n\n1:21:44.040 --> 1:21:51.720\n I don't think I've even considered that possibility that there would be life in the solar system,\n\n1:21:51.720 --> 1:21:57.520\n so that indicates that very possibly life is literally everywhere.\n\n1:21:57.520 --> 1:21:59.600\n Everywhere it can happen, it does.\n\n1:21:59.600 --> 1:22:06.200\n And especially what we're discovering with the exoplanets now, how numerous they are,\n\n1:22:06.200 --> 1:22:12.200\n or earthlike habitable, quote unquote, planets, they're everywhere.\n\n1:22:12.200 --> 1:22:16.620\n The most common type of planet is rocky, it seems.\n\n1:22:16.620 --> 1:22:21.880\n But I didn't consider the possibility that life is literally everywhere, and yet intelligent\n\n1:22:21.880 --> 1:22:30.600\n life is nowhere long enough to communicate with each other, to form little clusters of\n\n1:22:30.600 --> 1:22:35.680\n civilizations that expand beyond the solar system and so on.\n\n1:22:35.680 --> 1:22:43.800\n Man, maybe becoming a multi planetary species is a less likely pursuit than we imagine.\n\n1:22:43.800 --> 1:22:44.800\n I agree.\n\n1:22:44.800 --> 1:22:49.040\n But one of the things that makes humans beautiful is we hope.\n\n1:22:49.040 --> 1:22:56.620\n What I hope for humanity, and one of the things I hope for is that we become less obsessed\n\n1:22:56.620 --> 1:23:03.360\n with conquering, and we become less obsessed with spreading ourselves.\n\n1:23:03.360 --> 1:23:08.880\n I hope that we transcend that, that we're happy with the universe without having to\n\n1:23:08.880 --> 1:23:11.240\n go and take it.\n\n1:23:11.240 --> 1:23:18.060\n So you can hope for the species without hoping for a multi planetary existence.\n\n1:23:18.060 --> 1:23:26.840\n That is only, I think, the drive of our most primitive instincts to go and take, to go\n\n1:23:26.840 --> 1:23:28.240\n and plant a flag somewhere.\n\n1:23:28.240 --> 1:23:31.060\n We love planting a flag somewhere.\n\n1:23:31.060 --> 1:23:35.340\n And maybe we could overcome that minor drive.\n\n1:23:35.340 --> 1:23:41.480\n And once we do, the AI systems we build will destroy us because we're too peaceful, and\n\n1:23:41.480 --> 1:23:43.720\n they will go and conquer and plant the flags.\n\n1:23:43.720 --> 1:23:44.720\n Best of luck to them.\n\n1:23:44.720 --> 1:23:50.880\n Rock roaches will be happy to keep to the business as they always have.\n\n1:23:50.880 --> 1:23:58.240\n I tend to believe that robots can have the same elegance and consciousness and all the\n\n1:23:58.240 --> 1:24:02.760\n qualities of kindness and love and hope and fear that humans have.\n\n1:24:02.760 --> 1:24:05.160\n In principle, they could, yes.\n\n1:24:05.160 --> 1:24:10.700\n I don't really trust the people who make them.\n\n1:24:10.700 --> 1:24:13.040\n This is about the giraffe comment, isn't it?\n\n1:24:13.040 --> 1:24:18.440\n I haven't forgiven you for shitting on giraffes, whatever they've done to you.\n\n1:24:18.440 --> 1:24:22.480\n Just as a small tangent, your master's thesis is also fascinating.\n\n1:24:22.480 --> 1:24:25.040\n Maybe we could talk about it for just a little bit.\n\n1:24:25.040 --> 1:24:30.080\n It's titled Influence of a Star's Evolution on its Planetary System.\n\n1:24:30.080 --> 1:24:35.240\n So this interplay between a star and a planet, is there something interesting you could say\n\n1:24:35.240 --> 1:24:42.400\n about what you've learned about this journey that a star takes and the planets around it?\n\n1:24:42.400 --> 1:24:49.040\n Well, when I was younger and I was told what would happen ultimately to the Earth as the\n\n1:24:49.040 --> 1:24:57.680\n sun expands towards a red giant and mercury would just like fall in and then Venus fall\n\n1:24:57.680 --> 1:24:59.840\n in and the sun doesn't care.\n\n1:24:59.840 --> 1:25:05.720\n And it just seemed so, I felt so small.\n\n1:25:05.720 --> 1:25:10.480\n I felt like the Earth and everything on it, it's just the universe doesn't care.\n\n1:25:10.480 --> 1:25:12.400\n Even our sun doesn't care.\n\n1:25:12.400 --> 1:25:17.800\n And I think I felt like our sun should feel some sort of responsibility for its planets.\n\n1:25:17.800 --> 1:25:21.280\n And it just felt like such a violent and neglectful parent.\n\n1:25:21.280 --> 1:25:23.360\n It's like a parent eating its own children.\n\n1:25:23.360 --> 1:25:24.360\n It's horrible.\n\n1:25:24.360 --> 1:25:31.000\n It's just a horrible notion, but it made me think, what if there's some sort of generation?\n\n1:25:31.000 --> 1:25:36.360\n And so at the time when I was doing my master's, there was a notion of the white dwarf cemetery,\n\n1:25:36.360 --> 1:25:41.400\n which is this idea that when stars become white dwarfs, that death is so horrible that\n\n1:25:41.400 --> 1:25:45.720\n planets, potentially habitable planets that could have been habitable before, they're\n\n1:25:45.720 --> 1:25:46.720\n now gone.\n\n1:25:46.720 --> 1:25:48.720\n There's no chance for life.\n\n1:25:48.720 --> 1:25:52.320\n But then I thought, what if life returns?\n\n1:25:52.320 --> 1:25:55.280\n Now it's a white dwarf, it's calmed down, it's not going to go anywhere.\n\n1:25:55.280 --> 1:25:59.680\n White dwarfs are very stable across like universal timescales.\n\n1:25:59.680 --> 1:26:05.400\n And so could you have planets around the white dwarf that could themselves get life again?\n\n1:26:05.400 --> 1:26:07.960\n No, life doesn't care.\n\n1:26:07.960 --> 1:26:14.400\n And so my work was basically killing dozens of planets, thousands of times.\n\n1:26:14.400 --> 1:26:18.400\n I just ran thousands and thousands of end body simulations.\n\n1:26:18.400 --> 1:26:19.720\n Oh, you simulated this?\n\n1:26:19.720 --> 1:26:20.720\n Yeah.\n\n1:26:20.720 --> 1:26:26.920\n So I simulated the star growing and just eating all these planets up and just absolute chaos.\n\n1:26:26.920 --> 1:26:29.960\n The orbits of the planets would change as the star loses mass.\n\n1:26:29.960 --> 1:26:34.800\n So you would have like Jupiter planets just crashing into the other planets, throwing\n\n1:26:34.800 --> 1:26:36.480\n them into the sun early.\n\n1:26:36.480 --> 1:26:40.720\n It was terrifying to watch these simulations.\n\n1:26:40.720 --> 1:26:44.680\n It was absolute carnage.\n\n1:26:44.680 --> 1:26:50.400\n But if you run thousands of these simulations, some systems find new balance ways of staying\n\n1:26:50.400 --> 1:26:52.000\n alive.\n\n1:26:52.000 --> 1:26:59.640\n Some systems post star death find stable orbits again for billions of years, more than enough\n\n1:26:59.640 --> 1:27:01.840\n for life to originate again.\n\n1:27:01.840 --> 1:27:09.480\n And so that was my idea during that time that Thesis was trying to explore this notion of\n\n1:27:09.480 --> 1:27:12.280\n life coming back.\n\n1:27:12.280 --> 1:27:18.160\n And this idea of the universe doesn't care if you're here or not, and it will go about\n\n1:27:18.160 --> 1:27:19.160\n its business.\n\n1:27:19.160 --> 1:27:23.460\n Andromeda will crash into us and doesn't care.\n\n1:27:23.460 --> 1:27:25.880\n No one cares if you're alive in the universe.\n\n1:27:25.880 --> 1:27:31.080\n And so letting go of that preciousness of life, I found very useful at that stage of\n\n1:27:31.080 --> 1:27:32.080\n my career.\n\n1:27:32.080 --> 1:27:38.520\n And instead, I just thought, if life is inevitable, it doesn't matter that it came by four billion\n\n1:27:38.520 --> 1:27:39.520\n years ago.\n\n1:27:39.520 --> 1:27:41.760\n It can start again four billion years later.\n\n1:27:41.760 --> 1:27:44.200\n And maybe that is nice.\n\n1:27:44.200 --> 1:27:49.200\n Maybe that's where hope lies, the Phoenix rising everywhere.\n\n1:27:49.200 --> 1:27:56.240\n Planets being destroyed and created and we're here now and others will be more or less hereish\n\n1:27:56.240 --> 1:27:57.640\n billions of years later.\n\n1:27:57.640 --> 1:28:02.360\n So accepting the cycle of death and life and yeah.\n\n1:28:02.360 --> 1:28:03.360\n Not taking it personally.\n\n1:28:03.360 --> 1:28:05.000\n Not taking it personally.\n\n1:28:05.000 --> 1:28:06.480\n The sun doesn't owe us anything.\n\n1:28:06.480 --> 1:28:08.240\n It's not a bad parent.\n\n1:28:08.240 --> 1:28:10.360\n It's not a parent at all.\n\n1:28:10.360 --> 1:28:11.360\n Yeah.\n\n1:28:11.360 --> 1:28:18.600\n I was looking at the work of Freeman Dyson and seeing how this universe eventually will\n\n1:28:18.600 --> 1:28:22.760\n just be a bunch of supermassive black holes before they also evaporate.\n\n1:28:22.760 --> 1:28:24.680\n A bunch of tiny black holes too.\n\n1:28:24.680 --> 1:28:25.680\n Yeah.\n\n1:28:25.680 --> 1:28:26.680\n Absolute quiet.\n\n1:28:26.680 --> 1:28:30.920\n Everyone, all the black holes a little too far away from one another to even interact\n\n1:28:30.920 --> 1:28:34.640\n until it's just silence forever.\n\n1:28:34.640 --> 1:28:40.680\n But until then, many, many cycles of death and destruction and rebirth.\n\n1:28:40.680 --> 1:28:42.400\n And rebirth.\n\n1:28:42.400 --> 1:28:44.960\n You kept bringing up sort of coding stuff up.\n\n1:28:44.960 --> 1:28:47.000\n I wanted to ask two things.\n\n1:28:47.000 --> 1:28:52.280\n First of all, what programming language do you like?\n\n1:28:52.280 --> 1:29:05.520\n And also what, because you're as a computational quantum astrochemist, no, yes, that's right.\n\n1:29:05.520 --> 1:29:11.480\n You're kind of, you could say you're actually understanding some exceptionally complicated\n\n1:29:11.480 --> 1:29:18.120\n things with one of the things you're using is the tools of computation of programming.\n\n1:29:18.120 --> 1:29:24.280\n Is there a device you can give to people, because I know quite a few that have not practiced\n\n1:29:24.280 --> 1:29:28.800\n that tool and have fallen in love with a particular science, whatever it's biology and chemistry\n\n1:29:28.800 --> 1:29:30.840\n and physics and so on.\n\n1:29:30.840 --> 1:29:37.080\n And if they were interested in learning to program and learning to use computation as\n\n1:29:37.080 --> 1:29:41.680\n a tool in their particular science, is there advice you can give on programming and also\n\n1:29:41.680 --> 1:29:48.200\n just maybe a comment on your own journey and the use of programming in your own life?\n\n1:29:48.200 --> 1:29:50.920\n Well, I'm a terrible programmer.\n\n1:29:50.920 --> 1:29:55.360\n A lot of scientists, their programming is bad because we never learned formal programming.\n\n1:29:55.360 --> 1:29:58.040\n We learned science, physics, chemistry.\n\n1:29:58.040 --> 1:30:03.040\n And then we were told, oh, you can, you have to get these equations modeled and run through\n\n1:30:03.040 --> 1:30:04.040\n a simulation.\n\n1:30:04.040 --> 1:30:07.500\n And you're like, oh, okay, so I'm going to learn how to code to do this.\n\n1:30:07.500 --> 1:30:12.040\n And you learn just as much as you need to run these simulations and no more.\n\n1:30:12.040 --> 1:30:15.160\n So they're rarely optimized and they're really clunky.\n\n1:30:15.160 --> 1:30:17.240\n Six months later, you can't read your own code.\n\n1:30:17.240 --> 1:30:19.360\n My variable names are extremely embarrassing.\n\n1:30:19.360 --> 1:30:26.880\n I still have error messages for different compilation errors that say things like, at\n\n1:30:26.880 --> 1:30:29.600\n least your dad loves you, Clara.\n\n1:30:29.600 --> 1:30:32.600\n You know, it doesn't help me at all.\n\n1:30:32.600 --> 1:30:36.680\n Just like you suck at coding, but there's other things in your life.\n\n1:30:36.680 --> 1:30:37.880\n So I'm a bad programmer.\n\n1:30:37.880 --> 1:30:41.240\n And so, you know, if that will give hope to anyone else who's a bad programmer, I can\n\n1:30:41.240 --> 1:30:44.360\n still do pretty impressive science.\n\n1:30:44.360 --> 1:30:48.880\n But I learned, I think I started learning MATLAB and Java when I was in college.\n\n1:30:48.880 --> 1:30:50.720\n It did me no good at all.\n\n1:30:50.720 --> 1:30:52.480\n It has not been particularly useful.\n\n1:30:52.480 --> 1:30:58.200\n I learned some Fortran that was very useful, even though it's really not a fun language\n\n1:30:58.200 --> 1:31:02.680\n because so much of legacy code is in Fortran.\n\n1:31:02.680 --> 1:31:08.240\n And so if you want to use other people's code who have now retired, Fortran will be nice.\n\n1:31:08.240 --> 1:31:10.160\n And then I used IDL to visualize.\n\n1:31:10.160 --> 1:31:14.960\n So that simulation and body simulation, those all Fortran and IDL.\n\n1:31:14.960 --> 1:31:19.520\n But thankfully, since I've left college, I've just learned Python like a normal person and\n\n1:31:19.520 --> 1:31:21.600\n that has been much nicer.\n\n1:31:21.600 --> 1:31:24.360\n So most of my code now is in Python.\n\n1:31:24.360 --> 1:31:26.840\n I should also make a few quick comments as well.\n\n1:31:26.840 --> 1:31:30.680\n So one is, you say you're sort of bad at programming.\n\n1:31:30.680 --> 1:31:36.880\n I've worked with a lot of excellent scientists that are quote unquote bad at programming.\n\n1:31:36.880 --> 1:31:37.880\n They're not.\n\n1:31:37.880 --> 1:31:38.880\n It gets the job done.\n\n1:31:38.880 --> 1:31:45.680\n In fact, there's a downside to sort of, especially getting a software engineering education.\n\n1:31:45.680 --> 1:31:50.520\n If I were to give advice, especially if you're doing a computer science degree and you're\n\n1:31:50.520 --> 1:31:58.280\n doing software engineering, is not to get lost in the optimization of the correct, there's\n\n1:31:58.280 --> 1:32:04.000\n an obsession, you could see it in like Stack Overflow, of the correct way to do things.\n\n1:32:04.000 --> 1:32:11.000\n And I think you can too easily get lost in constantly trying to optimize and do things\n\n1:32:11.000 --> 1:32:13.440\n the correct way when you actually never get done.\n\n1:32:13.440 --> 1:32:19.960\n The same thing happens, you have like communities of people obsessed with productivity and they\n\n1:32:19.960 --> 1:32:25.440\n keep researching productivity hacks and then they spend like 90% plus of their time figuring\n\n1:32:25.440 --> 1:32:29.560\n out how to do things productively and then never actually do anything.\n\n1:32:29.560 --> 1:32:34.320\n So there's a certain sense if you focus on the task that needs to be done, that's what\n\n1:32:34.320 --> 1:32:35.520\n programming is for.\n\n1:32:35.520 --> 1:32:43.760\n So not over optimizing, not thinking about variable names in the following sense.\n\n1:32:43.760 --> 1:32:47.440\n Sometimes you think, okay, I'm going to write code that's going to last for decades.\n\n1:32:47.440 --> 1:32:53.180\n In reality, your code, if it's well written or poorly written, will be very likely obsolete\n\n1:32:53.180 --> 1:32:54.760\n very quickly.\n\n1:32:54.760 --> 1:32:57.600\n The point is to get the job done really well.\n\n1:32:57.600 --> 1:33:02.320\n So there's a trade off there that you have to make sure to strike.\n\n1:33:02.320 --> 1:33:08.560\n I should also comment as a public service announcement or a request, if there's any\n\n1:33:08.560 --> 1:33:13.120\n world class Fortran or Cobalt programmers out there, I'm looking for them, I want to\n\n1:33:13.120 --> 1:33:14.120\n talk to you.\n\n1:33:14.120 --> 1:33:18.000\n That will not be me, I'm a terrible Fortran programmer.\n\n1:33:18.000 --> 1:33:23.480\n But it's fascinating because so much of the world in the past and still runs programming\n\n1:33:23.480 --> 1:33:26.400\n languages and there's no experts on it.\n\n1:33:26.400 --> 1:33:28.760\n They're all retiring.\n\n1:33:28.760 --> 1:33:33.480\n I disagree slightly in that I think because I can get the job done, I'm a programmer.\n\n1:33:33.480 --> 1:33:37.880\n But because no one else can look at my code and know how I got my job done, I'm a bad\n\n1:33:37.880 --> 1:33:38.880\n programmer.\n\n1:33:38.880 --> 1:33:39.880\n That's how I'm defining it.\n\n1:33:39.880 --> 1:33:40.880\n Including yourself.\n\n1:33:40.880 --> 1:33:44.920\n Including myself six months later, I'm working with a new student right now and she sent\n\n1:33:44.920 --> 1:33:52.720\n me some messages on Slack being like, what is this file that you've got with some functions\n\n1:33:52.720 --> 1:33:53.720\n that run?\n\n1:33:53.720 --> 1:33:59.840\n And I was like, this was from 2018, it wasn't that long ago and I can no longer remember\n\n1:33:59.840 --> 1:34:00.840\n what that code does.\n\n1:34:00.840 --> 1:34:06.480\n I'm going to spend now two days reading through my own code and trying to improve it.\n\n1:34:06.480 --> 1:34:08.520\n And I do think that's frustrating.\n\n1:34:08.520 --> 1:34:15.680\n And so I think my advice to any young people who want to get into astronomy or astrobiology\n\n1:34:15.680 --> 1:34:22.240\n or quantum chemistry is that I certainly find it much easier to teach the science concepts\n\n1:34:22.240 --> 1:34:25.840\n to a programmer than the programming to a scientist.\n\n1:34:25.840 --> 1:34:33.080\n And so I would much, much faster hire someone who knows programming but barely knows where\n\n1:34:33.080 --> 1:34:37.440\n space is than teach programming to an astronomer.\n\n1:34:37.440 --> 1:34:39.000\n Oh, that's fascinating.\n\n1:34:39.000 --> 1:34:40.000\n Yeah.\n\n1:34:40.000 --> 1:34:41.000\n Okay.\n\n1:34:41.000 --> 1:34:42.000\n This is true.\n\n1:34:42.000 --> 1:34:43.000\n I mean, yeah, there's some basics.\n\n1:34:43.000 --> 1:34:47.920\n I'm focusing too much on the silver lining because the people that write MATLAB code,\n\n1:34:47.920 --> 1:34:52.400\n yeah, single variable, single letter variable names, those kinds of things.\n\n1:34:52.400 --> 1:34:53.960\n And it's accessibility, right?\n\n1:34:53.960 --> 1:34:59.040\n It's I want my code to be open source and it is, it's on GitHub, anyone can download\n\n1:34:59.040 --> 1:35:00.040\n it.\n\n1:35:00.040 --> 1:35:04.160\n But is it really open source if it's written so cryptically, so poorly that no one can\n\n1:35:04.160 --> 1:35:06.240\n really use it to its full functionality?\n\n1:35:06.240 --> 1:35:11.560\n Have I really published my work and that weighs on me?\n\n1:35:11.560 --> 1:35:16.800\n I feel guilty for my own inadequacies as a programmer.\n\n1:35:16.800 --> 1:35:18.040\n But you can only do so much.\n\n1:35:18.040 --> 1:35:20.440\n I've already learned quantum chemistry and astrophysics.\n\n1:35:20.440 --> 1:35:28.000\n So yeah, I mean, there's all kinds of ways to contribute to the world.\n\n1:35:28.000 --> 1:35:32.880\n One of them is publication, but publishing code is a fascinating way to contribute to\n\n1:35:32.880 --> 1:35:38.960\n the world, even if it's very small, very basic element, great code.\n\n1:35:38.960 --> 1:35:44.760\n I guess I was also kind of criticizing the software engineering process versus like,\n\n1:35:44.760 --> 1:35:50.240\n which is a good thing to do is code that's readable, almost like without documentation,\n\n1:35:50.240 --> 1:35:52.760\n it's readable, it's understandable.\n\n1:35:52.760 --> 1:35:55.880\n The variable names, the structure, all those kinds of things.\n\n1:35:55.880 --> 1:35:56.880\n That's the dream.\n\n1:35:56.880 --> 1:35:57.880\n That's the dream.\n\n1:35:57.880 --> 1:35:58.880\n This is a dumb question.\n\n1:35:58.880 --> 1:35:59.880\n What do you, all right.\n\n1:35:59.880 --> 1:36:00.880\n No, no, tell me a dumb question.\n\n1:36:00.880 --> 1:36:01.880\n I want to hear it.\n\n1:36:01.880 --> 1:36:02.880\n Okay.\n\n1:36:02.880 --> 1:36:08.160\n I mean, okay, this is the question about beauty.\n\n1:36:08.160 --> 1:36:09.160\n It's way too general.\n\n1:36:09.160 --> 1:36:10.160\n It's very impossible.\n\n1:36:10.160 --> 1:36:12.240\n It's like asking, what's your favorite band?\n\n1:36:12.240 --> 1:36:13.240\n What's your favorite music band?\n\n1:36:13.240 --> 1:36:15.040\n Oh, I thought you meant wavelength band.\n\n1:36:15.040 --> 1:36:17.520\n I was like, I definitely have favorite wavelength bands.\n\n1:36:17.520 --> 1:36:18.520\n Absolutely.\n\n1:36:18.520 --> 1:36:21.680\n Well, it's hard to narrow it down, huh?\n\n1:36:21.680 --> 1:36:22.680\n Okay.\n\n1:36:22.680 --> 1:36:25.360\n What do you use the most beautiful idea in science?\n\n1:36:25.360 --> 1:36:27.160\n It's not a dumb question.\n\n1:36:27.160 --> 1:36:31.240\n Do you want to try the question again proudly?\n\n1:36:31.240 --> 1:36:32.760\n Okay.\n\n1:36:32.760 --> 1:36:35.240\n I have a really good question to ask you.\n\n1:36:35.240 --> 1:36:36.240\n Okay.\n\n1:36:36.240 --> 1:36:37.240\n Don't oversell it.\n\n1:36:37.240 --> 1:36:42.240\n I've got an okay question to ask you, you know?\n\n1:36:42.240 --> 1:36:49.760\n What do you use the most beautiful idea in science, something you just find inspiring\n\n1:36:49.760 --> 1:37:00.000\n or just maybe the reason you got into science or the reason you think science is cool?\n\n1:37:00.000 --> 1:37:05.480\n My favorite thing about science is kind of the connection between the scales.\n\n1:37:05.480 --> 1:37:11.040\n So when I was little and I wanted to know about space, I really felt that it would make\n\n1:37:11.040 --> 1:37:15.040\n me feel powerful to be able to predict the heavens.\n\n1:37:15.040 --> 1:37:19.520\n Something so much larger than myself that felt really powerful.\n\n1:37:19.520 --> 1:37:23.080\n It was almost a selfish desire and that's what I wanted.\n\n1:37:23.080 --> 1:37:29.560\n There was some control to being able to know exactly what the sky would do.\n\n1:37:29.560 --> 1:37:34.120\n And then as I got older and I got more into astronomy and I didn't just want to know how\n\n1:37:34.120 --> 1:37:35.120\n the stars moved.\n\n1:37:35.120 --> 1:37:38.040\n I wanted to know how the planets around them moved.\n\n1:37:38.040 --> 1:37:41.880\n And then as I got deeper into that field, I really didn't care that much about the planets.\n\n1:37:41.880 --> 1:37:45.280\n I wanted to know about the atmospheres around the planets and then the molecules within\n\n1:37:45.280 --> 1:37:48.480\n those atmospheres and what that might mean.\n\n1:37:48.480 --> 1:37:53.720\n So I ended up shrinking my scale until it was literally the quantum scale.\n\n1:37:53.720 --> 1:37:59.780\n And now all my work, the majority of my work is on this insane quantum scale.\n\n1:37:59.780 --> 1:38:10.000\n And yet I'm using these literal tiny, tiny tools to try and answer the greatest questions\n\n1:38:10.000 --> 1:38:12.980\n that we've ever been able to ask.\n\n1:38:12.980 --> 1:38:20.280\n And this crossing of scales from the quantum to the astronomical, that's so cool, isn't\n\n1:38:20.280 --> 1:38:21.280\n it?\n\n1:38:21.280 --> 1:38:22.280\n Yeah.\n\n1:38:22.280 --> 1:38:24.920\n It spans the entirety, the tiny and the huge.\n\n1:38:24.920 --> 1:38:30.120\n That's the cool thing about, I guess, being a quantum astrochemist is you're using the\n\n1:38:30.120 --> 1:38:35.520\n tools of the tiny to look at the heavenly bodies, the giant stuff.\n\n1:38:35.520 --> 1:38:41.040\n And the potential life out there that this is the thing that connects us, that you can't\n\n1:38:41.040 --> 1:38:45.740\n escape the rules of the quantum world and how universal they themselves are despite\n\n1:38:45.740 --> 1:38:48.040\n being probabilistic.\n\n1:38:48.040 --> 1:38:56.160\n And that makes me feel really pleased to be in science, but in a really humbling way.\n\n1:38:56.160 --> 1:39:00.600\n It's no longer this thirst for power.\n\n1:39:00.600 --> 1:39:05.560\n I feel less special the more work I do, less exceptional the more work I do.\n\n1:39:05.560 --> 1:39:11.200\n I feel like humans and the earth and our place in the universe is less and less exceptional.\n\n1:39:11.200 --> 1:39:14.820\n And yet I feel so much less lonely.\n\n1:39:14.820 --> 1:39:19.680\n And so it's been a really good trade off that I've lost power, but I've gained company.\n\n1:39:19.680 --> 1:39:20.820\n Wow.\n\n1:39:20.820 --> 1:39:21.820\n That's a beautiful answer.\n\n1:39:21.820 --> 1:39:23.680\n I don't think there's a better way to actually end it.\n\n1:39:23.680 --> 1:39:24.680\n You're right.\n\n1:39:24.680 --> 1:39:27.500\n I asked a mediocre question and you came through.\n\n1:39:27.500 --> 1:39:34.100\n You made the question good by a brilliant answer.\n\n1:39:34.100 --> 1:39:39.120\n You're the Michael Jordan and I'll be the Dennis Rodman.\n\n1:39:39.120 --> 1:39:40.880\n I don't know enough about basketball.\n\n1:39:40.880 --> 1:39:44.280\n I mean, literally you've reached the peak of my basketball knowledge because I know\n\n1:39:44.280 --> 1:39:50.120\n that those people are basketball pros, I believe, but only because I watch Space Jam, I think.\n\n1:39:50.120 --> 1:39:53.680\n Are there books or movies in your life?\n\n1:39:53.680 --> 1:39:59.000\n Long ago or recently, do you have any time for books and movies had an impact on you?\n\n1:39:59.000 --> 1:40:02.040\n What ideas did you take away?\n\n1:40:02.040 --> 1:40:04.200\n I absolutely have time for books and movies.\n\n1:40:04.200 --> 1:40:08.880\n I try as best I can to not work very hard.\n\n1:40:08.880 --> 1:40:09.880\n I mostly fail.\n\n1:40:09.880 --> 1:40:11.320\n I should point out.\n\n1:40:11.320 --> 1:40:18.000\n But I think I'm a better scientist when I don't work evenings and weekends.\n\n1:40:18.000 --> 1:40:21.080\n If I get four good hours in a day, I often don't.\n\n1:40:21.080 --> 1:40:28.020\n I often get eight crappy hours, emails, meetings, bad code, data processing.\n\n1:40:28.020 --> 1:40:33.640\n But if I can get four high quality scientific hours, I just stop working for the day because\n\n1:40:33.640 --> 1:40:35.840\n I know it's diminishing returns after that.\n\n1:40:35.840 --> 1:40:37.400\n So I have a lot of time.\n\n1:40:37.400 --> 1:40:40.280\n I try to make as much time as I can.\n\n1:40:40.280 --> 1:40:50.560\n Can you kind of dig into what it takes to be, one, productive, two, to be happy as a\n\n1:40:50.560 --> 1:40:51.560\n researcher?\n\n1:40:51.560 --> 1:40:58.280\n Because I think it's too easy in that world because you have so many hats, you have to\n\n1:40:58.280 --> 1:41:05.000\n wear so many jobs, you have to be a mentor, a teacher, a head of a research group to research\n\n1:41:05.000 --> 1:41:06.000\n yourself.\n\n1:41:06.000 --> 1:41:15.400\n You have to do service, all the kinds of stuff you're doing now with education and interviews.\n\n1:41:15.400 --> 1:41:22.480\n So as a public science, like being a public communicator, that's a job.\n\n1:41:22.480 --> 1:41:23.480\n The whole thing.\n\n1:41:23.480 --> 1:41:24.480\n Pays very poorly.\n\n1:41:24.480 --> 1:41:28.520\n I'll pay you in Bitcoin.\n\n1:41:28.520 --> 1:41:29.520\n Okay.\n\n1:41:29.520 --> 1:41:33.360\n I'll take Bitcoin.\n\n1:41:33.360 --> 1:41:41.800\n So is there some advice you can give to the process of being productive and happy as a\n\n1:41:41.800 --> 1:41:42.800\n researcher?\n\n1:41:42.800 --> 1:41:47.480\n I think, sadly, it's very hard to feel happy as a scientist if you're not productive.\n\n1:41:47.480 --> 1:41:53.000\n It's a bit of a trap, but I certainly find it very difficult to feel happy when I'm not\n\n1:41:53.000 --> 1:41:54.800\n being productive.\n\n1:41:54.800 --> 1:41:56.140\n It's become slightly better.\n\n1:41:56.140 --> 1:41:59.840\n If I know my students are being productive, I can be happy.\n\n1:41:59.840 --> 1:42:05.600\n But I think a lot of senior scientists, once they get into that mindset, they start thinking\n\n1:42:05.600 --> 1:42:07.600\n that their student science is theirs.\n\n1:42:07.600 --> 1:42:10.840\n And I think this happens a lot with senior scientists.\n\n1:42:10.840 --> 1:42:14.680\n They have so many hats, as you mentioned, they have to do so much service and so much\n\n1:42:14.680 --> 1:42:18.900\n admin, that they have very little time for their own science.\n\n1:42:18.900 --> 1:42:24.000\n And so they end up feeling ownership over the junior people in their labs and their\n\n1:42:24.000 --> 1:42:25.000\n groups.\n\n1:42:25.000 --> 1:42:26.000\n And that's really heartbreaking.\n\n1:42:26.000 --> 1:42:28.940\n I see it all the time.\n\n1:42:28.940 --> 1:42:31.960\n And that, I think I've escaped that trap.\n\n1:42:31.960 --> 1:42:38.360\n I feel so happy, even when I'm not productive, when my students are productive.\n\n1:42:38.360 --> 1:42:44.160\n I think that sensation I was describing earlier of they only need to be half as productive\n\n1:42:44.160 --> 1:42:50.640\n as me for me to feel like I've done my job for humanity.\n\n1:42:50.640 --> 1:42:55.240\n So that has been the dynamic I've had to worry about.\n\n1:42:55.240 --> 1:42:58.400\n But to be productive is not clear to me what you have to do.\n\n1:42:58.400 --> 1:42:59.720\n You have to not be miserable otherwise.\n\n1:42:59.720 --> 1:43:06.640\n I find it extremely hard when I'm having conflicts with collaborators, for example, kind of very\n\n1:43:06.640 --> 1:43:08.500\n hard to enjoy the work we do.\n\n1:43:08.500 --> 1:43:16.040\n Even if the work is this fantastical phosphine or things that I know I love, still very difficult.\n\n1:43:16.040 --> 1:43:22.760\n So I think choosing your collaborators based on how well you get along with them is a really\n\n1:43:22.760 --> 1:43:26.140\n sound scientific choice.\n\n1:43:26.140 --> 1:43:29.560\n Being a miserable collaborator ruins your whole life.\n\n1:43:29.560 --> 1:43:30.560\n It's horrible.\n\n1:43:30.560 --> 1:43:32.240\n It makes you not want to do the science.\n\n1:43:32.240 --> 1:43:35.700\n It probably makes you do clumsy science because you don't focus on it.\n\n1:43:35.700 --> 1:43:37.400\n You don't go over it several times.\n\n1:43:37.400 --> 1:43:39.560\n You just want it to be over.\n\n1:43:39.560 --> 1:43:47.880\n And so I think in general, just not being a douchebag can get so much good science done.\n\n1:43:47.880 --> 1:43:51.520\n Just find the good people in your community and collaborate with them.\n\n1:43:51.520 --> 1:43:55.040\n Even if they're not as good scientists as others, you'll get better science out.\n\n1:43:55.040 --> 1:43:59.520\n Yeah, don't be a douchebag yourself and surround yourself by other cool people.\n\n1:43:59.520 --> 1:44:00.520\n Exactly.\n\n1:44:00.520 --> 1:44:04.680\n And then you'll get better science than if you would try to work with three geniuses\n\n1:44:04.680 --> 1:44:07.760\n who are just hell to be around.\n\n1:44:07.760 --> 1:44:08.760\n Yeah.\n\n1:44:08.760 --> 1:44:12.080\n I mean, there's parallel things like that.\n\n1:44:12.080 --> 1:44:14.720\n I'm very fortunate now.\n\n1:44:14.720 --> 1:44:18.920\n I was very fortunate at MIT to have friends and colleagues there that were incredible\n\n1:44:18.920 --> 1:44:19.920\n to work with.\n\n1:44:19.920 --> 1:44:29.160\n But I'm currently sort of, I'm doing a lot of fun stuff on the side, like this little\n\n1:44:29.160 --> 1:44:35.360\n podcast thing and I mentioned to you, I think, robotics related stuff.\n\n1:44:35.360 --> 1:44:41.440\n I was just at Boston Dynamics yesterday checking out their robots.\n\n1:44:41.440 --> 1:44:46.320\n And I'm currently, I guess, hiring people to help me with a very fun little project\n\n1:44:46.320 --> 1:44:47.320\n around those robots.\n\n1:44:47.320 --> 1:44:48.320\n Want to put an ad in?\n\n1:44:48.320 --> 1:44:49.320\n No.\n\n1:44:49.320 --> 1:44:53.800\n I have more applications I can possibly deal with, there's thousands.\n\n1:44:53.800 --> 1:44:57.680\n So it's not an ad, it's the opposite.\n\n1:44:57.680 --> 1:45:00.640\n We need to put an ad out for someone to help you go through the applications.\n\n1:45:00.640 --> 1:45:03.440\n Well, that too is already there.\n\n1:45:03.440 --> 1:45:04.840\n Over 10,000 people apply for that.\n\n1:45:04.840 --> 1:45:09.560\n An infinite Master Yoshika doll of application management.\n\n1:45:09.560 --> 1:45:16.800\n But the point is, it's not exactly, the point is, like what I'm very distinctly aware of\n\n1:45:16.800 --> 1:45:26.440\n is life is short and productivity is not the right goal to optimize for, at least for me.\n\n1:45:26.440 --> 1:45:32.440\n The right goal to optimize for is how happy you are to wake up in the day and to work\n\n1:45:32.440 --> 1:45:34.120\n with the people that you do.\n\n1:45:34.120 --> 1:45:36.360\n Because the productivity will take care of itself.\n\n1:45:36.360 --> 1:45:37.360\n Agreed.\n\n1:45:37.360 --> 1:45:42.320\n And so like, it's so important to select the people well.\n\n1:45:42.320 --> 1:45:46.520\n And I think one of the challenges with academia, as opposed to sort of the thing I'm currently\n\n1:45:46.520 --> 1:45:51.880\n doing is, like, saying goodbye is sometimes a little bit tougher.\n\n1:45:51.880 --> 1:45:58.400\n Because your colleagues are there, I mean, their goodbye hurts.\n\n1:45:58.400 --> 1:46:02.200\n And then if you have to spend the rest, you know, for many years to come, still surrounded\n\n1:46:02.200 --> 1:46:04.540\n by them in the community, it's tougher.\n\n1:46:04.540 --> 1:46:13.440\n It kind of adds, puts extra pressure to stay in that relationship, in that collaboration.\n\n1:46:13.440 --> 1:46:17.080\n And in some sense, that makes it much more difficult, but it's still worth it.\n\n1:46:17.080 --> 1:46:25.360\n It's still worth it to break ties if you don't, if you're not happy, if there's not that magic,\n\n1:46:25.360 --> 1:46:26.360\n that dance.\n\n1:46:26.360 --> 1:46:30.800\n I talked to this guy named Daniel Kahneman.\n\n1:46:30.800 --> 1:46:32.000\n Oh, I know.\n\n1:46:32.000 --> 1:46:33.000\n Danny Kahneman.\n\n1:46:33.000 --> 1:46:34.000\n Danny, yeah.\n\n1:46:34.000 --> 1:46:39.360\n Boy, did that guy make me realize, like, what a great collaborator is.\n\n1:46:39.360 --> 1:46:41.720\n Well, he had Tversky, right?\n\n1:46:41.720 --> 1:46:42.720\n Yeah.\n\n1:46:42.720 --> 1:46:48.480\n So they had, obviously, they had a really deep collaboration there, but, like, I collaborated\n\n1:46:48.480 --> 1:46:53.160\n with him on a conversation, like, just, like, talking about, I don't know what we're talking\n\n1:46:53.160 --> 1:46:54.160\n about.\n\n1:46:54.160 --> 1:46:59.560\n I think cars, autonomous vehicles, but the brainstorming session, I'm like a nobody.\n\n1:46:59.560 --> 1:47:04.280\n And the fact that he would, with that childlike curiosity and that dance of thoughts and ideas\n\n1:47:04.280 --> 1:47:09.720\n and the push and pull and the, like, and the lack of ego, but then enough ego to have a\n\n1:47:09.720 --> 1:47:13.800\n little bit of a stubbornness over an idea and a little bit of humor and all those things,\n\n1:47:13.800 --> 1:47:19.440\n it's like, holy shit, that person, also the ability to truly listen to another human,\n\n1:47:19.440 --> 1:47:23.560\n it's like, okay, that's what it takes to be a good collaborator.\n\n1:47:23.560 --> 1:47:27.840\n It made me realize that I haven't been, I've been very fortunate to have cool people in\n\n1:47:27.840 --> 1:47:30.960\n my life, but there's, like, levels even to the cool.\n\n1:47:30.960 --> 1:47:34.400\n Yeah, I don't think you can compete with Danny Kahneman on cool.\n\n1:47:34.400 --> 1:47:36.400\n He's just incredible.\n\n1:47:36.400 --> 1:47:41.400\n Everybody was like, okay, I guess what I'm trying to say is that collaboration is an\n\n1:47:41.400 --> 1:47:47.440\n art form, but perhaps it's actually a skill, is allowing yourself to develop that skill\n\n1:47:47.440 --> 1:47:50.160\n because that's one of the fruitful skills.\n\n1:47:50.160 --> 1:47:56.240\n And praise it in students, you know, and I think it is something you can really improve\n\n1:47:56.240 --> 1:47:57.240\n on.\n\n1:47:57.240 --> 1:47:59.680\n I've become a better collaborator as the years have gone on.\n\n1:47:59.680 --> 1:48:03.240\n I don't have some innate collaborative skills.\n\n1:48:03.240 --> 1:48:10.080\n I think they're skills I've developed, and I think in science there's this really destructive\n\n1:48:10.080 --> 1:48:15.000\n notion of the lone wolf, the scientist who sees things where others don't, you know,\n\n1:48:15.000 --> 1:48:19.120\n then that's really appealing and people really like either fulfilling that or pretending\n\n1:48:19.120 --> 1:48:21.360\n to be fulfilling that.\n\n1:48:21.360 --> 1:48:25.480\n And first of all, it's mostly a lie.\n\n1:48:25.480 --> 1:48:30.640\n Any modern scientist, particularly in astronomy, which is so interdisciplinary, any modern scientist\n\n1:48:30.640 --> 1:48:36.760\n that's doing it on their own is doing a crappy job most likely because you need an independent\n\n1:48:36.760 --> 1:48:39.000\n set of eyes to help you do things.\n\n1:48:39.000 --> 1:48:43.960\n You need experts in the sub fields that you're working on to check your work.\n\n1:48:43.960 --> 1:48:49.840\n But most importantly, it's just a bad idea.\n\n1:48:49.840 --> 1:48:54.120\n It doesn't lead to good science and it leaves you miserable.\n\n1:48:54.120 --> 1:48:58.920\n I was recently, I had some work that I was avoiding and I thought maybe I should pursue\n\n1:48:58.920 --> 1:49:03.200\n the scientific project because I don't care enough about the outcome and it's going to\n\n1:49:03.200 --> 1:49:04.200\n be a lot of hard work.\n\n1:49:04.200 --> 1:49:07.720\n And I was trying to balance these two things to be really difficult.\n\n1:49:07.720 --> 1:49:12.400\n And the outcome is that maybe 10 people will cite me in the next decade because it's not,\n\n1:49:12.400 --> 1:49:16.120\n no one's asking for this question to be answered.\n\n1:49:16.120 --> 1:49:21.000\n And then I found myself working with this collaborator, Jason Dittman.\n\n1:49:21.000 --> 1:49:27.720\n And I spent a whole afternoon hours with him working on this and time flew by and I just\n\n1:49:27.720 --> 1:49:31.960\n felt taller and like I could breathe better.\n\n1:49:31.960 --> 1:49:35.480\n I was happier, I was a better person when it was done.\n\n1:49:35.480 --> 1:49:38.840\n And that's because he's a great collaborator.\n\n1:49:38.840 --> 1:49:43.560\n He's just a wonderful person that brings out joy out of science that you're doing with\n\n1:49:43.560 --> 1:49:45.400\n him.\n\n1:49:45.400 --> 1:49:46.920\n And that's really the trick.\n\n1:49:46.920 --> 1:49:52.240\n You find the people that make you feel that way about the science you're doing and you\n\n1:49:52.240 --> 1:49:55.720\n stop worrying about being the lone wolf.\n\n1:49:55.720 --> 1:50:01.320\n That's just a terrible dream that will leave you miserable and your science will be shit.\n\n1:50:01.320 --> 1:50:08.120\n And since I'm Russian, just murder anybody who doesn't fall into that beautiful collaborative\n\n1:50:08.120 --> 1:50:10.360\n relationship.\n\n1:50:10.360 --> 1:50:11.920\n We were talking about books.\n\n1:50:11.920 --> 1:50:13.420\n Books, yes.\n\n1:50:13.420 --> 1:50:14.420\n Is there books, movies?\n\n1:50:14.420 --> 1:50:16.360\n Why was I talking about my productivity?\n\n1:50:16.360 --> 1:50:18.920\n Oh, you said you maybe don't have time for books and movies.\n\n1:50:18.920 --> 1:50:22.800\n And you said you must make time for books and movies.\n\n1:50:22.800 --> 1:50:24.620\n Make time to not work.\n\n1:50:24.620 --> 1:50:28.160\n Make time to not work whatever that looks like to you.\n\n1:50:28.160 --> 1:50:31.320\n But there's plenty.\n\n1:50:31.320 --> 1:50:36.940\n When I was younger, I found a lot of my scientific fulfillment in books and movies.\n\n1:50:36.940 --> 1:50:43.680\n Now as I got older, I have plenty of that in my work and I try to read outside my field.\n\n1:50:43.680 --> 1:50:47.620\n I read about Danny Kahneman's work instead.\n\n1:50:47.620 --> 1:50:52.080\n But when I was little, it was Contact, the Carl Sagan book.\n\n1:50:52.080 --> 1:50:59.960\n I really thought I was just like Ellie and I was going to become Ellie.\n\n1:50:59.960 --> 1:51:06.600\n I really resonated with me, that character and the notions of life and space and the\n\n1:51:06.600 --> 1:51:07.600\n universe.\n\n1:51:07.600 --> 1:51:17.440\n Even the idea of then the movie came out and I got to put Jodie Foster in that, which helped.\n\n1:51:17.440 --> 1:51:23.740\n But even the notion of if it is just us, what an awful waste of space, I find extremely\n\n1:51:23.740 --> 1:51:30.280\n useful as a concept to think maybe we are special, but that would suck is a really nice\n\n1:51:30.280 --> 1:51:35.720\n way of thinking of the search for life, that it's much better to not be special and have\n\n1:51:35.720 --> 1:51:36.720\n company.\n\n1:51:36.720 --> 1:51:39.440\n I got that from Carl Sagan.\n\n1:51:39.440 --> 1:51:42.080\n So that's where I always recommend.\n\n1:51:42.080 --> 1:51:45.880\n Let me ask one other ridiculous question.\n\n1:51:45.880 --> 1:51:53.120\n We talked about the death and life cycle that is ever present in the universe until it's\n\n1:51:53.120 --> 1:51:58.760\n not, until it's supermassive and little black holes too at the end of the universe.\n\n1:51:58.760 --> 1:52:02.760\n What do you think is the why, the meaning of it all?\n\n1:52:02.760 --> 1:52:09.840\n What do you think is the meaning of life here on Earth and the meaning of that life that\n\n1:52:09.840 --> 1:52:14.280\n you look for, whether it's on Venus or other exoplanets?\n\n1:52:14.280 --> 1:52:16.000\n I think there's none.\n\n1:52:16.000 --> 1:52:19.160\n I find enormous relief in the absence of meaning.\n\n1:52:19.160 --> 1:52:29.240\n I think chasing for meaning is a human desire that the universe doesn't give two shits about.\n\n1:52:29.240 --> 1:52:30.240\n But you still enjoy...\n\n1:52:30.240 --> 1:52:33.320\n I enjoy finding meaning in my life.\n\n1:52:33.320 --> 1:52:38.400\n I enjoy finding where the morality lies.\n\n1:52:38.400 --> 1:52:47.800\n I enjoy the complication of that desire and I feel that is deeply human, but I don't feel\n\n1:52:47.800 --> 1:52:49.760\n that it's universal.\n\n1:52:49.760 --> 1:52:50.760\n It's somehow absolute.\n\n1:52:50.760 --> 1:52:54.080\n Like we conjure it up.\n\n1:52:54.080 --> 1:52:59.880\n We bring it to life through our own minds, but it's not any kind of fundamental way real.\n\n1:52:59.880 --> 1:53:01.240\n No.\n\n1:53:01.240 --> 1:53:07.760\n And the same way the sun is not to be blamed for destroying its own planets.\n\n1:53:07.760 --> 1:53:12.600\n The universe doesn't care because it has no meaning.\n\n1:53:12.600 --> 1:53:14.400\n It owes us nothing.\n\n1:53:14.400 --> 1:53:18.080\n And looking for meaning in the universe is demanding answers.\n\n1:53:18.080 --> 1:53:19.080\n Who are we?\n\n1:53:19.080 --> 1:53:20.080\n We're nothing.\n\n1:53:20.080 --> 1:53:23.280\n We don't get to demand anything and that includes meaning.\n\n1:53:23.280 --> 1:53:28.560\n And I find it very reassuring because once there is no meaning, I don't have to find\n\n1:53:28.560 --> 1:53:30.800\n it.\n\n1:53:30.800 --> 1:53:34.320\n Yeah.\n\n1:53:34.320 --> 1:53:38.240\n Once there's no meaning, it's a kind of freedom in a way.\n\n1:53:38.240 --> 1:53:41.240\n You sound a bit like...\n\n1:53:41.240 --> 1:53:42.240\n I'm happy about it.\n\n1:53:42.240 --> 1:53:44.320\n This isn't a depressing outlook as far as I'm concerned.\n\n1:53:44.320 --> 1:53:45.320\n It's happiness.\n\n1:53:45.320 --> 1:53:46.320\n Yeah.\n\n1:53:46.320 --> 1:53:47.320\n Yeah.\n\n1:53:47.320 --> 1:53:48.320\n So, I mean, there's a...\n\n1:53:48.320 --> 1:53:53.440\n I don't know if you know who Sam Harris is, but he, despite the pushbacks from the entirety\n\n1:53:53.440 --> 1:54:01.880\n of the world, really argues hard that free will is an illusion, that the deterministic\n\n1:54:01.880 --> 1:54:06.880\n universe and it's all already been predetermined and he's okay with it.\n\n1:54:06.880 --> 1:54:11.840\n And he's happy with it, that he's distinctly aware of it.\n\n1:54:11.840 --> 1:54:12.840\n And that's okay.\n\n1:54:12.840 --> 1:54:16.480\n The quantum world will disagree with him on the deterministic nature of nature.\n\n1:54:16.480 --> 1:54:22.540\n Well, he's not saying it's deterministic, but he's saying that the randomness doesn't\n\n1:54:22.540 --> 1:54:24.880\n help either.\n\n1:54:24.880 --> 1:54:31.280\n Randomness does not help in the experience of feeling like you're the decider of your\n\n1:54:31.280 --> 1:54:33.100\n own actions.\n\n1:54:33.100 --> 1:54:40.640\n That he kind of is okay with being a leaf flowing on the river, or being the river,\n\n1:54:40.640 --> 1:54:45.040\n as opposed to having or being like a fish or something that can decide its swimming\n\n1:54:45.040 --> 1:54:46.040\n direction.\n\n1:54:46.040 --> 1:54:48.600\n He's okay just embracing the flow of life.\n\n1:54:48.600 --> 1:54:53.360\n I mean, in that same way, it kind of sounds like your conception of meaning.\n\n1:54:53.360 --> 1:54:56.920\n I mean, it just is.\n\n1:54:56.920 --> 1:54:58.960\n The universe doesn't care.\n\n1:54:58.960 --> 1:55:04.720\n It just is what it is and we experience certain things and some feel good and some don't.\n\n1:55:04.720 --> 1:55:08.400\n And that's life.\n\n1:55:08.400 --> 1:55:10.040\n But I don't feel like that about life.\n\n1:55:10.040 --> 1:55:16.040\n I think life does have meaning and it's laudable to look for that meaning in life.\n\n1:55:16.040 --> 1:55:22.080\n I just don't think you can apply that beyond life and certainly not beyond earth.\n\n1:55:22.080 --> 1:55:31.440\n That this notion of meaning is a human construct and so it only applies within us and the other\n\n1:55:31.440 --> 1:55:40.640\n life forms and planet types that suffer from our intrusions or rejoice from our interactions.\n\n1:55:40.640 --> 1:55:44.820\n But this meaning is ours to do as we please.\n\n1:55:44.820 --> 1:55:49.520\n We created it, we've created a need for it, and so that's our problem to solve.\n\n1:55:49.520 --> 1:55:51.200\n I don't apply it beyond us.\n\n1:55:51.200 --> 1:55:55.640\n I think we as humans have a lot of responsibilities, but they're moral responsibilities.\n\n1:55:55.640 --> 1:55:59.800\n And a lot of those responsibilities are much more easily fulfilled if you find meaning\n\n1:55:59.800 --> 1:56:00.840\n in them.\n\n1:56:00.840 --> 1:56:04.640\n So I think there's value to meaning, whether it's real or not.\n\n1:56:04.640 --> 1:56:11.000\n I just think we gain nothing from trying to anthropomorphize the entire universe.\n\n1:56:11.000 --> 1:56:13.800\n And also that's the height of hubris.\n\n1:56:13.800 --> 1:56:15.360\n That's not for us to do.\n\n1:56:15.360 --> 1:56:16.360\n Yeah.\n\n1:56:16.360 --> 1:56:19.640\n It also could be just like duality and quantum mechanics.\n\n1:56:19.640 --> 1:56:25.600\n It could be both that there is meaning and that there isn't.\n\n1:56:25.600 --> 1:56:32.440\n And we're somehow depending on the observer, depending on the perspective you take on the\n\n1:56:32.440 --> 1:56:33.440\n thing.\n\n1:56:33.440 --> 1:56:38.640\n I mean, even on earth that's true, but whether things have meaning or not depends a lot on\n\n1:56:38.640 --> 1:56:41.640\n who's looking.\n\n1:56:41.640 --> 1:56:45.440\n Whether it's us humans, the aliens or the giraffes.\n\n1:56:45.440 --> 1:56:49.800\n Clara, this was an incredible conversation.\n\n1:56:49.800 --> 1:56:57.160\n I mean, I learned so much, but I also am just inspired by the passion you have in not finding\n\n1:56:57.160 --> 1:57:00.040\n meaning in the universe.\n\n1:57:00.040 --> 1:57:04.240\n I'm very passionate about not finding meaning in the universe.\n\n1:57:04.240 --> 1:57:06.640\n You're the most inspiring nihilist I've ever met.\n\n1:57:06.640 --> 1:57:08.640\n I'm just kidding.\n\n1:57:08.640 --> 1:57:17.480\n You are truly an inspiring communicator of everything from phosphine to life to quantum\n\n1:57:17.480 --> 1:57:18.480\n astrochemistry.\n\n1:57:18.480 --> 1:57:24.440\n I can't wait to see what other cool things you do in your career, in your scientific\n\n1:57:24.440 --> 1:57:25.440\n life.\n\n1:57:25.440 --> 1:57:28.120\n Thank you so much for wasting your valuable time with me today.\n\n1:57:28.120 --> 1:57:30.120\n I really appreciate it.\n\n1:57:30.120 --> 1:57:31.120\n It was my pleasure.\n\n1:57:31.120 --> 1:57:33.880\n I'd already got my four hours of productivity before I got here.\n\n1:57:33.880 --> 1:57:35.240\n And so it's not a waste.\n\n1:57:35.240 --> 1:57:37.320\n It's all downhill from there.\n\n1:57:37.320 --> 1:57:38.320\n Thank you.\n\n1:57:38.320 --> 1:57:41.320\n Thanks for listening to this conversation with Clara Sousa Silva.\n\n1:57:41.320 --> 1:57:46.600\n And thank you to Onnit, Grammarly, Blinkist, and Indeed.\n\n1:57:46.600 --> 1:57:50.440\n Check them out in the description to support this podcast.\n\n1:57:50.440 --> 1:57:54.160\n And now let me leave you with some words from Konstantin Tsiolkovsky.\n\n1:57:54.160 --> 1:58:00.360\n The earth is the cradle of humanity, but mankind cannot stay in the cradle forever.\n\n1:58:00.360 --> 1:58:11.640\n Thank you for listening and hope to see you next time.\n\n"
}