{
  "title": "Jack Barsky: KGB Spy | Lex Fridman Podcast #301",
  "id": "dSVLjAdo8UA",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:07.320\n Something happened where they forced my hand, and this is the only time that a Soviet agent\n\n00:07.320 --> 00:12.120\n was anywhere near me on the territory of the United States.\n\n00:12.120 --> 00:20.680\n So I'm waiting for the A train on a dark morning still in Queens, and there's this man in a\n\n00:20.680 --> 00:27.600\n black trench coat comes up to me from my right, and he whispers into my ears, you gotta come\n\n00:27.600 --> 00:32.320\n back or else you're dead.\n\n00:32.320 --> 00:38.480\n The following is a conversation with Jack Barsky, a former KGB spy, author of Deep Undercover\n\n00:38.480 --> 00:43.520\n and the subject of an excellent podcast series called The Agent.\n\n00:43.520 --> 00:49.160\n There are very few people who have defected from the KGB and live to tell the story.\n\n00:49.160 --> 00:53.280\n It is one of the most powerful intelligence organizations in history.\n\n00:53.280 --> 00:59.120\n And this conversation gives a window into its operation, both from an ideological and\n\n00:59.120 --> 01:06.200\n psychological perspective, but also it tells the story of a man who lived one heck of an\n\n01:06.200 --> 01:08.340\n incredible life.\n\n01:08.340 --> 01:13.880\n This is the Lex Friedman podcast, to support it, please check out our sponsors in the description.\n\n01:13.880 --> 01:18.280\n And now, dear friends, here's Jack Barsky.\n\n01:18.280 --> 01:20.560\n Let's start with a big basic question.\n\n01:20.560 --> 01:21.560\n What is the KGB?\n\n01:21.560 --> 01:24.560\n Комитет Государственной Безопасности.\n\n01:24.560 --> 01:26.120\n Right.\n\n01:26.120 --> 01:29.000\n So that is the Committee of State Security.\n\n01:29.000 --> 01:30.000\n Yeah.\n\n01:30.000 --> 01:31.000\n There's an opossumist.\n\n01:31.000 --> 01:33.040\n Opossumist is a threat, right?\n\n01:33.040 --> 01:34.040\n Threat.\n\n01:34.040 --> 01:35.040\n Okay.\n\n01:35.040 --> 01:36.040\n And BS means...\n\n01:36.040 --> 01:37.040\n Without.\n\n01:37.040 --> 01:38.040\n Right.\n\n01:38.040 --> 01:39.800\n And I guess that directly translates to security.\n\n01:39.800 --> 01:40.800\n Without threat.\n\n01:40.800 --> 01:43.640\n So, and don't exist anymore.\n\n01:43.640 --> 01:49.840\n It was disbanded when the Soviet Union fell apart and the successor agencies are now the\n\n01:49.840 --> 01:57.300\n SVR and the FSB, FSB supposedly the equivalent to the FBI and SVR, the CIA.\n\n01:57.300 --> 02:06.260\n But the SVR is relatively weak and the FSB has taken on a lot of espionage and active\n\n02:06.260 --> 02:09.420\n measures and they're much bigger and stronger.\n\n02:09.420 --> 02:16.720\n But the most capable intelligence agency in Russia is the GRU, Military Intelligence.\n\n02:16.720 --> 02:18.560\n That nobody knows very much about.\n\n02:18.560 --> 02:19.560\n That's right.\n\n02:19.560 --> 02:23.400\n When I was in the KGB, I had no idea that there was military intelligence.\n\n02:23.400 --> 02:25.560\n Nobody ever mentioned anything like that.\n\n02:25.560 --> 02:31.720\n And by the way, I recently had the pleasure to give a talk at the DIA.\n\n02:31.720 --> 02:35.080\n When they reached out to me, I didn't know they existed either.\n\n02:35.080 --> 02:36.080\n Interesting.\n\n02:36.080 --> 02:37.080\n Yeah.\n\n02:37.080 --> 02:38.080\n That's always the question.\n\n02:38.080 --> 02:42.760\n If you want to be an intelligence agency, should the world know anything about you?\n\n02:42.760 --> 02:48.760\n Because in some sense, you want to create the legend in order to attract great competent\n\n02:48.760 --> 02:54.480\n individuals to work for you, but at the same time, you want it to be shrouded in complete\n\n02:54.480 --> 02:55.480\n mystery.\n\n02:55.480 --> 03:01.840\n If nobody knows you exist, you might be able to operate well as an intelligence agency.\n\n03:01.840 --> 03:03.200\n That is fascinating.\n\n03:03.200 --> 03:12.600\n But FSB is the thing that carries the flag of KGB, KGB being probably one of, if not\n\n03:12.600 --> 03:19.720\n the most sort of infamous, famous, infamous, and powerful intelligence agencies in history\n\n03:19.720 --> 03:20.720\n ever.\n\n03:20.720 --> 03:21.720\n Absolutely.\n\n03:21.720 --> 03:22.720\n 100%.\n\n03:22.720 --> 03:26.960\n It was founded in 1954 after the death of Stalin.\n\n03:26.960 --> 03:31.200\n In writing your book, you've looked back at the predecessors of the history.\n\n03:31.200 --> 03:42.560\n Is there some way in which the KGB is grounded in the culture, the spirit, the soul of the\n\n03:42.560 --> 03:43.560\n KGB?\n\n03:43.560 --> 03:44.560\n Its predecessors.\n\n03:44.560 --> 03:45.560\n Oh, absolutely.\n\n03:45.560 --> 03:51.320\n They just changed names and they changed personnel rather frequently, and that had something\n\n03:51.320 --> 03:54.120\n to do with Stalin's paranoia.\n\n03:54.120 --> 04:00.560\n From between 1923, and I don't remember what, I think it may have been the NKVD at that\n\n04:00.560 --> 04:01.560\n time.\n\n04:01.560 --> 04:11.920\n It started as the Chika, and then it became the GPU, the NKVD, but with those name changes,\n\n04:11.920 --> 04:14.240\n you also had changes at the top.\n\n04:14.240 --> 04:24.040\n Between 1923 and 1953, when Stalin died, that is 30 years, they had eight heads of intelligence,\n\n04:24.040 --> 04:29.280\n and of those eight, six were executed when they were replaced.\n\n04:29.280 --> 04:38.360\n So that's an indication that this was an organization that ate itself from the inside.\n\n04:38.360 --> 04:42.600\n The Soviet Union was the only dictatorship in history that did not rest its powers on\n\n04:42.600 --> 04:43.920\n the military.\n\n04:43.920 --> 04:49.900\n They rested its powers on the intelligence apparatus, and that thing was unstable.\n\n04:49.900 --> 04:52.320\n So you know where that leads.\n\n04:52.320 --> 04:58.120\n Eventually, if you rest your power on something that is made out of bricks that don't hold\n\n04:58.120 --> 05:01.280\n a lot of load, it will fall apart.\n\n05:01.280 --> 05:02.280\n On sand.\n\n05:02.280 --> 05:03.280\n Yeah.\n\n05:03.280 --> 05:04.560\n Why was it unstable, would you say?\n\n05:04.560 --> 05:07.520\n What of human nature makes it unstable?\n\n05:07.520 --> 05:09.360\n It's the paranoia.\n\n05:09.360 --> 05:17.320\n Stalin was always worried about the most powerful people coming after him.\n\n05:17.320 --> 05:23.080\n So he proactively killed off heads of the KGB, and he had this great purge where he\n\n05:23.080 --> 05:31.760\n got rid of a lot of his generals, really capable generals, and that cost him dearly when World\n\n05:31.760 --> 05:39.640\n War II started, because he started off with a force that wasn't as capable as it could\n\n05:39.640 --> 05:41.000\n have been.\n\n05:41.000 --> 05:42.840\n Was it paranoia at all levels?\n\n05:42.840 --> 05:43.840\n I believe so.\n\n05:43.840 --> 05:45.200\n I believe so.\n\n05:45.200 --> 05:46.680\n It comes from the top.\n\n05:46.680 --> 05:55.600\n And so if the top doesn't trust you, you always have to worry about your peers snitching on\n\n05:55.600 --> 05:58.260\n you.\n\n05:58.260 --> 06:07.840\n And I think we have a very similar situation in Russia today, and in this kind of atmosphere,\n\n06:07.840 --> 06:10.320\n the truth will never get to the top.\n\n06:10.320 --> 06:17.240\n So no matter what moral rules the organization operates under, trust is fundamental to its\n\n06:17.240 --> 06:18.240\n competence.\n\n06:18.240 --> 06:19.240\n Oh, absolutely.\n\n06:19.240 --> 06:26.600\n And I want to extend this to my own existence, and this is kind of strange.\n\n06:26.600 --> 06:34.700\n It's almost dichotomous, because I was running around lying to everybody, and I couldn't\n\n06:34.700 --> 06:35.960\n fundamentally be trusted.\n\n06:35.960 --> 06:40.000\n But the relationship that I had with the KGB was based on trust.\n\n06:40.000 --> 06:43.120\n If they don't trust me, they don't send me out.\n\n06:43.120 --> 06:45.960\n And if I don't trust them, I'm not going.\n\n06:45.960 --> 06:50.960\n And I eventually broke that trust, and they knew there was always that danger.\n\n06:50.960 --> 06:56.240\n They knew that because something about you or just something about human beings that\n\n06:56.240 --> 06:57.760\n can be broken.\n\n06:57.760 --> 07:05.080\n There were hints about how long my assignment would be, so 10 to 12 years.\n\n07:05.080 --> 07:07.840\n And you see, it makes sense.\n\n07:07.840 --> 07:13.840\n I was becoming an American, and over time, I would become more and more American, and\n\n07:13.840 --> 07:19.920\n there was always a chance that I liked it more here than there, that I was really successful\n\n07:19.920 --> 07:22.680\n in what I was supposed to do.\n\n07:22.680 --> 07:28.680\n And it sort of happened, but in my case, it happened because I fathered a child who I\n\n07:28.680 --> 07:30.880\n didn't want to leave when they wanted me back.\n\n07:30.880 --> 07:36.520\n Love always screws up your employment competence, yes.\n\n07:36.520 --> 07:40.040\n You're absolutely right.\n\n07:40.040 --> 07:48.760\n But they thought that I had an anchor at home because I had a wife and a son at home, which\n\n07:48.760 --> 07:53.800\n you've got to worry about them if you defect.\n\n07:53.800 --> 08:01.440\n Because in the past, the KGB would go after family ruthlessly.\n\n08:01.440 --> 08:03.000\n Including perhaps violence?\n\n08:03.000 --> 08:04.000\n Yeah.\n\n08:04.000 --> 08:08.320\n This is a hard question about the KGB because it's one of the most ruthless organizations,\n\n08:08.320 --> 08:18.680\n but in general, are there lines, KGB agents at every level of the hierarchy that they\n\n08:18.680 --> 08:25.280\n would not cross, political, legal, ethical, or does anything goes to achieve the goal?\n\n08:25.280 --> 08:35.480\n I was only in touch with two types of agents, the technical experts, the ones that taught\n\n08:35.480 --> 08:42.680\n me tradecraft, and they were like engineers and they were in charge of the secret writing\n\n08:42.680 --> 08:53.000\n and the Morse code, shortwave radio reception, decryption, encryption, and that kind of stuff.\n\n08:53.000 --> 08:56.240\n Those were just doing their job.\n\n08:56.240 --> 09:03.360\n And the others, the ones that trained me, that prepared me for life in the United States,\n\n09:03.360 --> 09:05.320\n they were nice people.\n\n09:05.320 --> 09:08.320\n They were elegant people.\n\n09:08.320 --> 09:19.040\n I don't think they would not fit into the stereotype of the ruthless gun carrying agent.\n\n09:19.040 --> 09:25.080\n Is it possible that you would not be aware of the parts of the KGB, I mean, it's very\n\n09:25.080 --> 09:26.080\n modular.\n\n09:26.080 --> 09:27.080\n Would you?\n\n09:27.080 --> 09:28.080\n Yeah.\n\n09:28.080 --> 09:30.880\n It's possible that you're not aware of the parts of the KGB that are the quote unquote\n\n09:30.880 --> 09:31.880\n muscle.\n\n09:31.880 --> 09:32.960\n Oh, I didn't know.\n\n09:32.960 --> 09:39.920\n I would find out afterwards, after I retired and started doing some research, I had no\n\n09:39.920 --> 09:40.920\n clue.\n\n09:40.920 --> 09:42.240\n So you're kind of operating in a bubble.\n\n09:42.240 --> 09:43.480\n Oh, very much so.\n\n09:43.480 --> 09:51.840\n I mean, this is what the KGB did really, really well, compartmentalization, and that was based\n\n09:51.840 --> 09:57.240\n on the communist movement while it was still underground.\n\n09:57.240 --> 10:02.840\n The cells were very small, so that maybe there were three, four members in one cell that\n\n10:02.840 --> 10:07.760\n knew one another, and then they had a liaison to another cell.\n\n10:07.760 --> 10:13.600\n The bottom line is if you got one of those folks were caught, they could maybe betray\n\n10:13.600 --> 10:20.880\n four people or three, something like that, and the KGB continued with that tradition.\n\n10:20.880 --> 10:27.560\n I have reason to believe that my handler, the person in Moscow that sort of directed\n\n10:27.560 --> 10:33.040\n me and made decisions what to do and where to go, never met me personally.\n\n10:33.040 --> 10:37.720\n There's no reason to.\n\n10:37.720 --> 10:45.440\n This actually was a big advantage over other intelligence services because you look at\n\n10:45.440 --> 10:46.800\n what the CIA does.\n\n10:46.800 --> 10:47.800\n Everybody blabs.\n\n10:47.800 --> 10:50.880\n There's a lot of leaks coming out of American intelligence.\n\n10:50.880 --> 10:54.480\n I don't think there's as many leaks coming out of the Mossad.\n\n10:54.480 --> 10:57.440\n Strong words from Jack Barsky, by the way.\n\n10:57.440 --> 10:59.920\n That is a question I want to ask a little more systematically.\n\n10:59.920 --> 11:05.280\n Is there something unique about the KGB compared to the other intelligence agencies?\n\n11:05.280 --> 11:11.920\n Let's talk British intelligence, MI6, Mossad, CIA.\n\n11:11.920 --> 11:17.180\n Is there unique cultures, spirits, souls of the different organizations that maybe somehow\n\n11:17.180 --> 11:22.800\n connect to the structures of government, connect maybe the values of the people, those kinds\n\n11:22.800 --> 11:23.800\n of things?\n\n11:23.800 --> 11:31.580\n I believe we were all pretty much strong believers in communism and the future of the world being...\n\n11:31.580 --> 11:32.580\n In KGB?\n\n11:32.580 --> 11:33.580\n Yes.\n\n11:33.580 --> 11:38.960\n I think that unified us to a large degree, even the technicians.\n\n11:38.960 --> 11:46.720\n It wasn't something like, yeah, yeah, the parents believe this thing, but we know the\n\n11:46.720 --> 11:47.720\n truth.\n\n11:47.720 --> 11:49.800\n You really believe the story of communism.\n\n11:49.800 --> 11:50.800\n Absolutely did.\n\n11:50.800 --> 11:54.380\n And you need to look at the timeframe.\n\n11:54.380 --> 12:02.760\n The Soviet Union after World War II made quite a bit of progress in influencing the Third\n\n12:02.760 --> 12:03.760\n World.\n\n12:03.760 --> 12:09.560\n I still remember when I was in middle school, we had a map, the map of the world, and it\n\n12:09.560 --> 12:11.200\n was color coded.\n\n12:11.200 --> 12:16.740\n So red was communism, that was the Soviet Union and the Eastern states, and then blue\n\n12:16.740 --> 12:18.320\n was capitalism.\n\n12:18.320 --> 12:24.400\n And then we had green, which were the Third World countries, and the green slowly turned\n\n12:24.400 --> 12:30.480\n pink because a lot of Third World governments, like I'm looking at Angola, I'm looking at\n\n12:30.480 --> 12:40.160\n Vietnam, a lot of these countries were very sympathetic to the Soviet Union.\n\n12:40.160 --> 12:45.640\n And so we sort of knew that this would go on like that, and eventually we would take\n\n12:45.640 --> 12:55.680\n over and pretty much overtake, that was the myth, overtake the United States, not only\n\n12:55.680 --> 13:02.000\n militarily but also in terms of industrial production and so forth.\n\n13:02.000 --> 13:03.840\n That was a stupid pipe dream.\n\n13:03.840 --> 13:08.600\n The military, it was a standoff, as we know.\n\n13:08.600 --> 13:13.320\n A stupid pipe dream.\n\n13:13.320 --> 13:22.040\n Hitler had a stupid pipe dream that he executed it exceptionally effectively and on, if not\n\n13:22.040 --> 13:28.200\n for a handful of military mistakes, the world could look very different today.\n\n13:28.200 --> 13:34.480\n Well, the biggest one being invading the Soviet Union, particularly at the time that he did\n\n13:34.480 --> 13:40.480\n it because he ran into the same thing that Napoleon ran into General Winter.\n\n13:40.480 --> 13:49.520\n Well within, so Operation Barbarossa, within that he could have made different decisions.\n\n13:49.520 --> 13:56.080\n For example, attacking, skipping Kiev and attacking Moscow directly, overthrowing the\n\n13:56.080 --> 13:57.080\n government.\n\n13:57.080 --> 14:03.880\n So marching, I guess that would be learning lessons from Napoleon as opposed to a different\n\n14:03.880 --> 14:07.600\n kind of distribution of forces and then getting bogged down in the winter.\n\n14:07.600 --> 14:14.720\n But the point is these ambitions sometimes do, the ambitions of empires sometimes do\n\n14:14.720 --> 14:18.680\n materialize in the growth and the building and the establishment of those empires and\n\n14:18.680 --> 14:25.080\n those empires write the history books in such a way that we don't think of them as empires\n\n14:25.080 --> 14:27.880\n or we certainly don't think of them as the bad guys.\n\n14:27.880 --> 14:30.640\n They write the history books, therefore they're the good guys.\n\n14:30.640 --> 14:35.120\n And right now America has effectively written the book about the good guys.\n\n14:35.120 --> 14:41.680\n I happen to believe that book, but it's, we should be humbled and open minded to realize\n\n14:41.680 --> 14:47.120\n that that is in fact what is happening is effective empires write the history books\n\n14:47.120 --> 14:51.960\n and tell us stories and tell us propaganda and tell us narratives that we believe because\n\n14:51.960 --> 14:55.920\n we are human beings and we love to get together and believe ideas.\n\n14:55.920 --> 15:00.480\n We love to dream of a beautiful world and try to build that beautiful world together\n\n15:00.480 --> 15:01.480\n in the United States.\n\n15:01.480 --> 15:02.480\n That's a beautiful world.\n\n15:02.480 --> 15:11.280\n The freedom of respect of human rights of all men are created equal pursuit of happiness.\n\n15:11.280 --> 15:13.180\n You know, it always sounds good.\n\n15:13.180 --> 15:19.680\n If you look at what the dream of communism is, it sure as heck in its words on the surface\n\n15:19.680 --> 15:20.680\n sounds good.\n\n15:20.680 --> 15:21.680\n Yes.\n\n15:21.680 --> 15:22.680\n Respect for the workers.\n\n15:22.680 --> 15:23.680\n Yes.\n\n15:23.680 --> 15:27.860\n The working class, the lower classes that have been trodden on that have been stolen\n\n15:27.860 --> 15:33.360\n from by the powerful, they deserve to have the money, the power, the respect that they\n\n15:33.360 --> 15:35.640\n have earned through their hard work.\n\n15:35.640 --> 15:36.640\n Sounds great.\n\n15:36.640 --> 15:44.700\n And everybody gets along and we just have to, you know, uh, all men are wonderful people.\n\n15:44.700 --> 15:48.360\n And if they, if they go bad, it has something to do with the fact that they have, they have\n\n15:48.360 --> 15:51.000\n been oppressed, right?\n\n15:51.000 --> 15:54.160\n And uh, that dream just never worked out.\n\n15:54.160 --> 15:59.400\n And even, even it is when you think about it and I didn't think about it when you're\n\n15:59.400 --> 16:02.840\n young, you know, you just emotionally, you accept it.\n\n16:02.840 --> 16:09.640\n But when you think about it, somehow, uh, that new wonderful organization has to organize\n\n16:09.640 --> 16:14.400\n itself even though Lenin predicted that the state eventually would go away.\n\n16:14.400 --> 16:15.960\n Well, how does it, how does that work?\n\n16:15.960 --> 16:17.840\n Then you have like anarchy, right?\n\n16:17.840 --> 16:19.860\n You have to have an organization.\n\n16:19.860 --> 16:26.800\n The only way to really organize a large number of people is with a hierarchy.\n\n16:26.800 --> 16:32.800\n So and who gets to the top, the ones that are, that want to go to the top, the ones\n\n16:32.800 --> 16:37.360\n that believe in themselves, the ones, the ones that know better than everybody else.\n\n16:37.360 --> 16:41.880\n And once you have that hierarchy established, uh, there is no guarantee that it doesn't\n\n16:41.880 --> 16:43.640\n that it won't go bad.\n\n16:43.640 --> 16:48.900\n And actually when you look at history, every such hierarchy has gone bad.\n\n16:48.900 --> 16:55.320\n You know, you look at Cuba, for instance, I believe Fidel Castro was a, an honest revolutionary.\n\n16:55.320 --> 16:58.340\n I do believe that.\n\n16:58.340 --> 17:00.960\n And so what did Cuba turn into?\n\n17:00.960 --> 17:01.960\n Yeah.\n\n17:01.960 --> 17:06.000\n There's something about, and you speak about Vladimir Putin in this way, but let's step\n\n17:06.000 --> 17:08.820\n away from that for a second.\n\n17:08.820 --> 17:15.680\n Is there something about being an honest revolutionary that wants to do good for their country and\n\n17:15.680 --> 17:20.980\n you start to believe that, you know, better than everyone else how to do good on the country\n\n17:20.980 --> 17:30.040\n and you very well might first, but then somehow that grows into a distortion field where,\n\n17:30.040 --> 17:33.160\n you know, you keep believing, you know, what's right.\n\n17:33.160 --> 17:38.220\n And all the people who disagree with you, you stop seeing them as having a point.\n\n17:38.220 --> 17:46.400\n You instead see them as like, um, um, evil manipulators of the truth that are actually\n\n17:46.400 --> 17:49.840\n trying to hurt people for their own greed, for their own power.\n\n17:49.840 --> 17:54.200\n And you will protect the people because you know, what's good in the case of Stalin.\n\n17:54.200 --> 18:02.400\n I, I mean, I don't know, but it seems like he really believed that communism would bring\n\n18:02.400 --> 18:04.240\n about a much better world.\n\n18:04.240 --> 18:12.400\n I mean, there was a sense the, you have to crack a few eggs to make an omelet, this idea\n\n18:12.400 --> 18:18.680\n that sacrifice is necessary to bring about a greater world.\n\n18:18.680 --> 18:27.800\n And then the other aspect is sort of ruling by terror, creating terrorism, justified political\n\n18:27.800 --> 18:30.680\n mechanism to achieve a better world.\n\n18:30.680 --> 18:35.320\n But it wasn't, I mean, perhaps he had to do that to be able to sleep at night with the\n\n18:35.320 --> 18:37.120\n atrocities he's committing.\n\n18:37.120 --> 18:41.280\n He's, I think he believed he will bring about a better world.\n\n18:41.280 --> 18:42.280\n Yeah.\n\n18:42.280 --> 18:43.880\n And by the way, the terror didn't start with Stalin.\n\n18:43.880 --> 18:52.960\n It started right after the Bolsheviks took over when Lenin told Mr. Dzerzhinsky, Commodore\n\n18:52.960 --> 19:03.240\n Dzerzhinsky to build the Cheka and then execute the, this is what he called it, the red terror.\n\n19:03.240 --> 19:11.080\n So at the birth of the Soviet Union, there was already terror and it was deliberate.\n\n19:11.080 --> 19:18.680\n And it also was, it wasn't just focused on the enemies, it was focused on whoever you\n\n19:18.680 --> 19:19.680\n didn't like.\n\n19:19.680 --> 19:27.240\n There was no rule of law, there was no court cases, people were just pulled out of their\n\n19:27.240 --> 19:31.620\n apartments and shot on sight.\n\n19:31.620 --> 19:40.480\n And this was done by revolutionaries who were convinced that eventually, these sacrifices\n\n19:40.480 --> 19:44.680\n had to be made and eventually that would lead to a much better planet.\n\n19:44.680 --> 19:48.880\n And the populace believed this too, that those sacrifices in part.\n\n19:48.880 --> 19:59.720\n I mean, this is such a dark thing about dictatorships is you believe it, but you're also too afraid\n\n19:59.720 --> 20:01.560\n to question your beliefs.\n\n20:01.560 --> 20:06.840\n Like, you're not directly afraid, but almost like, I don't know what that is.\n\n20:06.840 --> 20:08.960\n That's almost like a subconscious fear.\n\n20:08.960 --> 20:13.400\n Like don't, there's a dark room with a locked door, don't look in that door.\n\n20:13.400 --> 20:14.400\n Don't check that door.\n\n20:14.400 --> 20:19.880\n And there's something about the United States that says, especially modern culture, it's\n\n20:19.880 --> 20:25.400\n like go to that door first and sort of question everything kind of, that's the power of the\n\n20:25.400 --> 20:31.160\n freedom of speech and the freedom of the press, but you can get almost become too critical\n\n20:31.160 --> 20:33.320\n and too cynical of your own culture in that way.\n\n20:33.320 --> 20:39.080\n So there's a balance to strike, of course, but man, if communism is not a lesson of human\n\n20:39.080 --> 20:44.360\n nature, I don't know what is, but you believed, without thinking too much about it, you believed\n\n20:44.360 --> 20:51.200\n in the story of, what did you see, just, you know, I came from the Soviet Union.\n\n20:51.200 --> 21:01.480\n What did you maybe feel that's right and good about communism, about the vision of communism?\n\n21:01.480 --> 21:02.480\n Do you remember?\n\n21:02.480 --> 21:12.680\n I think the biggest impetus in me believing in communism was that the communists, just\n\n21:12.680 --> 21:20.000\n before Hitler took over, the communists were the only force in Germany that fought the\n\n21:20.000 --> 21:26.320\n Nazis in the streets, and that's a historic truth.\n\n21:26.320 --> 21:34.320\n And communists were hunted down by the Nazis, killed, put in concentration camps.\n\n21:34.320 --> 21:41.320\n And so what we knew, what we were taught, and I think that was a huge unforced error\n\n21:41.320 --> 21:46.360\n by the Western countries, particularly the United States, that there were ex Nazis in\n\n21:46.360 --> 21:49.560\n the government in West Germany.\n\n21:49.560 --> 21:57.980\n And the most famous one was Reinhard Galen, who was in charge, was the general in charge\n\n21:57.980 --> 22:05.440\n of the intelligence on the Eastern Front under Hitler.\n\n22:05.440 --> 22:15.800\n And when the Allied won the war, it was decided that Galen was too important, his knowledge\n\n22:15.800 --> 22:21.080\n and his organization was too important to not use.\n\n22:21.080 --> 22:26.560\n So he was coopted by the CIA and eventually wound up being the head of the Bundesnachrichtendienst,\n\n22:26.560 --> 22:29.480\n the CIA of West Germany.\n\n22:29.480 --> 22:36.520\n That gave us, us, when I say us, the East German party, a huge propaganda victory.\n\n22:36.520 --> 22:42.300\n I wanted to, because the emotional aspect of this was as follows.\n\n22:42.300 --> 22:54.400\n When we were in, juniors in high school, and in those days, you were only allowed to go\n\n22:54.400 --> 22:57.120\n to high school if you were in the top 10% of students, okay?\n\n22:57.120 --> 23:02.640\n So this was going to be the next set of ruling elite in the country.\n\n23:02.640 --> 23:09.000\n We were sent, we were required to visit a concentration camp.\n\n23:09.000 --> 23:18.200\n And if you know what we as 17 year olds were made to look at, it was gut wrenching.\n\n23:18.200 --> 23:28.080\n How can men do something like that to men, piles of corpses, lampshades made out of human\n\n23:28.080 --> 23:38.200\n skin because that skin had tattoos on them, and shrunken heads like the size of my fist.\n\n23:38.200 --> 23:42.640\n I mean, the girls all cried, and it made a huge impression.\n\n23:42.640 --> 23:48.600\n And that was the Nazis, and the Communists defeated the Nazis.\n\n23:48.600 --> 23:49.600\n They were the good guys.\n\n23:49.600 --> 23:53.780\n Of course, in hindsight, if the Communists had come to power, it would have been just\n\n23:53.780 --> 23:59.000\n the other way around, as we know, given the example of Stalin and Mao, right?\n\n23:59.000 --> 24:02.240\n But we didn't know that.\n\n24:02.240 --> 24:10.920\n From the Russian and Soviet perspective, the Communist regime banded together to win the\n\n24:10.920 --> 24:12.920\n Great Patriotic War.\n\n24:12.920 --> 24:18.000\n And that was the second one, the big brother, the Soviet Union.\n\n24:18.000 --> 24:24.500\n I mean, when I was approached by the KGB, that was like, oh, I felt so honored.\n\n24:24.500 --> 24:31.680\n So we should say that we're talking about East Germany, that you're from East Germany.\n\n24:31.680 --> 24:36.760\n Can you describe, you were born four years and what is it?\n\n24:36.760 --> 24:37.760\n Yeah, four years.\n\n24:37.760 --> 24:38.760\n 10 days?\n\n24:38.760 --> 24:39.760\n Yeah, sort of.\n\n24:39.760 --> 24:40.760\n Very good.\n\n24:40.760 --> 24:46.000\n After Germany's unconditional surrender in World War II.\n\n24:46.000 --> 24:47.720\n So what is East Germany?\n\n24:47.720 --> 24:48.720\n What is West Germany?\n\n24:48.720 --> 24:51.120\n What is East and West Germany?\n\n24:51.120 --> 24:52.120\n What is that?\n\n24:52.120 --> 24:53.120\n What's the difference?\n\n24:53.120 --> 24:54.500\n What's the historical context here?\n\n24:54.500 --> 24:55.800\n What is World War II again?\n\n24:55.800 --> 24:59.840\n And then, let's do it for some...\n\n24:59.840 --> 25:05.840\n We don't have to go to World War I, the result of which actually seeded World War II in some\n\n25:05.840 --> 25:06.840\n respect.\n\n25:06.840 --> 25:07.840\n Yes.\n\n25:07.840 --> 25:09.820\n There's a long history, yes.\n\n25:09.820 --> 25:11.320\n But let's start with World War II.\n\n25:11.320 --> 25:20.960\n So when Hitler came to power, he and his leadership decided that the Germans needed more what\n\n25:20.960 --> 25:26.120\n they call Lebensraum, that means room to live.\n\n25:26.120 --> 25:35.160\n And they would start expanding and they went into France, they took Belgium, the Netherlands,\n\n25:35.160 --> 25:44.240\n they annexed Austria and got a piece of Czechoslovakia.\n\n25:44.240 --> 25:53.240\n And then they decided to march into the Soviet Union after they took Poland.\n\n25:53.240 --> 25:55.280\n Cut up Poland together with the Soviet Union.\n\n25:55.280 --> 25:56.280\n Yes.\n\n25:56.280 --> 25:57.280\n They were friends.\n\n25:57.280 --> 25:58.280\n Yes.\n\n25:58.280 --> 26:03.280\n There was a nonaggression pact that was signed by Ribbentrop and Molotov, right?\n\n26:03.280 --> 26:06.280\n I think both parties knew that eventually they would fall apart.\n\n26:06.280 --> 26:14.080\n But at the time, it gave the Soviet Union a little more piece of Poland and a little\n\n26:14.080 --> 26:19.840\n more time to prepare what they thought might happen down the road.\n\n26:19.840 --> 26:29.320\n And the Germans had the time and the ability to pretty much conquer all of Western Europe.\n\n26:29.320 --> 26:33.140\n Do you think Stalin really knew that it's gonna fall apart?\n\n26:33.140 --> 26:36.140\n Why would somebody like Stalin trust somebody like Hitler?\n\n26:36.140 --> 26:42.640\n But why did he blunder so bad not to read the intelligence that was coming his way?\n\n26:42.640 --> 26:43.640\n Oh, he doesn't...\n\n26:43.640 --> 26:46.000\n The troops are amassing on the border of the Soviet Union.\n\n26:46.000 --> 26:48.240\n He didn't trust his own intelligence apparatus.\n\n26:48.240 --> 26:49.240\n Oh, boy.\n\n26:49.240 --> 26:52.540\n Here's one example.\n\n26:52.540 --> 26:59.960\n There was a German communist who went underground when Hitler took over and he went to Japan\n\n26:59.960 --> 27:00.960\n as a journalist.\n\n27:00.960 --> 27:03.320\n His name is Richard Sorge.\n\n27:03.320 --> 27:11.680\n Richard Sorge had really, really good intel about what the Japanese would do and not do.\n\n27:11.680 --> 27:18.080\n I forgot exactly what it was, but it came to Moscow and Stalin totally ignored it.\n\n27:18.080 --> 27:26.680\n And when Sorge was captured by the Japanese, the Soviet Union denied that he was one of\n\n27:26.680 --> 27:35.400\n them there, so he was executed, the paranoia, again, does a lot of damage.\n\n27:35.400 --> 27:41.600\n When you don't believe your own intelligence apparatus, why bother having one?\n\n27:41.600 --> 27:44.960\n Yeah, I mean, there...\n\n27:44.960 --> 27:49.000\n But I'm sure there's contradictory information coming in from the intelligence apparatus,\n\n27:49.000 --> 27:50.000\n so it's difficult.\n\n27:50.000 --> 27:55.720\n I mean, first of all, nobody likes to be disagreed with, especially when you become more and\n\n27:55.720 --> 28:00.760\n more powerful, and then the intelligence apparatus is probably giving information you don't like.\n\n28:00.760 --> 28:09.460\n It's often negative information about, basically, information that says that the decisions you\n\n28:09.460 --> 28:15.600\n made in the past are not great decisions, and that's a difficult truth to deal with.\n\n28:15.600 --> 28:26.200\n So in the modern times, if we hop around briefly, Vladimir Putin has been not happy with the\n\n28:26.200 --> 28:34.040\n intelligence of the FSB, thereby, at least if you read the news, choosing to put more\n\n28:34.040 --> 28:39.920\n priority to the GRU for the intelligence in Ukraine.\n\n28:39.920 --> 28:46.720\n But I guess I suppose the same story happens there, as it does throughout history, is paranoia.\n\n28:46.720 --> 28:59.240\n I give you an example that comes from a very reliable source, and that my best German friend\n\n28:59.240 --> 29:04.560\n worked as a chemist in the Stasi, East German intelligence.\n\n29:04.560 --> 29:15.520\n And he eventually, he rose to the rank of major and was in charge of the forgery department.\n\n29:15.520 --> 29:20.140\n It's very likely that he made passports that I use to travel.\n\n29:20.140 --> 29:24.640\n He was aware that there was intelligence that was collected.\n\n29:24.640 --> 29:26.480\n The Stasi was really good.\n\n29:26.480 --> 29:32.820\n They had about a thousand people in West Germany, undercover agents, some of them in government,\n\n29:32.820 --> 29:37.920\n and the central committee of the party, the decision makers ignored it because it didn't\n\n29:37.920 --> 29:43.600\n quite fit in their worldview, it didn't quite fit into their plans.\n\n29:43.600 --> 29:53.380\n So and one delicious thing that I just want to add on to this, when Gorbachev wrote his\n\n29:53.380 --> 30:01.600\n book about Perestroika and Glasnost, the East German rulers did not like it.\n\n30:01.600 --> 30:03.520\n They were much, much more orthodox.\n\n30:03.520 --> 30:09.240\n So they had to print the books in translation, guess where they wound up.\n\n30:09.240 --> 30:13.480\n They were piled up in the hallways of the Stasi.\n\n30:13.480 --> 30:16.680\n They bought the entire print run.\n\n30:16.680 --> 30:19.540\n It's fascinating.\n\n30:19.540 --> 30:20.820\n So but let's backtrack.\n\n30:20.820 --> 30:26.300\n So Operation Barbarossa, invasion of Hitler to the Soviet Union, and then hopefully that\n\n30:26.300 --> 30:30.540\n leads us all the way to East Germany, West Germany after the end of the war.\n\n30:30.540 --> 30:36.280\n So what happened was the Soviet Union rolled into the eastern part of Germany and the Western\n\n30:36.280 --> 30:49.240\n allies took a larger chunk, which was eventually, it was occupied by the three allies, the French,\n\n30:49.240 --> 30:55.440\n the English and the Americans, and the eastern part was occupied by Soviet troops.\n\n30:55.440 --> 31:01.000\n And the Soviet troops actually conquered Berlin.\n\n31:01.000 --> 31:09.200\n But in a contract, they decided that Berlin would be ruled by the four allies and they\n\n31:09.200 --> 31:15.960\n all had free access to that city.\n\n31:15.960 --> 31:25.360\n I was born in the East German part, which very quickly became ruled by communists, socialists,\n\n31:25.360 --> 31:31.200\n the Communist Party and the Socialist Party United, but the leaders of that new party\n\n31:31.200 --> 31:32.200\n were all communists.\n\n31:32.200 --> 31:34.400\n It's nevertheless called democratic.\n\n31:34.400 --> 31:42.120\n Yes, German Democratic Republic, which was formed a couple of months after I was born.\n\n31:42.120 --> 31:49.600\n I was born into a remote southeastern corner of East Germany.\n\n31:49.600 --> 31:54.520\n And interestingly enough, genetically, I'm only half German.\n\n31:54.520 --> 31:58.720\n The other half is Czech and Polish.\n\n31:58.720 --> 32:07.160\n Because where I grew up, I could walk to the Nysa River, which was the border with Poland,\n\n32:07.160 --> 32:11.960\n and it was only about an hour by bus to get to the Czech border.\n\n32:11.960 --> 32:14.640\n So that's why I'm a mix.\n\n32:14.640 --> 32:20.760\n So okay, so East Germany after the war was communist, socialist, and then the West Germany\n\n32:20.760 --> 32:25.400\n was representing the Western world with democracy.\n\n32:25.400 --> 32:35.200\n And what the United States did, this was really, really very forward looking, very strategic,\n\n32:35.200 --> 32:41.520\n the Marshall Plan to rebuild the economy in the West as compared to what the Soviet Union\n\n32:41.520 --> 32:42.520\n did.\n\n32:42.520 --> 32:48.760\n Whatever they hadn't destroyed on the way in, they took with them on the way out for\n\n32:48.760 --> 32:52.360\n reparations because they had every right to do that.\n\n32:52.360 --> 32:59.280\n But it was not a good idea because East Germany was always behind in economic development\n\n32:59.280 --> 33:01.560\n to their Western counterpart.\n\n33:01.560 --> 33:08.160\n So when you were young, as today, but when you were young, you were clearly an exceptional\n\n33:08.160 --> 33:09.160\n student.\n\n33:09.160 --> 33:10.160\n Yeah.\n\n33:10.160 --> 33:12.880\n You're a brilliant academic superstar.\n\n33:12.880 --> 33:14.900\n Let's go to your childhood.\n\n33:14.900 --> 33:21.800\n What's the fond memory from childhood that you have in being woken up to the beauty of\n\n33:21.800 --> 33:27.640\n this world and sort of being curious about all the mysteries around you that I think\n\n33:27.640 --> 33:33.480\n ultimately lead to academic success?\n\n33:33.480 --> 33:35.040\n Or was it...\n\n33:35.040 --> 33:38.520\n The fondest memory that comes to mind is my first kiss.\n\n33:38.520 --> 33:39.520\n How's that?\n\n33:39.520 --> 33:44.560\n Do you want to go to the details of that?\n\n33:44.560 --> 33:47.220\n What did you make of that kiss?\n\n33:47.220 --> 33:51.400\n What did that teach you about yourself and human nature and all that?\n\n33:51.400 --> 33:53.240\n It taught me only in hindsight.\n\n33:53.240 --> 33:57.640\n At the time, I was just like, my God, I was head over heels in love.\n\n33:57.640 --> 34:00.720\n I was 16 years old.\n\n34:00.720 --> 34:05.160\n And I knew in those days, I admired girls.\n\n34:05.160 --> 34:10.720\n I knew the girls were like sort of magical beings.\n\n34:10.720 --> 34:13.560\n They were not capable of doing evil things.\n\n34:13.560 --> 34:16.160\n They were beautiful and they had to be adored.\n\n34:16.160 --> 34:20.100\n And one of them actually loved me too.\n\n34:20.100 --> 34:23.040\n She came after me initially.\n\n34:23.040 --> 34:25.760\n And that too was magical for you.\n\n34:25.760 --> 34:28.800\n Oh my God, yeah.\n\n34:28.800 --> 34:33.560\n And literally, I dedicated...\n\n34:33.560 --> 34:34.780\n That's when I started studying.\n\n34:34.780 --> 34:39.680\n Up until that point, I just did whatever I had to do to be in A minus students.\n\n34:39.680 --> 34:41.000\n And that's when I started studying.\n\n34:41.000 --> 34:48.040\n And every A that I got, I dedicated to her, sometimes explicitly, because I knew I was\n\n34:48.040 --> 34:50.240\n going to take care of her as I grew up.\n\n34:50.240 --> 34:54.120\n So you're going to have to work hard in this world to be somebody that could be adored\n\n34:54.120 --> 34:55.840\n by those you love.\n\n34:55.840 --> 34:57.200\n Yes, you're right.\n\n34:57.200 --> 35:05.800\n You know that kiss, the next day, I was running around in school with a grin on my face.\n\n35:05.800 --> 35:09.920\n And maybe that in some way, that grin never fades.\n\n35:09.920 --> 35:15.400\n So what about the heartbreak that followed?\n\n35:15.400 --> 35:27.240\n But just to expand on this a little more, because that passion that I had was an indication\n\n35:27.240 --> 35:30.560\n that eventually love would play a big role in my life.\n\n35:30.560 --> 35:31.560\n I wasn't aware of it.\n\n35:31.560 --> 35:34.760\n I was just directed at this one girl.\n\n35:34.760 --> 35:39.840\n But you understood that that feeling that taught you something, like that you're somebody\n\n35:39.840 --> 35:41.840\n that can feel those things.\n\n35:41.840 --> 35:46.440\n And that's a strong part of who you are.\n\n35:46.440 --> 35:50.400\n And therefore, it will also be a part of directing your life trajectory.\n\n35:50.400 --> 35:51.400\n Yeah.\n\n35:51.400 --> 35:55.400\n So we were an item for two years.\n\n35:55.400 --> 35:57.920\n I lost my virginity.\n\n35:57.920 --> 36:01.920\n She was not a virgin at the time.\n\n36:01.920 --> 36:09.760\n My competitor was, he studied medicine in college already.\n\n36:09.760 --> 36:11.880\n In which ways was he better than you?\n\n36:11.880 --> 36:12.880\n He wasn't.\n\n36:12.880 --> 36:14.680\n He was older, and he was more experienced.\n\n36:14.680 --> 36:18.000\n And he was going to be a doctor.\n\n36:18.000 --> 36:21.560\n But I was there, and he was not.\n\n36:21.560 --> 36:24.520\n The presence wins.\n\n36:24.520 --> 36:25.920\n But you still had big dreams.\n\n36:25.920 --> 36:28.520\n You wanted to be a tenured professor.\n\n36:28.520 --> 36:29.520\n Yes, yes.\n\n36:29.520 --> 36:32.400\n So you still want to outdo that guy.\n\n36:32.400 --> 36:33.400\n Oh, yeah.\n\n36:33.400 --> 36:39.200\n And she eventually told me that he was not in the picture anymore.\n\n36:39.200 --> 36:41.120\n So it was back and forth, back and forth.\n\n36:41.120 --> 36:48.880\n And our senior year, we were an item, and I was just dreaming of the future.\n\n36:48.880 --> 36:55.000\n But we didn't figure out that in those days, if she went to college in Berlin and I went\n\n36:55.000 --> 37:06.580\n to college in Jena, and the distance between the two cities was too much for a weekend\n\n37:06.580 --> 37:13.520\n visit, public transportation was very slow, and nobody had cars.\n\n37:13.520 --> 37:18.160\n So the circumstance of life, you drifted apart.\n\n37:18.160 --> 37:23.160\n And so we interacted with a couple of letters, and then I got the goodbye letter.\n\n37:23.160 --> 37:24.960\n Oh, my God.\n\n37:24.960 --> 37:26.680\n That hurt?\n\n37:26.680 --> 37:30.720\n I can still feel it.\n\n37:30.720 --> 37:31.920\n That's a good thing.\n\n37:31.920 --> 37:33.960\n You could feel the pain.\n\n37:33.960 --> 37:36.080\n That's still part of love.\n\n37:36.080 --> 37:39.160\n It's that the pain of loss is still part of love.\n\n37:39.160 --> 37:41.880\n And then you kind of change that.\n\n37:41.880 --> 37:46.640\n You shape it, and you give that love in deeper, more profound ways to future people.\n\n37:46.640 --> 37:47.900\n That's very well put.\n\n37:47.900 --> 37:51.840\n But at the time, it emptied me out.\n\n37:51.840 --> 38:00.640\n If I had a tendency to have suicidal thoughts, I might have killed myself.\n\n38:00.640 --> 38:04.800\n Would you say that was one of the darker moments of your life?\n\n38:04.800 --> 38:07.400\n Let me see.\n\n38:07.400 --> 38:09.120\n As a single moment, yes.\n\n38:09.120 --> 38:19.200\n So I still remember we had a mail slot in the front door, and I wasn't expecting a letter\n\n38:19.200 --> 38:20.640\n any day, and there was the letter.\n\n38:20.640 --> 38:29.060\n I go upstairs into my bedroom, and I open it, and I read it, and just like the life\n\n38:29.060 --> 38:30.060\n went out of me.\n\n38:30.060 --> 38:33.800\n You're just there alone, and you have to experience this pain alone.\n\n38:33.800 --> 38:37.600\n And now you're deeply alone in this world.\n\n38:37.600 --> 38:46.120\n Yes, because there was no emotional relationship with my parents.\n\n38:46.120 --> 38:47.480\n I literally had nobody.\n\n38:47.480 --> 38:51.520\n So this love you have in you had no place to go.\n\n38:51.520 --> 38:55.060\n It was choked off, all right?\n\n38:55.060 --> 39:02.960\n But what I did was I wanted to go on, right?\n\n39:02.960 --> 39:07.560\n And so I threw myself into the study of chemistry.\n\n39:07.560 --> 39:13.920\n I outworked all of my fellow students in a big way.\n\n39:13.920 --> 39:20.240\n I worked my ass off, and since I was pretty smart, too, I just aced practically everything.\n\n39:20.240 --> 39:24.120\n And for the first two years in college, and look, we go to college, there are all these\n\n39:24.120 --> 39:26.080\n pretty girls, and there's dances and everything.\n\n39:26.080 --> 39:32.800\n We had this great student club where I didn't look at any girls.\n\n39:32.800 --> 39:38.160\n Eventually I knew I was going to, you know, want to have female companionship, but love?\n\n39:38.160 --> 39:39.160\n Uh uh.\n\n39:39.160 --> 39:40.160\n No more.\n\n39:40.160 --> 39:41.160\n That hurts.\n\n39:41.160 --> 39:43.160\n There's a song that goes, love hurts.\n\n39:43.160 --> 39:44.840\n Yeah, I know that one.\n\n39:44.840 --> 39:45.840\n That's true.\n\n39:45.840 --> 39:50.760\n There's actually many songs that have a similar message, yes.\n\n39:50.760 --> 39:58.240\n So during that time, during your excellence, just being an exceptional student of chemistry,\n\n39:58.240 --> 39:59.240\n let's go to your story.\n\n39:59.240 --> 40:06.200\n So in your book, Deep Undercover, My Secret Life and Tangled Allegiances as a KGB Spy\n\n40:06.200 --> 40:12.120\n in America, and in the really, really excellent podcast series that I've been listening to,\n\n40:12.120 --> 40:15.120\n people should definitely listen to, it's called The Agent.\n\n40:15.120 --> 40:19.760\n You document your time as a KGB spy before, during, and after.\n\n40:19.760 --> 40:28.280\n Can you tell the story of when you first were contacted by the KGB, how you were invited,\n\n40:28.280 --> 40:30.440\n the offer to join was made?\n\n40:30.440 --> 40:36.160\n Well, it was a big surprise, and I never thought of myself as a potential agent.\n\n40:36.160 --> 40:42.640\n You know, I was going to be a tenured professor and join the ruling elite, because in Europe,\n\n40:42.640 --> 40:44.360\n tenured professors are few.\n\n40:44.360 --> 40:48.840\n It's not like in the United States, you know, anybody who teaches at colleges has a title\n\n40:48.840 --> 40:49.840\n of professor.\n\n40:49.840 --> 40:50.840\n Easy now.\n\n40:50.840 --> 40:51.840\n It's true.\n\n40:51.840 --> 40:52.840\n That's not a criticism.\n\n40:52.840 --> 40:53.840\n That's 100%.\n\n40:53.840 --> 41:00.640\n So we should also clarify that, tenured professor or not, it is a very prestigious position\n\n41:00.640 --> 41:03.440\n throughout history of Europe.\n\n41:03.440 --> 41:09.520\n I would say, especially communists, I don't actually know the full landscape of the respect,\n\n41:09.520 --> 41:13.560\n but at least in the Soviet Union where I grew up, it's a prestigious position.\n\n41:13.560 --> 41:14.560\n Absolutely was.\n\n41:14.560 --> 41:22.520\n And the town of Yanuk had about 100,000 people live there, and I would, it's a wild guess,\n\n41:22.520 --> 41:26.880\n but maybe 30 tenured professors, and they were part of the ruling elite.\n\n41:26.880 --> 41:32.360\n I was trying to do as much as I can to live the good life, right?\n\n41:32.360 --> 41:35.760\n You know, have access to things that are nice.\n\n41:35.760 --> 41:41.840\n Yeah, but I think the powerful thing about being a professor in that context of East\n\n41:41.840 --> 41:44.540\n Germany is the prestige.\n\n41:44.540 --> 41:47.240\n And the feeling of superiority.\n\n41:47.240 --> 41:49.600\n You know, I was full of myself.\n\n41:49.600 --> 41:57.360\n You know, when you are the best of the best, and in my third year I received a scholarship,\n\n41:57.360 --> 42:05.160\n the Karl Marx Scholarship, that was limited to 100 concurrent recipients in the country.\n\n42:05.160 --> 42:08.400\n So my God, you know, I was full of myself.\n\n42:08.400 --> 42:11.720\n I believed in myself, hook, line, and sinker.\n\n42:11.720 --> 42:22.760\n And I was also, I got a lot of accolades from teachers and fellow students.\n\n42:22.760 --> 42:29.020\n They were feeding the ego, the old, I mean, you have to believe in yourself often when\n\n42:29.020 --> 42:32.400\n you're young to truly, to excel.\n\n42:32.400 --> 42:34.900\n And you sure as heck did.\n\n42:34.900 --> 42:39.520\n But you know, as a balance, you need a mentor, somebody who puts things in perspective, and\n\n42:39.520 --> 42:41.160\n I didn't have one.\n\n42:41.160 --> 42:44.000\n My father was a nonentity and nobody else.\n\n42:44.000 --> 42:46.000\n They all looked up to me.\n\n42:46.000 --> 42:47.960\n I was an up and coming guy, right?\n\n42:47.960 --> 42:50.400\n So there's no father figure that put you in your place.\n\n42:50.400 --> 42:51.440\n Not at all.\n\n42:51.440 --> 42:53.200\n And I give you one extreme example.\n\n42:53.200 --> 43:00.240\n It was down the road when I fathered a child out of wedlock.\n\n43:00.240 --> 43:03.360\n That was in my fifth year, I believe.\n\n43:03.360 --> 43:07.120\n The Communist Party in East Germany was very moralistic.\n\n43:07.120 --> 43:13.680\n If you did that, they would have a talk with you and give you whatever, a severe reprimand.\n\n43:13.680 --> 43:16.560\n Nobody even mentioned a word about this.\n\n43:16.560 --> 43:20.400\n So yeah, so this is how this ego gets nurtured.\n\n43:20.400 --> 43:25.280\n But anyway, getting back to how the KGB came in contact.\n\n43:25.280 --> 43:34.320\n So they most likely got knowledge of me by, you know, looking at Stasi records.\n\n43:34.320 --> 43:35.320\n What's Stasi?\n\n43:35.320 --> 43:42.280\n That was East German secret police, Staatssicherheit, security for the state.\n\n43:42.280 --> 43:45.760\n There's that word security again.\n\n43:45.760 --> 43:50.720\n And they pretty much kept a record on everybody in the country.\n\n43:50.720 --> 43:55.920\n And so when you look through this, and this is what the KGB was looking for.\n\n43:55.920 --> 44:00.000\n They were looking for candidates, particularly for this kind of job that they had in mind\n\n44:00.000 --> 44:09.200\n for me, for candidates who were not, you know, in their mid 20s, who were not fully developed\n\n44:09.200 --> 44:17.240\n yet, but mature enough to get there and still young enough, right?\n\n44:17.240 --> 44:20.200\n Because at that level of maturity, you can test whether they can handle this kind of\n\n44:20.200 --> 44:21.200\n job.\n\n44:21.200 --> 44:22.200\n Yes.\n\n44:22.200 --> 44:23.200\n Absolutely right.\n\n44:23.200 --> 44:32.000\n And one day I got a knock on my door and my dorm room door was on a Saturday.\n\n44:32.000 --> 44:37.400\n And they knew that I was by myself.\n\n44:37.400 --> 44:39.680\n How did they know it?\n\n44:39.680 --> 44:43.600\n We had a, I pieced this together.\n\n44:43.600 --> 44:51.220\n We had an exchange student from the Soviet Union, and he was next door to me.\n\n44:51.220 --> 44:54.240\n And he befriended me.\n\n44:54.240 --> 44:57.360\n So he got to know me a little bit.\n\n44:57.360 --> 45:02.600\n And the pattern was that my roommate would always go home for the weekend.\n\n45:02.600 --> 45:08.960\n And of course they also knew which door to knock on, even though there were no nameplates.\n\n45:08.960 --> 45:11.000\n Somebody knocks.\n\n45:11.000 --> 45:17.000\n And I knew it was a stranger because if it had been a student, the pattern was that we\n\n45:17.000 --> 45:18.680\n would knock on the door and then go in.\n\n45:18.680 --> 45:22.000\n We wouldn't wait for somebody to let us in.\n\n45:22.000 --> 45:26.880\n So I waited for 10 seconds and he didn't come in.\n\n45:26.880 --> 45:28.600\n I knew that it was a stranger.\n\n45:28.600 --> 45:30.640\n I said, come on in.\n\n45:30.640 --> 45:34.640\n And in came a person who spoke fluent German.\n\n45:34.640 --> 45:36.440\n So that was not a KGB guy.\n\n45:36.440 --> 45:40.140\n That was a collaborator.\n\n45:40.140 --> 45:42.360\n And so he started making a bunch of small talk.\n\n45:42.360 --> 45:52.000\n He introduced himself as a representative of Carl Zeiss Jena, which was the optics company\n\n45:52.000 --> 45:58.520\n that made really, really good optical instruments, was one of the best in the world.\n\n45:58.520 --> 46:05.200\n So it's like the super prestigious company in that place.\n\n46:05.200 --> 46:11.860\n And he said that he was a representative of that company and he would just want to find\n\n46:11.860 --> 46:16.720\n out what my plans were after graduating from college.\n\n46:16.720 --> 46:22.800\n And at that point I knew he wasn't from Carl Zeiss Jena because in those days there was\n\n46:22.800 --> 46:25.000\n no recruitment.\n\n46:25.000 --> 46:34.000\n When you were done, if you were in the top 10% of the graduates, you would most likely\n\n46:34.000 --> 46:37.720\n pick to stay and get a doctorate.\n\n46:37.720 --> 46:40.400\n And the rest of them were assigned.\n\n46:40.400 --> 46:43.180\n You had no choice.\n\n46:43.180 --> 46:48.100\n So that guy was an idiot.\n\n46:48.100 --> 46:50.880\n He didn't know the basics about...\n\n46:50.880 --> 46:57.960\n You interviewed him a little bit to understand, like feel out, is this guy full of shit?\n\n46:57.960 --> 47:00.560\n Because yeah, he's a stranger showing up to your dorm room.\n\n47:00.560 --> 47:06.360\n I knew that at that point, I knew he was a Stasi, which is wrong, but it doesn't matter\n\n47:06.360 --> 47:10.200\n because he was German and I had no idea that the KGB would be involved.\n\n47:10.200 --> 47:17.800\n So sorry to pause briefly, did you have a sense, did people know that there's a Stasi\n\n47:17.800 --> 47:23.920\n type of organization, that there is a large number of people doing this kind of work in\n\n47:23.920 --> 47:27.320\n East Germany in order for you to make that guess?\n\n47:27.320 --> 47:31.240\n Yeah, we knew that the Stasi existed.\n\n47:31.240 --> 47:40.800\n We even had our James Bond, we had a series called the Invisible Visor where a Stasi employee\n\n47:40.800 --> 47:45.040\n in East German would go into West Germany and hunt down Nazis.\n\n47:45.040 --> 47:47.520\n So yes, the Stasi was known to be there.\n\n47:47.520 --> 47:51.600\n And admired in part or feared or both?\n\n47:51.600 --> 47:55.040\n I thought they were necessary and I admired them.\n\n47:55.040 --> 47:56.040\n James Bond.\n\n47:56.040 --> 48:01.520\n Yes, the reason I did so because I had no information to the contrary.\n\n48:01.520 --> 48:16.680\n I never knew anybody personally or even somewhat removed who was followed by the Stasi, was\n\n48:16.680 --> 48:17.680\n put in jail.\n\n48:17.680 --> 48:19.720\n I had no clue.\n\n48:19.720 --> 48:24.420\n I had no clue that they did a lot of damage and that they were doing a lot of surveillance\n\n48:24.420 --> 48:30.240\n of the East German population the same way the KGB did for the Soviet Union.\n\n48:30.240 --> 48:38.400\n So for me to be talking to somebody from the Stasi, it raised my interest.\n\n48:38.400 --> 48:44.220\n I was curious what comes next because I sort of knew something interesting would be coming\n\n48:44.220 --> 48:49.160\n at me and I had no other thoughts about that at that point.\n\n48:49.160 --> 48:56.360\n So when he was finally, when he went for the kill by reversing himself, he said, you know,\n\n48:56.360 --> 49:00.920\n I got to tell you that I really, I really am not from Karl Stasi, you know, I'm from\n\n49:00.920 --> 49:01.920\n the government.\n\n49:01.920 --> 49:02.920\n Okay.\n\n49:02.920 --> 49:05.540\n Thank you for pointing that out.\n\n49:05.540 --> 49:11.920\n And then he asked this question, he says, can you imagine to one day work for the government?\n\n49:11.920 --> 49:14.480\n And so I gave a pretty clever answer.\n\n49:14.480 --> 49:17.680\n I said, yes, but not as a chemist.\n\n49:17.680 --> 49:21.480\n So I answered the question that he didn't ask.\n\n49:21.480 --> 49:23.280\n I helped him out.\n\n49:23.280 --> 49:31.320\n So we made an arrangement to meet for lunch, which in Germany is the main meal at the number\n\n49:31.320 --> 49:35.520\n one restaurant in Vienna, you know, I still remember what I ate.\n\n49:35.520 --> 49:36.700\n What was that?\n\n49:36.700 --> 49:43.120\n Rump steak with butter on top and French fries, it was my favorite.\n\n49:43.120 --> 49:48.920\n Anyway, so when I get to the restaurant, I saw this fellow sitting in the back there\n\n49:48.920 --> 49:52.520\n at the table and there was another person at the table.\n\n49:52.520 --> 49:58.600\n So I was a little bit hesitant because in those days it was not unusual for perfect\n\n49:58.600 --> 50:04.720\n strangers to share a table because there wasn't enough tables and chairs and so forth.\n\n50:04.720 --> 50:09.860\n So I didn't know if I could approach him, but he got up and came to me and he took me\n\n50:09.860 --> 50:15.160\n to the table and he said, I want to introduce Herman.\n\n50:15.160 --> 50:18.280\n We work with our Soviet comrades.\n\n50:18.280 --> 50:21.160\n Aha, KGB.\n\n50:21.160 --> 50:22.160\n And then he disappeared.\n\n50:22.160 --> 50:24.080\n He says, I got something else to do.\n\n50:24.080 --> 50:26.440\n I never knew his name.\n\n50:26.440 --> 50:29.640\n He just handed me over to the KGB.\n\n50:29.640 --> 50:35.300\n What was the relationship between the KGB and Astazies as collaborators, close collaborators\n\n50:35.300 --> 50:37.700\n or just distant associates?\n\n50:37.700 --> 50:43.760\n They were pretty close collaborators as I told you that they bought forged documents\n\n50:43.760 --> 50:47.800\n that the Germans made because the Germans were better at forgery.\n\n50:47.800 --> 50:54.240\n They also exchanged information, but they didn't trust each other 100% and I tell you\n\n50:54.240 --> 50:56.040\n why I know that.\n\n50:56.040 --> 51:01.280\n So they recruited me to send me to West Germany.\n\n51:01.280 --> 51:04.360\n As I already said, East Germany had a thousand agents over there.\n\n51:04.360 --> 51:06.760\n Why would they want to have their own?\n\n51:06.760 --> 51:07.760\n Yeah.\n\n51:07.760 --> 51:08.760\n Yeah.\n\n51:08.760 --> 51:09.760\n Okay.\n\n51:09.760 --> 51:13.200\n This is a fascinating internal and external dynamic of distrust.\n\n51:13.200 --> 51:14.200\n Yeah.\n\n51:14.200 --> 51:15.200\n Okay.\n\n51:15.200 --> 51:19.160\n So there you are welcomed by the KGB.\n\n51:19.160 --> 51:21.320\n When did the offer, the invite come?\n\n51:21.320 --> 51:22.680\n Well, that took a while.\n\n51:22.680 --> 51:29.760\n So Herman and I had an unofficial relationship for about a year and a half.\n\n51:29.760 --> 51:39.520\n I would meet him once a week, once every two weeks, initially in his car, but then he took\n\n51:39.520 --> 51:49.080\n me to a conspirational flat that was an apartment that was occupied by a party member, a lady,\n\n51:49.080 --> 51:50.520\n single lady.\n\n51:50.520 --> 51:55.720\n When we came in, she would leave, she left us tea and cookies and then we could freely\n\n51:55.720 --> 51:56.720\n talk.\n\n51:56.720 --> 52:03.060\n He also at that time gave me some West German literature magazines to read, which was of\n\n52:03.060 --> 52:04.680\n course forbidden.\n\n52:04.680 --> 52:11.280\n So I'm starting to feel somewhat special and as we were talking about what they had in\n\n52:11.280 --> 52:17.840\n mind for me in general, I knew that I was going to be even more special because I would\n\n52:17.840 --> 52:20.640\n be above the law.\n\n52:20.640 --> 52:27.280\n I would operate outside the law of the countries I would go to as well as East Germany because\n\n52:27.280 --> 52:35.680\n the magazines and eventually when I joined up, they told me I had better watch West German\n\n52:35.680 --> 52:43.960\n television, which was also not explicitly prohibited, but it was something that could\n\n52:43.960 --> 52:44.960\n get you in trouble.\n\n52:44.960 --> 52:48.440\n So on many levels, you're super special, you're the James Bond.\n\n52:48.440 --> 52:49.440\n Yes.\n\n52:49.440 --> 52:50.440\n Yes.\n\n52:50.440 --> 52:55.240\n What was that recruitment testing process like?\n\n52:55.240 --> 53:01.600\n Testing whether you have what it takes to be a KGB agent?\n\n53:01.600 --> 53:16.160\n First of all, we had very in depth talks, Herman and I, about life and I still am very\n\n53:16.160 --> 53:19.880\n honest in sharing my feelings.\n\n53:19.880 --> 53:21.600\n Philosophical or personal?\n\n53:21.600 --> 53:22.600\n Personal.\n\n53:22.600 --> 53:26.920\n I even told him that I was shy around the girls.\n\n53:26.920 --> 53:29.640\n He was giving you relationship advice or what?\n\n53:29.640 --> 53:30.640\n How old was he?\n\n53:30.640 --> 53:31.640\n So what was the dynamic?\n\n53:31.640 --> 53:33.680\n Can you tell me, was it a father, son?\n\n53:33.680 --> 53:34.680\n No, older brother.\n\n53:34.680 --> 53:35.680\n Older brother.\n\n53:35.680 --> 53:36.680\n Older brother.\n\n53:36.680 --> 53:42.500\n Yeah, he was maybe in his early to mid 30s and I was maybe 10 years younger.\n\n53:42.500 --> 53:43.880\n And what languages did he speak?\n\n53:43.880 --> 53:46.680\n He spoke German pretty well.\n\n53:46.680 --> 53:48.160\n But he's originally from Russia?\n\n53:48.160 --> 53:50.780\n Yeah, with a Russian accent.\n\n53:50.780 --> 53:57.040\n So I got in trouble one time with him when I asked him, is your real name German?\n\n53:57.040 --> 53:58.040\n He didn't like that.\n\n53:58.040 --> 53:59.240\n He didn't like it.\n\n53:59.240 --> 54:00.240\n Was he good with girls?\n\n54:00.240 --> 54:01.240\n No, no.\n\n54:01.240 --> 54:07.680\n I remember what he told me, he says, you've got to understand one thing, they're looking\n\n54:07.680 --> 54:10.080\n for guys too.\n\n54:10.080 --> 54:11.080\n That's all.\n\n54:11.080 --> 54:13.120\n Oh, girls are looking for guys too?\n\n54:13.120 --> 54:14.120\n Yeah.\n\n54:14.120 --> 54:15.120\n Absolutely.\n\n54:15.120 --> 54:16.120\n It's a competitive game.\n\n54:16.120 --> 54:17.120\n Yeah.\n\n54:17.120 --> 54:18.120\n Yeah.\n\n54:18.120 --> 54:23.520\n So that little flame of love that we talked about and all the shapes that it takes in\n\n54:23.520 --> 54:29.280\n our life, did he talk to you about that, that that could be taken advantage of, that that\n\n54:29.280 --> 54:32.040\n could be used or was it implied?\n\n54:32.040 --> 54:36.920\n Yeah, but not in, it was not very focused, not in great detail.\n\n54:36.920 --> 54:43.360\n So let's, so we talked about personal stuff and you know, like, dislikes, he gave me tasks.\n\n54:43.360 --> 54:50.360\n For instance, when my friend and I hitchhiked from East Germany all the way down to Bulgaria,\n\n54:50.360 --> 54:53.280\n he told me to write a report about it, what I saw.\n\n54:53.280 --> 55:01.160\n So fundamentally he wanted to see how well I can write and how well I can report, how\n\n55:01.160 --> 55:04.300\n well I observe.\n\n55:04.300 --> 55:08.120\n He also asked me to write some profiles about fellow students.\n\n55:08.120 --> 55:12.940\n I don't believe that was for them to give him to the Stasi, it was just like, how well\n\n55:12.940 --> 55:14.800\n do I characterize people?\n\n55:14.800 --> 55:21.200\n That's important when you're talking about, when I was in the US, active in the US I operated\n\n55:21.200 --> 55:22.200\n as a spotter.\n\n55:22.200 --> 55:23.200\n So I did exactly that.\n\n55:23.200 --> 55:26.400\n I wrote profiles about people.\n\n55:26.400 --> 55:36.320\n He also gave me some tasks to do that were rather unpleasant.\n\n55:36.320 --> 55:42.720\n He would give me an address and a name of the people who lived at the address and he\n\n55:42.720 --> 55:49.320\n told me to go there, ring the doorbell and find out something about a relative who lived\n\n55:49.320 --> 55:52.580\n in West Germany.\n\n55:52.580 --> 55:55.040\n That is undercover exploration, right?\n\n55:55.040 --> 56:01.600\n So you go, you make up a story and somehow win the confidence of your target to tell\n\n56:01.600 --> 56:04.080\n you something that you want to know.\n\n56:04.080 --> 56:06.040\n Was that, did that come naturally to you?\n\n56:06.040 --> 56:07.080\n No, no, I hated it.\n\n56:07.080 --> 56:09.760\n The charisma involved, which part did you hate?\n\n56:09.760 --> 56:13.440\n Charisma, I think, I didn't know that I had it.\n\n56:13.440 --> 56:15.640\n It took you some time to discover.\n\n56:15.640 --> 56:21.320\n You know, I was, I always was and I still am to some degree a bit shy.\n\n56:21.320 --> 56:26.440\n I lost a lot of the shyness after moving to the South because, here in the United States,\n\n56:26.440 --> 56:31.480\n because you don't have to be shy, you know.\n\n56:31.480 --> 56:33.720\n You can let your love shine.\n\n56:33.720 --> 56:34.720\n That's exactly right.\n\n56:34.720 --> 56:38.840\n So, but anyway, I hated doing that, but I did it well.\n\n56:38.840 --> 56:39.840\n I still remember.\n\n56:39.840 --> 56:46.160\n So I, in those days, I had a beard and I rang the bell and...\n\n56:46.160 --> 56:47.720\n Tall, handsome fella.\n\n56:47.720 --> 56:48.720\n Yeah.\n\n56:48.720 --> 56:54.880\n And I looked the part, I said, I'm a sociology student and I'm doing a survey and I asked\n\n56:54.880 --> 56:58.720\n a whole bunch of questions, would you like to answer the questions?\n\n56:58.720 --> 57:00.760\n No problem.\n\n57:00.760 --> 57:09.240\n And then I directed the conversation to the lady's private life and she actually gave\n\n57:09.240 --> 57:10.240\n me information.\n\n57:10.240 --> 57:13.280\n She volunteered information that I wanted to know.\n\n57:13.280 --> 57:14.280\n Beautiful.\n\n57:14.280 --> 57:15.280\n I did well.\n\n57:15.280 --> 57:22.640\n And the other one that I didn't like, but I also did well with, when Herman drove me\n\n57:22.640 --> 57:27.600\n around the city and showed me a building and he said, find out what organization is in\n\n57:27.600 --> 57:29.720\n there, what they do.\n\n57:29.720 --> 57:33.960\n We get to know some people and I did that pretty well also.\n\n57:33.960 --> 57:40.440\n You know, you have to be inventive, you know, to come up with a cover story and I've always\n\n57:40.440 --> 57:48.720\n been quite inventive, you know, I'm a storyteller at heart and that, I didn't know it then,\n\n57:48.720 --> 57:49.720\n but you know, I...\n\n57:49.720 --> 57:52.000\n But there was still something unpleasant about it.\n\n57:52.000 --> 57:53.000\n Yes.\n\n57:53.000 --> 57:54.000\n Yes.\n\n57:54.000 --> 57:55.000\n Which part was unpleasant?\n\n57:55.000 --> 57:59.040\n Well, the shyness and then, you know, I wasn't very comfortable lying.\n\n57:59.040 --> 58:08.560\n I became comfortable down the road, but you know, I was brutally honest and never hid\n\n58:08.560 --> 58:12.000\n anything of me.\n\n58:12.000 --> 58:21.240\n But you know, over time you lose that uncomfortable feeling and you rationalize that you've got\n\n58:21.240 --> 58:22.240\n to do it.\n\n58:22.240 --> 58:23.840\n There's only one way, right?\n\n58:23.840 --> 58:25.120\n And you're serving a good cause.\n\n58:25.120 --> 58:28.320\n So you were talking to Herman for a year and a half?\n\n58:28.320 --> 58:29.360\n A year and a half.\n\n58:29.360 --> 58:31.280\n And then how did that progress?\n\n58:31.280 --> 58:32.280\n Yes.\n\n58:32.280 --> 58:40.520\n So he finally, I guess he sent a report to headquarters in Berlin and then he sent me\n\n58:40.520 --> 58:45.160\n on a three week, quote unquote, practice trip to Berlin.\n\n58:45.160 --> 58:53.640\n This was the first time when I had like a conspiratorial meeting where I had an address\n\n58:53.640 --> 58:59.080\n and a time and a code phrase and I met another agent.\n\n58:59.080 --> 59:01.540\n His name was Boris.\n\n59:01.540 --> 59:02.840\n These names were meaningless.\n\n59:02.840 --> 59:04.800\n They were all like cover names, right?\n\n59:04.800 --> 59:06.480\n So what was the code and the meaning?\n\n59:06.480 --> 59:07.480\n What was then?\n\n59:07.480 --> 59:08.640\n Can you give a little more detail?\n\n59:08.640 --> 59:10.420\n That code I don't remember.\n\n59:10.420 --> 59:13.240\n Not the code, but like, what do you mean by code?\n\n59:13.240 --> 59:14.240\n So what was...\n\n59:14.240 --> 59:22.360\n I tell you, the code we used when I met while I was active, I would approach the other person\n\n59:22.360 --> 59:25.620\n who I thought may be the person I want to meet.\n\n59:25.620 --> 59:36.000\n We both had something with us or on us to make us more likely to be the right person.\n\n59:36.000 --> 59:45.880\n And I would ask him the following questions, excuse me, I'm looking for Susan Green.\n\n59:45.880 --> 59:48.680\n And he would answer, yes, you must be David.\n\n59:48.680 --> 59:50.400\n Stupid.\n\n59:50.400 --> 59:56.440\n If I ask a stranger, they would look at me, well, how could I help you?\n\n59:56.440 --> 59:58.680\n So I know it's the wrong guy.\n\n59:58.680 --> 1:00:03.360\n It's just a low probability that the right thing would be said, so it's a nice entry.\n\n1:00:03.360 --> 1:00:08.280\n And it seems like a safe statement if it's not the right person, it would just come off\n\n1:00:08.280 --> 1:00:10.840\n absurd or crazy or whatever.\n\n1:00:10.840 --> 1:00:12.840\n You would have made a good secret agent.\n\n1:00:12.840 --> 1:00:13.840\n You know exactly...\n\n1:00:13.840 --> 1:00:15.960\n How do you know I'm not?\n\n1:00:15.960 --> 1:00:16.960\n This is...\n\n1:00:16.960 --> 1:00:19.160\n We'll discuss this further.\n\n1:00:19.160 --> 1:00:21.160\n I'm dressed like one.\n\n1:00:21.160 --> 1:00:24.040\n Actually, yeah, were there any dress code?\n\n1:00:24.040 --> 1:00:26.200\n No, just fit in.\n\n1:00:26.200 --> 1:00:27.200\n Fit in.\n\n1:00:27.200 --> 1:00:28.200\n No matter what.\n\n1:00:28.200 --> 1:00:29.200\n And then be creative.\n\n1:00:29.200 --> 1:00:30.200\n Yeah.\n\n1:00:30.200 --> 1:00:31.200\n Figure out ways to fit.\n\n1:00:31.200 --> 1:00:32.200\n Right.\n\n1:00:32.200 --> 1:00:40.000\n So anyways, he gave me some tasks and since I had rented a room in a house, he gave me\n\n1:00:40.000 --> 1:00:54.080\n Western literature to read and we spent time together and there was a practice run to West\n\n1:00:54.080 --> 1:00:55.080\n Germany.\n\n1:00:55.080 --> 1:00:58.760\n Actually, there were two and that was very important.\n\n1:00:58.760 --> 1:01:01.680\n In hindsight, I figured that out.\n\n1:01:01.680 --> 1:01:08.200\n So I traveled to West Germany, no, not to West Berlin, with an East German passport\n\n1:01:08.200 --> 1:01:13.840\n that was stamped that that individual was allowed to go to the West.\n\n1:01:13.840 --> 1:01:24.240\n And there was a part of the border that was only guarded by Soviet troops and that's where\n\n1:01:24.240 --> 1:01:26.320\n they smuggled me into West Germany.\n\n1:01:26.320 --> 1:01:33.760\n I got on the subway and then appeared in West Berlin.\n\n1:01:33.760 --> 1:01:38.120\n No Americans, no Brits, no French knew that I had entered.\n\n1:01:38.120 --> 1:01:39.120\n Irish documents?\n\n1:01:39.120 --> 1:01:41.880\n No, no, this was an East German passport.\n\n1:01:41.880 --> 1:01:42.880\n It was real.\n\n1:01:42.880 --> 1:01:43.880\n Okay.\n\n1:01:43.880 --> 1:01:44.880\n Okay.\n\n1:01:44.880 --> 1:01:52.720\n So and the first trip, all they wanted me to do is just walk around, smell the air,\n\n1:01:52.720 --> 1:01:57.920\n have a beer or whatever and eat a sausage and then come back.\n\n1:01:57.920 --> 1:02:04.400\n The second trip, I had a task very similar to the one that I had back in Jena to ring\n\n1:02:04.400 --> 1:02:11.280\n the doorbell someplace and talk to some people and that worked very well also.\n\n1:02:11.280 --> 1:02:17.560\n I should mention that you talk about that, you know, eat a sausage, drink some beer.\n\n1:02:17.560 --> 1:02:24.260\n I suppose that's a good test too to see how you behave under Western, like when first\n\n1:02:24.260 --> 1:02:25.880\n introduced to the Western culture.\n\n1:02:25.880 --> 1:02:33.200\n Like this is why I might not make a good agent is when I first came to the United States\n\n1:02:33.200 --> 1:02:40.840\n in the supermarket, like bananas, as many bananas as I want to eat.\n\n1:02:40.840 --> 1:02:43.720\n That I think that would break me.\n\n1:02:43.720 --> 1:02:45.400\n It's a shock.\n\n1:02:45.400 --> 1:02:49.120\n It's a shock to have access to Western culture.\n\n1:02:49.120 --> 1:02:57.600\n You're getting very close to the reason they actually made me do these two practice trips.\n\n1:02:57.600 --> 1:03:04.040\n When I first emerged on West Berlin territory, I felt highly uncomfortable.\n\n1:03:04.040 --> 1:03:06.440\n That was at the enemy, right?\n\n1:03:06.440 --> 1:03:12.000\n And I saw the cops everywhere and even though those cops had like light blue uniforms, nothing,\n\n1:03:12.000 --> 1:03:13.600\n they weren't standouts.\n\n1:03:13.600 --> 1:03:18.800\n So I was wondering, you know, if they knew that, you know, I had like KGB on my forehead.\n\n1:03:18.800 --> 1:03:20.920\n So you were paranoid that they would know, they would see.\n\n1:03:20.920 --> 1:03:24.140\n I was scared, but I overcame that.\n\n1:03:24.140 --> 1:03:29.260\n So that's, can we just linger on that because I suppose that's a natural, like if I give\n\n1:03:29.260 --> 1:03:35.720\n anybody on the street the mission to do the mission you had to do is they would be paranoid.\n\n1:03:35.720 --> 1:03:39.280\n That's a natural human feeling is am I being watched?\n\n1:03:39.280 --> 1:03:41.360\n Do they know?\n\n1:03:41.360 --> 1:03:47.720\n Like if you try to steal something from a store, there's going to be a feeling like,\n\n1:03:47.720 --> 1:03:48.720\n are they watching me?\n\n1:03:48.720 --> 1:03:49.720\n Are the cameras watching?\n\n1:03:49.720 --> 1:03:50.720\n Are the people watching me?\n\n1:03:50.720 --> 1:03:51.720\n They all know that kind of stuff.\n\n1:03:51.720 --> 1:03:56.720\n So you have to over, or you have to be somehow rugged and robust to that kind of feeling\n\n1:03:56.720 --> 1:03:57.720\n and overcome it.\n\n1:03:57.720 --> 1:03:58.800\n Yes, exactly.\n\n1:03:58.800 --> 1:04:04.960\n So and something very interesting happened while I was being trained in Berlin, I met\n\n1:04:04.960 --> 1:04:11.180\n a classmate of mine from high school and he confided to me that he was recruited by the\n\n1:04:11.180 --> 1:04:16.400\n Stasi to become a spy, go as a spy to West Germany.\n\n1:04:16.400 --> 1:04:20.760\n And he also had this practice trip and he peed in his pants.\n\n1:04:20.760 --> 1:04:23.800\n He went back and told him, I can't do that.\n\n1:04:23.800 --> 1:04:27.160\n Just from the terror, that paranoia.\n\n1:04:27.160 --> 1:04:30.920\n Now this guy's career was over.\n\n1:04:30.920 --> 1:04:39.340\n He had an engineering degree, he was a pretty smart guy, he was just for the rest of his\n\n1:04:39.340 --> 1:04:45.720\n life and he's still alive I believe, floating around and trading in model railroads and\n\n1:04:45.720 --> 1:04:46.720\n stuff like that.\n\n1:04:46.720 --> 1:04:49.920\n You mean do you think that experience broke him?\n\n1:04:49.920 --> 1:04:51.120\n They wouldn't let him back in.\n\n1:04:51.120 --> 1:04:52.120\n Oh, I see.\n\n1:04:52.120 --> 1:04:53.120\n They, oh.\n\n1:04:53.120 --> 1:04:54.120\n Yeah.\n\n1:04:54.120 --> 1:04:56.800\n So this is a test that if you fail, you pay the price.\n\n1:04:56.800 --> 1:05:03.280\n I had no idea that, you know, something bad would happen if I failed that test, but I\n\n1:05:03.280 --> 1:05:04.280\n didn't.\n\n1:05:04.280 --> 1:05:05.280\n Yeah.\n\n1:05:05.280 --> 1:05:06.280\n I didn't fail.\n\n1:05:06.280 --> 1:05:13.280\n So, and this led then to the offer, all right, and after, you know, Boris was happy with\n\n1:05:13.280 --> 1:05:21.040\n me and he told his boss who was most likely the head of the KGB in East Berlin and I had\n\n1:05:21.040 --> 1:05:22.920\n an appointment to meet.\n\n1:05:22.920 --> 1:05:23.920\n In East Germany.\n\n1:05:23.920 --> 1:05:24.920\n Yes.\n\n1:05:24.920 --> 1:05:25.920\n In East Germany.\n\n1:05:25.920 --> 1:05:26.920\n Yeah.\n\n1:05:26.920 --> 1:05:27.920\n All of East Germany.\n\n1:05:27.920 --> 1:05:28.920\n Yes.\n\n1:05:28.920 --> 1:05:29.920\n That's right.\n\n1:05:29.920 --> 1:05:35.280\n An appointment to meet with him and as we walk into the room, there was this huge desk\n\n1:05:35.280 --> 1:05:45.960\n and a little guy sitting behind it, very, very, just like little and unimpressive, right?\n\n1:05:45.960 --> 1:05:53.640\n A lot of paraphernalia, like, you know, had a bust of Dzerzhinsky on his desk and some\n\n1:05:53.640 --> 1:06:03.560\n paintings of Lenin and so forth, but when the guy opened his mouth, he went like, whoa.\n\n1:06:03.560 --> 1:06:06.280\n Huge psychological energy.\n\n1:06:06.280 --> 1:06:12.400\n He spoke only Russian now and initially, he would, you know, start the bet with five minutes\n\n1:06:12.400 --> 1:06:17.040\n worth of propaganda, why we're doing what we're doing, I didn't need that, I understood\n\n1:06:17.040 --> 1:06:25.240\n most of it, but when I didn't understand, I'd ask Boris to translate and then he sprung\n\n1:06:25.240 --> 1:06:27.080\n it on me and I was not prepared.\n\n1:06:27.080 --> 1:06:30.840\n He said, so what, are you in or not?\n\n1:06:30.840 --> 1:06:34.720\n And I was, no, I hadn't made up my mind.\n\n1:06:34.720 --> 1:06:43.280\n I wasn't expecting that would come and so I said to him, I'm not really trained, you\n\n1:06:43.280 --> 1:06:46.840\n know, there's a lot of things I need to learn and I came up with a couple of really stupid\n\n1:06:46.840 --> 1:06:51.720\n things, one not so stupid, but the other one was, I don't know why I said that, I said,\n\n1:06:51.720 --> 1:06:58.400\n for instance, I need to learn how to drive a car and to type with a typewriter and he\n\n1:06:58.400 --> 1:07:03.200\n got really annoyed and he said, don't worry about it, we'll train you.\n\n1:07:03.200 --> 1:07:06.480\n But I got to tell you, we need people who are decisive.\n\n1:07:06.480 --> 1:07:12.840\n So you got until tomorrow noon to give Boris your decision.\n\n1:07:12.840 --> 1:07:15.480\n That made for a sleepless night.\n\n1:07:15.480 --> 1:07:17.320\n So what was going through your mind?\n\n1:07:17.320 --> 1:07:26.160\n Well I had, this was almost 50, 50, I knew I was going to have a huge career, a good\n\n1:07:26.160 --> 1:07:27.160\n career.\n\n1:07:27.160 --> 1:07:35.240\n It was on my way because I was already employed by the university as an assistant professor.\n\n1:07:35.240 --> 1:07:40.760\n So that career would be to become a professor, become a 10 year professor, be a world class.\n\n1:07:40.760 --> 1:07:41.760\n Yes.\n\n1:07:41.760 --> 1:07:43.560\n Jena had become my hometown.\n\n1:07:43.560 --> 1:07:45.400\n I really loved the place.\n\n1:07:45.400 --> 1:07:54.520\n It was my oyster and my family was my basketball team.\n\n1:07:54.520 --> 1:07:55.520\n You love playing basketball.\n\n1:07:55.520 --> 1:07:56.520\n Oh absolutely.\n\n1:07:56.520 --> 1:07:57.520\n Yeah.\n\n1:07:57.520 --> 1:07:58.520\n So this is home.\n\n1:07:58.520 --> 1:07:59.520\n This is home.\n\n1:07:59.520 --> 1:08:00.520\n This is where your love is.\n\n1:08:00.520 --> 1:08:01.520\n This was home.\n\n1:08:01.520 --> 1:08:05.240\n Did you understand that the choice involved leaving the home behind?\n\n1:08:05.240 --> 1:08:06.240\n Yes.\n\n1:08:06.240 --> 1:08:11.900\n And the one thing I didn't have, the two things I didn't have, an emotional relationship\n\n1:08:11.900 --> 1:08:16.920\n with my mother and I didn't have a steady girlfriend at the time.\n\n1:08:16.920 --> 1:08:20.120\n I think Freud would have a lot to say about that, but yeah, go ahead.\n\n1:08:20.120 --> 1:08:24.360\n But the connection between those two, but yeah, I'm sure.\n\n1:08:24.360 --> 1:08:29.360\n By the way, my friend Günther, the one who worked for the Stasi, was also, the Stasi\n\n1:08:29.360 --> 1:08:36.240\n tried to recruit him as an agent, but he had a love relationship at the time and he said\n\n1:08:36.240 --> 1:08:37.800\n politely, no, I won't.\n\n1:08:37.800 --> 1:08:38.800\n I can't.\n\n1:08:38.800 --> 1:08:44.520\n So you didn't have, that's the one thing that really could have held you to this place\n\n1:08:44.520 --> 1:08:45.520\n is love.\n\n1:08:45.520 --> 1:08:49.800\n So you got the career on the one hand, my basketball team, the town that I would be\n\n1:08:49.800 --> 1:08:57.520\n part of the ruling elite of, and then we had this great adventure and the ability to contribute\n\n1:08:57.520 --> 1:09:04.660\n to the victory, the worldwide victory of communism and stick it to the Nazis and of course the\n\n1:09:04.660 --> 1:09:07.120\n feeling that you're really special.\n\n1:09:07.120 --> 1:09:08.120\n Yeah.\n\n1:09:08.120 --> 1:09:09.120\n James Bond.\n\n1:09:09.120 --> 1:09:10.120\n Yeah.\n\n1:09:10.120 --> 1:09:15.240\n What's, the question, do I want to be a tenured professor or James Bond?\n\n1:09:15.240 --> 1:09:16.240\n Yes.\n\n1:09:16.240 --> 1:09:19.240\n And as funny as that sounds, that was probably a difficult decision.\n\n1:09:19.240 --> 1:09:27.320\n It was a difficult decision, but fundamentally it wasn't, and it wasn't my zeal to help the\n\n1:09:27.320 --> 1:09:28.320\n revolution.\n\n1:09:28.320 --> 1:09:37.320\n It was my, what they called, what the Stasi was looking for, the KGB was looking for in\n\n1:09:37.320 --> 1:09:42.480\n a character that they would send over a well controlled inclination to adventure.\n\n1:09:42.480 --> 1:09:43.480\n Okay.\n\n1:09:43.480 --> 1:09:44.480\n Yeah.\n\n1:09:44.480 --> 1:09:45.480\n Yeah.\n\n1:09:45.480 --> 1:09:46.480\n James Bond.\n\n1:09:46.480 --> 1:09:49.120\n What do you say?\n\n1:09:49.120 --> 1:09:50.120\n In the love of women.\n\n1:09:50.120 --> 1:09:51.120\n Yeah.\n\n1:09:51.120 --> 1:09:58.640\n I was, yes, I got to put this in right here because I'm telling people I have two things\n\n1:09:58.640 --> 1:10:01.000\n in common with James Bond.\n\n1:10:01.000 --> 1:10:07.560\n These are my initials, JB, and I got the girl too, three times.\n\n1:10:07.560 --> 1:10:08.560\n Yeah.\n\n1:10:08.560 --> 1:10:11.360\n I mean that's, and that's adventure.\n\n1:10:11.360 --> 1:10:12.360\n Yeah.\n\n1:10:12.360 --> 1:10:18.600\n And the ability to travel to the West because the West was closed off to us, we could go\n\n1:10:18.600 --> 1:10:21.920\n to foreign countries, but they all had to be communist countries.\n\n1:10:21.920 --> 1:10:29.800\n You know, I wanted to see Paris because I had fallen in love with the Honore Balzac\n\n1:10:29.800 --> 1:10:35.340\n who wrote a phenomenal set of novels that I just ate up.\n\n1:10:35.340 --> 1:10:40.080\n And so when I eventually did go to Paris, I knew all the places already because he described\n\n1:10:40.080 --> 1:10:41.080\n them all.\n\n1:10:41.080 --> 1:10:49.160\n Okay, so that one, it was a, it was 5149, but eventually it, and you know, when you,\n\n1:10:49.160 --> 1:10:55.920\n when you do the side by side intellectual comparison, that doesn't work.\n\n1:10:55.920 --> 1:10:56.920\n It becomes a tie.\n\n1:10:56.920 --> 1:11:00.120\n And then, you know, you just go with your gut and I said, Hey, I'm in.\n\n1:11:00.120 --> 1:11:06.000\n So now that you successfully passed the test and you were sitting with this unimpressive\n\n1:11:06.000 --> 1:11:13.920\n man and had the invite and had to sleep on it and have made the decision to join.\n\n1:11:13.920 --> 1:11:14.920\n Yeah.\n\n1:11:14.920 --> 1:11:15.920\n What was next?\n\n1:11:15.920 --> 1:11:20.160\n I was just told, you know, that I was being recruited by the state department of East\n\n1:11:20.160 --> 1:11:21.160\n Germany.\n\n1:11:21.160 --> 1:11:24.600\n I was going to become a diplomat.\n\n1:11:24.600 --> 1:11:30.480\n I must have had some paper, but I forgot because just by saying so, then that would, that wouldn't\n\n1:11:30.480 --> 1:11:31.480\n have worked.\n\n1:11:31.480 --> 1:11:35.000\n There's some kind of document that says that, and that was the only entanglement you had\n\n1:11:35.000 --> 1:11:37.040\n to that, to that place.\n\n1:11:37.040 --> 1:11:38.040\n No love.\n\n1:11:38.040 --> 1:11:43.040\n No basketball, basketball, giving up basketball was huge for me.\n\n1:11:43.040 --> 1:11:44.920\n I love playing that game.\n\n1:11:44.920 --> 1:11:48.440\n I started playing basketball when I was 18.\n\n1:11:48.440 --> 1:11:49.440\n That's a little late.\n\n1:11:49.440 --> 1:11:51.440\n Are you better offensive, defensive?\n\n1:11:51.440 --> 1:11:52.440\n What do you like more?\n\n1:11:52.440 --> 1:11:54.000\n Do you like to shoot from a distance?\n\n1:11:54.000 --> 1:11:56.360\n Do you like, I was a runner.\n\n1:11:56.360 --> 1:12:01.720\n I was very, very quick on my feet and I was a good jumper too.\n\n1:12:01.720 --> 1:12:09.040\n I typically played the, uh, the, the four position, you know, what's that, uh, forward\n\n1:12:09.040 --> 1:12:11.080\n or the forward position, forward position.\n\n1:12:11.080 --> 1:12:16.320\n But anyway, um, so that, that, that was the hardest, uh, uh, for me to give up.\n\n1:12:16.320 --> 1:12:22.120\n Um, but indeed the other thing that I remember I had to do to hand in my party document to\n\n1:12:22.120 --> 1:12:25.520\n the party secretary of the university.\n\n1:12:25.520 --> 1:12:27.480\n And uh, he made a comment.\n\n1:12:27.480 --> 1:12:28.480\n Yeah.\n\n1:12:28.480 --> 1:12:32.120\n We probably won't hear much about you, but, uh, we know that you're going to do something\n\n1:12:32.120 --> 1:12:33.360\n very important.\n\n1:12:33.360 --> 1:12:39.420\n So he sort of had an inkling that, uh, I'm going, I'm going to go someplace, uh, undercover\n\n1:12:39.420 --> 1:12:40.960\n or something like that.\n\n1:12:40.960 --> 1:12:47.960\n And then I packed my bags and got on a train, uh, to Berlin for another one of those secret\n\n1:12:47.960 --> 1:12:53.640\n meetings with, uh, my, my new handler, Nikolai.\n\n1:12:53.640 --> 1:13:01.400\n So and here, here came another test that, that would have been quite easy to fail.\n\n1:13:01.400 --> 1:13:09.720\n So I, I had lived, uh, in Yena for six years in a dorm, even when I became a, an employee\n\n1:13:09.720 --> 1:13:12.800\n of the university, they didn't, they didn't have apartments.\n\n1:13:12.800 --> 1:13:17.080\n I was still living in a dorm and, and they won in a single room with a bed, a chair and\n\n1:13:17.080 --> 1:13:21.480\n a table and a toilet down the, down the hallway.\n\n1:13:21.480 --> 1:13:26.980\n So I figured, you know, Berlin KGB, I'm going to get a nice apartment, right?\n\n1:13:26.980 --> 1:13:31.700\n And so, uh, uh, Nikolai took me into his car.\n\n1:13:31.700 --> 1:13:35.900\n We started talking a little bit and then he said, I have a task for you already.\n\n1:13:35.900 --> 1:13:40.200\n Your first task is to find yourself a place to live.\n\n1:13:40.200 --> 1:13:46.000\n I mean, I don't think I showed it in my face, but you know, my heart, my, my, my, my heart\n\n1:13:46.000 --> 1:13:48.640\n dropped like down to into my pants.\n\n1:13:48.640 --> 1:13:54.920\n I, I knew this was nearly impossible because it was a severe shortage of, uh, of housing\n\n1:13:54.920 --> 1:14:01.200\n and in, in, in everywhere in Germany, East Germany and all the apartments and homes were\n\n1:14:01.200 --> 1:14:03.940\n controlled by, by the government.\n\n1:14:03.940 --> 1:14:05.920\n You know, there were long waiting lists.\n\n1:14:05.920 --> 1:14:12.340\n Uh, I know, I knew couples that, uh, were promised maybe to get an apartment, uh, five\n\n1:14:12.340 --> 1:14:13.900\n years down the road.\n\n1:14:13.900 --> 1:14:18.200\n So then they would postpone the decision to have a child.\n\n1:14:18.200 --> 1:14:20.120\n Anyway, this was impossible.\n\n1:14:20.120 --> 1:14:26.720\n Uh, well, yeah, but this was a test, you know, because I had to be inventive.\n\n1:14:26.720 --> 1:14:30.680\n Now I had to figure out, uh, how to get out of an impossible situation.\n\n1:14:30.680 --> 1:14:33.520\n I didn't realize it then at all.\n\n1:14:33.520 --> 1:14:37.280\n I just went with the flow, you know, what do I do?\n\n1:14:37.280 --> 1:14:47.120\n So what I did, I went, I took the train, the city train, uh, to the very last stop, a little\n\n1:14:47.120 --> 1:14:49.480\n town called Ackner.\n\n1:14:49.480 --> 1:14:54.740\n And I wandered around in that town and knocked on doors and asked people if they knew where\n\n1:14:54.740 --> 1:14:56.980\n somebody might have a place to live.\n\n1:14:56.980 --> 1:15:00.600\n And after a couple of hours, somebody said, there's this lady that, and she gave, and\n\n1:15:00.600 --> 1:15:05.820\n they gave me the address and I talked to the lady and she said, I happen to have a place\n\n1:15:05.820 --> 1:15:08.880\n that you might, uh, that where you might be able to stay.\n\n1:15:08.880 --> 1:15:10.120\n It was an outbuilding.\n\n1:15:10.120 --> 1:15:13.920\n Uh, I don't know what it was, what it served.\n\n1:15:13.920 --> 1:15:14.920\n It was not a garage.\n\n1:15:14.920 --> 1:15:16.680\n It was concrete.\n\n1:15:16.680 --> 1:15:25.940\n And it had, um, a bed and a chair, uh, running cold water and a stove, a cold stove.\n\n1:15:25.940 --> 1:15:28.120\n That was my, was going to be my...\n\n1:15:28.120 --> 1:15:29.120\n Pretty basic.\n\n1:15:29.120 --> 1:15:30.120\n Pretty basic.\n\n1:15:30.120 --> 1:15:31.120\n That's your...\n\n1:15:31.120 --> 1:15:32.120\n Pretty basic?\n\n1:15:32.120 --> 1:15:33.120\n Are you kidding me?\n\n1:15:33.120 --> 1:15:34.120\n That's the, uh...\n\n1:15:34.120 --> 1:15:35.120\n Toilet across the yard, of course.\n\n1:15:35.120 --> 1:15:36.120\n Yeah.\n\n1:15:36.120 --> 1:15:37.120\n Well, all the essentials.\n\n1:15:37.120 --> 1:15:38.120\n What are you complaining about?\n\n1:15:38.120 --> 1:15:45.320\n So you were, you had to run the, uh, the special, James Bond had to run a special operation\n\n1:15:45.320 --> 1:15:46.320\n out of the house.\n\n1:15:46.320 --> 1:15:54.040\n To, to, to my credit, and I think that, that, uh, that established part of my reputation.\n\n1:15:54.040 --> 1:15:56.960\n I didn't complain at all to Nikolai.\n\n1:15:56.960 --> 1:15:58.560\n That was part of the test probably.\n\n1:15:58.560 --> 1:15:59.560\n Yeah.\n\n1:15:59.560 --> 1:16:01.200\n I just told him, you know, I found something.\n\n1:16:01.200 --> 1:16:08.040\n And so, uh, for six months I would get up in the morning, get on the train and walk\n\n1:16:08.040 --> 1:16:13.920\n around in the city, you know, uh, did some operational stuff, uh, operational training.\n\n1:16:13.920 --> 1:16:18.320\n I went to the library, did a lot of reading in the library.\n\n1:16:18.320 --> 1:16:20.680\n And then I found a basketball team that I could join.\n\n1:16:20.680 --> 1:16:24.040\n So at least I could take a shower twice a week.\n\n1:16:24.040 --> 1:16:34.160\n Um, and, uh, and apparently it took about six months that I was still on probation because\n\n1:16:34.160 --> 1:16:40.600\n after six months, Nikolai, one day we were still meeting in his car, he said, he handed\n\n1:16:40.600 --> 1:16:46.680\n me a key and he said, I'm going to take you to your new apartment.\n\n1:16:46.680 --> 1:16:50.560\n Now I, and I didn't know this, you know, that now I was really in.\n\n1:16:50.560 --> 1:16:51.560\n Okay.\n\n1:16:51.560 --> 1:16:57.000\n Imagine the hurdles you have to jump over and how many times you can fail, but you know.\n\n1:16:57.000 --> 1:17:00.240\n But not complaining, not asking questions.\n\n1:17:00.240 --> 1:17:01.240\n Yes.\n\n1:17:01.240 --> 1:17:03.320\n I mean, that was something you've written about.\n\n1:17:03.320 --> 1:17:07.880\n Um, I think you wrote that bosses do not like to hear complaints or problems.\n\n1:17:07.880 --> 1:17:08.880\n They prefer solutions.\n\n1:17:08.880 --> 1:17:09.880\n That's right.\n\n1:17:09.880 --> 1:17:12.400\n So what was your interaction like with the bosses?\n\n1:17:12.400 --> 1:17:19.800\n Is that essentially, um, represents the way he went forward as well?\n\n1:17:19.800 --> 1:17:25.560\n I, no complaints, no arguments, no, no, I know this better.\n\n1:17:25.560 --> 1:17:30.400\n I was taking it all in now that the, the, the technical guys, you know, they taught\n\n1:17:30.400 --> 1:17:32.640\n me something I didn't know that made sense.\n\n1:17:32.640 --> 1:17:40.280\n Um, what Nikolai, some of the stuff that he taught me was somewhat questionable.\n\n1:17:40.280 --> 1:17:44.800\n He was a generalist and there's some things he didn't know really well.\n\n1:17:44.800 --> 1:17:48.840\n So I could have like asked, probed a little bit, but I didn't.\n\n1:17:48.840 --> 1:17:50.920\n So I just played along.\n\n1:17:50.920 --> 1:17:57.480\n So this new apartment was, uh, uh, it was a studio at, at, at, at a kitchen with running\n\n1:17:57.480 --> 1:18:04.480\n cold water and the bathroom was just one flight down the toilet, not a bathroom, uh, one flight\n\n1:18:04.480 --> 1:18:09.320\n down the stairs, uh, it was a big upgrade.\n\n1:18:09.320 --> 1:18:14.640\n And he gave me, uh, I think he gave me a thousand mark to buy, buy furniture.\n\n1:18:14.640 --> 1:18:20.000\n And in that place, I actually, I also bought a TV and started watching West German television.\n\n1:18:20.000 --> 1:18:25.120\n So I finally had a decent place to stay.\n\n1:18:25.120 --> 1:18:30.760\n Um, and the, the, my training in Berlin took about two years.\n\n1:18:30.760 --> 1:18:31.760\n What was the training?\n\n1:18:31.760 --> 1:18:35.840\n What were the interesting aspects to the training?\n\n1:18:35.840 --> 1:18:39.960\n What were sort of, if you do an overview systematic of what was the training process, what was\n\n1:18:39.960 --> 1:18:45.320\n difficult, what are some insights that generalize to the training process of what it takes to\n\n1:18:45.320 --> 1:18:47.400\n be a KGB spy?\n\n1:18:47.400 --> 1:18:48.400\n Right.\n\n1:18:48.400 --> 1:18:51.840\n So, uh, let me start with the trade craft.\n\n1:18:51.840 --> 1:18:59.280\n So I was taught Morse code that took a while, uh, I, I, I was, uh, instructed in how to,\n\n1:18:59.280 --> 1:19:06.740\n you know, use a shortwave radio and to receive, uh, the, the shortwave, uh, transmissions\n\n1:19:06.740 --> 1:19:08.880\n with Morse code.\n\n1:19:08.880 --> 1:19:17.820\n I was taught, uh, uh, and a encryption and decryption algorithm, manual algorithm, you,\n\n1:19:17.820 --> 1:19:22.760\n you might be interested that eventually I figured out, uh, at least one of the patterns,\n\n1:19:22.760 --> 1:19:30.720\n uh, the, the algorithm was such that the, and this was all about digits, like, uh, and\n\n1:19:30.720 --> 1:19:37.440\n the algorithm was such that in the end, the, uh, the digits that were used to decipher\n\n1:19:37.440 --> 1:19:43.080\n other digits that were handed, uh, that were sent to me by a shortwave radio, there were,\n\n1:19:43.080 --> 1:19:48.080\n let's say if there were a hundred digits, there were an equal number of ones, twos,\n\n1:19:48.080 --> 1:19:52.840\n threes, fours, fives, six, and seven, and up until zero.\n\n1:19:52.840 --> 1:19:58.740\n And I was told that, uh, these, um, uh, algorithms, these manual algorithms were, were good for\n\n1:19:58.740 --> 1:20:00.280\n about 300 uses.\n\n1:20:00.280 --> 1:20:03.080\n After that, they could still be deciphered.\n\n1:20:03.080 --> 1:20:06.680\n I'm assuming nowadays that, uh, wouldn't take as much.\n\n1:20:06.680 --> 1:20:07.680\n Yeah.\n\n1:20:07.680 --> 1:20:09.040\n With, with computers for sure.\n\n1:20:09.040 --> 1:20:15.880\n But there's probably, they're probably designed in a way that you can manually sort of, uh,\n\n1:20:15.880 --> 1:20:22.240\n it's efficient and convenient to use them manually, it's not to optimize cryptographic\n\n1:20:22.240 --> 1:20:27.120\n security, it's to optimize, it's like to balance security and like humans being able to actually.\n\n1:20:27.120 --> 1:20:28.120\n Yeah.\n\n1:20:28.120 --> 1:20:29.120\n No, I got to disagree.\n\n1:20:29.120 --> 1:20:30.600\n It was neither efficient nor convenient.\n\n1:20:30.600 --> 1:20:31.600\n Okay.\n\n1:20:31.600 --> 1:20:32.600\n It took a long time.\n\n1:20:32.600 --> 1:20:33.600\n So it wasn't decipherable.\n\n1:20:33.600 --> 1:20:39.680\n When, what was, what was significantly easier to do, uh, but, uh, that would require you\n\n1:20:39.680 --> 1:20:42.000\n to have spied paraphernalia with you.\n\n1:20:42.000 --> 1:20:44.680\n This is what's called a one time pad.\n\n1:20:44.680 --> 1:20:51.240\n So you have the set of numbers on, on a sheet of paper, uh, that had to be developed.\n\n1:20:51.240 --> 1:20:55.280\n I had to use iodine to make those numbers visible.\n\n1:20:55.280 --> 1:21:01.840\n Those are known to be unbreakable unless they are used multiple times, the same, the same\n\n1:21:01.840 --> 1:21:06.320\n sheet of paper, because, you know, the person who encrypts has the same set of numbers as\n\n1:21:06.320 --> 1:21:14.000\n the person who decrypts and one, one time use, you cannot figure out what the message\n\n1:21:14.000 --> 1:21:15.000\n is.\n\n1:21:15.000 --> 1:21:16.000\n Oh, interesting.\n\n1:21:16.000 --> 1:21:20.240\n But this is a quick way to communicate from one person to another one time, one time.\n\n1:21:20.240 --> 1:21:24.280\n One time, but I had a pad with multiple, uh, sheets of paper, right?\n\n1:21:24.280 --> 1:21:31.760\n And, uh, the reason that they gave me a manual one is because I literally, I had only when\n\n1:21:31.760 --> 1:21:38.560\n I, when I wound up in the United States, I had only one thing with me that, uh, only\n\n1:21:38.560 --> 1:21:39.560\n a spy can have.\n\n1:21:39.560 --> 1:21:46.200\n And that was a, uh, a writing pad with, uh, uh, where the first 10 pages or so were impregnated\n\n1:21:46.200 --> 1:21:49.760\n with a trace of a chemical that was used for secret writing.\n\n1:21:49.760 --> 1:21:53.480\n Uh, but you really would have to know what you're looking for to, you know, you see this\n\n1:21:53.480 --> 1:21:56.320\n pad it was bought at, uh, you know, Walmart and.\n\n1:21:56.320 --> 1:21:58.520\n Can you explain a little, a little further?\n\n1:21:58.520 --> 1:22:01.640\n What is the chemical here that, what are we talking about?\n\n1:22:01.640 --> 1:22:07.120\n So how, I don't understand how it's possible to have a physical pad that does the encryption\n\n1:22:07.120 --> 1:22:09.920\n without any computing.\n\n1:22:09.920 --> 1:22:10.920\n How does it encode?\n\n1:22:10.920 --> 1:22:11.920\n All right.\n\n1:22:11.920 --> 1:22:18.100\n So, so no, no, it doesn't, it doesn't do any work, you know, so, and the, uh, the communication\n\n1:22:18.100 --> 1:22:26.020\n that the encrypted communication was, uh, was, uh, a set of, uh, uh, groups of five,\n\n1:22:26.020 --> 1:22:32.660\n five digits and then another five and there's always a gap in between, um, and, uh, so let's\n\n1:22:32.660 --> 1:22:38.240\n say if I get this radio transmission, I write them all down and then I, then I use my, uh,\n\n1:22:38.240 --> 1:22:42.840\n develop my algorithm and then I do mathematics, either addition or subtraction.\n\n1:22:42.840 --> 1:22:48.840\n The resulting set of digits had then had a one to one correlation to letters.\n\n1:22:48.840 --> 1:22:51.080\n And this is an easy way to then do the correlation.\n\n1:22:51.080 --> 1:22:52.080\n Yes.\n\n1:22:52.080 --> 1:22:53.080\n Yes.\n\n1:22:53.080 --> 1:22:54.080\n Well, that's cool.\n\n1:22:54.080 --> 1:22:56.400\n So you're saying the algorithm was not efficient.\n\n1:22:56.400 --> 1:22:57.400\n It was not.\n\n1:22:57.400 --> 1:23:02.120\n Oh, the manual took a long time and, and you can't make an error.\n\n1:23:02.120 --> 1:23:03.120\n Right.\n\n1:23:03.120 --> 1:23:06.680\n Uh, would you know where, can you, is it easy to debug?\n\n1:23:06.680 --> 1:23:09.040\n No, no, you do it twice.\n\n1:23:09.040 --> 1:23:10.520\n You do it twice and that's how you check.\n\n1:23:10.520 --> 1:23:15.540\n If it's identical, then you know, but like, if it's not, then one is right and the other\n\n1:23:15.540 --> 1:23:16.540\n is wrong.\n\n1:23:16.540 --> 1:23:17.540\n You gotta do it again.\n\n1:23:17.540 --> 1:23:18.540\n Don't make mistakes.\n\n1:23:18.540 --> 1:23:19.540\n No, that's right.\n\n1:23:19.540 --> 1:23:20.540\n And I really didn't.\n\n1:23:20.540 --> 1:23:30.680\n So I was, I was learning that, uh, I was also, uh, told that I was required to become proficient\n\n1:23:30.680 --> 1:23:36.120\n in another language and they gave me a choice and I picked English.\n\n1:23:36.120 --> 1:23:37.120\n That's what was the other one.\n\n1:23:37.120 --> 1:23:41.240\n Oh no, pick one friend, you know, whatever is spoken in the West.\n\n1:23:41.240 --> 1:23:42.240\n Got it.\n\n1:23:42.240 --> 1:23:44.400\n Uh, what was, what was, what would be second to you?\n\n1:23:44.400 --> 1:23:46.760\n Would you, would you think French because of Paris?\n\n1:23:46.760 --> 1:23:49.580\n What would you, what, why English?\n\n1:23:49.580 --> 1:23:54.880\n English was a no brainer because I, I was a straight age to a student in English without\n\n1:23:54.880 --> 1:23:55.880\n studying.\n\n1:23:55.880 --> 1:23:58.200\n I like it came so easily to me.\n\n1:23:58.200 --> 1:24:02.200\n So that's why I chose it, right?\n\n1:24:02.200 --> 1:24:09.640\n So that was that, uh, then, uh, um, I, uh, I w I was taught the basics of, um, uh, counter\n\n1:24:09.640 --> 1:24:15.880\n surveillance, you know, some trickery and, and, and, uh, um, uh, surveillance detection\n\n1:24:15.880 --> 1:24:24.000\n routes where you wander around in the city for three hours and determine whether you're\n\n1:24:24.000 --> 1:24:26.160\n being followed or not.\n\n1:24:26.160 --> 1:24:29.280\n That requires you to plan the route very well.\n\n1:24:29.280 --> 1:24:35.280\n I give you one example that, uh, that will illustrate that as my, my favorite spot.\n\n1:24:35.280 --> 1:24:39.880\n When, when, when I was in Moscow, I did a lot of that also.\n\n1:24:39.880 --> 1:24:47.800\n And if my favorite spot was, I wasn't a not well traveled, uh, uh, road.\n\n1:24:47.800 --> 1:24:50.720\n It went down the hill and, and curved.\n\n1:24:50.720 --> 1:24:55.080\n And at the bottom of the hill, there was a telephone booth.\n\n1:24:55.080 --> 1:25:00.640\n And when you open the door and pick up the telephone, you have to look back.\n\n1:25:00.640 --> 1:25:01.960\n So it wasn't like this, right?\n\n1:25:01.960 --> 1:25:02.960\n It wasn't a giveaway.\n\n1:25:02.960 --> 1:25:03.960\n This was normal.\n\n1:25:03.960 --> 1:25:04.960\n That was natural.\n\n1:25:04.960 --> 1:25:09.840\n So I could see if somebody would come walking after me, you know, these kinds of things.\n\n1:25:09.840 --> 1:25:19.480\n Or you would, uh, uh, you know, use, um, public transportation, uh, big buildings, uh, where\n\n1:25:19.480 --> 1:25:26.480\n you needed to use an elevator and see who's because surveillance, the, the object of\n\n1:25:26.480 --> 1:25:31.160\n surveillance is to never lose sight of the individual who you're surveilling because\n\n1:25:31.160 --> 1:25:36.980\n at that point you may miss the window where he does something that you're looking for.\n\n1:25:36.980 --> 1:25:40.600\n So somebody always has to come close, right?\n\n1:25:40.600 --> 1:25:44.040\n Did you have to also study surveillance?\n\n1:25:44.040 --> 1:25:47.680\n No, only counter surveillance.\n\n1:25:47.680 --> 1:25:54.560\n And what helped me in, in, in all my training, uh, you know, I, I would be, uh, would have\n\n1:25:54.560 --> 1:26:00.720\n a competition with, uh, uh, folks that were coming, they were following me and me.\n\n1:26:00.720 --> 1:26:05.760\n And I beat them every time, uh, they were at a disadvantage because one of them always\n\n1:26:05.760 --> 1:26:11.720\n had to be close and, and if you saw the same face twice, you know that you were being followed.\n\n1:26:11.720 --> 1:26:15.540\n And I had a very, very good, uh, memory for, for faces.\n\n1:26:15.540 --> 1:26:23.640\n So basically figure out a fixed route and then a fixed route that allows you to, uh,\n\n1:26:23.640 --> 1:26:28.960\n survey the area and then record the faces you've seen inside your mind.\n\n1:26:28.960 --> 1:26:33.200\n And if, uh, you see multiple times a single face, that's, that's a bad sign.\n\n1:26:33.200 --> 1:26:38.880\n And then they could, they could, uh, you use, uh, different clothes, uh, but they didn't\n\n1:26:38.880 --> 1:26:41.760\n have was face masks.\n\n1:26:41.760 --> 1:26:44.280\n The CIA does nowadays.\n\n1:26:44.280 --> 1:26:47.000\n They can give you a different face within seconds.\n\n1:26:47.000 --> 1:26:48.000\n Yeah.\n\n1:26:48.000 --> 1:27:00.880\n So how big, I mean, again, you talk about paranoia, um, is that part of the, is that\n\n1:27:00.880 --> 1:27:06.840\n a big part of the job, uh, counter surveillance, like being constantly paranoid that you're\n\n1:27:06.840 --> 1:27:07.840\n being watched?\n\n1:27:07.840 --> 1:27:08.840\n Yeah.\n\n1:27:08.840 --> 1:27:09.840\n I was supposed to.\n\n1:27:09.840 --> 1:27:10.840\n Isn't that quite stressful.\n\n1:27:10.840 --> 1:27:14.240\n So is that, is that one of the, is that actually an effective way to operate?\n\n1:27:14.240 --> 1:27:16.560\n Uh, nobody, it sort of becomes a routine.\n\n1:27:16.560 --> 1:27:23.040\n Uh, I was told to do it, uh, while in the U S once a month and, uh, okay.\n\n1:27:23.040 --> 1:27:24.040\n It's like a cleaning out.\n\n1:27:24.040 --> 1:27:25.040\n Oh, not, not every day.\n\n1:27:25.040 --> 1:27:26.640\n No, no, no, no, no.\n\n1:27:26.640 --> 1:27:31.000\n Once a month or before I would say, mail a letter with secret writing.\n\n1:27:31.000 --> 1:27:38.640\n So I was sure that, you know, nobody saw me put an envelope into a postbox.\n\n1:27:38.640 --> 1:27:41.560\n So this is one of the tools in your toolbox is Morse code.\n\n1:27:41.560 --> 1:27:43.820\n There's the decryption and encryption.\n\n1:27:43.820 --> 1:27:50.880\n There's the car surveillance, photography, um, making, making microdots, you know, what\n\n1:27:50.880 --> 1:27:51.880\n a microdot is?\n\n1:27:51.880 --> 1:27:52.880\n What's a microdot?\n\n1:27:52.880 --> 1:28:03.880\n It's, uh, you use, you, you take a photograph and you use a microscope in reverse and, uh,\n\n1:28:03.880 --> 1:28:12.840\n make that photograph really small, so small that it's like the head of a pin that can\n\n1:28:12.840 --> 1:28:17.400\n be used to, uh, hide under a postage stamp.\n\n1:28:17.400 --> 1:28:24.200\n Uh, in reality, I knew how to make them, but in reality, they, they never asked me to make\n\n1:28:24.200 --> 1:28:25.200\n use of that technique.\n\n1:28:25.200 --> 1:28:29.400\n So it's a, it's a sort of an encryption mechanism for photographs.\n\n1:28:29.400 --> 1:28:30.400\n Yeah.\n\n1:28:30.400 --> 1:28:35.920\n So what we do nowadays, embed, uh, code in, in, uh, PDFs and stuff like that.\n\n1:28:35.920 --> 1:28:36.920\n Right?\n\n1:28:36.920 --> 1:28:37.920\n Yeah.\n\n1:28:37.920 --> 1:28:38.920\n Beautiful.\n\n1:28:38.920 --> 1:28:39.920\n Okay.\n\n1:28:39.920 --> 1:28:40.920\n All right.\n\n1:28:40.920 --> 1:28:43.000\n So that, that was a learning, a training process, both in the physical space and sort\n\n1:28:43.000 --> 1:28:46.080\n of, um, algorithmically.\n\n1:28:46.080 --> 1:28:47.080\n Is there other things?\n\n1:28:47.080 --> 1:28:48.080\n Yeah.\n\n1:28:48.080 --> 1:28:49.080\n You bet.\n\n1:28:49.080 --> 1:28:55.320\n Uh, interestingly enough, the, uh, I was, um, the first book I was given to read was\n\n1:28:55.320 --> 1:28:59.840\n the history of this, uh, these, uh, communist party of the Soviet union.\n\n1:28:59.840 --> 1:29:02.360\n Oh, so understand.\n\n1:29:02.360 --> 1:29:03.360\n That's interesting.\n\n1:29:03.360 --> 1:29:04.640\n Cause you said you had to read Western literature.\n\n1:29:04.640 --> 1:29:05.640\n Yeah, that too.\n\n1:29:05.640 --> 1:29:11.680\n How much, how much reading, so history, how much history of politics, geopolitics, culture.\n\n1:29:11.680 --> 1:29:15.680\n Not much more, but they made me read that document.\n\n1:29:15.680 --> 1:29:19.080\n Other than that, I wasn't supposed to study the Soviet union.\n\n1:29:19.080 --> 1:29:23.480\n I wasn't supposed and that was not, and I didn't, when they sent me to Moscow, it wasn't\n\n1:29:23.480 --> 1:29:25.040\n to learn Russia, Russian, right?\n\n1:29:25.040 --> 1:29:26.920\n It was to learn English.\n\n1:29:26.920 --> 1:29:32.720\n Um, the, the second document they gave me was the, the constitution of West Germany.\n\n1:29:32.720 --> 1:29:35.240\n And then I got lots of magazines and stuff like that.\n\n1:29:35.240 --> 1:29:42.080\n Uh, as I told you, I was, uh, also told to, uh, uh, watch West German television, which\n\n1:29:42.080 --> 1:29:49.760\n I, which I, uh, embraced with a vengeance because it was better than East German.\n\n1:29:49.760 --> 1:29:54.320\n So I would get up in the morning and have a little breakfast and watch the German version\n\n1:29:54.320 --> 1:29:56.320\n of Sesame street.\n\n1:29:56.320 --> 1:30:01.960\n And that, that, that helps you, uh, that helps you get an understanding of the culture.\n\n1:30:01.960 --> 1:30:08.960\n You have to do any kind of, uh, interaction, kind of spying that you have to be, be able\n\n1:30:08.960 --> 1:30:09.960\n to effectively integrate.\n\n1:30:09.960 --> 1:30:15.320\n Well, you, you also have to know, like, and, and that would have been easier, uh, if I,\n\n1:30:15.320 --> 1:30:18.920\n they had sent me to West Germany, you know, all the soccer teams, you know, stuff that\n\n1:30:18.920 --> 1:30:23.400\n everybody knows when I came to the U S I knew very little stuff that everybody knows.\n\n1:30:23.400 --> 1:30:28.600\n That's why I had to be very cautious and, you know, take it in all the time anyway.\n\n1:30:28.600 --> 1:30:34.360\n Uh, and the, the last thing I want to mention is, uh, they, uh, I was strongly encouraged\n\n1:30:34.360 --> 1:30:40.500\n to, uh, expand my, my cultural education.\n\n1:30:40.500 --> 1:30:48.680\n In other words, go to visit museums, uh, go to the theater, uh, not so much movies, uh,\n\n1:30:48.680 --> 1:30:53.400\n opera, read, read books from all kinds of authors.\n\n1:30:53.400 --> 1:30:55.120\n Uh, that was important to them.\n\n1:30:55.120 --> 1:31:00.240\n And once a month I had to write a report what I did, but the interesting thing, there was\n\n1:31:00.240 --> 1:31:05.400\n not a, there was no curriculum, there was no agenda, there were no check marks.\n\n1:31:05.400 --> 1:31:06.400\n It was all ad hoc.\n\n1:31:06.400 --> 1:31:08.960\n You know, now you do this and then you do that.\n\n1:31:08.960 --> 1:31:14.920\n Uh, and, uh, and a lot of this also, they relied on my initiative.\n\n1:31:14.920 --> 1:31:15.920\n Again,\n\n1:31:15.920 --> 1:31:17.920\n I mean, that's part of the evaluation too.\n\n1:31:17.920 --> 1:31:18.920\n You bet.\n\n1:31:18.920 --> 1:31:23.440\n Um, are you able to have creative, it's interesting that they're like developing a James Bond\n\n1:31:23.440 --> 1:31:28.680\n type of character here, which is what, what's the reason to go to the opera as you become\n\n1:31:28.680 --> 1:31:29.680\n Yes.\n\n1:31:29.680 --> 1:31:35.440\n In a certain kind of way where perhaps that makes you, uh, more charming, more charismatic\n\n1:31:35.440 --> 1:31:38.440\n in terms of your ability to integrate yourself in different situations.\n\n1:31:38.440 --> 1:31:39.440\n You absolutely right.\n\n1:31:39.440 --> 1:31:49.800\n Uh, uh, I, I was, I was, um, uh, uh, when I came to the US after about, uh, two years\n\n1:31:49.800 --> 1:31:59.920\n roughly, um, I was cultured enough to, uh, not, uh, make a bad impression at a, at a\n\n1:31:59.920 --> 1:32:02.320\n diplomatic soiree in Washington, DC.\n\n1:32:02.320 --> 1:32:03.800\n I mingled freely.\n\n1:32:03.800 --> 1:32:04.800\n Yes.\n\n1:32:04.800 --> 1:32:05.800\n All right.\n\n1:32:05.800 --> 1:32:11.320\n And, and, and so the whole idea was for me to sort of reach into the upper, uh, realms\n\n1:32:11.320 --> 1:32:19.640\n of society where the targets would be juicier than, you know, the worker bees.\n\n1:32:19.640 --> 1:32:21.880\n And how did you end up in Moscow?\n\n1:32:21.880 --> 1:32:22.880\n Why?\n\n1:32:22.880 --> 1:32:23.880\n Yeah.\n\n1:32:23.880 --> 1:32:24.880\n What is that journey?\n\n1:32:24.880 --> 1:32:30.720\n Well, so I, uh, I told you, and I started studying English, so I started back from scratch,\n\n1:32:30.720 --> 1:32:37.400\n you know, they paid for a tutor and I went from like English 101 and then I went through\n\n1:32:37.400 --> 1:32:39.140\n that in a couple of months then.\n\n1:32:39.140 --> 1:32:43.180\n And then I got another guy with whom we, I expanded this.\n\n1:32:43.180 --> 1:32:48.640\n We had conversations rather than working from a textbook and I, and I worked like a maniac.\n\n1:32:48.640 --> 1:32:54.600\n I threw myself into the study of, of, of, uh, uh, English.\n\n1:32:54.600 --> 1:32:55.600\n Like you wouldn't believe.\n\n1:32:55.600 --> 1:33:00.240\n Um, and, and my inspiration came from Vladimir Lenin.\n\n1:33:00.240 --> 1:33:07.240\n I had read somewhere in a book that when Lenin was in exile, he studied German and he learned\n\n1:33:07.240 --> 1:33:11.400\n 100 German words every day, new German words.\n\n1:33:11.400 --> 1:33:15.800\n So I started reading newspapers and every word that I didn't know, I wrote down on an\n\n1:33:15.800 --> 1:33:21.140\n index card, uh, German, English, and, uh, and I piled them up.\n\n1:33:21.140 --> 1:33:25.360\n And so I really learned 100 new English words every day.\n\n1:33:25.360 --> 1:33:30.400\n I know this because I counted them and I had a system how to do this.\n\n1:33:30.400 --> 1:33:35.560\n Uh, uh, so you take your index card and you have five categories is a really good way\n\n1:33:35.560 --> 1:33:38.120\n to learn wrote by wrote.\n\n1:33:38.120 --> 1:33:43.340\n Uh, so you've got category one, that's the new ones and you've got category five.\n\n1:33:43.340 --> 1:33:50.400\n So you start with, uh, with five, five, you already had right four times.\n\n1:33:50.400 --> 1:33:53.960\n If you have it right again, it goes to the archive.\n\n1:33:53.960 --> 1:33:57.240\n Oh, in like longterm cold archive.\n\n1:33:57.240 --> 1:33:58.240\n Yeah.\n\n1:33:58.240 --> 1:33:59.240\n Four.\n\n1:33:59.240 --> 1:34:01.720\n If you get it right, it goes to five.\n\n1:34:01.720 --> 1:34:05.440\n If you get it wrong, it gets relegated to three or so.\n\n1:34:05.440 --> 1:34:13.000\n And so you go through this and, uh, um, and occasionally I would throw the archive things\n\n1:34:13.000 --> 1:34:15.240\n back into one.\n\n1:34:15.240 --> 1:34:20.120\n So I really, I really acquired a phenomenal vocabulary.\n\n1:34:20.120 --> 1:34:23.780\n When I was done with my English, my vocabulary was significantly higher than the average\n\n1:34:23.780 --> 1:34:29.840\n American because I, I, I didn't discriminate whatever word I didn't know I learned, which\n\n1:34:29.840 --> 1:34:35.280\n is not necessarily the best way because you know, English has a lot of synonyms, right?\n\n1:34:35.280 --> 1:34:36.280\n Yeah.\n\n1:34:36.280 --> 1:34:43.800\n And one synonym is usually the, the preferable one and, and I, um, when I first interacted\n\n1:34:43.800 --> 1:34:48.380\n with people, I very often used the one that wasn't as good.\n\n1:34:48.380 --> 1:34:52.280\n And people have found that I, you know, I have an interesting way of talking.\n\n1:34:52.280 --> 1:34:54.740\n They didn't know what that meant, but yeah.\n\n1:34:54.740 --> 1:34:58.560\n So it builds a good foundation for a language is getting a large vocabulary.\n\n1:34:58.560 --> 1:34:59.560\n Yes.\n\n1:34:59.560 --> 1:35:00.560\n It's really interesting.\n\n1:35:00.560 --> 1:35:03.840\n There's something I do, which is called space repetition, which is a programmatic way of\n\n1:35:03.840 --> 1:35:09.700\n doing this kind of system that you've developed yourself, which is if you successfully remember\n\n1:35:09.700 --> 1:35:14.560\n a thing, it's going to be a longer time before it brings it up to you again.\n\n1:35:14.560 --> 1:35:15.560\n Yeah.\n\n1:35:15.560 --> 1:35:20.060\n Now that's requires a computer to keep track of information.\n\n1:35:20.060 --> 1:35:22.680\n If you have cars, that's a really interesting pile system.\n\n1:35:22.680 --> 1:35:26.600\n One, two, three, four, five, you upgrade it one, two, three, four, five.\n\n1:35:26.600 --> 1:35:31.360\n Maybe I wouldn't go to the archive and go to them to, to pile one right away.\n\n1:35:31.360 --> 1:35:37.880\n I would go to like, I don't know, pile five, perhaps is probably the right place to put\n\n1:35:37.880 --> 1:35:38.880\n it.\n\n1:35:38.880 --> 1:35:41.840\n Cause, cause you have to go through that full step again, but that is a really powerful\n\n1:35:41.840 --> 1:35:45.960\n way to learn definitely language, but also facts.\n\n1:35:45.960 --> 1:35:47.960\n Like people that go to medical school.\n\n1:35:47.960 --> 1:35:48.960\n Disconnected facts.\n\n1:35:48.960 --> 1:35:49.960\n Yeah.\n\n1:35:49.960 --> 1:35:53.240\n And, and you pretty much, when you're done, you, you know what you know.\n\n1:35:53.240 --> 1:35:54.240\n Yeah.\n\n1:35:54.240 --> 1:35:55.240\n You don't have to.\n\n1:35:55.240 --> 1:35:57.640\n Then again, to use it, to integrate it into the music of language.\n\n1:35:57.640 --> 1:35:58.640\n That's more difficult.\n\n1:35:58.640 --> 1:35:59.640\n That's what you're talking about.\n\n1:35:59.640 --> 1:36:00.640\n Yeah.\n\n1:36:00.640 --> 1:36:01.640\n There's a charm.\n\n1:36:01.640 --> 1:36:06.960\n I mean, maybe it's not good for Spycraft, but there's a charm to this kind of, to having\n\n1:36:06.960 --> 1:36:14.000\n an accent and using words incorrectly, but confidently there's a, because language isn't\n\n1:36:14.000 --> 1:36:16.180\n a simple formula.\n\n1:36:16.180 --> 1:36:17.480\n Language is the play of words.\n\n1:36:17.480 --> 1:36:25.680\n So actually using the incorrect synonym, you know, as it, you know, if, instead of saying\n\n1:36:25.680 --> 1:36:28.960\n I'm cold saying I'm chilled or something.\n\n1:36:28.960 --> 1:36:33.120\n Like using off beat words can actually be part of the charm.\n\n1:36:33.120 --> 1:36:35.800\n So it's interesting if you can learn how to use that correctly.\n\n1:36:35.800 --> 1:36:40.640\n Cause I've known a bunch of people with the Russian accent and I feel like they get, get\n\n1:36:40.640 --> 1:36:45.400\n away with saying a lot of ridiculous shit because they're able to sort of leverage the\n\n1:36:45.400 --> 1:36:47.440\n charm of the non sequiturs.\n\n1:36:47.440 --> 1:36:53.400\n And by the way, by the way, just one, one thing that we talked about using a computer.\n\n1:36:53.400 --> 1:36:59.080\n When I had my first personal computer, I actually wrote a program that does that.\n\n1:36:59.080 --> 1:37:00.080\n It does that.\n\n1:37:00.080 --> 1:37:01.280\n By the way, when was that?\n\n1:37:01.280 --> 1:37:06.000\n When, cause you were a world class programmer for a time.\n\n1:37:06.000 --> 1:37:07.000\n Yeah.\n\n1:37:07.000 --> 1:37:08.000\n You were a very good programmer.\n\n1:37:08.000 --> 1:37:09.000\n When, when did the birth?\n\n1:37:09.000 --> 1:37:10.560\n First PC was probably 1984.\n\n1:37:10.560 --> 1:37:11.560\n 1984.\n\n1:37:11.560 --> 1:37:13.920\n When did you fall in love with programming?\n\n1:37:13.920 --> 1:37:19.560\n When I went to college in the US and part of the core curriculum was that you were required\n\n1:37:19.560 --> 1:37:26.440\n to take a course in computer and it was mostly just, you know, talk, but we also had to learn\n\n1:37:26.440 --> 1:37:27.440\n a language.\n\n1:37:27.440 --> 1:37:35.080\n Uh, we had to write some programs and Fortran, which was what five at the time, it was a,\n\n1:37:35.080 --> 1:37:43.080\n it was a dumbed down Fortran, but listen, so I, I see the ability, I see what, what\n\n1:37:43.080 --> 1:37:50.080\n you can do with this, I programmed a sine curve and then I divided the, the sine curve\n\n1:37:50.080 --> 1:37:55.840\n into really, really small rectangles and then ran the program and it came up with the right\n\n1:37:55.840 --> 1:37:56.840\n area.\n\n1:37:56.840 --> 1:37:57.840\n Wow.\n\n1:37:57.840 --> 1:37:58.840\n This is great.\n\n1:37:58.840 --> 1:37:59.840\n That's incredible.\n\n1:37:59.840 --> 1:38:00.840\n It's incredible.\n\n1:38:00.840 --> 1:38:01.840\n That's so powerful.\n\n1:38:01.840 --> 1:38:08.640\n It's, uh, you're creating, you're creating a little helper helps you understand the world\n\n1:38:08.640 --> 1:38:10.720\n to help you analyze the world and so on.\n\n1:38:10.720 --> 1:38:13.520\n Uh, we'll, we'll return to that cause it's interesting.\n\n1:38:13.520 --> 1:38:16.560\n So you have so many interesting aspects to your life, but Moscow.\n\n1:38:16.560 --> 1:38:17.560\n So\n\n1:38:17.560 --> 1:38:20.760\n Yeah, no, let me, let, no, let me, how I was sent to Moscow.\n\n1:38:20.760 --> 1:38:21.760\n Okay.\n\n1:38:21.760 --> 1:38:27.360\n So one day I had a visitor from Moscow, uh, and he came to visit me in my apartment, uh,\n\n1:38:27.360 --> 1:38:33.080\n together with, uh, Nikolai and he, you know, we talked and then he said, how's your English?\n\n1:38:33.080 --> 1:38:37.680\n I said, I pulled a book from the shelf and says, I can read that without the help of\n\n1:38:37.680 --> 1:38:38.680\n a dictionary.\n\n1:38:38.680 --> 1:38:41.000\n Oh, that's interesting.\n\n1:38:41.000 --> 1:38:48.440\n And he said, you know what, we're going to send you a tape recorder and you just talk,\n\n1:38:48.440 --> 1:38:52.280\n say something, you know, for 20 minutes, whatever you want to talk about.\n\n1:38:52.280 --> 1:39:00.700\n Uh, they sent this thing and two weeks later I was on a plane to Moscow because I also\n\n1:39:00.700 --> 1:39:07.760\n spoke English, sort of the British variety of English with not a strong German accent\n\n1:39:07.760 --> 1:39:15.320\n because I've always had the ability to imitate others and sounds that was an innate ability.\n\n1:39:15.320 --> 1:39:21.160\n I would, uh, you know, when, when, when we were in a lab and, uh, as students, I would\n\n1:39:21.160 --> 1:39:27.000\n very often do, uh, monologues, uh, imitating East German comedians.\n\n1:39:27.000 --> 1:39:30.140\n You know, I just, yes, yes.\n\n1:39:30.140 --> 1:39:37.600\n I'm not good enough to make a living out of it, but, uh, that raised some interest.\n\n1:39:37.600 --> 1:39:43.120\n And so when they sent me to Moscow, that was the first time on a plane, by the way, um,\n\n1:39:43.120 --> 1:39:47.280\n and, uh, I had a conversation with two ladies who spoke English.\n\n1:39:47.280 --> 1:39:52.760\n One was a, a Russian, a professor at, uh, Lomonosov University.\n\n1:39:52.760 --> 1:39:55.380\n She was obviously KGB, that was her cover.\n\n1:39:55.380 --> 1:39:58.000\n And the other one was an American born lady.\n\n1:39:58.000 --> 1:40:02.360\n Oh, by the way, she was an actual professor and using that as the cover or is it just\n\n1:40:02.360 --> 1:40:03.360\n a story?\n\n1:40:03.360 --> 1:40:06.280\n No, I, she said she was a professor.\n\n1:40:06.280 --> 1:40:08.120\n She may have taught there too.\n\n1:40:08.120 --> 1:40:09.120\n That's an interesting distinction.\n\n1:40:09.120 --> 1:40:10.120\n Yeah.\n\n1:40:10.120 --> 1:40:14.360\n One is like a story you tell people and one is like you legit are doing the thing, but\n\n1:40:14.360 --> 1:40:16.360\n are also as a cover.\n\n1:40:16.360 --> 1:40:22.920\n Anyway, that's, that's an interesting aspect of how to be a good liar.\n\n1:40:22.920 --> 1:40:25.200\n You might, you might as well live the lie.\n\n1:40:25.200 --> 1:40:26.520\n Yeah, exactly right.\n\n1:40:26.520 --> 1:40:31.860\n Uh, so, uh, and the other one was a middle aged, the, the Russian was pretty young.\n\n1:40:31.860 --> 1:40:37.640\n The other one was middle aged and American and, uh, and so we talked for maybe a couple\n\n1:40:37.640 --> 1:40:42.680\n of hours and then they withdrew and I was left alone.\n\n1:40:42.680 --> 1:40:49.920\n Eventually my liaison, he came back in and he said, it was close, but the American thinks\n\n1:40:49.920 --> 1:40:56.720\n you can actually, uh, become, uh, you get close enough to become, becoming a native\n\n1:40:56.720 --> 1:40:59.040\n speaker of American English.\n\n1:40:59.040 --> 1:41:02.000\n And he said, the Russian was very doubtful.\n\n1:41:02.000 --> 1:41:08.100\n So I think wishful, it was, it was a tie, literally wishful thinking prevailed.\n\n1:41:08.100 --> 1:41:15.560\n So, uh, within a couple of weeks I was moving to Moscow.\n\n1:41:15.560 --> 1:41:21.000\n And what, what was the task in Moscow and what, how long were you in Moscow?\n\n1:41:21.000 --> 1:41:22.360\n Two years.\n\n1:41:22.360 --> 1:41:24.840\n And what was the task there?\n\n1:41:24.840 --> 1:41:26.680\n Is it training or is it espionage?\n\n1:41:26.680 --> 1:41:27.880\n No, it was training.\n\n1:41:27.880 --> 1:41:33.280\n It was, uh, so it was, uh, I, uh, the, the American born became my tutor.\n\n1:41:33.280 --> 1:41:35.560\n I met with her twice a week.\n\n1:41:35.560 --> 1:41:45.360\n Uh, I, uh, I also listened to a lot of BBC, shortwave BBC worldwide, uh, I read, uh, more\n\n1:41:45.360 --> 1:41:46.360\n English books.\n\n1:41:46.360 --> 1:41:51.040\n So a lot of that was about the language and the culture of English, uh, American.\n\n1:41:51.040 --> 1:41:57.960\n And, and I did phonetics exercises every night.\n\n1:41:57.960 --> 1:42:05.720\n I had a tape that was about a half hour long and they would say a word and I would repeat\n\n1:42:05.720 --> 1:42:07.720\n the word, say a word, repeat the word.\n\n1:42:07.720 --> 1:42:13.560\n And it was mostly about the vowels, by the way, most of the accent and, uh, uh, particularly\n\n1:42:13.560 --> 1:42:18.560\n because let's say coming from German into, into English, but also Russian.\n\n1:42:18.560 --> 1:42:19.560\n It's the vowels.\n\n1:42:19.560 --> 1:42:23.680\n You're talking about the, so you would have a single word, a word, apple, and you would\n\n1:42:23.680 --> 1:42:24.680\n just say apple.\n\n1:42:24.680 --> 1:42:25.680\n Yes.\n\n1:42:25.680 --> 1:42:28.040\n And American English or British English?\n\n1:42:28.040 --> 1:42:29.040\n No, American English.\n\n1:42:29.040 --> 1:42:34.200\n And, and I give you one, uh, example that almost nobody gets right.\n\n1:42:34.200 --> 1:42:43.200\n The difference between hot and hut, you know, and in German speakers, it's very tough.\n\n1:42:43.200 --> 1:42:46.200\n You know, which one, uh, for everyone is different.\n\n1:42:46.200 --> 1:42:51.240\n For example, uh, I could say this on a podcast, something that my brother struggles with,\n\n1:42:51.240 --> 1:42:56.600\n I struggled with too, when I first came to this country to learn English is there's differences.\n\n1:42:56.600 --> 1:43:02.320\n There's embarrassing differences, uh, like beach and bitch, right?\n\n1:43:02.320 --> 1:43:06.120\n And you get so, as a young kid, also you get so nervous of, I don't want to say the wrong\n\n1:43:06.120 --> 1:43:07.120\n thing.\n\n1:43:07.120 --> 1:43:12.600\n I, um, I can also say that this is almost as a jokey thing, but, uh, there's a, there's\n\n1:43:12.600 --> 1:43:18.280\n a famous philosopher, uh, Immanuel Kant, and you can, uh, guess which other word is very\n\n1:43:18.280 --> 1:43:19.280\n similar to that.\n\n1:43:19.280 --> 1:43:24.120\n So there's a, there's a nervousness about the, what is that?\n\n1:43:24.120 --> 1:43:25.120\n That's interesting.\n\n1:43:25.120 --> 1:43:31.600\n I mean, and Germans probably have a different, uh, tension of like what is hard to learn\n\n1:43:31.600 --> 1:43:35.200\n the difference between the pronunciation of the vowels or the control of the vowels.\n\n1:43:35.200 --> 1:43:36.200\n Yeah.\n\n1:43:36.200 --> 1:43:37.200\n It's interesting.\n\n1:43:37.200 --> 1:43:41.600\n So you had to really master this daily exercise and, you know, and this, this was my discipline.\n\n1:43:41.600 --> 1:43:45.200\n I did this every night, routine, boring as hell.\n\n1:43:45.200 --> 1:43:47.800\n Uh, so English was the focus.\n\n1:43:47.800 --> 1:43:53.480\n And I also had interaction with some, uh, agents who had operated in the United States\n\n1:43:53.480 --> 1:43:56.320\n as diplomats on the, on the diplomatic cover.\n\n1:43:56.320 --> 1:44:02.380\n They would come and talk to me a little bit and tell me and sort of prepare me what was\n\n1:44:02.380 --> 1:44:03.380\n ahead of me.\n\n1:44:03.380 --> 1:44:07.720\n And then I did a whole lot of operational training, particularly surveillance detection.\n\n1:44:07.720 --> 1:44:08.720\n That was big.\n\n1:44:08.720 --> 1:44:11.720\n They also, they also taught me how to drive a car in Moscow.\n\n1:44:11.720 --> 1:44:14.080\n Finally, the one skill you needed.\n\n1:44:14.080 --> 1:44:15.480\n What's a surveillance detection?\n\n1:44:15.480 --> 1:44:16.480\n Okay.\n\n1:44:16.480 --> 1:44:19.360\n So this is what, when, when you find out whether you're being followed.\n\n1:44:19.360 --> 1:44:21.120\n Ah, got it, got it, got it.\n\n1:44:21.120 --> 1:44:22.960\n So it's the, yeah, got you.\n\n1:44:22.960 --> 1:44:30.180\n The abbreviation that's used in, uh, in, in, in, uh, yes, uh, in, uh, intelligence circles\n\n1:44:30.180 --> 1:44:34.320\n is SDR, surveillance detection route, you know, when they say that, you know what that\n\n1:44:34.320 --> 1:44:35.320\n is.\n\n1:44:35.320 --> 1:44:37.000\n Uh, and, and that was it.\n\n1:44:37.000 --> 1:44:44.760\n Uh, and a, and a few other things, you know, one offs, for instance, uh, I was once, uh,\n\n1:44:44.760 --> 1:44:49.000\n taught, uh, to read silhouettes of ships.\n\n1:44:49.000 --> 1:44:54.320\n When you see a ship from a distance, what kind of a ship it might be.\n\n1:44:54.320 --> 1:44:57.520\n They, they thought this would come in handy.\n\n1:44:57.520 --> 1:45:03.840\n Actually they, they, uh, there was in, in 1982, Andropov, uh, started, uh, a campaign\n\n1:45:03.840 --> 1:45:09.200\n that was, uh, now I forget the name, Operation something, something where everybody who was\n\n1:45:09.200 --> 1:45:15.060\n in the West was supposed to, uh, look for science that, uh, the West was, uh, uh, getting\n\n1:45:15.060 --> 1:45:16.940\n ready for war.\n\n1:45:16.940 --> 1:45:21.960\n And I had an, everybody had an object to, uh, to pay attention to.\n\n1:45:21.960 --> 1:45:31.440\n I had a, uh, uh, a harbor, a military harbor in, um, um, in, in New Jersey, uh, near Red\n\n1:45:31.440 --> 1:45:35.720\n Bank that was called Earl Weapon Station.\n\n1:45:35.720 --> 1:45:37.520\n And the code name for that was early.\n\n1:45:37.520 --> 1:45:44.960\n So they asked me to just wander by there to see if there was something unusual going on\n\n1:45:44.960 --> 1:45:49.640\n because the Soviet Union were at that point, it was Ronald Reagan were really afraid that\n\n1:45:49.640 --> 1:45:51.520\n Reagan was going to start a war.\n\n1:45:51.520 --> 1:45:54.680\n They were absolutely 100% afraid of him.\n\n1:45:54.680 --> 1:46:00.160\n Is there something memorable to you on a personal level and a philosophical level about your\n\n1:46:00.160 --> 1:46:02.200\n time in Moscow?\n\n1:46:02.200 --> 1:46:07.160\n Something that kind of stays with you outside of the training stuff, maybe like the details\n\n1:46:07.160 --> 1:46:08.160\n of the training.\n\n1:46:08.160 --> 1:46:09.160\n You love the answer.\n\n1:46:09.160 --> 1:46:10.160\n You will love the answer.\n\n1:46:10.160 --> 1:46:19.720\n Uh, I was, uh, I was given tickets to two, uh, performances by Americans.\n\n1:46:19.720 --> 1:46:23.880\n Uh, there was a theater troupe that, uh, played Our Town.\n\n1:46:23.880 --> 1:46:29.660\n Uh, and then there was this, I forgot the name of the guy, but, uh, uh, you may not\n\n1:46:29.660 --> 1:46:30.660\n be old enough.\n\n1:46:30.660 --> 1:46:32.480\n Have you ever watched Hee Haw?\n\n1:46:32.480 --> 1:46:40.720\n Uh, maybe, uh, there was a, it was a country music show, real kitschy, but, uh, the star\n\n1:46:40.720 --> 1:46:47.880\n of Hee Haw, uh, was giving a concert in Moscow and I guarantee you at least half the audience\n\n1:46:47.880 --> 1:46:59.400\n were KGB and at the other end, the, uh, uh, um, the, the, the opposite of, uh, of a, of\n\n1:46:59.400 --> 1:47:09.680\n a highlight was my visit to the, uh, to, to my, to the mausoleum where Lenin, uh, is still,\n\n1:47:09.680 --> 1:47:10.680\n still today.\n\n1:47:10.680 --> 1:47:18.340\n There, there was so, there was a nothing, you know, he was, he was my hero, but he,\n\n1:47:18.340 --> 1:47:24.080\n he looked like a wax figure and, and, and you walk by there, there was nothing inspirational\n\n1:47:24.080 --> 1:47:30.360\n and not, not, it was not a religious experience, nothing, it was, it was a big old nothing.\n\n1:47:30.360 --> 1:47:36.960\n Is that, did, did your faith and belief in communism start to crumble at some point here?\n\n1:47:36.960 --> 1:47:37.960\n No.\n\n1:47:37.960 --> 1:47:39.760\n Is that around, that was still pretty strong.\n\n1:47:39.760 --> 1:47:44.880\n What I did notice that, uh, the standard of living in, in, in Moscow was significantly\n\n1:47:44.880 --> 1:47:47.100\n lower than in East Germany.\n\n1:47:47.100 --> 1:47:54.140\n The, uh, uh, in the supermarkets, uh, you could, you could expect, uh, with reliability\n\n1:47:54.140 --> 1:47:58.220\n that you can find, uh, canned fish and, uh, mineral water.\n\n1:47:58.220 --> 1:48:00.600\n Everything else was whatever.\n\n1:48:00.600 --> 1:48:04.120\n And if you saw a line and at a store, you just line up.\n\n1:48:04.120 --> 1:48:08.400\n You don't even ask what they have because if you don't like it, somebody else will.\n\n1:48:08.400 --> 1:48:14.400\n It was, it, it was, uh, not poverty, but it was close to poverty.\n\n1:48:14.400 --> 1:48:18.000\n There were a lot of drunken men in the streets.\n\n1:48:18.000 --> 1:48:19.000\n And uh...\n\n1:48:19.000 --> 1:48:20.000\n This is the eighties?\n\n1:48:20.000 --> 1:48:24.080\n No, this is the late seventies, mid to late seventies.\n\n1:48:24.080 --> 1:48:29.640\n And uh, and also the, they had these high rise apartment buildings that looked pretty\n\n1:48:29.640 --> 1:48:34.720\n good from the front, but you went into the backyard, ouch.\n\n1:48:34.720 --> 1:48:35.720\n You know.\n\n1:48:35.720 --> 1:48:36.720\n Yeah.\n\n1:48:36.720 --> 1:48:37.720\n You're describing my childhood here.\n\n1:48:37.720 --> 1:48:38.720\n Okay.\n\n1:48:38.720 --> 1:48:39.720\n Sorry.\n\n1:48:39.720 --> 1:48:45.440\n Uh, but it's interesting even, even with the professor, even with everything else, um,\n\n1:48:45.440 --> 1:48:49.160\n it's interesting because I think the standard of living was much lower.\n\n1:48:49.160 --> 1:48:50.160\n You're right.\n\n1:48:50.160 --> 1:48:51.160\n Even in Moscow.\n\n1:48:51.160 --> 1:48:52.160\n Yeah.\n\n1:48:52.160 --> 1:48:53.160\n Absolutely was.\n\n1:48:53.160 --> 1:48:56.720\n The one thing that they always had, at least in my days, was in those two years, there\n\n1:48:56.720 --> 1:48:58.960\n was always fresh bread in the Bulatnoyars.\n\n1:48:58.960 --> 1:48:59.960\n Yeah.\n\n1:48:59.960 --> 1:49:00.960\n Always.\n\n1:49:00.960 --> 1:49:01.960\n Yeah.\n\n1:49:01.960 --> 1:49:07.480\n That's probably one of the memories I have of childhood is, well you're hungry a lot,\n\n1:49:07.480 --> 1:49:11.280\n but when you eat is bread and the bread was good.\n\n1:49:11.280 --> 1:49:12.280\n It was good.\n\n1:49:12.280 --> 1:49:18.800\n I mean, I don't, I actually wonder, I wonder how good it was, but I remember it being incredibly\n\n1:49:18.800 --> 1:49:19.800\n good.\n\n1:49:19.800 --> 1:49:21.320\n To me it was really good.\n\n1:49:21.320 --> 1:49:26.120\n And, and you know, you had it from white to very dark and all the varieties.\n\n1:49:26.120 --> 1:49:32.160\n The other thing that was good was, um, if you knew where to get it, Stolichnaya was\n\n1:49:32.160 --> 1:49:36.320\n four rubles.\n\n1:49:36.320 --> 1:49:39.760\n Not only is it good vodka, but it's a cheap vodka.\n\n1:49:39.760 --> 1:49:40.760\n I like it.\n\n1:49:40.760 --> 1:49:41.760\n Yeah.\n\n1:49:41.760 --> 1:49:45.000\n But you had to know where, you know, this would be like holes in the wall someplace.\n\n1:49:45.000 --> 1:49:48.920\n Well, I think a lot of the way they operate, I don't, I wonder if East Germany is this\n\n1:49:48.920 --> 1:49:53.920\n way, but a lot of the ways that Moscow operate is you kind of, you had to know.\n\n1:49:53.920 --> 1:49:54.920\n Yes.\n\n1:49:54.920 --> 1:50:01.440\n Like there's a very kind of, um, if you make the right friends, if you give money to the\n\n1:50:01.440 --> 1:50:05.760\n right guy, the guy, the friend of the friend of the friend is going to hook you up and\n\n1:50:05.760 --> 1:50:11.640\n that's, there's a culture that this is how you work around a very big bureaucracy.\n\n1:50:11.640 --> 1:50:12.640\n Underground economy.\n\n1:50:12.640 --> 1:50:13.640\n Yeah.\n\n1:50:13.640 --> 1:50:14.640\n Underground economy.\n\n1:50:14.640 --> 1:50:15.640\n Yeah.\n\n1:50:15.640 --> 1:50:23.880\n You have to know, which is, uh, boy, um, such a stark contrast between, between that and\n\n1:50:23.880 --> 1:50:26.680\n the United States, the capitalist system.\n\n1:50:26.680 --> 1:50:35.360\n Um, yeah, that was a very big culture shock to me to understand the different, the different\n\n1:50:35.360 --> 1:50:36.920\n fundamentally different way of life.\n\n1:50:36.920 --> 1:50:44.280\n But the interesting thing is, um, human nature pervades both systems and there is something\n\n1:50:44.280 --> 1:50:49.720\n about the Russian system that reveals human nature more intensely because of the underground\n\n1:50:49.720 --> 1:50:51.240\n nature of it.\n\n1:50:51.240 --> 1:50:55.920\n Because you get to deal with greed and trust and all those kinds of things in the United\n\n1:50:55.920 --> 1:50:59.280\n States, there is much more power to the rule of law.\n\n1:50:59.280 --> 1:51:05.000\n So there's rules and people follow those rules, they had to break the rules nonstop.\n\n1:51:05.000 --> 1:51:11.320\n Well, in East Germany and Russia, I believe, uh, theft, if you could get away with it was\n\n1:51:11.320 --> 1:51:13.520\n part of your economic activity.\n\n1:51:13.520 --> 1:51:14.520\n Yeah.\n\n1:51:14.520 --> 1:51:20.520\n I have a friend, uh, you know, who, who I went to school with, uh, up until my fourth\n\n1:51:20.520 --> 1:51:25.600\n year and, uh, we reconnected and he told me how he survived, you know, he would, you know,\n\n1:51:25.600 --> 1:51:28.840\n he would just steal stuff and then sell it and trade it.\n\n1:51:28.840 --> 1:51:29.840\n Yeah.\n\n1:51:29.840 --> 1:51:30.840\n Thefts.\n\n1:51:30.840 --> 1:51:32.320\n I mean, it's a relative concept.\n\n1:51:32.320 --> 1:51:34.120\n You are taking stuff.\n\n1:51:34.120 --> 1:51:41.320\n Uh, bribery, all those kinds of things, people, you know, um, corruption, you know, it's a\n\n1:51:41.320 --> 1:51:42.320\n relative term.\n\n1:51:42.320 --> 1:51:43.320\n No, I'm just kidding.\n\n1:51:43.320 --> 1:51:48.980\n I mean, it is, you have to work around the giant bureaucracy about the giant corruption.\n\n1:51:48.980 --> 1:51:53.080\n Corruption builds on top of corruption and then it just becomes this giant system that's\n\n1:51:53.080 --> 1:51:55.800\n unstable as you talked about.\n\n1:51:55.800 --> 1:51:56.800\n One last word.\n\n1:51:56.800 --> 1:51:57.800\n Yes.\n\n1:51:57.800 --> 1:52:05.920\n The two years in Moscow taught me how to be alone.\n\n1:52:05.920 --> 1:52:08.880\n I had no social interaction.\n\n1:52:08.880 --> 1:52:11.560\n Not with friends, not with women, not.\n\n1:52:11.560 --> 1:52:12.560\n No.\n\n1:52:12.560 --> 1:52:16.540\n I was, the only interaction I had was with the folks that trained me.\n\n1:52:16.540 --> 1:52:17.540\n So I was alone.\n\n1:52:17.540 --> 1:52:20.720\n It was a lonely two years.\n\n1:52:20.720 --> 1:52:22.680\n For a person who, who loves love.\n\n1:52:22.680 --> 1:52:23.680\n Yes.\n\n1:52:23.680 --> 1:52:24.680\n Is that difficult?\n\n1:52:24.680 --> 1:52:30.400\n It was for my first year and first and second year in the United States because I could\n\n1:52:30.400 --> 1:52:35.080\n not interact socially without giving away that something was wrong with me.\n\n1:52:35.080 --> 1:52:37.500\n I had to learn how to be an American.\n\n1:52:37.500 --> 1:52:39.200\n They didn't teach me in Moscow.\n\n1:52:39.200 --> 1:52:40.200\n They couldn't.\n\n1:52:40.200 --> 1:52:46.080\n So the first two years in, uh, in America, you had to kind of listen more than talk.\n\n1:52:46.080 --> 1:52:47.080\n Oh, you bet.\n\n1:52:47.080 --> 1:52:51.940\n The very first year I couldn't even work because I had to acquire the documents, the social\n\n1:52:51.940 --> 1:52:56.800\n security card and a driver's license, uh, to get a job.\n\n1:52:56.800 --> 1:53:03.340\n And then when I had the job, uh, I worked as a bike messenger, uh, that gave me a good\n\n1:53:03.340 --> 1:53:10.640\n opportunity to listen as, as, you know, because these people, they weren't very curious about\n\n1:53:10.640 --> 1:53:11.640\n me.\n\n1:53:11.640 --> 1:53:16.440\n What was your name in East Germany, what was your name in Moscow, what was your name in\n\n1:53:16.440 --> 1:53:17.440\n America?\n\n1:53:17.440 --> 1:53:18.440\n Okay.\n\n1:53:18.440 --> 1:53:21.840\n So my, the name I was given at birth is Albrecht Dittrich.\n\n1:53:21.840 --> 1:53:25.720\n It's so sexy when you speak in German with a German accent.\n\n1:53:25.720 --> 1:53:27.840\n I hate, I hated that name, the Albrecht.\n\n1:53:27.840 --> 1:53:28.840\n I didn't like it.\n\n1:53:28.840 --> 1:53:30.760\n It was, it was very rarely used.\n\n1:53:30.760 --> 1:53:36.140\n Uh, my mother named me after a famous German painter, Albrecht Dittrich.\n\n1:53:36.140 --> 1:53:42.960\n My cover name in Moscow was known as Dieter and, and, and in the United States I became\n\n1:53:42.960 --> 1:53:44.520\n Jack Barsky.\n\n1:53:44.520 --> 1:53:50.440\n In between I used a whole bunch of other names that were associated with, uh, false passports\n\n1:53:50.440 --> 1:53:53.900\n that, uh, uh, I used.\n\n1:53:53.900 --> 1:53:59.960\n One of the names I remember is William Dyson because that is the name that was on the Canadian\n\n1:53:59.960 --> 1:54:02.320\n passport I used to enter the United States.\n\n1:54:02.320 --> 1:54:03.880\n So how did you enter the United States?\n\n1:54:03.880 --> 1:54:06.720\n Can we take the journey from Moscow to the United States?\n\n1:54:06.720 --> 1:54:07.720\n Yeah.\n\n1:54:07.720 --> 1:54:08.720\n What was the assignment?\n\n1:54:08.720 --> 1:54:12.000\n What was the, what was that leap?\n\n1:54:12.000 --> 1:54:13.900\n What was like, what, uh.\n\n1:54:13.900 --> 1:54:20.680\n Just one, one, one thing in between, I had a three months practice trip to, to, uh, Canada.\n\n1:54:20.680 --> 1:54:25.080\n That was, that was a good idea and I got to tell you this, this one thing that happened\n\n1:54:25.080 --> 1:54:26.080\n there.\n\n1:54:26.080 --> 1:54:27.080\n Yes, please.\n\n1:54:27.080 --> 1:54:28.080\n Okay.\n\n1:54:28.080 --> 1:54:33.240\n So, because, you know, the one, one thing that I like to tell people nowadays is the,\n\n1:54:33.240 --> 1:54:37.360\n one of the secrets to happiness is the ability to make fun of the worst situations that you're\n\n1:54:37.360 --> 1:54:38.360\n in.\n\n1:54:38.360 --> 1:54:39.360\n Yes, absolutely.\n\n1:54:39.360 --> 1:54:40.360\n You see the humor.\n\n1:54:40.360 --> 1:54:41.360\n Yes.\n\n1:54:41.360 --> 1:54:42.360\n Okay.\n\n1:54:42.360 --> 1:54:47.740\n In hindsight, at least, uh, one of my, uh, the tasks that I had in, in, in Canada was\n\n1:54:47.740 --> 1:54:54.760\n to acquire a birth certificate, uh, with the name, uh, the name was Henry Van Randall,\n\n1:54:54.760 --> 1:54:56.960\n who was born someplace in California.\n\n1:54:56.960 --> 1:55:02.200\n And I was supposed to, uh, you know, write a little letter saying, I'm Henry Van Randall.\n\n1:55:02.200 --> 1:55:04.200\n Please send me a copy of my birth certificate.\n\n1:55:04.200 --> 1:55:11.640\n The fee is enclosed and, uh, and, and I, uh, I lived in a small hotel.\n\n1:55:11.640 --> 1:55:15.200\n So the return address, it wasn't visible that it was a hotel.\n\n1:55:15.200 --> 1:55:16.200\n That was important.\n\n1:55:16.200 --> 1:55:23.600\n So, and it took like three weeks and I get nothing, four weeks, I get nothing.\n\n1:55:23.600 --> 1:55:34.160\n Eventually I got annoyed and I, I, I, I mustered the courage to call them up from a pay phone.\n\n1:55:34.160 --> 1:55:39.320\n I called up the office registrar, whatever they were called in this, in this town in\n\n1:55:39.320 --> 1:55:44.120\n California and I, and I yelled at them, I said, you got my money, where's my birth certificate?\n\n1:55:44.120 --> 1:55:47.160\n Well, a couple of weeks later it came.\n\n1:55:47.160 --> 1:55:50.160\n So I see the envelope and it says Henry Van Randall.\n\n1:55:50.160 --> 1:55:51.160\n Yes.\n\n1:55:51.160 --> 1:55:58.300\n I had prepared the caretakers of the, um, of the hotel to, that I'm expecting a letter\n\n1:55:58.300 --> 1:55:59.600\n from my friend.\n\n1:55:59.600 --> 1:56:04.600\n So I went up to my room, I opened it and I was like, yes, yes, this is success.\n\n1:56:04.600 --> 1:56:09.600\n And then, and then I opened this thing and it was, it was a copy of a birth certificate,\n\n1:56:09.600 --> 1:56:13.840\n but it was stamped with big letters across in red deceased.\n\n1:56:13.840 --> 1:56:15.380\n Now think about it.\n\n1:56:15.380 --> 1:56:22.480\n So here's a dead people who was asking for that person who was asking for a birth certificate.\n\n1:56:22.480 --> 1:56:25.200\n I had the presence of mind to, to leave.\n\n1:56:25.200 --> 1:56:26.360\n Okay.\n\n1:56:26.360 --> 1:56:27.680\n I went to a couple of other cities.\n\n1:56:27.680 --> 1:56:30.280\n I should have left the country.\n\n1:56:30.280 --> 1:56:36.280\n But I know that the Royal Mounted Police was following me and I was given that information\n\n1:56:36.280 --> 1:56:38.280\n by the FBI later on.\n\n1:56:38.280 --> 1:56:39.280\n And they were,\n\n1:56:39.280 --> 1:56:44.920\n You were able to, oh, you were able to at least suspect that at the time through the,\n\n1:56:44.920 --> 1:56:45.920\n the, the,\n\n1:56:45.920 --> 1:56:48.720\n I knew that, I knew that there was trouble.\n\n1:56:48.720 --> 1:56:57.440\n So I, my counter surveillance route, yes, didn't discover anything.\n\n1:56:57.440 --> 1:57:04.480\n So I kept on going, I had to, supposed to, I was supposed to visit two more cities and\n\n1:57:04.480 --> 1:57:06.880\n they were always one step behind.\n\n1:57:06.880 --> 1:57:11.960\n What, what, what is interesting to me is that they didn't catch me on the way out.\n\n1:57:11.960 --> 1:57:14.960\n You have to show your passport to the airline.\n\n1:57:14.960 --> 1:57:18.720\n I mean, I, I, I was known by name.\n\n1:57:18.720 --> 1:57:23.520\n I would then, the path, because I had to give that to the hotel, right.\n\n1:57:23.520 --> 1:57:26.760\n And I, and I escaped with, by a hair.\n\n1:57:26.760 --> 1:57:27.760\n Yeah.\n\n1:57:27.760 --> 1:57:30.880\n They, they would have to keep you on a list, right?\n\n1:57:30.880 --> 1:57:31.880\n Yeah.\n\n1:57:31.880 --> 1:57:33.160\n Yeah, that's interesting.\n\n1:57:33.160 --> 1:57:38.920\n But that requires like a good computerized updated system to track all that stuff.\n\n1:57:38.920 --> 1:57:40.920\n This was Swiss air, so.\n\n1:57:40.920 --> 1:57:42.920\n Well, you got lucky.\n\n1:57:42.920 --> 1:57:43.920\n Yeah.\n\n1:57:43.920 --> 1:57:44.920\n Part of life is luck.\n\n1:57:44.920 --> 1:57:45.920\n You bet.\n\n1:57:45.920 --> 1:57:54.880\n So, so, and, and other than that, the, the trip to Canada was a big success because it,\n\n1:57:54.880 --> 1:58:03.720\n it gave me the culture shock that, that I needed to not be blown out of, out of the\n\n1:58:03.720 --> 1:58:04.720\n water.\n\n1:58:04.720 --> 1:58:06.040\n And when I get, get to the United States.\n\n1:58:06.040 --> 1:58:10.760\n So you hopped a few places in Canada and then Swiss air.\n\n1:58:10.760 --> 1:58:14.120\n I even had a, I even had a relationship with a young lady.\n\n1:58:14.120 --> 1:58:18.640\n A Canadian, French Canadian, regular Canadian.\n\n1:58:18.640 --> 1:58:25.440\n French Canadian, and she, she gave me a book, Winnie the Pooh, because we went to see the\n\n1:58:25.440 --> 1:58:30.320\n movie and then she wrote the dedication, she says, to the nicest German I've ever met.\n\n1:58:30.320 --> 1:58:32.320\n Was she lying?\n\n1:58:32.320 --> 1:58:33.320\n No.\n\n1:58:33.320 --> 1:58:37.240\n Or you don't know, maybe.\n\n1:58:37.240 --> 1:58:41.400\n Speaking of Spycraft, and that, that led to heartbreak too?\n\n1:58:41.400 --> 1:58:42.960\n No.\n\n1:58:42.960 --> 1:58:47.000\n That was sexual.\n\n1:58:47.000 --> 1:58:49.800\n I was not at that point.\n\n1:58:49.800 --> 1:58:50.800\n Ready for love?\n\n1:58:50.800 --> 1:58:51.800\n No.\n\n1:58:51.800 --> 1:58:52.800\n Ready to return to that old.\n\n1:58:52.800 --> 1:58:56.040\n Well, and I was, I was already married in Germany.\n\n1:58:56.040 --> 1:58:57.040\n Okay.\n\n1:58:57.040 --> 1:58:58.560\n That woman I loved.\n\n1:58:58.560 --> 1:59:00.240\n We should return to this.\n\n1:59:00.240 --> 1:59:01.320\n Yeah.\n\n1:59:01.320 --> 1:59:06.440\n So Swiss air, where did you land in the United States?\n\n1:59:06.440 --> 1:59:08.920\n Oh, when I came, where did I land?\n\n1:59:08.920 --> 1:59:17.680\n I, I, American Airlines, a flight from Mexico City to Toronto, but they made me deplane\n\n1:59:17.680 --> 1:59:19.480\n in Chicago.\n\n1:59:19.480 --> 1:59:20.480\n I have no idea.\n\n1:59:20.480 --> 1:59:21.480\n I think this was overengineering.\n\n1:59:21.480 --> 1:59:24.120\n That didn't make any sense to me.\n\n1:59:24.120 --> 1:59:29.440\n You know, why can't a Canadian just take a, take a flight from Mexico City?\n\n1:59:29.440 --> 1:59:31.480\n With this stopover, this kind of nonsense.\n\n1:59:31.480 --> 1:59:32.800\n Yeah, but, okay.\n\n1:59:32.800 --> 1:59:36.680\n But nevertheless, that was it, and then you landed in Chicago.\n\n1:59:36.680 --> 1:59:37.680\n Right.\n\n1:59:37.680 --> 1:59:39.200\n And tell me the story in America.\n\n1:59:39.200 --> 1:59:40.640\n What was the day to day life?\n\n1:59:40.640 --> 1:59:43.120\n Now this is, now you're a spy.\n\n1:59:43.120 --> 1:59:44.120\n No, no, no, no.\n\n1:59:44.120 --> 1:59:47.080\n I got to tell you another funny story.\n\n1:59:47.080 --> 1:59:48.140\n Yes.\n\n1:59:48.140 --> 1:59:55.260\n So it's another, there's two things that happened that could have ended my career as a spy right\n\n1:59:55.260 --> 1:59:56.580\n then and there.\n\n1:59:56.580 --> 2:00:03.720\n So I'm, so I'm, I'm arriving in, in Chicago in the evening.\n\n2:00:03.720 --> 2:00:05.200\n It's already dark.\n\n2:00:05.200 --> 2:00:13.060\n I had no idea what kind of a hotel to take, you know, I picked one out of a, out of yellow\n\n2:00:13.060 --> 2:00:15.900\n pages and got a taxi.\n\n2:00:15.900 --> 2:00:20.920\n When I gave him the address, he looked at me like a little funny, you know, whatever,\n\n2:00:20.920 --> 2:00:21.920\n what do I know?\n\n2:00:21.920 --> 2:00:22.920\n You know, it was keep on going.\n\n2:00:22.920 --> 2:00:29.460\n I need to get, I need to get sleep because I was extremely tense, you know, having gone\n\n2:00:29.460 --> 2:00:32.820\n through customs and border control.\n\n2:00:32.820 --> 2:00:39.680\n So and we were going in the Southern direction and I noticed that the neighborhoods became\n\n2:00:39.680 --> 2:00:41.720\n less and less inviting.\n\n2:00:41.720 --> 2:00:43.720\n Didn't know what that meant either.\n\n2:00:43.720 --> 2:00:50.320\n I get, I enter the hotel, it was a five story brownstone and something else looked funny.\n\n2:00:50.320 --> 2:00:55.760\n So the reception desk was protected by plexiglass.\n\n2:00:55.760 --> 2:01:02.560\n Not having enough background, I didn't know that this was unusual because all I knew that\n\n2:01:02.560 --> 2:01:04.480\n there was a lot of crime in the United States.\n\n2:01:04.480 --> 2:01:07.240\n So I thought maybe every hotel was like that.\n\n2:01:07.240 --> 2:01:12.280\n So I go up into my room and drink a half a bottle of, uh, Johnny Walker red because I,\n\n2:01:12.280 --> 2:01:16.620\n as one does, yeah, because I was so damn tense.\n\n2:01:16.620 --> 2:01:17.800\n I just wanted to sleep.\n\n2:01:17.800 --> 2:01:21.000\n I wanted to get into a coma, which I did.\n\n2:01:21.000 --> 2:01:26.600\n And then the next day I woke up with a head that was twice as big as felt twice as big.\n\n2:01:26.600 --> 2:01:28.040\n But you know, I was prepared.\n\n2:01:28.040 --> 2:01:33.760\n I had aspirin with me, so I killed the headache and went outside to see if I can get something\n\n2:01:33.760 --> 2:01:34.760\n to eat.\n\n2:01:34.760 --> 2:01:39.200\n And, uh, so I was right smack in the middle of the South side of Chicago.\n\n2:01:39.200 --> 2:01:41.680\n I didn't know that the South side of Chicago existed.\n\n2:01:41.680 --> 2:01:44.520\n I found later, I found out where I was.\n\n2:01:44.520 --> 2:01:50.440\n So it was time to go very quickly, uh, go up there.\n\n2:01:50.440 --> 2:01:57.800\n And at that point I decided I would, uh, uh, I would register, uh, at the next hotel on\n\n2:01:57.800 --> 2:01:59.900\n the Jack Barsky.\n\n2:01:59.900 --> 2:02:06.120\n So I went to the bathroom and I tried to kill, kill off, uh, uh, Mr. Dyson by burning his\n\n2:02:06.120 --> 2:02:07.120\n passport.\n\n2:02:07.120 --> 2:02:13.520\n Um, unfortunately I was not trained in how to train passport, uh, how to, how to destroy\n\n2:02:13.520 --> 2:02:20.080\n passports was, uh, so I tried to burn it and these things are flame retardant.\n\n2:02:20.080 --> 2:02:26.720\n And, uh, it created a cloud of smoke and I'm looking up there and there's a smoke detector.\n\n2:02:26.720 --> 2:02:27.720\n Yeah.\n\n2:02:27.720 --> 2:02:28.720\n Oh no.\n\n2:02:28.720 --> 2:02:29.720\n Okay.\n\n2:02:29.720 --> 2:02:33.400\n So presence of mind, I threw this thing in the toilet and then, then took out a pair\n\n2:02:33.400 --> 2:02:36.880\n of scissors and cut it into small pieces and flushed it down.\n\n2:02:36.880 --> 2:02:40.160\n If that smoke alarm goes off, I'm busted.\n\n2:02:40.160 --> 2:02:41.160\n Right.\n\n2:02:41.160 --> 2:02:46.840\n If somebody, if, if some, some criminal steals, I had $6,000 on me in cash, uh, steals either\n\n2:02:46.840 --> 2:02:51.400\n my passport or my, or my money or both.\n\n2:02:51.400 --> 2:02:52.400\n I don't know what to do.\n\n2:02:52.400 --> 2:02:53.400\n Yeah.\n\n2:02:53.400 --> 2:02:54.400\n You can't go to the authorities.\n\n2:02:54.400 --> 2:02:55.400\n You can't do anything.\n\n2:02:55.400 --> 2:02:56.880\n There weren't, there weren't any Russian, the Soviets in Chicago.\n\n2:02:56.880 --> 2:02:58.840\n Do you have any contacts?\n\n2:02:58.840 --> 2:02:59.840\n No.\n\n2:02:59.840 --> 2:03:06.080\n There was no, there was no, um, there was no plan B for Chicago at all.\n\n2:03:06.080 --> 2:03:07.080\n That's an oversight.\n\n2:03:07.080 --> 2:03:09.000\n I shouldn't, I shouldn't have gone to Chicago.\n\n2:03:09.000 --> 2:03:15.340\n They, they could have shipped me into, uh, um, uh, San Francisco or Washington DC because\n\n2:03:15.340 --> 2:03:17.360\n both of them had Soviets.\n\n2:03:17.360 --> 2:03:22.160\n My end goal was, uh, was to go to, to, to New York.\n\n2:03:22.160 --> 2:03:23.160\n Fine.\n\n2:03:23.160 --> 2:03:27.680\n Uh, you know, I would have been a really, really, uh, dangerous agent if I had gone\n\n2:03:27.680 --> 2:03:32.720\n back and worked with the KGB because I could have told them all the things, how to do it\n\n2:03:32.720 --> 2:03:33.720\n right.\n\n2:03:33.720 --> 2:03:34.720\n Right.\n\n2:03:34.720 --> 2:03:40.960\n So in that sense, there is some, given the scale of the KGB, there is, uh, some incompetence\n\n2:03:40.960 --> 2:03:41.960\n in this.\n\n2:03:41.960 --> 2:03:42.960\n Some.\n\n2:03:42.960 --> 2:03:43.960\n A lot of incompetence.\n\n2:03:43.960 --> 2:03:47.800\n Uh, to preparing me to be an American was almost total incompetence.\n\n2:03:47.800 --> 2:03:52.200\n And that, do you think that's representative of the way they operate is, uh, there's an\n\n2:03:52.200 --> 2:04:00.080\n incompetence like to the, uh, logistics, to the strategies involved, all that kind of\n\n2:04:00.080 --> 2:04:01.080\n stuff.\n\n2:04:01.080 --> 2:04:02.080\n Yeah.\n\n2:04:02.080 --> 2:04:03.920\n None of these guys had operated as illegals.\n\n2:04:03.920 --> 2:04:06.920\n They, they were outsiders to American society.\n\n2:04:06.920 --> 2:04:12.200\n They had interaction with Americans and, uh, but they all lived in, you know, in New York,\n\n2:04:12.200 --> 2:04:16.640\n they lived in a compound, uh, and in Northern Manhattan where they all lived together with\n\n2:04:16.640 --> 2:04:17.640\n their families.\n\n2:04:17.640 --> 2:04:22.680\n And, and they, most of the time they spent, uh, interacting with, with themselves, with\n\n2:04:22.680 --> 2:04:24.600\n their own people at work.\n\n2:04:24.600 --> 2:04:26.260\n So they really didn't integrate well.\n\n2:04:26.260 --> 2:04:32.440\n They did not know what it's like to be an American, to have a job, to, to, you know,\n\n2:04:32.440 --> 2:04:33.440\n live like an American.\n\n2:04:33.440 --> 2:04:34.440\n They didn't know it.\n\n2:04:34.440 --> 2:04:39.040\n It's interesting that KGB didn't put a high value to that kind of integration.\n\n2:04:39.040 --> 2:04:40.640\n They didn't know what they didn't know.\n\n2:04:40.640 --> 2:04:41.640\n Yeah.\n\n2:04:41.640 --> 2:04:42.640\n And by the way, this was mutual.\n\n2:04:42.640 --> 2:04:47.320\n Do you think the CIA had, had, uh, good knowledge of the Russian culture?\n\n2:04:47.320 --> 2:04:49.160\n Uh, same thing.\n\n2:04:49.160 --> 2:04:54.880\n And so, um, there was a lot of lack of understanding because good, good intelligence could have,\n\n2:04:54.880 --> 2:05:00.160\n uh, possibly avoided some of the, uh, high tension that, uh, situations that we had when,\n\n2:05:00.160 --> 2:05:03.880\n when in the eighties, we got close to nuclear war.\n\n2:05:03.880 --> 2:05:07.280\n So good intelligence would be integrating yourself in society.\n\n2:05:07.280 --> 2:05:08.280\n Yes.\n\n2:05:08.280 --> 2:05:09.280\n Much, much deeper.\n\n2:05:09.280 --> 2:05:14.080\n And that Ronald Reagan was not a warmonger, but he was talking about the end times because\n\n2:05:14.080 --> 2:05:16.560\n he was a Christian.\n\n2:05:16.560 --> 2:05:21.840\n But then that kind of integration can be dangerous because you start to question the propaganda,\n\n2:05:21.840 --> 2:05:26.640\n the narratives that, on which the KGB is built, on which the CIA is built.\n\n2:05:26.640 --> 2:05:31.840\n And then they have, they always have had the option of ignoring the intelligence that they're\n\n2:05:31.840 --> 2:05:32.840\n getting, right?\n\n2:05:32.840 --> 2:05:33.840\n Yeah.\n\n2:05:33.840 --> 2:05:37.320\n Well, let me ask you this question sort of to jump around.\n\n2:05:37.320 --> 2:05:42.440\n There's a lot of conspiracy theories in this, um, in this current climate, I mean, throughout\n\n2:05:42.440 --> 2:05:50.520\n history, but now especially, and some of the conspiracy theories put a lot of power in\n\n2:05:50.520 --> 2:05:59.280\n the hands of the intelligence agencies like CIA, FSB, Mossad, uh, MI6, they're basically\n\n2:05:59.280 --> 2:06:06.360\n the conspiracy theories go that they control the powerful people in this world.\n\n2:06:06.360 --> 2:06:13.000\n And are able to thereby manipulate those powerful people and manipulate the populace in order\n\n2:06:13.000 --> 2:06:16.820\n to deliver different kinds of messages and so on.\n\n2:06:16.820 --> 2:06:23.040\n Given your experience with this kind of tension between competence and malevolence, would\n\n2:06:23.040 --> 2:06:27.120\n you say there's some truth to those conspiracy theories?\n\n2:06:27.120 --> 2:06:28.500\n Not one way.\n\n2:06:28.500 --> 2:06:33.920\n I think, I think there is, there's collusion, there's collaboration, but I would think that,\n\n2:06:33.920 --> 2:06:39.680\n uh, like for instance, uh, uh, some folks in the CIA and the FBI, uh, are being used\n\n2:06:39.680 --> 2:06:42.680\n by the ones that are really in power.\n\n2:06:42.680 --> 2:06:43.680\n Power is money.\n\n2:06:43.680 --> 2:06:44.680\n Power is wealth.\n\n2:06:44.680 --> 2:06:49.720\n I know power is not the other, it can go both directions.\n\n2:06:49.720 --> 2:06:55.160\n You can acquire wealth first, which leads you to power, or you can acquire power first.\n\n2:06:55.160 --> 2:06:56.160\n Yeah.\n\n2:06:56.160 --> 2:07:02.000\n Power is also knowledge, I understand, and, and, uh, and a position in the society, in\n\n2:07:02.000 --> 2:07:05.920\n the military or in intelligence, but I don't think it's a straight one way that all the\n\n2:07:05.920 --> 2:07:09.780\n intelligence agencies control the powerful people in their country.\n\n2:07:09.780 --> 2:07:11.120\n You see what's happening in Russia.\n\n2:07:11.120 --> 2:07:17.440\n I mean, Putin dominates his intelligence agencies, right?\n\n2:07:17.440 --> 2:07:22.400\n Well, uh, so the question is which way the direction goes, but you're saying that there\n\n2:07:22.400 --> 2:07:25.680\n is, um, it's not one way flow of power.\n\n2:07:25.680 --> 2:07:27.240\n I would think so.\n\n2:07:27.240 --> 2:07:32.720\n It, and, and I also believe it exists, but it's not as prevalent as, you know, not every\n\n2:07:32.720 --> 2:07:38.440\n conspiracy theory, uh, pans out and most of them don't, they're just damn rumors, but\n\n2:07:38.440 --> 2:07:39.760\n that doesn't mean they don't exist.\n\n2:07:39.760 --> 2:07:41.320\n I guarantee you that they exist.\n\n2:07:41.320 --> 2:07:47.640\n There's collusion, there's people getting together and, uh, not necessarily, uh, preparing\n\n2:07:47.640 --> 2:07:53.720\n a specific action, but more sort of a plan to go forward and maintain the position or\n\n2:07:53.720 --> 2:07:58.240\n even, you know, uh, uh, strengthen the position that they already have.\n\n2:07:58.240 --> 2:08:05.200\n So KGB, but we can generalize this, FSB, CIA, do you think a KGB agent would kill someone\n\n2:08:05.200 --> 2:08:08.480\n against international law if they were ordered to do so?\n\n2:08:08.480 --> 2:08:09.480\n So we talked about...\n\n2:08:09.480 --> 2:08:10.480\n They did.\n\n2:08:10.480 --> 2:08:11.480\n They did.\n\n2:08:11.480 --> 2:08:21.240\n Uh, and there's, uh, there's a famous, uh, case of, uh, one, uh, uh, I think it's Vasily\n\n2:08:21.240 --> 2:08:24.120\n Kuklov who defected.\n\n2:08:24.120 --> 2:08:25.120\n He was a killer.\n\n2:08:25.120 --> 2:08:31.360\n He was a trained killer and he had, had, uh, done assassinations in other countries.\n\n2:08:31.360 --> 2:08:37.520\n He was sent to West Germany to kill a defector, a KGB defector, and he decided not to do it.\n\n2:08:37.520 --> 2:08:40.200\n He, he talked to the guy and he said, I'm supposed to kill you.\n\n2:08:40.200 --> 2:08:41.200\n I'm not.\n\n2:08:41.200 --> 2:08:44.240\n And then, and he eventually wound up in the United States.\n\n2:08:44.240 --> 2:08:50.400\n I have a connection to this fellow because the KGB once asked me to go to California\n\n2:08:50.400 --> 2:08:53.920\n and see if the guy still lives and works there.\n\n2:08:53.920 --> 2:09:03.160\n And, uh, we, uh, I found him and we looked at each other.\n\n2:09:03.160 --> 2:09:10.360\n So there was an active KGB agent looking at a man that he didn't know was the KGB defector,\n\n2:09:10.360 --> 2:09:11.360\n looking at each other.\n\n2:09:11.360 --> 2:09:13.440\n Neither one knew who the other one was.\n\n2:09:13.440 --> 2:09:15.000\n I found out later.\n\n2:09:15.000 --> 2:09:18.040\n But he was able to survive.\n\n2:09:18.040 --> 2:09:19.040\n Yes.\n\n2:09:19.040 --> 2:09:24.240\n And, you know, there, there have been assassinations, not, not a lot.\n\n2:09:24.240 --> 2:09:29.000\n And, uh, you know, that, that we know of, a good point.\n\n2:09:29.000 --> 2:09:36.040\n This is very difficult, uh, the, the, the, the, the question is how many lines are intelligence\n\n2:09:36.040 --> 2:09:42.920\n agencies able, willing to cross to attain, to achieve the goal?\n\n2:09:42.920 --> 2:09:48.800\n I, I think none of these agencies have the ultimate line.\n\n2:09:48.800 --> 2:09:55.600\n I think eventually they, the last line will be crossed if they believe it's necessary.\n\n2:09:55.600 --> 2:10:00.040\n Well, I think you can justify a lot of things, especially in this modern world with nuclear\n\n2:10:00.040 --> 2:10:04.680\n weapons that you can justify that you're saving the world actually.\n\n2:10:04.680 --> 2:10:08.400\n Let me ask a few difficult questions and we'll jump back to your time in America.\n\n2:10:08.400 --> 2:10:17.360\n But Vladimir Putin has been accused of ordering the poisoning and assassination of several\n\n2:10:17.360 --> 2:10:23.480\n people, including Alexander Levinenko early on all the way to Alexei Navalny.\n\n2:10:23.480 --> 2:10:27.460\n Do you think these accusations are grounded in truth?\n\n2:10:27.460 --> 2:10:34.200\n And we will return to a couple more questions maybe about Vladimir Putin's early days in\n\n2:10:34.200 --> 2:10:36.200\n the KGB, which would be interesting.\n\n2:10:36.200 --> 2:10:37.200\n Yeah.\n\n2:10:37.200 --> 2:10:40.980\n There, there's a, there's a phrase that I like to, uh, say in the response is called\n\n2:10:40.980 --> 2:10:43.200\n plausible deniability.\n\n2:10:43.200 --> 2:10:46.860\n I don't think Putin gave a direct command as they do that.\n\n2:10:46.860 --> 2:10:48.280\n He would just maybe muse.\n\n2:10:48.280 --> 2:10:54.980\n It would be nice if something were to happen and then somebody picks it up and does it.\n\n2:10:54.980 --> 2:11:01.040\n Is there, can you steel man the case that, uh, Putin did not have direct or indirect\n\n2:11:01.040 --> 2:11:02.040\n involvement with this?\n\n2:11:02.040 --> 2:11:04.520\n Who, who, who would know, who would know?\n\n2:11:04.520 --> 2:11:14.720\n You know, just the, the international, the reputation perhaps, um, perhaps catalyzed\n\n2:11:14.720 --> 2:11:20.280\n by Putin himself is that he is the kind of person that would directly or indirectly make\n\n2:11:20.280 --> 2:11:22.000\n those orders.\n\n2:11:22.000 --> 2:11:27.120\n Perhaps the case there is he's somebody to be feared and thereby you want that person\n\n2:11:27.120 --> 2:11:28.120\n out there.\n\n2:11:28.120 --> 2:11:37.360\n Uh, but the act itself, uh, the, the, the poisoning of, uh, Litvinenko and, uh, Oh,\n\n2:11:37.360 --> 2:11:43.680\n and then the assassination of the Bulgarian, uh, Markov and with a, with the umbrella\n\n2:11:43.680 --> 2:11:49.960\n and, and they all directly traced back to Russian, uh, Soviet intelligence.\n\n2:11:49.960 --> 2:11:54.680\n Uh, and so that's enough to be feared, right?\n\n2:11:54.680 --> 2:12:01.800\n Um, my answer that I gave you is an educated guess, you know, I can't pretend to know this\n\n2:12:01.800 --> 2:12:02.800\n for sure, but\n\n2:12:02.800 --> 2:12:07.720\n It's frustrating to me because there's a lot of people listening to this would say,\n\n2:12:07.720 --> 2:12:15.440\n but even, uh, sort of would chuckle at the naive nature of the question.\n\n2:12:15.440 --> 2:12:20.400\n But if you actually keep an open mind, you have to understand what is the way that intelligence\n\n2:12:20.400 --> 2:12:21.880\n agencies function?\n\n2:12:21.880 --> 2:12:29.520\n Is it possible to the head of an intelligence agency not to make direct orders of that kind\n\n2:12:29.520 --> 2:12:30.760\n where there's a distributed\n\n2:12:30.760 --> 2:12:34.880\n No, the head of the intelligence agency would most likely give the order.\n\n2:12:34.880 --> 2:12:36.440\n Even though it's compartmentalized.\n\n2:12:36.440 --> 2:12:39.920\n Yeah, but, but, uh, but not the head of state.\n\n2:12:39.920 --> 2:12:46.760\n Not maybe not the head of state, although, uh, in the case, this is the case in the United\n\n2:12:46.760 --> 2:12:50.160\n States as well, but certainly is the case in Russia.\n\n2:12:50.160 --> 2:12:55.840\n There are close relationships between the head of the FSB and the GRU and personal relationships,\n\n2:12:55.840 --> 2:12:56.840\n not just even\n\n2:12:56.840 --> 2:13:02.080\n The head of the FSB who is now in jail.\n\n2:13:02.080 --> 2:13:08.320\n There's a interesting details, especially, uh, coming out recently around the war in\n\n2:13:08.320 --> 2:13:09.320\n Ukraine.\n\n2:13:09.320 --> 2:13:14.760\n So let me actually ask about the war in Ukraine.\n\n2:13:14.760 --> 2:13:21.120\n What is your analysis of the war in Ukraine from 2014 to the full on invasion of Ukraine\n\n2:13:21.120 --> 2:13:27.440\n by Russia in 2022 in February, 2022?\n\n2:13:27.440 --> 2:13:33.040\n But um, there's many questions we could ask.\n\n2:13:33.040 --> 2:13:37.800\n One is, what are the sins of the governments involved?\n\n2:13:37.800 --> 2:13:45.920\n What are the sins of Russia, Ukraine, America, China?\n\n2:13:45.920 --> 2:13:48.320\n Are those sins comparable?\n\n2:13:48.320 --> 2:13:49.800\n Who are the good guys and the bad guys?\n\n2:13:49.800 --> 2:13:52.240\n That was more than one question.\n\n2:13:52.240 --> 2:14:01.880\n Let me just, uh, uh, give you my, the basics about this savvy observers saw this coming.\n\n2:14:01.880 --> 2:14:09.000\n There were very small minority, uh, because Vladimir Putin was pretty open about what\n\n2:14:09.000 --> 2:14:15.960\n he told the world his mission was, was the reestablishment of a strong Russia, the reestablishment\n\n2:14:15.960 --> 2:14:22.160\n of something like the, the Russian empire to unite all the Russian speaking, uh, uh,\n\n2:14:22.160 --> 2:14:27.280\n people, uh, in, under one country and, uh, the world ignored him.\n\n2:14:27.280 --> 2:14:32.240\n I mean, he was open, uh, what was, was at a, at a conference in, in, in, in France,\n\n2:14:32.240 --> 2:14:38.600\n I believe when we, we set this out, out in the open, uh, and then what we had, uh, in\n\n2:14:38.600 --> 2:14:44.960\n the United States, we had wishful, wishful thinking, you know, Obama had this reset with\n\n2:14:44.960 --> 2:14:48.640\n Russia, you know, we all get friendly.\n\n2:14:48.640 --> 2:14:54.960\n And then when, when, uh, uh, Putin invaded, uh, Crimea, we did nothing.\n\n2:14:54.960 --> 2:15:03.440\n So and it, and it just escalated slowly, but surely it was pretty clear.\n\n2:15:03.440 --> 2:15:08.400\n And then they said, uh, it was, I think two years ago, there was an essay published by,\n\n2:15:08.400 --> 2:15:12.880\n uh, Putin, whether he wrote it or not, it doesn't matter, but that was also out in public\n\n2:15:12.880 --> 2:15:15.840\n where he was, again, quite clear what he was going to do.\n\n2:15:15.840 --> 2:15:20.520\n Now how do you do this with force?\n\n2:15:20.520 --> 2:15:26.160\n And, uh, and the, the sins committed by the American government was that we ignored it.\n\n2:15:26.160 --> 2:15:32.680\n We weren't engaged in wishful thinking and we didn't stop it with sanctions before the\n\n2:15:32.680 --> 2:15:34.040\n shooting started.\n\n2:15:34.040 --> 2:15:40.440\n To push back, I don't think you're fully describing, you are describing the sins of the Russian\n\n2:15:40.440 --> 2:15:42.320\n government and Putin.\n\n2:15:42.320 --> 2:15:46.440\n I don't think you're fully describing the sins of the American government here because\n\n2:15:46.440 --> 2:15:51.580\n not only didn't, you're doing, you're describing the miscalculation.\n\n2:15:51.580 --> 2:15:58.200\n So not only did they not pressure correctly with sanctions and so on and, and, and clearly\n\n2:15:58.200 --> 2:16:02.280\n respond to the actual statements and the essays and the words spoken.\n\n2:16:02.280 --> 2:16:04.080\n I know where you're going, but keep on speaking.\n\n2:16:04.080 --> 2:16:05.080\n Yes.\n\n2:16:05.080 --> 2:16:13.080\n But they also, at the same time, pressured, pressured Russia and they also, as, as Putin\n\n2:16:13.080 --> 2:16:19.600\n himself said, sort of, there's a rat and they pushed the rat towards the corner by expanding\n\n2:16:19.600 --> 2:16:31.320\n NATO and, uh, and arming Ukraine and the military industrial complex is a machine that, uh,\n\n2:16:31.320 --> 2:16:39.400\n that led us, um, and I think a lot of younger people, I mean, when I came to this country\n\n2:16:39.400 --> 2:16:48.680\n and this is the country I love, I lived through 9 11, I lived through the full roller coaster\n\n2:16:48.680 --> 2:16:49.680\n of emotion.\n\n2:16:49.680 --> 2:16:50.680\n Yeah.\n\n2:16:50.680 --> 2:16:55.880\n I'm a, at that time, before that and after was a proud American.\n\n2:16:55.880 --> 2:17:02.560\n I went through the whole roller coaster of, uh, being sold, uh, I would say a lie about\n\n2:17:02.560 --> 2:17:07.780\n the reason to invade Iraq and even Afghanistan.\n\n2:17:07.780 --> 2:17:14.040\n And I've got to live through understanding of this military industrial complex that leads\n\n2:17:14.040 --> 2:17:22.760\n to the expansion of vampires, of the delusion that we have in the populace, in, in the government\n\n2:17:22.760 --> 2:17:31.800\n that convinces us that we are the good guys and somehow with military force, we can instill\n\n2:17:31.800 --> 2:17:36.160\n our values, instill happiness, the pursuit of happiness that all men are created equal\n\n2:17:36.160 --> 2:17:43.800\n these ideas in, into other lands and we can do so with drones and we can do so with weapons\n\n2:17:43.800 --> 2:17:49.140\n and we could do so without significant cost to our own, from our own pockets.\n\n2:17:49.140 --> 2:17:55.040\n And so this idea, this machine doesn't just apply to Afghanistan and Iraq, it doesn't\n\n2:17:55.040 --> 2:18:00.280\n just apply to Yemen and Syria, it doesn't just apply to China, it also applies to Ukraine.\n\n2:18:00.280 --> 2:18:01.840\n It also applies to Russia.\n\n2:18:01.840 --> 2:18:02.840\n Agreed.\n\n2:18:02.840 --> 2:18:09.680\n Two thoughts, if I may, uh, first of all, when does not hear the term military industrial\n\n2:18:09.680 --> 2:18:16.680\n complex in the public discourse these days, Eisenhower warned about it, Eisenhower was\n\n2:18:16.680 --> 2:18:20.780\n a capitalist, he was the president of the United States.\n\n2:18:20.780 --> 2:18:24.120\n So it exists and it is very powerful.\n\n2:18:24.120 --> 2:18:29.120\n The more weapons you can sell, the more you have to replace them or send over, you have\n\n2:18:29.120 --> 2:18:30.120\n to replace them.\n\n2:18:30.120 --> 2:18:41.580\n So yes, the other thing is there's also a messianic streak that powers American foreign\n\n2:18:41.580 --> 2:18:42.580\n policy.\n\n2:18:42.580 --> 2:18:45.660\n We want to make the world just like us.\n\n2:18:45.660 --> 2:18:47.000\n Why don't they get it?\n\n2:18:47.000 --> 2:18:48.380\n Because they don't want to.\n\n2:18:48.380 --> 2:18:53.520\n It's almost like it's not communism, but it's a, it's a very similar romantic idea that\n\n2:18:53.520 --> 2:18:58.240\n we can make the world then fashion the world the way we are.\n\n2:18:58.240 --> 2:19:04.080\n And that's the romantic side and the sort of honest side, but it doesn't work.\n\n2:19:04.080 --> 2:19:05.320\n It failed every time, right?\n\n2:19:05.320 --> 2:19:11.800\n You know, Afghanistan is a Royal mess and was, would never become a functioning democracy.\n\n2:19:11.800 --> 2:19:16.440\n I don't know if, if Ukraine can become a functioning democracy.\n\n2:19:16.440 --> 2:19:23.040\n So well, I don't know if American weapons can help Ukraine become a functional democracy.\n\n2:19:23.040 --> 2:19:31.680\n I yeah, but there's a huge amount of interest in seeing the world in black and white and\n\n2:19:31.680 --> 2:19:39.560\n selling the story of the world is black and white that Ukraine is the symbol of democracy\n\n2:19:39.560 --> 2:19:42.960\n in this East Eastern European world.\n\n2:19:42.960 --> 2:19:47.480\n And Russia is the symbol of authoritarian dictatorship.\n\n2:19:47.480 --> 2:19:54.080\n And the story is not so simple as, as, as many indices show, Ukraine and Russia are\n\n2:19:54.080 --> 2:19:57.320\n the number one and the number two most corrupt countries in Europe.\n\n2:19:57.320 --> 2:19:59.600\n There are two P's in a pod.\n\n2:19:59.600 --> 2:20:03.440\n One is bigger and one is in this case, the aggressor.\n\n2:20:03.440 --> 2:20:10.760\n Now, you know, two P's, the aggressor is still ultimately responsible.\n\n2:20:10.760 --> 2:20:13.480\n And the person that throws the first punch.\n\n2:20:13.480 --> 2:20:19.040\n Now there's a lot of people going to disagree where the punch came from, but there is, there\n\n2:20:19.040 --> 2:20:28.080\n is magnitude and the struggle by Ukraine for its sovereignty stretches back to the beginning\n\n2:20:28.080 --> 2:20:29.080\n of the 20th century.\n\n2:20:29.080 --> 2:20:31.720\n It stretches back even further than that.\n\n2:20:31.720 --> 2:20:38.000\n But there's been the Ukrainian people are proud people and they've been in many cases\n\n2:20:38.000 --> 2:20:44.200\n tortured by those that sit in the Kremlin throughout the 20th century, the, the, the\n\n2:20:44.200 --> 2:20:46.940\n famine in the, in the early thirties.\n\n2:20:46.940 --> 2:20:51.160\n And it's always, it's never the middle class and upper class that suffer.\n\n2:20:51.160 --> 2:20:59.280\n So is the lower classes, the peasants in that time that this history stretches back far.\n\n2:20:59.280 --> 2:21:02.360\n And this is yet another manifestation of that.\n\n2:21:02.360 --> 2:21:05.920\n And there's a lot of interests at play.\n\n2:21:05.920 --> 2:21:12.360\n China watches closely, Russia, America watches closely.\n\n2:21:12.360 --> 2:21:17.800\n And there's an extra caveat here that there's nuclear weapons at play as well.\n\n2:21:17.800 --> 2:21:18.800\n Exactly.\n\n2:21:18.800 --> 2:21:26.360\n And it's what this is the situation is as dangerous as I have lived through in my entire\n\n2:21:26.360 --> 2:21:28.040\n life, I believe.\n\n2:21:28.040 --> 2:21:33.860\n And because it's not necessarily at the highest point of escalation, but it will be in my\n\n2:21:33.860 --> 2:21:36.840\n view, a protracted crisis.\n\n2:21:36.840 --> 2:21:42.640\n And the longer that crisis lasts, the more of a chance there is of an accident.\n\n2:21:42.640 --> 2:21:43.680\n Yeah.\n\n2:21:43.680 --> 2:21:44.680\n One rocket.\n\n2:21:44.680 --> 2:21:45.680\n Yeah.\n\n2:21:45.680 --> 2:21:51.020\n There's seems to be a strong incentive to prolong, to do siege tactics, to prolong this\n\n2:21:51.020 --> 2:21:57.200\n conflict over perhaps many years, which is terrifying to think about.\n\n2:21:57.200 --> 2:22:05.960\n And over that, a single rocket can lead to, given that there's leaders that might be losing\n\n2:22:05.960 --> 2:22:14.880\n their mind and Ukraine is not part of NATO, the thing I'm really afraid of is that somebody\n\n2:22:14.880 --> 2:22:19.420\n might think it's a good idea for Russia.\n\n2:22:19.420 --> 2:22:25.160\n So Putin might think it's a good idea for Russia to send a message by launching a nuke\n\n2:22:25.160 --> 2:22:28.960\n against Ukraine because they're not part of NATO.\n\n2:22:28.960 --> 2:22:31.560\n So surely the West is not going to respond.\n\n2:22:31.560 --> 2:22:39.440\n What is the West going to do if Russia nukes Ukraine to send a message?\n\n2:22:39.440 --> 2:22:44.880\n I don't know if anyone knows the answer to that question, but it's a terrifying question.\n\n2:22:44.880 --> 2:22:53.840\n And I don't know the exact protocol that needs to be followed to launch a nuclear strike\n\n2:22:53.840 --> 2:22:59.120\n on NATO's end because we have several countries in NATO that have nuclear weapons.\n\n2:22:59.120 --> 2:23:04.760\n So let's say for France to fire a nuke, does the United States have to agree?\n\n2:23:04.760 --> 2:23:05.840\n I don't know how that works.\n\n2:23:05.840 --> 2:23:10.600\n I don't know if anyone knows how that works.\n\n2:23:10.600 --> 2:23:17.680\n I worry, now we have different, very kind of anecdotal perspectives on these things,\n\n2:23:17.680 --> 2:23:23.240\n but the people I've interacted with in the DOD, Department of Defense, in the military,\n\n2:23:23.240 --> 2:23:28.960\n there is a compartmentalization, there is a bureaucracy, and within that giant bureaucracy,\n\n2:23:28.960 --> 2:23:29.960\n there's incompetence.\n\n2:23:29.960 --> 2:23:37.860\n We'd like to think that there is like really well organized for really important things.\n\n2:23:37.860 --> 2:23:42.720\n There's going to be the best of the best in the world that's going to execute on the correct\n\n2:23:42.720 --> 2:23:46.880\n decisions both geopolitically, militarily, all that kind of stuff.\n\n2:23:46.880 --> 2:23:53.200\n And I've seen enough to know that competence at any level of government, at any level in\n\n2:23:53.200 --> 2:23:54.720\n the military is not guaranteed.\n\n2:23:54.720 --> 2:23:57.920\n Let's go back to the law of hierarchy.\n\n2:23:57.920 --> 2:24:01.680\n The government is the biggest hierarchy there is.\n\n2:24:01.680 --> 2:24:06.280\n And so invariably, politicians find their way to the top.\n\n2:24:06.280 --> 2:24:17.800\n And once you have politics dictating substantive decisions, they're going to be weak or wrong.\n\n2:24:17.800 --> 2:24:20.840\n I don't know how this could work any other way.\n\n2:24:20.840 --> 2:24:26.720\n Right now we have some functional idiots in the central United States government.\n\n2:24:26.720 --> 2:24:33.960\n Well, let me, because you said that, I think elsewhere you said that Putin was not a good\n\n2:24:33.960 --> 2:24:34.960\n KGB agent.\n\n2:24:34.960 --> 2:24:35.960\n That's right.\n\n2:24:35.960 --> 2:24:39.200\n A mediocre one, but is an excellent politician.\n\n2:24:39.200 --> 2:24:40.200\n Yeah.\n\n2:24:40.200 --> 2:24:41.200\n And a good organizer.\n\n2:24:41.200 --> 2:24:43.640\n He was known as a really, really good organizer.\n\n2:24:43.640 --> 2:24:56.920\n When Yeltsin hired him as prime minister, he cleaned up the mess because under Yeltsin,\n\n2:24:56.920 --> 2:25:03.800\n Russia deteriorated tremendously and it became sort of a mix of an oligarchy and a criminal\n\n2:25:03.800 --> 2:25:06.760\n enterprise and chaotic.\n\n2:25:06.760 --> 2:25:09.160\n So he had skills that made him a good executive.\n\n2:25:09.160 --> 2:25:10.160\n Absolutely.\n\n2:25:10.160 --> 2:25:12.560\n Now let's go back to him as a KGB agent.\n\n2:25:12.560 --> 2:25:14.720\n He was a KGB agent.\n\n2:25:14.720 --> 2:25:20.300\n I mean, according to him, once a KGB agent, always a KGB agent.\n\n2:25:20.300 --> 2:25:25.900\n But 16 years, let's say, something like this.\n\n2:25:25.900 --> 2:25:33.800\n What do you think about, from your experience, now you're maybe the same age as him, approximately\n\n2:25:33.800 --> 2:25:34.800\n the same age as him.\n\n2:25:34.800 --> 2:25:35.800\n He's a little younger.\n\n2:25:35.800 --> 2:25:36.800\n A little younger.\n\n2:25:36.800 --> 2:25:37.800\n Yeah.\n\n2:25:37.800 --> 2:25:44.480\n So what do you think about the KGB experience he had made him the man he is?\n\n2:25:44.480 --> 2:25:51.720\n What aspect of that, from your own experience, how much does that define you, who you are,\n\n2:25:51.720 --> 2:25:56.820\n how you think about the world, how you analyze the geopolitics of the world, how you analyze\n\n2:25:56.820 --> 2:25:58.040\n human nature?\n\n2:25:58.040 --> 2:26:00.000\n Now I got to tell you one thing.\n\n2:26:00.000 --> 2:26:01.920\n He had a different type of training than I did.\n\n2:26:01.920 --> 2:26:06.840\n Mine was one on one and he went to school, so to speak.\n\n2:26:06.840 --> 2:26:07.840\n So...\n\n2:26:07.840 --> 2:26:08.840\n Classroom training.\n\n2:26:08.840 --> 2:26:09.840\n Right.\n\n2:26:09.840 --> 2:26:18.200\n But fundamentally, he was not a top agent.\n\n2:26:18.200 --> 2:26:21.960\n This is very simple to... There's only one thing you need to know.\n\n2:26:21.960 --> 2:26:24.720\n He knows German pretty well.\n\n2:26:24.720 --> 2:26:27.240\n So where was he deployed?\n\n2:26:27.240 --> 2:26:28.920\n In East Germany.\n\n2:26:28.920 --> 2:26:31.160\n Not in West Germany, not in Switzerland, not in Austria.\n\n2:26:31.160 --> 2:26:35.800\n That's where they sent the best, right, one would think, generally.\n\n2:26:35.800 --> 2:26:37.360\n We're learning here.\n\n2:26:37.360 --> 2:26:41.360\n So this is your classification of where they send the best.\n\n2:26:41.360 --> 2:26:45.400\n People classify all kinds of stuff, like what is the best university in the world?\n\n2:26:45.400 --> 2:26:47.780\n What is the best football team in the world?\n\n2:26:47.780 --> 2:26:53.720\n You start to get a sense, the good guys get sent, the best athletes get sent to... Well,\n\n2:26:53.720 --> 2:26:58.200\n we disagree on this, but the football team is... But you have a sense and you're saying\n\n2:26:58.200 --> 2:27:00.240\n that the best agents would have been sent to West Germany.\n\n2:27:00.240 --> 2:27:01.240\n One would think so.\n\n2:27:01.240 --> 2:27:08.720\n So this is not a forcing argument, but I also have it from a word from the horse's mouth.\n\n2:27:08.720 --> 2:27:10.520\n Which horse?\n\n2:27:10.520 --> 2:27:13.280\n I mean, what kind of horse?\n\n2:27:13.280 --> 2:27:14.280\n What's the breed of the horse?\n\n2:27:14.280 --> 2:27:15.720\n Oleg Kalugin.\n\n2:27:15.720 --> 2:27:17.680\n You know who Oleg Kalugin is.\n\n2:27:17.680 --> 2:27:18.840\n He's still alive.\n\n2:27:18.840 --> 2:27:25.960\n He was, at one point, the head of counterintelligence for the first directorate, espionage, right?\n\n2:27:25.960 --> 2:27:31.000\n And Putin was in the first directorate and reported to Kalugin for a while.\n\n2:27:31.000 --> 2:27:39.240\n And Oleg told me, to my face, that Oleg was not an impressive agent trainee or agent.\n\n2:27:39.240 --> 2:27:41.220\n That Vladimir Putin was not impressive.\n\n2:27:41.220 --> 2:27:42.520\n Not impressive at all.\n\n2:27:42.520 --> 2:27:47.720\n Now he's biased, given this current situation.\n\n2:27:47.720 --> 2:27:53.240\n Well yeah, he could still make it up because he had this big ruckus when he was in parliament\n\n2:27:53.240 --> 2:27:58.320\n and called Putin a war criminal about the war in Serbia.\n\n2:27:58.320 --> 2:28:03.000\n Not only could he make it up, I wouldn't trust his analysis.\n\n2:28:03.000 --> 2:28:08.460\n I mean, I have to, you know, when people, I've been working very hard even before this\n\n2:28:08.460 --> 2:28:12.200\n war to try to understand objective analysis of all the parties involved.\n\n2:28:12.200 --> 2:28:17.480\n You have to really keep an open mind here to see clearly, to understand if you are to\n\n2:28:17.480 --> 2:28:24.800\n try to help in some way make a better world.\n\n2:28:24.800 --> 2:28:32.000\n In this case, stop this war or have all the countries involved flourish, bring out the\n\n2:28:32.000 --> 2:28:36.860\n best of the people, remove the corruption and the greed and the destructive aspects\n\n2:28:36.860 --> 2:28:39.240\n of the governments and let the people flourish.\n\n2:28:39.240 --> 2:28:48.440\n For all of that, you have to put all the biases aside, all the political bickering, all the,\n\n2:28:48.440 --> 2:28:53.600\n I don't know, all the biased analysis.\n\n2:28:53.600 --> 2:29:02.600\n And there's a lot of propaganda that says that, in fact, Putin was a good agent.\n\n2:29:02.600 --> 2:29:05.560\n How else would he rise through the ranks, right?\n\n2:29:05.560 --> 2:29:14.520\n Because he was a good politician and he made a lot of good connections within the KGB.\n\n2:29:14.520 --> 2:29:16.680\n Allow me to say something here.\n\n2:29:16.680 --> 2:29:23.800\n You just taught me a lesson and the lesson I should have figured out myself because I\n\n2:29:23.800 --> 2:29:30.380\n keep on telling people that in the intelligence world, you never know the truth 100%.\n\n2:29:30.380 --> 2:29:34.140\n So when you said, oh, I could make that up, of course you could have.\n\n2:29:34.140 --> 2:29:39.720\n But you get to a point where you're forced to make a decision or have an opinion and\n\n2:29:39.720 --> 2:29:43.880\n then you use your best educated guess.\n\n2:29:43.880 --> 2:29:49.880\n So I'm gonna take the certainty of the statement that I made back because it's quite possible\n\n2:29:49.880 --> 2:29:50.880\n that you're right.\n\n2:29:50.880 --> 2:29:55.120\n Well, what I've noticed about Vladimir Putin, and this is true about, for example, Donald\n\n2:29:55.120 --> 2:30:02.640\n Trump and all those kinds of divisive figures, that for some reason people's opinion on the\n\n2:30:02.640 --> 2:30:05.960\n details of those people are very sticky.\n\n2:30:05.960 --> 2:30:12.300\n Once you decide this is a bad guy, there's like a black hole and people are not able\n\n2:30:12.300 --> 2:30:15.640\n to think one act at a time.\n\n2:30:15.640 --> 2:30:23.760\n You don't have to, that doesn't somehow justify this, this somehow doesn't remove all the\n\n2:30:23.760 --> 2:30:27.240\n evil things that are done, but you can analyze clearly each of the actions.\n\n2:30:27.240 --> 2:30:33.000\n And to me, it is interesting to see how did this man rise through the ranks.\n\n2:30:33.000 --> 2:30:40.200\n Now you're saying that to be a KGB agent, there's a lot of skills involved.\n\n2:30:40.200 --> 2:30:51.400\n Perhaps raw technical skill of spycraft is perhaps not related to the skill of rising\n\n2:30:51.400 --> 2:30:53.720\n through the ranks.\n\n2:30:53.720 --> 2:30:56.760\n And you're saying as a politician, he was good at rising through the ranks.\n\n2:30:56.760 --> 2:31:05.200\n Lying and influencing, that is something that is significant as a significant talent and\n\n2:31:05.200 --> 2:31:11.440\n ability that an agent must have, that helps you as a politician.\n\n2:31:11.440 --> 2:31:20.480\n Continuing the kind of thread of the role of KGB in defining the heart, soul, and mind\n\n2:31:20.480 --> 2:31:27.200\n of Vladimir Putin, let me return to Yuri Bismenov, who was a Soviet KGB agent that wrote a four\n\n2:31:27.200 --> 2:31:33.280\n step framework for ideological subversion on a national scale as practiced by the Soviet\n\n2:31:33.280 --> 2:31:34.280\n Union.\n\n2:31:34.280 --> 2:31:40.920\n And the four steps are demoralization, destabilization, crisis, and normalization.\n\n2:31:40.920 --> 2:31:46.340\n He had a lot of other kind of systematic ways of describing this kind of stuff.\n\n2:31:46.340 --> 2:31:55.280\n So can you speak to some of these ideas about the systematic large scale ideological subversion\n\n2:31:55.280 --> 2:31:56.680\n goals of the KGB?\n\n2:31:56.680 --> 2:32:00.040\n Is there truth to that kind of those ideas?\n\n2:32:00.040 --> 2:32:08.280\n Yes, but I think I already sort of mentioned that I think Bismenov was a fraud.\n\n2:32:08.280 --> 2:32:15.160\n And I have, again, good arguments, let's put it this way.\n\n2:32:15.160 --> 2:32:24.760\n First of all, we know that the KGB was involved in active measures, which is...\n\n2:32:24.760 --> 2:32:29.240\n You can call it fake news.\n\n2:32:29.240 --> 2:32:36.080\n Putting fake news into the countries that are your adversaries.\n\n2:32:36.080 --> 2:32:42.020\n And the Russians have been doing this lately by meddling in our election and focusing\n\n2:32:42.020 --> 2:32:48.280\n on the left and the right fringe and influencing them to become more left and more right.\n\n2:32:48.280 --> 2:32:57.360\n And Vasily Mitrokhin has in one of his books, he has a whole chapter about active measures.\n\n2:32:57.360 --> 2:33:03.040\n Okay, so what he has to say about the department, and I forgot what department that was, was\n\n2:33:03.040 --> 2:33:07.600\n the one department that was the least desirable for KGB agents.\n\n2:33:07.600 --> 2:33:15.580\n Because these were desk jobs for people who had to come up with fake stories in countries\n\n2:33:15.580 --> 2:33:20.360\n where they didn't quite know too much about the country.\n\n2:33:20.360 --> 2:33:27.360\n Now there were some successes, like one of the two most famous successes that I'm aware\n\n2:33:27.360 --> 2:33:37.520\n of is that the AIDS virus was concocted in a CIA lab, and a lot of people around the\n\n2:33:37.520 --> 2:33:39.080\n world believe that.\n\n2:33:39.080 --> 2:33:47.760\n And the other one was that J. Edgar Hoover was a secret cross dresser.\n\n2:33:47.760 --> 2:33:52.000\n That is still known by a lot of Americans who are of a certain age that this was the\n\n2:33:52.000 --> 2:33:53.000\n truth.\n\n2:33:53.000 --> 2:33:59.440\n But Mitrokhin actually traces it back to a story that was placed in a sort of left wing\n\n2:33:59.440 --> 2:34:10.960\n but close to mainstream French magazine, and it was then taken up by larger newspapers\n\n2:34:10.960 --> 2:34:13.900\n and well established papers.\n\n2:34:13.900 --> 2:34:23.680\n So they had some successes, but this kind of a massive, well thought out campaign to\n\n2:34:23.680 --> 2:34:31.240\n destabilize the United States, I don't believe the KGB was capable of doing that.\n\n2:34:31.240 --> 2:34:33.520\n Mitrokhin seems to agree with me.\n\n2:34:33.520 --> 2:34:40.040\n I was trained, I would think, I was one of the crown jewels of their agents.\n\n2:34:40.040 --> 2:34:47.200\n One would think that they used the best that they had to help me how to become an American,\n\n2:34:47.200 --> 2:34:50.080\n and they didn't have a clue.\n\n2:34:50.080 --> 2:34:55.300\n If you don't know how a country operates, how do you come up with this kind of a very\n\n2:34:55.300 --> 2:35:02.920\n detailed long term plan that's also timed, two years this and one year that and all that?\n\n2:35:02.920 --> 2:35:06.720\n Yeah, so we should actually just clarify.\n\n2:35:06.720 --> 2:35:18.400\n He has this whole idea that there's 15 to 20 years needed for demoralization where you're\n\n2:35:18.400 --> 2:35:23.600\n basically infiltrating a country or people from a young age, manipulating their mind.\n\n2:35:23.600 --> 2:35:27.840\n You're destabilizing them, that's the second step that takes two to five years.\n\n2:35:27.840 --> 2:35:31.480\n You target the country's foreign relations, defense and economy.\n\n2:35:31.480 --> 2:35:36.880\n You create a crisis artificially and then you normalize it as if it always was this\n\n2:35:36.880 --> 2:35:37.880\n way.\n\n2:35:37.880 --> 2:35:48.720\n So it's basically saying that the KGB is capable of, at scale, over many years, manipulate\n\n2:35:48.720 --> 2:35:52.080\n an entire population of people.\n\n2:35:52.080 --> 2:35:59.720\n And this is kind of, there's a lot of people that believe in conspiracy theories that are\n\n2:35:59.720 --> 2:36:01.920\n amenable to this kind of idea.\n\n2:36:01.920 --> 2:36:08.600\n Now, my own experience is that there is, in fact, just a giant amount of incompetence\n\n2:36:08.600 --> 2:36:19.080\n and that this is something that's actually very difficult to pull off because it's incredibly\n\n2:36:19.080 --> 2:36:21.280\n difficult to achieve this kind of manipulation.\n\n2:36:21.280 --> 2:36:29.280\n I think it would require, first of all, not much bureaucracy, not much slowing down.\n\n2:36:29.280 --> 2:36:33.500\n You have to have incredible, in the modern world, digital systems that are able to do\n\n2:36:33.500 --> 2:36:36.320\n surveillance, manipulation.\n\n2:36:36.320 --> 2:36:42.360\n There has to be a strategy that is carried out in secrecy across a huge number of people\n\n2:36:42.360 --> 2:36:48.240\n effectively that also requires you hire the best people in the world.\n\n2:36:48.240 --> 2:36:57.000\n And I think it's difficult to execute on this kind of thing if you compartmentalize because\n\n2:36:57.000 --> 2:36:59.400\n there has to be great collaboration.\n\n2:36:59.400 --> 2:37:07.560\n There has to be a great, where there's a unified vision and coordination across multiple groups.\n\n2:37:07.560 --> 2:37:11.240\n There has to be, I mean, it's very difficult to do.\n\n2:37:11.240 --> 2:37:15.880\n Now, nevertheless, especially with technology, this becomes easier and easier.\n\n2:37:15.880 --> 2:37:17.960\n So the bar goes lower and lower.\n\n2:37:17.960 --> 2:37:22.920\n To achieve mass surveillance becomes easier and easier and easier.\n\n2:37:22.920 --> 2:37:28.080\n Mass manipulation through platforms, because we're now digitally connected, you can now\n\n2:37:28.080 --> 2:37:29.260\n do that kind of manipulation.\n\n2:37:29.260 --> 2:37:32.040\n So it becomes more and more realistic that you could do this kind of thing.\n\n2:37:32.040 --> 2:37:39.640\n But you're saying that, no, intelligence, first of all, intelligence is hard.\n\n2:37:39.640 --> 2:37:47.520\n And to do it at scale and to do it well and to do it in a way that it's also not just\n\n2:37:47.520 --> 2:37:51.600\n collecting information about the populace, but manipulating the populace is very, very\n\n2:37:51.600 --> 2:37:52.600\n difficult.\n\n2:37:52.600 --> 2:37:57.440\n Now, let me give you another argument why I think that Besminov was a fraud.\n\n2:37:57.440 --> 2:38:05.720\n I mean, I already have, I have Matrokin on my side and my personal observation of the\n\n2:38:05.720 --> 2:38:08.640\n incompetence that I witnessed.\n\n2:38:08.640 --> 2:38:12.640\n I mean, they really, really didn't know what they didn't know.\n\n2:38:12.640 --> 2:38:17.240\n So now Besminov was KGB, where was he stationed?\n\n2:38:17.240 --> 2:38:19.760\n In India.\n\n2:38:19.760 --> 2:38:25.040\n He was a low level agent in India.\n\n2:38:25.040 --> 2:38:30.800\n And I told you it was the one thing that the KGB was really good at was compartmentalization.\n\n2:38:30.800 --> 2:38:36.520\n How does Besminov in India find out about this massive plan that should have been super\n\n2:38:36.520 --> 2:38:38.000\n secret, right?\n\n2:38:38.000 --> 2:38:40.920\n He made it up, sorry.\n\n2:38:40.920 --> 2:38:42.520\n And you know why he got away with it?\n\n2:38:42.520 --> 2:38:45.460\n Because Americans eat that up, because it's not our fault.\n\n2:38:45.460 --> 2:38:49.200\n It's the damn Russians that doing all that bad stuff.\n\n2:38:49.200 --> 2:38:54.060\n Speaking of the damn Russians doing all that bad stuff, you know about the Internet Research\n\n2:38:54.060 --> 2:38:55.920\n Agency.\n\n2:38:55.920 --> 2:39:04.880\n They have been doing quite a bit of damage and I'm now familiar with the world of enhanced\n\n2:39:04.880 --> 2:39:06.800\n artificial persons.\n\n2:39:06.800 --> 2:39:15.200\n These are the avatars on Facebook and Twitter and so forth that look like real people.\n\n2:39:15.200 --> 2:39:18.800\n And there are quite a few of them.\n\n2:39:18.800 --> 2:39:26.360\n And I have a good friend who operates in that realm and he uses, for instance, facial recognition\n\n2:39:26.360 --> 2:39:36.040\n when he thinks that there's a suspicious character, say, on LinkedIn or on Facebook.\n\n2:39:36.040 --> 2:39:42.440\n And very often he finds out, yeah, that that person exists, but it's not the person who\n\n2:39:42.440 --> 2:39:44.120\n it pretends to be.\n\n2:39:44.120 --> 2:39:48.280\n So basically detecting the artificial, the enhanced artificial person.\n\n2:39:48.280 --> 2:39:50.360\n But he can also make them.\n\n2:39:50.360 --> 2:39:53.760\n You think the United States doesn't do it?\n\n2:39:53.760 --> 2:39:54.760\n We do it too.\n\n2:39:54.760 --> 2:39:57.760\n Well, this is to push back against your pushback, right?\n\n2:39:57.760 --> 2:40:04.320\n Yeah, Bezmenov might be a fraud, but is it possible, especially in the modern age, that\n\n2:40:04.320 --> 2:40:08.440\n there is these kind of large scale systematic operatives?\n\n2:40:08.440 --> 2:40:22.360\n Wouldn't you, as a government that's investing billions of dollars into military equipment,\n\n2:40:22.360 --> 2:40:31.120\n in a world that's more and more clearly going to be defined by cyber war versus hot war,\n\n2:40:31.120 --> 2:40:37.840\n wouldn't you start to have serious meetings, large amounts of hires that are working at\n\n2:40:37.840 --> 2:40:44.040\n how do we manipulate the information flow, how do we manipulate the minds of the populace,\n\n2:40:44.040 --> 2:40:46.680\n how do we sell them a narrative?\n\n2:40:46.680 --> 2:40:52.240\n So even though he might have been making up a story because people eat it up, could it\n\n2:40:52.240 --> 2:40:59.120\n speak to some deep truth that's actually different than the truth you came up in as a KGB agent?\n\n2:40:59.120 --> 2:41:00.120\n I agree with you 100%.\n\n2:41:00.120 --> 2:41:08.680\n It's much easier when all you need is an army of nerds who also know.\n\n2:41:08.680 --> 2:41:09.940\n No offense to nerds.\n\n2:41:09.940 --> 2:41:11.600\n That's a term of endearment I use.\n\n2:41:11.600 --> 2:41:14.600\n Yes, I love nerds.\n\n2:41:14.600 --> 2:41:16.960\n I used to be one myself, but anyway.\n\n2:41:16.960 --> 2:41:21.020\n Once a nerd, always a nerd.\n\n2:41:21.020 --> 2:41:23.000\n So what I was going to say here is.\n\n2:41:23.000 --> 2:41:25.600\n All you need is an army of nerds.\n\n2:41:25.600 --> 2:41:32.240\n And what also experts in the culture of the target country.\n\n2:41:32.240 --> 2:41:33.240\n Okay.\n\n2:41:33.240 --> 2:41:35.400\n And nowadays the world is different.\n\n2:41:35.400 --> 2:41:37.040\n There's a whole lot more fluidity.\n\n2:41:37.040 --> 2:41:40.480\n There's a whole lot of more people that like say Russians, for instance, study in the United\n\n2:41:40.480 --> 2:41:46.560\n States, Chinese, an army of Chinese studying in the United States, they have a lot more\n\n2:41:46.560 --> 2:41:52.660\n knowledge of how we function than the KGB did and it's vice versa.\n\n2:41:52.660 --> 2:41:58.320\n Not as many Americans in Russia, but we have some, but the Chinese and the Russians have\n\n2:41:58.320 --> 2:41:59.320\n an advantage here.\n\n2:41:59.320 --> 2:42:02.700\n Can I ask you a question based on your experience?\n\n2:42:02.700 --> 2:42:13.440\n So I have been talking to a lot of powerful people and some of which have very close connections\n\n2:42:13.440 --> 2:42:19.480\n to in this particular conflict, Ukraine and Russia, but in other places as well.\n\n2:42:19.480 --> 2:42:24.960\n I don't believe I've ever been contacted by or interacted with an intelligence agency.\n\n2:42:24.960 --> 2:42:34.400\n CIA, FSB, MI6, Mossad, I don't think I had, well, let me say explicitly, I haven't had\n\n2:42:34.400 --> 2:42:38.580\n an official conversation, which is what I assume I would have because I have nothing\n\n2:42:38.580 --> 2:42:39.580\n to hide.\n\n2:42:39.580 --> 2:42:40.580\n Right?\n\n2:42:40.580 --> 2:42:43.820\n So I think there's no reason for people to be secretive.\n\n2:42:43.820 --> 2:42:52.000\n But would I, why is that, would I know, am I interesting at all, how are people determined\n\n2:42:52.000 --> 2:42:54.560\n if they're a person of interest or not?\n\n2:42:54.560 --> 2:43:00.200\n And I guess the question, I mean, some of it I ask in a bit of a humorous way, but also\n\n2:43:00.200 --> 2:43:02.960\n perhaps there's truth in some of the humors.\n\n2:43:02.960 --> 2:43:10.400\n Would I know if I have ever interacted with a intelligence agency spy?\n\n2:43:10.400 --> 2:43:20.000\n Well, you don't know that you haven't been contacted, but certainly not, I think you\n\n2:43:20.000 --> 2:43:24.640\n never had a conversation that related to intelligence in any way, shape, or form, right?\n\n2:43:24.640 --> 2:43:25.640\n Right.\n\n2:43:25.640 --> 2:43:27.520\n Like where a person, another person introduced themselves.\n\n2:43:27.520 --> 2:43:28.520\n Yeah.\n\n2:43:28.520 --> 2:43:34.620\n Introduced themselves or becomes, sort of wants to be your friend and then talks about\n\n2:43:34.620 --> 2:43:37.120\n these types of topics, right?\n\n2:43:37.120 --> 2:43:38.120\n Yeah.\n\n2:43:38.120 --> 2:43:48.840\n I, there's people because of who I'm interacting with, they're, I mean, even with just, even\n\n2:43:48.840 --> 2:43:57.080\n with Elon Musk, like if you think about Elon Musk, there's a lot of people that are, that\n\n2:43:57.080 --> 2:43:59.780\n are part of the conversations that happen.\n\n2:43:59.780 --> 2:44:01.600\n How do I know they're all trustworthy?\n\n2:44:01.600 --> 2:44:03.400\n They all present themselves as trustworthy.\n\n2:44:03.400 --> 2:44:07.560\n Now, again, I have nothing, so this is, this is for the intelligence agencies.\n\n2:44:07.560 --> 2:44:08.560\n I have nothing to hide.\n\n2:44:08.560 --> 2:44:16.560\n I am the same person privately as publicly, well intentioned, real, no, no controlled,\n\n2:44:16.560 --> 2:44:20.400\n no weird sexual stuff where you can manipulate me.\n\n2:44:20.400 --> 2:44:21.400\n What else?\n\n2:44:21.400 --> 2:44:22.400\n No drug use.\n\n2:44:22.400 --> 2:44:28.240\n No drug use, no, no skeletons in the closet, none of that kind of stuff.\n\n2:44:28.240 --> 2:44:33.560\n But you know, I don't, I don't know, I mean, just even having these conversations, you\n\n2:44:33.560 --> 2:44:36.440\n know, I tend to trust people as a default.\n\n2:44:36.440 --> 2:44:38.080\n Yeah, me too.\n\n2:44:38.080 --> 2:44:45.120\n And you start when you think, well, especially with some of the people I've been talking\n\n2:44:45.120 --> 2:44:52.080\n with and some of the traveling I'm doing, I'm realizing there's a, you know, there's\n\n2:44:52.080 --> 2:45:01.080\n hard men in this world, there's military, there's serious suffering and there's war\n\n2:45:01.080 --> 2:45:06.600\n and there's serious people that are doing serious harm and so you have to be careful\n\n2:45:06.600 --> 2:45:09.920\n of thinking who to trust.\n\n2:45:09.920 --> 2:45:14.720\n The person approaches you with a smile and asks you a question.\n\n2:45:14.720 --> 2:45:20.120\n My natural inclination is that person is a cool person, I'll answer the question, become\n\n2:45:20.120 --> 2:45:21.120\n a friend.\n\n2:45:21.120 --> 2:45:26.640\n But it becomes difficult when you realize that there's things like intelligence agencies\n\n2:45:26.640 --> 2:45:28.880\n with thousands of employees.\n\n2:45:28.880 --> 2:45:33.580\n There's people that are doing major military actions that involve tens of thousands, hundreds\n\n2:45:33.580 --> 2:45:35.460\n of thousands of soldiers.\n\n2:45:35.460 --> 2:45:39.920\n This is serious stuff and so how do I, how do you know how to operate in this world?\n\n2:45:39.920 --> 2:45:47.040\n The folks that you're interacting with have a responsibility not to tell you what they\n\n2:45:47.040 --> 2:45:49.000\n shouldn't tell you, right?\n\n2:45:49.000 --> 2:45:54.080\n So and most of them probably won't and I'm guessing occasionally they will say, well,\n\n2:45:54.080 --> 2:45:57.320\n I can't go there, right?\n\n2:45:57.320 --> 2:46:08.320\n So what you are aware of is sort of public and what you're doing is you're collecting\n\n2:46:08.320 --> 2:46:21.200\n it and you're editing it to some extent, you're not changing the verbage, you just repeat\n\n2:46:21.200 --> 2:46:27.560\n what they say, so from that angle you're not privy to any real secrets.\n\n2:46:27.560 --> 2:46:36.360\n What you have possibly that could be of use is you learn to get to know the person.\n\n2:46:36.360 --> 2:46:43.680\n So I'm thinking there's a good possibility if you get the interviews in the East that\n\n2:46:43.680 --> 2:46:47.520\n somebody may actually approach you and ask you what's your opinion.\n\n2:46:47.520 --> 2:46:51.320\n I just hope they approach me and introduce themselves properly.\n\n2:46:51.320 --> 2:46:59.000\n I just, there's a kind of, I mean, would you know, like how many Russian spies are there\n\n2:46:59.000 --> 2:47:00.040\n in the United States?\n\n2:47:00.040 --> 2:47:02.480\n How many American spies are there in Russia?\n\n2:47:02.480 --> 2:47:03.680\n Do you have a sense?\n\n2:47:03.680 --> 2:47:06.240\n Is it just like with the GRU?\n\n2:47:06.240 --> 2:47:07.960\n No idea.\n\n2:47:07.960 --> 2:47:13.560\n Is it possible there's like tens of thousands and we're not, or like thousands?\n\n2:47:13.560 --> 2:47:16.160\n Not thousands like I used to operate.\n\n2:47:16.160 --> 2:47:22.520\n We are too hard to train and we weren't that successful to begin with, but particularly\n\n2:47:22.520 --> 2:47:34.000\n Russians and Chinese, both governments know who is going abroad and I guarantee you there's\n\n2:47:34.000 --> 2:47:40.640\n a lot of amateur spies, they're being asked to help us out, do something for the motherland.\n\n2:47:40.640 --> 2:47:42.080\n And crowdsource spying.\n\n2:47:42.080 --> 2:47:43.720\n Yeah, sort of.\n\n2:47:43.720 --> 2:47:46.000\n Not serious training, but yeah.\n\n2:47:46.000 --> 2:47:52.840\n For instance, this lady, I forgot her first name, Butina, she was a rank amateur.\n\n2:47:52.840 --> 2:47:57.840\n She used social media to communicate with Moscow.\n\n2:47:57.840 --> 2:48:01.360\n She had no training, but she was reasonably successful.\n\n2:48:01.360 --> 2:48:11.720\n I mean, and the difference between, let's say, the current Russian intelligence and\n\n2:48:11.720 --> 2:48:22.080\n the KGB, Vladimir Putin and his henchmen are okay with people being caught because, and\n\n2:48:22.080 --> 2:48:28.400\n every time I go and talk and give a talk someplace, I'm always asked this question, how many Russian\n\n2:48:28.400 --> 2:48:31.260\n spies do you think we have here?\n\n2:48:31.260 --> 2:48:33.520\n Because that scares the people, right?\n\n2:48:33.520 --> 2:48:35.540\n And Putin likes to scare people.\n\n2:48:35.540 --> 2:48:40.960\n The KGB was very solicitous of their agents.\n\n2:48:40.960 --> 2:48:43.640\n They didn't want any one of them caught, all right?\n\n2:48:43.640 --> 2:48:47.280\n So that's a big difference.\n\n2:48:47.280 --> 2:48:52.160\n So for the FSB, getting caught sends a strong signal to the world that there's agents everywhere.\n\n2:48:52.160 --> 2:48:53.820\n Yeah, there could be many more.\n\n2:48:53.820 --> 2:49:03.560\n And there probably are, but because also the world, again, there's a whole lot more travel\n\n2:49:03.560 --> 2:49:09.200\n going on, a whole lot more interaction, studying abroad, doing business.\n\n2:49:09.200 --> 2:49:16.160\n And there will be attempted espionage probably every minute in this country.\n\n2:49:16.160 --> 2:49:20.560\n That doesn't mean they will be successful, no.\n\n2:49:20.560 --> 2:49:27.120\n But there is a cottage industry now that is doing quite well that teaches companies how\n\n2:49:27.120 --> 2:49:37.680\n to fortify themselves against industrial espionage or also foreign actors spying.\n\n2:49:37.680 --> 2:49:38.680\n It's all over the place.\n\n2:49:38.680 --> 2:49:39.680\n Yeah.\n\n2:49:39.680 --> 2:49:44.520\n As it becomes easier and easier with digital, with cyber, that becomes a serious, very serious\n\n2:49:44.520 --> 2:49:45.520\n threat.\n\n2:49:45.520 --> 2:49:51.100\n We might wind up in a world where nobody knows anymore what's up and what's down.\n\n2:49:51.100 --> 2:49:59.280\n If I was to have a conversation with Vladimir Putin and or Vladimir Zelensky, is there something\n\n2:49:59.280 --> 2:50:10.200\n you would ask about the time in the KGB and the time in his past?\n\n2:50:10.200 --> 2:50:16.760\n All of us, men and women, are creations of the experiences we have in our life, early\n\n2:50:16.760 --> 2:50:22.480\n on in life and through the formative experiences, successes and failures.\n\n2:50:22.480 --> 2:50:23.480\n So...\n\n2:50:23.480 --> 2:50:25.000\n Yeah, you just said the key words.\n\n2:50:25.000 --> 2:50:31.280\n I would ask, without giving away anything, just being high level, your biggest success\n\n2:50:31.280 --> 2:50:33.560\n and your biggest failure.\n\n2:50:33.560 --> 2:50:35.520\n As a politician or as a KGB agent?\n\n2:50:35.520 --> 2:50:40.220\n No, we're talking in the realm of KGB.\n\n2:50:40.220 --> 2:50:48.600\n When the wall came down, and he was in an office, a KGB office in the city of Dresden,\n\n2:50:48.600 --> 2:51:01.240\n and East Germans were besieging Stasi offices, and they also dropped by the KGB office, and\n\n2:51:01.240 --> 2:51:02.240\n they were...\n\n2:51:02.240 --> 2:51:03.600\n It was pretty threatening.\n\n2:51:03.600 --> 2:51:09.520\n It looked like they would actually storm the office and get, you know, the documents and\n\n2:51:09.520 --> 2:51:11.440\n stuff like that.\n\n2:51:11.440 --> 2:51:23.920\n And initially, the first demonstration was told that if they come any closer, weapons\n\n2:51:23.920 --> 2:51:24.920\n would be used.\n\n2:51:24.920 --> 2:51:31.040\n So, they disappeared, and then they came back, and I don't know, somebody in that office\n\n2:51:31.040 --> 2:51:35.280\n called Berlin and said, what are we gonna do?\n\n2:51:35.280 --> 2:51:37.440\n Are we allowed to use force?\n\n2:51:37.440 --> 2:51:41.440\n And the answer came back that Gorbachev said, absolutely not.\n\n2:51:41.440 --> 2:51:46.800\n And so, this is where Putin, all of a sudden, you know, he was at one point a member of\n\n2:51:46.800 --> 2:51:51.360\n the greatest, the most powerful intelligence organization in the world, and all of a sudden,\n\n2:51:51.360 --> 2:51:59.960\n he was powerless, and he had to watch how, you know, this was a defeat, big one.\n\n2:51:59.960 --> 2:52:09.400\n It's supposedly a powerful intelligence agency cowering, sort of crawling back into a position\n\n2:52:09.400 --> 2:52:10.400\n of weakness.\n\n2:52:10.400 --> 2:52:15.440\n And he probably promised himself, never again, Russia needs to be great again.\n\n2:52:15.440 --> 2:52:23.400\n The KGB, FSB, Russia, the Russian Empire needs to rise again, and that there's a feeling\n\n2:52:23.400 --> 2:52:28.320\n for him that that's, as he talks about the collapse of the Soviet Union being a great\n\n2:52:28.320 --> 2:52:38.080\n tragedy, there's a feeling like that was, like, never again.\n\n2:52:38.080 --> 2:52:49.200\n Yeah, and I believe that he has a strong conviction that, I don't know if he's religious, he\n\n2:52:49.200 --> 2:52:55.840\n carries the cross now, but I don't know what that means, but somehow, but that it's the\n\n2:52:55.840 --> 2:53:03.760\n destiny of the Russian nation to be great, and that is sort of, whether it's determined\n\n2:53:03.760 --> 2:53:08.480\n by God or some higher power, that is very important for him.\n\n2:53:08.480 --> 2:53:17.640\n Of course, that nationalist idea is one that Americans share as well, and it could help\n\n2:53:17.640 --> 2:53:22.600\n a nation flourish, so by itself, it's not necessarily a bad thing, it's how it manifests\n\n2:53:22.600 --> 2:53:25.240\n itself is the question.\n\n2:53:25.240 --> 2:53:36.840\n One other thing, if I were to get a chat with the Ukrainian president, I would ask him,\n\n2:53:36.840 --> 2:53:46.200\n how many lives, what is the equation between giving up some land and how many lives are\n\n2:53:46.200 --> 2:53:50.120\n worth this land?\n\n2:53:50.120 --> 2:53:54.080\n And that's a good way to phrase the question, of course, that question gets you killed in\n\n2:53:54.080 --> 2:54:01.200\n Ukraine, but because there's another part of that equation, which is it's not just land\n\n2:54:01.200 --> 2:54:10.660\n versus lives, it's the sovereignty, the knowledge that you're free and you're self determined,\n\n2:54:10.660 --> 2:54:21.080\n and it's not about fighting for the particular land, it's saying we are messed up, corrupt,\n\n2:54:21.080 --> 2:54:27.120\n we have problems, it's a messy world, but it's our world.\n\n2:54:27.120 --> 2:54:35.320\n I think Stephen Crane has a poem about a man eating his own heart, and he was asked how\n\n2:54:35.320 --> 2:54:39.680\n does it taste, and he said it's bitter, but I like it because it is bitter and because\n\n2:54:39.680 --> 2:54:46.000\n it is my heart, and that there's a sense of I want, this is not just about land, this\n\n2:54:46.000 --> 2:54:47.800\n is our nation.\n\n2:54:47.800 --> 2:54:53.760\n The same love of nation that Putin has for Russia, the greater Russia, this vision of\n\n2:54:53.760 --> 2:54:58.760\n this great empire, I believe Ukraine does as well.\n\n2:54:58.760 --> 2:55:04.400\n Not every nation, there's levels to this game, and Ukrainian people are some of the proudest\n\n2:55:04.400 --> 2:55:10.840\n people throughout the history of the 20th century, throughout the history of Earth.\n\n2:55:10.840 --> 2:55:12.160\n The Polish people are proud people.\n\n2:55:12.160 --> 2:55:20.840\n You can just see in World War II, the people who said fuck you, you're not having this,\n\n2:55:20.840 --> 2:55:23.240\n we will die to the last man.\n\n2:55:23.240 --> 2:55:28.160\n There's different cultures that kind of really hold their ground, and Ukrainian people are\n\n2:55:28.160 --> 2:55:29.160\n that.\n\n2:55:29.160 --> 2:55:33.160\n You know, I have to admit, in that respect, I'm a bit of a coward.\n\n2:55:33.160 --> 2:55:40.560\n I could not do what Zelensky has been doing.\n\n2:55:40.560 --> 2:55:53.840\n I would sort of try to find a way to carve out something that I can live with, however,\n\n2:55:53.840 --> 2:55:58.040\n if that force, that evil force gets to my family.\n\n2:55:58.040 --> 2:55:59.040\n Right.\n\n2:55:59.040 --> 2:56:00.040\n There's lines.\n\n2:56:00.040 --> 2:56:01.040\n Yes.\n\n2:56:01.040 --> 2:56:02.040\n That's right.\n\n2:56:02.040 --> 2:56:09.560\n You become the world's bravest man if somebody crosses that line.\n\n2:56:09.560 --> 2:56:16.840\n You mentioned something about you've not been to Moscow back, and that it might not be safe\n\n2:56:16.840 --> 2:56:18.840\n for you to travel there.\n\n2:56:18.840 --> 2:56:19.840\n Yes.\n\n2:56:19.840 --> 2:56:24.720\n Can you speak to the nature of that?\n\n2:56:24.720 --> 2:56:33.520\n As somebody that successfully got out of the KGB, how are you still alive?\n\n2:56:33.520 --> 2:56:36.100\n A number of reasons.\n\n2:56:36.100 --> 2:56:44.740\n First of all, when my story became public, it was six years ago, I was pretty old, right?\n\n2:56:44.740 --> 2:56:51.240\n And so the folks that may have a personal interest or may have had a personal interest\n\n2:56:51.240 --> 2:56:55.480\n in doing me harm, most of them don't live anymore, all right?\n\n2:56:55.480 --> 2:56:56.480\n That's number one.\n\n2:56:56.480 --> 2:57:02.520\n Number two, I did not, I wasn't, I hired hand, a German.\n\n2:57:02.520 --> 2:57:04.720\n I did not betray the motherland.\n\n2:57:04.720 --> 2:57:09.520\n That's a crime that is punished by death.\n\n2:57:09.520 --> 2:57:17.480\n You betray the motherland.\n\n2:57:17.480 --> 2:57:27.040\n And the other thing is, you know that these kinds of operations to assassination in another\n\n2:57:27.040 --> 2:57:33.160\n country are very difficult to plan and implement, and if there's a list of people that they\n\n2:57:33.160 --> 2:57:36.920\n don't like, I may not be at the very top.\n\n2:57:36.920 --> 2:57:41.900\n Having said that, you know, if I wind up, say, in Moscow or even in countries like Turkey\n\n2:57:41.900 --> 2:57:49.640\n where there's a lot of lawlessness, you know, accidents can easily be arranged, and that's\n\n2:57:49.640 --> 2:57:57.200\n just sending another message, you know, just like, you know, we can do a lot of things.\n\n2:57:57.200 --> 2:57:58.200\n Powerful.\n\n2:57:58.200 --> 2:57:59.200\n Yes.\n\n2:57:59.200 --> 2:58:02.960\n Do you think it's safe for me to travel in Russia and Ukraine?\n\n2:58:02.960 --> 2:58:11.160\n I think you know very well how to communicate in both countries.\n\n2:58:11.160 --> 2:58:18.200\n You know, you've shown this in this interaction that you have a lot of empathy for the people\n\n2:58:18.200 --> 2:58:22.920\n you'll be talking with, and empathy means good understanding where they're coming from,\n\n2:58:22.920 --> 2:58:25.840\n and that there are lines that you can't cross.\n\n2:58:25.840 --> 2:58:29.080\n Like the question that I was going to ask Zelensky, you're not going to ask.\n\n2:58:29.080 --> 2:58:30.080\n Good for you.\n\n2:58:30.080 --> 2:58:33.320\n Yeah, isn't that the funny thing about this world?\n\n2:58:33.320 --> 2:58:34.320\n There's lines.\n\n2:58:34.320 --> 2:58:35.320\n There's lines everywhere.\n\n2:58:35.320 --> 2:58:38.920\n Even in love, even in personal relationships, there's lines you should not cross.\n\n2:58:38.920 --> 2:58:39.920\n Yeah.\n\n2:58:39.920 --> 2:58:42.120\n How did you finally get caught?\n\n2:58:42.120 --> 2:58:45.040\n I resigned in 1988, so...\n\n2:58:45.040 --> 2:58:46.040\n Let's actually talk about that.\n\n2:58:46.040 --> 2:58:47.040\n There was a...\n\n2:58:47.040 --> 2:58:48.040\n Okay, yeah.\n\n2:58:48.040 --> 2:58:49.040\n Resigned.\n\n2:58:49.040 --> 2:58:50.040\n There's warning signs.\n\n2:58:50.040 --> 2:58:51.040\n Yeah, yeah, okay.\n\n2:58:51.040 --> 2:58:52.040\n There's yet another choice.\n\n2:58:52.040 --> 2:58:53.040\n Yet another crossroads.\n\n2:58:53.040 --> 2:58:54.040\n Yes, okay.\n\n2:58:54.040 --> 2:58:55.040\n What was the calculation?\n\n2:58:55.040 --> 2:58:57.600\n What was the choice to be made?\n\n2:58:57.600 --> 2:59:08.600\n To give a little background, it was 1988, and I thought they would...\n\n2:59:08.600 --> 2:59:15.960\n My time in the US would soon end because I thought 10 to 12 years, it was already past\n\n2:59:15.960 --> 2:59:16.960\n 10 years.\n\n2:59:16.960 --> 2:59:23.620\n There was no indication that they indicated, that they said, you're done.\n\n2:59:23.620 --> 2:59:30.040\n But in December of 1988, I got this one thing that I never wanted to see.\n\n2:59:30.040 --> 2:59:39.440\n So we had a system of signals that either one of those diplomat agents could set at\n\n2:59:39.440 --> 2:59:47.140\n a spot that I pass by every day, or I could set where they would pass by, like on their\n\n2:59:47.140 --> 2:59:52.240\n way from where they live to the United Nations, for instance, who would just drive.\n\n2:59:52.240 --> 3:00:03.400\n So the signal spot for me was on a support beam for the elevated atrium in Queens.\n\n3:00:03.400 --> 3:00:10.480\n And it was morning in December that I walked by there and routinely look at it, and I never\n\n3:00:10.480 --> 3:00:11.480\n expected anything.\n\n3:00:11.480 --> 3:00:17.640\n And there was this red dot, it was about the size of my fist with a red paint.\n\n3:00:17.640 --> 3:00:24.360\n And since you have done it already, I think I can curse in this moment, because it's the\n\n3:00:24.360 --> 3:00:30.880\n only way I can really indicate how I felt, I said, oh shit, because that was the danger\n\n3:00:30.880 --> 3:00:31.880\n signal.\n\n3:00:31.880 --> 3:00:37.800\n It was like, you are in severe danger, and you need to get out of the country as soon\n\n3:00:37.800 --> 3:00:38.800\n as possible.\n\n3:00:38.800 --> 3:00:44.320\n There was a protocol that I was supposed to follow, I wasn't even supposed to go home,\n\n3:00:44.320 --> 3:00:53.160\n I just needed to, was supposed to get my reserve documents that I had hidden in a park in the\n\n3:00:53.160 --> 3:00:57.960\n Bronx and make a beeline to the Canadian border.\n\n3:00:57.960 --> 3:00:59.480\n I wasn't ready.\n\n3:00:59.480 --> 3:01:05.600\n So I just ignored this thing, I mean, I couldn't ignore it, but I went on to work, got on the\n\n3:01:05.600 --> 3:01:11.240\n A train, went to work, and then went to my cubicle and stared at the computer screen\n\n3:01:11.240 --> 3:01:12.720\n all day because I couldn't think.\n\n3:01:12.720 --> 3:01:15.780\n I could think only about what to do, what to do, what to do.\n\n3:01:15.780 --> 3:01:24.480\n The reason for this indecisiveness was that I was a father at the time.\n\n3:01:24.480 --> 3:01:32.320\n My little girl by the name of Chelsea was 18 months old, and I was there when she was\n\n3:01:32.320 --> 3:01:45.200\n born, I took her to her home, I watched her grow up, I watched her take the first steps,\n\n3:01:45.200 --> 3:01:52.000\n and always look at me with these big eyes, lovingly look at me, and that is when I started\n\n3:01:52.000 --> 3:02:01.400\n my reentry into the human race, because I just fell in love with this girl.\n\n3:02:01.400 --> 3:02:08.720\n That's when love came back, and it was completely unexpected, and there's a lot of fathers who\n\n3:02:08.720 --> 3:02:15.840\n understand, particularly fathers of girls who understand what happened there.\n\n3:02:15.840 --> 3:02:23.300\n I still thought I need to go back because there was probably some danger, but I hadn't\n\n3:02:23.300 --> 3:02:29.840\n figured out how to take care of the girl, leave her, but maybe she needs to have a good\n\n3:02:29.840 --> 3:02:35.760\n life and grow up and have a chance, and her mother, she was from South America, she had\n\n3:02:35.760 --> 3:02:38.320\n a fourth grade education.\n\n3:02:38.320 --> 3:02:41.360\n That would have not worked very well.\n\n3:02:41.360 --> 3:02:45.880\n So I played for time.\n\n3:02:45.880 --> 3:02:51.400\n Obviously I could be sick, I could be in a hospital, there was a precedent where I was\n\n3:02:51.400 --> 3:03:00.200\n sick where I couldn't communicate for about three weeks, so I just did nothing.\n\n3:03:00.200 --> 3:03:07.000\n That was on a Monday, on a Thursday was my regular shortwave transmission, I listened,\n\n3:03:07.000 --> 3:03:11.880\n and they explained a little in a few sentences.\n\n3:03:11.880 --> 3:03:15.160\n We have reason to believe that the FBI is on your case.\n\n3:03:15.160 --> 3:03:22.760\n You need to execute the emergency procedure, come home right away.\n\n3:03:22.760 --> 3:03:28.560\n I still had some time because the radio could be broken or the transmission was bad, or\n\n3:03:28.560 --> 3:03:30.120\n I still could be in a hospital, right?\n\n3:03:30.120 --> 3:03:42.960\n So I gave myself some more time, and then something happened where they forced my hand.\n\n3:03:42.960 --> 3:03:48.160\n And this is the only time that a Soviet agent was anywhere near me on the territory of the\n\n3:03:48.160 --> 3:03:50.000\n United States.\n\n3:03:50.000 --> 3:04:02.120\n So I'm waiting for the A train on a dark morning still in Queens, and there's this man, the\n\n3:04:02.120 --> 3:04:08.120\n short man in a black trench coat comes up to me from my right, and he whispers into\n\n3:04:08.120 --> 3:04:13.120\n my ears, you got to come back or else you're dead.\n\n3:04:13.120 --> 3:04:18.080\n I can't imitate the Russian accent, it was a Russian accent.\n\n3:04:18.080 --> 3:04:20.760\n And it was a pretty strong accent.\n\n3:04:20.760 --> 3:04:28.880\n The you're dead phrase can have two meanings, and an American would have said, or else you're\n\n3:04:28.880 --> 3:04:34.320\n busted or else you get arrested or else you're dead is very strong.\n\n3:04:34.320 --> 3:04:42.640\n So now you have to take it seriously to some degree because I knew that they had a history\n\n3:04:42.640 --> 3:04:46.360\n of assassinating or at least trying to assassinate defectors.\n\n3:04:46.360 --> 3:04:51.920\n So that obviously raised the stakes a little bit.\n\n3:04:51.920 --> 3:04:59.360\n But I just talked myself into believing this was just a bad phrasing.\n\n3:04:59.360 --> 3:05:03.920\n But at this point, I knew and they knew that we both knew, right?\n\n3:05:03.920 --> 3:05:05.080\n So there was no more guessing.\n\n3:05:05.080 --> 3:05:07.980\n He found me, he talked to me, I know.\n\n3:05:07.980 --> 3:05:09.140\n So now I had to act.\n\n3:05:09.140 --> 3:05:18.460\n So in the next radiogram, I was asked to execute a dead drop operation where they would give\n\n3:05:18.460 --> 3:05:23.360\n me money and a passport.\n\n3:05:23.360 --> 3:05:32.380\n And that was in a park on Staten Island, it was a location that I found and I described.\n\n3:05:32.380 --> 3:05:41.640\n And I was always praised for my ability to describe spots that are easy to find.\n\n3:05:41.640 --> 3:05:44.560\n So that was a given.\n\n3:05:44.560 --> 3:05:49.600\n And the only thing that was different for this operation, they scheduled it for the\n\n3:05:49.600 --> 3:05:50.600\n dark.\n\n3:05:50.600 --> 3:05:51.880\n All right.\n\n3:05:51.880 --> 3:05:58.800\n But it was still no problem because it was in a park and a couple of, about a hundred\n\n3:05:58.800 --> 3:06:06.060\n yards in by next to a fallen tree would be hard to miss.\n\n3:06:06.060 --> 3:06:15.360\n So I go to Staten Island and I read the signal that said, I put the container in the drop.\n\n3:06:15.360 --> 3:06:16.360\n That was the protocol.\n\n3:06:16.360 --> 3:06:25.600\n There's a signal that the person who hands over something puts at a spot not too far\n\n3:06:25.600 --> 3:06:27.460\n from the spot itself.\n\n3:06:27.460 --> 3:06:30.040\n That means I would go in and just pick it up.\n\n3:06:30.040 --> 3:06:38.960\n The reason I actually went to pick up this container, because there was money in it.\n\n3:06:38.960 --> 3:06:41.480\n So I didn't have to make a decision yet.\n\n3:06:41.480 --> 3:06:42.480\n Okay.\n\n3:06:42.480 --> 3:06:44.260\n I could throw away the passport.\n\n3:06:44.260 --> 3:06:48.240\n It was like I was still trying to figure out what to do, what to do, what to do.\n\n3:06:48.240 --> 3:06:53.800\n So I get to the spot, I get to the tree and I had a flashlight with me that the park,\n\n3:06:53.800 --> 3:06:56.460\n there was no way in the park.\n\n3:06:56.460 --> 3:07:02.360\n Even during the day though, this park was not, it was more, almost like a little forest.\n\n3:07:02.360 --> 3:07:05.920\n And I don't see the container.\n\n3:07:05.920 --> 3:07:13.880\n It wasn't supposed to be a crushed oil can, pretty sizable, hard to miss.\n\n3:07:13.880 --> 3:07:18.560\n And I do a double take and I look again and I look around and look around a little more,\n\n3:07:18.560 --> 3:07:22.200\n see if they misplaced it, can't find it.\n\n3:07:22.200 --> 3:07:29.000\n That's the only one that one of those operations failed.\n\n3:07:29.000 --> 3:07:33.740\n And that just doesn't make a lot of sense.\n\n3:07:33.740 --> 3:07:41.880\n So when, as I'm walking away from this, like sort of numb emotionally, I said to myself,\n\n3:07:41.880 --> 3:07:42.880\n I'm staying.\n\n3:07:42.880 --> 3:07:43.880\n Yeah.\n\n3:07:43.880 --> 3:07:44.880\n That decision.\n\n3:07:44.880 --> 3:07:50.360\n That kind of signal, some kind of a muse just spoke to you.\n\n3:07:50.360 --> 3:07:53.880\n That decision was made for me.\n\n3:07:53.880 --> 3:07:58.920\n Now, you know that I'm a Christian now and I think that was like, God told me this, you\n\n3:07:58.920 --> 3:07:59.920\n know.\n\n3:07:59.920 --> 3:08:01.920\n But it was certain there.\n\n3:08:01.920 --> 3:08:02.920\n It was right there.\n\n3:08:02.920 --> 3:08:03.920\n That was it.\n\n3:08:03.920 --> 3:08:04.920\n That was it.\n\n3:08:04.920 --> 3:08:05.920\n That was it.\n\n3:08:05.920 --> 3:08:15.400\n And so what I did to, well, first of all, divine intervention helped me to find a good\n\n3:08:15.400 --> 3:08:16.960\n explanation.\n\n3:08:16.960 --> 3:08:25.720\n I sent them my last letter with secret writing, I communicated to them, I said, I wish I could\n\n3:08:25.720 --> 3:08:31.880\n come but I can't because I have contracted HIV AIDS.\n\n3:08:31.880 --> 3:08:37.540\n That was the best lie ever because nobody wanted to have AIDS in their country.\n\n3:08:37.540 --> 3:08:39.840\n Those days it was a death sentence, right?\n\n3:08:39.840 --> 3:08:46.140\n And I knew, we had conversations when I was back in Moscow, how they were snickering about\n\n3:08:46.140 --> 3:08:51.600\n what's going on in the United States, that depraved culture and you see, they're killing\n\n3:08:51.600 --> 3:08:52.600\n each other.\n\n3:08:52.600 --> 3:08:57.680\n And the depraved culture took over your being and how you're sitting.\n\n3:08:57.680 --> 3:09:04.240\n And I was convincing enough, I even traced it back to a girlfriend I had once that I\n\n3:09:04.240 --> 3:09:11.760\n actually reported on that she, I interacted with this lady who had a boyfriend at one\n\n3:09:11.760 --> 3:09:16.920\n point who was a drug addict and she was infected and she infected me.\n\n3:09:16.920 --> 3:09:24.440\n So they believed it, they sent and I asked them to give my dollar savings to my German\n\n3:09:24.440 --> 3:09:26.000\n family.\n\n3:09:26.000 --> 3:09:33.380\n They gave them some but they told my family that I already passed away, that I'm dead.\n\n3:09:33.380 --> 3:09:35.420\n They believed it, 100%.\n\n3:09:35.420 --> 3:09:42.120\n And I guess the agent who took the money took half of it for himself.\n\n3:09:42.120 --> 3:09:43.120\n So that was it.\n\n3:09:43.120 --> 3:09:52.360\n And the next three months I made sure that I wasn't reliably at the same spot and the\n\n3:09:52.360 --> 3:09:53.980\n same timeframe.\n\n3:09:53.980 --> 3:10:01.520\n So I went to work in different paths at different times just to, you know, just as a safety\n\n3:10:01.520 --> 3:10:14.360\n measure so to speak and not huge but, you know, it kept me, allowed me to keep my sanity.\n\n3:10:14.360 --> 3:10:21.160\n And obviously after I sent the letter I threw the shortwave radio in the Hudson River, destroyed\n\n3:10:21.160 --> 3:10:23.280\n the one time paths that I still had.\n\n3:10:23.280 --> 3:10:36.000\n So I was now ready to for a new life and live out my life as an American undiscovered but,\n\n3:10:36.000 --> 3:10:42.600\n you know, starting to work on my version of the American dream.\n\n3:10:42.600 --> 3:10:51.060\n And the first action was, I was telling my wife, the mother of this child, you know,\n\n3:10:51.060 --> 3:10:58.440\n she always wanted to have a house and said, you know what, we should buy a house.\n\n3:10:58.440 --> 3:11:02.720\n And a year later we moved into the suburbs and then I said, we should have another child\n\n3:11:02.720 --> 3:11:04.600\n and we had another child.\n\n3:11:04.600 --> 3:11:09.360\n So and I had a career where I did pretty well.\n\n3:11:09.360 --> 3:11:14.320\n I moved a couple of times, wound up in a McMansion.\n\n3:11:14.320 --> 3:11:19.480\n But before that my second house was actually in Pennsylvania, in rural Pennsylvania.\n\n3:11:19.480 --> 3:11:25.960\n And this is where I was discovered by the FBI.\n\n3:11:25.960 --> 3:11:28.880\n And how did they know about me?\n\n3:11:28.880 --> 3:11:36.240\n If it hadn't been for this defector, Vasily Mitrokhin, who was an archivist in the KGB\n\n3:11:36.240 --> 3:11:38.960\n archives, he was actually pretty high level.\n\n3:11:38.960 --> 3:11:48.200\n He was in charge of the relocation of the archive from Lubyanka to Yasenov.\n\n3:11:48.200 --> 3:11:56.080\n And he really hated, he had reason to believe he hated the Soviet system.\n\n3:11:56.080 --> 3:12:01.180\n I think I remember that his son was quite ill and he could have gotten treatment in\n\n3:12:01.180 --> 3:12:05.680\n England and he was not allowed to travel to England with his son.\n\n3:12:05.680 --> 3:12:12.480\n So his hatred, he tried to figure out what to do and how to do damage to that system.\n\n3:12:12.480 --> 3:12:19.980\n So he started copying notes, little slips of paper, handwritten that he smuggled out\n\n3:12:19.980 --> 3:12:23.960\n in his underwear and his socks over the years.\n\n3:12:23.960 --> 3:12:32.480\n And then he transcribed them with a typewriter and then put the pieces of paper into some\n\n3:12:32.480 --> 3:12:37.480\n kind of a container and buried this in his stash.\n\n3:12:37.480 --> 3:12:45.760\n It was, I believe in 1992 when he showed up, that was already the Soviet Union was gone.\n\n3:12:45.760 --> 3:12:51.600\n So he showed up at the US embassy in Moscow and told him what he had and it was on a weekend\n\n3:12:51.600 --> 3:12:55.480\n and apparently there was a junior person in charge and he said, you know what, what you\n\n3:12:55.480 --> 3:13:00.440\n got, we are not interested and it's really old.\n\n3:13:00.440 --> 3:13:07.880\n It's a career limiting move, right, because Vasily Mitrokhin then made his way to one\n\n3:13:07.880 --> 3:13:17.280\n of the Baltic republics and contacted MI6 and they said, come on in, old fellow, have\n\n3:13:17.280 --> 3:13:19.920\n a cup of tea.\n\n3:13:19.920 --> 3:13:25.680\n And so they managed to get this stuff out of the Dacha and get it to England and eventually\n\n3:13:25.680 --> 3:13:32.920\n MI6 shared it with the FBI and there wasn't a whole lot of information about me, it was\n\n3:13:32.920 --> 3:13:33.920\n very, very little.\n\n3:13:33.920 --> 3:13:40.400\n It was like, there's a person by the name of Jack Barsky who is an illegal operating\n\n3:13:40.400 --> 3:13:42.280\n in the northeast of the United States.\n\n3:13:42.280 --> 3:13:47.780\n Now if it was Jim Miller, they wouldn't have found me, Jack Barsky was easy to find.\n\n3:13:47.780 --> 3:13:55.700\n So they checked social security and Jack Barsky had gotten his social security card at the\n\n3:13:55.700 --> 3:14:00.520\n age of 33, bingo, okay.\n\n3:14:00.520 --> 3:14:04.320\n All they knew though was that I wasn't illegal, that I was still living there, they didn't\n\n3:14:04.320 --> 3:14:10.640\n know whether I was active, inactive and the other thing that they knew that I was a really,\n\n3:14:10.640 --> 3:14:15.160\n really well trained agent because I was still there, right.\n\n3:14:15.160 --> 3:14:22.660\n So they took, I think, almost three years to investigate me, watch me from a distance\n\n3:14:22.660 --> 3:14:30.000\n because if I was still active, I would have found out that somebody is investigating me.\n\n3:14:30.000 --> 3:14:33.000\n So you started being less and less active in terms of...\n\n3:14:33.000 --> 3:14:34.900\n Oh, I stopped completely.\n\n3:14:34.900 --> 3:14:35.900\n What I mean is...\n\n3:14:35.900 --> 3:14:36.900\n Oh, surveillance detection.\n\n3:14:36.900 --> 3:14:37.900\n Yes, surveillance detection.\n\n3:14:37.900 --> 3:14:40.000\n After three months, I stopped altogether.\n\n3:14:40.000 --> 3:14:41.000\n Okay.\n\n3:14:41.000 --> 3:14:42.000\n Yeah, good point.\n\n3:14:42.000 --> 3:14:44.000\n And FBI is still very careful.\n\n3:14:44.000 --> 3:14:45.400\n They were very careful.\n\n3:14:45.400 --> 3:14:51.440\n They pretty much watched me and at one point, I had a house in the country with one neighbor,\n\n3:14:51.440 --> 3:14:57.200\n at one point that house was for sale, so the FBI bought it and they put a couple of agents\n\n3:14:57.200 --> 3:15:01.200\n there and just didn't keep a closer eye on me.\n\n3:15:01.200 --> 3:15:12.360\n There was no indication that I was still active, but they were still cautious but at one point,\n\n3:15:12.360 --> 3:15:23.160\n they were able to plant a bug in my kitchen, a listening device and my wife and I didn't\n\n3:15:23.160 --> 3:15:24.160\n get along very well.\n\n3:15:24.160 --> 3:15:29.600\n There was a lot of friction and she was constantly complaining about things and I got sick and\n\n3:15:29.600 --> 3:15:39.200\n tired of it and one day we had an argument in the kitchen and I chose to deploy the nuclear\n\n3:15:39.200 --> 3:15:48.960\n option and that is telling her what I sacrificed to be with her so she would understand that\n\n3:15:48.960 --> 3:15:51.320\n I am there on her side.\n\n3:15:51.320 --> 3:15:52.320\n I'm supporting her.\n\n3:15:52.320 --> 3:15:57.860\n If something doesn't quite fit, it is not because I don't love the both of them, Chelsea\n\n3:15:57.860 --> 3:15:59.400\n and Penelope.\n\n3:15:59.400 --> 3:16:08.240\n So when I said that, the listening device was active, so the FBI was hearing my confession.\n\n3:16:08.240 --> 3:16:17.200\n I was once a KGB agent, blah, blah, blah, blah, blah and I quit and then stayed here\n\n3:16:17.200 --> 3:16:25.560\n because of you and Chelsea and that also made it clear to the FBI that I wasn't active\n\n3:16:25.560 --> 3:16:26.560\n anymore.\n\n3:16:26.560 --> 3:16:27.560\n They had both of that.\n\n3:16:27.560 --> 3:16:36.760\n So now they knew an attempt to turn me would have been useless because you turned somebody\n\n3:16:36.760 --> 3:16:46.280\n who was active, but they figured there was enough reason to treat me nicely because they\n\n3:16:46.280 --> 3:16:53.560\n figured I had a lot of information that was as aged as it was, but it was still important\n\n3:16:53.560 --> 3:16:56.240\n for the FBI to get to know.\n\n3:16:56.240 --> 3:17:06.960\n And so one day, it was a Friday evening, I'm driving back home from the office and I'm\n\n3:17:06.960 --> 3:17:16.360\n being stopped by a state police.\n\n3:17:16.360 --> 3:17:22.520\n As I'm going through the toll, it's a bridge over the Hudson and they had to pay a toll\n\n3:17:22.520 --> 3:17:29.280\n and he waved me, he got me right where I stopped and he said, could you please move over here?\n\n3:17:29.280 --> 3:17:32.280\n It's a routine traffic stop and I thought nothing of it.\n\n3:17:32.280 --> 3:17:39.680\n I had forgotten at that point that I once was a spy, it was gone.\n\n3:17:39.680 --> 3:17:42.600\n And then he said, could you please step out of the car?\n\n3:17:42.600 --> 3:17:45.200\n That should have aroused my suspicion.\n\n3:17:45.200 --> 3:17:46.360\n That's unusual, right?\n\n3:17:46.360 --> 3:17:47.760\n Routine traffic stop.\n\n3:17:47.760 --> 3:17:49.760\n Yeah, I did it, no problem.\n\n3:17:49.760 --> 3:17:57.760\n And then again, somebody came from the right, came into my view and he flipped his ID and\n\n3:17:57.760 --> 3:18:02.440\n he said, FBI, we would like to have a talk with you.\n\n3:18:02.440 --> 3:18:10.080\n This is my now friend, Joe Riley, who actually is the, he's the godfather of Trinity and\n\n3:18:10.080 --> 3:18:11.080\n my last child.\n\n3:18:11.080 --> 3:18:20.320\n Anyway, he told me later that when I heard that phrase, all the blood left my face, I\n\n3:18:20.320 --> 3:18:24.340\n became totally white.\n\n3:18:24.340 --> 3:18:32.600\n But I recovered very quickly and he said it himself, so they took me to a vehicle and\n\n3:18:32.600 --> 3:18:39.440\n there was another agent in the vehicle and he had a gun strapped to his ankle, so it\n\n3:18:39.440 --> 3:18:42.280\n was pretty real.\n\n3:18:42.280 --> 3:18:44.640\n First question I had, so am I under arrest?\n\n3:18:44.640 --> 3:18:47.600\n And the answer was no.\n\n3:18:47.600 --> 3:18:57.200\n And then my instinct kicked in and my ability to operate very well under high pressure situations.\n\n3:18:57.200 --> 3:19:01.520\n And I asked him, so what took you so long?\n\n3:19:01.520 --> 3:19:12.360\n You know, the intent of that was to defuse any kind of tension.\n\n3:19:12.360 --> 3:19:15.360\n And I saw a smile.\n\n3:19:15.360 --> 3:19:16.360\n Instant friends.\n\n3:19:16.360 --> 3:19:26.520\n Yeah, I knew that I had to make them like me and I'm, I think by now I know I'm a pretty\n\n3:19:26.520 --> 3:19:31.280\n likable person.\n\n3:19:31.280 --> 3:19:40.520\n And I, when they took me to a motel, which they had rented, there was two wings at a\n\n3:19:40.520 --> 3:19:47.760\n right angle, they bought all the rooms in one wing and they had a guard at each end\n\n3:19:47.760 --> 3:19:55.560\n of that wing and they took me in the middle and there were some props there, some binders\n\n3:19:55.560 --> 3:20:03.680\n with labels and I immediately thought, this is pretty silly because what I noticed that\n\n3:20:03.680 --> 3:20:07.440\n the labels all referred back to my early years.\n\n3:20:07.440 --> 3:20:10.880\n I knew that they didn't know much else.\n\n3:20:10.880 --> 3:20:19.520\n So I told Joe that afterwards and that was not a great idea, but anyway.\n\n3:20:19.520 --> 3:20:20.520\n But I volunteered.\n\n3:20:20.520 --> 3:20:24.200\n I made the following statement before we even started the interview.\n\n3:20:24.200 --> 3:20:30.160\n I said, I know there's only one way for me to, and my family, to have a chance to get\n\n3:20:30.160 --> 3:20:38.680\n through here without much damages if I'm completely 100% cooperative and it's my intent to do\n\n3:20:38.680 --> 3:20:39.920\n exactly that.\n\n3:20:39.920 --> 3:20:40.920\n All right.\n\n3:20:40.920 --> 3:20:43.680\n So we spent about two hours in the interview.\n\n3:20:43.680 --> 3:20:48.340\n They allowed me to call my wife, tell her that I'm going to be late.\n\n3:20:48.340 --> 3:20:51.240\n That indicated to me already that they would let me go.\n\n3:20:51.240 --> 3:20:55.000\n And after two hours they let me go.\n\n3:20:55.000 --> 3:21:00.000\n But they had the area covered with a whole bunch of people.\n\n3:21:00.000 --> 3:21:07.520\n And the head of that team talked to me and he said, if you think of running, we got every\n\n3:21:07.520 --> 3:21:09.560\n intersection in this area covered.\n\n3:21:09.560 --> 3:21:10.560\n You can't.\n\n3:21:10.560 --> 3:21:16.620\n I didn't say anything, but you know, I had no thought of running.\n\n3:21:16.620 --> 3:21:24.040\n So and that was the beginning of another phase of my life where I was cooperating with the\n\n3:21:24.040 --> 3:21:30.240\n FBI for quite a while and living still undercover for several years until I had real good documentation\n\n3:21:30.240 --> 3:21:33.840\n and became an American citizen seven years ago.\n\n3:21:33.840 --> 3:21:36.480\n From today, seven years ago.\n\n3:21:36.480 --> 3:21:37.480\n So recently.\n\n3:21:37.480 --> 3:21:38.480\n Yeah.\n\n3:21:38.480 --> 3:21:39.480\n Wow.\n\n3:21:39.480 --> 3:21:40.480\n Quite recent.\n\n3:21:40.480 --> 3:21:49.440\n The hypocrisy took a long time to figure out how to make me real and also not put me in\n\n3:21:49.440 --> 3:21:55.080\n these witness protection program, you know, to keep my name and then just, you know, make\n\n3:21:55.080 --> 3:21:57.320\n everything like official.\n\n3:21:57.320 --> 3:22:03.880\n So for instance, I had to change my birth year simply because if I, Jack Barsky was\n\n3:22:03.880 --> 3:22:09.900\n born in 1944, if I kept 1944, the FBI would have helped me commit a crime because I would\n\n3:22:09.900 --> 3:22:15.820\n have collected social security four years sooner.\n\n3:22:15.820 --> 3:22:20.120\n So anyway, yes, it took quite a while.\n\n3:22:20.120 --> 3:22:29.120\n And when I finally got the call from the office of Homeland Security, the lady says, this\n\n3:22:29.120 --> 3:22:37.240\n is agent so and so from Homeland Security, can you come into the office tomorrow?\n\n3:22:37.240 --> 3:22:42.040\n And I said, let me look at my calendar.\n\n3:22:42.040 --> 3:22:45.000\n And then I said, wait a minute, what am I talking about?\n\n3:22:45.000 --> 3:22:47.100\n What time do you want me to be there?\n\n3:22:47.100 --> 3:22:49.360\n Because I had waited for that moment for a long time.\n\n3:22:49.360 --> 3:22:52.760\n And I was sworn in right then and there.\n\n3:22:52.760 --> 3:22:58.400\n It was a good feeling to walk out of there because I had a country again, you know, and\n\n3:22:58.400 --> 3:23:03.520\n I love this country just as much as you said you love it with all its warts and its problems\n\n3:23:03.520 --> 3:23:06.880\n that we're going through right now.\n\n3:23:06.880 --> 3:23:12.780\n And then the last thing that changed my life again, and I don't want to get into details\n\n3:23:12.780 --> 3:23:18.900\n because it's a little complicated story, I never wanted to be a public person.\n\n3:23:18.900 --> 3:23:26.200\n And then I was discovered through a number of dots that were unlikely to be connected.\n\n3:23:26.200 --> 3:23:33.440\n It had to do with a relative, with a half brother of my wife who lives in Germany, was\n\n3:23:33.440 --> 3:23:41.200\n taken to Germany by his mother who came to visit somebody, not us, but that somebody\n\n3:23:41.200 --> 3:23:49.240\n that he came to visit lived 50 miles from our house and that my wife and this half brother\n\n3:23:49.240 --> 3:23:52.000\n never met in person before.\n\n3:23:52.000 --> 3:23:54.960\n They knew about each other through social media.\n\n3:23:54.960 --> 3:24:01.120\n And when he found out my background, he was a conductor of the German railroad at the\n\n3:24:01.120 --> 3:24:07.960\n time, he said, oh, this is a big story and that's going to be big, big, big, okay.\n\n3:24:07.960 --> 3:24:14.080\n Well he happened to know this one person who happened to know one of the star reporters\n\n3:24:14.080 --> 3:24:23.000\n of Der Spiegel and after she did some research and determined that I was real, she was on\n\n3:24:23.000 --> 3:24:24.000\n my case.\n\n3:24:24.000 --> 3:24:29.720\n And she happened to know Steve Croft, the guy from 60 Minutes, you see all these connections?\n\n3:24:29.720 --> 3:24:30.800\n I had nothing to do with it.\n\n3:24:30.800 --> 3:24:35.400\n That's how life works, dots get connected somehow, sometimes, for most of us it doesn't.\n\n3:24:35.400 --> 3:24:36.400\n Stuff happens.\n\n3:24:36.400 --> 3:24:37.400\n You get lucky.\n\n3:24:37.400 --> 3:24:38.400\n You don't know what's happening.\n\n3:24:38.400 --> 3:24:40.560\n You've gotten lucky a few times in your life.\n\n3:24:40.560 --> 3:24:44.640\n Yeah, I think I must be part Irish too.\n\n3:24:44.640 --> 3:24:53.080\n Yeah, so it's been an interesting ride.\n\n3:24:53.080 --> 3:24:57.360\n I'm just still shaking my head about all the stuff that happened.\n\n3:24:57.360 --> 3:24:58.760\n It's been a fun one.\n\n3:24:58.760 --> 3:25:06.800\n But you wrote, because I'm allowed to leave behind a documented legacy of my unusual life,\n\n3:25:06.800 --> 3:25:12.800\n I'm praying that the legacy will be described by a single word, love.\n\n3:25:12.800 --> 3:25:17.520\n So let us return to the thing we started the conversation with, which is love.\n\n3:25:17.520 --> 3:25:24.920\n What role does love play in this human condition, in your life and in our life here together?\n\n3:25:24.920 --> 3:25:31.600\n I give you an answer by telling you what happened one day.\n\n3:25:31.600 --> 3:25:37.640\n I gave a presentation at Microsoft headquarters.\n\n3:25:37.640 --> 3:25:40.240\n That's a strange beginning of a love story, but yes.\n\n3:25:40.240 --> 3:25:41.680\n No, that's not a love story.\n\n3:25:41.680 --> 3:25:49.000\n And so there's this beautiful young lady sitting in the back, and she's paying a lot of attention.\n\n3:25:49.000 --> 3:25:56.400\n Turned out later that her job at Microsoft, her job title was storyteller.\n\n3:25:56.400 --> 3:25:58.560\n It's soft marketing, right?\n\n3:25:58.560 --> 3:26:01.800\n Yeah, you could say that.\n\n3:26:01.800 --> 3:26:06.800\n But if you can't afford somebody like that, that's good.\n\n3:26:06.800 --> 3:26:15.840\n Anyway, question and answer, she raised her hand and she asked me, so all the things that\n\n3:26:15.840 --> 3:26:21.560\n you have done and you have experienced, what's the number one lesson you've taken away from\n\n3:26:21.560 --> 3:26:22.560\n your life?\n\n3:26:22.560 --> 3:26:25.280\n That was a new question for me.\n\n3:26:25.280 --> 3:26:27.720\n I've never been asked that question.\n\n3:26:27.720 --> 3:26:35.320\n And I thought about it for 20 seconds, and then I came up with this phrase that we all\n\n3:26:35.320 --> 3:26:42.560\n know, love conquers all, because in my life it did, in the end.\n\n3:26:42.560 --> 3:26:50.280\n And it's the strongest human emotion, and that is what makes us human, really.\n\n3:26:50.280 --> 3:26:57.540\n And you spoke about the, I mean, offline as I've spoken with you, it's clear to me how\n\n3:26:57.540 --> 3:27:04.640\n transformative, how powerful the life of your children are, your daughters in your life,\n\n3:27:04.640 --> 3:27:09.280\n and who you are, and why you think life is beautiful, and why you think this country\n\n3:27:09.280 --> 3:27:10.560\n is beautiful.\n\n3:27:10.560 --> 3:27:23.880\n Now that I'm pretty mature, to put it mildly, I'm also more loving towards many more people.\n\n3:27:23.880 --> 3:27:28.840\n These things like random acts of kindness for strangers, I do them, I'm looking for\n\n3:27:28.840 --> 3:27:29.840\n them now.\n\n3:27:29.840 --> 3:27:30.840\n And you know what?\n\n3:27:30.840 --> 3:27:31.840\n It's good for me.\n\n3:27:31.840 --> 3:27:38.420\n Well, welcome to Texas, because this random acts of kindness to strangers seems to be\n\n3:27:38.420 --> 3:27:44.480\n a way of life, which is one of the reasons I love it here.\n\n3:27:44.480 --> 3:27:50.160\n It just reminds me why I love human beings, is that there's just this warmth, this connection.\n\n3:27:50.160 --> 3:27:52.680\n Yeah, and Georgia is the same thing.\n\n3:27:52.680 --> 3:27:53.680\n Yeah.\n\n3:27:53.680 --> 3:27:54.680\n Amen.\n\n3:27:54.680 --> 3:27:58.840\n Do you have any regrets?\n\n3:27:58.840 --> 3:28:02.280\n Looking back at life, do you wish you'd done something different?\n\n3:28:02.280 --> 3:28:08.920\n I could have, but then I would have a different regret.\n\n3:28:08.920 --> 3:28:12.440\n I betrayed the wife, the German wife that I loved.\n\n3:28:12.440 --> 3:28:16.740\n I really did love her, and I betrayed her.\n\n3:28:16.740 --> 3:28:24.680\n But if I don't betray her, then I betray the child.\n\n3:28:24.680 --> 3:28:27.400\n That is a source of so much love for you now.\n\n3:28:27.400 --> 3:28:34.920\n So maybe life is a kind of, you get to choose your regrets.\n\n3:28:34.920 --> 3:28:35.920\n You don't get to avoid them.\n\n3:28:35.920 --> 3:28:43.680\n Yeah, it's a little bit of a strange way of putting it, but there's no other choice.\n\n3:28:43.680 --> 3:28:50.600\n I tell you what I don't regret, and that may be, you probably understand it now because\n\n3:28:50.600 --> 3:28:55.960\n you have enough background about me, I don't regret having lied to my mother.\n\n3:28:55.960 --> 3:29:00.600\n Because I had no really strong emotional relationship with her.\n\n3:29:00.600 --> 3:29:09.760\n She took care of me, she was proud of me, but we didn't hug, we didn't interact emotionally\n\n3:29:09.760 --> 3:29:10.760\n whatsoever.\n\n3:29:10.760 --> 3:29:15.520\n So you don't feel like you betrayed that love that—\n\n3:29:15.520 --> 3:29:23.700\n Well I did, I know that she was looking for me until the day she died.\n\n3:29:23.700 --> 3:29:30.120\n She wrote a letter to President Gorbachev asking him for help to locate me.\n\n3:29:30.120 --> 3:29:40.880\n She checked with Astazi, she just was hell bent on finding me and couldn't find me,\n\n3:29:40.880 --> 3:29:45.600\n so she passed away without knowing what happened to me.\n\n3:29:45.600 --> 3:29:52.400\n Now there was this rumor that was flying around, and she possibly may have bought into that\n\n3:29:52.400 --> 3:30:01.480\n rumor because my cover for when I went to the United States was that I changed careers\n\n3:30:01.480 --> 3:30:11.560\n again and I joined an institution in Kazakhstan that did space research, intercosmos something\n\n3:30:11.560 --> 3:30:21.360\n something, and I had a piece of paper that invited me to start there, and it was a forgery.\n\n3:30:21.360 --> 3:30:32.040\n It never existed, but people knew that in Kazakhstan there were super secret facilities.\n\n3:30:32.040 --> 3:30:38.780\n One of my classmates, old classmates from high school started the rumor that I died\n\n3:30:38.780 --> 3:30:43.280\n in a rocket accident, and everybody knew that.\n\n3:30:43.280 --> 3:30:52.440\n So when I came back to Germany, I found the telephone number of this girl that had dumped\n\n3:30:52.440 --> 3:30:53.440\n me.\n\n3:30:53.440 --> 3:30:59.600\n I called her, and I said, so guess who this is?\n\n3:30:59.600 --> 3:31:04.680\n Maybe you hold on to your chair, she says yes, I said, this is Albrecht.\n\n3:31:04.680 --> 3:31:09.880\n It's a good payback.\n\n3:31:09.880 --> 3:31:12.460\n No, we actually met.\n\n3:31:12.460 --> 3:31:21.560\n So there's two elderly people in their 60s who meet each other after so many years, and\n\n3:31:21.560 --> 3:31:28.360\n the one that ended the relationship started the conversation by saying, you know what,\n\n3:31:28.360 --> 3:31:33.800\n I made a really bad mistake, and the tears came down her cheeks.\n\n3:31:33.800 --> 3:31:34.800\n I wasn't asking for that.\n\n3:31:34.800 --> 3:31:39.160\n I wasn't happy about it, but it did feel good.\n\n3:31:39.160 --> 3:31:46.320\n Now a while later, I knew why she said she made a mistake.\n\n3:31:46.320 --> 3:31:47.320\n I met her husband.\n\n3:31:47.320 --> 3:31:59.000\n Yeah, I mean, there's a, Tom Waits has a song called Martha, where an older gentleman calls\n\n3:31:59.000 --> 3:32:01.440\n somebody he used to love, and they have a conversation.\n\n3:32:01.440 --> 3:32:07.080\n They're both married now, and sometimes you can meet people from your past, and it gives\n\n3:32:07.080 --> 3:32:11.040\n you a glimpse of a possible different life you could have had.\n\n3:32:11.040 --> 3:32:15.680\n Oh yeah, and you know, I was actually, when she said I made a mistake, and I was thinking\n\n3:32:15.680 --> 3:32:19.680\n to myself, no, you didn't.\n\n3:32:19.680 --> 3:32:20.680\n There was none.\n\n3:32:20.680 --> 3:32:21.680\n There was nothing left.\n\n3:32:21.680 --> 3:32:24.360\n There was nothing left.\n\n3:32:24.360 --> 3:32:33.200\n Also the person that she became, personality wise, wasn't as attractive as I remembered\n\n3:32:33.200 --> 3:32:34.200\n her.\n\n3:32:34.200 --> 3:32:35.200\n You know, it's puppy love.\n\n3:32:35.200 --> 3:32:37.200\n But it's still love, and it still happened.\n\n3:32:37.200 --> 3:32:38.200\n Yeah, it was.\n\n3:32:38.200 --> 3:32:46.080\n It was passionate love for sure, and I would have thrown myself under the bus if I could\n\n3:32:46.080 --> 3:32:47.080\n save her.\n\n3:32:47.080 --> 3:32:54.480\n It was that strong, and it's just as strong as the love for my two girls.\n\n3:32:54.480 --> 3:33:00.440\n Life is full of moments and periods like that of love, and that's what makes life so freaking\n\n3:33:00.440 --> 3:33:01.640\n awesome.\n\n3:33:01.640 --> 3:33:03.840\n But it does come to an end.\n\n3:33:03.840 --> 3:33:07.440\n And so does this conversation, I guess.\n\n3:33:07.440 --> 3:33:11.920\n This goes on for many more hours, but yes, do you think about your own death?\n\n3:33:11.920 --> 3:33:12.920\n Huh?\n\n3:33:12.920 --> 3:33:13.920\n Do you think about death?\n\n3:33:13.920 --> 3:33:14.920\n Do you think about your own death?\n\n3:33:14.920 --> 3:33:15.920\n Yes.\n\n3:33:15.920 --> 3:33:17.920\n Are you afraid of it?\n\n3:33:17.920 --> 3:33:18.920\n Yes.\n\n3:33:18.920 --> 3:33:23.920\n Even though I'm a Christian.\n\n3:33:23.920 --> 3:33:28.320\n As a Christian, do you have a sense what's coming after, or is it full of uncertainty?\n\n3:33:28.320 --> 3:33:30.240\n I have a hope.\n\n3:33:30.240 --> 3:33:32.340\n I have a hope.\n\n3:33:32.340 --> 3:33:40.620\n You know, there's a lot of Christianity which is quite logical, a lot of Christianity which\n\n3:33:40.620 --> 3:33:46.760\n is also the life of Christ, there's a lot of proof.\n\n3:33:46.760 --> 3:34:08.840\n But I became a Christian starting with a head, and I was already quite old.\n\n3:34:08.840 --> 3:34:17.000\n When you don't get this faith very early, it's tougher to buy into everything.\n\n3:34:17.000 --> 3:34:25.000\n You know, there are some things that are difficult for me to understand and believe, but there's\n\n3:34:25.000 --> 3:34:29.960\n many, many other things that I can't explain only with the existence of a God, but whether\n\n3:34:29.960 --> 3:34:37.480\n He lets us go again for an eternity, I just hope.\n\n3:34:37.480 --> 3:34:42.720\n I won't convince somebody else at this point, which doesn't make me a really, really good\n\n3:34:42.720 --> 3:34:46.640\n Christian because I'm supposed to evangelize.\n\n3:34:46.640 --> 3:34:47.640\n But there's still a fear.\n\n3:34:47.640 --> 3:34:48.640\n Yeah.\n\n3:34:48.640 --> 3:34:51.000\n There's a fear and a hope.\n\n3:34:51.000 --> 3:35:03.760\n On the other hand, I know that, you see, this is how I approach the last years of my life.\n\n3:35:03.760 --> 3:35:08.520\n I will not mentally or physically get decrepit.\n\n3:35:08.520 --> 3:35:14.440\n I will do everything I can do to be alert and fit.\n\n3:35:14.440 --> 3:35:16.200\n I still run.\n\n3:35:16.200 --> 3:35:21.720\n I run four or five times a week, and I'm going to start lifting weights again.\n\n3:35:21.720 --> 3:35:22.720\n Good.\n\n3:35:22.720 --> 3:35:25.400\n You stay physically and mentally sharp.\n\n3:35:25.400 --> 3:35:26.400\n Yes.\n\n3:35:26.400 --> 3:35:28.840\n Go out with guns blazing.\n\n3:35:28.840 --> 3:35:38.640\n I once read a book written by a medical doctor, he said, most people, when they're becoming\n\n3:35:38.640 --> 3:35:46.640\n mature, the rest of their life is a slow downward move.\n\n3:35:46.640 --> 3:35:47.640\n Not for you.\n\n3:35:47.640 --> 3:35:48.640\n No.\n\n3:35:48.640 --> 3:35:52.480\n The last years are pretty bad.\n\n3:35:52.480 --> 3:35:55.920\n He said, you got to do this, boom.\n\n3:35:55.920 --> 3:35:59.040\n That's pretty good advice from a doctor.\n\n3:35:59.040 --> 3:36:06.200\n If nothing else from Christianity, whichever parts you take on, one of the big ones is\n\n3:36:06.200 --> 3:36:07.200\n love.\n\n3:36:07.200 --> 3:36:12.920\n That's something you've lived from the very beginning before God was part of your life,\n\n3:36:12.920 --> 3:36:14.280\n before anything was part of your life.\n\n3:36:14.280 --> 3:36:18.840\n It seemed that love was part of your life and has been a consistent thread throughout.\n\n3:36:18.840 --> 3:36:19.840\n Yes, sir.\n\n3:36:19.840 --> 3:36:27.880\n There's a short sentence in the Bible that says, God is love.\n\n3:36:27.880 --> 3:36:37.080\n The other thing I want to say, the Christian morality is, I can sign that with my blood.\n\n3:36:37.080 --> 3:36:38.080\n God is love.\n\n3:36:38.080 --> 3:36:39.080\n Amen.\n\n3:36:39.080 --> 3:36:45.180\n Jack, you're an incredible person, lived an incredible life.\n\n3:36:45.180 --> 3:36:46.180\n Thank you for talking today.\n\n3:36:46.180 --> 3:36:48.720\n Thank you for telling your story.\n\n3:36:48.720 --> 3:36:53.720\n Thank you for being who you are, and thank you for being all about love.\n\n3:36:53.720 --> 3:36:56.160\n This is a beautiful conversation, it was an honor.\n\n3:36:56.160 --> 3:36:57.160\n Thank you for talking today.\n\n3:36:57.160 --> 3:37:00.880\n Yeah, and I appreciate the tough questions that you asked.\n\n3:37:00.880 --> 3:37:03.080\n Thanks for listening to this conversation with Jack Barsky.\n\n3:37:03.080 --> 3:37:07.320\n To support this podcast, please check out our sponsors in the description.\n\n3:37:07.320 --> 3:37:11.380\n And now, let me leave you with some words from Edward Snowden.\n\n3:37:11.380 --> 3:37:15.700\n You can't come up against the world's most powerful intelligence agencies and not accept\n\n3:37:15.700 --> 3:37:16.700\n the risk.\n\n3:37:16.700 --> 3:37:22.280\n If they want to get you, over time, they will.\n\n3:37:22.280 --> 3:37:48.920\n Thank you for listening, and hope to see you next time.\n\n"
}