{
  "title": "Chris Duffin: The Mad Scientist of Strength | Lex Fridman Podcast #207",
  "id": "e4Bet29PVPY",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.600\n The following is a conversation with Chris Duffin, the mad scientist of strength.\n\n00:05.600 --> 00:10.900\n He's one of the strongest people in the world, but is also an engineer of some of the most\n\n00:10.900 --> 00:13.880\n innovative strength equipment I've ever seen.\n\n00:13.880 --> 00:16.680\n Check out his company Kabuki Strength.\n\n00:16.680 --> 00:22.800\n He is the only person who squatted and deadlifted 1000 pounds for multiple reps, and achieved\n\n00:22.800 --> 00:25.000\n many other amazing feats of strength.\n\n00:25.000 --> 00:30.440\n He has lived one hell of a life of hardship and triumph, as he writes about in his book\n\n00:30.440 --> 00:33.640\n called The Eagle and the Dragon.\n\n00:33.640 --> 00:39.840\n Quick mention of our sponsors, Headspace, Magic Spoon, Sun Basket, and Ladder.\n\n00:39.840 --> 00:43.540\n Check them out in the description to support this podcast.\n\n00:43.540 --> 00:48.980\n As a side note, let me say that I was always a fan of strength, both powerlifting and Olympic\n\n00:48.980 --> 00:53.680\n weightlifting, both as a fan and practitioner.\n\n00:53.680 --> 00:58.040\n Basically I'm a fan of people who are willing to put in years of hard work towards finding\n\n00:58.040 --> 01:03.240\n out what the limits of their body is, and then smashing past those limits.\n\n01:03.240 --> 01:10.200\n People like Chris Duffin, or on the Olympic weightlifting side, people like Dmitri Klokov.\n\n01:10.200 --> 01:11.600\n That guy is great.\n\n01:11.600 --> 01:15.920\n This is why I love watching the Olympics, both the heartbreaks and the triumphs.\n\n01:15.920 --> 01:22.080\n They all reveal the incredible heights that the human mind and the human body can reach.\n\n01:22.080 --> 01:28.360\n This is the Lex Friedman podcast, and here is my conversation with Chris Duffin.\n\n01:28.360 --> 01:33.260\n You've been a part of several incredible feats of strength.\n\n01:33.260 --> 01:37.700\n Which was the hardest, or maybe one you're most proud of?\n\n01:37.700 --> 01:42.640\n Definitely the one I'm most proud of is that journey for the grand goals.\n\n01:42.640 --> 01:45.440\n It was like a five year scope that I chased this.\n\n01:45.440 --> 01:49.360\n And so when you think about training, it took more than five years, obviously.\n\n01:49.360 --> 01:53.280\n By that point, I'd been training for over 25 years.\n\n01:53.280 --> 01:54.280\n But it makes me proud.\n\n01:54.280 --> 01:57.880\n I mean, there were three distinct things that I wanted to accomplish out of this.\n\n01:57.880 --> 02:00.280\n So it was really thought out.\n\n02:00.280 --> 02:06.680\n And this was kind of my exit from being a competitive lifter.\n\n02:06.680 --> 02:11.800\n And basically saying, hey, I'm going to be an Instagram lifter, an exhibition lifter,\n\n02:11.800 --> 02:12.800\n or whatever.\n\n02:12.800 --> 02:17.680\n I've done this for 16 years, I was number one in the world for like eight years straight,\n\n02:17.680 --> 02:18.680\n all time world records.\n\n02:18.680 --> 02:20.240\n And I'm like, I'm not going to do that anymore.\n\n02:20.240 --> 02:25.640\n What I want to do is just something deep down to me that is really important.\n\n02:25.640 --> 02:27.960\n And there's three things that were driving this.\n\n02:27.960 --> 02:31.520\n And this is a five year journey that I went through to do this.\n\n02:31.520 --> 02:37.720\n I really wanted to showcase that you could do something that is well beyond the scope\n\n02:37.720 --> 02:40.000\n of what people think is humanly possible.\n\n02:40.000 --> 02:47.360\n So just this inspiration thing, this grand over the top, like if you set your mind to\n\n02:47.360 --> 02:50.700\n a single minded goal, you can go so much further.\n\n02:50.700 --> 02:54.760\n And I didn't even say what the goal was upfront, because it was so far out there, I would have\n\n02:54.760 --> 02:55.760\n been laughed at.\n\n02:55.760 --> 03:01.000\n And that's, I think big goals should be kept pretty damn close to start with for that reason\n\n03:01.000 --> 03:02.000\n too.\n\n03:02.000 --> 03:07.200\n But and then the second piece was to walk the walk to show like the principles of what\n\n03:07.200 --> 03:13.120\n I believed in around human movement, the ability to manage and control the spinal mechanics\n\n03:13.120 --> 03:15.320\n and the output that can have on the body.\n\n03:15.320 --> 03:19.780\n And so I wanted to take the two most basic movements that every able bodied person should\n\n03:19.780 --> 03:20.780\n be able to do.\n\n03:20.780 --> 03:26.000\n So fundamental movement patterns, the squat, which is like, in the developmental approach\n\n03:26.000 --> 03:32.400\n is around nine months as a baby from a developmental kinesiology standpoint, and a really basic\n\n03:32.400 --> 03:35.560\n pattern that every able bodied person should be able to master the other one being the\n\n03:35.560 --> 03:40.840\n hip hinge, being able to pick something up off the ground, a deadlift.\n\n03:40.840 --> 03:46.260\n And I wanted to do those two, not just one, because I wanted to show the principles that\n\n03:46.260 --> 03:55.120\n I wasn't built for one, I wasn't a specialist because of my lever links, torso links, all\n\n03:55.120 --> 04:01.660\n that, any outliers, because nobody had ever done a thousand pound squat.\n\n04:01.660 --> 04:05.800\n So this is it is and a thousand pound deadlift.\n\n04:05.800 --> 04:10.560\n It was outside of the scope of what anybody's there's like half a dozen people that have\n\n04:10.560 --> 04:14.320\n done one or the other, but nobody's ever done both.\n\n04:14.320 --> 04:15.800\n And I wanted to do something unique.\n\n04:15.800 --> 04:21.960\n I wanted to do them, not only do it, but do them for reps to leave literally no question\n\n04:21.960 --> 04:22.960\n out there.\n\n04:22.960 --> 04:24.960\n And there's no competition for that.\n\n04:24.960 --> 04:28.200\n So it was this is what I'm going to go do.\n\n04:28.200 --> 04:32.560\n And to pull it off, I had some past issues with my elbows and stuff that I couldn't work\n\n04:32.560 --> 04:33.560\n around.\n\n04:33.560 --> 04:37.560\n So I had to wear straps, which was another reason I couldn't do it in the competition\n\n04:37.560 --> 04:39.080\n setting.\n\n04:39.080 --> 04:43.920\n So the first year I worked up and I did a thousand and two pound deadlift plates were\n\n04:43.920 --> 04:44.920\n weighed afterwards.\n\n04:44.920 --> 04:49.720\n It was a couple a little bit over and I did it for almost three reps.\n\n04:49.720 --> 04:52.000\n And that still stands as a Guinness world record.\n\n04:52.000 --> 04:56.480\n Just the one rep does is the most weight ever sumo deadlifted.\n\n04:56.480 --> 04:59.440\n And one other person has deadlifted a thousand for reps at this point.\n\n04:59.440 --> 05:02.520\n And that was a Thor Bjornsson from Game of Thrones.\n\n05:02.520 --> 05:04.160\n He's done a thousand for a double as well.\n\n05:04.160 --> 05:08.840\n So then the next four years and I did a bunch of feats of strength on the way, but it was\n\n05:08.840 --> 05:14.200\n all about building that axial loading capacity, the strength that because now I'm moving the\n\n05:14.200 --> 05:16.660\n weight from my hands up to my shoulders.\n\n05:16.660 --> 05:22.880\n And so to do it for reps is like so much harder than a single like five to 10 seconds versus\n\n05:22.880 --> 05:30.560\n 30 plus seconds to be able to buffer and manage all that with that kind of load is just crazy.\n\n05:30.560 --> 05:34.880\n So it's literally about the duration that your body is carrying the load.\n\n05:34.880 --> 05:36.560\n Yeah, that's a big part of it.\n\n05:36.560 --> 05:41.680\n Yeah, because you have to you're using the resource of the diaphragm for stabilization.\n\n05:41.680 --> 05:45.160\n And so it it's also responsible for respiration and all this other stuff.\n\n05:45.160 --> 05:48.360\n So even when you're not squatting, you've got to be handling those loads.\n\n05:48.360 --> 05:50.640\n Just holding that weight is fascinating.\n\n05:50.640 --> 05:57.240\n It's like it's fascinating that the human body can do that, can can maintain that structure,\n\n05:57.240 --> 06:02.840\n just everything working together, that the biology, the skeletal structure, the the musculature\n\n06:02.840 --> 06:05.120\n on top of that can hold the weight.\n\n06:05.120 --> 06:06.500\n It's fascinating to watch.\n\n06:06.500 --> 06:11.720\n Everything is very intentful about positioning and how you're creating pressure and all this\n\n06:11.720 --> 06:12.980\n sort of stuff, especially for me.\n\n06:12.980 --> 06:16.400\n So when I mentioned that half a dozen people have squatted it and half a dozen people have\n\n06:16.400 --> 06:17.400\n deadlifted it.\n\n06:17.400 --> 06:20.040\n You understand those people all weigh three hundred and eighty to four hundred and forty\n\n06:20.040 --> 06:21.040\n pounds.\n\n06:21.040 --> 06:26.080\n I weighed to sixty five to two eighty five, depending on where I was between the two.\n\n06:26.080 --> 06:27.440\n So there's that as well.\n\n06:27.440 --> 06:28.440\n Right.\n\n06:28.440 --> 06:30.080\n So big, big difference.\n\n06:30.080 --> 06:35.760\n And over the course of that, I did a lot of other feats of strength that fit in that capacity.\n\n06:35.760 --> 06:37.000\n And we can skip over those.\n\n06:37.000 --> 06:43.520\n But that was hugely invested as far as, you know, what I put into being able to accomplish\n\n06:43.520 --> 06:47.800\n that, because it's it's over the top, which means the other stuff had to shift and I had\n\n06:47.800 --> 06:49.440\n to learn.\n\n06:49.440 --> 06:52.460\n There's so many things that came into place to pull that off.\n\n06:52.460 --> 06:56.600\n And so, yeah, last March, two days before the world shut down, I did it.\n\n06:56.600 --> 07:02.000\n It was supposed to be at the largest equipment exhibition in the world down in San Diego\n\n07:02.000 --> 07:03.140\n as an event.\n\n07:03.140 --> 07:05.200\n And that got shut down a week beforehand, obviously.\n\n07:05.200 --> 07:08.380\n So we moved to let's do it in my gym and invite people.\n\n07:08.380 --> 07:11.960\n And that was on a Saturday and Thursday or Friday, they limited it to twenty five people\n\n07:11.960 --> 07:12.960\n for gatherings.\n\n07:12.960 --> 07:17.400\n I did it on Saturday and then Monday, everything shut down.\n\n07:17.400 --> 07:20.600\n So it was kind of surreal for timing wise.\n\n07:20.600 --> 07:21.600\n Right.\n\n07:21.600 --> 07:25.760\n And so if I hadn't done it, it would have never got done like because I I'd pushed to\n\n07:25.760 --> 07:26.760\n the limit.\n\n07:26.760 --> 07:27.800\n I couldn't come back and do it.\n\n07:27.800 --> 07:30.300\n It was at the total limitation of my capabilities.\n\n07:30.300 --> 07:32.200\n So I'm pretty I'm pretty proud of it.\n\n07:32.200 --> 07:36.360\n And the last piece was a every one of these feats along the way.\n\n07:36.360 --> 07:39.560\n I collaborated with a charity that I believed in.\n\n07:39.560 --> 07:45.280\n And there was a lot of those tied to my life story, which we probably will get into.\n\n07:45.280 --> 07:46.920\n So it was threefold.\n\n07:46.920 --> 07:55.240\n So that inspiration piece, inspiration, motivation, walking the walk and showing like just these\n\n07:55.240 --> 07:59.480\n methodologies that a guy that had to learn to walk again can do something like this with\n\n07:59.480 --> 08:00.480\n no back pain.\n\n08:00.480 --> 08:03.360\n So if you if you there is a way.\n\n08:03.360 --> 08:09.800\n And the third one is is to provide awareness and recognition around a lot of key charities.\n\n08:09.800 --> 08:14.680\n So so your heart was in this journey, but also your mind is just you're like a scholar\n\n08:14.680 --> 08:20.360\n of strength, a scientist of strength, an engineer of strength for reps do a thousand pounds\n\n08:20.360 --> 08:23.240\n squat and deadlift.\n\n08:23.240 --> 08:27.520\n Let's first talk through the actual day you did it.\n\n08:27.520 --> 08:32.720\n What does it take to lift that much for reps?\n\n08:32.720 --> 08:37.040\n The day of is really easy.\n\n08:37.040 --> 08:40.040\n The really the lift itself.\n\n08:40.040 --> 08:44.120\n Other than a few seconds is really easy and not challenging.\n\n08:44.120 --> 08:46.240\n People always ask me, what was it like?\n\n08:46.240 --> 08:47.640\n How beat up were you after that?\n\n08:47.640 --> 08:48.640\n And the deadlift.\n\n08:48.640 --> 08:51.260\n And the simple fact is, it was easy.\n\n08:51.260 --> 08:55.600\n The work to get there was horrendous.\n\n08:55.600 --> 09:00.200\n So so even the psychology of the day you weren't there was not a fear.\n\n09:00.200 --> 09:01.640\n There was not a nervousness.\n\n09:01.640 --> 09:03.760\n There is not a doubt in your mind.\n\n09:03.760 --> 09:07.800\n There were certainly doubts on that day from some training history.\n\n09:07.800 --> 09:14.040\n So there was some major breaks to my confidence in the couple months leading up where I had\n\n09:14.040 --> 09:17.700\n issues with passing out under the bar.\n\n09:17.700 --> 09:19.480\n So completely losing consciousness.\n\n09:19.480 --> 09:22.660\n And this was on weight less than a thousand pounds even.\n\n09:22.660 --> 09:31.680\n So that was like all this buildup in me going, what if what if I think I have this resolved?\n\n09:31.680 --> 09:34.880\n But what if I get up there and I can't even do a rep?\n\n09:34.880 --> 09:38.580\n How embarrassing will this be that I've been talking about this and planning for this for\n\n09:38.580 --> 09:41.040\n so long?\n\n09:41.040 --> 09:43.680\n But outside of that, I knew I could do it.\n\n09:43.680 --> 09:48.160\n In fact, I wanted to do even more even up to the second rep.\n\n09:48.160 --> 09:52.600\n Training is about, you know, working into a fatigue state.\n\n09:52.600 --> 09:58.180\n So you're building an amount of fatigue in your system.\n\n09:58.180 --> 10:00.920\n And then when you let off of it, that's when you get a compensation.\n\n10:00.920 --> 10:02.280\n And that's how you stairstep training.\n\n10:02.280 --> 10:03.520\n This is periodization.\n\n10:03.520 --> 10:08.300\n But leading into a big event, you're accumulating this massive amount of fatigue.\n\n10:08.300 --> 10:11.720\n And so I was performing at a level that I could do it.\n\n10:11.720 --> 10:15.780\n And so I knew I was going to be able to on me because then you then you give yourself\n\n10:15.780 --> 10:21.480\n that window to be able to recover and supercompensate and be able to do a little bit more.\n\n10:21.480 --> 10:26.920\n So like that first rep when I did it strengthwise, I went, I could do this for five reps like\n\n10:26.920 --> 10:27.920\n it went through my head.\n\n10:27.920 --> 10:32.560\n I'm like feeling I mean, it was easy and it was fast and it felt like amazing.\n\n10:32.560 --> 10:34.640\n And I'm like, I'm going to crush this.\n\n10:34.640 --> 10:40.160\n And then set rep to the realization kicked in as like, oh, this is for reps with a thousand\n\n10:40.160 --> 10:41.720\n pounds on your back.\n\n10:41.720 --> 10:47.760\n And you're fatiguing just like and then the third one was every last thing I could muster\n\n10:47.760 --> 10:48.760\n to just finish.\n\n10:48.760 --> 10:53.240\n I mean, I just barely got it done because it's the strength is like there.\n\n10:53.240 --> 10:58.640\n But like that capacity to be able to manage all those resources for that amount of time\n\n10:58.640 --> 11:01.080\n because not just leg strength when we're talking about this stuff.\n\n11:01.080 --> 11:07.600\n So what does it take to go from the from I don't know what like from five hundred to\n\n11:07.600 --> 11:09.320\n a thousand?\n\n11:09.320 --> 11:12.920\n That feels like a journey that's like exponential.\n\n11:12.920 --> 11:15.680\n It's it gets exponentially harder.\n\n11:15.680 --> 11:16.680\n It does.\n\n11:16.680 --> 11:19.960\n In the early 2000s, like I said, I started lifting in 1988.\n\n11:19.960 --> 11:25.840\n But my first meet in the early 2000s, my my max deadlift was five twenty three and my\n\n11:25.840 --> 11:28.560\n first squat was five hundred and fifty.\n\n11:28.560 --> 11:31.320\n So that's the heck of a journey.\n\n11:31.320 --> 11:35.320\n It is a journey for people that like to lift.\n\n11:35.320 --> 11:40.160\n What should they understand about the difference between doing five hundred and a thousand in\n\n11:40.160 --> 11:44.600\n terms of the actual lift that you were experiencing that day in terms of the mechanics, in terms\n\n11:44.600 --> 11:47.920\n of all the things you have to be like the neurological adaptation?\n\n11:47.920 --> 11:55.680\n You mentioned the breathing, the core strength, like techniques, like little tricks, psychological\n\n11:55.680 --> 11:58.760\n tricks, anything that kind of stands out to you.\n\n11:58.760 --> 12:04.700\n The level of intent and the opportunity for error are at a different level.\n\n12:04.700 --> 12:12.200\n So just the minutest changes of position by quarter inch, half inch can be make or break\n\n12:12.200 --> 12:13.200\n at that level.\n\n12:13.200 --> 12:15.760\n So these things, everything gets amplified.\n\n12:15.760 --> 12:21.240\n So the ability to start with having the pelvis just in the right orientation to the diaphragm\n\n12:21.240 --> 12:27.960\n before we start initiating what we call the the eccentric loading of the abdominal cavity\n\n12:27.960 --> 12:32.840\n to create this intra abdominal pressure of working against this outward expansion, working\n\n12:32.840 --> 12:40.140\n against the outer sheath of abdominal thoracolumbar musculature obliques, causing the co contraction\n\n12:40.140 --> 12:44.320\n at the pelvic floor, all this stuff and how you cue that because you can't think about\n\n12:44.320 --> 12:45.320\n all this stuff.\n\n12:45.320 --> 12:49.200\n You need to break it down and distill and practice to like it's one simple cue that\n\n12:49.200 --> 12:56.480\n we now lock down and control this torso stability because this is what these fundamental movements\n\n12:56.480 --> 13:02.480\n are about, is being able to control our spinal mechanics and then now be able to maintain\n\n13:02.480 --> 13:09.920\n that while articulating the joints around that through a range of motion and then using\n\n13:09.920 --> 13:11.800\n the main power drivers.\n\n13:11.800 --> 13:17.060\n So in this instance, both instances, it's the, you know, the hip complex to generate\n\n13:17.060 --> 13:21.640\n that power and transfer it from how we're rooted and connected to the floor through\n\n13:21.640 --> 13:25.920\n to the distal end, you know, which would be the barbell on the shoulder.\n\n13:25.920 --> 13:28.000\n You know, there's a couple key concepts.\n\n13:28.000 --> 13:32.260\n So one is that what we just talked through is how to actually maintain that stability.\n\n13:32.260 --> 13:37.360\n So if you have either the diaphragm, so which is connected at the rib cage.\n\n13:37.360 --> 13:44.120\n So out of alignment in any position, it needs to be in alignment with the pelvic, the pelvis.\n\n13:44.120 --> 13:45.380\n So those two in opposition.\n\n13:45.380 --> 13:50.680\n So this is simple engineering here because what we're going to do is eccentrically load\n\n13:50.680 --> 13:51.680\n this.\n\n13:51.680 --> 13:54.520\n We're going to use the diaphragm just like you would in a diaphragm pump where it's going\n\n13:54.520 --> 13:57.220\n to press down on all the tissue in there.\n\n13:57.220 --> 13:58.960\n So we're not using breath.\n\n13:58.960 --> 14:02.280\n So our breath was actually a lot of times a default pattern when people do that because\n\n14:02.280 --> 14:06.900\n they'll bring it into their chest and raise their rib cage.\n\n14:06.900 --> 14:11.680\n So what we want to do is just initiate the diaphragm air can be used as well over the\n\n14:11.680 --> 14:15.800\n top at the final to create just a little bit more downward pressure.\n\n14:15.800 --> 14:22.320\n But if we have out of alignment there, we have a pressure leak where it's going to be\n\n14:22.320 --> 14:25.960\n push out the front or the rear if you're either inflection or extension.\n\n14:25.960 --> 14:27.240\n All right.\n\n14:27.240 --> 14:32.920\n And then that causes this co contraction and all this pressure of the organs essentially\n\n14:32.920 --> 14:37.040\n against outward against all those tissue for the co contraction as well as surrounding\n\n14:37.040 --> 14:39.400\n the spine to be able to stabilize that.\n\n14:39.400 --> 14:45.440\n And then it puts all the muscles on both sides of the body in what we call the best length\n\n14:45.440 --> 14:47.240\n tension relationship.\n\n14:47.240 --> 14:52.380\n So if you think about a curl and we reach our arm out at the extended length, our bicep\n\n14:52.380 --> 14:56.280\n is not as strong and then all the way in the curl position, it's not in strong.\n\n14:56.280 --> 14:59.160\n There's somewhere in here that's this control of both.\n\n14:59.160 --> 15:05.280\n And so when you're sitting there arched or bent over, we have muscles that are past either\n\n15:05.280 --> 15:06.320\n one of those ranges.\n\n15:06.320 --> 15:09.800\n So they've got a lot of tension, which then will create relaxation on the other side.\n\n15:09.800 --> 15:10.800\n Right.\n\n15:10.800 --> 15:12.960\n So we want to have an all of that needs to be working.\n\n15:12.960 --> 15:16.660\n And now the next important thing is the foot.\n\n15:16.660 --> 15:21.780\n So it's actually this connection to the ground and how we're actually using the foot and\n\n15:21.780 --> 15:29.240\n ankle complex to grab and grip this connection to the ground and elicit an effect.\n\n15:29.240 --> 15:33.880\n And because of this and then the everything between will naturally kind of do what it\n\n15:33.880 --> 15:35.200\n needs to do.\n\n15:35.200 --> 15:40.740\n So people like to focus on it, knee position or how far out their hips are or all this\n\n15:40.740 --> 15:44.360\n other stuff, which is outputs of this.\n\n15:44.360 --> 15:49.280\n So if we control the torso and the knee, the only thing that can happen from that point\n\n15:49.280 --> 15:52.400\n is for the squat to happen.\n\n15:52.400 --> 15:54.040\n All right.\n\n15:54.040 --> 15:59.900\n So this allows us to use this massive, you know, the hip complex for all the muscles\n\n15:59.900 --> 16:04.880\n around that that are built to drive through hip extension to complete the squat.\n\n16:04.880 --> 16:06.920\n I did actually miss one thing in there.\n\n16:06.920 --> 16:11.660\n So this torso people often miss the lat is a spinal stabilizer as well.\n\n16:11.660 --> 16:17.640\n So that's key in controlling function at the the T.L. Junction, which is just above the\n\n16:17.640 --> 16:18.840\n lumbar spine.\n\n16:18.840 --> 16:22.440\n So kind of right opposite where your sternum is and you'll see people kind of roll over\n\n16:22.440 --> 16:26.120\n sometimes like an Olympic squad or something like that, where they lose position.\n\n16:26.120 --> 16:29.600\n And that's often because they're close grip because you can't engage the lats very well\n\n16:29.600 --> 16:31.600\n that way and they're pushing up in the bar.\n\n16:31.600 --> 16:34.960\n But you want to be able to drive and pull the bar to your center.\n\n16:34.960 --> 16:40.040\n And that's going to create and use the lats now to drive and connect the shoulder into\n\n16:40.040 --> 16:41.040\n this.\n\n16:41.040 --> 16:44.900\n We're kind of compressing and tightening all this stuff towards that center to create that\n\n16:44.900 --> 16:46.400\n entire torso stability.\n\n16:46.400 --> 16:52.040\n So I was using torso stability, not just core stability in my conversation earlier.\n\n16:52.040 --> 16:53.040\n Torsus.\n\n16:53.040 --> 16:59.480\n OK, so there's all these like modules of the body then connected to the grounding with\n\n16:59.480 --> 17:02.400\n like your feet on the ground.\n\n17:02.400 --> 17:04.560\n Everything you're speaking to.\n\n17:04.560 --> 17:06.440\n How do you work each of those modules?\n\n17:06.440 --> 17:11.240\n Is this over time you kind of develop the feel that ultimately boils down to this one\n\n17:11.240 --> 17:13.080\n simple cue that you mentioned?\n\n17:13.080 --> 17:18.280\n Or do you can you like literally study each particular module in yourself and see how\n\n17:18.280 --> 17:20.160\n it affects the lift?\n\n17:20.160 --> 17:23.920\n So the best way and I believe it's because I hate just like people getting out and just\n\n17:23.920 --> 17:29.880\n doing just movement stuff and not actually adding load because we only adapt when there's\n\n17:29.880 --> 17:30.880\n load.\n\n17:30.880 --> 17:34.560\n Maybe we can get some, you know, some proprioception or awareness of position and other stuff,\n\n17:34.560 --> 17:38.640\n doing some some corrective patterns and other stuff.\n\n17:38.640 --> 17:46.040\n But this is basic physiology is that there must be an imposed demand for us to have adaptation.\n\n17:46.040 --> 17:47.040\n And this is mental.\n\n17:47.040 --> 17:48.040\n This is emotional.\n\n17:48.040 --> 17:50.880\n This is all these areas.\n\n17:50.880 --> 17:52.680\n But and people miss that.\n\n17:52.680 --> 17:59.080\n So I prefer to be able to look at a person and this is our methodology and do the assessment\n\n17:59.080 --> 18:01.280\n in any basic loaded movement.\n\n18:01.280 --> 18:05.780\n So with developing an eye for that, you can actually see and go, OK, we've got a fault\n\n18:05.780 --> 18:09.600\n pattern right here in the foot and use a cue or a set of cues.\n\n18:09.600 --> 18:12.200\n Doesn't really matter till we find the one that works and bring that.\n\n18:12.200 --> 18:14.320\n And now we know we want to simplify this stuff.\n\n18:14.320 --> 18:15.320\n I just walk through.\n\n18:15.320 --> 18:16.320\n That sounds really complicated.\n\n18:16.320 --> 18:18.600\n And it it is if we try to break down and distill it all.\n\n18:18.600 --> 18:22.800\n But like, let's just find the basic stuff that gets us in the range, start working and\n\n18:22.800 --> 18:25.120\n then find the next as we add load.\n\n18:25.120 --> 18:29.640\n Now we find where's our next area that we're starting to fault that and then go there again\n\n18:29.640 --> 18:30.640\n next.\n\n18:30.640 --> 18:32.840\n So this is what we do, what we teach in our educational platform.\n\n18:32.840 --> 18:39.280\n So we are the only I believe everybody wants to do a lot of these like assessments, you\n\n18:39.280 --> 18:41.440\n know, on a bench, on a table body.\n\n18:41.440 --> 18:42.940\n And it's like, no, let's let's go squat.\n\n18:42.940 --> 18:43.940\n Let's go deadlift.\n\n18:43.940 --> 18:47.200\n If you do strongman and it's a yoke carry, let's yoke carry because these are basic human\n\n18:47.200 --> 18:48.200\n fundamentals.\n\n18:48.200 --> 18:50.960\n It's not powerlifting like this is how we function.\n\n18:50.960 --> 18:56.900\n This is why we we work with 29 of the 30 major league baseball teams and 90 percent of all\n\n18:56.900 --> 18:59.560\n professional sports out there in North America.\n\n18:59.560 --> 19:03.360\n Sorry, although we do some work with Tour de France and other stuff as well.\n\n19:03.360 --> 19:06.760\n And North America, I do mean hockey, too.\n\n19:06.760 --> 19:11.280\n But these principles like, you know, if if the Dodgers won't bring us in, they're not\n\n19:11.280 --> 19:14.520\n learning how to power lift.\n\n19:14.520 --> 19:19.120\n You know, we're going to obviously will probably be do we do a little bit more shoulder focus\n\n19:19.120 --> 19:22.280\n than hip focus with their athletes or their coaches.\n\n19:22.280 --> 19:23.720\n We're usually working with the coaches, not the athletes.\n\n19:23.720 --> 19:25.120\n And so you help them.\n\n19:25.120 --> 19:29.380\n And then the same thing on yourself to understand the role that these different muscle groups\n\n19:29.380 --> 19:30.380\n have.\n\n19:30.380 --> 19:31.380\n Yes.\n\n19:31.380 --> 19:32.380\n On the holistic.\n\n19:32.380 --> 19:33.380\n Yeah.\n\n19:33.380 --> 19:37.840\n So it's all about getting the joints in the appropriate position so that we can do that.\n\n19:37.840 --> 19:40.800\n We can manage load so that we're not putting undue stress on the joint.\n\n19:40.800 --> 19:42.100\n We're getting the proper link tension.\n\n19:42.100 --> 19:44.500\n We're getting these basic fundamental things with the body.\n\n19:44.500 --> 19:50.560\n And so the the largest global impact that you will have is through spinal mechanics.\n\n19:50.560 --> 19:55.160\n I can't look at a shoulder if I'm not managing this because it's your spine.\n\n19:55.160 --> 20:00.160\n So for those who are just listening, like I'm arching and then and then flexing, that's\n\n20:00.160 --> 20:03.080\n going to affect shoulder extension, flexion, all these sorts of things.\n\n20:03.080 --> 20:08.280\n So it could even affect things down of what's looking at dorsiflexion issues on the foot.\n\n20:08.280 --> 20:12.920\n And then that's why I go to the foot next, because it has the second largest global impact.\n\n20:12.920 --> 20:15.960\n And then from there, now I'm going to look at the big energy drivers, which is the hip\n\n20:15.960 --> 20:18.000\n complex, shoulder complex.\n\n20:18.000 --> 20:21.120\n And then we can start looking at kind of the peripheral things.\n\n20:21.120 --> 20:23.080\n But usually that's some sort of output of the other.\n\n20:23.080 --> 20:26.400\n But the knees, the elbows, the things like that.\n\n20:26.400 --> 20:30.620\n So it's all about getting the stack, which affects neurology.\n\n20:30.620 --> 20:33.420\n So let's talk in engineering terms.\n\n20:33.420 --> 20:36.840\n You get in a car, modern car today, and a lot of them will have this traction control\n\n20:36.840 --> 20:37.840\n button in there.\n\n20:37.840 --> 20:42.540\n And there's a big misconception that, you know, I'm out and it's it's snowy or here\n\n20:42.540 --> 20:43.540\n in Austin, only rainy.\n\n20:43.540 --> 20:46.880\n Well, it probably doesn't rain much, but you're going around a corner, start slipping.\n\n20:46.880 --> 20:49.360\n It's like, oh, it's going to send the powers from the wheels that are slipping to the ones\n\n20:49.360 --> 20:53.640\n that are gripping and keep me from crashing and dying a fiery death.\n\n20:53.640 --> 20:55.680\n Well, that's not how it works.\n\n20:55.680 --> 20:56.960\n It's the exact same.\n\n20:56.960 --> 21:01.480\n We've got we've got the we've got the tires, which are our foot, you know, the connection\n\n21:01.480 --> 21:02.480\n to the ground.\n\n21:02.480 --> 21:03.480\n Right.\n\n21:03.480 --> 21:08.880\n We've got the power driver, which is, you know, the the engine, the transmission delivering,\n\n21:08.880 --> 21:10.560\n you know, the power through it.\n\n21:10.560 --> 21:13.200\n And we've got the stability or suspension.\n\n21:13.200 --> 21:16.480\n And then we have the neurology.\n\n21:16.480 --> 21:22.840\n And what the neurology is doing, it's sensing that we don't have good stability or loss\n\n21:22.840 --> 21:24.640\n of connection somewhere.\n\n21:24.640 --> 21:27.940\n And so I need to save you from crashing and hurting yourself.\n\n21:27.940 --> 21:31.560\n And so it goes to the engine and says, let's retard the timing.\n\n21:31.560 --> 21:32.980\n Let's reduce the shift patterns.\n\n21:32.980 --> 21:35.720\n And we're just reducing the power output.\n\n21:35.720 --> 21:38.160\n And that's straight how the human body works.\n\n21:38.160 --> 21:41.600\n So when I do this stuff, it's actually affecting that.\n\n21:41.600 --> 21:45.880\n I mean, I can take somebody and do some minute changes with the neck position at the thoracic\n\n21:45.880 --> 21:46.880\n outlet.\n\n21:46.880 --> 21:51.280\n OK, and immediately see an enhancement in power output.\n\n21:51.280 --> 21:52.280\n And I can measure it.\n\n21:52.280 --> 21:58.100\n We measure this stuff with velocity devices and see like a 10 percent jump.\n\n21:58.100 --> 21:59.840\n And so think about that.\n\n21:59.840 --> 22:05.780\n What about all your training through the years where you actually had additional capacity?\n\n22:05.780 --> 22:09.820\n But you weren't using it because your traction control was on.\n\n22:09.820 --> 22:12.120\n Now you figure this out stuff and now you start stacking it.\n\n22:12.120 --> 22:14.260\n Now you can see so much greater.\n\n22:14.260 --> 22:17.780\n So it's not just injury prevention.\n\n22:17.780 --> 22:22.780\n This is performance and additive performance over time.\n\n22:22.780 --> 22:23.780\n This is huge.\n\n22:23.780 --> 22:26.280\n And people don't really think about this stuff.\n\n22:26.280 --> 22:31.360\n But we can turn that stuff off, which is actually going to also, again, make us make us safer.\n\n22:31.360 --> 22:33.520\n But what we want to do is the performance tuned race car.\n\n22:33.520 --> 22:35.880\n Do they have a traction control button?\n\n22:35.880 --> 22:41.440\n No, they got some amazing tires to grip the ground, a performance tuned suspension, and\n\n22:41.440 --> 22:43.920\n that driver is going to put what his foot to the metal.\n\n22:43.920 --> 22:46.200\n He's going to put it to the floor.\n\n22:46.200 --> 22:49.000\n OK, that's a performance vehicle.\n\n22:49.000 --> 22:50.000\n That's what we want to be.\n\n22:50.000 --> 22:52.280\n I want to continue on that line.\n\n22:52.280 --> 22:56.120\n But first I have to ask, like, how did it feel to accomplish the grand goal?\n\n22:56.120 --> 22:57.120\n Oh, my God.\n\n22:57.120 --> 22:59.440\n OK, when you just stand back.\n\n22:59.440 --> 23:02.400\n Oh, my thousand pounds for reps.\n\n23:02.400 --> 23:04.200\n What it feel like?\n\n23:04.200 --> 23:06.400\n Anybody can go watch the video online.\n\n23:06.400 --> 23:09.840\n It's well filmed, by the way.\n\n23:09.840 --> 23:11.320\n Got me all like excited.\n\n23:11.320 --> 23:13.280\n Oh, well, the movies.\n\n23:13.280 --> 23:17.340\n So we actually have the final footage of that, the good footage not posted yet.\n\n23:17.340 --> 23:20.760\n So it's literally just an Instagram video or a phone video right now.\n\n23:20.760 --> 23:21.760\n The only one online.\n\n23:21.760 --> 23:22.760\n Yeah.\n\n23:22.760 --> 23:23.760\n It's on your YouTube channel.\n\n23:23.760 --> 23:24.760\n It's dramatic.\n\n23:24.760 --> 23:25.760\n Yes, it is.\n\n23:25.760 --> 23:26.760\n Yeah.\n\n23:26.760 --> 23:30.280\n Came out just time to the music perfectly, too, which is I listened to some odd music,\n\n23:30.280 --> 23:31.880\n which there's some reason behind that.\n\n23:31.880 --> 23:34.320\n OK, but I liked it, though.\n\n23:34.320 --> 23:35.320\n It was great.\n\n23:35.320 --> 23:37.880\n You're saying there's full length footage.\n\n23:37.880 --> 23:41.920\n There's a documentary that's it's got a little slowed because of covid, because it's also\n\n23:41.920 --> 23:44.400\n a backstory of the eagle and the dragon.\n\n23:44.400 --> 23:49.880\n My book about why I do kind of the things that I've done in my life or that's what I'm\n\n23:49.880 --> 23:51.080\n assuming the director is working on.\n\n23:51.080 --> 23:54.800\n I don't really have the control of the movie, right?\n\n23:54.800 --> 23:58.560\n But but OK, but the video's OK.\n\n23:58.560 --> 23:59.560\n How did it feel?\n\n23:59.560 --> 24:00.560\n How did it feel?\n\n24:00.560 --> 24:01.600\n I started crying.\n\n24:01.600 --> 24:10.400\n It was overwhelming to have worked so intensely and so long and hard at something that pushed\n\n24:10.400 --> 24:15.200\n every ounce of me to the limit that and and I did it.\n\n24:15.200 --> 24:16.200\n I'm sorry.\n\n24:16.200 --> 24:17.200\n I'm getting a little emotional.\n\n24:17.200 --> 24:23.920\n I did exactly what I said I was going to fucking do like and it was it was overpowering.\n\n24:23.920 --> 24:31.720\n I mean, I was just crying uncontrollably just with a mixture of I.\n\n24:31.720 --> 24:39.840\n I don't know what the mixture of emotions is hard to explain because it was the completion\n\n24:39.840 --> 24:40.840\n of something.\n\n24:40.840 --> 24:41.840\n It was a new phase of my life.\n\n24:41.840 --> 24:45.240\n I mean, there's so many things here.\n\n24:45.240 --> 24:50.640\n So when you set an impossible goal and you accomplished it, one, two is like on the broader\n\n24:50.640 --> 24:58.280\n humanity aspect, like how many humans in this world accomplish perfection in a particular\n\n24:58.280 --> 25:01.280\n direction required to do this?\n\n25:01.280 --> 25:09.240\n So like you're basically representing like one little like like little glimmer of excellence\n\n25:09.240 --> 25:10.920\n of the human spirit.\n\n25:10.920 --> 25:12.360\n There's always more.\n\n25:12.360 --> 25:16.800\n So understand this is a basic fundamental.\n\n25:16.800 --> 25:18.240\n You can always do better.\n\n25:18.240 --> 25:20.080\n There is no such thing as perfection.\n\n25:20.080 --> 25:23.160\n You could always there is always more.\n\n25:23.160 --> 25:28.000\n So anytime you reach something, any amazing workout or accomplishment in life, could you\n\n25:28.000 --> 25:29.080\n have put more into it?\n\n25:29.080 --> 25:30.080\n Could you?\n\n25:30.080 --> 25:31.080\n Yes.\n\n25:31.080 --> 25:33.560\n But here's the thing.\n\n25:33.560 --> 25:37.040\n I left on my terms.\n\n25:37.040 --> 25:38.680\n I said, this is it.\n\n25:38.680 --> 25:42.040\n I'm going to work towards I've been training for 30 years.\n\n25:42.040 --> 25:45.920\n I'm going to do this thing that is like I couldn't even say that I was going to do it\n\n25:45.920 --> 25:48.280\n years before.\n\n25:48.280 --> 25:51.560\n I'm going to do it and then I'm done.\n\n25:51.560 --> 25:53.120\n I didn't leave from an injury.\n\n25:53.120 --> 25:54.120\n I wasn't forced.\n\n25:54.120 --> 25:55.880\n I wasn't.\n\n25:55.880 --> 25:56.880\n I left on.\n\n25:56.880 --> 25:58.080\n I did exactly what I said.\n\n25:58.080 --> 26:02.000\n I went to a level that I.\n\n26:02.000 --> 26:07.400\n I left on my terms and that's unique because that's usually not the case.\n\n26:07.400 --> 26:10.120\n Sometimes you kind of either taper out or it doesn't matter.\n\n26:10.120 --> 26:12.840\n I'm talking like anything in life in general, right?\n\n26:12.840 --> 26:17.560\n Like you taper out, you fail, you hurt, like you lose.\n\n26:17.560 --> 26:22.200\n Like something, you know, you roll into retirement.\n\n26:22.200 --> 26:25.840\n You accomplish something truly great and you walked away on your own terms.\n\n26:25.840 --> 26:30.440\n Is there a sadness completing something like that?\n\n26:30.440 --> 26:37.360\n Because it's in one perspective, the greatest thing you'll ever do.\n\n26:37.360 --> 26:42.320\n And like when you accomplish such a great height, in some sense, you have to face your\n\n26:42.320 --> 26:44.480\n mortality at that point.\n\n26:44.480 --> 26:49.560\n So good question, but it is certainly not the greatest thing that I'll ever do.\n\n26:49.560 --> 26:51.880\n The greatest physical street I'll ever do.\n\n26:51.880 --> 26:55.160\n The greatest physical street, yes.\n\n26:55.160 --> 27:01.280\n But that was an expression of some of my values and the way that I want to live.\n\n27:01.280 --> 27:03.360\n It was a way of expressing it.\n\n27:03.360 --> 27:11.200\n So understanding that is hugely fundamental because we do see so many athletes get to\n\n27:11.200 --> 27:17.440\n the end of a career and then they fall into a depressive state and struggle with drugs,\n\n27:17.440 --> 27:23.560\n alcohol, depression, and so on because they lost how they identified themselves and trying\n\n27:23.560 --> 27:25.320\n to figure out where to turn, what to do.\n\n27:25.320 --> 27:29.460\n But a big central component of their identity is lost.\n\n27:29.460 --> 27:38.640\n So I knew that this was one way to express that and my grand goals have shifted.\n\n27:38.640 --> 27:41.880\n They're shifted to other outlets that allow me to express that.\n\n27:41.880 --> 27:48.560\n Like my companies, Kabuki Strength, I'm going to change the face of fitness as well as all\n\n27:48.560 --> 27:52.480\n the way through with its integration with clinical medicine and telemedicine.\n\n27:52.480 --> 27:56.400\n And I got another five years before even people see what I'm working on, five years in right\n\n27:56.400 --> 28:00.280\n now because I had to invent equipment, I have to develop methodologies that we're talking\n\n28:00.280 --> 28:01.280\n about.\n\n28:01.280 --> 28:06.800\n I had to do this stuff that ground layer wasn't done to create a cohesive ecosystem of training\n\n28:06.800 --> 28:10.800\n methodology tied to the tools that we're using today, to the environment, tied to the clinical\n\n28:10.800 --> 28:16.380\n practice assessment, tied to the interaction between all those and how that actually needs\n\n28:16.380 --> 28:21.280\n to be reframed because so much of this is broken.\n\n28:21.280 --> 28:24.640\n But there is sadness.\n\n28:24.640 --> 28:26.560\n I won't deny that.\n\n28:26.560 --> 28:35.760\n And the sadness comes in the singularity of focus that I had at that time, the being in\n\n28:35.760 --> 28:36.760\n the process.\n\n28:36.760 --> 28:42.280\n Not necessarily doing it, but like having being in this place that the rest of the world\n\n28:42.280 --> 28:47.400\n kind of fell away from me in those final phases to have something so intense, to have a team\n\n28:47.400 --> 28:52.840\n around me so focused on supporting and like it took me a couple of months after that squad.\n\n28:52.840 --> 28:59.680\n But I finally one day I woke up and I was like, oh, welcome back to the world.\n\n28:59.680 --> 29:02.200\n Like I was in such a mental fog.\n\n29:02.200 --> 29:06.040\n Like I was, it took me a while to climb out of that.\n\n29:06.040 --> 29:14.140\n But that space, that level of intensity and drive and living and being in that space,\n\n29:14.140 --> 29:15.760\n I do miss that.\n\n29:15.760 --> 29:17.520\n But I also, I can't continue that.\n\n29:17.520 --> 29:18.520\n I couldn't continue.\n\n29:18.520 --> 29:23.840\n Like there's a point of like, you push it so hard, the level to try to go from there\n\n29:23.840 --> 29:27.540\n is not acceptable for what you, the impacts that'll have on your life or how you want\n\n29:27.540 --> 29:28.540\n to live.\n\n29:28.540 --> 29:32.920\n And it was taking away those final, like I had to do extreme things and live in an extreme\n\n29:32.920 --> 29:34.720\n way to get there.\n\n29:34.720 --> 29:41.700\n You're just a genius in this whole space of strength and health and almost like biology\n\n29:41.700 --> 29:45.580\n that this strength feat is just one representation of that.\n\n29:45.580 --> 29:51.920\n But this particular strength, it required that kind of singular focus, which I think,\n\n29:51.920 --> 29:57.000\n I don't know, there's something beautiful about that singular focus that's often only\n\n29:57.000 --> 29:59.120\n truly perfected in athletics.\n\n29:59.120 --> 30:01.960\n I see it with the greatest Olympic athletes as well.\n\n30:01.960 --> 30:04.520\n The kind of singular focus required there is incredible.\n\n30:04.520 --> 30:10.320\n It's somehow some of the most beautiful things that humans can do.\n\n30:10.320 --> 30:11.900\n And it's not just that thing.\n\n30:11.900 --> 30:12.900\n So that's the thing.\n\n30:12.900 --> 30:13.900\n It's like, oh, that must be it.\n\n30:13.900 --> 30:18.680\n That singularity of focus, it's not like, here's it, because it covers a vast array\n\n30:18.680 --> 30:19.680\n of stuff.\n\n30:19.680 --> 30:25.880\n Like I was working with people, you know, all, well, yeah, all around North America.\n\n30:25.880 --> 30:29.320\n I wouldn't say anybody around the globe, but professionals coming in, working on different\n\n30:29.320 --> 30:32.800\n aspects of rehab and, and recovery.\n\n30:32.800 --> 30:39.560\n And like, I mean, I'm tapping all sorts of stuff in so many platforms from nutrition\n\n30:39.560 --> 30:47.120\n to drugs to, again, like, you know, various Chinese medicine, you know, as far as, you\n\n30:47.120 --> 30:48.120\n know.\n\n30:48.120 --> 30:52.920\n But also the humans in your life, just love and positivity and just inspiration, all those\n\n30:52.920 --> 30:53.920\n kinds of aspects.\n\n30:53.920 --> 30:58.920\n I mean, you probably would have done much more if you went outside North America and\n\n30:58.920 --> 31:01.480\n talked to some Russians, just between you and I.\n\n31:01.480 --> 31:02.480\n Some Russians.\n\n31:02.480 --> 31:03.480\n Possibly.\n\n31:03.480 --> 31:08.720\n They give you some, I don't know, there's some incredible strength athletes in Eastern\n\n31:08.720 --> 31:09.720\n Europe.\n\n31:09.720 --> 31:10.720\n Absolutely.\n\n31:10.720 --> 31:14.840\n I've got the best one coming in September to get fixed.\n\n31:14.840 --> 31:17.100\n So what do you mean by fixed?\n\n31:17.100 --> 31:21.880\n So I'm not sure what his particular issues are, but he has held the all time world record\n\n31:21.880 --> 31:25.160\n repeatedly for a long time and he hasn't competed for some time.\n\n31:25.160 --> 31:29.720\n And he just reached out saying he would like to come and have me take a look and see if\n\n31:29.720 --> 31:32.000\n I can get him fixed because he needs to return.\n\n31:32.000 --> 31:33.000\n Okay.\n\n31:33.000 --> 31:38.320\n So it's more injury centric versus like form and a fundamental centric combination of everything.\n\n31:38.320 --> 31:40.400\n Everybody always wants to focus on the output.\n\n31:40.400 --> 31:42.480\n How do you give me the fix for that?\n\n31:42.480 --> 31:47.200\n But it ties right back into all those other things, right?\n\n31:47.200 --> 31:53.460\n But yeah, the Eastern block continued to be a dominant force in regards to athletics and\n\n31:53.460 --> 31:56.080\n strength athletes without a doubt.\n\n31:56.080 --> 32:01.640\n Some of my big rivals in my competitive days were, that's who it was.\n\n32:01.640 --> 32:03.560\n Rivalry brings out the best in us.\n\n32:03.560 --> 32:05.520\n Can you tell me the story of your childhood?\n\n32:05.520 --> 32:07.840\n It's definitely outside the scope of the norm.\n\n32:07.840 --> 32:15.880\n Not today, maybe not 150 or 200 years ago, but my parents, highly intelligent people\n\n32:15.880 --> 32:18.900\n coming out of the Bay area.\n\n32:18.900 --> 32:22.360\n My mom was going to school to be a chemical engineer.\n\n32:22.360 --> 32:25.980\n She was a top, top student athlete, graduated out of her school.\n\n32:25.980 --> 32:31.120\n My father was a member of Mensa and my stepfather was just a genius, but not able to really\n\n32:31.120 --> 32:32.520\n function in society.\n\n32:32.520 --> 32:37.640\n But my mom was, she had some demons and some other stuff and just, she just said one day,\n\n32:37.640 --> 32:40.800\n she's like, I just don't want to be part of society.\n\n32:40.800 --> 32:48.140\n She still isn't, lives out in the desert, but has her minds, but she wanted to figure\n\n32:48.140 --> 32:51.360\n out a way to make a life outside of that.\n\n32:51.360 --> 32:56.840\n And so that's where we ended up is up in the mountains in Northern California.\n\n32:56.840 --> 33:05.060\n And a lot of that was them trying to get into successfully growing marijuana, which back\n\n33:05.060 --> 33:08.080\n in that wasn't legal back then, highly illegal.\n\n33:08.080 --> 33:11.800\n And in fact, those areas were, some of the areas where we lived were quite dangerous.\n\n33:11.800 --> 33:15.760\n So there's a documentary Murder Mountain that came out recently.\n\n33:15.760 --> 33:22.160\n If you watch that, you'll tie into my book, just the understanding of the stuff that I\n\n33:22.160 --> 33:31.060\n was talking about dealing with serial killers, human trafficking, police corruption, murderers,\n\n33:31.060 --> 33:35.800\n like just how real that stuff is if it doesn't capture you from the book.\n\n33:35.800 --> 33:38.000\n The book, by the way, is the Eagle and the Dragon.\n\n33:38.000 --> 33:39.000\n Yeah.\n\n33:39.000 --> 33:40.000\n Thank you.\n\n33:40.000 --> 33:41.000\n Yeah.\n\n33:41.000 --> 33:42.000\n I'm a terrible salesperson.\n\n33:42.000 --> 33:43.000\n Like I told you.\n\n33:43.000 --> 33:46.000\n But a good, it's a good title.\n\n33:46.000 --> 33:50.740\n I don't know if you came up with it, but, so yeah, we'll talk about that anyway.\n\n33:50.740 --> 33:54.160\n We're living by a stream off a meadow.\n\n33:54.160 --> 33:56.740\n There's no roads into where you have to hike in.\n\n33:56.740 --> 34:00.560\n And we've got beams lashed into the trees up above us because that's where our bedding\n\n34:00.560 --> 34:01.560\n is.\n\n34:01.560 --> 34:07.360\n Cause there's rattlesnake dens all around and six years old, I'm being taught how to\n\n34:07.360 --> 34:13.840\n capture and handle live rattlesnakes because that's what I need to do to be safe.\n\n34:13.840 --> 34:16.960\n And you can imagine six years old, sitting there with a live rattlesnake in your hand,\n\n34:16.960 --> 34:20.320\n grabbing it, you know, by the side of the head, controlling so it can't, can't bite\n\n34:20.320 --> 34:21.320\n you.\n\n34:21.320 --> 34:24.820\n And it's just wrapping itself around your arm and you're staring at like, it's only\n\n34:24.820 --> 34:28.600\n intent is right then is to kill you.\n\n34:28.600 --> 34:31.520\n Like that's it, right?\n\n34:31.520 --> 34:32.520\n You want to take a bath.\n\n34:32.520 --> 34:36.440\n It's filling up the jug in the stream and setting it out on the rocks during the, during\n\n34:36.440 --> 34:37.440\n the sun.\n\n34:37.440 --> 34:40.560\n So you dump it over your head and you know, not all the living was that way.\n\n34:40.560 --> 34:46.120\n You know, good part was similar to that tent living, living in a 16 foot trailer with a\n\n34:46.120 --> 34:51.840\n family of six, which is not much bigger than the space that we're sitting here.\n\n34:51.840 --> 34:56.440\n So we're talking hard winters with feet of snow on the ground, nowhere to go.\n\n34:56.440 --> 35:01.240\n I'm living in the back of the pickup truck and just a standard sleeping bag that we get\n\n35:01.240 --> 35:04.120\n from the Salvation Army, not the, not the blow zero.\n\n35:04.120 --> 35:07.400\n So I'm I'm, I'm not sleeping well.\n\n35:07.400 --> 35:10.880\n There's living in homes that were maybe condemned.\n\n35:10.880 --> 35:16.320\n There's no, no doors even on them, no electricity or running water or one or the other or both.\n\n35:16.320 --> 35:21.920\n And sometimes a little bit better by the time we got to high school we had a mobile home.\n\n35:21.920 --> 35:25.800\n So my stepfather had won a disability payment cause he had a broken arm that whole time\n\n35:25.800 --> 35:31.640\n from a accident a long time ago and finally got an award and got a down payment on this\n\n35:31.640 --> 35:35.120\n mobile home that didn't have again, doors on the inside.\n\n35:35.120 --> 35:38.840\n It did have running water, did have electricity, didn't have a kitchen, you know, the windows\n\n35:38.840 --> 35:42.080\n would crank close and open, but they wouldn't close all the way.\n\n35:42.080 --> 35:47.680\n So the trim them in with a plastic to be able to try to protect from the elements.\n\n35:47.680 --> 35:51.440\n That was my environment, like learning how to forge for mushrooms.\n\n35:51.440 --> 35:55.160\n I mean, there were summers I would send and my parents would be out, they were in the\n\n35:55.160 --> 35:56.240\n drug trade earlier.\n\n35:56.240 --> 36:05.600\n We got taken by the, by the police and put into foster care for a while, which ties into\n\n36:05.600 --> 36:07.720\n some of the stories with human trafficking.\n\n36:07.720 --> 36:15.480\n And honestly it's in my book, but it's really hard for me to talk about that stuff and obviously\n\n36:15.480 --> 36:16.720\n not all that's in the book.\n\n36:16.720 --> 36:22.480\n So but they got us back and we moved to Oregon and they stayed out of the drug trade from\n\n36:22.480 --> 36:28.000\n that time to ensure that they didn't lose us again, but quickly we kind of fell back\n\n36:28.000 --> 36:29.000\n into the same thing.\n\n36:29.000 --> 36:36.820\n So at that point it was learning about geology and starting to do mining and firewood cutting,\n\n36:36.820 --> 36:40.660\n but mostly the mining because Pat's broken arm chainsaw made a little tough.\n\n36:40.660 --> 36:47.020\n If you remember just the sequence of moments, do you, are you haunted by the darker moments\n\n36:47.020 --> 36:48.280\n of your childhood?\n\n36:48.280 --> 36:53.840\n Do you remember moments of simple joy and happiness?\n\n36:53.840 --> 37:00.200\n Outside of the living around dangerous people and the interactions that came from that,\n\n37:00.200 --> 37:01.760\n we were a family.\n\n37:01.760 --> 37:05.040\n Like we were a cohesive unit battling against the world together.\n\n37:05.040 --> 37:09.680\n We spent all our time together, work, play.\n\n37:09.680 --> 37:10.680\n I was there.\n\n37:10.680 --> 37:17.160\n I was helping raise my, my siblings or I was working with them and you know, it was a constant,\n\n37:17.160 --> 37:18.960\n like I said, we were very physically active.\n\n37:18.960 --> 37:24.080\n So you know, I had that in my upbringing, um, that plug for my shoe company, barefoot,\n\n37:24.080 --> 37:29.920\n B E A R I ran around the wilderness and bare feet all the time, you know, but it was, I\n\n37:29.920 --> 37:35.360\n had a lot of great moments and I'm thankful for a lot of that childhood once we take out\n\n37:35.360 --> 37:39.760\n the trauma and the other stuff associated with it, right?\n\n37:39.760 --> 37:45.680\n And so the connection that I have with my sisters, um, is, is, is huge.\n\n37:45.680 --> 37:50.040\n Um, that goes a bit further to cause I am kind of like a, a little bit of a father figure\n\n37:50.040 --> 37:54.640\n because I was at home raising them and then later I took custody of them, uh, while I\n\n37:54.640 --> 37:58.000\n was going to school because the environment at home deteriorated further.\n\n37:58.000 --> 38:03.440\n Their stepfather, stepfather, like I said, was, he wasn't capable of managing life.\n\n38:03.440 --> 38:08.120\n And uh, my mom had a mental breakdown and took off to Montana and he descended into\n\n38:08.120 --> 38:13.880\n madness even worse, uh, actually took my, my 13 year old sister and kicked her out in\n\n38:13.880 --> 38:17.280\n the middle of winter, a couple of feet of snow on the ground because he thought she\n\n38:17.280 --> 38:21.740\n stole his favorite cereal bowl, um, type.\n\n38:21.740 --> 38:26.320\n So that's when I took in and I was going to college, putting myself through college and\n\n38:26.320 --> 38:28.520\n I started taking custody of my sisters and raising them.\n\n38:28.520 --> 38:34.080\n So anyway, we're still like very, very tight family.\n\n38:34.080 --> 38:40.040\n Um, it took, there was a few years later in life, like that the connection with my mother\n\n38:40.040 --> 38:41.640\n was kind of broken.\n\n38:41.640 --> 38:46.960\n Um, I didn't speak to her for years because of her basically abandoning my sisters and\n\n38:46.960 --> 38:47.960\n me having to come in.\n\n38:47.960 --> 38:51.000\n But that we've worked through that as best we can.\n\n38:51.000 --> 38:53.240\n So you anger on your part?\n\n38:53.240 --> 38:56.480\n It wasn't, there might've been some anger.\n\n38:56.480 --> 38:57.480\n Um.\n\n38:57.480 --> 38:58.480\n Did you always love her?\n\n38:58.480 --> 38:59.480\n Yes.\n\n38:59.480 --> 39:00.480\n And I still do.\n\n39:00.480 --> 39:07.580\n And I'm so, she's taught me basically everything I know about strength and perseverance and\n\n39:07.580 --> 39:11.780\n living life on your terms and being able to create that.\n\n39:11.780 --> 39:16.240\n And so much of what I am is from that, right?\n\n39:16.240 --> 39:24.340\n We've all had to learn to be okay with the way she is because she is just blunt, but\n\n39:24.340 --> 39:31.720\n you know, she's the one that figured out that the human trafficking situation and got, uh,\n\n39:31.720 --> 39:41.040\n got the da involved and got all the, she's the one that I've learned a lot from her.\n\n39:41.040 --> 39:42.040\n And uh.\n\n39:42.040 --> 39:43.760\n Did you inherit some of the demons?\n\n39:43.760 --> 39:45.960\n Oh, most certainly.\n\n39:45.960 --> 39:52.260\n And I, it's something I've continued like in my father's side of has been really tough\n\n39:52.260 --> 39:55.700\n on that because some of it is just based genetic as well.\n\n39:55.700 --> 40:01.960\n So my, my stepfather made I think six or seven attempts on his life during his lifetime.\n\n40:01.960 --> 40:07.120\n One of those in front of me, uh, his mother blew her head off with a shotgun.\n\n40:07.120 --> 40:13.080\n Uh, her brother jumped out a window in LA, uh, their father did something similar and\n\n40:13.080 --> 40:18.480\n I don't know how far back it goes because there is no family except for me and my children.\n\n40:18.480 --> 40:22.120\n You spoke about going through depression yourself.\n\n40:22.120 --> 40:23.240\n Yeah.\n\n40:23.240 --> 40:26.440\n Can you, um, talk about some of the darker moments of that?\n\n40:26.440 --> 40:31.800\n Have you ever like many in your family, have you ever considered suicide?\n\n40:31.800 --> 40:33.680\n Yes I have.\n\n40:33.680 --> 40:35.720\n Yes I have.\n\n40:35.720 --> 40:39.660\n You've achieved a lot of exceptional things in your life.\n\n40:39.660 --> 40:45.120\n Can you talk about those early days of depression and how you overcame it?\n\n40:45.120 --> 40:46.660\n Yeah.\n\n40:46.660 --> 40:52.520\n So the things that I did that people give me accolades for are the things that I did\n\n40:52.520 --> 40:55.460\n selfishly to save myself.\n\n40:55.460 --> 41:03.960\n The things like taking custody of my sisters, being the person that everybody around, you\n\n41:03.960 --> 41:09.040\n know, the, the important people relied on the fact that I had to step to the plate and\n\n41:09.040 --> 41:18.220\n be present and be that person because if I failed, they failed.\n\n41:18.220 --> 41:26.600\n They would be like the people that I grew up with that are dead or in prison or on drugs\n\n41:26.600 --> 41:30.120\n and they're either way to one of those, right?\n\n41:30.120 --> 41:33.980\n That's where everybody ended and I wasn't going to let that happen.\n\n41:33.980 --> 41:35.760\n What about saving yourself?\n\n41:35.760 --> 41:39.520\n And so that's how in those early days, that's how I did it.\n\n41:39.520 --> 41:42.080\n Not saying it's the best approach, but it was survivor mentality.\n\n41:42.080 --> 41:49.680\n It was, I can't selfishly do that because I have them to take care of, right?\n\n41:49.680 --> 41:53.560\n And then that continued where I would keep putting myself in these leadership roles or\n\n41:53.560 --> 42:02.800\n other things and just always being this person that was at the center, at the hub that forced\n\n42:02.800 --> 42:04.040\n me to be there.\n\n42:04.040 --> 42:10.680\n And so it's only in the more recent, you know, last decade or so that I have had to really\n\n42:10.680 --> 42:17.080\n learn how to come and start confronting some of those demons and think, man, why is the\n\n42:17.080 --> 42:18.080\n guy so successful?\n\n42:18.080 --> 42:23.360\n Like, I mean, and we haven't talked about all the stuff that I've done, but like I've\n\n42:23.360 --> 42:32.840\n seen a lot of success in both business, leadership, athletics, academics, entrepreneurship, all\n\n42:32.840 --> 42:34.520\n these sorts of things, right?\n\n42:34.520 --> 42:42.880\n But if it wasn't for having kids and the same being in the position, I wouldn't be here.\n\n42:42.880 --> 42:45.720\n And that's just, that's the reality of it.\n\n42:45.720 --> 42:51.400\n And I'm learning to come and manage those as best I can.\n\n42:51.400 --> 42:56.320\n Learning to meditate into those things and really feel what the driver is so I can get\n\n42:56.320 --> 43:01.360\n to those root understanding and having some guidance doing so.\n\n43:01.360 --> 43:05.000\n Like if you've got mental health issues, this isn't something that you need to tackle on\n\n43:05.000 --> 43:06.000\n your own.\n\n43:06.000 --> 43:11.680\n Like having a professional that can help guide you on that introspective journey is something\n\n43:11.680 --> 43:14.920\n like, it's not like, hey, I'm big, tough guy.\n\n43:14.920 --> 43:17.680\n I can handle everything.\n\n43:17.680 --> 43:18.680\n You know?\n\n43:18.680 --> 43:23.120\n That's fascinating that you saved yourself.\n\n43:23.120 --> 43:28.480\n That's quite powerful to save yourself by having others depend on you.\n\n43:28.480 --> 43:30.660\n And so you can't fail.\n\n43:30.660 --> 43:32.280\n You can't fuck it up.\n\n43:32.280 --> 43:35.960\n And that's a reason to keep moving forward.\n\n43:35.960 --> 43:40.440\n But on the flip side, that's not addressing the darkness.\n\n43:40.440 --> 43:42.120\n It's not.\n\n43:42.120 --> 43:45.460\n And it probably not a sustainable strategy either, right?\n\n43:45.460 --> 43:47.360\n So I recognize these things.\n\n43:47.360 --> 43:50.320\n I don't know.\n\n43:50.320 --> 43:51.580\n Perhaps it is sustainable.\n\n43:51.580 --> 43:57.720\n Perhaps that, I mean, there's something beautiful about giving yourself basically in service\n\n43:57.720 --> 44:02.840\n of others and thereby creating purpose.\n\n44:02.840 --> 44:07.100\n And then it's almost like fake it till you make it and then you make it eventually.\n\n44:07.100 --> 44:09.140\n That is purpose though.\n\n44:09.140 --> 44:10.140\n That is purpose.\n\n44:10.140 --> 44:17.120\n I mean, you have to, to me, life is about taking your cup and how you choose to pour\n\n44:17.120 --> 44:18.120\n it out.\n\n44:18.120 --> 44:19.380\n How you choose to give.\n\n44:19.380 --> 44:20.880\n What is your purpose?\n\n44:20.880 --> 44:23.080\n What is that connection with everybody around you?\n\n44:23.080 --> 44:26.380\n This is, that's the intent.\n\n44:26.380 --> 44:27.380\n That's the life.\n\n44:27.380 --> 44:28.760\n That's what life is about.\n\n44:28.760 --> 44:31.040\n How are you going to help those around you?\n\n44:31.040 --> 44:32.520\n How are you going to help the world?\n\n44:32.520 --> 44:37.680\n Your purpose is right here, figuring out what this is and then how to do that.\n\n44:37.680 --> 44:40.520\n But at the same time, you can't let that run dry.\n\n44:40.520 --> 44:44.320\n So you have to make sure that you're filling that up.\n\n44:44.320 --> 44:46.560\n That's the other side, right?\n\n44:46.560 --> 44:47.560\n That's the other side.\n\n44:47.560 --> 44:48.560\n Yeah.\n\n44:48.560 --> 44:52.800\n We'll return to your engineering degree, which you're obviously scientifically engineering\n\n44:52.800 --> 44:55.360\n minded, which is fascinating.\n\n44:55.360 --> 44:58.880\n Your book is titled the Eagle and the Dragon.\n\n44:58.880 --> 45:02.320\n What do the Eagle and the Dragon symbolize?\n\n45:02.320 --> 45:03.840\n They're pretty big symbols for me.\n\n45:03.840 --> 45:07.520\n In fact, that covers my entire body as a tattoo.\n\n45:07.520 --> 45:11.320\n So the first one I had done at around 19 years old.\n\n45:11.320 --> 45:14.200\n And so this is, or started at 19.\n\n45:14.200 --> 45:21.040\n It's an eagle that covers my entire front, you know, my stomach, rib cage, and one that\n\n45:21.040 --> 45:23.000\n was on my back that covered most of my back.\n\n45:23.000 --> 45:29.080\n And there's chained at the, well, at the claw, I guess.\n\n45:29.080 --> 45:33.640\n And the chain wraps down around and attaches to my ankle and there's a shackle there.\n\n45:33.640 --> 45:37.760\n And so this was something that I had done at that age because it was, to me, it was\n\n45:37.760 --> 45:46.120\n a representation of your potential, your strengths, your abilities that you can fly to whatever\n\n45:46.120 --> 45:48.680\n height that you want in this world.\n\n45:48.680 --> 45:53.340\n The only thing holding you back at the end of the day is yourself.\n\n45:53.340 --> 45:57.400\n And this was, I hadn't necessarily accomplished a whole lot at that time.\n\n45:57.400 --> 46:02.080\n I mean, I was valedictorian for high school, small high school.\n\n46:02.080 --> 46:03.080\n Does that even count?\n\n46:03.080 --> 46:06.840\n I was a state level wrestler.\n\n46:06.840 --> 46:08.960\n This was my belief.\n\n46:08.960 --> 46:13.280\n And you sense that there was a potential in you and the only thing that could stop you\n\n46:13.280 --> 46:15.640\n from realizing that potential was yourself.\n\n46:15.640 --> 46:16.640\n That's right.\n\n46:16.640 --> 46:24.320\n That's a heck of a tattoo to get, by the way, at 19, but 40 hours went into that thing.\n\n46:24.320 --> 46:26.400\n It shows you got some guts.\n\n46:26.400 --> 46:38.720\n And then the next tattoo, so I only have two, I had done in 2015, 2016 when I, so at this\n\n46:38.720 --> 46:41.120\n point in my life, so I had done that.\n\n46:41.120 --> 46:42.640\n I had flown to whatever heights, right?\n\n46:42.640 --> 46:50.160\n So I had, I had proven to myself and maybe done what I thought I needed to do to show\n\n46:50.160 --> 46:56.060\n the world that this poor kid from the sticks, this kid growing up in the mountains with\n\n46:56.060 --> 46:59.280\n nothing could achieve the American dream.\n\n46:59.280 --> 47:05.960\n I was a corporate executive sought after that I'd come in, I'd fix companies, I'd turn around\n\n47:05.960 --> 47:07.320\n and prep them for sale.\n\n47:07.320 --> 47:11.500\n I'd take a company and grow it from a regional to a national to a global presence.\n\n47:11.500 --> 47:16.400\n I did this in the automotive manufacturing, aerospace manufacturing, high tech, heavy\n\n47:16.400 --> 47:21.440\n industry and I had a house with a white picket fence.\n\n47:21.440 --> 47:25.160\n I was a successful athlete with all time world records.\n\n47:25.160 --> 47:33.040\n I owned a gym on the side where I coached people and I had a comfortable marriage that\n\n47:33.040 --> 47:40.880\n everything was hunky dory with no arguments at home and I walked away from all of it.\n\n47:40.880 --> 47:45.160\n I left everything behind except for my kids.\n\n47:45.160 --> 47:56.320\n I wanted to chase what I was meant to do and chase what I was capable of doing.\n\n47:56.320 --> 48:06.620\n I wanted to become a better version of myself, but very intentfully and that's what I did.\n\n48:06.620 --> 48:11.920\n I sold, I had multiple homes, sold my homes.\n\n48:11.920 --> 48:19.480\n I cashed in all my retirement that I'd earned for 20, nearly 20 years and I lost all that.\n\n48:19.480 --> 48:25.160\n I leveraged myself millions of dollars of personal debt so that if I failed, there was\n\n48:25.160 --> 48:26.160\n no way out.\n\n48:26.160 --> 48:30.440\n Even going back to that old career that I did well, I'd be living in an apartment the\n\n48:30.440 --> 48:33.520\n rest of my life paying it off.\n\n48:33.520 --> 48:38.600\n Old question, people questioned me at the time because I had a comfortable, easy marriage\n\n48:38.600 --> 48:45.560\n and I chose to ask for a divorce and I ended up living in an apartment for a couple of\n\n48:45.560 --> 48:51.200\n years with no income, selling off every last thing that I had except for my two vehicles\n\n48:51.200 --> 49:01.000\n that I built and with my kids and I started my businesses to help people live a better\n\n49:01.000 --> 49:06.800\n quality of life, to get them out of pain, to help them live better through strength,\n\n49:06.800 --> 49:14.200\n to realize that stress, demand, those things, they don't have to be the thing that if you\n\n49:14.200 --> 49:18.200\n look back, made you had the bad back, made you have the bad deeds, but they do the opposite.\n\n49:18.200 --> 49:23.000\n They get you out of pain and then I started working my book to hit on those other things,\n\n49:23.000 --> 49:28.120\n the mental, the emotional, maybe even spiritual, I don't touch on that one too much in there,\n\n49:28.120 --> 49:35.960\n but it's all the same, that things that happen around you, to you, like maybe they're bad,\n\n49:35.960 --> 49:41.000\n I can't take away that, but why can't you use what you have of it to become a stronger\n\n49:41.000 --> 49:45.720\n and better person, to become more resilient, to be able to take the things that you don't\n\n49:45.720 --> 49:50.080\n know that are coming in the future and so this is very intentful and that's what the\n\n49:50.080 --> 49:52.880\n second long winded answer in your question here.\n\n49:52.880 --> 49:53.880\n The dragon.\n\n49:53.880 --> 49:54.880\n The dragon.\n\n49:54.880 --> 50:00.240\n The dragon is an Ouroboros and so it is, it circles my entire upper body, my shoulders,\n\n50:00.240 --> 50:04.640\n my back, my chest, everything, it's right here, there's this big dragon head and its\n\n50:04.640 --> 50:11.040\n tail is right there in its mouth that's eating itself and it may sound a bit graphic or whatever,\n\n50:11.040 --> 50:17.560\n but it is, it's the eating of the old becoming the new, it is the purposeful reinvention\n\n50:17.560 --> 50:23.900\n of oneself, it is the deciding, not realizing just your potential, but deciding specifically\n\n50:23.900 --> 50:29.360\n who you want to be in this fucking world and becoming that person.\n\n50:29.360 --> 50:39.520\n Can you comment on the value and the power of putting a flame to your old life, your\n\n50:39.520 --> 50:47.120\n old self, just destroying all of it as you walk into the new life, did you have to do\n\n50:47.120 --> 50:48.120\n that?\n\n50:48.120 --> 50:53.040\n I don't recommend this, by the way, because when you put yourself in no way out, there\n\n50:53.040 --> 50:57.480\n is no way out, okay?\n\n50:57.480 --> 51:07.720\n You got to really, but I can be an overconfident individual at times and I live through extremes.\n\n51:07.720 --> 51:13.880\n I think it's a great way of actually finding your real values and how you want to live,\n\n51:13.880 --> 51:20.280\n honestly, to chase having absolutely perfect squat technique, but chase putting every freaking\n\n51:20.280 --> 51:24.880\n thing that you've got in it, which most people would say, those are opposite, those are diametrically\n\n51:24.880 --> 51:27.080\n opposed.\n\n51:27.080 --> 51:36.040\n I wanted a better home life, I wanted to do more in the world through my work and the\n\n51:36.040 --> 51:41.640\n burning the bridges mentality is not necessarily the best.\n\n51:41.640 --> 51:47.320\n There was some temperament in that though, because I was slow to make the shift for a\n\n51:47.320 --> 51:51.320\n long time because I'd been thinking about doing it, but I was thinking about doing it\n\n51:51.320 --> 51:52.320\n in a healthcare perspective.\n\n51:52.320 --> 51:55.820\n I'm going to go back to school to be a surgeon or a physical therapist or a Cairo because\n\n51:55.820 --> 52:02.120\n that's where all my research and stuff was in this human movement and rehab and recovery.\n\n52:02.120 --> 52:06.800\n This is the mentors that I've been developing were the best in the world in these things,\n\n52:06.800 --> 52:15.040\n in these disciplines, those were my friends, but I wasn't able to compromise my family's\n\n52:15.040 --> 52:16.040\n certain quality of life.\n\n52:16.040 --> 52:17.040\n I wanted to keep that.\n\n52:17.040 --> 52:22.480\n So it was slow and hard for me to make that transition, but I didn't do it until I had\n\n52:22.480 --> 52:26.960\n a platform built enough that those first few years I did have an income, I was able to\n\n52:26.960 --> 52:31.440\n make enough from the business until it grew so fast that I needed so much more needed\n\n52:31.440 --> 52:32.440\n to come in.\n\n52:32.440 --> 52:36.560\n The living in the apartment piece and doing all that, that was actually a couple of years\n\n52:36.560 --> 52:39.160\n into that process, maybe like two years.\n\n52:39.160 --> 52:41.160\n I'm with you on that.\n\n52:41.160 --> 52:44.200\n So I'm actually going through that very process now.\n\n52:44.200 --> 52:51.200\n I put everything, I quit everything, gave away everything and starting a new and unfortunately\n\n52:51.200 --> 52:57.000\n or fortunately this podcast somehow became quite popular.\n\n52:57.000 --> 53:01.520\n So it's getting in the way of my burning everything to the ground.\n\n53:01.520 --> 53:03.980\n But in that it's a source of joy.\n\n53:03.980 --> 53:10.000\n But the main thing I'm after is the similar project as you is building a business sense\n\n53:10.000 --> 53:11.000\n of joy.\n\n53:11.000 --> 53:15.880\n So this, this is the point I want to drive home right now, right now.\n\n53:15.880 --> 53:21.840\n Because when I say burn, I learned that burning the bridges works because that's how I had\n\n53:21.840 --> 53:23.800\n to succeed when I was earlier.\n\n53:23.800 --> 53:24.800\n The bridges weren't burnt.\n\n53:24.800 --> 53:26.120\n They didn't exist.\n\n53:26.120 --> 53:27.760\n There was no couch to go home to.\n\n53:27.760 --> 53:31.960\n There was no, there was no fall back plan and it forced me and gave me the confidence\n\n53:31.960 --> 53:34.760\n to know that I can pull it off.\n\n53:34.760 --> 53:39.640\n But I don't encourage people because there's so much out there of this hustle porn and\n\n53:39.640 --> 53:44.320\n other stuff going just grind, just go after it, get in and start your, like you'll get\n\n53:44.320 --> 53:49.200\n there and it's all about the output to make money, to be somebody, to do this.\n\n53:49.200 --> 53:52.840\n And I'll tell you what, that is some short term motivation right there.\n\n53:52.840 --> 53:54.560\n I feel like dropping a few swear words, but\n\n53:54.560 --> 53:57.560\n You're always welcome.\n\n53:57.560 --> 54:03.520\n We've already done a few, so we'll bounce it out.\n\n54:03.520 --> 54:04.920\n That is short term.\n\n54:04.920 --> 54:06.920\n That is not going to keep you going.\n\n54:06.920 --> 54:11.760\n This need, if you're going to go that approach, it needs to be because this is your North\n\n54:11.760 --> 54:12.760\n star.\n\n54:12.760 --> 54:14.460\n There's going to be so much hard work.\n\n54:14.460 --> 54:19.240\n There's going to be years of just pushing through where your question, not only is everybody\n\n54:19.240 --> 54:23.000\n around you questioning you and your family's questioning you, you're questioning yourself\n\n54:23.000 --> 54:25.680\n going, man, I don't know if I can pull this off.\n\n54:25.680 --> 54:26.680\n You're going to be stressed.\n\n54:26.680 --> 54:28.200\n You're going to be pulled to the max.\n\n54:28.200 --> 54:30.840\n If somebody comes up to me and says, should I start a business?\n\n54:30.840 --> 54:34.320\n I'm going to say no.\n\n54:34.320 --> 54:36.160\n And oh, you're supposed to motivate me.\n\n54:36.160 --> 54:39.560\n If you need me to motivate you, this is the wrong damn approach for you.\n\n54:39.560 --> 54:40.560\n This is going to be hard.\n\n54:40.560 --> 54:45.500\n This is going to be harder than you expect, even with me telling you this.\n\n54:45.500 --> 54:49.880\n And so it better damn well be worth it.\n\n54:49.880 --> 54:52.080\n This better be your North fucking star.\n\n54:52.080 --> 54:59.440\n This better live and be a way for you to be able to articulate or realize those values\n\n54:59.440 --> 55:01.960\n that you want to live.\n\n55:01.960 --> 55:04.300\n This isn't something to make money.\n\n55:04.300 --> 55:09.640\n This is a way for you to live the life and be able to share the values that you have\n\n55:09.640 --> 55:11.520\n with the world.\n\n55:11.520 --> 55:12.520\n And that's what it is.\n\n55:12.520 --> 55:20.520\n And if you don't have that, which is going to give you joy, then we can walk away.\n\n55:20.520 --> 55:23.000\n This is not some way to make some money and be known.\n\n55:23.000 --> 55:29.880\n I mean, this, this includes both like simple day to day joy and also deep meaning the whole\n\n55:29.880 --> 55:30.880\n thing.\n\n55:30.880 --> 55:34.320\n It allows you to overcome all the, all the pain along the way.\n\n55:34.320 --> 55:40.400\n But I got to say, I mean, it's a difficult thing because you run a business.\n\n55:40.400 --> 55:46.560\n This podcast and a lot of things I do research wise is full of joy, but it's simple.\n\n55:46.560 --> 55:51.120\n Running a business is hard.\n\n55:51.120 --> 55:58.520\n So it's something that I'm very hesitant about in that to almost push back a little bit.\n\n55:58.520 --> 56:06.920\n I think if I do get the guts to start the business, it will not be because I'm not choosing\n\n56:06.920 --> 56:11.360\n a more joyful life because I'm already truly happy.\n\n56:11.360 --> 56:14.640\n The reason I'll choose is because I just can't help it.\n\n56:14.640 --> 56:19.920\n There's this, I've always had this dream and I know it's going to lead to suffering and\n\n56:19.920 --> 56:24.480\n I know it's going to be a life that has less happiness in it.\n\n56:24.480 --> 56:32.200\n As sad as this to say, but it won't be, it won't be less happiness because we talk about\n\n56:32.200 --> 56:36.340\n this cup and where you choose to pour it and what you choose to do with it.\n\n56:36.340 --> 56:41.000\n And when you look back on things, the things that are going to give you the most joy, the\n\n56:41.000 --> 56:45.360\n most proud, the things that are going to stand out in your life that you really remember\n\n56:45.360 --> 56:51.180\n are going to be those days and your, those years you struggle, you're going to look back\n\n56:51.180 --> 56:57.480\n on 10 years later and go, fuck, those were the glory days.\n\n56:57.480 --> 56:59.920\n Those were the glory days.\n\n56:59.920 --> 57:02.720\n And it won't feel like it at the time.\n\n57:02.720 --> 57:04.820\n So that's what life's made of.\n\n57:04.820 --> 57:07.120\n And so this is your, this is your opportunity.\n\n57:07.120 --> 57:08.120\n You feel that.\n\n57:08.120 --> 57:11.920\n So right now you've got this, when you think about it, you've got this little thing twisting\n\n57:11.920 --> 57:12.920\n up in your gut, right?\n\n57:12.920 --> 57:19.840\n It's like, it's a mixture of anxiety and fear as well as excitement in that is that's your\n\n57:19.840 --> 57:24.120\n signal that this is your opportunity for that personal growth, the challenge yourself.\n\n57:24.120 --> 57:27.080\n This is your going for a run or working out in the heat.\n\n57:27.080 --> 57:29.080\n It's it's those things.\n\n57:29.080 --> 57:32.380\n It is your opportunity to go back.\n\n57:32.380 --> 57:33.860\n Maybe it even fails.\n\n57:33.860 --> 57:39.600\n Maybe it even fails, but by turning into that, you're going to learn so much and it's going\n\n57:39.600 --> 57:41.760\n to make you so much better.\n\n57:41.760 --> 57:47.320\n And it's the path that you should take when you have this stuff rolling around in there.\n\n57:47.320 --> 57:53.080\n And I don't, it could just be a hard conversation with your partner or your boss.\n\n57:53.080 --> 57:59.680\n It could be taking on a project that, you know, you know, that your boss has thrown\n\n57:59.680 --> 58:01.600\n out to the team and you're like, Oh, I'm going to hide in the back.\n\n58:01.600 --> 58:02.600\n I don't want that one.\n\n58:02.600 --> 58:05.800\n And it's like, maybe, maybe you do.\n\n58:05.800 --> 58:08.400\n Maybe it's going back to school.\n\n58:08.400 --> 58:11.800\n Maybe it's making that career move that you always wanted, but you're just a, you're just\n\n58:11.800 --> 58:16.360\n afraid of all these things.\n\n58:16.360 --> 58:21.520\n Those are your opportunity for you to turn into that.\n\n58:21.520 --> 58:22.520\n It is your workout.\n\n58:22.520 --> 58:28.000\n It is your practice because if you don't, you'll get soft and who knows what's coming\n\n58:28.000 --> 58:30.120\n and you're not going to be ready for it.\n\n58:30.120 --> 58:35.120\n And it's going to run right over the top of you because you're going to be weak.\n\n58:35.120 --> 58:37.200\n You're going to be soft.\n\n58:37.200 --> 58:42.440\n There's some aspect in which choosing that hard path is actually the, the way to arrive\n\n58:42.440 --> 58:48.060\n at the richest kind of happiness, the greatest fulfillment.\n\n58:48.060 --> 58:50.040\n That's the funny thing about just the human.\n\n58:50.040 --> 58:53.120\n Just make sure you're filling the cup as you're going through it and not pouring it all out.\n\n58:53.120 --> 58:56.200\n So that's the part to figure out, right?\n\n58:56.200 --> 58:57.200\n Sure.\n\n58:57.200 --> 58:58.960\n Well, life is short anyway.\n\n58:58.960 --> 59:03.440\n Eventually, eventually the cup will be empty.\n\n59:03.440 --> 59:09.920\n So maybe time the refilling of the cup correctly so you maximize the little time you got.\n\n59:09.920 --> 59:15.040\n Let me talk to you about strength a little bit first, high level.\n\n59:15.040 --> 59:17.320\n What are the differences in the different disciplines of strength?\n\n59:17.320 --> 59:22.680\n So power lifting, we talked about maybe just to clarify for people, power lifting, Olympic\n\n59:22.680 --> 59:29.920\n lifting, just regular gym fitness, bodybuilding, doing curls in front of the mirror for hours\n\n59:29.920 --> 59:30.920\n like I do.\n\n59:30.920 --> 59:32.920\n What's, what's the difference between all of these?\n\n59:32.920 --> 59:35.200\n Oh, and also strong man.\n\n59:35.200 --> 59:42.080\n Every one of those, as far as the athletic disciplines are different qualities.\n\n59:42.080 --> 59:45.040\n So we want to think about things as terms of quality.\n\n59:45.040 --> 59:53.920\n So there's strength, there's power, there's endurance, there's the ability to be coordinated\n\n59:53.920 --> 59:55.120\n and athletic.\n\n59:55.120 --> 59:58.180\n There's all these things and they're different, they're different qualities.\n\n59:58.180 --> 1:00:05.600\n So your training as it relates to that is how you cycle in the development of those qualities.\n\n1:00:05.600 --> 1:00:09.720\n What we want to think about is there's a lot of different frames of thought, some very\n\n1:00:09.720 --> 1:00:14.040\n classical, maybe not classical Russian approach because there's a lot of different approach\n\n1:00:14.040 --> 1:00:19.140\n from the Eastern block, but one of the ones is developing all the qualities at once, focusing\n\n1:00:19.140 --> 1:00:26.480\n on building those more of a periodization effect would be focusing on one quality at\n\n1:00:26.480 --> 1:00:32.220\n a time or one quality while maintaining other qualities and then shifting that around.\n\n1:00:32.220 --> 1:00:37.120\n So it's just going to be a little different based on what the output is and what the desired.\n\n1:00:37.120 --> 1:00:40.640\n So like powerlifting is actually, power is the wrong word.\n\n1:00:40.640 --> 1:00:42.080\n There's actually no power in it.\n\n1:00:42.080 --> 1:00:48.600\n It's just brute, it's, it's strength, um, application of force, um, Olympic lifting\n\n1:00:48.600 --> 1:00:55.000\n would actually be a better name for powerlifting because that is more explosive development.\n\n1:00:55.000 --> 1:01:00.000\n There's um, strongman is again, now we're getting a little bit more athletic.\n\n1:01:00.000 --> 1:01:04.360\n It's equipment based on the implements and stuff that are used, how fast you can move\n\n1:01:04.360 --> 1:01:09.980\n your feet and run mixed with more endurance, but still very strength focused.\n\n1:01:09.980 --> 1:01:11.600\n And there's some things with strongman that is straight.\n\n1:01:11.600 --> 1:01:18.100\n Like each one of these is very also focused on different genetic dispositions.\n\n1:01:18.100 --> 1:01:21.840\n So actually if you look at the history of sports, you'll find that they're a lot of\n\n1:01:21.840 --> 1:01:27.400\n times based on different populations and it sounds like it's very unPC, but like a Highland\n\n1:01:27.400 --> 1:01:31.260\n games, um, they've got deep, deeper hip sockets that are shallow.\n\n1:01:31.260 --> 1:01:35.200\n So you're going to see a lot of short hip hinge movements like the, the caber toss and\n\n1:01:35.200 --> 1:01:36.360\n things like that.\n\n1:01:36.360 --> 1:01:40.240\n Muay Thai wrestling, they've got a completely different hip joint.\n\n1:01:40.240 --> 1:01:43.780\n And so strongman itself is going to be for very large frame individuals.\n\n1:01:43.780 --> 1:01:47.800\n If you're not well over six foot and a large person, you're probably not going to perform\n\n1:01:47.800 --> 1:01:48.800\n well.\n\n1:01:48.800 --> 1:01:54.200\n It's sub six foot have ever done well at strongman just because it's, it's leverage based, right?\n\n1:01:54.200 --> 1:02:01.560\n Um, Olympic lifting, we see consistently in, in Europe, uh, the, the history tells us a\n\n1:02:01.560 --> 1:02:09.200\n high level of hip, uh, and back issues because of the depth that that hip socket has to go\n\n1:02:09.200 --> 1:02:11.780\n in to be able to complete that lift.\n\n1:02:11.780 --> 1:02:15.920\n And so you're going to see issues with populations that don't have the ability to do that.\n\n1:02:15.920 --> 1:02:20.280\n So, so we've talked a little bit about training as well as disposition.\n\n1:02:20.280 --> 1:02:21.280\n Yeah.\n\n1:02:21.280 --> 1:02:26.160\n So, and also cross head fits into that, that's more like strongman, but for a wider variety\n\n1:02:26.160 --> 1:02:27.440\n of bodies, I suppose.\n\n1:02:27.440 --> 1:02:28.440\n Yep.\n\n1:02:28.440 --> 1:02:32.000\n And definitely more metabolic conditioning focus than the, than the strength aspect of\n\n1:02:32.000 --> 1:02:33.000\n it.\n\n1:02:33.000 --> 1:02:36.600\n Um, and, and, and conditioning is an interesting thing too.\n\n1:02:36.600 --> 1:02:42.980\n So that quality in my opinion can be developed a lot faster, but kind of peaks much faster\n\n1:02:42.980 --> 1:02:43.980\n as well.\n\n1:02:43.980 --> 1:02:48.920\n Um, where strength, we can continue to add and add and add over time.\n\n1:02:48.920 --> 1:02:54.040\n Uh, so it's for me, like for conditioning with any strength athlete, I don't like to\n\n1:02:54.040 --> 1:02:56.080\n spend as much time on that.\n\n1:02:56.080 --> 1:03:01.720\n So I'll cycle, uh, the conditioning work for our strength athletes and then taper that\n\n1:03:01.720 --> 1:03:02.860\n off leading into meat.\n\n1:03:02.860 --> 1:03:07.240\n So the more metabolic work, that means the more capacity in strength training that you\n\n1:03:07.240 --> 1:03:12.340\n can accomplish, which is the goal, um, and recover from.\n\n1:03:12.340 --> 1:03:16.800\n But then as we lead to a competition, we want to spend more time on recovering from that.\n\n1:03:16.800 --> 1:03:17.800\n So we have to pull things out.\n\n1:03:17.800 --> 1:03:18.800\n So we'd pull out less.\n\n1:03:18.800 --> 1:03:25.880\n So like a typical approach would be like taking a six week cycle for conditioning and ramping,\n\n1:03:25.880 --> 1:03:30.120\n ramping up over three weeks periods time, then dropping back down again and ramping\n\n1:03:30.120 --> 1:03:34.680\n up and being slightly offset by like a week or two from your strength peaks so that you've\n\n1:03:34.680 --> 1:03:38.320\n actually tapered the week prior in your conditioning work to your strength work.\n\n1:03:38.320 --> 1:03:39.320\n Right.\n\n1:03:39.320 --> 1:03:43.800\n So we're not hitting conditioning hard all the time, which is a common, common, uh, misstep\n\n1:03:43.800 --> 1:03:46.040\n that people make is going, well, I need conditioning.\n\n1:03:46.040 --> 1:03:52.160\n So they just hammer that at a base level over the top instead of cycling that.\n\n1:03:52.160 --> 1:04:01.280\n If we talk about powerlifting in terms of regimen, in terms of exercise, in terms of\n\n1:04:01.280 --> 1:04:06.440\n the process, the wood consistent with what, is there something to be said about general\n\n1:04:06.440 --> 1:04:10.360\n qualities of the consistency of the regimen required to get strong?\n\n1:04:10.360 --> 1:04:11.360\n Yes.\n\n1:04:11.360 --> 1:04:16.400\n So let's talk about some training principles as a whole.\n\n1:04:16.400 --> 1:04:22.080\n And this will, I think this will break down what you're, what you're one, the more work\n\n1:04:22.080 --> 1:04:28.000\n that we can fit into a given time, the more progress we're going to make.\n\n1:04:28.000 --> 1:04:34.560\n But that doesn't mean doing the max amount of work possible at any given time.\n\n1:04:34.560 --> 1:04:39.720\n So we know that we're always to, to, to accomplish more, we're always going to have more.\n\n1:04:39.720 --> 1:04:42.440\n And there's a certain ceiling that you're going to hit that you're not going to be able\n\n1:04:42.440 --> 1:04:43.440\n to add more.\n\n1:04:43.440 --> 1:04:47.920\n So you want to start and get the most amount of results that you can with the least amount\n\n1:04:47.920 --> 1:04:54.160\n of work, because you're going to have to do it again, like this stair step over and over\n\n1:04:54.160 --> 1:04:56.600\n year, decade, so on.\n\n1:04:56.600 --> 1:05:01.720\n So when people is a big miss, people got, they look at a Chico program from Russia or\n\n1:05:01.720 --> 1:05:05.120\n so on and they go, I'm going to follow this.\n\n1:05:05.120 --> 1:05:09.800\n It's like that was specifically written for somebody with 20 years of experience that's\n\n1:05:09.800 --> 1:05:12.280\n already built the capacities to be at that level.\n\n1:05:12.280 --> 1:05:14.220\n So it's all about building that work capacity.\n\n1:05:14.220 --> 1:05:15.800\n So how much work can you give in a given time?\n\n1:05:15.800 --> 1:05:21.500\n So now we want to look at some research is it relates to injuries because injuries are\n\n1:05:21.500 --> 1:05:25.960\n going to be a big driver over time of what holds you back.\n\n1:05:25.960 --> 1:05:32.760\n So when we talk consistency, training hard for three years, five years, it's going to\n\n1:05:32.760 --> 1:05:33.760\n be really good.\n\n1:05:33.760 --> 1:05:37.560\n But what we find is a lot of people train really hard for nine months, have to slow\n\n1:05:37.560 --> 1:05:41.480\n back for a month, get back into it and miss another week because, and so on.\n\n1:05:41.480 --> 1:05:44.440\n They're always like this little nagging, that little nagging.\n\n1:05:44.440 --> 1:05:49.240\n And so it's pretty clear in the research we want to, we're looking at when we're stair\n\n1:05:49.240 --> 1:05:54.040\n stepping this stuff, we're looking at acute and chronic loading.\n\n1:05:54.040 --> 1:05:59.240\n So some fancy words for average and like what's happening right now.\n\n1:05:59.240 --> 1:06:04.000\n So this given week would be our acute, chronic would be what is our average loading let's\n\n1:06:04.000 --> 1:06:07.000\n say over the last six months.\n\n1:06:07.000 --> 1:06:11.720\n So the more that we can move the chronic loading up, the more work we're getting done on as\n\n1:06:11.720 --> 1:06:14.560\n a whole over time, we're going to get stronger.\n\n1:06:14.560 --> 1:06:20.760\n The way that we build the capacity to do that is having spikes in acute loading.\n\n1:06:20.760 --> 1:06:31.120\n Now as we do this, the, the acute loading, if it spikes more than 10, maybe 15% from\n\n1:06:31.120 --> 1:06:39.320\n what the chronic loading has been, that accounts for 80% of injuries out there.\n\n1:06:39.320 --> 1:06:44.800\n So it's not actually the movement quality or this misstep or the other may usually happens\n\n1:06:44.800 --> 1:06:48.840\n about four or five, six weeks later, it's like, Oh, this nagging and then it gets worse.\n\n1:06:48.840 --> 1:06:52.240\n And then now you got to, you got to do some rehab, your training sessions aren't as good\n\n1:06:52.240 --> 1:06:53.420\n and so on.\n\n1:06:53.420 --> 1:06:54.640\n So now we're starting to look at this.\n\n1:06:54.640 --> 1:06:55.640\n Okay.\n\n1:06:55.640 --> 1:06:59.160\n It's like, I want to do the, I want to do the least amount of work where I can still\n\n1:06:59.160 --> 1:07:00.800\n progress.\n\n1:07:00.800 --> 1:07:09.320\n I want to be able to have spikes in my weekly demand that don't go above 10 to 15% of what\n\n1:07:09.320 --> 1:07:11.320\n I've been averaging for the last month.\n\n1:07:11.320 --> 1:07:14.760\n But every time I do a spike, my, my average goes up, right?\n\n1:07:14.760 --> 1:07:16.760\n Boom, boom, boom.\n\n1:07:16.760 --> 1:07:20.880\n And then that becomes very particular also when you take, when you do take plantain time\n\n1:07:20.880 --> 1:07:21.880\n off.\n\n1:07:21.880 --> 1:07:25.600\n So a lot of people, uh, training session, maybe they're doing a five week block with\n\n1:07:25.600 --> 1:07:31.480\n a, uh, a deload week or you go on vacation for a week or any of those things that were\n\n1:07:31.480 --> 1:07:32.600\n a downward.\n\n1:07:32.600 --> 1:07:34.400\n What does that do to your average and chronic loading?\n\n1:07:34.400 --> 1:07:35.400\n It brings it down.\n\n1:07:35.400 --> 1:07:39.200\n And then what does the person want to do when they come back, make up for it.\n\n1:07:39.200 --> 1:07:43.640\n Now they have a huge spike above five weeks later, we're dealing with all this elbow,\n\n1:07:43.640 --> 1:07:47.760\n this wrist, whatever's kind of bothering me and now you're not performing as much.\n\n1:07:47.760 --> 1:07:52.240\n So these are some really fundamental pieces of, of, of, of training.\n\n1:07:52.240 --> 1:07:56.360\n And then now we can start overlaying the qualities that we're trying to develop that we were\n\n1:07:56.360 --> 1:07:57.360\n talking about earlier.\n\n1:07:57.360 --> 1:08:01.880\n So now it's, let's talk about my deadlift, my thousand pound deadlift.\n\n1:08:01.880 --> 1:08:06.080\n We'll talk about the training cycles for both the thousand deadlift and squat.\n\n1:08:06.080 --> 1:08:11.400\n So backing up a year out from the deadlift, knowing I was training at the time, heavy\n\n1:08:11.400 --> 1:08:16.960\n deadlifts once a week and usually it was two of those sessions a month were really heavy\n\n1:08:16.960 --> 1:08:17.960\n and the others weren't.\n\n1:08:17.960 --> 1:08:23.560\n And it's like, okay, how can we get this up to where I'm deadlifting twice a week?\n\n1:08:23.560 --> 1:08:26.880\n Because that's where I want to be, uh, to be able to accomplish this.\n\n1:08:26.880 --> 1:08:30.840\n I need to be loading about that much with frequency, with a certain volume to be able\n\n1:08:30.840 --> 1:08:31.840\n to accomplish this goal.\n\n1:08:31.840 --> 1:08:34.880\n We're not going to go through all the math and stuff like that and how that's arrived,\n\n1:08:34.880 --> 1:08:37.520\n but there is math behind this.\n\n1:08:37.520 --> 1:08:41.600\n And so instead of just like, oh, well, let's start deadlifting twice a week.\n\n1:08:41.600 --> 1:08:42.600\n No.\n\n1:08:42.600 --> 1:08:48.480\n So we start and we take the one session that we've got and we split it, part of it, take\n\n1:08:48.480 --> 1:08:50.920\n part of it away and put it in the second half of the week.\n\n1:08:50.920 --> 1:08:53.640\n So the total volume is still the same.\n\n1:08:53.640 --> 1:08:59.360\n And then, um, we start adding some volume, but I'm doing it at a off a block so that\n\n1:08:59.360 --> 1:09:03.760\n the actual load is accumulative load is less cause I have less range of motion.\n\n1:09:03.760 --> 1:09:04.760\n Okay.\n\n1:09:04.760 --> 1:09:08.440\n And then we start building that closer to the ground, closer to the ground and so on.\n\n1:09:08.440 --> 1:09:12.880\n And now we start getting to where I'm almost doing two sessions, full sessions a week.\n\n1:09:12.880 --> 1:09:16.340\n And then we start adding a little bit of load.\n\n1:09:16.340 --> 1:09:22.180\n And so at my level, this isn't talking about adding another set or another day a week.\n\n1:09:22.180 --> 1:09:29.440\n We're talking like in my squat, it might be one rep instead of doing three sets of three\n\n1:09:29.440 --> 1:09:37.020\n at one week, I do two doubles or two triples, then two doubles to give me one more rep.\n\n1:09:37.020 --> 1:09:38.020\n That's it.\n\n1:09:38.020 --> 1:09:40.600\n And so we're doing that from one week to the next.\n\n1:09:40.600 --> 1:09:41.600\n And that's a cycle training cycle.\n\n1:09:41.600 --> 1:09:45.360\n It might be five, six weeks and then so on and the next one and slowly bringing that\n\n1:09:45.360 --> 1:09:47.380\n average load up.\n\n1:09:47.380 --> 1:09:52.780\n So the last phases of the squat, for example, we took the average loading every week.\n\n1:09:52.780 --> 1:09:54.280\n So my, of my heavy sets.\n\n1:09:54.280 --> 1:10:01.400\n Once we developed all this stuff over the last year to get to this point, now it is\n\n1:10:01.400 --> 1:10:05.920\n taking and going, okay, my average load this week is eight reps at nine hundred and fifty\n\n1:10:05.920 --> 1:10:07.480\n five pounds.\n\n1:10:07.480 --> 1:10:13.360\n And then the next week, let's get it to nine, nine fifty seven, nine sixty three.\n\n1:10:13.360 --> 1:10:17.520\n And this was pretty aggressive working up to where my average loading the final that\n\n1:10:17.520 --> 1:10:22.120\n the final was nine hundred and eighty five pounds average load for eight to nine reps.\n\n1:10:22.120 --> 1:10:23.120\n And that's what I said.\n\n1:10:23.120 --> 1:10:24.120\n This is the intense part.\n\n1:10:24.120 --> 1:10:30.160\n This is the day of was much easier that week over week is pretty brutal.\n\n1:10:30.160 --> 1:10:32.280\n May not sound well, you're just squatting.\n\n1:10:32.280 --> 1:10:33.280\n And now let's back up.\n\n1:10:33.280 --> 1:10:34.820\n Let's look at the quality development.\n\n1:10:34.820 --> 1:10:40.240\n So a year out from the squat, obviously, I've been working on developing axial load capacity,\n\n1:10:40.240 --> 1:10:44.140\n my capacity to withstand load from top to bottom.\n\n1:10:44.140 --> 1:10:46.680\n So I like thinking about things and movement vectors.\n\n1:10:46.680 --> 1:10:52.340\n So this vector is an axial loaded vector is the hardest to recover from that was axial.\n\n1:10:52.340 --> 1:10:55.440\n Like is deadlift, are they both or both?\n\n1:10:55.440 --> 1:10:56.440\n Yep.\n\n1:10:56.440 --> 1:11:01.120\n So a horizontal front to back would be like a row or a press.\n\n1:11:01.120 --> 1:11:06.040\n Why is the axial hardest to recover because it's entire body, the entire entire body,\n\n1:11:06.040 --> 1:11:11.000\n just anything that is that taxes the the spinal mechanics?\n\n1:11:11.000 --> 1:11:14.160\n I don't I could tell you my beliefs.\n\n1:11:14.160 --> 1:11:15.160\n It's studied.\n\n1:11:15.160 --> 1:11:16.160\n It is.\n\n1:11:16.160 --> 1:11:20.040\n OK, we can just keep the discussion on that short like that.\n\n1:11:20.040 --> 1:11:24.800\n Well, so we start looking at those different vectors that we're training in.\n\n1:11:24.800 --> 1:11:27.640\n And so this is why this is important to understand.\n\n1:11:27.640 --> 1:11:29.480\n So I'm not just getting into nuance here.\n\n1:11:29.480 --> 1:11:34.400\n So, hey, squatting is going to make me make me jump further because it's legs.\n\n1:11:34.400 --> 1:11:40.520\n Well, squatting is an axial load vector and jumping is a vector this way.\n\n1:11:40.520 --> 1:11:46.640\n So actually, hip thrust would help with your and this is proven in science with your forward\n\n1:11:46.640 --> 1:11:48.420\n jumping ability.\n\n1:11:48.420 --> 1:11:49.920\n They're both working similar muscles.\n\n1:11:49.920 --> 1:11:54.160\n The glute extension, but they're working it in those different platforms.\n\n1:11:54.160 --> 1:11:57.200\n So it's really important to understand because people don't understand.\n\n1:11:57.200 --> 1:12:01.440\n I'm building my work capacity by doing sled process.\n\n1:12:01.440 --> 1:12:04.720\n You're not developing your work capacity for squatting.\n\n1:12:04.720 --> 1:12:11.440\n Most movements, even ones as holistic as a as a squat, require specialization.\n\n1:12:11.440 --> 1:12:12.440\n Yeah.\n\n1:12:12.440 --> 1:12:15.100\n You can't get strong at the squat by doing it.\n\n1:12:15.100 --> 1:12:18.040\n You're going to have some carry over, right, obviously.\n\n1:12:18.040 --> 1:12:22.760\n But because taking an untrained person that hasn't done it is still not going to do as\n\n1:12:22.760 --> 1:12:26.360\n good as somebody that's done nonspecific work, but done work.\n\n1:12:26.360 --> 1:12:30.600\n So but yes, for the most part, to get truly strong, you need to specialize.\n\n1:12:30.600 --> 1:12:33.020\n So but not all the time.\n\n1:12:33.020 --> 1:12:34.480\n So now we talk about quality.\n\n1:12:34.480 --> 1:12:39.120\n So and if we specialize in the same thing too long, we stagnate because the body adapts\n\n1:12:39.120 --> 1:12:41.920\n to a certain point and just can't make progress.\n\n1:12:41.920 --> 1:12:46.720\n So we wanted to save the actual squatting in the pattern with the bar that I was doing\n\n1:12:46.720 --> 1:12:48.680\n for the very end.\n\n1:12:48.680 --> 1:12:55.080\n So starting a year out, I started doing work front squatting like a squat axial loaded\n\n1:12:55.080 --> 1:12:58.440\n pattern and worked on maximizing that up.\n\n1:12:58.440 --> 1:13:03.080\n Then I started shifting to doing transformer bar squat.\n\n1:13:03.080 --> 1:13:06.580\n It's this bar I developed that actually change manipulates spinal mechanics.\n\n1:13:06.580 --> 1:13:10.680\n So I started loading in these more forward positions and being able again.\n\n1:13:10.680 --> 1:13:13.960\n So now I'm getting closer than a front squat, but not quite squatting.\n\n1:13:13.960 --> 1:13:18.420\n And then I would start adjusting that bar every training cycle to closer to a squat\n\n1:13:18.420 --> 1:13:21.080\n toaster to a squat till it finally was right.\n\n1:13:21.080 --> 1:13:25.080\n What's the difference between a front squat and a regular like a back squat?\n\n1:13:25.080 --> 1:13:30.480\n Like in terms of the stress on the body, the mechanics, was there something interesting\n\n1:13:30.480 --> 1:13:34.160\n to be said about like how fundamentally different are they?\n\n1:13:34.160 --> 1:13:35.340\n So it's interesting.\n\n1:13:35.340 --> 1:13:38.920\n People think about the weight and imposition to them like, oh, the bars in front of me,\n\n1:13:38.920 --> 1:13:42.480\n the bars behind me, which is not the case.\n\n1:13:42.480 --> 1:13:45.160\n The bar is above your midfoot.\n\n1:13:45.160 --> 1:13:48.280\n The load is above your midfoot.\n\n1:13:48.280 --> 1:13:52.360\n So we're actually manipulating the spine behind the bar.\n\n1:13:52.360 --> 1:13:56.440\n So we're causing spinal uprighting behind the bar, getting in a more erect position,\n\n1:13:56.440 --> 1:13:59.640\n which is going to change the relationship of the hip angle.\n\n1:13:59.640 --> 1:14:02.320\n It's going to change our ability to maintain the spine.\n\n1:14:02.320 --> 1:14:08.840\n It's going to change how much the core comes in, how hard it is to maintain that sternum\n\n1:14:08.840 --> 1:14:11.360\n to diaphragm relationship that we talked about.\n\n1:14:11.360 --> 1:14:12.680\n All this stuff starts changing.\n\n1:14:12.680 --> 1:14:14.760\n So the bar stays in the same place.\n\n1:14:14.760 --> 1:14:17.920\n Bar is still behind you, but the load moves around.\n\n1:14:17.920 --> 1:14:21.240\n But we're actually manipulating the spine around the load.\n\n1:14:21.240 --> 1:14:22.240\n Yeah.\n\n1:14:22.240 --> 1:14:23.240\n It's incredible.\n\n1:14:23.240 --> 1:14:27.160\n We can tailor it to an athlete, which is great when you got a seven foot plus tall baseball\n\n1:14:27.160 --> 1:14:28.800\n player or basketball player.\n\n1:14:28.800 --> 1:14:30.240\n That's why we work with all these teams.\n\n1:14:30.240 --> 1:14:33.520\n Anyway, so it's like you're taking something and getting closer and closer to it.\n\n1:14:33.520 --> 1:14:35.340\n At the same time, we're looking at the quality.\n\n1:14:35.340 --> 1:14:39.260\n So like I needed to be able to really hold this torso position with the weight moving\n\n1:14:39.260 --> 1:14:40.260\n up here.\n\n1:14:40.260 --> 1:14:45.240\n Unlike the deadlift, the ability to manage this TL position becomes much more challenging.\n\n1:14:45.240 --> 1:14:50.080\n So that was also why I was choosing the transformer bar, because it actually challenges that more\n\n1:14:50.080 --> 1:14:51.680\n in those big forward positions.\n\n1:14:51.680 --> 1:14:56.920\n I was also working on my back strength tremendously to be able to hold the maintain position.\n\n1:14:56.920 --> 1:15:00.580\n So there was a lot of like I chose a bent over rows.\n\n1:15:00.580 --> 1:15:02.380\n So bent over row is a mixed vector.\n\n1:15:02.380 --> 1:15:03.720\n So it's a forward to back.\n\n1:15:03.720 --> 1:15:09.280\n So it wouldn't have as much carrier, but it's also got some axial loading component in it\n\n1:15:09.280 --> 1:15:10.640\n as well.\n\n1:15:10.640 --> 1:15:12.360\n So we're working on that.\n\n1:15:12.360 --> 1:15:15.920\n And then as we get closer and closer to competition, I'm developing those strengths.\n\n1:15:15.920 --> 1:15:18.180\n But now I need to start tapering those out.\n\n1:15:18.180 --> 1:15:22.520\n So all of my recovery needs can now go into the more specific that I'm actually ramping\n\n1:15:22.520 --> 1:15:24.160\n the load up.\n\n1:15:24.160 --> 1:15:29.320\n So as I'm ramping the load on the weight, I'm able to ramp it a lot faster because I'm\n\n1:15:29.320 --> 1:15:30.840\n tapering out the other stuff.\n\n1:15:30.840 --> 1:15:37.600\n So I can still keep my total load high, but now get it very, very specific.\n\n1:15:37.600 --> 1:15:41.200\n So everything that I've done has always been kind of an annual training cycle.\n\n1:15:41.200 --> 1:15:44.800\n And then again, this was like this was a five year training cycle, but we just kind of walked\n\n1:15:44.800 --> 1:15:50.000\n through the last year of each and you can see how these concepts play out in reality.\n\n1:15:50.000 --> 1:15:51.760\n So in the cycling.\n\n1:15:51.760 --> 1:15:58.640\n So this is both for you, but also for more recreational strength athletes.\n\n1:15:58.640 --> 1:16:01.480\n Let's say there's variety injected into this.\n\n1:16:01.480 --> 1:16:02.760\n You need variety.\n\n1:16:02.760 --> 1:16:03.760\n Yeah.\n\n1:16:03.760 --> 1:16:04.760\n Yeah.\n\n1:16:04.760 --> 1:16:07.800\n So you will basically stagnate at some level, right?\n\n1:16:07.800 --> 1:16:10.600\n So you should always be kind of shifting a little bit.\n\n1:16:10.600 --> 1:16:16.920\n So three to four month blocks in general for an average, you know, just a gen pop fitness\n\n1:16:16.920 --> 1:16:22.040\n is pretty good where you're going to spend more time maybe in a higher rep range or lower\n\n1:16:22.040 --> 1:16:27.000\n rep range, a little bit more work on endurance capacity or maybe some more time.\n\n1:16:27.000 --> 1:16:30.280\n Hey, I'm playing around with boxing or jujitsu or something like that.\n\n1:16:30.280 --> 1:16:33.280\n Bring that a little bit more to the front for a while and bring the other out.\n\n1:16:33.280 --> 1:16:38.320\n But like mixing mixing those variables up, but trying to keep the total load the same\n\n1:16:38.320 --> 1:16:41.200\n and always kind of like, you know, do we add a little more?\n\n1:16:41.200 --> 1:16:43.640\n Again, it doesn't have to be major and it shouldn't be major.\n\n1:16:43.640 --> 1:16:44.740\n You don't want these big jumps.\n\n1:16:44.740 --> 1:16:48.280\n You don't go, oh, my God, let's move.\n\n1:16:48.280 --> 1:16:51.520\n Let's jump into squatting every day.\n\n1:16:51.520 --> 1:16:54.360\n You've got to build the capacity to do that.\n\n1:16:54.360 --> 1:16:55.960\n It's simple.\n\n1:16:55.960 --> 1:17:01.760\n What role would you say strength has in sports that combine skill and strength?\n\n1:17:01.760 --> 1:17:07.640\n So for me personally, maybe I'll just ask it selfishly, which is grappling, wrestling,\n\n1:17:07.640 --> 1:17:08.640\n MMA.\n\n1:17:08.640 --> 1:17:09.640\n Yeah.\n\n1:17:09.640 --> 1:17:12.640\n How about I start with baseball?\n\n1:17:12.640 --> 1:17:13.640\n Please.\n\n1:17:13.640 --> 1:17:14.640\n No.\n\n1:17:14.640 --> 1:17:15.640\n I will.\n\n1:17:15.640 --> 1:17:16.640\n OK.\n\n1:17:16.640 --> 1:17:17.640\n I know.\n\n1:17:17.640 --> 1:17:18.640\n The sport.\n\n1:17:18.640 --> 1:17:19.640\n OK.\n\n1:17:19.640 --> 1:17:20.640\n No.\n\n1:17:20.640 --> 1:17:21.640\n Baseball and golf are two of my favorite sports.\n\n1:17:21.640 --> 1:17:22.640\n Oh, no.\n\n1:17:22.640 --> 1:17:23.640\n I don't.\n\n1:17:23.640 --> 1:17:25.800\n You don't have to be in shape at all to excel at those sports.\n\n1:17:25.800 --> 1:17:26.800\n Well, here's the thing.\n\n1:17:26.800 --> 1:17:27.800\n There we go.\n\n1:17:27.800 --> 1:17:28.800\n It doesn't help.\n\n1:17:28.800 --> 1:17:29.800\n I'm going to get this argument.\n\n1:17:29.800 --> 1:17:34.320\n Well, I've got a perfect example, because this is why I sell so many Transformer bars\n\n1:17:34.320 --> 1:17:36.340\n into the Major League Baseball.\n\n1:17:36.340 --> 1:17:42.320\n So they get these people that come in, these athletes, that have been baseball their whole\n\n1:17:42.320 --> 1:17:43.320\n life.\n\n1:17:43.320 --> 1:17:44.780\n It is part of the culture.\n\n1:17:44.780 --> 1:17:46.400\n And so they're great athletes.\n\n1:17:46.400 --> 1:17:47.920\n They've got all this skill.\n\n1:17:47.920 --> 1:17:53.520\n The only thing they have to do is develop a little bit more resilience so that they\n\n1:17:53.520 --> 1:17:54.760\n don't have the injury.\n\n1:17:54.760 --> 1:17:58.720\n They can push their training a little bit more, that they can add a little bit more\n\n1:17:58.720 --> 1:18:01.760\n force output and be able to recover from it.\n\n1:18:01.760 --> 1:18:04.860\n So the only thing they've got to do is add some training.\n\n1:18:04.860 --> 1:18:08.480\n But there's no training culture there, so they don't have any experience, which is why\n\n1:18:08.480 --> 1:18:11.900\n they love the Transformer bar, because they don't have to worry about teaching the technique.\n\n1:18:11.900 --> 1:18:15.200\n We can actually set the bar on a setting that makes their squats perfect by cueing all the\n\n1:18:15.200 --> 1:18:17.380\n stuff with actually not having to coach it.\n\n1:18:17.380 --> 1:18:21.020\n Because when you're coaching a roomful of athletes, it's really hard to teach the nuance\n\n1:18:21.020 --> 1:18:23.000\n of all this and not sure that all that.\n\n1:18:23.000 --> 1:18:27.400\n But that's all that they have to do with these players with a huge level of skill.\n\n1:18:27.400 --> 1:18:35.520\n So once you reach a certain level of skill, adding strength is the only real forward path.\n\n1:18:35.520 --> 1:18:39.640\n So that's the basic, simple answer to that.\n\n1:18:39.640 --> 1:18:42.600\n So one of the benefits there being injury prevention, actually.\n\n1:18:42.600 --> 1:18:43.600\n Injury prevention.\n\n1:18:43.600 --> 1:18:44.600\n Resilience.\n\n1:18:44.600 --> 1:18:49.320\n Because especially fighting sports, you're going to be challenged and thrown and other\n\n1:18:49.320 --> 1:18:50.640\n things happen to you.\n\n1:18:50.640 --> 1:18:54.760\n And the more resilient you can make your structures, the better you're going to be.\n\n1:18:54.760 --> 1:18:57.080\n Even a cyclist, mountain biking.\n\n1:18:57.080 --> 1:18:58.080\n Why would they need it?\n\n1:18:58.080 --> 1:18:59.480\n Why would they need to do upper body training?\n\n1:18:59.480 --> 1:19:02.240\n Take a crash, your shoulder's gone.\n\n1:19:02.240 --> 1:19:03.240\n You're done.\n\n1:19:03.240 --> 1:19:04.240\n Your career's over.\n\n1:19:04.240 --> 1:19:07.560\n Unless you've done a little training.\n\n1:19:07.560 --> 1:19:09.120\n So there's value in all this stuff.\n\n1:19:09.120 --> 1:19:12.400\n But the resilience, that's huge.\n\n1:19:12.400 --> 1:19:15.000\n And then we can overlay strength.\n\n1:19:15.000 --> 1:19:19.880\n Where we miss is this focus on strength when we haven't developed quality motor patterns\n\n1:19:19.880 --> 1:19:20.880\n first.\n\n1:19:20.880 --> 1:19:23.880\n So this is a huge thing with children.\n\n1:19:23.880 --> 1:19:26.880\n Because people want to know what's the appropriate training age.\n\n1:19:26.880 --> 1:19:29.800\n I'd have had my daughter training before my son.\n\n1:19:29.800 --> 1:19:33.340\n Because she developed movement patterns that have better quality earlier.\n\n1:19:33.340 --> 1:19:34.340\n There's no age.\n\n1:19:34.340 --> 1:19:37.280\n Because it's going to be very dependent on the individual.\n\n1:19:37.280 --> 1:19:41.240\n There's no point in having adaptation if we don't have the right thing to adapt to yet.\n\n1:19:41.240 --> 1:19:44.120\n And that applies to general movement, but also to sport.\n\n1:19:44.120 --> 1:19:47.680\n You're saying the skills should be developed first and then the strength applied on top\n\n1:19:47.680 --> 1:19:48.680\n of that.\n\n1:19:48.680 --> 1:19:49.680\n Yep.\n\n1:19:49.680 --> 1:19:56.520\n Maybe you can educate me, but I actually quit lifting and powerlifting for a long time\n\n1:19:56.520 --> 1:20:05.520\n after I started Judo, Jiu Jitsu, grappling, all this sort of combat sports.\n\n1:20:05.520 --> 1:20:15.520\n Because I found that it was preventing me from relaxing my body enough to load in the\n\n1:20:15.520 --> 1:20:17.300\n skill.\n\n1:20:17.300 --> 1:20:20.920\n So this isn't a problem with the training.\n\n1:20:20.920 --> 1:20:22.960\n This is a problem with you.\n\n1:20:22.960 --> 1:20:25.840\n So this is actually really, really important.\n\n1:20:25.840 --> 1:20:33.560\n The first product I ever released was a loadable mace, a swinging mace.\n\n1:20:33.560 --> 1:20:38.440\n And because every power lifter and body, well, not every, but most serious power lifters\n\n1:20:38.440 --> 1:20:44.480\n and bodybuilders, like shoulders, mobility is pretty limited.\n\n1:20:44.480 --> 1:20:47.440\n And most of them really, really struggle with this.\n\n1:20:47.440 --> 1:20:52.800\n The problem is they've been taught to have tension all the time.\n\n1:20:52.800 --> 1:20:53.920\n And that's not good.\n\n1:20:53.920 --> 1:20:57.300\n So when we talk about the joint positions that we were talking about earlier and having\n\n1:20:57.300 --> 1:21:03.840\n those and the muscles in the right length and tension relationship, athleticism is the\n\n1:21:03.840 --> 1:21:11.080\n speed to relaxation because the counter is speed to contraction.\n\n1:21:11.080 --> 1:21:14.600\n Float like a butterfly, sting like a bee.\n\n1:21:14.600 --> 1:21:20.120\n And so what a mace can do is use that because this ties back into a developmental kinesiology\n\n1:21:20.120 --> 1:21:24.760\n because a lot of like reset patterns are getting back into these basic movements, but it's\n\n1:21:24.760 --> 1:21:28.920\n as much about relaxation as it is contraction.\n\n1:21:28.920 --> 1:21:32.500\n So a mace, we have this weight on a big long lever.\n\n1:21:32.500 --> 1:21:36.440\n So if I grab a kettlebell and this would be like the same movement as a kettlebell halo,\n\n1:21:36.440 --> 1:21:42.840\n it is the same movement as a, but here in the halo, I'm on the whole time with the mace\n\n1:21:42.840 --> 1:21:47.640\n at the proper length, with the right distribution, you cannot do the movement.\n\n1:21:47.640 --> 1:21:50.320\n You could not move force your way through it.\n\n1:21:50.320 --> 1:21:55.000\n The only way that you can accomplish that is by relaxing.\n\n1:21:55.000 --> 1:22:00.840\n And then now we, now we can contract all the muscles related around that shoulder girdle\n\n1:22:00.840 --> 1:22:01.980\n all at once.\n\n1:22:01.980 --> 1:22:06.800\n We're working on, off, on, off, on, off with moving and contracting.\n\n1:22:06.800 --> 1:22:11.880\n And now, so what happens a lot of times as we, you know, this stiffness and tightness\n\n1:22:11.880 --> 1:22:12.880\n happens.\n\n1:22:12.880 --> 1:22:17.880\n So in four positions, we start using stabilizer muscles to do the movement.\n\n1:22:17.880 --> 1:22:19.800\n And then that's where this stiffness come from.\n\n1:22:19.800 --> 1:22:24.960\n So it means that in some of whatever training that you're doing, there's a deficit in the\n\n1:22:24.960 --> 1:22:27.660\n movement quality, okay.\n\n1:22:27.660 --> 1:22:31.680\n Or there's a deficit in the training program and you're not recovering from an 80% of the\n\n1:22:31.680 --> 1:22:32.680\n time.\n\n1:22:32.680 --> 1:22:33.680\n That's the right answer.\n\n1:22:33.680 --> 1:22:34.680\n Right.\n\n1:22:34.680 --> 1:22:39.440\n But yeah, that's where the, where the gap is and learning how to relax and the way a\n\n1:22:39.440 --> 1:22:43.460\n lot of the exercises are taught and have been taught for a long time, which is why there's\n\n1:22:43.460 --> 1:22:44.460\n a big gap.\n\n1:22:44.460 --> 1:22:49.200\n And this is why both clinical rehab and all these other components are mixed in my philosophy\n\n1:22:49.200 --> 1:22:53.760\n and what I'm trying to do with Kabuki strength, because I'm looking at holistic movement.\n\n1:22:53.760 --> 1:22:58.560\n I'm not looking at powerlifting based movements are what I want to load and be able to assess\n\n1:22:58.560 --> 1:23:00.680\n on.\n\n1:23:00.680 --> 1:23:07.240\n But this affects all sports, all activities and strength doesn't have to be that.\n\n1:23:07.240 --> 1:23:10.720\n I mean, I'm freaking a thousand pound squatter and deadlifter.\n\n1:23:10.720 --> 1:23:15.120\n If you watch any of my videos where I do like complete quad fallbacks, I don't stretch at\n\n1:23:15.120 --> 1:23:16.120\n all.\n\n1:23:16.120 --> 1:23:17.120\n I can usually get close to a full split.\n\n1:23:17.120 --> 1:23:18.120\n Like if I want to.\n\n1:23:18.120 --> 1:23:19.120\n What?\n\n1:23:19.120 --> 1:23:21.120\n No, I did not see those videos.\n\n1:23:21.120 --> 1:23:22.120\n Okay.\n\n1:23:22.120 --> 1:23:23.600\n That's, that's hard to believe.\n\n1:23:23.600 --> 1:23:24.600\n Wow.\n\n1:23:24.600 --> 1:23:25.600\n Okay.\n\n1:23:25.600 --> 1:23:26.600\n Well actually I do.\n\n1:23:26.600 --> 1:23:29.680\n I just did one recently, a quad fallback with my, with my mace loaded way out to the end\n\n1:23:29.680 --> 1:23:31.320\n torsioning on both ends of the other.\n\n1:23:31.320 --> 1:23:35.560\n And like I do a lot of, I do a lot of weird stuff.\n\n1:23:35.560 --> 1:23:36.560\n That's awesome.\n\n1:23:36.560 --> 1:23:39.480\n But squatting doesn't make your hips tight.\n\n1:23:39.480 --> 1:23:42.880\n Squatting like shit makes your hips tight.\n\n1:23:42.880 --> 1:23:48.720\n And so, but there is no perfect world where always our training program isn't quite perfect.\n\n1:23:48.720 --> 1:23:50.840\n Our movement isn't necessarily perfect.\n\n1:23:50.840 --> 1:23:52.840\n Like so you're going to have the needs for this stuff.\n\n1:23:52.840 --> 1:23:58.080\n But if you're always have to do some soft tissue work to loosen up the same one for\n\n1:23:58.080 --> 1:24:01.920\n that exercise, to be able to get a joint in position, there is a problem.\n\n1:24:01.920 --> 1:24:05.240\n And I'm not saying don't do it, do it because I don't want you to have a joint.\n\n1:24:05.240 --> 1:24:09.920\n Like if I can't get my shoulders in a position, I can't do overhead presses because I'm going\n\n1:24:09.920 --> 1:24:11.080\n to compromise my spine position.\n\n1:24:11.080 --> 1:24:12.760\n Then I'm going to end up with some other problems.\n\n1:24:12.760 --> 1:24:13.760\n Right?\n\n1:24:13.760 --> 1:24:18.920\n So go ahead and clean that up so you can get in position, but go figure out why it is and\n\n1:24:18.920 --> 1:24:20.460\n fix it.\n\n1:24:20.460 --> 1:24:23.440\n And then maybe next, you know, three, four months from now, they're going to get a little\n\n1:24:23.440 --> 1:24:29.200\n something else going on, fix it, but go understand the deeper root reason of why.\n\n1:24:29.200 --> 1:24:35.180\n So I'm, I believe I am the only company manufacturing and selling, you know, fascial soft tissue\n\n1:24:35.180 --> 1:24:36.180\n tools.\n\n1:24:36.180 --> 1:24:39.920\n And I'll tell you, I don't want you to use them.\n\n1:24:39.920 --> 1:24:43.880\n Cause it's not helping you get to the why, why it was caused in the first place.\n\n1:24:43.880 --> 1:24:44.880\n Yeah.\n\n1:24:44.880 --> 1:24:49.020\n The goal, the goal, the perfect state is not having to use them.\n\n1:24:49.020 --> 1:24:52.080\n Reality is you're going to have to use them from time to time because the world's not\n\n1:24:52.080 --> 1:24:53.080\n perfect.\n\n1:24:53.080 --> 1:24:54.080\n Yeah.\n\n1:24:54.080 --> 1:24:56.480\n So your discovery is a hundred percent on point.\n\n1:24:56.480 --> 1:25:02.920\n Well there's another side to combat sports when you're beginning a particular combat\n\n1:25:02.920 --> 1:25:10.200\n sport, strength can be a negative because human psychology, because you can get away\n\n1:25:10.200 --> 1:25:11.760\n with a lot when you're strong.\n\n1:25:11.760 --> 1:25:12.760\n Uh huh.\n\n1:25:12.760 --> 1:25:13.760\n Yes, you can.\n\n1:25:13.760 --> 1:25:19.680\n So if your mind is strong enough to where you can just turn off that advantage and be\n\n1:25:19.680 --> 1:25:23.800\n a beginner, truly in a particular art, that's probably the best way to do it.\n\n1:25:23.800 --> 1:25:26.000\n But you can get away and then you don't learn.\n\n1:25:26.000 --> 1:25:27.000\n Yeah.\n\n1:25:27.000 --> 1:25:28.000\n Yeah.\n\n1:25:28.000 --> 1:25:29.000\n It's hard.\n\n1:25:29.000 --> 1:25:35.560\n Uh, it's hard not to use the little advantages you have because like jujitsu is a big hit\n\n1:25:35.560 --> 1:25:42.120\n on an, on the ego for, you know, especially guys, you know, when like a smaller person\n\n1:25:42.120 --> 1:25:48.220\n just destroys you, dominates you when you can, uh, I don't know, deadlift whatever number\n\n1:25:48.220 --> 1:25:50.000\n of pounds.\n\n1:25:50.000 --> 1:25:56.800\n And uh, it's hard not to use that strength to then resist the slow, the ultimate destruction\n\n1:25:56.800 --> 1:26:02.560\n by like 120 pound, but that, and that's why I recommend developing the skill quality first,\n\n1:26:02.560 --> 1:26:06.680\n but it doesn't, it doesn't mean that you can't, I can't, you can still do it so that don't\n\n1:26:06.680 --> 1:26:09.840\n take it as a like, oh, I can't go that direction.\n\n1:26:09.840 --> 1:26:10.840\n That's fine.\n\n1:26:10.840 --> 1:26:14.440\n But understand those things and then also understand the jujitsu is additional load\n\n1:26:14.440 --> 1:26:15.480\n on the body.\n\n1:26:15.480 --> 1:26:18.680\n So you have to, you can't just add it on top.\n\n1:26:18.680 --> 1:26:22.680\n You've got to taper back the other, you're going to have to make a, I'm sorry, you may\n\n1:26:22.680 --> 1:26:28.960\n not want to hear it, but you're not going to be able to do as much and add that here.\n\n1:26:28.960 --> 1:26:35.440\n It's a compromise because your total volume still has to be there and there's not, unfortunately,\n\n1:26:35.440 --> 1:26:39.320\n not really a way to measure what the jujitsu volume is with this.\n\n1:26:39.320 --> 1:26:44.280\n So you've got to take a look at that and that's where like measuring like heart rate variability\n\n1:26:44.280 --> 1:26:50.000\n or other stuff can be useful so you can see what is happening from me from a sympathetic\n\n1:26:50.000 --> 1:26:52.640\n versus parasympathetic nervous system standpoint.\n\n1:26:52.640 --> 1:26:53.640\n Yeah.\n\n1:26:53.640 --> 1:26:56.920\n Making sure your body recovers sufficiently and trying to put numbers to it.\n\n1:26:56.920 --> 1:26:58.760\n You mentioned Kabuki strength.\n\n1:26:58.760 --> 1:27:04.640\n You run the Kabuki strength lab previously called the elite performance center in Oregon.\n\n1:27:04.640 --> 1:27:07.440\n You called it the perfect gym.\n\n1:27:07.440 --> 1:27:11.040\n What makes for the perfect strength training gym?\n\n1:27:11.040 --> 1:27:12.040\n Where I called it the perfect gym?\n\n1:27:12.040 --> 1:27:14.040\n In a video somewhere I watched.\n\n1:27:14.040 --> 1:27:15.040\n Oh man.\n\n1:27:15.040 --> 1:27:19.960\n I mean, that's where my testing grounds for developing all this stuff was through the\n\n1:27:19.960 --> 1:27:20.960\n years.\n\n1:27:20.960 --> 1:27:26.560\n And, and so this is, like I said, I started developing relationships with the best developmental\n\n1:27:26.560 --> 1:27:30.960\n kinesiologist in the, in the U S the best, arguably the best or most well known physical\n\n1:27:30.960 --> 1:27:35.240\n therapist in the world, the best spine biomechanist in the world.\n\n1:27:35.240 --> 1:27:38.880\n I started doing continuing education with these clinical courses and learning this stuff\n\n1:27:38.880 --> 1:27:41.160\n and going, but how does it work in my world?\n\n1:27:41.160 --> 1:27:42.160\n Right.\n\n1:27:42.160 --> 1:27:44.020\n And then I started lecturing with them and all this other stuff.\n\n1:27:44.020 --> 1:27:47.360\n But the lab was like, where do we test this stuff?\n\n1:27:47.360 --> 1:27:48.360\n Right.\n\n1:27:48.360 --> 1:27:49.360\n And so let me get to a point.\n\n1:27:49.360 --> 1:27:50.360\n There's three things.\n\n1:27:50.360 --> 1:27:52.480\n There's always three things.\n\n1:27:52.480 --> 1:27:59.720\n So to be a success, to achieve success, I believe there's three things that really,\n\n1:27:59.720 --> 1:28:08.200\n really come into place and it's the right methodology, the right tools and the right\n\n1:28:08.200 --> 1:28:10.040\n environment.\n\n1:28:10.040 --> 1:28:13.780\n And so it was all about building that.\n\n1:28:13.780 --> 1:28:19.680\n And so the methodologies came from a lot of that different, that gray area interaction\n\n1:28:19.680 --> 1:28:22.520\n of clinical with sports science, right?\n\n1:28:22.520 --> 1:28:27.480\n And then the tools I had to start creating and designing, and then the environment is\n\n1:28:27.480 --> 1:28:32.220\n having this, you know, focused environment of people that want to do better and push\n\n1:28:32.220 --> 1:28:35.800\n each other and having community and culture, right?\n\n1:28:35.800 --> 1:28:39.560\n I ended up building these connections, this network, everything that I'm doing with my\n\n1:28:39.560 --> 1:28:44.560\n businesses is trying to create that into a scalable fashion.\n\n1:28:44.560 --> 1:28:49.200\n And so I'm building the groundwork because to have a system that like, yeah, I had clinicals\n\n1:28:49.200 --> 1:28:51.480\n on site that knew exactly what we were doing.\n\n1:28:51.480 --> 1:28:55.960\n And when it's me and a few people in a small team and all this stuff, we're all just like\n\n1:28:55.960 --> 1:28:57.440\n easy to manage.\n\n1:28:57.440 --> 1:28:59.440\n And you can see these, there's other models around this.\n\n1:28:59.440 --> 1:29:04.100\n So I've been other areas since maybe whenever it was I filmed that video that said that,\n\n1:29:04.100 --> 1:29:09.020\n that they have that same model and it's taken probably about a decade usually to develop\n\n1:29:09.020 --> 1:29:10.020\n that.\n\n1:29:10.020 --> 1:29:14.240\n You know, and having the right people in this community, they can create this, this network\n\n1:29:14.240 --> 1:29:15.920\n and the tool and all this stuff, right?\n\n1:29:15.920 --> 1:29:21.040\n Except they still don't have the best tools because Kibuki strength didn't exist.\n\n1:29:21.040 --> 1:29:27.920\n But but and so out of that was, is essentially I started building this business and people\n\n1:29:27.920 --> 1:29:30.640\n like, when did you know how all this stuff was connected?\n\n1:29:30.640 --> 1:29:32.400\n And I'm like, I don't know.\n\n1:29:32.400 --> 1:29:37.600\n I didn't, I just started creating on the outset the things that worked until finally I'm like,\n\n1:29:37.600 --> 1:29:41.900\n I'm recreating a scalable version of this stuff.\n\n1:29:41.900 --> 1:29:46.160\n Here's the methodologies and a coaching platform that we can manage clients around the globe\n\n1:29:46.160 --> 1:29:50.160\n and see what's working and not based on the scientific principles of training, right?\n\n1:29:50.160 --> 1:29:54.180\n How do we create that into a database that now we can train new coaches and they can\n\n1:29:54.180 --> 1:29:58.960\n use those same metrics and tools to create programs that are tailored to fit person's\n\n1:29:58.960 --> 1:30:00.720\n individual needs, right?\n\n1:30:00.720 --> 1:30:06.360\n Now how do we integrate that with assessment and clinical care assessment and all these\n\n1:30:06.360 --> 1:30:07.720\n other pieces?\n\n1:30:07.720 --> 1:30:09.500\n So there's a lot of work in that.\n\n1:30:09.500 --> 1:30:11.960\n And so that's where Kibuki strength is the genesis.\n\n1:30:11.960 --> 1:30:16.760\n But we have, we call our gym the Kibuki strength lab.\n\n1:30:16.760 --> 1:30:20.160\n Literally people find about our gym in the neighborhood and they're like, how long have\n\n1:30:20.160 --> 1:30:21.160\n you been here?\n\n1:30:21.160 --> 1:30:22.460\n Why, why do I not know about this?\n\n1:30:22.460 --> 1:30:24.520\n We don't advertise our gym at all.\n\n1:30:24.520 --> 1:30:27.840\n So like that makes no sense.\n\n1:30:27.840 --> 1:30:32.940\n Well that's because the only reason is to have a testing environment for the tools and\n\n1:30:32.940 --> 1:30:38.000\n methodology and having enough people to have the culture and fit and to be able to be part\n\n1:30:38.000 --> 1:30:39.920\n of the experiment.\n\n1:30:39.920 --> 1:30:44.280\n What about the environment of the, the feel of it, the actual gym?\n\n1:30:44.280 --> 1:30:47.360\n There's a, I don't know, a grunginess to it.\n\n1:30:47.360 --> 1:30:54.840\n I recently became a member of planet fitness for, for reasons that have to do more with\n\n1:30:54.840 --> 1:30:59.360\n the heat in Austin that sometimes I need to put in time in the treadmill.\n\n1:30:59.360 --> 1:31:00.360\n I don't like that.\n\n1:31:00.360 --> 1:31:01.360\n I don't have any judgment, honestly.\n\n1:31:01.360 --> 1:31:06.040\n I don't, the best gyms I've been in are kind of dirty.\n\n1:31:06.040 --> 1:31:08.440\n You walk in and you know that work is to be done.\n\n1:31:08.440 --> 1:31:10.640\n There's not another reason to do there.\n\n1:31:10.640 --> 1:31:13.560\n It is the, the environment is tight.\n\n1:31:13.560 --> 1:31:16.480\n There's a big piece of that.\n\n1:31:16.480 --> 1:31:19.040\n I know it's studied sociologically, I believe.\n\n1:31:19.040 --> 1:31:26.080\n I just, I just pictured that word too, but the intensity, when you start growing a space,\n\n1:31:26.080 --> 1:31:28.600\n the intensity drops.\n\n1:31:28.600 --> 1:31:33.080\n And so I, I had that experience when we grew, we went from a 4,000 foot to a 9,000 square\n\n1:31:33.080 --> 1:31:35.200\n foot gym at one time.\n\n1:31:35.200 --> 1:31:38.360\n And everybody's like, it doesn't feel the same.\n\n1:31:38.360 --> 1:31:39.760\n Like people are complaining for years.\n\n1:31:39.760 --> 1:31:42.320\n We've shrunk it back down whenever down to 3,500 square feet.\n\n1:31:42.320 --> 1:31:44.080\n And it creates that intensity.\n\n1:31:44.080 --> 1:31:47.600\n It creates the closest, the connection with the people around you.\n\n1:31:47.600 --> 1:31:52.000\n And then like I said, the grunginess, like you go in, you know, the intention when you\n\n1:31:52.000 --> 1:31:54.320\n walk in that environment creates that tension.\n\n1:31:54.320 --> 1:31:58.580\n But when I speak environment, it's not just the, it's not the physical, it's the people.\n\n1:31:58.580 --> 1:32:03.680\n But you know, when the gym is a little bit beat up, it also tells a story.\n\n1:32:03.680 --> 1:32:06.560\n Like there's a history to it.\n\n1:32:06.560 --> 1:32:11.640\n You could tell that not only is there work to be done, that work has been done here.\n\n1:32:11.640 --> 1:32:12.640\n Yes.\n\n1:32:12.640 --> 1:32:13.640\n Like battles have been fought.\n\n1:32:13.640 --> 1:32:20.680\n There's something to that where you're just in a long line of people, you know, that fought\n\n1:32:20.680 --> 1:32:21.680\n and won.\n\n1:32:21.680 --> 1:32:26.360\n And we could get into a whole nother space, there'd be a whole nother topic, but that\n\n1:32:26.360 --> 1:32:28.240\n existing energy of a space.\n\n1:32:28.240 --> 1:32:32.520\n I mean, we mentioned offline, Joe Rogan, he talks about the same with comedy clubs.\n\n1:32:32.520 --> 1:32:36.040\n There's certain, there's certain clubs that just have a history.\n\n1:32:36.040 --> 1:32:38.040\n There's an energy there.\n\n1:32:38.040 --> 1:32:40.960\n You can get all woo woo, but you know, it's there.\n\n1:32:40.960 --> 1:32:41.960\n It's a real thing.\n\n1:32:41.960 --> 1:32:43.960\n I think you walk in and you can feel it.\n\n1:32:43.960 --> 1:32:44.960\n You feel it.\n\n1:32:44.960 --> 1:32:45.960\n You feel it.\n\n1:32:45.960 --> 1:32:46.960\n Yeah.\n\n1:32:46.960 --> 1:32:52.360\n That makes me feel that somehow all of us humans are connected in a ways that's hard\n\n1:32:52.360 --> 1:32:57.040\n to describe, even the ones who are no longer here.\n\n1:32:57.040 --> 1:33:05.040\n Just the greatness that once was is still in the walls, in the space, present there.\n\n1:33:05.040 --> 1:33:07.280\n And we somehow can plug into that energy.\n\n1:33:07.280 --> 1:33:08.280\n Yeah.\n\n1:33:08.280 --> 1:33:11.640\n It's, we can go down a, go down a path there.\n\n1:33:11.640 --> 1:33:13.760\n There's something really powerful there.\n\n1:33:13.760 --> 1:33:20.840\n You've also mentioned a bunch of cool equipment that you've developed as part of Kabuki Strength.\n\n1:33:20.840 --> 1:33:24.640\n Probably a little bit of that has to do with your engineering education, but also just\n\n1:33:24.640 --> 1:33:29.160\n generally with the spirit of the innovator that you are.\n\n1:33:29.160 --> 1:33:35.040\n What are some cool, maybe revolutionary pieces of equipment that you're particularly proud\n\n1:33:35.040 --> 1:33:39.600\n of or just you've been obsessed with recently that you're developing?\n\n1:33:39.600 --> 1:33:40.600\n Yeah.\n\n1:33:40.600 --> 1:33:41.600\n Love to talk about that.\n\n1:33:41.600 --> 1:33:46.440\n So we've got some wild crazy stuff that just came out and is coming out too.\n\n1:33:46.440 --> 1:33:52.640\n So everything that we create and release at Kabuki Strength, the industry hasn't seen\n\n1:33:52.640 --> 1:33:54.440\n before.\n\n1:33:54.440 --> 1:33:56.400\n There's stuff that's basic foundational.\n\n1:33:56.400 --> 1:34:02.920\n It's been around forever because it works, but there's always more.\n\n1:34:02.920 --> 1:34:04.400\n It could be better.\n\n1:34:04.400 --> 1:34:07.380\n And why are we not looking at these things, these foundational things?\n\n1:34:07.380 --> 1:34:10.760\n So when people are coming up with novel things, they ended up being way different outside\n\n1:34:10.760 --> 1:34:11.760\n the perspective.\n\n1:34:11.760 --> 1:34:17.000\n And I'm coming up with things that are way different that are plays on what we already\n\n1:34:17.000 --> 1:34:18.000\n know works.\n\n1:34:18.000 --> 1:34:20.000\n So we talked about the transform bar, the only bar in the world.\n\n1:34:20.000 --> 1:34:22.180\n We can manipulate spinal mechanics.\n\n1:34:22.180 --> 1:34:27.920\n We can, so everything, everything for me from a design concept that we develop is all about\n\n1:34:27.920 --> 1:34:37.640\n creating products that can rapidly accommodate to the variability of an individual's leverages,\n\n1:34:37.640 --> 1:34:40.480\n mobility and training needs.\n\n1:34:40.480 --> 1:34:41.480\n Okay.\n\n1:34:41.480 --> 1:34:45.160\n And that's going to also create and distill down the size and scope of space that we need,\n\n1:34:45.160 --> 1:34:48.580\n which is going to be, continue to be an ongoing thing.\n\n1:34:48.580 --> 1:34:51.720\n Check out my Instagram after this and you'll see, I put an entire gym on the bed of my\n\n1:34:51.720 --> 1:34:58.880\n truck and went on vacation last week, drove to the desert and by entire gym, I mean a\n\n1:34:58.880 --> 1:35:03.840\n squat rack, full compliment of our specialty bars, a horizontal and vertical pulley system,\n\n1:35:03.840 --> 1:35:09.360\n handheld weights, shoulder rock, like a complete, an entire gym in product that took up the\n\n1:35:09.360 --> 1:35:13.160\n space the size of this bed right here.\n\n1:35:13.160 --> 1:35:14.160\n That's incredible.\n\n1:35:14.160 --> 1:35:16.040\n Because of the design scope of what we have.\n\n1:35:16.040 --> 1:35:21.280\n So the cool thing is that there's two other bars that fit our biomechanically sound barbell\n\n1:35:21.280 --> 1:35:22.280\n designs.\n\n1:35:22.280 --> 1:35:23.420\n We talked about the transformer bar.\n\n1:35:23.420 --> 1:35:27.920\n The other two are built on this thing I called playground physics.\n\n1:35:27.920 --> 1:35:35.600\n So we have these bars with handles that are off parallel with the axis.\n\n1:35:35.600 --> 1:35:37.440\n So they've been around the market for a long time.\n\n1:35:37.440 --> 1:35:40.560\n One is a hex bar or a trap bar.\n\n1:35:40.560 --> 1:35:46.640\n Another one is a, it's a pressing bar with the handles turned as well.\n\n1:35:46.640 --> 1:35:48.640\n And both of them suck.\n\n1:35:48.640 --> 1:35:49.640\n They're horrible.\n\n1:35:49.640 --> 1:35:54.440\n Any lifter knows if you pick it up, it's going to break your wrist and crush into your face.\n\n1:35:54.440 --> 1:36:00.280\n And it just, it just doesn't feel good pressing, but it alleviates the strain on the wrist.\n\n1:36:00.280 --> 1:36:02.000\n So people use it for that reason.\n\n1:36:02.000 --> 1:36:04.760\n And the, the, the trap bar, same thing.\n\n1:36:04.760 --> 1:36:06.640\n It's always diving forward in your hand.\n\n1:36:06.640 --> 1:36:07.920\n So it's kind of limited.\n\n1:36:07.920 --> 1:36:12.200\n It's also limited in use because you can't, you could do a lot more with it.\n\n1:36:12.200 --> 1:36:15.000\n So these bars are really cool playground physics.\n\n1:36:15.000 --> 1:36:25.640\n So as soon as the center of rotation is on the same axis as the center of mass and the\n\n1:36:25.640 --> 1:36:30.800\n handle is off center, you have, you have a teeter totter.\n\n1:36:30.800 --> 1:36:34.660\n So a teeter totter has a balance point, but it's infinitely perfect.\n\n1:36:34.660 --> 1:36:36.200\n So technically you can never find it.\n\n1:36:36.200 --> 1:36:38.840\n So always going to be sitting on one side or the other in a playground.\n\n1:36:38.840 --> 1:36:40.360\n And that's what these bars are designed.\n\n1:36:40.360 --> 1:36:42.340\n So you've got instability right here.\n\n1:36:42.340 --> 1:36:43.340\n You can't find the center of the bars.\n\n1:36:43.340 --> 1:36:45.080\n It's always trying to tip in your hands on the trap bar.\n\n1:36:45.080 --> 1:36:48.760\n So you can't do carries with it cause you're doing for momentum and it wants to, it wants\n\n1:36:48.760 --> 1:36:49.760\n to dip on you.\n\n1:36:49.760 --> 1:36:50.760\n Right.\n\n1:36:50.760 --> 1:36:52.360\n Um, the Swiss bar wants to crush your face.\n\n1:36:52.360 --> 1:36:53.360\n Well, what do we do?\n\n1:36:53.360 --> 1:36:58.520\n We just make a swing, but center of mass below center of rotation.\n\n1:36:58.520 --> 1:36:59.520\n And what does it do?\n\n1:36:59.520 --> 1:37:02.700\n Oh, it always finds center.\n\n1:37:02.700 --> 1:37:06.760\n So, so the handles on the, our pressing bar it's art.\n\n1:37:06.760 --> 1:37:11.820\n So the handles are above center of rotation and then, and then every angle, instead of\n\n1:37:11.820 --> 1:37:17.040\n just being a certain fixed angles, each angle is based on the width, the average width of\n\n1:37:17.040 --> 1:37:18.040\n an individual.\n\n1:37:18.040 --> 1:37:23.240\n So the internal and external rotational bias is based of the shoulder is based on the width,\n\n1:37:23.240 --> 1:37:26.380\n leaving just a little bit left because we talked about the lap being a stabilizer.\n\n1:37:26.380 --> 1:37:30.600\n You still need to have a little bit of cue of external rotation to engage that as a stabilizer.\n\n1:37:30.600 --> 1:37:31.600\n Boom.\n\n1:37:31.600 --> 1:37:35.280\n Now all of a sudden you have a bar and I kid you not, this is a great story.\n\n1:37:35.280 --> 1:37:36.280\n Major league baseball.\n\n1:37:36.280 --> 1:37:39.200\n When I presented it, every head strength coach for a major league baseball team, maybe not\n\n1:37:39.200 --> 1:37:42.960\n every, but damn near most of them have bad shoulders.\n\n1:37:42.960 --> 1:37:43.960\n They can't press.\n\n1:37:43.960 --> 1:37:45.820\n They've gotten shoulder surgeries, so on.\n\n1:37:45.820 --> 1:37:48.240\n And so we're showing them, they love all our stuff and I'm like, Hey, I've got this cool\n\n1:37:48.240 --> 1:37:49.360\n prototype I want to show you.\n\n1:37:49.360 --> 1:37:50.360\n It's a pressing bar.\n\n1:37:50.360 --> 1:37:54.640\n And they're like, Oh, you know, major league baseball is a little hesitant on pressing\n\n1:37:54.640 --> 1:37:59.640\n because the dangers for the shoulder and I can't, I haven't been able to take a bar to\n\n1:37:59.640 --> 1:38:00.640\n my chest.\n\n1:38:00.640 --> 1:38:01.640\n I mean, I'd really love to.\n\n1:38:01.640 --> 1:38:07.240\n It's been five years since I've, I've been able to to XX train and I'm like, just try\n\n1:38:07.240 --> 1:38:08.240\n it.\n\n1:38:08.240 --> 1:38:09.240\n Put a bar on my chest without pain.\n\n1:38:09.240 --> 1:38:10.240\n I'm like, just try it.\n\n1:38:10.240 --> 1:38:11.240\n Put it in there.\n\n1:38:11.240 --> 1:38:12.240\n Ooh, that feels good.\n\n1:38:12.240 --> 1:38:15.360\n Now the arc makes it actually three inches deeper.\n\n1:38:15.360 --> 1:38:16.560\n So people are automatically scared.\n\n1:38:16.560 --> 1:38:17.560\n I can't do that.\n\n1:38:17.560 --> 1:38:18.800\n Cause that's an extra range of motion.\n\n1:38:18.800 --> 1:38:19.800\n Right?\n\n1:38:19.800 --> 1:38:20.800\n Like, Ooh, put a plate on there.\n\n1:38:20.800 --> 1:38:21.800\n They're doing it.\n\n1:38:21.800 --> 1:38:24.800\n By the time the staff's like, they're all standing around, you see like, what's going\n\n1:38:24.800 --> 1:38:25.800\n on?\n\n1:38:25.800 --> 1:38:26.800\n Put two plates on.\n\n1:38:26.800 --> 1:38:29.600\n You see the, just like he gets up.\n\n1:38:29.600 --> 1:38:33.080\n How do you feel like, I feel fine.\n\n1:38:33.080 --> 1:38:34.720\n No pain at all.\n\n1:38:34.720 --> 1:38:42.800\n I did this with five teams with five of the, it happening repeatedly five times that they\n\n1:38:42.800 --> 1:38:47.920\n and every one of them worked up to two plates and did reps varied with zero pain to a three\n\n1:38:47.920 --> 1:38:49.480\n inch range or greater range of major.\n\n1:38:49.480 --> 1:38:50.480\n Cause what did we do?\n\n1:38:50.480 --> 1:38:53.400\n We stacked all the joints and we provided stability at the end that we balanced internal\n\n1:38:53.400 --> 1:38:54.400\n and external rotation.\n\n1:38:54.400 --> 1:38:58.360\n I mean just basic playground physics and it changed the game.\n\n1:38:58.360 --> 1:39:02.280\n Now we get a greater range of motion with a greater training effect with the negative\n\n1:39:02.280 --> 1:39:03.760\n stresses removed.\n\n1:39:03.760 --> 1:39:09.640\n Our trap bar opened up one side, which there was already some like that out there created.\n\n1:39:09.640 --> 1:39:12.080\n It pops up so you can pick up, take the weights on and off.\n\n1:39:12.080 --> 1:39:16.800\n It's got a built in Jack and then created the high handle position, which already did.\n\n1:39:16.800 --> 1:39:18.280\n Everybody uses the high handle on a trap bar.\n\n1:39:18.280 --> 1:39:20.040\n They just don't know why they like it.\n\n1:39:20.040 --> 1:39:23.280\n The handle that's on center, we offset just a little bit, not enough to make a difference\n\n1:39:23.280 --> 1:39:27.520\n on the range of motion lift or even notice visibly, but it still has the same effect.\n\n1:39:27.520 --> 1:39:30.200\n So both handles now have that.\n\n1:39:30.200 --> 1:39:33.560\n We added the option of different handle sizes based on whatever your needs are.\n\n1:39:33.560 --> 1:39:38.280\n One that rolls to develop a grip and then different widths that you could choose from\n\n1:39:38.280 --> 1:39:44.440\n based on whether you're training a teen athlete or a seven foot six NBA player or a NFL lineman\n\n1:39:44.440 --> 1:39:48.600\n so that we can accommodate for all these differences.\n\n1:39:48.600 --> 1:39:53.040\n Now it becomes the most functional all around bar around because now you can do carries\n\n1:39:53.040 --> 1:39:54.040\n with it.\n\n1:39:54.040 --> 1:39:55.040\n You can do split squats with it.\n\n1:39:55.040 --> 1:39:57.340\n You could do curls with it because it goes around the body.\n\n1:39:57.340 --> 1:40:00.280\n You can do overhead presses because you don't have a thing that gets in your way and you\n\n1:40:00.280 --> 1:40:01.800\n can flip it up into position.\n\n1:40:01.800 --> 1:40:04.720\n You can do bent over rows and not run into your shins.\n\n1:40:04.720 --> 1:40:06.220\n You can do seal rows off of a bench.\n\n1:40:06.220 --> 1:40:07.580\n You can do ab rollouts.\n\n1:40:07.580 --> 1:40:08.580\n You could, should I go on?\n\n1:40:08.580 --> 1:40:09.580\n Yeah.\n\n1:40:09.580 --> 1:40:10.580\n So you can use it as like the main bar.\n\n1:40:10.580 --> 1:40:12.320\n The best multi purpose bar around.\n\n1:40:12.320 --> 1:40:13.780\n You got a home gym, one bar.\n\n1:40:13.780 --> 1:40:16.420\n Like how do you develop totally new equipment like this?\n\n1:40:16.420 --> 1:40:19.600\n I scratch it on paper.\n\n1:40:19.600 --> 1:40:24.920\n Maybe weld some cut up and weld up a prototype, but usually I just hand the scratched up paper\n\n1:40:24.920 --> 1:40:30.400\n to my engineering manager and that's what he says his job is to distill my chicken scratch\n\n1:40:30.400 --> 1:40:33.640\n into something real and then that team picks it up.\n\n1:40:33.640 --> 1:40:39.200\n But in the old days, starting out, I just walk out, I just walk out and do it.\n\n1:40:39.200 --> 1:40:40.200\n You talk about engineering.\n\n1:40:40.200 --> 1:40:41.900\n I'm actually more, I work more of an artist fashion.\n\n1:40:41.900 --> 1:40:46.040\n It's in my head and I just go create with no plans.\n\n1:40:46.040 --> 1:40:50.040\n And so they have to pick that up and actually do the engineering and testing and all that.\n\n1:40:50.040 --> 1:40:52.200\n And then we got two other products came out this year.\n\n1:40:52.200 --> 1:40:53.200\n Freaking wild.\n\n1:40:53.200 --> 1:40:55.240\n Are you familiar with training with a flywheel?\n\n1:40:55.240 --> 1:40:57.760\n No, no, it's a flywheel.\n\n1:40:57.760 --> 1:41:04.560\n A flywheel is a spinning object that creates an inertial mass and then it reverses direction.\n\n1:41:04.560 --> 1:41:08.160\n So whatever you put into it and there's ones out there.\n\n1:41:08.160 --> 1:41:10.720\n But ours is the first patent pending.\n\n1:41:10.720 --> 1:41:12.720\n That's all everything all in one unit.\n\n1:41:12.720 --> 1:41:15.440\n So it's a floor based as well as a horizontal.\n\n1:41:15.440 --> 1:41:17.760\n So you can basically do any pulley movement in the world.\n\n1:41:17.760 --> 1:41:21.320\n And now everything that you put into it on a concentric force, it whips right back as\n\n1:41:21.320 --> 1:41:24.200\n a peak centric load.\n\n1:41:24.200 --> 1:41:26.760\n So there's an accelerating whipping motion.\n\n1:41:26.760 --> 1:41:32.920\n It just yeah, basically, yeah, I mean, okay, I have to have trouble imagining exactly many\n\n1:41:32.920 --> 1:41:37.200\n of the things you're describing, I suppose, have to be experienced, right?\n\n1:41:37.200 --> 1:41:38.200\n Yes.\n\n1:41:38.200 --> 1:41:40.120\n Because there's a magic and there's a lot of research.\n\n1:41:40.120 --> 1:41:41.120\n They've been around.\n\n1:41:41.120 --> 1:41:44.920\n They're adopted more heavily in Europe, quite heavily in Europe, but not as much in the\n\n1:41:44.920 --> 1:41:48.160\n US because they sell them as a be all end all tool, which they're not.\n\n1:41:48.160 --> 1:41:52.740\n They're crazy for what they do, but it's not the it's another tool.\n\n1:41:52.740 --> 1:41:57.560\n And so we have a very high quality unit now that is half the cost of everybody else's\n\n1:41:57.560 --> 1:42:02.200\n because the innovation of a movable mount point that you for them, you have to have\n\n1:42:02.200 --> 1:42:03.500\n two pieces of equipment.\n\n1:42:03.500 --> 1:42:04.780\n We have one.\n\n1:42:04.780 --> 1:42:10.000\n So and then a few other things, better platform to be able to do things and that we can do\n\n1:42:10.000 --> 1:42:16.400\n what we call off platform work, which allows us to do movements like punches and standups,\n\n1:42:16.400 --> 1:42:17.400\n things like that.\n\n1:42:17.400 --> 1:42:21.520\n And then I've got a handheld weight coming out next month that we can actually play with.\n\n1:42:21.520 --> 1:42:27.560\n So varying the load with it, never leaving your hand by changing the leverage point.\n\n1:42:27.560 --> 1:42:29.500\n And so what do we think?\n\n1:42:29.500 --> 1:42:31.720\n What exercise are we talking about here?\n\n1:42:31.720 --> 1:42:35.080\n Anything that would be a dumbbell or a kettlebell movement.\n\n1:42:35.080 --> 1:42:38.280\n So it functions, it does the function of a kettlebell, a dumbbell and what we call a\n\n1:42:38.280 --> 1:42:42.140\n center mass bell, as well as provides variable loading within a range.\n\n1:42:42.140 --> 1:42:47.240\n So how can you change like how can you change the load?\n\n1:42:47.240 --> 1:42:48.240\n Because load.\n\n1:42:48.240 --> 1:42:49.580\n Well, we don't actually change the load.\n\n1:42:49.580 --> 1:42:53.860\n We change the torque on the on the joint that we're working, which is the same.\n\n1:42:53.860 --> 1:42:55.240\n That's actually what is creating the force.\n\n1:42:55.240 --> 1:42:56.240\n Right.\n\n1:42:56.240 --> 1:43:01.120\n So if I'm doing a front raise, it's where this this downward force is times the distance\n\n1:43:01.120 --> 1:43:02.120\n away.\n\n1:43:02.120 --> 1:43:03.120\n Right.\n\n1:43:03.120 --> 1:43:06.120\n Which also then makes it no force when I've got at the bottom of the front raise, which\n\n1:43:06.120 --> 1:43:09.020\n is why it's so easy with this.\n\n1:43:09.020 --> 1:43:10.020\n It's like a kettlebell.\n\n1:43:10.020 --> 1:43:12.840\n It's offset, except it has three different handles.\n\n1:43:12.840 --> 1:43:16.080\n But it's offset just that a kettlebell, you can't do it because the offset so far it becomes\n\n1:43:16.080 --> 1:43:17.780\n a wrist movement.\n\n1:43:17.780 --> 1:43:22.420\n So ours has three different sizes and the offset just enough so that you can pick.\n\n1:43:22.420 --> 1:43:26.700\n If I put it in a front raise position or curl position, I could put it in outward position\n\n1:43:26.700 --> 1:43:29.880\n and the force is almost what it is at the at the top.\n\n1:43:29.880 --> 1:43:32.360\n Then I get the top and it's the same exact or the curl.\n\n1:43:32.360 --> 1:43:36.320\n So I can actually change the force curve in the movement and then I can just release the\n\n1:43:36.320 --> 1:43:39.560\n pressure a little bit and let it swing into position and keep doing a drop set with never\n\n1:43:39.560 --> 1:43:40.560\n letting it down.\n\n1:43:40.560 --> 1:43:41.560\n Yeah.\n\n1:43:41.560 --> 1:43:42.560\n Yeah.\n\n1:43:42.560 --> 1:43:45.040\n So it's got a really nice texture grip that allows you to hold it in different positions.\n\n1:43:45.040 --> 1:43:48.680\n And then the load offset is just enough that it doesn't overpower the wrist.\n\n1:43:48.680 --> 1:43:52.140\n And then you've got different hand sizes so that you can maximize this relationship and\n\n1:43:52.140 --> 1:43:54.460\n hit whatever joint that you're applying.\n\n1:43:54.460 --> 1:43:55.900\n So sounds incredible.\n\n1:43:55.900 --> 1:43:59.640\n It's really freaking well, it's awesome because you can because the variable load.\n\n1:43:59.640 --> 1:44:04.020\n Now I could go straight from front raises to side raises or rear or curl because without\n\n1:44:04.020 --> 1:44:05.440\n like because I don't have to put it down.\n\n1:44:05.440 --> 1:44:08.780\n So now my time under tension goes through the roof.\n\n1:44:08.780 --> 1:44:12.340\n And by the way, the same effect with a flywheel trainer because the variable whatever you\n\n1:44:12.340 --> 1:44:14.660\n put into it is what it kicks back.\n\n1:44:14.660 --> 1:44:18.360\n So you have a constant time under tension because there's no rest points either.\n\n1:44:18.360 --> 1:44:24.040\n So all this stuff is working on maximizing time under tension, which anyway, it's cool\n\n1:44:24.040 --> 1:44:25.040\n stuff.\n\n1:44:25.040 --> 1:44:26.040\n Anyway, I get excited.\n\n1:44:26.040 --> 1:44:31.320\n Well, let me ask you about another thing you've already mentioned, but I find this really\n\n1:44:31.320 --> 1:44:40.000\n interesting, which is barefoot running and you're sort of a company, Barefoot Athletics.\n\n1:44:40.000 --> 1:44:41.000\n Yeah.\n\n1:44:41.000 --> 1:44:46.000\n And the tagline is optimizing the human to ground interface.\n\n1:44:46.000 --> 1:44:51.280\n We've talked about this a little bit with the power lifting.\n\n1:44:51.280 --> 1:44:57.880\n How do you think about the the foot ground interface?\n\n1:44:57.880 --> 1:45:05.680\n It's interesting that we know that we should train all these parts of our body to be able\n\n1:45:05.680 --> 1:45:10.580\n to be stronger, be more resilient.\n\n1:45:10.580 --> 1:45:16.080\n But we think that the foot is different, that we need to package it and modify it.\n\n1:45:16.080 --> 1:45:22.520\n And somehow that that's the science of making it healthy where I challenge people think\n\n1:45:22.520 --> 1:45:23.520\n about that.\n\n1:45:23.520 --> 1:45:27.440\n Like first thing you do in the morning is roll out of bed and put your weightlifting\n\n1:45:27.440 --> 1:45:31.080\n belt on and wrap it on tight and wear it till you go to bed at night.\n\n1:45:31.080 --> 1:45:36.400\n Do it with your shoulders, your knees, wake up and put some knee wraps on an elbow wraps\n\n1:45:36.400 --> 1:45:38.720\n and see what happens.\n\n1:45:38.720 --> 1:45:43.240\n Then you'll get weaker, you'll lose movement capacity and you'll start affecting other\n\n1:45:43.240 --> 1:45:47.000\n areas of the body very negatively because they will start picking up the compensation\n\n1:45:47.000 --> 1:45:50.920\n for those joints that are not moving properly.\n\n1:45:50.920 --> 1:45:51.920\n This is it.\n\n1:45:51.920 --> 1:45:57.480\n What shoes are for is to protect you from the environment, from cuts and abrasions and\n\n1:45:57.480 --> 1:45:59.800\n heat and things like that.\n\n1:45:59.800 --> 1:46:07.440\n But the foot, let me the mind blowing is like every other area of the body.\n\n1:46:07.440 --> 1:46:12.440\n You need to use it and you need to strengthen it and you need to learn to control it.\n\n1:46:12.440 --> 1:46:13.440\n That's it.\n\n1:46:13.440 --> 1:46:16.160\n That's all I have to say about the subject.\n\n1:46:16.160 --> 1:46:17.160\n It's that simple.\n\n1:46:17.160 --> 1:46:23.880\n But somehow we have been sold entire industries like the orthotics industry.\n\n1:46:23.880 --> 1:46:25.280\n It's completely false.\n\n1:46:25.280 --> 1:46:29.900\n Meta analysis of the data shows that orthotics do nothing beyond temporary relief from pain\n\n1:46:29.900 --> 1:46:33.280\n over a six, eight week period of time and provide no long term benefit.\n\n1:46:33.280 --> 1:46:38.720\n And I can't tell you how many people I've eliminated back or knee or hip pain from getting\n\n1:46:38.720 --> 1:46:42.740\n from working on strengthening and controlling the foot and ankle complex.\n\n1:46:42.740 --> 1:46:50.480\n We believe we've villainized and said a low arch is a condition that needs fixed.\n\n1:46:50.480 --> 1:46:54.680\n Like when it really is just controlling the foot and ankle complex and how they relate\n\n1:46:54.680 --> 1:46:56.300\n to each other and how we use that.\n\n1:46:56.300 --> 1:47:01.420\n Is it like go put on boxing gloves in the morning and do that for the next 20 years\n\n1:47:01.420 --> 1:47:02.520\n and see what happens.\n\n1:47:02.520 --> 1:47:07.560\n It's not about finding the right shoe that fits because your foot has been deformed.\n\n1:47:07.560 --> 1:47:11.500\n And so I'm not like some wacky go like, oh, you got to be barefoot forever.\n\n1:47:11.500 --> 1:47:16.840\n Do this like, no, I'm just saying go spend some time using it, strengthen it, learn to\n\n1:47:16.840 --> 1:47:19.320\n control it and you will work better in a shoe.\n\n1:47:19.320 --> 1:47:24.620\n But the whole running shoe movement with the raised heel, that was the person that that\n\n1:47:24.620 --> 1:47:29.580\n suggested that that in to Nike way back when they were trying to figure out what to do,\n\n1:47:29.580 --> 1:47:35.760\n the reason, and he says it's, it's the worst thing that he ever did.\n\n1:47:35.760 --> 1:47:40.080\n Because we were coming from an era of people wearing heeled shoes, which by the way came\n\n1:47:40.080 --> 1:47:42.780\n from stirrups way back in the day.\n\n1:47:42.780 --> 1:47:45.560\n That's where the whole heel came from is to go into stirrup, but then it went into fashion.\n\n1:47:45.560 --> 1:47:49.440\n And then the running craze started coming around in the seventies.\n\n1:47:49.440 --> 1:47:52.200\n They're they're starting to push this, the general mass population.\n\n1:47:52.200 --> 1:47:55.640\n And they realized that they were causing injuries and like, what are we going to do?\n\n1:47:55.640 --> 1:48:00.000\n Well, that's because everybody was in this position and had a shortened, a shortened\n\n1:48:00.000 --> 1:48:01.000\n calf muscle.\n\n1:48:01.000 --> 1:48:06.160\n And it's like, well, the work around, let's just put a heel on it so we don't injure them.\n\n1:48:06.160 --> 1:48:07.160\n That's it.\n\n1:48:07.160 --> 1:48:09.840\n And now because the raised heel, you got to raise the toe.\n\n1:48:09.840 --> 1:48:15.040\n And then now with that, if you go stand on something and pull your inner toe in and in\n\n1:48:15.040 --> 1:48:17.160\n a squat position, just reach down and do it.\n\n1:48:17.160 --> 1:48:21.560\n You'll see that you have no control over internal or next door and rotation of your, of, of\n\n1:48:21.560 --> 1:48:22.560\n your leg.\n\n1:48:22.560 --> 1:48:28.760\n You don't and, or your foot and you actually have to put a support in for the arch to be\n\n1:48:28.760 --> 1:48:33.120\n able to passively control those structures.\n\n1:48:33.120 --> 1:48:36.480\n It's just bandaid on top of bandaid on top of bandaid.\n\n1:48:36.480 --> 1:48:37.600\n Use it, strengthen it.\n\n1:48:37.600 --> 1:48:40.680\n If you want to wear some shoes cause they look good or fancy, I'm like, I have no problem.\n\n1:48:40.680 --> 1:48:42.000\n I mean, I go out on a wife.\n\n1:48:42.000 --> 1:48:45.480\n My wife will put on some high heels every now and again.\n\n1:48:45.480 --> 1:48:48.160\n But all I'm saying is use your foot.\n\n1:48:48.160 --> 1:48:51.500\n My thousand pound squat, my thousand pound deadlift, we're done barefoot.\n\n1:48:51.500 --> 1:48:53.880\n I'm not trying to sell you shoes.\n\n1:48:53.880 --> 1:48:56.320\n Go do it with no shoe.\n\n1:48:56.320 --> 1:48:57.320\n That's what I've been promoting.\n\n1:48:57.320 --> 1:49:02.360\n I did that for six years and I promoted it, but people ask me like, well, what do I do?\n\n1:49:02.360 --> 1:49:03.880\n Because my gym requires shoes.\n\n1:49:03.880 --> 1:49:04.880\n Okay.\n\n1:49:04.880 --> 1:49:06.680\n What do I go?\n\n1:49:06.680 --> 1:49:11.080\n And uh, and then I go, well, you know, you could pick up these other finger shoes or\n\n1:49:11.080 --> 1:49:15.300\n whatever and they go, man, my wife won't have sex with me if I do that.\n\n1:49:15.300 --> 1:49:17.560\n And I go, I know mine either.\n\n1:49:17.560 --> 1:49:20.140\n Like trust me, I'm not making this up.\n\n1:49:20.140 --> 1:49:23.960\n Basically in that market markets to one segment and they're still missing some gaps because\n\n1:49:23.960 --> 1:49:26.840\n they, they still have a little bit too narrow of a toe box.\n\n1:49:26.840 --> 1:49:29.920\n And if you're lifting, you have the opportunity to really get that splay and start working\n\n1:49:29.920 --> 1:49:31.280\n on this stuff better.\n\n1:49:31.280 --> 1:49:33.980\n So, um, I just wanted to create a shoe.\n\n1:49:33.980 --> 1:49:36.400\n These ones are odd colored cause it's a partnership with Kabuki.\n\n1:49:36.400 --> 1:49:40.980\n Normally we've got a black or a gray, uh, low top, high top sticks to the ground for\n\n1:49:40.980 --> 1:49:43.640\n lifting so we can do that and very pliable.\n\n1:49:43.640 --> 1:49:45.200\n It's a moccasin.\n\n1:49:45.200 --> 1:49:49.200\n It's a modern day moccasin, but looks okay that you can wear it around in other areas.\n\n1:49:49.200 --> 1:49:53.580\n If you, if you so choose, like, you know what the number one healthcare costs in America\n\n1:49:53.580 --> 1:49:54.580\n is.\n\n1:49:54.580 --> 1:50:05.040\n What's that diabetes, uh, heart disease, cancer, low back pain.\n\n1:50:05.040 --> 1:50:06.040\n Hmm.\n\n1:50:06.040 --> 1:50:09.320\n Now, what do you attribute a little back pain to?\n\n1:50:09.320 --> 1:50:13.600\n Well, it's attributed to a lot of things, um, but inability to control spinal position,\n\n1:50:13.600 --> 1:50:17.280\n um, which starts happening from, uh, some breathing issues.\n\n1:50:17.280 --> 1:50:19.720\n Uh, it also happens from the foot.\n\n1:50:19.720 --> 1:50:24.280\n Um, so there's a lot of stuff, but everything that I do actually focus on improving this.\n\n1:50:24.280 --> 1:50:29.240\n Uh, that, and it all starts with this is one thing, like this doesn't affect breathing,\n\n1:50:29.240 --> 1:50:32.960\n but, um, so it does actually affect breathing to some extent and spinal stabilization.\n\n1:50:32.960 --> 1:50:39.000\n So the raised heel and toe will make you stride further, um, because of just how it operates,\n\n1:50:39.000 --> 1:50:43.000\n but that overstride is a result of opening this.\n\n1:50:43.000 --> 1:50:44.640\n So we opened the pelvis and diaphragm.\n\n1:50:44.640 --> 1:50:47.320\n Did we talk about that and the impact that that has for controlling and spine?\n\n1:50:47.320 --> 1:50:48.320\n Yeah.\n\n1:50:48.320 --> 1:50:49.320\n I think we touched on that.\n\n1:50:49.320 --> 1:50:52.400\n Um, but it, it's all this stuff plays together.\n\n1:50:52.400 --> 1:50:53.760\n So the gait affects that.\n\n1:50:53.760 --> 1:50:57.000\n And so the shoe affects the gait and then, so it's all connected.\n\n1:50:57.000 --> 1:50:58.000\n All connected.\n\n1:50:58.000 --> 1:51:01.840\n Let me be very purposeful with some conversation here though.\n\n1:51:01.840 --> 1:51:03.840\n We've talked about periodization.\n\n1:51:03.840 --> 1:51:04.840\n This was a big gap.\n\n1:51:04.840 --> 1:51:08.520\n So, um, people go, yeah, well when people started running with those, they started having\n\n1:51:08.520 --> 1:51:13.100\n injuries back when, uh, the finger, uh, company produced those and didn't do the education\n\n1:51:13.100 --> 1:51:14.920\n around this very simple concept.\n\n1:51:14.920 --> 1:51:18.640\n You do not walk into the gym if you haven't squatted and start squatting 225 from, from\n\n1:51:18.640 --> 1:51:22.400\n max recs every week, day or every day over day.\n\n1:51:22.400 --> 1:51:27.320\n And that's what people did because they didn't weren't told that you need to build the capacity\n\n1:51:27.320 --> 1:51:29.240\n to do this.\n\n1:51:29.240 --> 1:51:33.100\n You go wear these and walk around in your office or wherever all day long, your feet\n\n1:51:33.100 --> 1:51:34.100\n are going to hurt.\n\n1:51:34.100 --> 1:51:36.980\n They're going to be sore.\n\n1:51:36.980 --> 1:51:40.520\n Do it for 10% of your time.\n\n1:51:40.520 --> 1:51:42.920\n Do that for a month, then add some.\n\n1:51:42.920 --> 1:51:45.160\n That will build the capacity to do this.\n\n1:51:45.160 --> 1:51:48.200\n And then that's going to start having the ability to strengthen, manage the foot.\n\n1:51:48.200 --> 1:51:49.320\n And there's a whole lot of other stuff.\n\n1:51:49.320 --> 1:51:54.360\n I've got videos on things that you can do by whatever you want or just, just spend some\n\n1:51:54.360 --> 1:51:55.680\n time out of them.\n\n1:51:55.680 --> 1:52:00.240\n Like, that's all that I want people to do because it is so simple and it has such a\n\n1:52:00.240 --> 1:52:01.240\n profound impact.\n\n1:52:01.240 --> 1:52:02.240\n Yeah, it does.\n\n1:52:02.240 --> 1:52:06.720\n I, what I did, uh, I noticed when you walked out, when I walked in, I was like, Oh, Hey,\n\n1:52:06.720 --> 1:52:10.120\n you're spending some time without the last shoes on.\n\n1:52:10.120 --> 1:52:15.440\n Uh, well, what I did, um, I think it's already now two years ago and I was doing a lot of\n\n1:52:15.440 --> 1:52:16.440\n running.\n\n1:52:16.440 --> 1:52:17.960\n I do like a 10 mile run.\n\n1:52:17.960 --> 1:52:22.300\n I would take my shoes off for the last like half mile and I run like that.\n\n1:52:22.300 --> 1:52:27.240\n And that was for me really helpful to ensure that I have proper form.\n\n1:52:27.240 --> 1:52:29.680\n Form that minimizes pain on the way I run.\n\n1:52:29.680 --> 1:52:31.080\n I still like shoes.\n\n1:52:31.080 --> 1:52:36.400\n I benefit a lot from shoes, the protection they provide, but it's for running we're referring\n\n1:52:36.400 --> 1:52:40.640\n to, uh, especially trail running and so on.\n\n1:52:40.640 --> 1:52:44.200\n And in the city when there's glass and all those kinds of things, uh, but it's really\n\n1:52:44.200 --> 1:52:47.000\n important to have minimal sort of protection on your feet.\n\n1:52:47.000 --> 1:52:54.120\n For me, at least it was to figure out the ways that my form basic movement and like\n\n1:52:54.120 --> 1:52:59.680\n the positioning in the foot, the impact of the foot and everything, you know, the, the,\n\n1:52:59.680 --> 1:53:06.360\n the lower leg, the entirety of the torso, really how it's improperly positioned in\n\n1:53:06.360 --> 1:53:12.280\n terms for the objective of minimizing pain and the barefoot running really helped fix\n\n1:53:12.280 --> 1:53:13.280\n that for me.\n\n1:53:13.280 --> 1:53:19.700\n Cause I figured out that I need to take shorter steps, more frequent, you know, all those\n\n1:53:19.700 --> 1:53:20.700\n kinds of things.\n\n1:53:20.700 --> 1:53:22.280\n And that really helps you figure that out.\n\n1:53:22.280 --> 1:53:29.160\n Like let's be realist about stuff, like, um, spend some time using it, strengthen it.\n\n1:53:29.160 --> 1:53:32.520\n And I've got some great ways to do that and learn how to do that.\n\n1:53:32.520 --> 1:53:33.760\n So yeah.\n\n1:53:33.760 --> 1:53:36.120\n What is a good diet for strength development?\n\n1:53:36.120 --> 1:53:41.440\n I've just to give you some context, I've been eating mostly meat, not for strength, mostly\n\n1:53:41.440 --> 1:53:42.640\n for mental performance.\n\n1:53:42.640 --> 1:53:44.040\n I just enjoy it.\n\n1:53:44.040 --> 1:53:45.040\n Yes.\n\n1:53:45.040 --> 1:53:50.160\n You need to have a base level of protein building blocks for tissue, right?\n\n1:53:50.160 --> 1:53:55.600\n We need to have enough fats to be able to have hormones work and key processes in the\n\n1:53:55.600 --> 1:53:56.600\n body.\n\n1:53:56.600 --> 1:54:00.960\n We need to have, well, you don't need to have from a performance aspect carbohydrates necessarily\n\n1:54:00.960 --> 1:54:06.080\n because the other ones can convert into injury sources, but for a performance athlete, carbohydrates\n\n1:54:06.080 --> 1:54:09.440\n can be very beneficial, uh, as well.\n\n1:54:09.440 --> 1:54:15.480\n So, um, so I look at it as you want, you need a base level fats, you need a base level of\n\n1:54:15.480 --> 1:54:19.720\n proteins and then you adjust the carbohydrate intake based on the needs.\n\n1:54:19.720 --> 1:54:25.200\n I'm not anti carbohydrate by any means, um, cause a lot of people will, they look at me\n\n1:54:25.200 --> 1:54:29.180\n now when they see like how lean I am and they, they jump to a conclusion, you must be keto.\n\n1:54:29.180 --> 1:54:30.180\n You must be carnivore.\n\n1:54:30.180 --> 1:54:31.180\n You must be whatever.\n\n1:54:31.180 --> 1:54:37.640\n Like, so losing and gaining weight is simply eating less or eating more.\n\n1:54:37.640 --> 1:54:41.640\n I mean it, ah, and it, we get so complicated.\n\n1:54:41.640 --> 1:54:44.900\n Oh, that my fat, they're like, what's your fasting window?\n\n1:54:44.900 --> 1:54:50.600\n If I'm, if I'm doing fasting, it's just because it works with my, my environment.\n\n1:54:50.600 --> 1:54:51.600\n Sometimes I do it.\n\n1:54:51.600 --> 1:54:52.900\n Sometimes I don't.\n\n1:54:52.900 --> 1:54:57.960\n All that does is control how much calories that you take big success with keto and carnivore\n\n1:54:57.960 --> 1:54:58.960\n diets.\n\n1:54:58.960 --> 1:55:05.400\n A lot, uh, and, and put on weight with those, with those diets, um, you know, protein actually\n\n1:55:05.400 --> 1:55:07.080\n has a thermogenic effect.\n\n1:55:07.080 --> 1:55:11.880\n And so you have to have a massive amount of fats if you have a only meat diet because\n\n1:55:11.880 --> 1:55:13.940\n you can literally starve to death.\n\n1:55:13.940 --> 1:55:18.560\n There's a, there's a show where they put people out in the wilderness and this guy, the one\n\n1:55:18.560 --> 1:55:22.760\n that won, one of the ones I looked on, they threw him way like up in the, uh, uh, past\n\n1:55:22.760 --> 1:55:26.280\n a lot, you know, out the way out there, there was nothing, but he somehow got a caribou\n\n1:55:26.280 --> 1:55:27.320\n and killed it.\n\n1:55:27.320 --> 1:55:32.080\n And he still lost a pound a day for 30 days with the caribou because his fat was stolen\n\n1:55:32.080 --> 1:55:37.380\n by a, uh, uh, and, and he could eat all the meat he wanted and then he almost got pulled\n\n1:55:37.380 --> 1:55:38.960\n because his weight loss.\n\n1:55:38.960 --> 1:55:39.960\n Right.\n\n1:55:39.960 --> 1:55:42.400\n Um, but that isn't actually a performance.\n\n1:55:42.400 --> 1:55:45.480\n So those types of keto and carnivore are not performance diets.\n\n1:55:45.480 --> 1:55:53.120\n So they're not going to be as effective at supplying, uh, the energy needs for high capacity\n\n1:55:53.120 --> 1:55:54.120\n training.\n\n1:55:54.120 --> 1:55:55.120\n So don't get me wrong.\n\n1:55:55.120 --> 1:56:01.960\n I mean, you can be a successful, like elite athlete with a, with a vegan diet, but it's\n\n1:56:01.960 --> 1:56:05.400\n not as easy to do it with other diets.\n\n1:56:05.400 --> 1:56:11.600\n So on you're missing some base nutrients, so many nutrients and meat, I believe, uh,\n\n1:56:11.600 --> 1:56:14.680\n having greens in your diet is really beneficial.\n\n1:56:14.680 --> 1:56:18.040\n Lots of research, but there's people in the other worlds that argue that they don't need\n\n1:56:18.040 --> 1:56:22.400\n them, but they help clear organs, provide micronutrients, all this sort of stuff.\n\n1:56:22.400 --> 1:56:25.800\n So I eat simply a whole well rounded diet.\n\n1:56:25.800 --> 1:56:32.640\n And I've gone from, I can go from 285 pounds squat and a ton of weight to eating less and\n\n1:56:32.640 --> 1:56:37.240\n dropping all the way down to, you know, seven, 8% body fat with veins standing out everywhere\n\n1:56:37.240 --> 1:56:43.960\n without a tissue on me, just with amazing, great tasting food to lose weight or be healthy\n\n1:56:43.960 --> 1:56:48.980\n does not mean that you need to eat flavorless bland food.\n\n1:56:48.980 --> 1:56:51.560\n So that's the main thing I try to get across.\n\n1:56:51.560 --> 1:56:52.560\n Yes.\n\n1:56:52.560 --> 1:56:53.560\n Eat less to lose weight.\n\n1:56:53.560 --> 1:56:54.720\n Eat more to gain weight.\n\n1:56:54.720 --> 1:56:55.720\n Yep.\n\n1:56:55.720 --> 1:56:56.720\n Make sure that you've got enough protein.\n\n1:56:56.720 --> 1:56:59.780\n Make sure that you've got your micronutrients covered, which is going to cover by eating\n\n1:56:59.780 --> 1:57:01.320\n real food.\n\n1:57:01.320 --> 1:57:03.380\n Don't go low fat, no fat.\n\n1:57:03.380 --> 1:57:07.780\n If you want a performance, don't go no carb, but if it works, any of those things.\n\n1:57:07.780 --> 1:57:13.920\n So diet approach, when you look at diets, understand that they're how aggressive they\n\n1:57:13.920 --> 1:57:14.920\n are.\n\n1:57:14.920 --> 1:57:16.400\n So like keto can make you lose a lot of weight.\n\n1:57:16.400 --> 1:57:17.760\n Carnivore can make you lose a lot of weight.\n\n1:57:17.760 --> 1:57:21.840\n A lot of that upfront is actually dropping glycogen stores.\n\n1:57:21.840 --> 1:57:25.720\n So you're actually just reducing water in your muscle and fat tissue.\n\n1:57:25.720 --> 1:57:29.320\n So which is why it doesn't, isn't as great for a performance diet.\n\n1:57:29.320 --> 1:57:37.080\n But understand that every diet also has a level of discipline and does it fit your lifestyle?\n\n1:57:37.080 --> 1:57:40.020\n So I suggest people don't find a diet.\n\n1:57:40.020 --> 1:57:44.160\n You need to find a lifestyle because that's what sustainable, I hate the word diet to\n\n1:57:44.160 --> 1:57:46.280\n begin with.\n\n1:57:46.280 --> 1:57:52.920\n But behaviors are sustainable and then do that and then over time the things you'll\n\n1:57:52.920 --> 1:57:55.640\n get to where you need to get.\n\n1:57:55.640 --> 1:58:02.280\n Diet itself, just by the name of it is not sustainable because it is a short term thing\n\n1:58:02.280 --> 1:58:03.840\n to get somewhere.\n\n1:58:03.840 --> 1:58:08.960\n Yeah, I tend to try to measure it because I definitely have a love heat relationship\n\n1:58:08.960 --> 1:58:09.960\n with food.\n\n1:58:09.960 --> 1:58:18.080\n I tend to look back and say like by following this particular protocol, lifestyle, whatever,\n\n1:58:18.080 --> 1:58:19.720\n what was the level of happiness?\n\n1:58:19.720 --> 1:58:20.720\n Yes.\n\n1:58:20.720 --> 1:58:25.560\n So not like weight loss or weight gain or all those kinds of things.\n\n1:58:25.560 --> 1:58:30.400\n It's the entirety of the picture, productivity, just feeling good throughout the day, socially\n\n1:58:30.400 --> 1:58:32.800\n also, like interacting with people.\n\n1:58:32.800 --> 1:58:37.840\n Because so much of a human connection, like I mentioned before, is over food.\n\n1:58:37.840 --> 1:58:41.600\n And if you're going to limit yourself in that regard, you're limiting a certain fundamental\n\n1:58:41.600 --> 1:58:43.040\n aspect of life.\n\n1:58:43.040 --> 1:58:49.920\n A number of years ago, I did like 20 to 22 hour fasts every day.\n\n1:58:49.920 --> 1:58:51.140\n And I'm like, well, this doesn't work.\n\n1:58:51.140 --> 1:58:53.280\n I can't do business lunches and stuff like that.\n\n1:58:53.280 --> 1:58:57.020\n So when I was in my fasting thing, I went to a 16 so I could have a light lunch just\n\n1:58:57.020 --> 1:59:01.800\n for the social aspect of it and perform that.\n\n1:59:01.800 --> 1:59:07.560\n And then that's why the typical bodybuilding, like the eight meal a day diet has never worked\n\n1:59:07.560 --> 1:59:11.360\n for me because I've always been a very bit like trying to fit that between meetings and\n\n1:59:11.360 --> 1:59:12.900\n other stuff.\n\n1:59:12.900 --> 1:59:18.240\n What that diet provides is it just you get less bloat in distention of a larger meal.\n\n1:59:18.240 --> 1:59:20.760\n But at the end of the day, you get the same exact results.\n\n1:59:20.760 --> 1:59:26.160\n Pick a lifestyle, live that you can have really great tasting food.\n\n1:59:26.160 --> 1:59:28.400\n And that to me is the same thing.\n\n1:59:28.400 --> 1:59:32.640\n And this is why I'm like really hitting this point, because also with the dieting and like\n\n1:59:32.640 --> 1:59:37.800\n the approach like, oh, I'm going to do this and people pick these chicken and broccoli\n\n1:59:37.800 --> 1:59:39.480\n recipes and guess what?\n\n1:59:39.480 --> 1:59:40.780\n You're going to break.\n\n1:59:40.780 --> 1:59:46.920\n If you do not, if you do not enjoy it, you will break.\n\n1:59:46.920 --> 1:59:50.480\n So it is a very important point.\n\n1:59:50.480 --> 1:59:59.480\n Well, I also slightly push back or maybe to elaborate, if you don't enjoy moderation,\n\n1:59:59.480 --> 2:00:05.920\n for me particularly, I have trouble moderating certain things, most foods, I would say.\n\n2:00:05.920 --> 2:00:12.540\n So my source of happiness comes with foods, even if they're bland, the ones that can enjoy,\n\n2:00:12.540 --> 2:00:13.540\n but enjoy moderation.\n\n2:00:13.540 --> 2:00:16.280\n So there's, I mean, I enjoy every piece of food.\n\n2:00:16.280 --> 2:00:23.840\n So it's like, it's if you can enjoy the full lifestyle, it's not just the particular experience,\n\n2:00:23.840 --> 2:00:26.120\n but like the full journey.\n\n2:00:26.120 --> 2:00:29.480\n Does it fit your lifestyle?\n\n2:00:29.480 --> 2:00:37.080\n So let me ask about a complicated topic that's sometimes a bit controversial, which is steroids\n\n2:00:37.080 --> 2:00:42.040\n and maybe TRT, testosterone replacement therapy.\n\n2:00:42.040 --> 2:00:44.000\n What role does that play in strength training?\n\n2:00:44.000 --> 2:00:45.460\n All right.\n\n2:00:45.460 --> 2:00:47.200\n We're going to go there.\n\n2:00:47.200 --> 2:00:48.200\n Let's go there.\n\n2:00:48.200 --> 2:00:49.200\n Yeah.\n\n2:00:49.200 --> 2:00:52.580\n But it's an important discussion to have.\n\n2:00:52.580 --> 2:00:58.000\n I think that it's something that I can be more transparent on.\n\n2:00:58.000 --> 2:01:01.740\n In my past, I wasn't able to do to the career that I had.\n\n2:01:01.740 --> 2:01:09.080\n So just like covering that stuff in a, you know, one of the, on a public forum when you're\n\n2:01:09.080 --> 2:01:14.600\n highly looked at being an executive for recruiting and other stuff, like it was an area I had\n\n2:01:14.600 --> 2:01:18.640\n to just kind of pass on, right?\n\n2:01:18.640 --> 2:01:21.680\n Now I've used steroids.\n\n2:01:21.680 --> 2:01:30.480\n I've used them since I was 33 and I basically just use TRT now after my big squat.\n\n2:01:30.480 --> 2:01:38.080\n So for 10 years I used them and there's some interesting components to this.\n\n2:01:38.080 --> 2:01:44.560\n So one is just the gray area of what we call performance enhancing supplements.\n\n2:01:44.560 --> 2:01:55.200\n So performance was a PEDs that the line of what defines a PED is ever shifting and it's\n\n2:01:55.200 --> 2:02:00.800\n shifting based on society norms, cultural norms, government body agencies, all these\n\n2:02:00.800 --> 2:02:01.800\n sorts of stuff.\n\n2:02:01.800 --> 2:02:03.040\n So I'm not making excuses here.\n\n2:02:03.040 --> 2:02:08.080\n So I just want to elaborate before I actually start digging into the details here because\n\n2:02:08.080 --> 2:02:15.600\n performance enhancing, I could take sodium bicarbonate and enhance my ability to perform\n\n2:02:15.600 --> 2:02:17.160\n deadlifts for reps.\n\n2:02:17.160 --> 2:02:18.160\n Guess what?\n\n2:02:18.160 --> 2:02:20.680\n I did that for my Guinness world record for deadlifts in a minute.\n\n2:02:20.680 --> 2:02:21.680\n Okay.\n\n2:02:21.680 --> 2:02:27.040\n People do it for rowing or other, they use a high capacity type stuff.\n\n2:02:27.040 --> 2:02:28.680\n It is performance enhancing.\n\n2:02:28.680 --> 2:02:35.200\n It is a chemical, it is baking soda, all right?\n\n2:02:35.200 --> 2:02:40.440\n They're not able to make it illegal because everybody eats bread, well, not everyone.\n\n2:02:40.440 --> 2:02:45.280\n And so it's a little hard to test for no matter what you do at any level.\n\n2:02:45.280 --> 2:02:51.140\n So that's an extreme example, but other examples, you're drinking an energy drink in that cup\n\n2:02:51.140 --> 2:02:56.440\n there a little while ago and in America you can get an energy drink with 240 milligrams\n\n2:02:56.440 --> 2:02:57.920\n of caffeine in it.\n\n2:02:57.920 --> 2:03:00.060\n In Canada, that's too dangerous.\n\n2:03:00.060 --> 2:03:07.200\n You can only get 140, but you can go buy a ephedra and ephedra is illegal in America.\n\n2:03:07.200 --> 2:03:10.400\n And so these things bounce back and forth all the time.\n\n2:03:10.400 --> 2:03:20.160\n I could take Yohimbi and in Europe or Australia, it is a drug and classified and America, it\n\n2:03:20.160 --> 2:03:21.160\n is not.\n\n2:03:21.160 --> 2:03:26.480\n It's an herbal root in a lot, I actually have one of my supplements except for the overseas\n\n2:03:26.480 --> 2:03:27.480\n version.\n\n2:03:27.480 --> 2:03:34.920\n Anyway, the point I'm getting is no matter what you do at some point, by someone's standards,\n\n2:03:34.920 --> 2:03:37.600\n you are cheating.\n\n2:03:37.600 --> 2:03:44.280\n And because it is, you're taking something that, but you could work around these things\n\n2:03:44.280 --> 2:03:48.480\n with nutritional ways or other ways versus taking a chemical strip and there's whole\n\n2:03:48.480 --> 2:03:52.080\n lots of ways to do this, but it's like, oh no, it's steroids, it's not, it's injectable,\n\n2:03:52.080 --> 2:03:53.080\n it's not.\n\n2:03:53.080 --> 2:03:57.780\n So somewhere there's a culture or a person that will say you're cheating no matter what.\n\n2:03:57.780 --> 2:04:01.760\n So it's a self defined, you need to define it for yourself unless you're competing in\n\n2:04:01.760 --> 2:04:07.440\n an organization that has testing, then it's a straight ethical thing and it's either right\n\n2:04:07.440 --> 2:04:10.400\n or wrong in my opinion.\n\n2:04:10.400 --> 2:04:16.560\n That's kind of the overall dilemma of it is if you want to see what you're totally capable\n\n2:04:16.560 --> 2:04:24.480\n of, you have to decide yourself what's okay or not to that level.\n\n2:04:24.480 --> 2:04:29.480\n There is no body that can say something yes or no.\n\n2:04:29.480 --> 2:04:34.580\n When there's an event like the Olympics, maybe then you have a standard that you're all trying\n\n2:04:34.580 --> 2:04:40.160\n to adhere to and then it makes sense to keep a certain, like to be within, there's an ethical\n\n2:04:40.160 --> 2:04:41.160\n imperative.\n\n2:04:41.160 --> 2:04:46.800\n So yeah, I'm not talking about that, I'm agreeing to compete in this by these rules.\n\n2:04:46.800 --> 2:04:51.840\n Yeah, but when you're trying to maximize your own performance, whatever that journey is,\n\n2:04:51.840 --> 2:04:57.920\n whatever that goal is, that's a different story and it's not easy to figure that out.\n\n2:04:57.920 --> 2:05:00.800\n You're just like dancing around the subject, whatever.\n\n2:05:00.800 --> 2:05:06.080\n Well guess what, I've got a prescription for growth hormone and testosterone.\n\n2:05:06.080 --> 2:05:08.960\n It's legal for me to take and you know what?\n\n2:05:08.960 --> 2:05:14.160\n A lot of the people that are in front of the camera in the media, politicians and news\n\n2:05:14.160 --> 2:05:19.960\n people and the people that are there saying the no drug stuff, they're going to anti aging\n\n2:05:19.960 --> 2:05:26.000\n clinics to look better and they have a prescription for growth hormone and testosterone themselves.\n\n2:05:26.000 --> 2:05:28.880\n But in their eyes, it's okay.\n\n2:05:28.880 --> 2:05:34.680\n It is a prescription from their doctor because they have the money to do it.\n\n2:05:34.680 --> 2:05:37.800\n So it's legal and it's fine.\n\n2:05:37.800 --> 2:05:44.280\n If I is interesting in Oregon, anybody and I don't know what other states over the age\n\n2:05:44.280 --> 2:05:51.440\n of 16 can without parents permission by the way, walk into a gender clinic and as a female\n\n2:05:51.440 --> 2:05:54.520\n and get a prescription for testosterone.\n\n2:05:54.520 --> 2:06:02.560\n But as an athlete, if I've got low testosterone, I am so flow, I've got depression, I can't\n\n2:06:02.560 --> 2:06:04.000\n have sex with my wife.\n\n2:06:04.000 --> 2:06:05.880\n It's affecting my quality of life.\n\n2:06:05.880 --> 2:06:11.160\n I will have to fight tooth and nail to get testosterone just as a prescription and then\n\n2:06:11.160 --> 2:06:15.880\n I will get kicked out of my organization for competing.\n\n2:06:15.880 --> 2:06:18.120\n So you understand how gray this stuff gets.\n\n2:06:18.120 --> 2:06:23.760\n Do you think the stigma on testosterone is the reason we're not having like a healthy\n\n2:06:23.760 --> 2:06:26.360\n conversation about when it's proper?\n\n2:06:26.360 --> 2:06:30.640\n Like what are the proper uses of testosterone in an athlete's life and just the regular\n\n2:06:30.640 --> 2:06:32.000\n human life?\n\n2:06:32.000 --> 2:06:34.240\n Yeah, absolutely.\n\n2:06:34.240 --> 2:06:35.760\n And it's just, it's like anything.\n\n2:06:35.760 --> 2:06:38.960\n It's like I said, it is lines that we pick and draw.\n\n2:06:38.960 --> 2:06:42.440\n Anytime you put that out there, people are going to have different opinions where those\n\n2:06:42.440 --> 2:06:43.440\n lines are.\n\n2:06:43.440 --> 2:06:46.160\n So now when it comes to strength, here's an interesting thing.\n\n2:06:46.160 --> 2:06:50.040\n In powerlifting, there's tested federations and non tested federations.\n\n2:06:50.040 --> 2:06:55.360\n So we can literally look at the statistical data and actually find out what do steroids\n\n2:06:55.360 --> 2:06:56.620\n do.\n\n2:06:56.620 --> 2:07:03.160\n And so it's pretty clear that steroids provide about a 10% increase in strength on average\n\n2:07:03.160 --> 2:07:04.880\n over not.\n\n2:07:04.880 --> 2:07:09.040\n Now that does take out the fact that steroids will put you in, allow you to put on more\n\n2:07:09.040 --> 2:07:12.920\n mass so you'll go up a weight class a lot of times.\n\n2:07:12.920 --> 2:07:19.560\n So as a whole, you could definitely lift more probably than the 10% over time, right?\n\n2:07:19.560 --> 2:07:23.400\n And then we think about steroids as the ability to just put on muscle.\n\n2:07:23.400 --> 2:07:27.400\n And here's where things get a little interesting, even with people that use steroids is not\n\n2:07:27.400 --> 2:07:31.360\n understanding the neurological impacts that steroids have.\n\n2:07:31.360 --> 2:07:36.920\n Because you could take some steroids right now and be stronger in 10 minutes.\n\n2:07:36.920 --> 2:07:42.140\n That's clearly not done anything, you know, from a physiology standpoint to make you stronger.\n\n2:07:42.140 --> 2:07:46.920\n But we have a tapped in neurologically to to elicit those games.\n\n2:07:46.920 --> 2:07:49.480\n And there's a whole lot that happens neurologically.\n\n2:07:49.480 --> 2:07:56.320\n Like how much science is there in terms of all the different ways you could take steroids,\n\n2:07:56.320 --> 2:08:03.080\n which kinds of steroids, the timing, the dose, the all of those things to develop the neurological,\n\n2:08:03.080 --> 2:08:08.080\n the physical, the skeletal, like all the, you know, you've talked with such depth about\n\n2:08:08.080 --> 2:08:16.080\n the science of strength building in terms of form, in terms of the equipment that you\n\n2:08:16.080 --> 2:08:17.080\n use.\n\n2:08:17.080 --> 2:08:24.120\n It seems like a component, you know, the use of steroids should be an equal level of scientific\n\n2:08:24.120 --> 2:08:26.040\n rigor when applying them.\n\n2:08:26.040 --> 2:08:27.040\n It is.\n\n2:08:27.040 --> 2:08:32.240\n Now, the research is harder to get because of what it is.\n\n2:08:32.240 --> 2:08:36.320\n But there is a lot of research that was done when they were legal.\n\n2:08:36.320 --> 2:08:40.240\n So they were legal up in through the through, I think, the mid 80s.\n\n2:08:40.240 --> 2:08:48.680\n And so a lot of the classical high, high benefit to low risk steroids were studied.\n\n2:08:48.680 --> 2:08:52.320\n And then since then, there's a lot of like designer steroids or new steroids that have\n\n2:08:52.320 --> 2:08:58.040\n come up that don't have a lot of research around safety and risk and things of that\n\n2:08:58.040 --> 2:08:59.040\n nature.\n\n2:08:59.040 --> 2:09:04.360\n And we can't do that because it's, you know, because of the legality around these things.\n\n2:09:04.360 --> 2:09:09.040\n But some of the stuff on the neurological function is really just understanding how\n\n2:09:09.040 --> 2:09:15.040\n that chemical structure works and what it's doing to the neurotransmitters, what it's\n\n2:09:15.040 --> 2:09:17.060\n doing.\n\n2:09:17.060 --> 2:09:23.920\n And so some of it is is really talking to people that have experience with it.\n\n2:09:23.920 --> 2:09:27.020\n And the other is understanding those structures and what they do.\n\n2:09:27.020 --> 2:09:33.600\n The neurological component, I think, is more interesting than than most, because the most\n\n2:09:33.600 --> 2:09:37.080\n steroids act through increasing muscle protein synthesis.\n\n2:09:37.080 --> 2:09:42.700\n That's how you add more muscle is they have an anti catabolic effect and they have a muscle\n\n2:09:42.700 --> 2:09:45.440\n protein synthesis enhancing effect.\n\n2:09:45.440 --> 2:09:49.560\n So it reduces the amount of muscle that you waste and increases the amount of muscle that\n\n2:09:49.560 --> 2:09:51.520\n you put on.\n\n2:09:51.520 --> 2:09:59.120\n But the neurological component is is tremendously valuable for what it can do for your training\n\n2:09:59.120 --> 2:10:00.120\n workout.\n\n2:10:00.120 --> 2:10:04.760\n Like if I handle more load over time, I'm going to make more progress.\n\n2:10:04.760 --> 2:10:09.040\n If I can actually just stimulate more neurological effects for a specific event, it's going to\n\n2:10:09.040 --> 2:10:10.920\n have an impact.\n\n2:10:10.920 --> 2:10:11.920\n Right.\n\n2:10:11.920 --> 2:10:14.520\n But there's other ways that you can tap into this, too.\n\n2:10:14.520 --> 2:10:18.040\n Things that you can tap into mentally with great practice, with meditation and other\n\n2:10:18.040 --> 2:10:21.680\n stuff that will have the same effect.\n\n2:10:21.680 --> 2:10:25.480\n People probably think I'm over speaking, especially steroid users that are listening to this.\n\n2:10:25.480 --> 2:10:29.400\n Well, at least I'm talking out my ass, but I'm not.\n\n2:10:29.400 --> 2:10:34.920\n Because I I have experience with this stuff on both ends.\n\n2:10:34.920 --> 2:10:39.360\n And some of those areas, a lot of people don't have the experience with that.\n\n2:10:39.360 --> 2:10:44.800\n What I've kind of heard from people is the confidence that comes with steroids.\n\n2:10:44.800 --> 2:10:50.280\n It feels like not to call it placebo, but it seems like the psychological benefits of\n\n2:10:50.280 --> 2:10:57.840\n steroids is huge and that you feel like there's a confidence that seems to be coupled with\n\n2:10:57.840 --> 2:11:00.440\n the actual biological and chemical effects.\n\n2:11:00.440 --> 2:11:03.300\n I have actually a neurological condition.\n\n2:11:03.300 --> 2:11:06.860\n So I actually don't feel a lot of that stuff that people because there are certain steroids\n\n2:11:06.860 --> 2:11:14.680\n that like people like you're like very extreme ones, like that would make somebody bite someone's\n\n2:11:14.680 --> 2:11:21.120\n ear off in a fight, for example, almost like aggression that and they literally do nothing.\n\n2:11:21.120 --> 2:11:26.840\n I'm like always just chillin and I don't like that effect.\n\n2:11:26.840 --> 2:11:31.040\n But but neurologically, they're still having those effects, but I don't get those feels\n\n2:11:31.040 --> 2:11:34.340\n that other people have from those.\n\n2:11:34.340 --> 2:11:39.800\n But yes, there's that immediate boost in aggression and a confidence and stuff that come with\n\n2:11:39.800 --> 2:11:44.800\n a lot of those ones that deal on the neurological overall as good sense of well being, just\n\n2:11:44.800 --> 2:11:49.120\n like from being on testosterone, like it's going to affect your mood.\n\n2:11:49.120 --> 2:11:50.120\n And it's interesting.\n\n2:11:50.120 --> 2:11:53.960\n So testosterone replacement therapy, if we walk down that path now and kind of switch\n\n2:11:53.960 --> 2:12:02.000\n gears, you know, we find that men today have declining testosterone over what has historically\n\n2:12:02.000 --> 2:12:03.000\n been in the past.\n\n2:12:03.000 --> 2:12:08.960\n So right now, I think a thirty five year old testosterone is shown to be about half what\n\n2:12:08.960 --> 2:12:12.540\n it was just 50 years ago.\n\n2:12:12.540 --> 2:12:15.660\n So I don't know if we could argue the point.\n\n2:12:15.660 --> 2:12:21.360\n We don't really have the science to validate any of it, but it could be society as far\n\n2:12:21.360 --> 2:12:26.840\n as the impact that it's having on the mental health for men.\n\n2:12:26.840 --> 2:12:31.720\n It could be the the estrogens floating around in the water from all the chemicals and birth\n\n2:12:31.720 --> 2:12:36.640\n control and all this sort of stuff could be a lot of things.\n\n2:12:36.640 --> 2:12:42.080\n But it is a fact that average testosterone is significantly lower and that is going to\n\n2:12:42.080 --> 2:12:47.040\n end up affecting life, quality of life, as well as your longevity, because it will affect\n\n2:12:47.040 --> 2:12:48.040\n those things.\n\n2:12:48.040 --> 2:12:53.000\n But on the other end, steroids and TRT, particularly steroids, come with a lot of negative health\n\n2:12:53.000 --> 2:12:58.160\n benefits, not benefits, a lot of negative health ramifications.\n\n2:12:58.160 --> 2:13:02.760\n And so, you know, if I knew what I know now, I don't know that I would have gone that path.\n\n2:13:02.760 --> 2:13:03.760\n I didn't.\n\n2:13:03.760 --> 2:13:07.560\n I didn't till I was thirty three, which is kind of an outlier for a strength athlete.\n\n2:13:07.560 --> 2:13:13.680\n I was I was a four times body weight deadlifter, eight hundred plus pounds at one ninety eight.\n\n2:13:13.680 --> 2:13:18.720\n And it's pretty dang strong before I went down that path.\n\n2:13:18.720 --> 2:13:21.100\n And that's because I wanted to see what I was capable of.\n\n2:13:21.100 --> 2:13:24.640\n But I was reaching a point that it was either I need to do that or not.\n\n2:13:24.640 --> 2:13:30.480\n My testosterone, my natural testosterone levels were actually I think below 300 is actually\n\n2:13:30.480 --> 2:13:31.480\n the threshold.\n\n2:13:31.480 --> 2:13:35.640\n So I was being told to go on TRT for the last couple of years, probably just because I was\n\n2:13:35.640 --> 2:13:38.600\n pushing so hard and the stress level was driving my test down.\n\n2:13:38.600 --> 2:13:41.700\n So it was self imposed more than likely.\n\n2:13:41.700 --> 2:13:46.000\n But I put it off because I wanted to set all the drug free records and I set the ones that\n\n2:13:46.000 --> 2:13:47.000\n I wanted.\n\n2:13:47.000 --> 2:13:48.000\n And then it was thirty three.\n\n2:13:48.000 --> 2:13:52.200\n I'm, you know, entering the age category and I'm like, I'm going to go on TRT.\n\n2:13:52.200 --> 2:13:55.680\n I did not feel like I should be with TRT personally.\n\n2:13:55.680 --> 2:14:00.600\n My ethical standard was I shouldn't be competing in tested events anymore.\n\n2:14:00.600 --> 2:14:04.180\n There are federations that will allow you with your you show up with your script and\n\n2:14:04.180 --> 2:14:08.100\n you do your test and you're below a certain level, but you're still on.\n\n2:14:08.100 --> 2:14:09.520\n But for me, I'm like, that's not you.\n\n2:14:09.520 --> 2:14:15.140\n So I'm like, I may as well at this point use steroids.\n\n2:14:15.140 --> 2:14:19.880\n But since then, you know, understanding all those ramifications, you know, I might not\n\n2:14:19.880 --> 2:14:24.280\n have gone down that route quite so fast and easily.\n\n2:14:24.280 --> 2:14:29.340\n But I continued because I also have a lot of resources that other people don't and being\n\n2:14:29.340 --> 2:14:32.840\n able to assess and understand and put things in place to mitigate that.\n\n2:14:32.840 --> 2:14:33.880\n So you need to be.\n\n2:14:33.880 --> 2:14:39.240\n And the other thing is, once you go on, it's literally a decision for life.\n\n2:14:39.240 --> 2:14:45.480\n Not just but realistically is because your your quality of life, your feeling is going\n\n2:14:45.480 --> 2:14:49.180\n to be enhanced quite a bit and you're not going to want to go back.\n\n2:14:49.180 --> 2:14:53.120\n And if you go back, it's going to be less than it was before.\n\n2:14:53.120 --> 2:14:54.900\n That's how the endocrine system works.\n\n2:14:54.900 --> 2:14:58.600\n There are ways to try to recover and bring that up, but it might be a while.\n\n2:14:58.600 --> 2:15:02.000\n And if you've been on for a while, it definitely is not an option.\n\n2:15:02.000 --> 2:15:06.480\n So those are big things that people need to understand that you're going to have some\n\n2:15:06.480 --> 2:15:07.480\n things in there.\n\n2:15:07.480 --> 2:15:15.160\n And even TRT has some potential, especially at higher levels, that it's going to, you\n\n2:15:15.160 --> 2:15:18.180\n know, increase the risk for prostate cancer.\n\n2:15:18.180 --> 2:15:24.160\n It's going to potentially cause some hypertrophy of the left ventricle of the heart and some\n\n2:15:24.160 --> 2:15:27.720\n potential plaque buildup of some of those key arteries around there that's going to\n\n2:15:27.720 --> 2:15:30.800\n have an impact on your cardiovascular health.\n\n2:15:30.800 --> 2:15:35.160\n There's things that you can do again, but everything is like the shoe story, right?\n\n2:15:35.160 --> 2:15:40.440\n Where I'm anti anti shoe, but I'm going, well, we could put band aids on this.\n\n2:15:40.440 --> 2:15:41.440\n So it's...\n\n2:15:41.440 --> 2:15:45.840\n But there's a quality of life that comes with it, the increase in quality of life.\n\n2:15:45.840 --> 2:15:50.040\n And if you do it correctly, I think for me, for me, I definitely would not live without\n\n2:15:50.040 --> 2:15:53.120\n TRT, even with knowing what I know now.\n\n2:15:53.120 --> 2:16:00.840\n It this age and the quality of life and being able to be there, have the energy, the recovery.\n\n2:16:00.840 --> 2:16:04.920\n That's a big thing where all this, though, I talked about muscle protein synthesis and\n\n2:16:04.920 --> 2:16:07.560\n anti catabolism as being big drivers.\n\n2:16:07.560 --> 2:16:12.640\n But recovery is the other big aspect that they that they offer probably as a result\n\n2:16:12.640 --> 2:16:17.240\n of those, but that's going to those are going to be the big enhancement.\n\n2:16:17.240 --> 2:16:23.840\n So just doing steroids, steroids is going to increase all the other stuff that you do.\n\n2:16:23.840 --> 2:16:28.000\n So if you if you have good training, if good diet, good quality of sleep, like all this\n\n2:16:28.000 --> 2:16:31.280\n other stuff, then you can take advantage of that.\n\n2:16:31.280 --> 2:16:35.280\n But you could choose steroids and nobody would know.\n\n2:16:35.280 --> 2:16:39.760\n And honestly, you go down to 24 hour fitness and you'll see a bunch of, you know, late,\n\n2:16:39.760 --> 2:16:43.380\n you know, 19 to 21 year old kids that are all kind of red and one hundred and fifty\n\n2:16:43.380 --> 2:16:46.440\n pounds that look like that don't look like anything.\n\n2:16:46.440 --> 2:16:52.600\n And they're a bunch of them will be using steroids because they're not like.\n\n2:16:52.600 --> 2:16:56.700\n So it's it's not the it's not going to make a champion, like you said, it's not going\n\n2:16:56.700 --> 2:16:58.160\n to at most.\n\n2:16:58.160 --> 2:16:59.160\n Guess what?\n\n2:16:59.160 --> 2:17:00.160\n I was already at an elite level.\n\n2:17:00.160 --> 2:17:05.960\n I was one of the best in the world before I started using it doesn't it doesn't do that.\n\n2:17:05.960 --> 2:17:08.840\n It does a 10 percent increase at best.\n\n2:17:08.840 --> 2:17:11.400\n And that's proven in the statistics, which is interesting because most people don't know\n\n2:17:11.400 --> 2:17:12.400\n this.\n\n2:17:12.400 --> 2:17:15.120\n Like it the data is right there.\n\n2:17:15.120 --> 2:17:16.120\n Yeah.\n\n2:17:16.120 --> 2:17:17.120\n Yeah.\n\n2:17:17.120 --> 2:17:27.760\n And that's why I'm often saddened by maybe the negative view of somebody like Lance Armstrong,\n\n2:17:27.760 --> 2:17:33.360\n who is one of the greatest athletes in history and everybody else that he was competing against.\n\n2:17:33.360 --> 2:17:34.360\n I'm sorry.\n\n2:17:34.360 --> 2:17:35.360\n Yeah.\n\n2:17:35.360 --> 2:17:36.960\n I hate to blow anybody's bubble.\n\n2:17:36.960 --> 2:17:41.380\n But regardless, if I told you my ethical pieces with saying that you're going to be at something\n\n2:17:41.380 --> 2:17:44.840\n at an elite level.\n\n2:17:44.840 --> 2:17:49.120\n You look at most a lot of those big figures out there.\n\n2:17:49.120 --> 2:17:53.020\n When their income in your life relies on it, yeah, you're going to push those limits.\n\n2:17:53.020 --> 2:17:58.600\n So maybe maybe my ethical would change if if if I was in that position, too, because\n\n2:17:58.600 --> 2:18:02.880\n here's the thing where I believe like someone is.\n\n2:18:02.880 --> 2:18:05.400\n I think people should avoid steroids.\n\n2:18:05.400 --> 2:18:10.400\n TRT, probably something worth taking a look at what your levels are when you're in the\n\n2:18:10.400 --> 2:18:14.160\n thirty five to forty five range and see what decision you decide to make from there.\n\n2:18:14.160 --> 2:18:16.600\n And that's a decision that you make for the rest of your life.\n\n2:18:16.600 --> 2:18:21.440\n The only times that you should be taking a look at steroids is if it's it's funding your\n\n2:18:21.440 --> 2:18:22.440\n life.\n\n2:18:22.440 --> 2:18:28.000\n It's creating that it is your job and it's doing like and honestly, it was for me.\n\n2:18:28.000 --> 2:18:30.760\n I so was it the only thing?\n\n2:18:30.760 --> 2:18:31.760\n No, no.\n\n2:18:31.760 --> 2:18:38.320\n If you want to get into neurology, it's neurotransmitters and alcohol is really interesting discussion\n\n2:18:38.320 --> 2:18:39.880\n on performance enhancement.\n\n2:18:39.880 --> 2:18:45.400\n So when I lift heavy and so I always promote it, like not more than a drink or two, like\n\n2:18:45.400 --> 2:18:48.840\n once or twice a month is what all I'm talking about when I'm what I'm saying.\n\n2:18:48.840 --> 2:18:50.600\n So what's the timing of the drink?\n\n2:18:50.600 --> 2:18:53.520\n Are we talking about three to five minutes before?\n\n2:18:53.520 --> 2:18:54.520\n Yes.\n\n2:18:54.520 --> 2:18:56.440\n And we're talking about beer.\n\n2:18:56.440 --> 2:18:58.680\n It doesn't matter the the source.\n\n2:18:58.680 --> 2:19:01.560\n So I shots are the easiest.\n\n2:19:01.560 --> 2:19:05.680\n You want something that is not going to have some sort of regurgitory effect or bloating\n\n2:19:05.680 --> 2:19:09.520\n effect or anything like that, but you want to have the quick hit of energy.\n\n2:19:09.520 --> 2:19:14.800\n So it's a preferential energy source moves above ketones, carbs, everything at seven\n\n2:19:14.800 --> 2:19:15.880\n calories per gram.\n\n2:19:15.880 --> 2:19:19.720\n But then there's some really interesting things that happen, spikes blood pressure, which\n\n2:19:19.720 --> 2:19:21.660\n is going to make weights feel lighter.\n\n2:19:21.660 --> 2:19:26.240\n So when you're in your early 20s and you're trying to hit up, you know, some attractive\n\n2:19:26.240 --> 2:19:30.980\n person at the bar, you're with your buddies and you're like, you know, and you got second\n\n2:19:30.980 --> 2:19:31.980\n guess.\n\n2:19:31.980 --> 2:19:32.980\n Oh, should I?\n\n2:19:32.980 --> 2:19:33.980\n Should I?\n\n2:19:33.980 --> 2:19:36.880\n And they go, have a shot of liquid courage and you have one.\n\n2:19:36.880 --> 2:19:41.560\n And all of a sudden the second thoughts, the second guessing all that drops away.\n\n2:19:41.560 --> 2:19:46.040\n Like you're focused in the moment and you walk over and you actually perform a little\n\n2:19:46.040 --> 2:19:48.200\n better like conversation wise than you normally would.\n\n2:19:48.200 --> 2:19:51.000\n Now if you have five or six and then go over, you're gonna make a fool of yourself.\n\n2:19:51.000 --> 2:19:52.720\n So it's all about timing and amount.\n\n2:19:52.720 --> 2:19:54.560\n But there is a reason that that happens.\n\n2:19:54.560 --> 2:19:58.320\n So anyway, I'm known for promoting this whiskey and deadlift concept.\n\n2:19:58.320 --> 2:19:59.320\n I love this.\n\n2:19:59.320 --> 2:20:00.320\n But it works.\n\n2:20:00.320 --> 2:20:01.960\n It's like the Eastern block.\n\n2:20:01.960 --> 2:20:02.960\n That's where it came.\n\n2:20:02.960 --> 2:20:03.960\n That's where I stole it from.\n\n2:20:03.960 --> 2:20:08.720\n Because I was watching all these Russian lifters would have a shot of vodka or something before\n\n2:20:08.720 --> 2:20:09.720\n they go lift.\n\n2:20:09.720 --> 2:20:11.280\n And I'm like, there's something here.\n\n2:20:11.280 --> 2:20:14.920\n So I started experimenting with it and I'm like, that works.\n\n2:20:14.920 --> 2:20:16.000\n And then I started researching.\n\n2:20:16.000 --> 2:20:17.200\n Nobody talks about this stuff.\n\n2:20:17.200 --> 2:20:21.360\n So it takes a while to start piecing together all the stuff that actually happens to make\n\n2:20:21.360 --> 2:20:22.540\n that happen.\n\n2:20:22.540 --> 2:20:28.280\n But it moves away the things that you're going to, the concerns about the ramifications in\n\n2:20:28.280 --> 2:20:29.600\n the future and the other stuff.\n\n2:20:29.600 --> 2:20:34.960\n So the, um, but brings you into the moment and then the dopamine hit and the other, and\n\n2:20:34.960 --> 2:20:37.560\n then it enhances whatever mood that you're in.\n\n2:20:37.560 --> 2:20:45.060\n But all of a sudden you get in the state much easier.\n\n2:20:45.060 --> 2:20:49.840\n And so it's really, really interesting, but it's very, it's a very small amount needed\n\n2:20:49.840 --> 2:20:55.000\n and very time sensitive, but it can be so much more powerful than like drugs people\n\n2:20:55.000 --> 2:20:57.140\n use for this stuff.\n\n2:20:57.140 --> 2:21:01.800\n It ties really together with meditative state and other pieces to, to, to get you into that\n\n2:21:01.800 --> 2:21:07.480\n flow state, those thoughts about failure, what if, what, like all that you, you get\n\n2:21:07.480 --> 2:21:13.040\n into that zone, that moment, that time anyway.\n\n2:21:13.040 --> 2:21:14.040\n So interesting.\n\n2:21:14.040 --> 2:21:18.640\n An alcoholic is promoting out, you know, but there's an important point here, which not\n\n2:21:18.640 --> 2:21:19.640\n often talked about.\n\n2:21:19.640 --> 2:21:24.240\n I think it is fascinating that because you can get into so much trouble with alcohol\n\n2:21:24.240 --> 2:21:29.640\n when used in excess, people don't often talk about the, the positive aspects of alcohol,\n\n2:21:29.640 --> 2:21:34.280\n even in your college years.\n\n2:21:34.280 --> 2:21:37.440\n It had a, it had a lasting effect on who I am as a person.\n\n2:21:37.440 --> 2:21:41.080\n I don't think people give enough credit to the positive aspect.\n\n2:21:41.080 --> 2:21:45.320\n See, you could have accomplished a lot of those same things with a little more moderation,\n\n2:21:45.320 --> 2:21:50.920\n which I think people should talk about more, which is like the way to open up a personality,\n\n2:21:50.920 --> 2:21:56.720\n like the flowering of the full character and the weirdness and the, the, the, like the\n\n2:21:56.720 --> 2:22:00.160\n beauty of who you are as a human being could be opened up with alcohol.\n\n2:22:00.160 --> 2:22:01.800\n And that's really interesting to think about.\n\n2:22:01.800 --> 2:22:10.080\n You should try some podcasts with a, with a shot and, and these, I do this sometimes\n\n2:22:10.080 --> 2:22:15.600\n with myself and guests and it will change the conversation, lubricates the conversation.\n\n2:22:15.600 --> 2:22:20.080\n Definitely not the excess and which is what I learned because I went all the way in because\n\n2:22:20.080 --> 2:22:22.160\n I do everything at extremes.\n\n2:22:22.160 --> 2:22:28.840\n So it was a really hard lesson that took me a lot of time to unwind, but it is interesting\n\n2:22:28.840 --> 2:22:33.160\n and people don't discuss those things because it's, it's either this or this.\n\n2:22:33.160 --> 2:22:37.020\n You're one of the greatest strength athletes of all time.\n\n2:22:37.020 --> 2:22:43.760\n So it's worthwhile to consider how you optimize the, the feats of strength that you reach\n\n2:22:43.760 --> 2:22:47.080\n for with things like steroids.\n\n2:22:47.080 --> 2:22:52.120\n It makes perfect sense and I think that was a, from my perspective, I think it was probably\n\n2:22:52.120 --> 2:22:53.120\n the right decision.\n\n2:22:53.120 --> 2:22:58.640\n You've achieved something incredible that inspires a huge number of people.\n\n2:22:58.640 --> 2:22:59.640\n That's it.\n\n2:22:59.640 --> 2:23:03.360\n And you've shown to yourself and to the world, but what the human body can accomplish.\n\n2:23:03.360 --> 2:23:04.360\n Yep.\n\n2:23:04.360 --> 2:23:05.360\n That's incredible.\n\n2:23:05.360 --> 2:23:10.360\n And no matter if I push to a less weight and if I disclosed everything that I did and\n\n2:23:10.360 --> 2:23:15.400\n I didn't, when I wasn't using steroids, in my opinion, if we went through everything,\n\n2:23:15.400 --> 2:23:18.760\n there would people that would say, you're using performance enhancing, no matter what,\n\n2:23:18.760 --> 2:23:20.480\n like it is, it's straight up.\n\n2:23:20.480 --> 2:23:22.320\n So you just need to be okay with it yourself.\n\n2:23:22.320 --> 2:23:27.980\n And so I had to make the call, I want to see what the true potential is of every, let's\n\n2:23:27.980 --> 2:23:32.920\n throw everything out the window that I feel unless I feel it's a risk from a, from a health\n\n2:23:32.920 --> 2:23:36.040\n standpoint that I'm not willing to take on.\n\n2:23:36.040 --> 2:23:41.520\n And because that's, how do I like, it's just picking and choosing and it's just picking\n\n2:23:41.520 --> 2:23:42.520\n and choosing.\n\n2:23:42.520 --> 2:23:43.920\n I here's what I want to know.\n\n2:23:43.920 --> 2:23:45.880\n This is what I want to be able to try to achieve.\n\n2:23:45.880 --> 2:23:48.760\n And so, yeah, yeah, that's what I did.\n\n2:23:48.760 --> 2:23:50.680\n And what you did is incredible.\n\n2:23:50.680 --> 2:23:52.400\n Like it's, it's just awe inspiring.\n\n2:23:52.400 --> 2:23:54.400\n And what Lance Armstrong did was incredible.\n\n2:23:54.400 --> 2:23:55.400\n Yeah.\n\n2:23:55.400 --> 2:23:57.160\n And that, and that, and that aged me up.\n\n2:23:57.160 --> 2:24:01.040\n And what's funny is the people that bash them are like on the media or politicians or maybe\n\n2:24:01.040 --> 2:24:03.320\n some actors and guess what?\n\n2:24:03.320 --> 2:24:06.560\n A ton of them are doing the same thing.\n\n2:24:06.560 --> 2:24:08.080\n It's hypocrisy at its finest.\n\n2:24:08.080 --> 2:24:09.080\n Trust me.\n\n2:24:09.080 --> 2:24:13.320\n But how many, how many of those figures you're watching in movies that love to talk, you\n\n2:24:13.320 --> 2:24:18.800\n know, be, you know, be political and do this and the news and all this, I'm telling you\n\n2:24:18.800 --> 2:24:26.240\n they're, they're anti aging clinics, like all over California and everywhere else.\n\n2:24:26.240 --> 2:24:28.760\n Who do you think is, keeps them in business?\n\n2:24:28.760 --> 2:24:29.920\n It's not the competitive lifter.\n\n2:24:29.920 --> 2:24:30.920\n I'll tell you that.\n\n2:24:30.920 --> 2:24:38.000\n And they're using peptides and also, and SARMs and all sorts of like.\n\n2:24:38.000 --> 2:24:39.480\n You're speaking to the hypocrisy.\n\n2:24:39.480 --> 2:24:44.040\n I also want to speak to the fact, you know, somebody who's a friend of mine, David Goggins.\n\n2:24:44.040 --> 2:24:45.040\n I don't know if you know what that is.\n\n2:24:45.040 --> 2:24:46.040\n Yeah.\n\n2:24:46.040 --> 2:24:48.500\n Ultra marathon runner, Navy seal.\n\n2:24:48.500 --> 2:24:49.500\n He gets.\n\n2:24:49.500 --> 2:24:50.500\n Pretty incredible person.\n\n2:24:50.500 --> 2:24:51.500\n Yeah.\n\n2:24:51.500 --> 2:24:52.500\n Incredible human being.\n\n2:24:52.500 --> 2:24:56.800\n And he gets criticism like, you know, what you're doing is, is bad for the body.\n\n2:24:56.800 --> 2:25:00.760\n You know, you're, you're pushing yourself too far.\n\n2:25:00.760 --> 2:25:07.160\n I find that the people that criticize are often people that haven't truly pushed themselves\n\n2:25:07.160 --> 2:25:08.160\n to the limit.\n\n2:25:08.160 --> 2:25:11.220\n They haven't actually worked hard in their life.\n\n2:25:11.220 --> 2:25:18.300\n When you work hard, you realize how incredible it is that a human being can dedicate themselves\n\n2:25:18.300 --> 2:25:25.760\n so fully to an effort the way you did, the way David Goggins does the way, the way the\n\n2:25:25.760 --> 2:25:27.740\n greatest athletes do.\n\n2:25:27.740 --> 2:25:33.720\n And there's nothing that should be said beyond just sitting back in awe that humans can achieve\n\n2:25:33.720 --> 2:25:34.720\n that.\n\n2:25:34.720 --> 2:25:40.160\n That inspires me to do the best, whatever the hell I do, to be the best version of that.\n\n2:25:40.160 --> 2:25:47.520\n There's something about like athletic feats, especially like strength that just inspire\n\n2:25:47.520 --> 2:25:51.460\n us to do the best, to be the best version of ourselves.\n\n2:25:51.460 --> 2:25:52.600\n I don't know.\n\n2:25:52.600 --> 2:25:58.820\n That's the only thing you should be saying as opposed to criticizing some little detail\n\n2:25:58.820 --> 2:26:00.600\n of this and that.\n\n2:26:00.600 --> 2:26:05.520\n It's just awe inspiring that you push yourself to anybody that is at that level.\n\n2:26:05.520 --> 2:26:09.320\n And this is funny, like in competitive sports, like you go online and people, it's just bash,\n\n2:26:09.320 --> 2:26:10.880\n bash, bash, bash, bash, bash, bash.\n\n2:26:10.880 --> 2:26:16.920\n You go talk to anybody, anybody, anybody that's a high level athlete within that field.\n\n2:26:16.920 --> 2:26:20.220\n And nobody has a single bad thing to say about each other.\n\n2:26:20.220 --> 2:26:25.360\n But all this chitter chatter down there, I mean, I know exactly what you're saying.\n\n2:26:25.360 --> 2:26:30.840\n So if you, I would say, cause I have love for all those folks, especially when you're\n\n2:26:30.840 --> 2:26:36.440\n younger, you have a little bit of that desire to criticize others.\n\n2:26:36.440 --> 2:26:40.120\n I think that should be channeled in improving your own life.\n\n2:26:40.120 --> 2:26:46.840\n Anytime that you feel that way, that is when you need to turn inward and it's hard to do,\n\n2:26:46.840 --> 2:26:53.040\n but there is a reason that you have those emotions around someone else and what they're\n\n2:26:53.040 --> 2:27:00.680\n doing that you have an opportunity to look at yourself and know why you feel that way.\n\n2:27:00.680 --> 2:27:01.720\n And that, guess what?\n\n2:27:01.720 --> 2:27:02.940\n That's going to be the hard thing to do.\n\n2:27:02.940 --> 2:27:03.940\n That's going to be the thing.\n\n2:27:03.940 --> 2:27:09.400\n Again, that's stirring you a little bit because it's so much easier to sit there and, or talk\n\n2:27:09.400 --> 2:27:14.620\n to your confidant or whatever instead of go, why does that bother me?\n\n2:27:14.620 --> 2:27:19.600\n Why does what that person doing or what that person's achieving bother me?\n\n2:27:19.600 --> 2:27:29.600\n It's like a difficult question that I often ask others, whether it's better to work hard\n\n2:27:29.600 --> 2:27:31.200\n or work smart.\n\n2:27:31.200 --> 2:27:36.960\n I like to ask that question because it helps me get a sense of the human being.\n\n2:27:36.960 --> 2:27:45.800\n And I think I, let me just say like, I often, I often like people that answer that would\n\n2:27:45.800 --> 2:27:49.800\n work hard.\n\n2:27:49.800 --> 2:27:56.480\n Even though the quote unquote right answer is work smart, meaning like finding the optimal\n\n2:27:56.480 --> 2:28:03.680\n efficient way to achieve a certain goal, I find that people that answer work smart don't\n\n2:28:03.680 --> 2:28:08.660\n actually find the optimal efficient way to achieve a goal.\n\n2:28:08.660 --> 2:28:15.060\n It seems like the people that at least certainly early in life strive to work their ass off,\n\n2:28:15.060 --> 2:28:21.000\n even that means doing the inefficient, the dumb thing, just to learn the mistake.\n\n2:28:21.000 --> 2:28:27.360\n The spirit behind the human spirit behind the person that says, or a card is the one\n\n2:28:27.360 --> 2:28:31.640\n I connect with, but I'm torn, especially in the, in the war culture, in the tech sector\n\n2:28:31.640 --> 2:28:38.220\n where people answer work smart, what would you, what would you say about that tension?\n\n2:28:38.220 --> 2:28:44.160\n This definitely encompasses like, I'm the intellectual and I'm the meathead.\n\n2:28:44.160 --> 2:28:51.800\n I'm the work around the clock and go fix the processes and make it so much better type\n\n2:28:51.800 --> 2:28:52.800\n person.\n\n2:28:52.800 --> 2:28:53.800\n Right.\n\n2:28:53.800 --> 2:28:54.800\n That's, that's, that's me in a whole, that's everything.\n\n2:28:54.800 --> 2:28:55.800\n That's my life story.\n\n2:28:55.800 --> 2:28:56.800\n Right.\n\n2:28:56.800 --> 2:29:00.920\n Busting your ass to find the easiest way possible to both.\n\n2:29:00.920 --> 2:29:11.120\n So like I will, I will build a custom hydraulic cart that will lift my plates up to the height\n\n2:29:11.120 --> 2:29:14.120\n of my, my squat.\n\n2:29:14.120 --> 2:29:18.280\n So that I can minimize a roll it over next to it and then minimize the effort of it going\n\n2:29:18.280 --> 2:29:26.120\n on and off to be able to lift the most amount of weight as possible so, so that I can save\n\n2:29:26.120 --> 2:29:31.100\n the energy from here, from lifting those up and the fatigue of my back being in bad position.\n\n2:29:31.100 --> 2:29:35.040\n So I can nearly kill myself over here.\n\n2:29:35.040 --> 2:29:36.360\n Right.\n\n2:29:36.360 --> 2:29:42.320\n I, my wife, anybody will say, I'm a workaholic.\n\n2:29:42.320 --> 2:29:47.520\n And the first thing that I would do when it would be doing a company, a company turnaround,\n\n2:29:47.520 --> 2:29:49.960\n they'd hire me, come in and I would be taking over.\n\n2:29:49.960 --> 2:29:54.800\n So for someone that wasn't successful, but it was usually hardly ever for lack of want\n\n2:29:54.800 --> 2:29:55.800\n or trying.\n\n2:29:55.800 --> 2:30:00.000\n So a lot of times they knew they were unsuccessful and they were running around working six,\n\n2:30:00.000 --> 2:30:05.320\n seven days a week, 12 hour days doing so much and it'd be like, well, you need to do this.\n\n2:30:05.320 --> 2:30:09.520\n And they train me on like all the reports and this and all the things and like, good\n\n2:30:09.520 --> 2:30:11.440\n luck, good luck.\n\n2:30:11.440 --> 2:30:12.880\n I couldn't do it.\n\n2:30:12.880 --> 2:30:17.720\n And the first thing I would do is nothing.\n\n2:30:17.720 --> 2:30:27.800\n I would do nothing because then I would find what actually keeps coming back, the things\n\n2:30:27.800 --> 2:30:31.820\n that I need to do and how much of it was filling the space.\n\n2:30:31.820 --> 2:30:37.760\n Because so much of human nature when you're failing is to make yourself feel like you're\n\n2:30:37.760 --> 2:30:38.940\n accomplishing thing.\n\n2:30:38.940 --> 2:30:44.080\n This is when things go on your list, on your checklist and you start like rolling up.\n\n2:30:44.080 --> 2:30:47.240\n So you're running around just getting shit done.\n\n2:30:47.240 --> 2:30:48.240\n Yeah.\n\n2:30:48.240 --> 2:30:49.240\n Being busy.\n\n2:30:49.240 --> 2:30:50.240\n Right.\n\n2:30:50.240 --> 2:30:57.520\n And so, but at the same time, like find somewhere in my career, something I've done where I\n\n2:30:57.520 --> 2:31:04.200\n haven't outworked everybody, just so much on distilling things down to what's important.\n\n2:31:04.200 --> 2:31:14.380\n And you've got to make time to sit back and assess and think and be introspective.\n\n2:31:14.380 --> 2:31:20.400\n You have to make time for this because if not, you're going to waste so much time sitting\n\n2:31:20.400 --> 2:31:28.200\n there walking sideways when all you got to do is move just one step in front of the other\n\n2:31:28.200 --> 2:31:29.200\n each day.\n\n2:31:29.200 --> 2:31:30.200\n Just one.\n\n2:31:30.200 --> 2:31:38.240\n And I say, because it's going to add up, but you could spend six months knocking shit out,\n\n2:31:38.240 --> 2:31:44.520\n doing your routine, busting your ass and not take that one step.\n\n2:31:44.520 --> 2:31:46.960\n So you've got to distill stuff down.\n\n2:31:46.960 --> 2:31:50.600\n You've got to really understand like what's important to you in life and where you're\n\n2:31:50.600 --> 2:31:51.600\n going.\n\n2:31:51.600 --> 2:31:55.880\n And, uh, when you're looking at anything in your life, the first thing that you need to\n\n2:31:55.880 --> 2:32:02.920\n do is figure out, do I need to do it and just quit doing it, just quit doing things in your\n\n2:32:02.920 --> 2:32:03.920\n life.\n\n2:32:03.920 --> 2:32:11.440\n And you'll see that a lot of stuff that you think has to be done, doesn't have to be done.\n\n2:32:11.440 --> 2:32:14.000\n You'd be surprised.\n\n2:32:14.000 --> 2:32:15.480\n And then from there, this is the tech.\n\n2:32:15.480 --> 2:32:16.480\n Okay.\n\n2:32:16.480 --> 2:32:19.560\n And then of that, what can I, what can I automate?\n\n2:32:19.560 --> 2:32:23.320\n What can I not have to do in a repeated fashion?\n\n2:32:23.320 --> 2:32:28.260\n And then the last one, yeah, wherever possible, if it's not something that I'm adding tremendous\n\n2:32:28.260 --> 2:32:32.920\n value to, like my uniqueness, people are like, oh, you must like do the auto work on your\n\n2:32:32.920 --> 2:32:34.080\n vehicles cause you love working.\n\n2:32:34.080 --> 2:32:35.080\n I'm like, fuck that.\n\n2:32:35.080 --> 2:32:36.080\n I don't.\n\n2:32:36.080 --> 2:32:37.080\n And they're like, what?\n\n2:32:37.080 --> 2:32:38.080\n That doesn't make any sense.\n\n2:32:38.080 --> 2:32:44.700\n And I'm like, no, I love creating things, but I don't want to do that stuff.\n\n2:32:44.700 --> 2:32:50.560\n So you could use delegating if you're a manager position, but it's outsourcing, whatever it\n\n2:32:50.560 --> 2:32:51.560\n is.\n\n2:32:51.560 --> 2:32:56.800\n But there are also so many things this, and this, this ties back to your point, uh, around\n\n2:32:56.800 --> 2:32:58.440\n just doing it.\n\n2:32:58.440 --> 2:33:03.120\n There's a point to like experiencing all levels to really understand things.\n\n2:33:03.120 --> 2:33:07.640\n You need to spend time at the same time doing all those things.\n\n2:33:07.640 --> 2:33:13.320\n Cause there could be good, huge, massive gaps in there that you're not aware of that are\n\n2:33:13.320 --> 2:33:17.360\n key for you or key to be having done different or so on.\n\n2:33:17.360 --> 2:33:24.600\n So um, like in my company days, I was one of the few executives that came in that could\n\n2:33:24.600 --> 2:33:31.840\n do anything on the floor from code to machine, run away, the mill weld, do all step into\n\n2:33:31.840 --> 2:33:40.080\n engineering, like, and, and that added tremendous value to me to having had spent time being\n\n2:33:40.080 --> 2:33:45.760\n a doer and not enough people want to be, you've got to just go do shit.\n\n2:33:45.760 --> 2:33:52.000\n You need to spend time in your life chopping wood, you need to have experience trying and\n\n2:33:52.000 --> 2:33:58.720\n doing all these things that you would never like my skillset is massive because I want\n\n2:33:58.720 --> 2:34:01.960\n to know, like you need to have those touch points.\n\n2:34:01.960 --> 2:34:12.000\n My job, my title is chief visionary, but I've spent time doing everything.\n\n2:34:12.000 --> 2:34:16.080\n It's not about just like creating this amazing strategy or vision.\n\n2:34:16.080 --> 2:34:21.260\n And I'm just going to be there in this person that directs and like, like you can't be effective.\n\n2:34:21.260 --> 2:34:27.080\n You cannot connect the dots unless you've been in the moment with everything.\n\n2:34:27.080 --> 2:34:28.080\n Yeah.\n\n2:34:28.080 --> 2:34:29.080\n Low level stuff.\n\n2:34:29.080 --> 2:34:34.640\n Sometimes it's doing stupid shit that you're not uniquely qualified to do that anybody\n\n2:34:34.640 --> 2:34:36.440\n could do, but you did it anyway.\n\n2:34:36.440 --> 2:34:38.380\n Just the training environment.\n\n2:34:38.380 --> 2:34:42.840\n People hit me up at a, at a, at a school or wherever like, Hey, how do I get into, I want\n\n2:34:42.840 --> 2:34:45.200\n to grow my, grow my brand online.\n\n2:34:45.200 --> 2:34:46.200\n I want to do this.\n\n2:34:46.200 --> 2:34:47.440\n Like, where do I, where do I start?\n\n2:34:47.440 --> 2:34:52.560\n And I'm like, go get a job at planet fitness or 24 hour fitness.\n\n2:34:52.560 --> 2:34:56.160\n They're like, but I want to, you know, where, how do I get, you know, recognized and write\n\n2:34:56.160 --> 2:34:57.760\n articles and be an online coach.\n\n2:34:57.760 --> 2:35:05.920\n I'm like, you need to go spend a few years one on one training people to learn like the\n\n2:35:05.920 --> 2:35:09.760\n interaction, how people respond, there's base levels you have to do.\n\n2:35:09.760 --> 2:35:13.120\n You've got to go work your way up from the ground.\n\n2:35:13.120 --> 2:35:14.120\n Yeah.\n\n2:35:14.120 --> 2:35:15.120\n I truly believe it.\n\n2:35:15.120 --> 2:35:20.880\n Well, I think that's the hard work piece that I'm speaking to that I like it when people\n\n2:35:20.880 --> 2:35:26.960\n have been humbled by the hardness of life, like how difficult it is to do stuff.\n\n2:35:26.960 --> 2:35:30.040\n And it does, I went and got my MBA, I went to MIT.\n\n2:35:30.040 --> 2:35:31.480\n I don't need to do that stuff.\n\n2:35:31.480 --> 2:35:32.960\n I'm above that.\n\n2:35:32.960 --> 2:35:33.960\n Yeah.\n\n2:35:33.960 --> 2:35:34.960\n Yeah.\n\n2:35:34.960 --> 2:35:40.400\n And since you've been humbled by doing those things, I feel like you can truly explore\n\n2:35:40.400 --> 2:35:46.520\n the optimization that you're talking to, finding the ways where you're uniquely capable to\n\n2:35:46.520 --> 2:35:48.600\n add value to the world.\n\n2:35:48.600 --> 2:35:53.800\n And then, and then again, work your ass off to be the best in the world at that thing.\n\n2:35:53.800 --> 2:35:54.800\n Yes.\n\n2:35:54.800 --> 2:35:55.800\n So it's always,\n\n2:35:55.800 --> 2:35:57.800\n But then don't waste your time on shit that's not aligned.\n\n2:35:57.800 --> 2:35:58.800\n Yeah.\n\n2:35:58.800 --> 2:36:02.560\n That's the only, so that's, I guess there's a lot of context I put around that, but.\n\n2:36:02.560 --> 2:36:09.840\n Yeah, that was like a long answer to a, a long, beautiful answer to an unanswerable\n\n2:36:09.840 --> 2:36:10.840\n question.\n\n2:36:10.840 --> 2:36:15.520\n Do you have advice outside of all this discussion to young people today about career, about\n\n2:36:15.520 --> 2:36:16.520\n life?\n\n2:36:16.520 --> 2:36:20.880\n Since you've done so many things, you've overcome a lot of things.\n\n2:36:20.880 --> 2:36:24.560\n Think high school, college student, thinking about what to do in their life.\n\n2:36:24.560 --> 2:36:28.120\n Do you have advice for those guys and girls?\n\n2:36:28.120 --> 2:36:29.120\n Yeah.\n\n2:36:29.120 --> 2:36:30.120\n Yeah.\n\n2:36:30.120 --> 2:36:34.160\n First is you don't have it figured out, so don't worry.\n\n2:36:34.160 --> 2:36:35.160\n Just jump in.\n\n2:36:35.160 --> 2:36:36.160\n Yeah.\n\n2:36:36.160 --> 2:36:37.160\n Yeah.\n\n2:36:37.160 --> 2:36:43.600\n We talked, you know, a lot about understanding your values and aligning all that stuff, but\n\n2:36:43.600 --> 2:36:49.720\n you got to have a base level of start exploring and learning and just spending the time doing\n\n2:36:49.720 --> 2:36:54.440\n like pick something, let me elaborate a little bit.\n\n2:36:54.440 --> 2:36:55.440\n No, you know what?\n\n2:36:55.440 --> 2:36:58.840\n A lot of people struggle with that aspect now because the choice, there's so much choice\n\n2:36:58.840 --> 2:37:03.120\n it's difficult to pick something, but I think it does blow down to you should pick something\n\n2:37:03.120 --> 2:37:04.120\n and don't worry about it.\n\n2:37:04.120 --> 2:37:10.480\n And then, but within that you can start discovering the things that are there for you.\n\n2:37:10.480 --> 2:37:17.480\n Like I, I talked about, I made this huge shift, I threw away whole life, but I don't regret\n\n2:37:17.480 --> 2:37:19.440\n anything about that.\n\n2:37:19.440 --> 2:37:23.040\n I wouldn't be where I was if I didn't walk through and learn those things.\n\n2:37:23.040 --> 2:37:30.960\n And in fact, in the course of that, I learned just how much that inspiring people and helping\n\n2:37:30.960 --> 2:37:35.240\n them realize the potential far beyond what they thought was capable.\n\n2:37:35.240 --> 2:37:36.240\n And guess what?\n\n2:37:36.240 --> 2:37:42.560\n That was leadership 101 in managing people base level, floor level, right?\n\n2:37:42.560 --> 2:37:46.360\n And I got a lot out that was perfectly aligned with what, and that's what I realized.\n\n2:37:46.360 --> 2:37:54.340\n It didn't matter what industry I was in or any of those other things, but I was able,\n\n2:37:54.340 --> 2:37:59.480\n you can see so many things, there's so many paths that you can go down to help you realize\n\n2:37:59.480 --> 2:38:01.320\n what those things are.\n\n2:38:01.320 --> 2:38:06.360\n And you're going to be able to find a lot of those nuggets and develop those.\n\n2:38:06.360 --> 2:38:14.600\n Do you think that I could have just gone to school and got out and started a globally\n\n2:38:14.600 --> 2:38:21.120\n recognized brand within a few years without having been schooled in business while getting\n\n2:38:21.120 --> 2:38:24.940\n paid for it by others for years?\n\n2:38:24.940 --> 2:38:29.080\n And in fact, that entire time I knew that that's what I wanted to do, but I didn't go\n\n2:38:29.080 --> 2:38:30.240\n out on it.\n\n2:38:30.240 --> 2:38:35.240\n I mentored some of my friends along the same path to go, no, they're like, I'm ready.\n\n2:38:35.240 --> 2:38:36.520\n I'm ready to go do this.\n\n2:38:36.520 --> 2:38:39.000\n And I'm like, no, now you need to go get a job.\n\n2:38:39.000 --> 2:38:42.160\n Yeah, you know, engineering management, design, all that stuff.\n\n2:38:42.160 --> 2:38:44.000\n Go get a job as a manager now.\n\n2:38:44.000 --> 2:38:45.080\n Like, oh, that's a step down.\n\n2:38:45.080 --> 2:38:46.080\n I can't do that.\n\n2:38:46.080 --> 2:38:47.080\n I'm like, go try it.\n\n2:38:47.080 --> 2:38:49.000\n A couple of years later, oh my God, that was such a good move.\n\n2:38:49.000 --> 2:38:50.680\n I didn't know what I didn't know.\n\n2:38:50.680 --> 2:38:54.680\n And now they're an executive for freaking a fortune 500 company.\n\n2:38:54.680 --> 2:39:00.320\n And the same thing, like I sat there knowing that I was getting a free education.\n\n2:39:00.320 --> 2:39:03.800\n Don't stress yourself out as my, that's my advice.\n\n2:39:03.800 --> 2:39:08.640\n Don't stress yourself out that you've got to have this perfect thing because this process\n\n2:39:08.640 --> 2:39:12.720\n of understanding your values and the introspect, that takes time.\n\n2:39:12.720 --> 2:39:16.160\n You can get a job where you're getting paid to learn.\n\n2:39:16.160 --> 2:39:17.440\n Exactly.\n\n2:39:17.440 --> 2:39:21.240\n That's a good deal before you launch on your own.\n\n2:39:21.240 --> 2:39:24.040\n You mentioned going back to darkness.\n\n2:39:24.040 --> 2:39:27.580\n I'm Russian, so I like going back to darkness.\n\n2:39:27.580 --> 2:39:29.140\n You suffer from depression.\n\n2:39:29.140 --> 2:39:31.240\n You consider suicide.\n\n2:39:31.240 --> 2:39:33.320\n Do you ponder your own death these days?\n\n2:39:33.320 --> 2:39:35.240\n Do you think about your mortality?\n\n2:39:35.240 --> 2:39:37.560\n Are you afraid of death?\n\n2:39:37.560 --> 2:39:42.160\n I definitely think about mortality.\n\n2:39:42.160 --> 2:39:44.920\n And am I afraid of my own death?\n\n2:39:44.920 --> 2:39:46.440\n It depends on the moment.\n\n2:39:46.440 --> 2:39:52.840\n If I'm in the middle of a project, I definitely want to finish that project, man.\n\n2:39:52.840 --> 2:39:57.180\n But I don't fear it so much.\n\n2:39:57.180 --> 2:40:09.440\n I fear leaving my kids or my wife and not being able to be there for them.\n\n2:40:09.440 --> 2:40:10.840\n That bothers me.\n\n2:40:10.840 --> 2:40:18.840\n Outside of that, I know that I put everything into the life that I've lived.\n\n2:40:18.840 --> 2:40:24.160\n Like you said, there's always more, but I've lived hard.\n\n2:40:24.160 --> 2:40:28.400\n I've loved hard.\n\n2:40:28.400 --> 2:40:36.360\n Every moment in my life, I've made connections and impacted people around me for the better.\n\n2:40:36.360 --> 2:40:39.800\n And this tracks back, which is crazy when we were doing the documentary and they're\n\n2:40:39.800 --> 2:40:43.800\n interviewing people through my whole life and the consistency of the themes of anyone,\n\n2:40:43.800 --> 2:40:49.680\n like anything for Duffin, like just sure, I'll fly in from Boston.\n\n2:40:49.680 --> 2:40:53.120\n These people, it was crazy.\n\n2:40:53.120 --> 2:40:57.640\n Everybody had a story about me giving, just over and over.\n\n2:40:57.640 --> 2:40:58.640\n And I didn't even really.\n\n2:40:58.640 --> 2:41:00.760\n It's just the way you were.\n\n2:41:00.760 --> 2:41:04.360\n I've been all in.\n\n2:41:04.360 --> 2:41:13.920\n I have a lot more I want to do, but I don't have things that regret have not done in like,\n\n2:41:13.920 --> 2:41:15.240\n I don't fear it.\n\n2:41:15.240 --> 2:41:16.240\n I don't fear it.\n\n2:41:16.240 --> 2:41:17.240\n Yeah.\n\n2:41:17.240 --> 2:41:21.200\n It's like the, I don't know if you know the Bukowski poem, go all the way, otherwise don't\n\n2:41:21.200 --> 2:41:22.200\n even try.\n\n2:41:22.200 --> 2:41:28.720\n It seems like you embody that poem and you've accomplished some incredible things and serve\n\n2:41:28.720 --> 2:41:31.160\n as an inspiration to a huge number of people.\n\n2:41:31.160 --> 2:41:33.080\n Chris, you're an amazing human being.\n\n2:41:33.080 --> 2:41:37.480\n I'm really honored that you would spend your valuable time with me.\n\n2:41:37.480 --> 2:41:39.160\n Thank you so much for talking with me today.\n\n2:41:39.160 --> 2:41:40.160\n It was incredible.\n\n2:41:40.160 --> 2:41:44.200\n I can't wait to check out all the cool stuff you've engineered with Kabuki Strength.\n\n2:41:44.200 --> 2:41:47.880\n So I'm obviously, I love the, I love strength.\n\n2:41:47.880 --> 2:41:49.080\n I love strength training.\n\n2:41:49.080 --> 2:41:50.200\n I love the idea of strength.\n\n2:41:50.200 --> 2:41:56.600\n I love the equipment and the engineering approach that you take to strength.\n\n2:41:56.600 --> 2:42:02.520\n You're an incredible human, both on the things you've accomplished in terms of your own strength\n\n2:42:02.520 --> 2:42:10.080\n feats and the kind of science and engineering you bring to the field that many others could\n\n2:42:10.080 --> 2:42:11.080\n use.\n\n2:42:11.080 --> 2:42:12.720\n So thank you so much for talking to me.\n\n2:42:12.720 --> 2:42:13.720\n Thanks for having me on.\n\n2:42:13.720 --> 2:42:17.120\n That was quite the final thing.\n\n2:42:17.120 --> 2:42:18.880\n Thank you.\n\n2:42:18.880 --> 2:42:23.760\n Thanks for listening to this conversation with Chris Duffin and thank you to Headspace,\n\n2:42:23.760 --> 2:42:26.900\n Magic Spoon, Sun Basket and Ladder.\n\n2:42:26.900 --> 2:42:30.400\n Check them out in the description to support this podcast.\n\n2:42:30.400 --> 2:42:34.720\n And now let me leave you with some words from Arnold Schwarzenegger.\n\n2:42:34.720 --> 2:42:36.780\n Strength does not come from winning.\n\n2:42:36.780 --> 2:42:39.560\n Your struggles develop your strengths.\n\n2:42:39.560 --> 2:42:45.160\n When you go through hardship and decide not to surrender, that is strength.\n\n2:42:45.160 --> 2:43:00.720\n Thank you for listening and hope to see you next time.\n\n"
}