{
  "title": "Donald Knuth: Programming, Algorithms, Hard Problems & the Game of Life | Lex Fridman Podcast #219",
  "id": "EE1R8FYUJm0",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.960\n The following is a conversation with Donald Knuth, his second time on this podcast.\n\n00:05.520 --> 00:12.160\n Don is a legendary computer scientist, Turing Award winner, father of algorithm analysis,\n\n00:12.160 --> 00:19.040\n author of The Art of Computer Programming, creator of tech that led to late tech, and\n\n00:19.040 --> 00:23.920\n one of the kindest and most fascinating human beings I've ever got a chance to talk to.\n\n00:23.920 --> 00:30.640\n I wrote him a letter a long time ago, he responded, and the rest, as they say, is history.\n\n00:30.640 --> 00:35.680\n We've interacted many times since then, and every time has been joyful and inspiring.\n\n00:36.480 --> 00:40.080\n To support this podcast, please check out our sponsors in the description.\n\n00:40.720 --> 00:46.480\n This is the Lex Friedman Podcast, and here is my conversation with Donald Knuth.\n\n00:46.480 --> 00:54.880\n Don Knuth, your first large scale program, you wrote it in IBM 650 Assembler in the summer of 1957.\n\n00:54.880 --> 00:59.920\n I wrote it in decimal machine language. I didn't know about Assembler until a year later.\n\n00:59.920 --> 01:04.640\n But the year, 1957, and the program is tic tac toe.\n\n01:04.640 --> 01:09.200\n Yeah, I might have learned about Assembler later that summer, I probably did. In 1957,\n\n01:09.200 --> 01:12.320\n hardly anybody had heard of Assemblers. You looked at the user manuals,\n\n01:12.320 --> 01:21.360\n and how would you write a program for this machine? It would say 69, which meant load\n\n01:21.360 --> 01:25.840\n the distributor, and then you would give the address of the number you wanted to load into\n\n01:25.840 --> 01:34.000\n the distributor. Yesterday, my friend Doug Spicer at the Computer History Museum sent me a link to\n\n01:34.560 --> 01:41.840\n something that just went on YouTube. It was IBM's progress report from 1956, which is very\n\n01:41.840 --> 01:52.400\n contemporary with 1957. In 1956, IBM had donated to Stanford University an IBM 650, one of the first\n\n01:52.400 --> 01:58.320\n ones, when they showed a picture of the assembly line for IBM 650s, and they said, this is number\n\n01:58.320 --> 02:05.840\n 500 or something coming off the assembly line. I had never seen so many IBM 650s I did in this\n\n02:05.840 --> 02:19.120\n movie that's on YouTube now. It showed the picture from Stanford. They said, look, we donated one of\n\n02:19.120 --> 02:26.400\n these to Stanford, one to MIT, and they mentioned one other college. In December of 1956, they\n\n02:26.400 --> 02:36.480\n donated to my university, Case Tech. Anyway, they showed a picture then of a class session where a\n\n02:36.480 --> 02:45.680\n guy was teaching programming, and on the blackboard, it said 69, 8,000. He was teaching them how to\n\n02:45.680 --> 02:56.400\n write code for this IBM 650, which was in decimal numbers. The instructions were 10 decimal digits.\n\n02:56.400 --> 03:05.280\n You had two digits that said what to do, four digits to say what to do it to, and four more\n\n03:05.280 --> 03:10.160\n digits to say where to get your next instruction. And there's a manual that describes what each of\n\n03:10.160 --> 03:16.560\n the numbers mean. If the manual had been well written, I probably never would have gone into\n\n03:16.560 --> 03:22.400\n computer science, but it was so badly written, I figured that I must have a talent for it because\n\n03:22.400 --> 03:27.920\n I'm only a freshman and I could write a better manual. That's what you did.\n\n03:27.920 --> 03:41.600\n And so I started working at the computer center and wrote some manuals then. But this was the\n\n03:41.600 --> 03:47.600\n way we did it. And my first program then was June of 1957. The Tic Tac Toe?\n\n03:48.320 --> 03:52.800\n No, that was the second program. The first, the third program. The first program was\n\n03:52.800 --> 04:03.360\n factoring a number. So you dial a number on the switches. I mean, you sat at this big mainframe\n\n04:05.120 --> 04:11.680\n and you turn the dials, set a number, and then it would punch out the factors of that number\n\n04:12.400 --> 04:15.440\n on cards. So that's the input, is the number?\n\n04:15.440 --> 04:25.120\n The input was, yeah, the input was a number, a tentative number. And the output was its factors.\n\n04:26.560 --> 04:32.000\n And I wrote that program. I still have a copy of it somewhere.\n\n04:34.320 --> 04:36.080\n How many lines of code? Do you remember?\n\n04:36.080 --> 04:40.960\n Well, yeah, it started out as about 20, but then I kept having to debug it.\n\n04:40.960 --> 04:45.280\n And I discovered debugging, of course, when I wrote my first program.\n\n04:45.280 --> 04:49.840\n What does debugging look like on a program with just all numbers?\n\n04:50.800 --> 04:55.840\n Well, you sit there and you, I don't remember how I got it into the machine, but I think there was\n\n04:55.840 --> 05:02.560\n a way to punch it on cards. So each instruction would be one card. Or maybe I could get seven\n\n05:02.560 --> 05:06.320\n instructions on a card, eight instructions. I don't know. But anyway, so I'm sitting there\n\n05:06.320 --> 05:10.400\n at the console of the machine. I mean, I'm doing this at night when nobody else is around.\n\n05:10.400 --> 05:10.800\n Of course.\n\n05:11.680 --> 05:17.520\n And so you have one set of switches where you dial the number I'm inputting, but there's another\n\n05:17.520 --> 05:26.560\n switch that says, okay, now execute one instruction and show me what you did. Or there was another four\n\n05:26.560 --> 05:33.200\n switches that say, stop if you get to that instruction. So I can say, now go until you\n\n05:33.200 --> 05:39.920\n get there again and watch. So I could watch, it would take that number and it would divide it by\n\n05:39.920 --> 05:48.160\n two. And if there's no remainder, then okay, two is a factor. So then I work on it. But if not\n\n05:48.160 --> 05:54.960\n divisible by two, divide by three. Keep trying until you know you're at the end.\n\n05:55.680 --> 06:01.600\n And you would find a bug if you were just surprised that something weird happened?\n\n06:02.720 --> 06:05.200\n Well, certainly. I mean, first of all, I might have\n\n06:05.200 --> 06:11.040\n tried to divide by one instead of two. You go off by one error, as people make all the time.\n\n06:11.040 --> 06:11.520\n Yes.\n\n06:11.520 --> 06:18.800\n But maybe I go to the wrong instruction. Maybe I left something in a register that I shouldn't have\n\n06:18.800 --> 06:26.480\n done. But the first bugs were pretty... Probably on the first night, I was able to get the factors\n\n06:26.480 --> 06:29.200\n of 30 as equal to two, three, and five. Okay.\n\n06:29.200 --> 06:36.000\n Sorry to interrupt. So you're sitting there late at night.\n\n06:36.000 --> 06:36.400\n Yeah.\n\n06:36.400 --> 06:42.480\n So it feels like you spent many years late at night working on a computer.\n\n06:42.480 --> 06:43.280\n Oh, yeah.\n\n06:43.280 --> 06:49.280\n So what's that like? So most of the world is sleeping. And you have to be there at night\n\n06:49.280 --> 06:51.520\n because that's when you get access to the computer.\n\n06:51.520 --> 06:56.320\n Between my freshman and sophomore year, I didn't need sleep. I used to do all nighters.\n\n06:56.320 --> 07:03.760\n When I was in high school, I used to do the whole student newspaper every Monday night.\n\n07:04.800 --> 07:08.720\n I would just stay up all night and it would be done on Tuesday morning.\n\n07:12.560 --> 07:14.800\n I didn't get ulcers and stuff like that until later.\n\n07:18.000 --> 07:19.760\n I don't know if you know Rodney Brooks.\n\n07:19.760 --> 07:20.880\n Rod Brooks, of course.\n\n07:20.880 --> 07:28.480\n Yeah. He told me a story that he really looked up to you. He was actually afraid of you.\n\n07:29.360 --> 07:31.280\n Well, vice versa, I must say.\n\n07:32.400 --> 07:37.680\n But he tells a story when you were working on tech that they screwed up something with\n\n07:37.680 --> 07:42.800\n a machine. I think this might have been MIT. I don't know. And you were waiting for them\n\n07:42.800 --> 07:45.920\n to fix the machine so you can get back to work late at night.\n\n07:47.760 --> 07:49.440\n That happened all the time.\n\n07:49.440 --> 07:52.720\n He was really intimidated. He's like, Dr. Knuth is not happy with this.\n\n07:54.000 --> 08:04.000\n That's interesting. But no, the machine at Stanford AI Lab was down an awful lot because\n\n08:05.760 --> 08:09.840\n they had many talented programmers changing the operating system every day.\n\n08:09.840 --> 08:14.480\n So the operating system was getting better every day, but it was also crashing.\n\n08:14.480 --> 08:23.280\n So I wrote almost the entire manual for tech during downtime of that machine.\n\n08:23.280 --> 08:24.400\n But that's another story.\n\n08:24.400 --> 08:30.480\n Well, he was saying it's a hardware problem. They tried to fix it and they reinserted\n\n08:30.480 --> 08:32.080\n something and smoke was everywhere.\n\n08:32.080 --> 08:35.840\n Oh, wow. Well, that didn't happen as often as the operating system.\n\n08:38.480 --> 08:44.160\n It's a funny story because he was saying there's this tall Don Knuth that I look up to\n\n08:44.160 --> 08:50.560\n and there was pressure to fix the computer. It's funny.\n\n08:51.680 --> 08:54.080\n The kind of things we remember that stick in our memory.\n\n08:54.080 --> 08:58.560\n Well, okay. Yeah. Well, I could tell you a bunch of Rod Brooks stories too, but let's\n\n09:00.160 --> 09:12.480\n go back to the 650. So I'm debugging my first program and I had more bugs in it than a number\n\n09:12.480 --> 09:17.520\n of lines of code. I mean, the number of lines of code kept growing. And let me explain.\n\n09:17.520 --> 09:24.320\n So I had to punch the answers on cards. So suppose I'm factoring the number 30, then\n\n09:26.080 --> 09:31.040\n I got to put two somewhere on the card. I got to put a three somewhere on the card.\n\n09:31.040 --> 09:37.680\n I got to put a five somewhere on the card. And here's my first program. I probably screwed up\n\n09:37.680 --> 09:44.720\n and it fell off the edge of the card or something like that. But I didn't realize that there are\n\n09:44.720 --> 09:53.200\n some tentative numbers that have more than eight factors. And the card has only 80 columns. And so\n\n09:53.200 --> 09:58.560\n I need 10 columns for every factor. So my first program didn't take account for the fact that I\n\n09:58.560 --> 10:03.920\n would have to punch more than one card. My first program just lined stuff up in memory and then\n\n10:03.920 --> 10:11.200\n punched the card. So by the time I finished, I had to deal with lots of things. Also,\n\n10:14.960 --> 10:20.240\n if you put a large prime number in there, my program might have sat there for 10 minutes.\n\n10:20.240 --> 10:24.000\n The 650 was pretty slow. And so it would sit there spinning its wheels and you wouldn't know\n\n10:24.000 --> 10:26.800\n if it was in a loop or whatever. You said 10 digit?\n\n10:26.800 --> 10:34.400\n 10 digits. Yeah. So I think the largest is sort of 999999997 or something like that.\n\n10:36.240 --> 10:40.960\n That would take me a while for that first one. Anyway, that was my first program.\n\n10:40.960 --> 10:46.560\n Well, what was your goal with that program? Was there something you were hoping to find a large\n\n10:46.560 --> 10:54.160\n prime maybe or the opposite? No, my goal was to see the lights flashing and understand how this\n\n10:54.160 --> 10:59.440\n magical machine would be able to do something that took so long by hand. So what was your second\n\n10:59.440 --> 11:08.880\n program? My second program was a converted number from binary to decimal or something like that. It\n\n11:08.880 --> 11:14.400\n was much simpler. It didn't have that many bugs in it. My third program was tic tac toe.\n\n11:14.400 --> 11:20.560\n Yeah. And it had some machines. So the tic tac toe program is interesting on many levels,\n\n11:20.560 --> 11:24.640\n but one of them is that it had some you can call machine learning in it.\n\n11:26.800 --> 11:34.240\n Yeah, that's right. I don't know how long it's going to be before the name of our field has\n\n11:34.240 --> 11:42.560\n changed from computer science to machine learning. But anyway, it was my first experience with\n\n11:42.560 --> 11:46.880\n machine learning. Okay. So here we had... Yeah. How does the program... Well, first of all,\n\n11:46.880 --> 11:53.200\n what is the problem you were solving? What is tic tac toe? What are we talking about? And then\n\n11:54.880 --> 12:00.640\n how was it designed? Right. So you've got a three by three grid and each\n\n12:03.040 --> 12:08.640\n can be in three states. It can be empty or it can have an X or an O. Yeah. All right. So three to\n\n12:08.640 --> 12:26.400\n the ninth is a... Well, how big is it? I should know. But it's 81 times three. So anyway, eight\n\n12:26.400 --> 12:35.680\n is like two to the third. And so that would be like two to the sixth. But that would be 64.\n\n12:35.680 --> 12:41.280\n Then you have to... Anyway, I love how you're doing the calculation. So it's a lot of... Anyway,\n\n12:41.280 --> 12:49.680\n the three comes from the fact that it's either empty, an X or an O. Right. And the 650 was a\n\n12:49.680 --> 13:00.720\n machine that had only two thousand ten digit words. You go from zero zero zero zero to one\n\n13:00.720 --> 13:08.880\n nine nine nine and that's it. And each word you have a ten digit number. So that's not many bits.\n\n13:09.360 --> 13:13.600\n I mean, I got to have... In order to have a memory of every position I've seen,\n\n13:14.480 --> 13:21.280\n I need three to the ninth bits. Okay. But it was a decimal machine too. It didn't have bits.\n\n13:21.840 --> 13:29.600\n But it did have strange instruction where if you had a ten digit number, but all the digits were\n\n13:29.600 --> 13:38.400\n either eight or nine, you'd be eight, nine, nine, eight or something like that. You could make a\n\n13:38.400 --> 13:43.760\n test whether it was eight or nine. That was one of the strange things IBM engineers put into the\n\n13:43.760 --> 13:51.040\n machine. I have no idea why. Well, hardly ever used. But anyway, I needed one digit for every\n\n13:51.840 --> 13:57.360\n position I'd seen. Zero meant it was a bad position. Nine meant it was good position.\n\n13:57.360 --> 14:06.400\n And I think I started out at five or six. But if you win a game, then you increase the value of\n\n14:06.400 --> 14:18.240\n that position for you, but you decrease it for your opponent. But I had that much total memory\n\n14:18.240 --> 14:25.760\n for every possible position was one digit. And I had a total of 20,000 digits, which had to also\n\n14:25.760 --> 14:34.320\n include my program and all the logic and everything, including how to ask the user what the moves are\n\n14:34.320 --> 14:41.920\n and things like this. So I think I had to work it out. Every position in tic tac toe is equivalent\n\n14:41.920 --> 14:49.120\n to roughly eight others because you can rotate the board, which gives you a factor of four,\n\n14:49.120 --> 14:55.680\n and you can also flip it over. And that's another factor too. So I might have needed only three to\n\n14:55.680 --> 15:05.520\n the ninth over eight positions plus a little bit. But anyway, that was a part of the program to\n\n15:05.520 --> 15:11.200\n squeeze it into this tiny... So you tried to find an efficient representation that took\n\n15:11.200 --> 15:14.560\n account for that kind of rotation. I had to, otherwise I couldn't do the learning.\n\n15:18.080 --> 15:24.880\n But I had three parts to my tic tac toe program. And I called it brain one, brain two, and brain\n\n15:24.880 --> 15:39.440\n three. So brain one just played at random. It's your turn. Okay. You got to put an X somewhere.\n\n15:39.440 --> 15:48.640\n It has to go in an empty space, but that's it. Okay. Choose one and play it. Brain two\n\n15:48.640 --> 15:59.200\n had a canned routine. And I think it also... Maybe it assumed you were the first player,\n\n15:59.200 --> 16:03.440\n or maybe it allowed you to be first. I think you're allowed to be either first or second,\n\n16:03.440 --> 16:09.760\n but had a canned built in strategy known to be optimum for tic tac toe. Before I forget,\n\n16:09.760 --> 16:18.480\n by the way, I learned many years later that Charles Babbage had thought about programming\n\n16:18.480 --> 16:23.760\n tic tac toe for his dream machine that he was never able to finish.\n\n16:23.760 --> 16:26.400\n Wow. So that was the program he thought about.\n\n16:26.400 --> 16:36.480\n More than 100 years ago. He did that. Okay. And I had, however, been influenced by a\n\n16:37.120 --> 16:42.960\n demonstration at the Museum of Science and Industry in Chicago. It's like Boston Science\n\n16:42.960 --> 16:50.800\n Museum. I think Bell Labs had prepared a special exhibit about telephones and relay technology,\n\n16:50.800 --> 16:58.080\n and they had a tic tac toe playing machine as part of that exhibit. So that had been one of my...\n\n17:00.160 --> 17:05.120\n Something I'd seen before I was a freshman in college and inspired me to see if I could\n\n17:05.120 --> 17:13.920\n write a program for it. Okay. So anyway, I had brain one, random, knowing nothing. Brain two,\n\n17:13.920 --> 17:22.080\n knowing everything. Then brain three was the learning one. And I could play brain one against\n\n17:22.080 --> 17:28.800\n brain one, brain one against brain two, and so on. And so you could also play against the user,\n\n17:28.800 --> 17:36.000\n against the live users. So I started going, the learning thing, and I said, okay, take two random\n\n17:37.520 --> 17:48.320\n people just playing tic tac toe knowing nothing. And after about... I forget the number now, but\n\n17:49.040 --> 17:57.440\n it converged after about 600 games to a safe draw. The way my program learned was actually,\n\n17:57.440 --> 18:04.800\n it learned how not to make mistakes. It didn't try to do anything for winning,\n\n18:04.800 --> 18:10.320\n it just tried to say not losing. So that was probably because of the way I designed the\n\n18:10.320 --> 18:18.080\n learning thing. I could have had a different reinforcement function that would reward brilliant\n\n18:18.080 --> 18:29.360\n play. And if I took a novice against a skilled player, it was able to learn how to play a good\n\n18:29.360 --> 18:38.240\n game. And that was really my... But after I finished that, I felt I understood programming.\n\n18:38.240 --> 18:48.160\n Yeah. Did a curiosity and interest in learning systems persist for you?\n\n18:48.880 --> 18:58.320\n So why did you want brain three to learn? Yeah. I think naturally, we're talking about\n\n18:58.320 --> 19:08.000\n Rod Brooks. He was teaching all kinds of very small devices to learn stuff. If a leaf drops\n\n19:08.000 --> 19:15.840\n off of a tree, he was saying something, well, it learns if there's wind or not.\n\n19:17.200 --> 19:22.480\n But I mean, he pushed that a little bit too far. But he said he could probably train some little\n\n19:22.480 --> 19:28.000\n mini bugs to scour out dishes if he had enough financial support. I don't know.\n\n19:28.000 --> 19:38.560\n Can I ask you about that? He also mentioned that during those years, there was discussion\n\n19:39.440 --> 19:45.680\n inspired by Turing about computation, of what is computation.\n\n19:45.680 --> 19:59.600\n Yeah. I never thought about any stuff like that. That was way too philosophical. I was a freshman\n\n20:00.560 --> 20:05.360\n after all. I was pretty much a machine.\n\n20:07.040 --> 20:12.720\n So it's almost like, yeah, I got you. It's a tinkering mindset, not a philosophical mindset.\n\n20:12.720 --> 20:21.920\n Yeah. It was just exciting to me to be able to control something, but not to say, am I solving\n\n20:21.920 --> 20:26.720\n a big problem or something like that? Or is this a step for humankind? No, no way.\n\n20:28.240 --> 20:34.400\n When did you first start thinking about computation in the big sense? Like the\n\n20:34.400 --> 20:47.040\n universal Turing machine? I had to take classes on computability when I was a senior. So we read\n\n20:47.040 --> 20:53.360\n this book by Martin Davis. Yeah, this is cool stuff. But I learned about it because I needed\n\n20:53.360 --> 21:00.720\n to pass the exams. But I didn't invent any of that boring stuff. But I had great fun playing\n\n21:00.720 --> 21:09.040\n with the machine. I wrote programs because it was fun to write programs and get this.\n\n21:11.120 --> 21:13.760\n I mean, it was like watching miracles happen.\n\n21:15.360 --> 21:22.400\n You mentioned in an interview that when reading a program, you can tell when the author of the\n\n21:22.400 --> 21:31.680\n program changed. How the heck can you do that? Like, what makes a distinct style for a programmer,\n\n21:31.680 --> 21:39.280\n do you think? You know, there's different Hemingway has a style of writing versus James Joyce or\n\n21:39.280 --> 21:45.920\n something. Yeah, those are pretty easy to imitate. But it's the same with music and whatever.\n\n21:45.920 --> 21:55.520\n During the pandemic, I spent a lot more time playing the piano. And I found something that\n\n21:55.520 --> 22:05.600\n I'd had when I was taking lessons before I was a teenager. And it was Yankee Doodle\n\n22:05.600 --> 22:16.880\n who played in the style of... You had Beethoven and you had Debussy and Chopin, and the last one\n\n22:16.880 --> 22:25.360\n was Gershwin. And I played over and over again. I thought it was so brilliant. But it was so easy.\n\n22:26.080 --> 22:35.120\n But also to appreciate how this author, Mario, somebody or other, had been able to reverse\n\n22:35.120 --> 22:43.040\n engineer the styles of those composers. But now, specifically to your question, I mean, there would\n\n22:43.040 --> 22:53.840\n be... It was pretty obvious in this program I was reading. It was a compiler and it had been written\n\n22:53.840 --> 23:03.600\n by a team at Carnegie Mellon. And I have no idea which program was responsible for it. But you\n\n23:03.600 --> 23:09.920\n would get to a part where the guy would just not know how to move things between registers very\n\n23:09.920 --> 23:16.160\n efficiently. And so everything that could be done in one instruction would take three or something\n\n23:16.160 --> 23:23.840\n like that. That would be a pretty obvious change in style. But there were also flashes of brilliance\n\n23:23.840 --> 23:29.280\n where you could do in one instruction. Normally, I used two because you knew enough about the way\n\n23:29.280 --> 23:37.280\n the machine worked that you could accomplish two goals in one step. So it was mostly the\n\n23:37.280 --> 23:45.440\n brilliance of the concept more than the semicolons or the use of short sentences versus long sentences\n\n23:45.440 --> 23:50.960\n or something like that. So you would see the idea in the code and you could see the different style\n\n23:50.960 --> 23:57.840\n of thinking expressed in the code. Right. It was stylistic. I mean, I could identify authors by\n\n23:57.840 --> 24:04.960\n their by the amount of technical aptitude they had, but not by the style in the sense of\n\n24:07.040 --> 24:11.280\n rhythm or something like that. So if you think about Mozart, Beethoven, Bach,\n\n24:11.840 --> 24:18.480\n if somebody looked at Don Knuth code, would they be able to tell that this\n\n24:19.600 --> 24:23.360\n is a distinct style of thinking going on here? What do you think?\n\n24:23.360 --> 24:27.680\n And what would be the defining characteristic of the style?\n\n24:28.400 --> 24:37.680\n Well, my code now is literate programming. So it's a combination of English and C mostly. But\n\n24:37.680 --> 24:46.160\n if you just looked at the C part of it, you would also probably notice that I use a lot of global\n\n24:46.160 --> 24:55.280\n variables that other people don't. And I expand things in line more than instead of calling.\n\n24:56.240 --> 25:00.080\n Anyway, I have different subset of C that I use.\n\n25:00.080 --> 25:02.320\n Okay. But that's a little bit stylistic.\n\n25:03.120 --> 25:08.240\n But with literate programming, you alternate between English and C or whatever.\n\n25:10.880 --> 25:14.560\n And by the way, people listening to this should look up literate programming. It's\n\n25:14.560 --> 25:20.240\n very interesting concept that you proposed and developed over the years.\n\n25:21.040 --> 25:32.800\n Yeah. That's the most significant thing, I think, to come out of the tech project is that I\n\n25:32.800 --> 25:45.120\n realized that my programs were to be read by people and not just by computers and that typography\n\n25:45.120 --> 25:53.760\n could massively enhance that. And so, I mean, they're just wonderful. If they're going to look\n\n25:53.760 --> 26:02.240\n it up, they should also look up this book called Physically Based Rendering by Matt Farr and,\n\n26:02.240 --> 26:10.560\n gosh, anyway, it got an Academy Award. But all the graphic effects you see in movies\n\n26:13.520 --> 26:19.120\n are accomplished by algorithms. And the whole book is a literate program. It tells you not\n\n26:19.120 --> 26:27.360\n only how you do all the shading and bring images in that you need for animation and\n\n26:27.360 --> 26:42.080\n textures and so on, but you can run the code. And so, I find it an extension of how to teach\n\n26:42.080 --> 26:47.680\n programming is by telling a story as part of the program.\n\n26:47.680 --> 26:52.480\n So it works as a program, but it's also readable by humans.\n\n26:52.480 --> 26:58.720\n Yes. And especially by me a week later or a year later.\n\n26:58.720 --> 27:06.320\n That's a good test. If you yourself understand the code easily a week or a month or a year later.\n\n27:06.320 --> 27:12.160\n Yeah. So it's the greatest thing since sliced bread.\n\n27:12.720 --> 27:14.640\n Programming or literate programming?\n\n27:14.640 --> 27:15.520\n Literate programming.\n\n27:15.520 --> 27:24.080\n Okay. You heard it here first. Okay. You dodged this question in an interview I listened to.\n\n27:24.960 --> 27:29.680\n So let me ask you again here. What makes for a beautiful program?\n\n27:30.240 --> 27:31.840\n What makes for a beautiful program?\n\n27:31.840 --> 27:36.000\n Yeah. What are the characteristics you see? Like you just said, literate programming.\n\n27:36.640 --> 27:40.960\n What are the characteristics you see in a program that make you sit back and say,\n\n27:40.960 --> 27:47.280\n that's pretty good? Well, the reason I didn't answer is because there are dozens and dozens\n\n27:47.280 --> 27:54.080\n of answers to that because you can define beauty, the same personal defined beauty,\n\n27:54.960 --> 27:59.120\n different way from hour to hour. I mean, it depends on what you're looking for.\n\n27:59.120 --> 28:10.960\n At one level, it's beautiful just if it works at all. At another level, it's beautiful if it can\n\n28:10.960 --> 28:19.760\n be understood easily. It's beautiful if it's literate programming. It's beautiful. It makes\n\n28:19.760 --> 28:21.280\n you laugh. I mean.\n\n28:21.280 --> 28:26.400\n Yeah. So I'm with you. I think beauty, if it's readable.\n\n28:27.120 --> 28:28.000\n Readable, yeah.\n\n28:28.000 --> 28:35.120\n Is if you understand what's going on and also understand the elegance of thought behind it.\n\n28:36.160 --> 28:42.880\n And then also, as you said, wit and humor. I was always, I remember having this conversation,\n\n28:42.880 --> 28:51.040\n I had this conversation on Stack Overflow, whether humor is good in comments. And I think it is.\n\n28:51.040 --> 28:53.120\n Whether humor is good in comments.\n\n28:53.120 --> 28:58.960\n Like when you add comments in code, I always thought a little bit of humor is good.\n\n29:00.000 --> 29:06.080\n It shows personality. It shows character, shows wit and fun and all those kinds of things\n\n29:07.280 --> 29:08.800\n of the personality of the programmer.\n\n29:08.800 --> 29:17.040\n Yeah. Okay. So a couple of days ago, I received a wonderful present from my former editor at\n\n29:17.040 --> 29:24.880\n Aspen Wesley. He's downsizing his house and he found that somebody at the company had\n\n29:26.880 --> 29:32.240\n found all of their internal files about the art of computer programming from the 1960s\n\n29:32.240 --> 29:39.920\n and they gave it to him before throwing it in the garbage. And then so he said,\n\n29:39.920 --> 29:44.400\n oh yeah, he planned to keep it for posterity, but now he realized that posterity is\n\n29:44.400 --> 29:54.720\n a bit too much for him to handle, so he sent it to me. And so I just received this big stack\n\n29:55.760 --> 30:01.200\n of letters, some of which I had written to them, but many of which they had written to\n\n30:02.000 --> 30:06.320\n early guinea pigs who were telling them whether they should publish or not.\n\n30:06.320 --> 30:13.920\n You know, and one of the things was in the comments to volume one,\n\n30:17.760 --> 30:27.920\n the major reader was Bob Floyd, who is my great co worker in the 60s, died early,\n\n30:27.920 --> 30:38.960\n unfortunately. And he commented about the humor in it. So he ran it by me, you know,\n\n30:38.960 --> 30:45.520\n says, you know, keep this joke in or not, you know. They also sent it out to focus group.\n\n30:46.480 --> 30:50.240\n What do you think about humor in a book about computer programming?\n\n30:50.240 --> 30:51.520\n What's the conclusion?\n\n30:51.520 --> 30:59.600\n And I stated my philosophy. It said, you know, the ideal thing is that it's something where\n\n31:00.320 --> 31:04.800\n the reader knows that there's probably a joke here if you only understood it. And this is a\n\n31:04.800 --> 31:13.280\n motivation to understand, to think about it a little bit. But anyway, it's a very delicate\n\n31:13.280 --> 31:21.600\n humor. I mean, it's really each each century invents a different kind of humor, too. Different\n\n31:21.600 --> 31:27.600\n cultures have different different kinds of humor. Yeah. Like we talked about Russia a little bit\n\n31:27.600 --> 31:34.960\n offline. You know, there's dark humor and, you know, when a country goes through something\n\n31:34.960 --> 31:39.680\n difficult, that life and stuff like this. And, you know, and Jack Benny, I mean,\n\n31:39.680 --> 31:46.000\n you know, Steve Allen wrote this book about humor, and it was the most boring book,\n\n31:46.000 --> 31:54.080\n but he was one of my idols. But it's called The Funny Men or something like that. But yeah. Okay.\n\n31:54.080 --> 32:00.800\n So anyway, I think it's important to know that this is part of life, and it should be fun and\n\n32:00.800 --> 32:08.560\n not... And so, you know, I wrote this organ composition, which is based on the Bible,\n\n32:08.560 --> 32:13.760\n but I didn't refrain from putting little jokes in it also in the music.\n\n32:14.320 --> 32:15.680\n It's hidden in the music.\n\n32:15.680 --> 32:17.440\n It's there, yeah.\n\n32:18.160 --> 32:19.520\n A little humor is okay?\n\n32:19.520 --> 32:25.040\n Yeah. I mean, not egregious humor. So in this correspondence, you know, there were\n\n32:27.280 --> 32:35.840\n things I said, yeah, I really shouldn't have done that. But other ones I insisted on. And I've got\n\n32:35.840 --> 32:44.800\n jokes in there that nobody has figured out yet. In fact, in volume two, I've got a cryptogram,\n\n32:44.800 --> 32:52.560\n a message, enciphered. And in order to decipher it, you're going to have to break an RSA key,\n\n32:52.560 --> 32:59.680\n which is larger than people know how to break. And so, you know, if computers keep getting faster\n\n32:59.680 --> 33:04.080\n and faster, then, you know, it might be a hundred years, but somebody will figure out what this\n\n33:04.080 --> 33:07.680\n what this message is and they will laugh. I mean, I've got a joke in there.\n\n33:09.520 --> 33:14.240\n So that one you really have to work for. I don't know if you've heard about this.\n\n33:15.840 --> 33:21.520\n Let me explain it. Maybe you'll find it interesting. So OpenAI is a company that\n\n33:22.400 --> 33:28.480\n does AI work, and they have this language model. It's a neural network that can generate\n\n33:28.480 --> 33:37.680\n language pretty well. But they also have, on top of that, developed something called OpenAI Codex.\n\n33:38.640 --> 33:42.720\n And together with GitHub, they developed a system called OpenAI Copilot.\n\n33:43.680 --> 33:50.720\n Let me explain what it does. There's echoes of literate programming in it. So what you do\n\n33:50.720 --> 33:57.600\n is you start writing code and it completes the code for you. So, for example, you start,\n\n33:57.600 --> 34:03.520\n let's go to your factoring program. You start, you write in JavaScript and Python and any language\n\n34:04.480 --> 34:11.200\n that it trained on. You start, you write the first line and some comments, like what this\n\n34:11.200 --> 34:17.040\n code does, and it generates the function for you. And it does an incredibly good job.\n\n34:17.040 --> 34:23.280\n Like, it's not provably right, but it often does a really good job of completing the code for you.\n\n34:23.280 --> 34:26.880\n I see. But how do you know whether it did a good job or not?\n\n34:26.880 --> 34:27.440\n Yeah.\n\n34:27.440 --> 34:29.840\n You could see a lot of examples where it did a good job.\n\n34:31.040 --> 34:34.400\n And so it's not a thing that generates code for you.\n\n34:34.400 --> 34:35.360\n Yeah, exactly.\n\n34:35.360 --> 34:41.760\n It starts, it gives you, so it puts the human in the seat of fixing\n\n34:42.720 --> 34:47.920\n issues versus writing from scratch. Do you find that kind of idea at all interesting?\n\n34:48.560 --> 34:53.360\n Every year, we're going to be losing more and more control over what machines are doing.\n\n34:53.360 --> 35:02.320\n And people are saying, well, when I was a professor at Caltech in the 60s, we had this\n\n35:03.760 --> 35:10.720\n guy who talked a good game. He could give inspiring lectures and you'd think, well,\n\n35:13.440 --> 35:16.880\n thrilling things he was talking about. An hour later, you'd say, well, what did he say?\n\n35:16.880 --> 35:23.520\n Yeah. But he really felt that it didn't matter whether computers got the right answer or not,\n\n35:23.520 --> 35:29.040\n it just mattered whether it made you happy or not. In other words, if your boss paid for it,\n\n35:30.800 --> 35:35.360\n then you had a job, you could take care of your wife.\n\n35:35.360 --> 35:37.120\n Happiness is more important than truth.\n\n35:38.000 --> 35:40.800\n Exactly. He didn't believe in truth, but he was a philosopher.\n\n35:40.800 --> 35:45.680\n Yes, I like it. And somehow you see...\n\n35:47.040 --> 35:52.800\n We're going that way. So many more things are taken over by saying, well, this seems to work.\n\n35:55.440 --> 35:59.520\n When there is a competing interest involved, neither side understands\n\n36:00.880 --> 36:09.360\n why the decision is being made. We realize now that it's bad, but consider what happens\n\n36:09.360 --> 36:17.360\n 5 or 10 years down the line when things get even more further detached. Each thing is based on\n\n36:17.920 --> 36:20.080\n something from the previous year.\n\n36:20.080 --> 36:23.600\n Yeah. So you start to lose... The more you automate,\n\n36:23.600 --> 36:26.800\n the more you start to lose track of some deep human things.\n\n36:26.800 --> 36:27.600\n Exponentially.\n\n36:28.160 --> 36:36.080\n Exponentially. So that's the dark side. The positive side is the more you automate,\n\n36:36.080 --> 36:41.600\n the more you let humans do what humans do best. So maybe programming...\n\n36:43.280 --> 36:48.080\n Maybe humans should focus on a small part of programming that requires that genius,\n\n36:48.640 --> 36:53.600\n the magic of the human mind, and the mess you let the machine generate.\n\n36:55.600 --> 37:00.400\n That's the positive, but of course, it does come with the darkness of automation.\n\n37:01.760 --> 37:02.800\n What's better? Correctness?\n\n37:02.800 --> 37:06.480\n I'm never going to try to write a book about that.\n\n37:06.480 --> 37:09.440\n I'm never going to recommend to any of my students to work for them.\n\n37:10.160 --> 37:14.160\n Sure. So you're on the side of correctness, not beauty, not happiness.\n\n37:14.160 --> 37:16.560\n I'm on the side of understanding.\n\n37:17.200 --> 37:18.240\n Understanding.\n\n37:18.240 --> 37:25.840\n And I think these things are really marvelous if what they do is all of a sudden we have a better\n\n37:25.840 --> 37:34.560\n medical diagnosis or it'll help guide some scientific experiment or something like curing\n\n37:34.560 --> 37:45.120\n diseases or whatever. But when it affects people's lives in a serious way... If you're writing code,\n\n37:46.080 --> 37:50.160\n oh yeah, this is great. This will make a slaughter bot.\n\n37:50.160 --> 37:59.600\n I see. So you have to be very careful. Right now it seems like fun and games.\n\n37:59.600 --> 38:04.160\n It's useful to write a little JavaScript program that helps you with the website.\n\n38:04.800 --> 38:10.000\n But like you said, one year passes, two years passes, five years, and you forget.\n\n38:10.000 --> 38:14.560\n You start building on top of it, and then all of a sudden you have autonomous weapon systems.\n\n38:14.560 --> 38:19.520\n Well, we're all dead. It doesn't matter in that sense.\n\n38:21.360 --> 38:25.360\n Well, in the end, this whole thing ends anyway.\n\n38:28.880 --> 38:36.400\n There is a heat death of the universe predicted, but I'm trying to postpone that for a little bit.\n\n38:38.160 --> 38:42.960\n Well, it'd be nice that at the end, as we approach the heat death of the universe,\n\n38:42.960 --> 38:51.120\n there's still some kind of consciousness there to appreciate it. Hopefully human consciousness.\n\n38:51.760 --> 38:59.120\n I'll settle for 10 to the 10th year, some finite number. But things like this might be the reason\n\n38:59.120 --> 39:06.160\n we don't pick up any signals from extraterrestrials. They don't want anything to do with us.\n\n39:06.160 --> 39:14.480\n Oh, because they, because they, they, they invented it too.\n\n39:14.480 --> 39:22.480\n So you, you do have a little bit of worry on the existential threats of AI and automation.\n\n39:23.120 --> 39:26.960\n So like, like removing the human from the picture, et cetera. Yeah.\n\n39:26.960 --> 39:36.160\n Um, people have more, more potential to do harm now than by far than they did a hundred years ago.\n\n39:36.160 --> 39:42.080\n But are you optimistic about the humans are good at creating destructive things,\n\n39:42.080 --> 39:46.240\n but also humans are good at solving problems. Yeah. I mean, there's half empty and half full,\n\n39:46.240 --> 39:54.160\n you know, so I can go. So let me, let me put it this way because,\n\n39:54.160 --> 40:02.960\n because it's the only way I can be optimistic, but, but, but, but think of, um, of, uh,\n\n40:05.280 --> 40:10.960\n things that have changed because of civilization, you know, they don't occur just in nature.\n\n40:11.840 --> 40:19.920\n So just, uh, just imagine the room we're in, for example. Okay. Some, you know, we've got pencils,\n\n40:19.920 --> 40:24.800\n we've got books, we've got tables, we've got microphones, your clothing, food,\n\n40:25.440 --> 40:34.080\n all these things were added. Somebody invented them one by one and millions of things, uh,\n\n40:34.080 --> 40:40.320\n that we inherit. Okay. Um, and, uh, it's inconceivable that, that so many millions\n\n40:40.320 --> 40:48.960\n of billions of things, uh, wouldn't have problems and we get it all right. Um, and each one\n\n40:48.960 --> 40:58.880\n would have no negative effects and so on. So it, it's very amazing that as much works as does work.\n\n40:58.880 --> 41:05.840\n It's, it's, it's incredibly amazing. And actually that's the source of my optimism as well,\n\n41:06.880 --> 41:15.280\n including for artificial intelligence. So we, we drive over bridges. We, uh, we use all kinds\n\n41:15.280 --> 41:20.080\n of technology. We don't know how it works. And there's millions of brilliant people involved in\n\n41:20.080 --> 41:26.320\n building a small part of that and it doesn't go wrong and it works. And I mean that it, it works\n\n41:27.040 --> 41:34.320\n and it doesn't go, go wrong often enough for us to suffer. And we can identify things that\n\n41:34.320 --> 41:42.240\n aren't working and try to improve on them. In a suboptimal, often suboptimal way. Oh, absolutely.\n\n41:42.240 --> 41:50.800\n But it's, but the, but the, the kind of things that I know how to improve require human beings\n\n41:50.800 --> 41:57.600\n to be rational. And I, I'm losing my confidence that human beings are rational. Yeah. Yeah. Now\n\n41:57.600 --> 42:04.160\n here you go again with the worst case, uh, worst case analysis. Um, they may not be rational, but\n\n42:04.160 --> 42:12.560\n they're, um, they're, they're clever and, uh, beautiful in their own kind of way. I tend to\n\n42:12.560 --> 42:20.720\n think that most people, um, have the desire and the capacity to be good to each other and love\n\n42:20.720 --> 42:27.440\n will ultimately win out. Like if they're given the opportunity, that's where they lean. In the Art\n\n42:27.440 --> 42:32.560\n of Computer Programming, you wrote, the real problem is that programmers have spent far too\n\n42:32.560 --> 42:38.400\n much time worrying about efficiency in the wrong places. And at the wrong times, premature\n\n42:38.400 --> 42:46.880\n optimization is the root of all evil in parentheses, or at least most of it in programming. Can you,\n\n42:46.880 --> 42:54.880\n uh, explain this idea? Uh, what's the wrong time? What is the wrong place for optimization? So\n\n42:54.880 --> 43:04.000\n so first of all, the word optimization, I started out writing software, uh, and optimization was,\n\n43:04.000 --> 43:11.520\n I was a compiler writer. So optimization meant, uh, making the, uh, making a better translation\n\n43:12.400 --> 43:17.840\n so that it would run faster on a, on a machine. So an optimized program is just like, you know,\n\n43:17.840 --> 43:24.320\n you, you, you run a program and you set the optimization level, uh, for, uh, to the compiler.\n\n43:24.320 --> 43:31.120\n So that's one word for optimization. Um, and at that time I, I happened to be looking in an\n\n43:31.120 --> 43:37.360\n unabridged dictionary, uh, for some reason or other, and I came to the word optimizer.\n\n43:37.360 --> 43:42.080\n So what's the meaning of the word optimize? And it says to view with optimism.\n\n43:44.800 --> 43:50.320\n And you look in Webster's dictionary of English language in 19, early 1960s,\n\n43:50.320 --> 43:58.560\n that's what optimize meant. Okay. Um, now, so people started doing cost optimization,\n\n43:58.560 --> 44:06.640\n other kinds of things, uh, uh, you know, whole sub fields of, of, uh, algorithms and economics\n\n44:06.640 --> 44:13.600\n and whatever are based on what they call optimization now. But, uh, but to me optimization\n\n44:13.600 --> 44:21.040\n when I was saying that was saying, uh, changing a program to make it more, uh, tuned to the machine.\n\n44:21.680 --> 44:32.560\n And I found out that, uh, when a person writes a program, uh, he or she tends to think that\n\n44:33.120 --> 44:37.200\n the parts that were hardest to write are going to be hardest for the computer to execute.\n\n44:37.200 --> 44:47.440\n So maybe I have 10 pages of code, but I had to work a week writing this page. I mentally think\n\n44:47.440 --> 44:53.360\n that when the computer gets to that page, it's going to slow down. It's going to say, oh, I\n\n44:53.360 --> 44:58.880\n don't understand what I'm doing. I better, I better be more careful. Anyway, this is of course silly,\n\n44:58.880 --> 45:04.080\n but it's, it's, it's something that we, that we, that we don't know when we write a piece of code.\n\n45:04.080 --> 45:09.200\n We don't know what, what, whether the computer is actually going to be executing that code\n\n45:09.200 --> 45:17.280\n very much. So, so people had, had a very poor understanding of, of what the computer was\n\n45:17.280 --> 45:25.440\n actually doing. Uh, I made one test where, where we studied a Fortran compiler and it was spending\n\n45:25.440 --> 45:32.240\n more than 80% of its time reading the comments card. Um, but as a programmer, we were really\n\n45:32.240 --> 45:36.400\n concerned about how fast it could take a complicated expression that had lots of\n\n45:36.400 --> 45:43.760\n levels of parentheses and, and, and, and convert that into something. But that was just, you know,\n\n45:43.760 --> 45:52.080\n less than 1% of the, so if we optimize that, uh, we didn't know what we were doing, but, but,\n\n45:52.080 --> 45:57.200\n but if we knew that it was spending 80% of his time on the comments card, you know, in 10 minutes,\n\n45:57.200 --> 46:01.040\n we could, we could make the, the, the compiler run more than twice as fast.\n\n46:01.040 --> 46:05.840\n And you could only do that once you've completed the program and then you empirically study where.\n\n46:05.840 --> 46:09.520\n I had some kind of profiling that I knew what was important. Yeah.\n\n46:10.080 --> 46:15.200\n So you don't think this applies generally? I mean, there's something that rings true to this\n\n46:15.200 --> 46:18.080\n across all of them. I'm glad that it applied generally, but it was,\n\n46:18.080 --> 46:24.400\n it was only my good luck. I said it, but you know, but I did, but I said it in a limited context\n\n46:24.400 --> 46:31.760\n and I, and, and I'm glad if it makes people think about stuff because I, but it applies\n\n46:32.800 --> 46:41.760\n in another sense too, that is sometimes I will do optimization in a way that does help\n\n46:43.440 --> 46:49.520\n the actual running time, but makes the program impossible to change next week.\n\n46:49.520 --> 46:55.280\n Right. Because I've changed my data structure or something that, that made it less adaptable.\n\n46:56.080 --> 47:04.000\n So one of the great principles of computer science is, is, is laziness or whatever you call it,\n\n47:04.800 --> 47:14.000\n late binding. You know, don't hold off decisions when you can. And, and, and, you know, and we\n\n47:14.000 --> 47:18.560\n understand now quantitatively how valuable that is.\n\n47:18.560 --> 47:22.160\n What do you mean we understand? So you mean from a...\n\n47:22.160 --> 47:29.440\n People, people have written thesis about how you can, how late binding will, will improve the,\n\n47:29.440 --> 47:35.200\n I mean, you know, just in time manufacturing or whatever, you can make, you can defer a decision\n\n47:36.320 --> 47:41.440\n instead of doing your advanced planning and say, I'm going to allocate 30% to this and 50%.\n\n47:41.440 --> 47:45.920\n So in all kinds of domains, there's an optimality to laziness in many cases.\n\n47:45.920 --> 47:53.600\n Decision is not made in advance. So instead you, you, you design in order to be flexible to change\n\n47:53.600 --> 48:00.160\n with the, with the way the wind is blowing. Yeah. But so the reason that line resonated\n\n48:00.160 --> 48:06.000\n with a lot of people is because there's something about the programmer's mind\n\n48:06.560 --> 48:15.600\n that wants, that enjoys optimization. So it's a constant struggle to balance laziness and late\n\n48:15.600 --> 48:23.840\n binding with the desire to optimize. The elegance of a well optimized code\n\n48:23.840 --> 48:30.000\n is something that's compelling to programming. Yeah. It's another concept of beauty.\n\n48:31.520 --> 48:39.600\n Let me ask you a weird question. So Roger Penrose has talked about computation computers\n\n48:39.600 --> 48:49.360\n and he proposed that the way the human mind discovers mathematical ideas is something more\n\n48:49.360 --> 48:57.200\n than a computer. That, that a universal Turing machine cannot do everything that a human mind\n\n48:57.200 --> 49:05.120\n can do. Now this includes discovering mathematical ideas and it also includes, he's written a book\n\n49:05.120 --> 49:12.240\n about it, Consciousness. So I don't know if you know Roger, but my, my daughter's kids played\n\n49:12.240 --> 49:19.840\n with his kids in Oxford. Nice. So do you think there is such a limit to the computer? Do you\n\n49:19.840 --> 49:26.080\n think consciousness is more than a computation? Do you think the human mind, the way it thinks\n\n49:26.080 --> 49:35.360\n is more than a computation? I mean, I can say yes or no, but, but, but I don't, I have no reason. I\n\n49:35.360 --> 49:40.480\n mean. So you don't find it useful to have an intuition in one way or the other? Like when\n\n49:40.480 --> 49:46.400\n you think about algorithms, isn't it useful to think about the limits? Unanswerable question in\n\n49:46.400 --> 49:51.520\n my opinion is, is no better than anybody else. You think it's unanswerable. So you don't think\n\n49:51.520 --> 49:56.640\n eventually science. How many angels can dance on the head of a, I mean, I don't know. But angels.\n\n49:58.400 --> 50:02.880\n Anyway, there, there are lots of things that are beyond, that we can speculate about, but\n\n50:03.600 --> 50:08.640\n I don't want somebody to say, oh yeah, Knuth said this and so he's, he's, he's smart. And so,\n\n50:08.640 --> 50:14.560\n so he, so that must be, I mean, I say it's something that we'll never know.\n\n50:14.560 --> 50:22.000\n Oh, interesting. Okay. That's a strong statement. I don't, I personally think it's something we\n\n50:22.000 --> 50:28.080\n will know eventually. Like there's no reason to me why the, the workings of the human mind\n\n50:28.880 --> 50:34.080\n are not within the reach of science. That's absolutely possible. And I'm not denying it.\n\n50:34.080 --> 50:38.640\n Yeah. But right now you don't have a good intuition. I mean, that's also possible,\n\n50:38.640 --> 50:45.280\n you know, that an AI, you know, created the universe, you know, intelligent design has all\n\n50:45.280 --> 50:51.920\n been done by an AI. This is, I mean, all of these things are, but, but, but you're asking me to,\n\n50:52.640 --> 50:58.960\n to pronounce on it. And I don't have any expertise. I'm a teacher that passes on knowledge,\n\n50:58.960 --> 51:05.440\n but I don't, but I don't know the fact that I, that I vote yes or no on.\n\n51:05.440 --> 51:13.840\n Well, you do have expertise as a human, not as a, not as a teacher or a scholar of computer science.\n\n51:14.480 --> 51:18.640\n I mean, that's ultimately the realm of where the discussion of human thought.\n\n51:18.640 --> 51:19.760\n Yeah. Well, I know where.\n\n51:19.760 --> 51:21.040\n And consciousness is.\n\n51:21.040 --> 51:25.280\n I know where, where Penrose is coming from. He, I'm sure he has no,\n\n51:26.160 --> 51:28.880\n I mean, he might even thought he proved it, but.\n\n51:28.880 --> 51:32.320\n No, he doesn't. He doesn't prove it. He is following intuition.\n\n51:32.320 --> 51:36.400\n But, but I mean, you have to ask John McCarthy. John McCarthy,\n\n51:38.240 --> 51:41.920\n I think, were totally unimpressed by these statements.\n\n51:43.600 --> 51:50.240\n So you don't think, so even like the Turing paper on, on the Turing test that,\n\n51:51.120 --> 51:53.760\n you know, starts by asking, can machines think?\n\n51:53.760 --> 51:54.000\n Oh.\n\n51:54.960 --> 51:59.520\n You don't think these kind of, Turing doesn't like that question.\n\n51:59.520 --> 52:03.280\n Yeah. I don't consider it important, let's just put it that way.\n\n52:04.560 --> 52:10.080\n Because it's, it's in the category of things that it would be nice to know,\n\n52:10.080 --> 52:15.600\n but I think it's beyond knowledge. And so I don't, I'm more interested in knowing\n\n52:16.800 --> 52:19.520\n about the Riemann hypothesis or something.\n\n52:20.320 --> 52:23.680\n So when you say, it's an interesting statement, beyond knowledge.\n\n52:24.320 --> 52:24.720\n Yeah.\n\n52:24.720 --> 52:31.200\n I think what you mean is it's not sufficiently well, it's not even known well enough to be\n\n52:31.200 --> 52:35.920\n able to formalize it in order to ask a clear question.\n\n52:35.920 --> 52:36.320\n Yeah.\n\n52:36.320 --> 52:39.200\n And so that's why it's beyond knowledge, but that doesn't mean it's not\n\n52:40.000 --> 52:41.680\n eventually going to be formalized.\n\n52:41.680 --> 52:45.360\n Yeah. Yeah. Maybe consciousness will be understood some, someday.\n\n52:46.080 --> 52:51.120\n The last time I checked, it was still 200 years away.\n\n52:51.120 --> 52:57.360\n I mean, I haven't been specializing in this by any means, but I went to lectures about it 20\n\n52:57.360 --> 53:05.280\n years ago when I was, there was a symposium at the American Academy in Cambridge. And it started out\n\n53:05.280 --> 53:11.360\n by saying, essentially, everything that's been written about consciousness is hogwash.\n\n53:12.960 --> 53:18.240\n I tend to disagree with that a little bit.\n\n53:18.240 --> 53:24.640\n So consciousness for the longest time still is in the realm of philosophy.\n\n53:24.640 --> 53:28.320\n So it's just conversations without any basis and understanding.\n\n53:28.960 --> 53:36.080\n Still, I think once you start creating artificial intelligence systems that interact with humans\n\n53:38.320 --> 53:45.040\n and they have personality, they have identity, you start flirting with the question of\n\n53:45.040 --> 53:49.680\n consciousness, not from a philosophical perspective, but from an engineering perspective.\n\n53:50.320 --> 53:53.920\n And then it starts becoming much more like, I feel like.\n\n53:53.920 --> 53:59.440\n Yeah. Don't misunderstand me. I certainly don't disagree with that at all.\n\n54:00.800 --> 54:07.680\n And even at these lectures that we had 20 years ago, there were neurologists pointing out that\n\n54:08.880 --> 54:14.640\n human beings had actually decided to do something before they were conscious of making that\n\n54:14.640 --> 54:24.320\n decision. I mean, they could tell that signals were being sent to their arms before they knew\n\n54:24.320 --> 54:34.480\n that things like this are true. And Les Valiant has an architecture for the brain. And more recently,\n\n54:34.480 --> 54:44.640\n Christos Papadimitriou in the Academy of Science Proceedings a year ago with two other people,\n\n54:44.640 --> 54:54.720\n but I know Christos very well. And he's got this model of this architecture by which\n\n54:54.720 --> 55:02.720\n you could create things that correlate well with experiments that are done on consciousness.\n\n55:02.720 --> 55:15.520\n And he actually has a machine language in which you can write code and test hypotheses.\n\n55:17.520 --> 55:24.960\n And so we might have a big breakthrough. My personal feeling is that consciousness is the\n\n55:24.960 --> 55:38.560\n best model I've heard of to explain the miracle of consciousness is that somehow inside of our\n\n55:39.440 --> 55:49.440\n brains, we're having a continual survival for the fittest competition. And I'm speaking to you,\n\n55:49.440 --> 55:56.240\n and I'm speaking to you, all the possible things I might be wanting to say are all in there and\n\n55:56.240 --> 56:03.280\n there's like a voting going on. Yeah, right. And one of them is winning and that's affecting\n\n56:04.880 --> 56:11.840\n the next sentence and so on. And there was this book, Machine Intelligence or something?\n\n56:11.840 --> 56:12.640\n On Intelligence?\n\n56:12.640 --> 56:21.280\n On Intelligence, yeah. Bill Atkinson was a total devotee of that book.\n\n56:21.280 --> 56:27.360\n Well, I like whether it's consciousness or something else, I like the storytelling part\n\n56:27.360 --> 56:34.960\n that it feels like for us humans, it feels like there's a concrete story. It's almost\n\n56:34.960 --> 56:38.640\n like literary programming. I don't know what the programming is going on on the inside,\n\n56:38.640 --> 56:44.080\n but I'm getting a nice story here about what happened. And it feels like I'm in control and\n\n56:44.080 --> 56:49.920\n I'm getting a nice clear story. But it's also possible there's a computation going on that's\n\n56:49.920 --> 56:54.560\n really messy. There's a bunch of different competing ideas. And in the end, it just kind\n\n56:54.560 --> 57:01.680\n of generates a story for you, a consistent story for you to believe. And that makes it all nice.\n\n57:01.680 --> 57:08.400\n Yeah. And so I prefer to talk about things that I have some expertise in than things\n\n57:08.400 --> 57:13.440\n which I'm only on the sideline.\n\n57:14.480 --> 57:18.560\n So there's a tricky thing. I don't know if you have any expertise in this.\n\n57:18.560 --> 57:21.280\n You might be a little bit on the sideline. It'd be interesting to ask though.\n\n57:21.840 --> 57:24.960\n What are your thoughts on Cellular Automata and the Game of Life?\n\n57:25.680 --> 57:28.800\n Have you ever played with those kind of little games?\n\n57:28.800 --> 57:43.200\n I think the Game of Life is wonderful and shows all kinds of stuff about how things can evolve\n\n57:43.200 --> 57:51.520\n without the creator understanding anything more than the power of learning in a way. But to me,\n\n57:51.520 --> 58:01.840\n the most important thing about the Game of Life is how it focused for me what it meant to have\n\n58:01.840 --> 58:11.600\n free will or not. Because the Game of Life is obviously totally deterministic. And I find it\n\n58:11.600 --> 58:17.360\n hard to believe that anybody who's ever had children cannot believe in free will. On the\n\n58:17.360 --> 58:30.160\n other hand, this makes it crystal clear. John Conway said he wondered whether it was immoral\n\n58:30.160 --> 58:34.960\n to shut the computer off after he got into a particularly interesting play of the Game of Life.\n\n58:36.640 --> 58:43.200\n Wow. Yeah. So to me, the reason I love the Game of Life is exactly as you said,\n\n58:43.200 --> 58:49.040\n a clear illustration that from simple initial conditions with simple rules,\n\n58:49.040 --> 58:58.640\n you know exactly how the system is operating, it's deterministic. And yet, if you allow yourself to\n\n58:58.640 --> 59:06.240\n lose that knowledge a little bit enough to see the bigger organisms that emerge,\n\n59:06.240 --> 59:10.720\n and then all of a sudden they seem conscious. They seem, not conscious, but living.\n\n59:10.720 --> 59:17.520\n If the universe is finite, we're all living in the Game of Life, just slowed down. I mean,\n\n59:18.240 --> 59:19.520\n it sped up a lot.\n\n59:21.040 --> 59:28.160\n But do you think technically some of the ideas that you used for analysis of algorithms can be\n\n59:28.160 --> 59:32.960\n used to analyze the Game of Life? Can we make sense of it? Or is it too weird?\n\n59:32.960 --> 59:43.360\n Yeah. I mean, I've got a dozen exercises in volume four, fascicle six, that actually work\n\n59:43.360 --> 59:57.120\n rather well for that purpose. Bill Gospers came up with the algorithm that allows Golly to run\n\n59:57.120 --> 1:00:04.480\n thousands and thousands of times faster. You know the website called Golly? G O L L Y?\n\n1:00:04.480 --> 1:00:07.680\n It simulates the cellular automata, like Game of Life?\n\n1:00:07.680 --> 1:00:09.200\n Yeah, you got to check it out.\n\n1:00:10.480 --> 1:00:11.920\n Can I ask you about John Conway?\n\n1:00:12.640 --> 1:00:19.600\n Yes. In fact, I'm just reading now the issue of mathematical intelligence that came in last\n\n1:00:19.600 --> 1:00:27.680\n week. It's a whole issue devoted to remembrance of him.\n\n1:00:28.320 --> 1:00:29.040\n Did you know him?\n\n1:00:30.560 --> 1:00:33.920\n I slept overnight in his house several times.\n\n1:00:35.680 --> 1:00:36.320\n Yeah.\n\n1:00:36.320 --> 1:00:37.760\n He recently passed away.\n\n1:00:38.800 --> 1:00:46.160\n Yeah, he died a year ago, May, I think it was, of COVID.\n\n1:00:46.160 --> 1:00:58.240\n What are some memories of him, of his work, that stand out for you? On a technical level,\n\n1:00:58.240 --> 1:01:04.640\n did any of his work inspire you? On a personal level, did he himself inspire you in some way?\n\n1:01:06.480 --> 1:01:11.360\n Absolutely, all of those things. But let's see, when did I first meet him? I guess I first met\n\n1:01:11.360 --> 1:01:17.120\n him at Oxford in 1967 when I was... Okay, that's a long time ago.\n\n1:01:17.120 --> 1:01:25.840\n Yeah, you were minus 20 years old or something, I don't know, 1967. But there was a conference where\n\n1:01:28.720 --> 1:01:37.760\n I think I was speaking about something known as the Knuth Bendix algorithm now, but he gave a\n\n1:01:37.760 --> 1:01:46.160\n famous talk about knots. And I didn't know at the time, but anyway, that talk had now...\n\n1:01:47.680 --> 1:01:54.560\n The source of thousands and thousands of papers since then. And he was reported on something that\n\n1:01:54.560 --> 1:02:04.560\n he had done in high school almost 10 years earlier before this conference, but he never published it.\n\n1:02:04.560 --> 1:02:13.760\n And he climaxed his talk by building some knots. You have these little plastic things that you\n\n1:02:13.760 --> 1:02:23.200\n can stick together. It's something like Lego, but easier. And so he made a whole bunch of knots\n\n1:02:23.200 --> 1:02:29.200\n in front of the audience and so on and then disassembled it. So it was a dramatic lecture\n\n1:02:29.200 --> 1:02:33.680\n before he had learned how to give even more dramatic lectures later.\n\n1:02:33.680 --> 1:02:37.920\n Were you at that lecture?\n\n1:02:37.920 --> 1:02:46.240\n And I was there, yeah, because I was at the same conference. For some reason, I happened to be in\n\n1:02:46.240 --> 1:02:56.400\n Calgary the same day that he was visiting Calgary. And it was the spring of 72, I'm pretty sure.\n\n1:02:56.400 --> 1:03:07.200\n And we had lunch together and he wrote down during the lunch on a napkin all of the facts about\n\n1:03:08.160 --> 1:03:17.680\n what he called numbers. And he covered the napkin with the theorems about his\n\n1:03:17.680 --> 1:03:31.280\n idea of numbers. And I thought it was incredibly beautiful. And later in 1972, my sabbatical year\n\n1:03:31.280 --> 1:03:37.440\n began and I went to Norway. And in December of that year, in the middle of the night,\n\n1:03:39.120 --> 1:03:46.480\n the thought came to me, you know, Conway's theory about numbers would be a great thing to teach\n\n1:03:46.480 --> 1:03:57.680\n students how to invent research and what the joys are of research. And I had also read a book in\n\n1:03:57.680 --> 1:04:06.800\n dialogue by Alfred Renyi, kind of a Socratic thing where the two characters were talking\n\n1:04:06.800 --> 1:04:16.800\n to each other about mathematics. And so at the end, in the morning, I woke up my wife and said,\n\n1:04:16.800 --> 1:04:27.440\n Jill, I think I want to write a book about Conway's theory. And, you know, I'm supposed\n\n1:04:27.440 --> 1:04:32.400\n to be writing the Art of Computer Program and doing all this other stuff, but I really want\n\n1:04:32.400 --> 1:04:39.360\n to write this other book. And so we made this plan. But I said, I thought I could write it in a week.\n\n1:04:40.400 --> 1:04:47.280\n And we made the plan then. So in January, I rented a room in a hotel in downtown Oslo.\n\n1:04:47.920 --> 1:04:56.160\n We were in sabbatical in Norway. And I rented the hotel in downtown Oslo and did nothing else\n\n1:04:56.160 --> 1:05:02.960\n except write up Conway's theory. And I changed the name to Surreal Numbers. And so this book\n\n1:05:02.960 --> 1:05:11.360\n is now published as Surreal Numbers. And, you know, we figured out, we'd always wonder what\n\n1:05:11.360 --> 1:05:16.080\n would be like to have a fair enough hotel room. So we figured out that she would visit me twice\n\n1:05:16.080 --> 1:05:24.400\n during the week. Things like this, you know, we would try to sneak in. This hotel was run by a\n\n1:05:24.400 --> 1:05:32.960\n mission organization. These ladies were probably very strict, but anyway. So, and it's a wild week\n\n1:05:34.320 --> 1:05:38.880\n in every way. But the thing is, I had lost that. I had lost that napkin in which he wrote the\n\n1:05:38.880 --> 1:05:46.960\n theory, but I looked for it, but I couldn't find it. So I tried to recreate from memory what he\n\n1:05:46.960 --> 1:05:55.600\n had told me at that lunch in Calgary. And as I wrote the book, I was going through exactly what\n\n1:05:55.600 --> 1:06:01.440\n I, what the characters in the book were supposed to be doing. So I start with the two axioms that\n\n1:06:01.440 --> 1:06:06.000\n start out the whole thing and everything is defined, flows from that, but you have to discover\n\n1:06:06.000 --> 1:06:15.680\n why. And every mistake that I make as I'm trying to discover it, my characters make too. And so\n\n1:06:15.680 --> 1:06:25.760\n it's a long, long story. But I worked through this week and it was one of the most intense\n\n1:06:25.760 --> 1:06:36.160\n weeks of my life and I described it in other places. But anyway, after six days, I finished it\n\n1:06:36.160 --> 1:06:44.720\n and on the seventh day I rested and I sent to my secretary to type it. It was flowing as I was\n\n1:06:44.720 --> 1:06:54.080\n writing it faster than I could think almost. But after I finished and tried to write a letter to\n\n1:06:54.080 --> 1:06:59.520\n my secretary telling her how to type it, I couldn't write anymore. You gave it everything.\n\n1:06:59.520 --> 1:07:05.280\n The muse had left me completely. Can you explain how that week could have happened? Like why?\n\n1:07:05.280 --> 1:07:08.640\n That seems like such a magical week of productivity. I have no idea. But anyway,\n\n1:07:08.640 --> 1:07:15.920\n there was some... It was almost as if I was channeling. So the book was typed,\n\n1:07:15.920 --> 1:07:21.440\n they sent it to Conway and he said, well, Don, you got the one axiom wrong.\n\n1:07:24.080 --> 1:07:32.240\n Is there a difference between less than or equal and not greater than? The opposite of being\n\n1:07:32.240 --> 1:07:38.880\n greater than and less than or equal. But anyway, technically it can make a difference when you're\n\n1:07:38.880 --> 1:07:45.840\n developing a logical theory. And the way I had chosen was harder to do than John's original.\n\n1:07:47.840 --> 1:07:53.840\n And we visited him at his house in Cambridge in April. We took a boat actually from Norway\n\n1:07:53.840 --> 1:08:01.920\n over to across the channel and so on and stayed with him for some days. And we talked\n\n1:08:01.920 --> 1:08:11.280\n about all kinds of things he had. He had puzzles that I'd never heard of before. He had a great way\n\n1:08:12.160 --> 1:08:18.480\n to solve the game of solitaire. Many of the common interests that he'd never written them up.\n\n1:08:19.680 --> 1:08:25.360\n But anyway, then in the summertime, I took another week off and went to a\n\n1:08:25.360 --> 1:08:32.800\n Conway place in the mountains of Norway and rewrote the book using the correct axiom.\n\n1:08:34.400 --> 1:08:39.440\n So that was the most intensive connection with Conway. After that...\n\n1:08:40.080 --> 1:08:41.440\n It started with a napkin.\n\n1:08:41.440 --> 1:08:50.160\n It started with a napkin. But we would run into each other. The next really...\n\n1:08:50.160 --> 1:09:02.000\n And I was giving lectures in Montreal. I was giving a series of seven lectures about the\n\n1:09:02.000 --> 1:09:11.600\n topic called Stable Marriages. And he arrived in Montreal between my sixth and seventh lecture.\n\n1:09:11.600 --> 1:09:20.560\n And we met at a party. And I started telling him about the topic I was doing. And he sat and\n\n1:09:20.560 --> 1:09:26.240\n thought about it. He came up with a beautiful theory to show that the... I mean, in technical\n\n1:09:26.240 --> 1:09:34.400\n terms, it's that the set of all stable marriages forms a lattice. And there was a simple way to\n\n1:09:34.400 --> 1:09:41.200\n find the greatest lower bound of two stable pairings and least upper bound of two stable\n\n1:09:41.200 --> 1:09:46.160\n marriage. And so I could use it in my lecture the next day. And he came up with this theorem\n\n1:09:46.160 --> 1:09:59.200\n during the party. And it's a distributive lattice. It added greatly to the theory of stable matching.\n\n1:09:59.200 --> 1:10:07.360\n So you mentioned your wife, Jill. You mentioned stable marriage. Can you tell the story of how\n\n1:10:07.360 --> 1:10:17.440\n you two met? So we celebrated 60 years of wedded bliss last month. And we met because I was dating\n\n1:10:17.440 --> 1:10:24.480\n her roommate. This was my sophomore year, her freshman year. I was dating her roommate. And\n\n1:10:24.480 --> 1:10:33.120\n I wanted her advice on strategy or something like this. And anyway, I found I enjoyed her advice\n\n1:10:33.120 --> 1:10:39.440\n better than her. I enjoyed her roommate. You guys were majoring the same thing?\n\n1:10:39.440 --> 1:10:46.880\n No, no, no. Because I read something about working on a computer in grad school on a difficult\n\n1:10:46.880 --> 1:10:55.520\n computer science topic. So she's an artist and I'm a geek.\n\n1:10:55.520 --> 1:11:01.920\n What was she doing with a computer science book? Was it the manual that she was reading?\n\n1:11:01.920 --> 1:11:05.840\n What was she reading? I wrote the manual that she had to take a\n\n1:11:05.840 --> 1:11:10.480\n class in computer science. So you're the tutor?\n\n1:11:10.480 --> 1:11:22.800\n No, no. There were terrible times trying to learn certain concepts, but I learned art from her.\n\n1:11:23.680 --> 1:11:32.240\n And so we worked together occasionally in design projects. But every year we write a Christmas card\n\n1:11:32.240 --> 1:11:40.720\n and we each have to compromise our own notions of beauty.\n\n1:11:40.720 --> 1:11:48.480\n When did you fall in love with her? That day that I asked her about her roommate.\n\n1:11:48.480 --> 1:11:59.120\n I don't mind telling these things, depending on how far you go.\n\n1:11:59.120 --> 1:12:05.280\n I promise not to go too far.\n\n1:12:05.280 --> 1:12:13.600\n Let me tell you this. I never really enjoyed kissing until I found how she did it.\n\n1:12:13.600 --> 1:12:17.520\n Wow. And 60 years.\n\n1:12:20.240 --> 1:12:26.480\n Is there a secret you can say in terms of stable marriages, of how you stayed together so long?\n\n1:12:27.360 --> 1:12:32.800\n The topic stable marriage, by the way, is a technical term.\n\n1:12:33.600 --> 1:12:36.480\n Yes. It's a joke, Don.\n\n1:12:36.480 --> 1:12:46.640\n But two different people will have to learn how to compromise and work together and\n\n1:12:48.080 --> 1:12:54.800\n you're going to have ups and downs and crises and so on. And so as long as you don't\n\n1:12:56.000 --> 1:13:04.640\n set your expectation on having 24 hours of bliss, then there's a lot of hope for stability.\n\n1:13:04.640 --> 1:13:11.120\n But if you decide that there's going to be no frustration, then...\n\n1:13:13.200 --> 1:13:18.000\n So you're going to have to compromise on your notions of beauty when you write Christmas cards.\n\n1:13:18.000 --> 1:13:18.560\n That's it.\n\n1:13:21.840 --> 1:13:24.640\n You mentioned that Richard Feynman was someone you looked up to.\n\n1:13:25.600 --> 1:13:25.840\n Yeah.\n\n1:13:26.960 --> 1:13:28.800\n Probably you've met him in Caltech.\n\n1:13:28.800 --> 1:13:34.320\n Well, we knew each other, yeah, at Caltech, for sure, yeah.\n\n1:13:35.760 --> 1:13:41.440\n You are one of the seminal personalities of computer science. He's one for physics.\n\n1:13:43.280 --> 1:13:48.160\n Is there specific things you picked up from him by way of inspiration?\n\n1:13:49.440 --> 1:13:51.600\n So we used to go to each other's lectures.\n\n1:13:51.600 --> 1:13:59.360\n But if I saw him sitting in the front row, it would throw me for a loop, actually. I would\n\n1:13:59.360 --> 1:14:11.600\n miss a few sentences. What unique story do I have? I often refer to his time in Brazil\n\n1:14:11.600 --> 1:14:18.720\n where he essentially said they were teaching all the physics students the wrong way. They were just\n\n1:14:18.720 --> 1:14:25.200\n learning how to pass exams and not learning any physics. And he said, if you want me to prove it,\n\n1:14:27.200 --> 1:14:32.720\n here, I'll turn any page of this textbook and I'll tell you what's wrong with this page. And\n\n1:14:32.720 --> 1:14:39.440\n he did so. And the textbook had been written by his host, and he was a great teacher. And he\n\n1:14:39.440 --> 1:14:47.040\n had previously asked his host if he was supposed to tell the truth. But anyway, it epitomizes the\n\n1:14:47.040 --> 1:15:00.480\n way education goes wrong in all kinds of fields and has to periodically be brought back from a\n\n1:15:00.480 --> 1:15:09.600\n process of giving credentials to a process of giving knowledge.\n\n1:15:10.720 --> 1:15:16.560\n That's probably a story that continues to this day in a bunch of places where it's too easy for\n\n1:15:19.840 --> 1:15:26.480\n educational institutions to fall into credentialism versus inspirationalism.\n\n1:15:26.480 --> 1:15:33.680\n I don't know if those are words, but sort of understanding versus just giving a little\n\n1:15:36.080 --> 1:15:36.480\n plaque.\n\n1:15:39.360 --> 1:15:45.200\n It's very much like what we were talking about. If you want to be able to believe\n\n1:15:45.200 --> 1:15:51.440\n the answer, a computer is doing that. One of the things Bob Floyd showed me in the 60s,\n\n1:15:51.440 --> 1:15:59.520\n there was a... He loved this cartoon. There were two guys standing in front of... In those days,\n\n1:15:59.520 --> 1:16:03.520\n a computer was a big thing. And the first guy says to the other guy, he said,\n\n1:16:04.240 --> 1:16:11.440\n this machine can do in one second what it would take a million people to do in a hundred years.\n\n1:16:12.080 --> 1:16:14.640\n And the other guy says, oh, so how do you know it's right?\n\n1:16:14.640 --> 1:16:18.720\n That's a good line.\n\n1:16:21.600 --> 1:16:25.200\n Is there some interesting distinction between physics and math to you?\n\n1:16:26.160 --> 1:16:29.600\n Have you looked at physics much? Speaking of Richard Feynman,\n\n1:16:31.520 --> 1:16:36.000\n the difference between the physics community, the physics way of thinking, the physics intuition\n\n1:16:36.000 --> 1:16:40.640\n versus the theoretical computer science, the mathematical sciences,\n\n1:16:40.640 --> 1:16:43.600\n do you see that as a gap? Are they strongly overlapping?\n\n1:16:44.880 --> 1:16:50.720\n It's quite different, in my opinion. I started as a physics major and I switched into math.\n\n1:16:52.080 --> 1:16:59.680\n And probably the reason was that I could get A plus on the physics exam, but I never had any\n\n1:16:59.680 --> 1:17:05.040\n idea why I would have been able to come up with the problems that were on those exams.\n\n1:17:05.040 --> 1:17:13.520\n But in math, I knew why the teacher set those problems and I thought of other problems that\n\n1:17:13.520 --> 1:17:17.680\n I could set, too. And I believe it's quite a different mentality.\n\n1:17:20.400 --> 1:17:23.920\n It has to do with your philosophy of geekdom?\n\n1:17:23.920 --> 1:17:30.720\n No, it's... I mean, some of my computer scientist friends are really good at physics and others are\n\n1:17:30.720 --> 1:17:38.640\n really good at physics and others are not. And I'm really good at algebra, but not at geometry.\n\n1:17:39.840 --> 1:17:44.800\n Talk about different parts of mathematics. So there are different kinds of physics,\n\n1:17:44.800 --> 1:17:51.680\n but physicists think of things in terms of waves. And I can think of things in terms of waves,\n\n1:17:51.680 --> 1:17:54.960\n but it's like a dog walking on hind legs if I'm thinking about it.\n\n1:17:54.960 --> 1:18:02.800\n So you basically like to see the world in discrete ways and then physics is more continuous.\n\n1:18:02.800 --> 1:18:09.920\n Yeah. I'm not sure if Turing would have been a great physicist. I think he was a pretty good\n\n1:18:10.720 --> 1:18:19.680\n chemist, but I don't know. But anyway, I see things... I believe that computer science is\n\n1:18:19.680 --> 1:18:33.840\n largely driven by people who have brains who are good at resonating with certain kinds of concepts.\n\n1:18:34.480 --> 1:18:37.440\n And like quantum computers, it takes a different kind of brain.\n\n1:18:37.440 --> 1:18:42.640\n Yeah, that's interesting. Yeah. Well, quantum computers is almost like at the intersection\n\n1:18:42.640 --> 1:18:50.080\n in terms of brain between computer science and physics because it involves both at least at this\n\n1:18:50.960 --> 1:18:58.400\n time. But there is like the physicists I've known, they have incredibly powerful intuition.\n\n1:18:59.280 --> 1:19:08.880\n And I mean, statistical mechanics. So I study statistical mechanics and I mean,\n\n1:19:08.880 --> 1:19:15.600\n random processes are related to algorithms in a lot of ways. But there's lots of different\n\n1:19:15.600 --> 1:19:23.200\n flavors of physics as there are different flavors of mathematics as well. But the thing is that I\n\n1:19:23.200 --> 1:19:30.240\n don't see... Well, actually, when they talk to physicists, they use a completely different\n\n1:19:30.240 --> 1:19:36.640\n language than when they're writing expository papers. And so I didn't understand quantum\n\n1:19:36.640 --> 1:19:42.720\n mechanics at all from reading about it in Scientific American. But when I read how they\n\n1:19:42.720 --> 1:19:49.600\n describe it to each other, talking about eigenvalues and various mathematical terms that\n\n1:19:50.800 --> 1:19:58.800\n made sense, then it made sense to me. But Hawking said that every formula you put in a book,\n\n1:19:58.800 --> 1:20:02.480\n you lose half of your readers. And so he didn't put any formulas in the book. So I couldn't\n\n1:20:02.480 --> 1:20:09.600\n understand his book at all. You could say you understood it, but I really didn't.\n\n1:20:10.720 --> 1:20:17.680\n Well, Feynman also spoke in this way. So Feynman, I think, prided himself on really strong\n\n1:20:17.680 --> 1:20:23.440\n intuition. But at the same time, he was hiding all the really good, the deep computation he was\n\n1:20:23.440 --> 1:20:32.000\n doing. So there was one thing that I was never able to... I wish I'd had more time to work out\n\n1:20:32.000 --> 1:20:38.800\n with him. But I guess I could describe it for you. There's something that got my name attached to it\n\n1:20:39.520 --> 1:20:47.520\n called Knuth arrow notation. But it's a notation for very large numbers. And so I find out that\n\n1:20:48.720 --> 1:20:56.720\n somebody invented it in the 1830s. It's fairly easy to understand anyway. So you start with\n\n1:20:56.720 --> 1:21:08.560\n x plus x plus x plus x n times, and you can call that xn. So xn is multiplication. Then you take x\n\n1:21:08.560 --> 1:21:17.600\n times x times x times x n times. That gives you exponentiation, x to the nth power. So that's one\n\n1:21:17.600 --> 1:21:25.280\n arrow. So xn with no arrows is multiplication. Arrow n is x to the nth power.\n\n1:21:25.280 --> 1:21:34.640\n Yeah. So just to clarify for the... So x times x times x n times is obviously xn.\n\n1:21:36.400 --> 1:21:38.160\n x plus x plus x n times.\n\n1:21:39.200 --> 1:21:47.840\n Oh, yeah. Okay. And then multiplication is x to the n. And then here the arrow is when you're\n\n1:21:47.840 --> 1:21:51.760\n doing the same kind of repetitive operation for the exponential.\n\n1:21:51.760 --> 1:21:57.440\n So I put in one arrow, and I get x to the nth power. Now I put in two arrows. And that takes\n\n1:21:57.440 --> 1:22:08.480\n x to the x to the x to the x n times power. So in other words, if it's two double arrow three,\n\n1:22:08.480 --> 1:22:15.840\n that would be two to the two to the two. So that would be two to the fourth power. That'd be 16.\n\n1:22:15.840 --> 1:22:27.200\n Okay. So that's the double arrow. And now you can do a triple arrow, of course, and so on.\n\n1:22:28.720 --> 1:22:38.960\n And I had this paper called, well, essentially big numbers. You try to impress your friend,\n\n1:22:38.960 --> 1:22:46.160\n but by saying a number they've never thought of before. And I gave a special name for it\n\n1:22:47.360 --> 1:22:53.680\n and designed a font for it that has script k and so on. But it really is 10, I think,\n\n1:22:53.680 --> 1:23:00.560\n like 10 quadruple arrow three or something like that. And I claim that that number is so mind\n\n1:23:00.560 --> 1:23:07.120\n boggling that you can't comprehend how large it is. But anyway, I talked to Feynman about this,\n\n1:23:07.120 --> 1:23:14.640\n and he said, oh, let's just use double arrow. But instead of taking integers, let's consider\n\n1:23:15.440 --> 1:23:26.480\n complex numbers. I mean, okay, x arrow arrow two, that means x to the x. But what about x\n\n1:23:27.600 --> 1:23:34.880\n double arrow 2.5? Well, that's not too hard to figure out. That's interpolate between those.\n\n1:23:34.880 --> 1:23:41.600\n But what about x double arrow i or 1 plus i or some complex number?\n\n1:23:42.960 --> 1:23:53.040\n And so he claimed that there was no analytic function that would do the job.\n\n1:23:54.640 --> 1:24:03.600\n But I didn't know how he could claim that that wasn't true. And his next question was,\n\n1:24:03.600 --> 1:24:05.600\n did then have a complex number of arrows?\n\n1:24:09.440 --> 1:24:10.400\n Yeah. Okay.\n\n1:24:10.400 --> 1:24:11.200\n Wow. Okay.\n\n1:24:11.200 --> 1:24:13.680\n Okay. So that's Feynman.\n\n1:24:13.680 --> 1:24:14.400\n That's Feynman.\n\n1:24:14.400 --> 1:24:14.900\n Yeah.\n\n1:24:16.080 --> 1:24:24.080\n Can you describe what the Knuth Morris Pratt algorithm does? And how did you come to develop\n\n1:24:24.080 --> 1:24:28.640\n it? One of the many things that you're known for and has your name attached to it.\n\n1:24:28.640 --> 1:24:36.080\n Yeah. All right. So it should be actually Morris Pratt Knuth. But we decided to use\n\n1:24:36.080 --> 1:24:42.800\n alphabetical order when we published the paper. The problem is something that everybody knows\n\n1:24:42.800 --> 1:24:53.040\n now if they're using a search engine. You have a large collection of text, and you want to know\n\n1:24:53.040 --> 1:25:01.280\n if the word Knuth appears anywhere in the text, let's say, or some other word that's less\n\n1:25:01.280 --> 1:25:05.040\n interesting than Knuth. But anyway. That's the most interesting word.\n\n1:25:05.040 --> 1:25:06.800\n Like Morris or something. Like Morris, right.\n\n1:25:07.440 --> 1:25:16.480\n So anyway, we have a large piece of text, and it's all one long, one dimensional thing. First\n\n1:25:16.480 --> 1:25:24.240\n letter, second letter, et cetera, et cetera, et cetera. And so you'd like to be able to do this\n\n1:25:24.240 --> 1:25:33.840\n quickly. And the obvious way is let's say we're looking for Morris. Okay. So we would go through\n\n1:25:33.840 --> 1:25:39.280\n and wait till we get to letter M. Then we look at the next word, and sure enough, it's an O,\n\n1:25:39.280 --> 1:25:52.880\n and then an R. But then, too bad, the next letter is E. So we missed out on Morris. And so we go\n\n1:25:52.880 --> 1:26:01.440\n back and start looking for another. So that's the obvious way to do it. All right. And Jim Morris\n\n1:26:01.440 --> 1:26:09.680\n noticed there was a more clever way to do it. The obvious way would have started... Let's say\n\n1:26:10.800 --> 1:26:16.880\n we found that letter M had character position 1000. So it would have started next at character\n\n1:26:16.880 --> 1:26:26.560\n position 1001. But he said, no, look, we already read the O and the R, and we know that they aren't\n\n1:26:26.560 --> 1:26:36.640\n Ms. So we can start... We don't have to read those over again. And this gets pretty tricky when\n\n1:26:37.840 --> 1:26:43.520\n the word isn't Morris, but it's more like abracadabra, where you have patterns that\n\n1:26:43.520 --> 1:26:49.760\n are occurring. Like repeating patterns at the beginning, at the middle, at the end.\n\n1:26:49.760 --> 1:26:57.680\n Right. So he worked it out, and he put it into the system software at Berkeley, I think it was,\n\n1:26:57.680 --> 1:27:03.600\n where he was writing some... Berkeley Unix, I think, was some routine that was supposed to\n\n1:27:03.600 --> 1:27:14.320\n find occurrences of patterns in text. But he didn't explain it. And so he found out that several\n\n1:27:14.320 --> 1:27:20.960\n months later, somebody had looked at it, didn't look right, and so they ripped it out. So he had\n\n1:27:20.960 --> 1:27:28.560\n this algorithm, but it didn't make it through because it wasn't understood. Nobody knew about\n\n1:27:28.560 --> 1:27:39.360\n this particularly. Von Pratt also had independently discovered it a year or two later. I forget why.\n\n1:27:39.360 --> 1:27:48.800\n I think Von was studying some technical problem about palindromes or something like that. He\n\n1:27:48.800 --> 1:27:56.320\n wasn't really... Von wasn't working on text searching, but he was working on an abstract\n\n1:27:56.320 --> 1:28:04.480\n problem that was related. Well, at that time, Steve Cook was professor at Berkeley, and\n\n1:28:04.480 --> 1:28:12.240\n it was the greatest mistake that Berkeley CS department made was not to give him tenure.\n\n1:28:13.120 --> 1:28:20.000\n So Steve went to Toronto. But I knew Steve while he was at Berkeley,\n\n1:28:20.800 --> 1:28:29.120\n and he had come up with a very peculiar theorem about a technical concept called a stack automaton.\n\n1:28:29.120 --> 1:28:38.080\n And a stack automaton is a machine that can't do everything a Turing machine can do, but it\n\n1:28:38.080 --> 1:28:44.560\n can only look at something at the top of a stack, or it can put more things on the stack, or it can\n\n1:28:44.560 --> 1:28:51.760\n take things off of the stack. It can't remember a long string of symbols, but it can remember them\n\n1:28:51.760 --> 1:29:00.240\n in reverse order. So if you tell a stack automaton A, B, C, D, E, it can tell you afterwards E, D,\n\n1:29:00.240 --> 1:29:08.320\n C, B, A. It doesn't have any other memory except this one thing that it can see. And Steve Cook\n\n1:29:08.320 --> 1:29:16.800\n proved this amazing thing that says if a stack automaton can recognize a language where the\n\n1:29:16.800 --> 1:29:24.320\n strings of the language are length n in any amount of time whatsoever, so the stack automaton might\n\n1:29:24.320 --> 1:29:30.000\n use a zillion steps, a regular computer can recognize that same language in time n log n.\n\n1:29:30.800 --> 1:29:36.240\n So Steve had a way of transforming a computation that goes on and on and on and on\n\n1:29:38.800 --> 1:29:43.360\n using different data structures into something that you can do on a regular computer\n\n1:29:43.360 --> 1:29:52.720\n fast. The stack automaton goes slow, but somehow the fact that it can do it at all\n\n1:29:53.280 --> 1:29:58.560\n means that there has to be a fast way. So I thought this was a pretty cool theorem.\n\n1:29:59.680 --> 1:30:07.200\n And so I tried it out on a problem where I knew a stack automaton could do it,\n\n1:30:08.320 --> 1:30:12.720\n but I couldn't figure out a fast way to do it on a regular computer. I thought it was a pretty\n\n1:30:12.720 --> 1:30:21.760\n good programmer, but by golly, I couldn't think of any way to recognize this language efficiently.\n\n1:30:22.880 --> 1:30:29.920\n So I went through Steve Cook's construction. I filled my blackboard with everything that\n\n1:30:29.920 --> 1:30:37.520\n stack automaton did. I wrote down, and then I tried to see patterns in that.\n\n1:30:37.520 --> 1:30:44.720\n And how did he convert that into a computer program on a regular machine? And finally,\n\n1:30:44.720 --> 1:30:52.080\n I psyched it out. What was the thing I was missing so that I could say, oh yeah, this is what I\n\n1:30:52.080 --> 1:31:01.040\n should do in my program. And now I have an efficient program. And so I would never have\n\n1:31:01.040 --> 1:31:09.120\n thought about that if I hadn't had his theorem, which was a purely abstract thing.\n\n1:31:09.120 --> 1:31:16.160\n So you used this theorem to try to intuit how to use the stack automaton for the string matching\n\n1:31:16.160 --> 1:31:23.600\n problem. Yeah. So the problem I had started with was not the string matching problem,\n\n1:31:23.600 --> 1:31:28.720\n but then I realized that the string matching problem was another thing which could be done\n\n1:31:28.720 --> 1:31:36.000\n by a stack automaton. And so when I looked at what that told me, then I had a nice algorithm for this\n\n1:31:36.640 --> 1:31:44.320\n string matching problem. And it told me exactly what I should remember as I'm going through the\n\n1:31:44.320 --> 1:31:50.800\n string. And I worked it out, and I wrote this little paper called Automata Theory Can Be Useful.\n\n1:31:52.240 --> 1:31:56.720\n And the reason was that it was first, I mean, I had been reading all kinds of papers about\n\n1:31:56.720 --> 1:32:04.880\n automata theory, but it never improved my programming for everyday problems. It was\n\n1:32:04.880 --> 1:32:11.920\n something that you published in journals, and it was interesting stuff. But here was a case\n\n1:32:11.920 --> 1:32:16.960\n where I couldn't figure out how to write the program. I had a theorem from automata theory.\n\n1:32:16.960 --> 1:32:25.200\n Then I knew how to write the program. So this was, for me, a change in life. I started to say,\n\n1:32:25.200 --> 1:32:32.560\n maybe I should learn more about automata theory. And I showed this note to Vaughn Pratt,\n\n1:32:32.560 --> 1:32:41.520\n and he said, that's similar to something I was working on. And Jim Morris was at Berkeley,\n\n1:32:41.520 --> 1:32:49.760\n too, at the time. Anyway, he's had an illustrious career, but I haven't kept track of Jim. But Vaughn\n\n1:32:49.760 --> 1:32:58.240\n is my colleague at Stanford and my student later. But this was before Vaughn was still a graduate\n\n1:32:58.240 --> 1:33:02.400\n student and hadn't come to Stanford yet. So we found out that we'd all been working on the\n\n1:33:02.400 --> 1:33:07.360\n same thing. So it was our algorithm. We each discovered it independently, but each of us\n\n1:33:07.360 --> 1:33:15.520\n had discovered a different part of the elephant, a different aspect of it. And so we could put our\n\n1:33:15.520 --> 1:33:22.640\n things together with my job to write the paper. How did the elephant spring to life?\n\n1:33:23.520 --> 1:33:29.440\n Spring to life was because I had drafted this paper, automata theory.\n\n1:33:30.400 --> 1:33:35.760\n Oh. It can be useful, which was seen by Vaughn and then by Jim. And then we combined,\n\n1:33:36.560 --> 1:33:40.800\n because maybe they had also been thinking of writing something up about it.\n\n1:33:40.800 --> 1:33:45.840\n About specifically the string match problem in a period.\n\n1:33:48.480 --> 1:33:54.080\n Let me ask a ridiculous question. Last time we talked, you told me what the most beautiful\n\n1:33:54.080 --> 1:34:02.800\n algorithm is, actually, for strongly connected graphs. What is the hardest problem, puzzle,\n\n1:34:03.440 --> 1:34:09.280\n idea in computer science for you personally that you had to work through? Just something that was\n\n1:34:09.280 --> 1:34:17.600\n just the hardest thing that I've ever been involved with. I don't know how to answer\n\n1:34:17.600 --> 1:34:29.120\n questions like that, but in this case, it's pretty clear because it's called the birth of\n\n1:34:29.120 --> 1:34:35.600\n the giant component. So now let me explain that because this actually gets into physics too.\n\n1:34:35.600 --> 1:34:44.560\n And it gets into something called Bose Einstein statistics. But anyway, it's got some interesting\n\n1:34:44.560 --> 1:34:52.480\n stories and it's connected with Berkeley again. So start with the idea of a random graph.\n\n1:34:52.480 --> 1:35:02.880\n Now, here we just say we have N points that are totally unconnected and there's no geometry\n\n1:35:02.880 --> 1:35:08.000\n involved. There's no saying some points are further apart than others. All points are exactly\n\n1:35:09.840 --> 1:35:17.120\n alike. And let's say we have 100 points and we number them from 0 to 99.\n\n1:35:19.280 --> 1:35:31.040\n Now let's take pi, the digits of pi, so two at a time. So we had 31, 41, 59, 26. We can\n\n1:35:31.040 --> 1:35:41.440\n look, go through pi. And so we take the first two, 31, 41, and let's put a connection between\n\n1:35:41.440 --> 1:35:52.560\n 0.31 and 0.41. That's an edge in the graph. Then we take 59, 26 and make another edge.\n\n1:35:52.560 --> 1:36:00.240\n And the graph gets bigger, gets more and more connected as we add these things one at a time.\n\n1:36:00.240 --> 1:36:10.720\n So we started out with N points and we add M edges. Each edge is completely, we forgot about\n\n1:36:10.720 --> 1:36:16.880\n edges we had before. We might get an edge twice. We might get an edge from a point to itself even.\n\n1:36:16.880 --> 1:36:26.080\n Maybe pi is going to have a run of four digits in there. But anyway, we're evolving a graph at\n\n1:36:26.080 --> 1:36:40.080\n random. And a magical thing happens when the number of edges is like 0.49 N, so maybe N is a\n\n1:36:40.080 --> 1:36:53.440\n million and I have 490,000 edges. Then almost all the time, it consists of isolated trees,\n\n1:36:55.440 --> 1:36:56.640\n not even any loops.\n\n1:36:58.640 --> 1:37:00.640\n It's a very small number of edges so far.\n\n1:37:01.680 --> 1:37:03.680\n A little less than half N.\n\n1:37:03.680 --> 1:37:04.720\n N, right.\n\n1:37:04.720 --> 1:37:11.200\n A little less than half N. But if I had 0.51 edges, so a little more than half N.\n\n1:37:12.000 --> 1:37:19.520\n So a million points, 510,000 edges. Now it probably has\n\n1:37:24.080 --> 1:37:30.960\n one component that's much bigger than the others. And we call that the giant component.\n\n1:37:30.960 --> 1:37:37.600\n So can you clarify? First of all, is there a name for this kind of random,\n\n1:37:37.600 --> 1:37:39.360\n super cool pi random graph?\n\n1:37:41.200 --> 1:37:50.320\n Well, I call it the pi graph. No, no, the pi graph is actually, my pi graph is based on\n\n1:37:51.840 --> 1:37:59.360\n binary representation of pi, not the decimal representation of pi. But anyway, let's suppose\n\n1:37:59.360 --> 1:38:04.640\n I was rolling dice instead. So it doesn't have to be pi?\n\n1:38:07.040 --> 1:38:12.080\n The point is, every step, choose totally at random one of those endpoints,\n\n1:38:13.280 --> 1:38:20.240\n choose totally at random another one of those endpoints, make that an edge. That's the process.\n\n1:38:21.440 --> 1:38:23.520\n So there's nothing magical about pi?\n\n1:38:23.520 --> 1:38:29.840\n No, no, I was sort of saying pi is sort of random that nobody knows the pattern in.\n\n1:38:29.840 --> 1:38:30.720\n Exactly, got it.\n\n1:38:31.760 --> 1:38:39.760\n But I could have just as well drawn straws or something. This was a concept invented by\n\n1:38:39.760 --> 1:38:44.960\n Erdos and Renyi, and they call it the evolution of random graphs. And if you start out with\n\n1:38:45.680 --> 1:38:52.960\n a large number N, and you repeat this process, all of a sudden a big bang happens at one half N.\n\n1:38:52.960 --> 1:39:01.680\n There'll be two points together, then maybe we'll have three. And then maybe branch out a little\n\n1:39:01.680 --> 1:39:08.160\n bit. But they'll all be separate until we get to one half N. And we pass one half N, and all of a\n\n1:39:08.160 --> 1:39:16.240\n sudden there's substance to it. There's a big clump of stuff that's all joined together.\n\n1:39:16.240 --> 1:39:19.040\n So it's almost like a phase transition of some kind.\n\n1:39:19.040 --> 1:39:24.720\n It's exactly. It's a phase transition, but it's a double phase transition. It turns out\n\n1:39:27.760 --> 1:39:34.080\n that there's actually two things going on at once at this phase transition, which is very\n\n1:39:34.080 --> 1:39:40.400\n remarkable about it. So a lot of the most important algorithms are based on random\n\n1:39:40.400 --> 1:39:46.560\n processes. And so I want to understand random processes now. So there are data structures that\n\n1:39:46.560 --> 1:39:55.280\n sort of grow this way. Okay, so Dick Karp, one of the leading experts on randomized algorithms,\n\n1:39:56.000 --> 1:40:01.680\n had his students looking at this at Berkeley. And we heard a rumor that the students had\n\n1:40:02.640 --> 1:40:08.080\n found something interesting happening. The students are generating this,\n\n1:40:08.080 --> 1:40:17.600\n or simulating this random evolution of graphs. And they're taking snapshots every so often to\n\n1:40:17.600 --> 1:40:22.560\n take a look at what the graph is. And the rumor was that every time they looked,\n\n1:40:23.600 --> 1:40:28.560\n there was only one component that had loops in it, almost always. They do a million experiments,\n\n1:40:30.000 --> 1:40:35.920\n and only three or four times did they ever happen to see a loop at this point.\n\n1:40:35.920 --> 1:40:43.200\n I mean, no, more than one component with a loop. So they watch it until the graph gets\n\n1:40:43.840 --> 1:40:50.800\n completely full. So it starts out totally empty and gets more and more edges all the time.\n\n1:40:52.400 --> 1:40:59.200\n And so, okay, certainly a loop comes along once. But now all the loops stay somehow joined to that\n\n1:40:59.200 --> 1:41:11.680\n one. There never were two guys with loops in these experiments. So anyway, almost always,\n\n1:41:12.400 --> 1:41:17.680\n certainly not always, but with very high probability this seemed to be true.\n\n1:41:19.200 --> 1:41:26.880\n So we heard about this rumor at Stanford, and we said, if that's true, then a lot more must also\n\n1:41:26.880 --> 1:41:31.680\n be true. So there's a whole theory out there waiting to be discovered that we haven't ever\n\n1:41:31.680 --> 1:41:36.560\n thought about. So let's take a look at it. And so we looked closer and we found out, no, actually,\n\n1:41:37.200 --> 1:41:46.240\n it's not true. But in fact, it's almost true. Namely, there's a very short interval of time\n\n1:41:46.240 --> 1:41:51.840\n when it's true. And if you don't happen to look at it during that short interval of time,\n\n1:41:51.840 --> 1:41:59.360\n then you miss it. So in other words, there'll be a period where there are two or three\n\n1:42:00.320 --> 1:42:05.440\n components that have loops, but they join together pretty soon.\n\n1:42:05.440 --> 1:42:15.680\n Okay. So if you don't have a real fast shutter speed, you're going to miss that instant.\n\n1:42:15.680 --> 1:42:18.320\n So separate loops don't exist for long.\n\n1:42:18.320 --> 1:42:25.440\n That's it. Yeah. I started looking at this to make it quantitative. And the basic problem was\n\n1:42:25.440 --> 1:42:31.920\n to slow down the Big Bang so that I could watch it happening. I think I can explain it actually\n\n1:42:32.880 --> 1:42:38.720\n in fairly elementary terms, even without writing a formula, like Hawking would do.\n\n1:42:38.720 --> 1:42:47.600\n And so let's watch the evolution. And at first, these edges are coming along and they're just\n\n1:42:47.600 --> 1:42:54.080\n making things without loops, which we call trees. So then all of a sudden, a loop first appears.\n\n1:42:54.640 --> 1:43:01.440\n So at that point, I have one component that has a loop. Now, I say that the complexity of a\n\n1:43:01.440 --> 1:43:10.720\n component is the number of edges minus the number of vertices. So if I have a loop, I have like a\n\n1:43:10.720 --> 1:43:19.840\n loop of length five, it has five edges and five vertices. Or I could put a tail on that and that\n\n1:43:19.840 --> 1:43:21.440\n would be another edge, another vertex.\n\n1:43:21.440 --> 1:43:24.880\n It's like a zero, one, two complexity kind of thing.\n\n1:43:24.880 --> 1:43:32.880\n So if the complexity is zero, we have one loop, I call it a cycle or I call it a cyclic\n\n1:43:32.880 --> 1:43:44.240\n component. So a cyclic component looks like a wheel to which you attach fibers or trees.\n\n1:43:45.840 --> 1:43:49.280\n They go branching, but there are no more loops. There's only one loop and everything else\n\n1:43:49.280 --> 1:43:57.440\n feeds into that loop. And that has complexity zero. But a tree itself has complexity minus one\n\n1:43:57.440 --> 1:44:06.800\n because it might have 10 vertices and nine edges to tie them together. So nine minus 10 is minus\n\n1:44:06.800 --> 1:44:14.000\n one. So complexity minus one is a tree. It's got to be connected. That's what I mean by a\n\n1:44:14.000 --> 1:44:19.840\n component. It's got to be connected. So if I have 10 things connected, I have to have nine edges.\n\n1:44:21.360 --> 1:44:28.880\n Can you clarify why when complexity can go above zero, I'm a little confused why.\n\n1:44:28.880 --> 1:44:34.560\n Right. So the complexity plus one is the number of loops. So if complexity is zero,\n\n1:44:34.560 --> 1:44:43.280\n I have one loop. If complexity is one, that means I have one more edge than I have vertices. So I\n\n1:44:43.280 --> 1:44:53.040\n might have like 11 edges and 10 vertices. So we call that a bicycle because it's got two loops\n\n1:44:53.040 --> 1:45:00.560\n in it. It's got to have two loops in it. Well, but why can't it be trees just going off of the loop?\n\n1:45:02.000 --> 1:45:08.800\n I would need more edges then. Oh, right. Right. Okay. I got it. So every time I get another loop,\n\n1:45:08.800 --> 1:45:13.920\n I get another excess of edges over vertices. I got you. Okay. So in other words,\n\n1:45:15.840 --> 1:45:22.400\n we start out and after I have one loop, I have one component that has a cycle in it.\n\n1:45:23.200 --> 1:45:31.520\n Now the next step, according to the rumor, would be that at the next step, I would have a bicycle\n\n1:45:31.520 --> 1:45:39.280\n in the evolution of almost all graphs. It would go from cycle to bicycle. But in fact,\n\n1:45:39.280 --> 1:45:46.720\n there's a certain probability it goes from cycle to two different cycles.\n\n1:45:48.800 --> 1:45:51.760\n And I worked out the probability was something like five out of 24.\n\n1:45:52.720 --> 1:45:53.520\n That's pretty high.\n\n1:45:53.520 --> 1:46:01.280\n Right. It was substantial. But still, soon they're going to merge together almost. Okay.\n\n1:46:02.480 --> 1:46:03.600\n That's so cool.\n\n1:46:03.600 --> 1:46:11.200\n But then it splits again after you have either two or one, one. The next step is you either have\n\n1:46:11.200 --> 1:46:17.920\n three or you have two, one or you have one, one, one. Okay. And so I worked out the probability\n\n1:46:17.920 --> 1:46:27.280\n for those transitions. And I worked it out up to the first five transitions. And I had these\n\n1:46:28.480 --> 1:46:35.920\n strange numbers, five 24s. And I stayed up all night and about 3 a.m. I had the numbers computed\n\n1:46:35.920 --> 1:46:49.680\n and I looked at them. The denominator was something like 23023. The probability was\n\n1:46:49.680 --> 1:46:53.280\n something over 23023. I don't know how you worked that out.\n\n1:46:53.280 --> 1:46:58.640\n But I had a formula that I could calculate the probability. And I could find the limiting\n\n1:46:58.640 --> 1:47:04.240\n probability as n goes to infinity. And it turned out to be this number. But the denominator was\n\n1:47:04.240 --> 1:47:10.400\n 230. And I looked at the denominator and I said, wait a minute. This number factors because\n\n1:47:11.200 --> 1:47:17.040\n 1001 is equal to 7 times 11 times 13. I had learned that in my first computer program.\n\n1:47:17.040 --> 1:47:31.040\n So 23023 is 7 times 11 times 13 times 23. That's not a random number. There has to be a reason\n\n1:47:31.040 --> 1:47:41.440\n why those small primes appear in the denominator. So all of a sudden that suggested another way of\n\n1:47:41.440 --> 1:47:50.960\n looking at the problem where small prime factors would occur. So that said, oh, yeah, let me take\n\n1:47:50.960 --> 1:47:59.840\n the logarithm of this formula. And sure enough, it's going to simplify. And it happened. So I\n\n1:47:59.840 --> 1:48:05.280\n and I wouldn't have noticed it except for this factorization. OK, so I go to bed and I say,\n\n1:48:05.280 --> 1:48:09.760\n oh, OK, this is this looks like I'm slowing down the Big Bang. I can figure out what's going on\n\n1:48:09.760 --> 1:48:17.040\n here. And the next day it turned out Bill Gates comes to Stanford to visit. They're trying to\n\n1:48:17.040 --> 1:48:25.200\n sell him on donating money for a new computer science building. And they gave me an appointment\n\n1:48:25.200 --> 1:48:33.360\n to talk to Bill and I wrote down on the blackboard this evolutionary diagram going from one to two,\n\n1:48:33.360 --> 1:48:39.040\n five twenty fourths in all this business. And I wrote it down. And anyway, at the end of the day,\n\n1:48:40.320 --> 1:48:46.400\n he was discussing people with the development office and he said, boy, I was really impressed\n\n1:48:46.400 --> 1:48:56.480\n with what Professor Knuth said about this giant component. And and so, you know, I love this story\n\n1:48:56.480 --> 1:49:03.200\n because it shows that theoretical computer science is really worthwhile. Does Bill have you ever\n\n1:49:03.200 --> 1:49:09.440\n talked to Bill Gates about it since then? Yeah, that's a cool that's a cool little moment in\n\n1:49:09.440 --> 1:49:17.360\n history. But anyway, he happened to visit on exactly the day after I had I had found this\n\n1:49:17.360 --> 1:49:25.920\n pattern and that allowed me to crack the problem so that I could develop the theory some more and\n\n1:49:25.920 --> 1:49:33.200\n understand what's happening in the big. But because I could I could now write down explicit formulas\n\n1:49:33.200 --> 1:49:39.840\n for stuff. And so it would work not only the first few steps, but also they'll study the\n\n1:49:39.840 --> 1:49:45.600\n whole process. And and I worked further and further and I with two authors, co authors,\n\n1:49:45.600 --> 1:49:53.600\n and we finally figured out that the probability that the rumor was true. In other words,\n\n1:49:53.600 --> 1:50:02.800\n look at the evolution of a random graph going from zero to complete and say, what's the probability\n\n1:50:02.800 --> 1:50:09.200\n that at every point in time, there was only one component with a cycle? We started with this\n\n1:50:09.200 --> 1:50:16.960\n rumor saying there's only one site, there's only one component with a cycle. And so the rumor was\n\n1:50:16.960 --> 1:50:26.160\n it's 100%. Rumor was that was 100%. It turned out the actual numbers is like 87%. I should remember\n\n1:50:26.160 --> 1:50:33.440\n the number but I don't but I don't have it with me. But but anyway, but but the but the number it\n\n1:50:33.440 --> 1:50:42.160\n turned out to be like 12 over pi squared or eight over pi. Anyway, it was a nice it related to pi.\n\n1:50:42.160 --> 1:50:48.880\n Yeah. And we could never have done that with it. But so that's the hardest problem I ever\n\n1:50:48.880 --> 1:50:54.640\n solved in my life was to prove that this probability is it was proven. The probability\n\n1:50:54.640 --> 1:51:01.280\n was proven. Yeah, I was able to prove this that this and this should shed light on a whole bunch\n\n1:51:01.280 --> 1:51:07.600\n of other things about random graphs. That was sort of the major thing we were after.\n\n1:51:07.600 --> 1:51:11.440\n That's super cool. What was the connection to physics that you mentioned?\n\n1:51:11.440 --> 1:51:18.960\n Well, Bose Einstein statistics is a study of how molecules bond together\n\n1:51:18.960 --> 1:51:32.080\n without geometry. You created the tech typesetting system and released it as open source.\n\n1:51:33.280 --> 1:51:40.480\n Just on that little aspect, why did you release it as open source? What is your vision for open source?\n\n1:51:42.160 --> 1:51:47.440\n Okay, well that the word open source didn't exist at that time. But we but I didn't want\n\n1:51:47.440 --> 1:51:56.720\n proprietary rights over it. Because I saw how proprietary rights were holding things back.\n\n1:51:56.720 --> 1:52:02.480\n In the late 50s, people at IBM developed the language called Fortran. They could have\n\n1:52:03.760 --> 1:52:09.440\n kept it proprietary. They could have said only IBM can use this language. Everybody else has to.\n\n1:52:09.440 --> 1:52:18.160\n But they didn't. They said anybody who can translate Fortran into the language of their\n\n1:52:18.160 --> 1:52:28.000\n machines is allowed to make Fortran compilers. On the other hand, in the typography industry,\n\n1:52:28.000 --> 1:52:34.400\n I had seen a lot of languages that were developed for composing pages.\n\n1:52:34.400 --> 1:52:41.760\n And each manufacturer had his own language for composing pages. And that was holding everything\n\n1:52:41.760 --> 1:52:48.800\n back because people were tied to a particular manufacturer. And then a new equipment is invented\n\n1:52:48.800 --> 1:52:54.880\n a year later. But printing machines, they have to expect to amortize the cost over 20, 30 years.\n\n1:52:55.680 --> 1:52:57.360\n So you didn't want that for tech?\n\n1:52:57.360 --> 1:53:11.920\n That for tech. I didn't need the income. I already had a good job. And my books were,\n\n1:53:14.640 --> 1:53:23.040\n people were buying enough books that it would bring me plenty of supplemental income for\n\n1:53:23.040 --> 1:53:28.640\n everything my kids needed for education and whatever. So there was no reason for me to try\n\n1:53:28.640 --> 1:53:36.480\n to maximize income any further. Income is sort of a threshold function. If you don't have enough,\n\n1:53:36.480 --> 1:53:41.680\n you're starving. But if you get over the threshold, then you start thinking about\n\n1:53:41.680 --> 1:53:51.200\n philanthropy or else you're trying to take it with you. But anyway, my income was over the\n\n1:53:51.200 --> 1:53:58.880\n threshold. So I didn't need to keep it. And so I specifically could see the advantage of\n\n1:54:00.560 --> 1:54:02.640\n making it open for everybody.\n\n1:54:02.640 --> 1:54:05.120\n Do you think most software should be open?\n\n1:54:06.080 --> 1:54:13.040\n So I think that people should charge for non trivial software, but not for trivial software.\n\n1:54:13.040 --> 1:54:21.280\n Yeah, you give an example of, I think, Adobe Photoshop versus GIMP on Linux as Photoshop has\n\n1:54:21.280 --> 1:54:21.680\n value.\n\n1:54:22.880 --> 1:54:33.760\n So it's definitely worth paying for all this stuff. I mean, well, they keep adding stuff that\n\n1:54:33.760 --> 1:54:47.040\n my wife and I don't care about, but they have built in a fantastic undo feature, for example,\n\n1:54:47.040 --> 1:54:54.800\n in Photoshop where you can go through a sequence of a thousand complicated steps on graphics and\n\n1:54:54.800 --> 1:55:03.360\n then it can take you back anywhere in that sequence with really beautiful algorithms.\n\n1:55:03.360 --> 1:55:08.000\n Oh, that's interesting. I didn't think about what algorithm. It must be some kind of efficient\n\n1:55:08.000 --> 1:55:08.800\n representation.\n\n1:55:08.800 --> 1:55:16.800\n Yeah, no. I mean, there's a lot of really subtle Nobel Prize class creation of intellectual\n\n1:55:16.800 --> 1:55:30.640\n property in there. And with patents, you get a limited time to, I mean, eventually the\n\n1:55:30.640 --> 1:55:35.120\n idea of patents is that you publish so that it's not a trade secret.\n\n1:55:37.200 --> 1:55:45.200\n That said, you've said that I currently use Ubuntu Linux on a standalone laptop. It has\n\n1:55:45.200 --> 1:55:50.320\n no internet connection. I occasionally carry flash memory drives between the machine and\n\n1:55:50.320 --> 1:55:57.280\n the Macs that I use for network surfing and graphics, but I trust my family jewels only\n\n1:55:57.280 --> 1:56:00.080\n to Linux. Why do you love Linux?\n\n1:56:00.880 --> 1:56:07.120\n The version of Linux that I use is stable. Actually, I'm going to have to upgrade one\n\n1:56:07.120 --> 1:56:07.840\n of these days, but...\n\n1:56:08.400 --> 1:56:10.320\n To a newer version of Ubuntu?\n\n1:56:10.320 --> 1:56:17.360\n Yeah, I'll stick with Ubuntu, but right now I'm running something that doesn't support\n\n1:56:18.000 --> 1:56:26.880\n a lot of the new software. The last stable, I don't remember the number, like 14. Anyway,\n\n1:56:26.880 --> 1:56:35.280\n it's quite... And I'm going to get a new computer. I'm getting new solid state memory instead\n\n1:56:35.280 --> 1:56:36.800\n of a hard disk.\n\n1:56:36.800 --> 1:56:47.280\n Yeah, the basics. Well, let me ask you, sticking on the topic of tech, when thinking about\n\n1:56:47.280 --> 1:56:56.080\n beautiful typography, what is your favorite letter, number, or symbol? I know, I know.\n\n1:56:56.080 --> 1:56:57.760\n Ridiculous question, but is there some...\n\n1:56:57.760 --> 1:56:59.440\n Let me show you here.\n\n1:56:59.440 --> 1:57:06.560\n Look at the last page.\n\n1:57:11.120 --> 1:57:12.320\n The very end of the index.\n\n1:57:15.200 --> 1:57:15.840\n What is that?\n\n1:57:17.040 --> 1:57:21.680\n There's a book by Dr. Seuss called On Beyond Zebra, and he gave a name to that.\n\n1:57:22.240 --> 1:57:24.480\n Did you say Dr. Seuss gave a name to that?\n\n1:57:24.480 --> 1:57:33.680\n Dr. Seuss, this is S, E, U, S, S, E. He wrote children's books in the 50s, 40s and 50s.\n\n1:57:34.960 --> 1:57:36.880\n Wait, you're talking about Cat in the Hat, Dr. Seuss?\n\n1:57:36.880 --> 1:57:39.760\n Cat in the Hat, yeah. That's it, yeah.\n\n1:57:39.760 --> 1:57:41.120\n I like how you had the spell there.\n\n1:57:41.120 --> 1:57:46.080\n On Beyond Zebra, did it get to Soviet Union?\n\n1:57:46.080 --> 1:57:56.640\n No, Dr. Seuss did not come to the Soviet Union, but since you... Oh, actually, I think it did\n\n1:57:56.640 --> 1:58:07.520\n actually a little bit when we were... That was a book, maybe Cat in the Hat or Green Eggs and Ham,\n\n1:58:07.520 --> 1:58:10.320\n I think was used to learn English.\n\n1:58:10.320 --> 1:58:11.280\n Oh, okay.\n\n1:58:11.280 --> 1:58:12.960\n So I think it made it in that way.\n\n1:58:12.960 --> 1:58:20.720\n Well, my... Okay, I didn't like those as much as Bartholomew Cubbins, but I used to know\n\n1:58:21.760 --> 1:58:24.080\n Bartholomew Cubbins by heart when I was young.\n\n1:58:24.720 --> 1:58:28.800\n So what the heck is this symbol we're looking at? There's so much going on.\n\n1:58:28.800 --> 1:58:32.000\n He has a name for it at the end of his book On Beyond Zebra.\n\n1:58:32.800 --> 1:58:33.440\n Who made it?\n\n1:58:34.080 --> 1:58:34.720\n He did.\n\n1:58:34.720 --> 1:58:39.440\n He did. So there's... It looks like a bunch of vines.\n\n1:58:39.440 --> 1:58:41.760\n Well, is that symbol exist in fact?\n\n1:58:41.760 --> 1:58:49.040\n By the way, he made a movie in the early 50s. I don't remember the name of the movie now.\n\n1:58:49.040 --> 1:58:54.560\n You can probably find it easily enough, but it features dozens and dozens of\n\n1:58:54.560 --> 1:59:02.480\n pianos all playing together at the same time. But all the scenery is sort of based on the kind\n\n1:59:02.480 --> 1:59:14.320\n of artwork that was in his books and the fantasy, you know, based of Seussland or something.\n\n1:59:14.320 --> 1:59:20.400\n And I saw the movie only once or twice, but it's quite... I'd like to see it again.\n\n1:59:22.400 --> 1:59:26.960\n That's really fascinating that you gave him... They gave him a shout out here.\n\n1:59:26.960 --> 1:59:34.960\n Okay. Is there some elegant basic symbol that you're attracted to? Something that\n\n1:59:34.960 --> 1:59:38.480\n gives you pleasure? Something you use a lot? Pi?\n\n1:59:39.600 --> 1:59:47.920\n Pi, of course. I try to use pi as often as I can when I need a random example\n\n1:59:47.920 --> 1:59:59.440\n because it doesn't have any known characters. So for instance, I don't have it here to show you,\n\n1:59:59.440 --> 2:00:06.240\n but do you know the game called Masyu? M A S Y U?\n\n2:00:06.240 --> 2:00:08.080\n No.\n\n2:00:08.080 --> 2:00:15.200\n It's a great recreation. I mean, Sudoku is easier to understand, but Masyu\n\n2:00:15.200 --> 2:00:24.240\n is more addictive. You have black and white stones, like on a go board, and you have to\n\n2:00:24.240 --> 2:00:30.880\n draw a path that goes straight through a white stone and makes a right angle turn at the black\n\n2:00:30.880 --> 2:00:39.120\n stone. And it turns out to be a really nice puzzle because it doesn't involve numbers.\n\n2:00:39.120 --> 2:00:48.640\n It's visual, but it's really pleasant to play with. So I wanted to use it as an example in\n\n2:00:48.640 --> 2:00:57.840\n art of computer programming, and I have exercises on how to design cool Masyu puzzles. You can find\n\n2:00:57.840 --> 2:01:10.000\n on Wikipedia certainly as an example, M A S Y U. And so I decided I would take pi, the actual image\n\n2:01:10.000 --> 2:01:18.720\n of it, and it had pixels, and I would put a stone wherever it belongs in the Greek letter pi.\n\n2:01:20.080 --> 2:01:26.400\n But the problem was, find a way to make some of the stones white, some of the stones black,\n\n2:01:26.400 --> 2:01:33.680\n so that there's a unique solution to the Masyu puzzle. That was a good test case for my algorithm\n\n2:01:33.680 --> 2:01:40.400\n on how to design Masyu puzzles because I insisted in advance that the stones had to be placed in\n\n2:01:40.400 --> 2:01:49.600\n exactly the positions that make the letter pi, make a Greek letter pi. And it turned out there\n\n2:01:49.600 --> 2:02:01.680\n was a unique way to do that. And so pi is a source of examples where I can prove that I'm starting\n\n2:02:01.680 --> 2:02:08.560\n with something that isn't canned. And most recently, I was writing about something called\n\n2:02:08.560 --> 2:02:19.760\n graceful graphs. Graceful graphs is the following. You have a graph that has M edges to it,\n\n2:02:20.960 --> 2:02:27.680\n and you attach numbers to every vertex in the following way. So every time you have an edge\n\n2:02:27.680 --> 2:02:34.480\n between vertices, you take the difference between those numbers, and that difference\n\n2:02:34.480 --> 2:02:41.520\n has got to be... I'll tell you what edge it is. So one edge, two numbers will be one apart. There'll\n\n2:02:41.520 --> 2:02:48.240\n be another edge where the numbers are two apart. And so it's a great computer problem. Can you\n\n2:02:48.240 --> 2:02:55.600\n find a graceful way to label a graph? So I started with a graph that I use for\n\n2:02:55.600 --> 2:03:04.720\n an organic graph, not a mathematically symmetric graph or anything. And I take 49 states of the\n\n2:03:04.720 --> 2:03:12.000\n United States, the edges go from one state to the next state. So for example, California\n\n2:03:12.000 --> 2:03:24.320\n be next to Oregon, Nevada, Arizona. And I include District of Columbia, so I have 49. I can't get\n\n2:03:24.320 --> 2:03:30.000\n Alaska and Hawaii in there because they don't touch. You have to be able to drive from one to\n\n2:03:30.000 --> 2:03:36.560\n the other. So is there a graceful labeling of the United States? Each state gets a number,\n\n2:03:37.600 --> 2:03:45.120\n and then if California is number 30 and Oregon is number 11, that edge is going to be number 19,\n\n2:03:45.120 --> 2:03:52.960\n the difference between those, okay? So is there a way to do this for all the states? And so I was\n\n2:03:52.960 --> 2:04:02.160\n thinking of having a contest for people to get it as graceful as they could. But my friend,\n\n2:04:02.160 --> 2:04:08.880\n Tom Rokicki, actually solved the problem by proving that, I mean, I was able to get it down\n\n2:04:10.560 --> 2:04:13.920\n within seven or something like that. He was able to get a perfect solution.\n\n2:04:14.640 --> 2:04:17.200\n The actual solution or to prove that a solution exists?\n\n2:04:17.200 --> 2:04:25.440\n Well, more precisely, I had figured out a way to put labels on so that all the edges were labeled\n\n2:04:25.440 --> 2:04:32.480\n somewhere between 1 and 117, but there were some gaps in there because I should really have gone\n\n2:04:32.480 --> 2:04:41.280\n from 1 to 105 or whatever the number is. So I gave myself a lot of slack. He did it without\n\n2:04:41.280 --> 2:04:49.600\n any slack whatsoever, a perfect graceful labeling. And so I called out the contest because the\n\n2:04:49.600 --> 2:04:54.320\n problem's already solved and too easy in a sense because Tom was able to do it in an afternoon.\n\n2:04:55.680 --> 2:04:58.160\n Sorry, he gave the algorithm or for this particular...\n\n2:04:59.200 --> 2:05:00.800\n For the United States.\n\n2:05:00.800 --> 2:05:01.600\n For the United States.\n\n2:05:01.600 --> 2:05:05.040\n This problem is incredibly hard. I mean...\n\n2:05:05.040 --> 2:05:12.160\n For the general algorithm. But it was very lucky that it worked for the United States, I think.\n\n2:05:13.360 --> 2:05:19.520\n The theory is still very incomplete. But anyway, then Tom came back a couple of days later and he\n\n2:05:19.520 --> 2:05:26.800\n had been able to not only find a graceful labeling, but the label of Washington was 31,\n\n2:05:26.800 --> 2:05:38.560\n and the label of Idaho was 41, following the digits of pi. Going across the top edge of the\n\n2:05:38.560 --> 2:05:41.280\n United States, he has the digits of pi perfectly.\n\n2:05:41.280 --> 2:05:42.320\n Did he do it on purpose?\n\n2:05:43.360 --> 2:05:48.000\n He was able to still get a graceful labeling with that extra thing.\n\n2:05:48.000 --> 2:05:49.280\n What? Wow.\n\n2:05:50.720 --> 2:05:51.520\n Wow.\n\n2:05:51.520 --> 2:05:59.920\n And it's a miracle, okay? But I like to use pi in my book, you see.\n\n2:06:02.800 --> 2:06:11.520\n All roads lead to pi. Somehow often hidden in the middle of the most difficult problems.\n\n2:06:12.560 --> 2:06:15.440\n Can I ask you about productivity?\n\n2:06:16.720 --> 2:06:17.680\n Productivity.\n\n2:06:17.680 --> 2:06:23.520\n Yeah, you said that, quote, my scheduling principle is to do the thing I hate most\n\n2:06:25.200 --> 2:06:32.800\n on my to do list. By week's end, I'm very happy. Can you explain this process to a productive life?\n\n2:06:33.440 --> 2:06:39.200\n Oh, I see. Well, but all the time I'm working on what I don't want to do,\n\n2:06:39.200 --> 2:06:42.960\n but still, I'm glad to have all those unpleasant tasks finished.\n\n2:06:42.960 --> 2:06:46.000\n Yes. Is that something you would advise to others?\n\n2:06:46.000 --> 2:06:54.880\n Well, yeah, I don't know how to say it. During the pandemic, I feel my productivity actually\n\n2:06:54.880 --> 2:07:07.600\n went down by half because I have to communicate by writing, which is slow. I don't like to send\n\n2:07:07.600 --> 2:07:14.320\n out a bad sentence. So I go through and reread what I've written and edit and fix it. So everything\n\n2:07:14.320 --> 2:07:25.600\n takes a lot longer when I'm communicating by text messages instead of just together with somebody\n\n2:07:25.600 --> 2:07:30.960\n in a room. And it's also slower because the libraries are closed and stuff.\n\n2:07:31.840 --> 2:07:35.680\n But there's another thing about scheduling that I learned from my mother that I should\n\n2:07:35.680 --> 2:07:42.320\n probably tell you, and that is it's different from what people in the robotics field do,\n\n2:07:42.320 --> 2:07:48.000\n which is called planning. So she had this principle that was,\n\n2:07:49.360 --> 2:07:51.440\n see something that needs to be done and do it.\n\n2:07:54.960 --> 2:08:03.920\n Instead of saying, I'm going to do this first and do this first, just pick this up.\n\n2:08:03.920 --> 2:08:11.440\n But at any one moment, there's a set of tasks that you can do. And you're saying a good heuristic\n\n2:08:12.400 --> 2:08:14.960\n is to do the one you want to do least.\n\n2:08:15.680 --> 2:08:18.560\n Right. The one I haven't got any good reason,\n\n2:08:20.960 --> 2:08:28.400\n that I'll never be able to do it any better than I am now. There are some things that I know,\n\n2:08:29.440 --> 2:08:32.800\n if I do something else first, then I'll be able to do that one better.\n\n2:08:32.800 --> 2:08:33.200\n Yeah.\n\n2:08:33.200 --> 2:08:39.440\n But there are some that are going to be harder because I've forgotten some of the\n\n2:08:40.160 --> 2:08:46.080\n groundwork that went into it or something like that. So I just finished a pretty tough part of\n\n2:08:46.080 --> 2:08:56.560\n the book. And so now I'm doing the parts that are more fun. But the other thing is, as I'm\n\n2:08:56.560 --> 2:09:02.320\n writing the book, of course, I want the reader to think that I'm happy all the time I'm writing\n\n2:09:02.320 --> 2:09:14.000\n the book. It's upbeat. I can have humor. I can say this is cool. And this, I have to disguise\n\n2:09:14.000 --> 2:09:18.240\n the fact that it was painful in any way to come up with these.\n\n2:09:18.240 --> 2:09:25.520\n The road to that excitement is painful. Yeah. It's laden with pain. Okay. You've given some\n\n2:09:25.520 --> 2:09:30.320\n advice to people before, but can you...\n\n2:09:30.320 --> 2:09:38.640\n You give me too much credit. But anyway, this is my turn to say things that I believe. But\n\n2:09:39.840 --> 2:09:48.800\n I want to preface it by saying I also believe that other people do these things much better\n\n2:09:48.800 --> 2:09:52.160\n than I do. So I can only tell you my side of it.\n\n2:09:52.160 --> 2:10:01.120\n Right. So can I ask you to give advice to young people today, to high school students,\n\n2:10:01.120 --> 2:10:08.560\n to college students, whether they're geeks or the other kind, about how to live a life\n\n2:10:08.560 --> 2:10:13.840\n that they can be proud of, how to have a successful career, how to have a successful life?\n\n2:10:13.840 --> 2:10:24.720\n It's always the same as I've said before, I guess, not to do something because it's\n\n2:10:24.720 --> 2:10:32.800\n trendy, but something that you personally feel that you were called to do rather than\n\n2:10:32.800 --> 2:10:37.520\n somebody else expects you to do. How do you know you're called to do something?\n\n2:10:37.520 --> 2:10:45.200\n If you try it and it works or it doesn't work. I mean, you learn about yourself. Life is\n\n2:10:45.200 --> 2:10:49.280\n a binary search. You try something and you find out, oh yeah, I have a background that\n\n2:10:49.280 --> 2:10:57.920\n helped me with this. Or maybe I could do this if I worked a little bit harder. But you try\n\n2:10:57.920 --> 2:11:04.960\n something else and you say, well, I have really no intuition for this and it looks like it\n\n2:11:04.960 --> 2:11:12.560\n doesn't have my name on it. Was there advice along the way that you got about what you\n\n2:11:12.560 --> 2:11:18.000\n should and shouldn't work on? Or do you just try to listen to yourself? Yeah, I probably\n\n2:11:18.000 --> 2:11:27.120\n overreact another way. When I see everybody else going some way, I probably say, hmm,\n\n2:11:27.120 --> 2:11:37.600\n not too much competition. But mostly I played with things that were interesting to me and\n\n2:11:37.600 --> 2:11:43.520\n then later on I found, oh, actually the most important thing I learned was how to be interested\n\n2:11:43.520 --> 2:11:51.920\n in almost anything. I mean, not to be bored. It makes me very sad when I see kids talking\n\n2:11:51.920 --> 2:12:06.320\n to each other and they say, that was boring. And to me, a person should feel upset if he\n\n2:12:06.320 --> 2:12:12.400\n had to admit that he wasn't able to find something interesting. It's a skill they\n\n2:12:13.600 --> 2:12:20.400\n think, I haven't learned how to enjoy life. I have to have somebody entertain me instead of...\n\n2:12:20.400 --> 2:12:26.640\n Right. That's really interesting. It is a skill. David Foster Wallace, I really like\n\n2:12:27.520 --> 2:12:34.480\n the thing he says about this, which is the key to life is to be unborable. And I do really like\n\n2:12:34.480 --> 2:12:40.640\n you saying that it's a skill because I think that's a really good advice, which is if you\n\n2:12:40.640 --> 2:12:49.360\n find something boring, that's not... I don't believe it's because it's boring. It's because\n\n2:12:49.360 --> 2:12:51.840\n you haven't developed a skill. I haven't learned how to...\n\n2:12:51.840 --> 2:12:56.960\n How to find the beauty in that, how to find the fun in it. That's a really good point.\n\n2:12:58.000 --> 2:13:05.040\n Sometimes it's more difficult than others to do this. I mean, during the COVID,\n\n2:13:06.000 --> 2:13:14.640\n lots of days when I never saw another human being, but I still find other ways to...\n\n2:13:14.640 --> 2:13:18.000\n It still was a pretty fun time.\n\n2:13:18.000 --> 2:13:27.360\n Yeah. I came a few minutes early today and I walked around Foster City. I didn't know\n\n2:13:28.160 --> 2:13:33.360\n what was going on in Foster City. I saw some beautiful flowers at the nursery at Home Depot\n\n2:13:33.360 --> 2:13:34.400\n a few blocks away.\n\n2:13:34.400 --> 2:13:42.800\n Yeah. Life is amazing. It's full of amazing things like this. Yeah. Sometimes I'll sit\n\n2:13:42.800 --> 2:13:48.880\n there and just stare at a tree. Nature is beautiful. Let me ask you the big ridiculous\n\n2:13:48.880 --> 2:13:52.400\n question. I don't think I asked you last time. So I have to ask this time in case you have\n\n2:13:52.400 --> 2:14:00.480\n a good answer. What is the meaning of life? Our existence here on earth, the whole thing.\n\n2:14:06.080 --> 2:14:11.600\n No, no, you can't. I will not allow you to try to escape answering this question.\n\n2:14:11.600 --> 2:14:19.840\n You have to answer definitively because surely, surely, Don Knuth, there must be an answer.\n\n2:14:19.840 --> 2:14:21.440\n What is the answer? Is it 42?\n\n2:14:22.480 --> 2:14:26.000\n Yes. Well, I don't think it's a numerical. That's the SDS.\n\n2:14:26.000 --> 2:14:37.040\n That was in Zen and... All right. So anyway, it's only for me, but I personally\n\n2:14:37.040 --> 2:14:48.800\n think of my belief that God exists, although I have no idea what that means. But I believe\n\n2:14:48.800 --> 2:15:06.080\n that there is something beyond human capabilities. It might be some AI, but whatever it is. But\n\n2:15:06.080 --> 2:15:16.560\n whatever. But I do believe that there is something that goes beyond the realm of human understanding,\n\n2:15:17.680 --> 2:15:29.600\n but that I can try to learn more about how to resonate with whatever that being would\n\n2:15:29.600 --> 2:15:34.640\n like me to do. So you think you can have occasional glimpses\n\n2:15:34.640 --> 2:15:42.000\n of that being? I strive for that. Not that I ever think\n\n2:15:42.000 --> 2:15:49.040\n I'm going to get close to it, but it's not for me. It's saying, what should I do that\n\n2:15:49.040 --> 2:16:03.200\n that being wants me to do? I'm trying to ask, does that being want me to be talking to Lex\n\n2:16:03.200 --> 2:16:08.000\n Friedman right now? And I said, yes. Okay. Thank you.\n\n2:16:09.600 --> 2:16:19.680\n Well, thank you. What I'm trying to say is, of all the strategies I could choose or something,\n\n2:16:22.640 --> 2:16:33.040\n I try to do it not strategically, but I try to imagine that I'm following somebody's wishes.\n\n2:16:33.040 --> 2:16:37.200\n Even though you're not smart enough to know what they are.\n\n2:16:37.200 --> 2:16:42.640\n Yeah. It's that funny little dance. Well, I mean, this AI or whatever,\n\n2:16:43.760 --> 2:16:47.760\n probably is smart enough to help to give me clues.\n\n2:16:51.120 --> 2:16:56.080\n And to make the whole journey from clue to clue a fun one.\n\n2:16:56.080 --> 2:17:00.800\n Yeah. As so many people have said, it's the journey, not the destination.\n\n2:17:00.800 --> 2:17:10.800\n And people live through crises, help each other. Things come up, history repeats itself.\n\n2:17:12.640 --> 2:17:20.480\n You try to say, in the world today, is there any government that's working? I read history. I know\n\n2:17:20.480 --> 2:17:28.320\n that things were... They were a lot worse in many ways.\n\n2:17:28.320 --> 2:17:36.080\n There's a lot of bad things all the time. And I read about... I look at things and people had\n\n2:17:36.080 --> 2:17:42.000\n good ideas and they were working on great projects. And then I know that it didn't succeed, though,\n\n2:17:42.000 --> 2:17:48.240\n in the end. But the new insight I've gotten actually in that way was... I was reading...\n\n2:17:50.160 --> 2:17:56.320\n What book was I reading recently? It was by Ken Follett and it was called The Man from\n\n2:17:56.320 --> 2:18:04.240\n St. Petersburg. But it was talking about the prequel to World War I. And Winston Churchill,\n\n2:18:05.040 --> 2:18:10.960\n according to this book, sees that Germany has been spending all its gold reserves\n\n2:18:11.680 --> 2:18:18.240\n building up a huge military. And there's no question that if Germany would attack England,\n\n2:18:18.240 --> 2:18:27.040\n that England would be wiped out. So he wants Russia to help to attack Germany from the other side,\n\n2:18:27.040 --> 2:18:32.000\n because Germany doesn't have enough of an army to be fighting two wars at one.\n\n2:18:33.040 --> 2:18:45.520\n Okay. Now, then there's an anarchist in Russia who sees that wars are something that leaders\n\n2:18:45.520 --> 2:18:56.160\n start, but actually people get killed. And so he wants to stop any alliance between England and\n\n2:18:56.160 --> 2:19:03.600\n Russia, because that would mean that thousands and thousands of people of Russia would be killed\n\n2:19:03.600 --> 2:19:13.360\n that wouldn't be otherwise killed. All right. And so his life's goal is to assassinate a Russian\n\n2:19:13.360 --> 2:19:20.000\n prince who's visiting England, because that will mean the Tsar will not form the alliance. All\n\n2:19:20.000 --> 2:19:29.440\n right. So we have this question about what should the government do? Should it actually do something\n\n2:19:29.440 --> 2:19:37.920\n that will lead to... Is the war inevitable or is there a way to have peace? And it struck me that\n\n2:19:37.920 --> 2:19:46.400\n if I were in a position of responsibility for people's lives, in most cases, I wouldn't have\n\n2:19:46.400 --> 2:19:54.800\n any confidence that any of my decisions were good. That these questions are too hard, probably for\n\n2:19:54.800 --> 2:20:04.400\n any human being, but certainly for me. Well, I think coupling the not being sure that the\n\n2:20:04.400 --> 2:20:11.120\n decisions are right. So that's actually a really good thing, coupled with the fact that you do have\n\n2:20:11.120 --> 2:20:20.640\n to make a decision and carry the burden of that. And ultimately I have faith in human beings and\n\n2:20:20.640 --> 2:20:27.920\n the great leaders to arise and help build a better world. I mean, that's the hope of democracy.\n\n2:20:27.920 --> 2:20:35.600\n Yeah, Ben, let's hope that we can enhance their abilities with algorithms.\n\n2:20:40.080 --> 2:20:46.160\n Well put, Don. It's such a huge honor. You've been an inspiration to me and to millions for\n\n2:20:46.160 --> 2:20:52.000\n such a long time. Thank you for spending your really valuable time with me. Once again,\n\n2:20:52.560 --> 2:20:54.800\n it's a huge honor. I really enjoyed this conversation.\n\n2:20:54.800 --> 2:21:00.080\n Thanks for listening to this conversation with Donald Knuth. To support this podcast,\n\n2:21:00.080 --> 2:21:05.200\n please check out our sponsors in the description. And now let me leave you with some words from\n\n2:21:05.200 --> 2:21:12.880\n Don Knuth himself. Science is what we understand well enough to explain to a computer. Art is\n\n2:21:12.880 --> 2:21:26.640\n everything else we do. Thank you for listening and hope to see you next time.\n\n"
}