{
  "title": "Georges St-Pierre: The Science of Fighting | Lex Fridman Podcast #179",
  "id": "fIPxfzfOTxk",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.240\n The following is a conversation with George St. Pierre, considered by many to be the greatest\n\n00:05.240 --> 00:11.260\n fighter in the history of UFC and MMA, but even more than that, one of the greatest martial\n\n00:11.260 --> 00:13.520\n artists ever.\n\n00:13.520 --> 00:21.840\n Quick mention of our sponsors, Allform, ExpressVPN, Blinkist, Theragun, and The Information.\n\n00:21.840 --> 00:25.080\n Check them out in the description to support this podcast.\n\n00:25.080 --> 00:30.040\n As a side note, let me say that getting the chance to hang out with George, talk to him\n\n00:30.040 --> 00:36.140\n on the podcast, record a quick self defense video that I'll release soon, all while\n\n00:36.140 --> 00:41.540\n both of us wearing suits was one of the most memorable days of my life.\n\n00:41.540 --> 00:45.640\n In setting all this up, I talked to Joe Rogan and originally we couldn't schedule a chat\n\n00:45.640 --> 00:51.920\n with him and George on the JRE, which allowed me to pretend for a brief time that George\n\n00:51.920 --> 00:54.960\n came down to Austin just to see me.\n\n00:54.960 --> 00:57.080\n Who the hell am I?\n\n00:57.080 --> 01:01.800\n In truth, him and Joe probably conspired to make me feel special, but that's the point.\n\n01:01.800 --> 01:07.060\n It's inspiring to see George and Joe, who are at the top of their field, treat others\n\n01:07.060 --> 01:13.760\n as equals, as human beings, no matter who they are, even silly Russians in a suit.\n\n01:13.760 --> 01:17.920\n Meeting George was an honor for me beyond words.\n\n01:17.920 --> 01:23.920\n This is the Lex Friedman Podcast and here's my conversation with my longtime martial arts\n\n01:23.920 --> 01:29.680\n hero and now my friend, Mr. George St. Pierre.\n\n01:29.680 --> 01:36.640\n In your fighting career, were you more motivated by the love of winning or the fear and hatred\n\n01:36.640 --> 01:37.800\n of losing?\n\n01:37.800 --> 01:44.840\n I like to win better than I hate to lose because if it would not have been the case, I would\n\n01:44.840 --> 01:50.040\n never have fought in the first place because I don't like to fight at all.\n\n01:50.040 --> 01:55.380\n But you talked about the anxiety, the fear that you experienced leading up to a fight.\n\n01:55.380 --> 02:03.180\n So to you, ultimately the reason to go through that difficult process is because it feels\n\n02:03.180 --> 02:06.640\n damn good to have your hand raised?\n\n02:06.640 --> 02:08.040\n There is that.\n\n02:08.040 --> 02:15.080\n There is also the fact that martial art, I've been introduced when I was very young and\n\n02:15.080 --> 02:21.440\n it's probably the best thing I can do in my life, fighting, that's what I do best.\n\n02:21.440 --> 02:32.900\n Also, it provides me of freedom, of access of things that most of people do not have,\n\n02:32.900 --> 02:38.160\n but all that as a price and a lot of money, I made a lot of money, of course, with it.\n\n02:38.160 --> 02:43.120\n I was maybe predisposed with certain abilities.\n\n02:43.120 --> 02:48.160\n I met incredible mentors throughout my life.\n\n02:48.160 --> 02:53.320\n I worked really hard and of course, I had a lot of chances.\n\n02:53.320 --> 03:03.380\n The stars were all aligned and in order to keep that those advantages of freedom, money\n\n03:03.380 --> 03:09.280\n and glory and access of things that most people don't have and have these dream life that\n\n03:09.280 --> 03:16.440\n I have, I had to sacrifice myself and fight in order to keep it.\n\n03:16.440 --> 03:23.280\n It's very hard to understand because I also believe most fighters are not like me.\n\n03:23.280 --> 03:29.000\n A lot of guys, because I corner a lot of guys and it seems to me that they love their job.\n\n03:29.000 --> 03:32.800\n They enjoyed to go fight in the cage.\n\n03:32.800 --> 03:34.000\n I love to train.\n\n03:34.000 --> 03:40.640\n I love the science of fighting, the sport, to be in good shape, the confidence that training\n\n03:40.640 --> 03:43.000\n and mixed martial art give me.\n\n03:43.000 --> 03:51.560\n However, I do not like the feeling of uncertainty, the stress that I have, not knowing if I will\n\n03:51.560 --> 03:59.680\n be badly injured or humiliated or winning the fight.\n\n03:59.680 --> 04:04.440\n To me, I'm bearable and that's what takes the most out of me.\n\n04:04.440 --> 04:06.580\n More than brain damage, more than anything.\n\n04:06.580 --> 04:08.960\n That's what takes the most out of me.\n\n04:08.960 --> 04:15.980\n But the thing you get from it is the freedom that you get because of the money, but because\n\n04:15.980 --> 04:18.520\n of the celebrity, because of everything that comes with it.\n\n04:18.520 --> 04:21.780\n So you can be the best version of yourself because of fighting.\n\n04:21.780 --> 04:27.180\n But at the same time, you've said that, quote, I don't believe there's pleasure in life.\n\n04:27.180 --> 04:30.000\n I believe there's only a relief from pain.\n\n04:30.000 --> 04:32.280\n We have to suffer to be on top.\n\n04:32.280 --> 04:35.720\n So isn't there something to just the suffering in itself?\n\n04:35.720 --> 04:39.840\n Just doing really difficult shit just to get to the top?\n\n04:39.840 --> 04:45.280\n To explain that and so people can relate to it because not everybody's a fighter.\n\n04:45.280 --> 04:53.500\n I think the best example I can give is let's say you're, you haven't eat for a long time\n\n04:53.500 --> 04:56.120\n and you're craving, right?\n\n04:56.120 --> 04:58.520\n So you're suffering.\n\n04:58.520 --> 05:04.200\n And then when it's time to eat, finally, you're about to eat your favorite dish.\n\n05:04.200 --> 05:06.760\n It's going to taste so much better.\n\n05:06.760 --> 05:12.620\n So that's why I believe there is always some sort of sacrifice before the pleasure.\n\n05:12.620 --> 05:19.400\n And the more sacrifice you do, like they say in fighting, the bigger the risk, the bigger\n\n05:19.400 --> 05:20.400\n is the reward.\n\n05:20.400 --> 05:23.480\n And I feel that's how it is for me.\n\n05:23.480 --> 05:29.080\n Yeah, I feel that with, I started fasting a little bit in the past couple of years.\n\n05:29.080 --> 05:35.780\n And there's nothing as amazing as a delicious meal or anything, actually anything, any food\n\n05:35.780 --> 05:39.060\n when you haven't eaten for several days.\n\n05:39.060 --> 05:41.560\n It's kind of incredible.\n\n05:41.560 --> 05:45.840\n It's not incredible in this simple way of finally I get to eat.\n\n05:45.840 --> 05:51.760\n You get to truly experience the beauty of what it is to be alive.\n\n05:51.760 --> 05:58.120\n Like that little piece of food, you see all the flavors, you feel just the experience\n\n05:58.120 --> 06:04.400\n of it is ultimately of gratitude of how awesome it is to be alive.\n\n06:04.400 --> 06:08.880\n But when you eat many times a day and you're pigging out and you don't get to experience\n\n06:08.880 --> 06:09.880\n that.\n\n06:09.880 --> 06:10.880\n And it's fascinating.\n\n06:10.880 --> 06:16.680\n It's really like fasting is one of the most accessible things for people, I think to experience\n\n06:16.680 --> 06:21.400\n that kind of pairing of hardship to pleasure.\n\n06:21.400 --> 06:22.400\n I agree.\n\n06:22.400 --> 06:26.240\n And in my case, it changed my life on a good way.\n\n06:26.240 --> 06:30.220\n I cannot recommend it to people because everybody is different.\n\n06:30.220 --> 06:39.160\n But to fight Michael Bisping, my last fight was against the champion in the heavier weight\n\n06:39.160 --> 06:41.400\n class that I used to compete at.\n\n06:41.400 --> 06:48.840\n So I thought that if I would gain weight, it would increase my performance.\n\n06:48.840 --> 06:50.400\n And I struggled a lot to gain weight.\n\n06:50.400 --> 06:54.280\n I gained about eight to 10 pounds.\n\n06:54.280 --> 06:56.480\n Normally I walk around 185 pounds.\n\n06:56.480 --> 06:59.440\n And for that fight, I was walking around 195.\n\n06:59.440 --> 07:04.120\n However, I forced myself to eat like six times a day.\n\n07:04.120 --> 07:13.840\n I was on a very strict diet and it didn't feel right to me because I feel like I was\n\n07:13.840 --> 07:18.360\n carrying like a little bit like I was carrying a bag on my shoulder.\n\n07:18.360 --> 07:29.040\n And I think it was a bad idea for me because when I did the weigh in and I went on a scale\n\n07:29.040 --> 07:35.960\n at 185, I couldn't go back to my initial weight that was 195 that I worked so hard for several\n\n07:35.960 --> 07:38.680\n months to get there.\n\n07:38.680 --> 07:42.100\n So I was 190 pounds, but I couldn't get back.\n\n07:42.100 --> 07:46.640\n And the morning of the fight, I got sick.\n\n07:46.640 --> 07:53.440\n We didn't know what it was in the beginning because in order to know, to find out what\n\n07:53.440 --> 07:55.560\n it was, I needed to do what they call a colonoscopy.\n\n07:55.560 --> 08:02.840\n They put a camera inside of you and to do that, they give you something that makes that\n\n08:02.840 --> 08:03.840\n empty you.\n\n08:03.840 --> 08:06.980\n And I was trying to gain weight, not to lose weight.\n\n08:06.980 --> 08:12.600\n So I told myself I'm going to wait after the fight, whatever it is, because it was pretty\n\n08:12.600 --> 08:13.600\n bad.\n\n08:13.600 --> 08:14.600\n It was blood.\n\n08:14.600 --> 08:15.600\n And I didn't know what I was.\n\n08:15.600 --> 08:16.760\n I was very concerned.\n\n08:16.760 --> 08:17.760\n I thought I had maybe cancer.\n\n08:17.760 --> 08:20.240\n I was freaking out.\n\n08:20.240 --> 08:22.720\n So I said, I'm going to do that fight.\n\n08:22.720 --> 08:25.120\n And then after right away, I'm going to make a checkup.\n\n08:25.120 --> 08:26.440\n So I did the fight.\n\n08:26.440 --> 08:27.440\n Everything went well.\n\n08:27.440 --> 08:28.440\n I won the fight.\n\n08:28.440 --> 08:29.440\n I went back home.\n\n08:29.440 --> 08:33.640\n I did a colonoscopy and I got diagnosed with ulcer colitis.\n\n08:33.640 --> 08:37.800\n Then I got on very severe medication to get better.\n\n08:37.800 --> 08:39.960\n And I'm not a big fan of medication.\n\n08:39.960 --> 08:46.040\n I was trying to look for more natural way to get better.\n\n08:46.040 --> 08:50.920\n And I found out about fasting and it really changed my life.\n\n08:50.920 --> 08:59.160\n I met Dr. Jason Fong, who was one of the world authority of fasting.\n\n08:59.160 --> 09:07.320\n He treat diabetes patient with fasting and he gave me a program of fasting and it really\n\n09:07.320 --> 09:08.320\n changed my life.\n\n09:08.320 --> 09:15.160\n And right away what I did is I went in a CAT scan to see the difference because it was\n\n09:15.160 --> 09:19.240\n right after my fight with Michael Bisping and I did the CAT scan.\n\n09:19.240 --> 09:26.000\n So I had my muscle mass, bone density, fat percentage, water retention.\n\n09:26.000 --> 09:27.000\n It's pretty amazing.\n\n09:27.000 --> 09:30.800\n It can show you which harm has more muscle than the other.\n\n09:30.800 --> 09:32.080\n It's very precise.\n\n09:32.080 --> 09:35.520\n And I did it like two months after.\n\n09:35.520 --> 09:40.800\n So I started doing time restricted eating, 16 eight.\n\n09:40.800 --> 09:46.200\n But right away when I started, I did three days water fast.\n\n09:46.200 --> 09:52.240\n And the Dr. Jason Fong, he said, because I like to train during those days, I consume\n\n09:52.240 --> 09:57.040\n Himalayan salt to make sure, because when you sweat, there's a lot of minerals to make\n\n09:57.040 --> 10:00.200\n sure you don't deplete your mineral.\n\n10:00.200 --> 10:06.200\n And when I compared the two results in the CAT scan, I found out my biggest concern was\n\n10:06.200 --> 10:07.680\n to lose muscle mass.\n\n10:07.680 --> 10:11.080\n I found out that I did not lose muscle mass.\n\n10:11.080 --> 10:14.060\n Instead of losing it, it increased a little bit.\n\n10:14.060 --> 10:21.480\n Even though my weight on the scale was lighter, I kept the same muscle mass even increases\n\n10:21.480 --> 10:22.480\n a little bit.\n\n10:22.480 --> 10:25.720\n My bone density increases a little bit.\n\n10:25.720 --> 10:30.200\n My water retention is the biggest thing that decrease.\n\n10:30.200 --> 10:33.640\n So my inflammation and my fat percentage.\n\n10:33.640 --> 10:41.240\n So basically by looking at the data, I found out that by eating so much, trying to gain\n\n10:41.240 --> 10:47.480\n weight to fight Michael Bisping, it only increases my water retention, which is not good because\n\n10:47.480 --> 10:50.840\n it's like dead weight and inflammation on you.\n\n10:50.840 --> 10:54.480\n So what was the actual process of fasting?\n\n10:54.480 --> 10:59.760\n You said 16, eight time restricted, so intermittent fasting.\n\n10:59.760 --> 11:03.800\n But you also mentioned the three hour, the three day water fast.\n\n11:03.800 --> 11:04.800\n What did that feel like?\n\n11:04.800 --> 11:07.480\n And you also said training during the three day?\n\n11:07.480 --> 11:08.480\n Yes.\n\n11:08.480 --> 11:09.480\n How did that feel?\n\n11:09.480 --> 11:12.400\n Can you give me some details of, this is fascinating.\n\n11:12.400 --> 11:17.720\n So I do three days water fast, four times a year.\n\n11:17.720 --> 11:18.720\n Nice.\n\n11:18.720 --> 11:24.440\n For me, I do it, everybody is different, but for me, I do it after New Year's.\n\n11:24.440 --> 11:29.240\n Because during the holidays, that's when I eat bad foods and I drink.\n\n11:29.240 --> 11:34.400\n I see it more like a cleansing, like a detox, so to speak.\n\n11:34.400 --> 11:35.760\n Mental too, like psychological.\n\n11:35.760 --> 11:36.760\n Yes.\n\n11:36.760 --> 11:43.400\n I do it after the New Year's, right before the summer, cut for the beach.\n\n11:43.400 --> 11:47.600\n After the summer, because of the summer, I've been partying a little bit sometimes, let\n\n11:47.600 --> 11:48.600\n myself go.\n\n11:48.600 --> 11:51.800\n And right before the holidays.\n\n11:51.800 --> 11:57.680\n And I've tried, Dr. Phuong, he says to me, said, George, everybody's different because\n\n11:57.680 --> 12:01.200\n I'm a very active person and everybody has a different genetics.\n\n12:01.200 --> 12:08.400\n So for me, I feel that three days is the sweet spot because I still train during those three\n\n12:08.400 --> 12:09.400\n days.\n\n12:09.400 --> 12:11.800\n The first day, the first two days, I don't change nothing.\n\n12:11.800 --> 12:14.640\n I train on my regular schedule.\n\n12:14.640 --> 12:19.200\n However, on the third day, I modify a little bit.\n\n12:19.200 --> 12:25.800\n I do something more easy and that's how I do it.\n\n12:25.800 --> 12:31.800\n And I've tried before, because when I say three days is my sweet spot, I've tried to\n\n12:31.800 --> 12:33.680\n go up to five days.\n\n12:33.680 --> 12:39.080\n But the problem is after my third days, I found out that I had a big problem sleeping.\n\n12:39.080 --> 12:41.760\n I get into a hyperactive mode.\n\n12:41.760 --> 12:48.600\n They call that the hunter gatherer mode, you know, like your brain, I mean, it's amazing.\n\n12:48.600 --> 12:53.280\n Your creativity is at its peak, but you cannot sleep very well.\n\n12:53.280 --> 12:56.220\n And sleeping for me, I think it's very important.\n\n12:56.220 --> 12:57.920\n So that's why I do three days for me.\n\n12:57.920 --> 12:58.920\n It's my sweet spot.\n\n12:58.920 --> 12:59.920\n That's interesting.\n\n12:59.920 --> 13:00.920\n You're right.\n\n13:00.920 --> 13:04.760\n It's the four or five days when you start, see sleep is not important for me.\n\n13:04.760 --> 13:07.520\n So the creativity is really important.\n\n13:07.520 --> 13:11.600\n So it's very interesting the places your mind goes after a few days.\n\n13:11.600 --> 13:12.600\n You're right.\n\n13:12.600 --> 13:16.800\n But I mean, what does it do to your mind?\n\n13:16.800 --> 13:18.860\n So you mentioned your body likes it.\n\n13:18.860 --> 13:23.760\n In terms of training, do you find that it helps you focus and think?\n\n13:23.760 --> 13:28.480\n I mean, you're one of the great strategic thinkers in terms of martial arts.\n\n13:28.480 --> 13:30.000\n Does it help with learning?\n\n13:30.000 --> 13:31.160\n Does it help with thinking?\n\n13:31.160 --> 13:34.160\n Does it help with strategizing and all of that?\n\n13:34.160 --> 13:39.240\n Well, unfortunately, I got into fasting after I retired.\n\n13:39.240 --> 13:45.760\n I really wish people asked me, would you have done it during the time that you competed?\n\n13:45.760 --> 13:48.240\n And the answer is yes.\n\n13:48.240 --> 13:52.400\n I think we live in a society that we're bombarded by publicity.\n\n13:52.400 --> 13:56.000\n Oh, buy this, eat protein, this, that.\n\n13:56.000 --> 14:02.280\n And fasting, nobody makes money with it because there's nothing to sell.\n\n14:02.280 --> 14:06.380\n I think that's why a lot of people have not heard about it.\n\n14:06.380 --> 14:13.480\n And even for myself, if someone would have talked to me about the benefits of fasting\n\n14:13.480 --> 14:23.840\n when I was training before I got sick, I would probably have ignored him because it's hard\n\n14:23.840 --> 14:24.840\n to believe.\n\n14:24.840 --> 14:25.840\n It sounds ridiculous.\n\n14:25.840 --> 14:26.840\n Don't eat.\n\n14:26.840 --> 14:27.840\n Yes.\n\n14:27.840 --> 14:30.800\n It's going to help your mind and you're going to gain muscle potentially.\n\n14:30.800 --> 14:31.800\n Exactly.\n\n14:31.800 --> 14:37.280\n And perhaps people have talked to me about it, but it went in one of my ears and got\n\n14:37.280 --> 14:39.760\n out from the other side, you know?\n\n14:39.760 --> 14:42.280\n But it really changed my life.\n\n14:42.280 --> 14:49.720\n And I was diagnosed with ulcerative colitis and it helps me get rid of all my symptoms.\n\n14:49.720 --> 14:55.440\n What I do is, I know a lot of people have ulcerative colitis and for me, I cannot recommend\n\n14:55.440 --> 14:58.500\n it to other people because everybody is different.\n\n14:58.500 --> 15:05.680\n But for me, I made a lot of research of how people from ulcerative colitis got better.\n\n15:05.680 --> 15:10.840\n And I found out that a lot of people that got that condition get better in the natural\n\n15:10.840 --> 15:17.920\n way through fasting, eating fermented food, collagen and bone broth and stuff like that.\n\n15:17.920 --> 15:20.000\n And it made a huge difference in my life.\n\n15:20.000 --> 15:22.480\n I just wish I would have known that before.\n\n15:22.480 --> 15:26.000\n So do you have a specific diet wise stuff you like?\n\n15:26.000 --> 15:32.240\n So I've recently, another ridiculous sounding thing, but it makes me feel really good is\n\n15:32.240 --> 15:33.640\n very low carbs.\n\n15:33.640 --> 15:37.660\n So keto, even carnivore, it sounds ridiculous.\n\n15:37.660 --> 15:39.360\n It doesn't make any sense.\n\n15:39.360 --> 15:42.440\n But it makes me feel really good, even for performance.\n\n15:42.440 --> 15:44.280\n Is Rogan has influenced you?\n\n15:44.280 --> 15:45.780\n He's a carnivore diet.\n\n15:45.780 --> 15:49.680\n I was influenced actually by people, yeah.\n\n15:49.680 --> 15:54.400\n There's I'll tell you where, because I was doing it before he was doing it.\n\n15:54.400 --> 16:00.560\n It was popular in the endurance athlete community where it was fat adapted athletes, people\n\n16:00.560 --> 16:07.000\n who insane people who run 50 miles, 100 miles, they figured out that they could fuel their\n\n16:07.000 --> 16:13.080\n body by with fat that can go to fat as the source of energy as opposed to carbs.\n\n16:13.080 --> 16:20.400\n So I remember hoping that I'll be able to learn how to run 50 miles and so on.\n\n16:20.400 --> 16:29.560\n I've never done more than 22, but it, I just remember switching away from carbs and feeling\n\n16:29.560 --> 16:30.560\n really liberated.\n\n16:30.560 --> 16:33.980\n Like I wasn't thinking about food as much.\n\n16:33.980 --> 16:37.560\n I'm able to eat once a day and feel really good.\n\n16:37.560 --> 16:44.760\n I mean, I think every everybody's body is different, but I think carbs make me lazy.\n\n16:44.760 --> 16:51.720\n Maybe it's because the crash, yeah, it's the crash, but also just psychologically something\n\n16:51.720 --> 16:54.560\n it it forces me to also think about food too much.\n\n16:54.560 --> 16:59.480\n Like it starts becoming, you know, our logistic, you said our society is so much about food.\n\n16:59.480 --> 17:03.620\n There's so many ads, so much advertisement and so much of our social life is about food.\n\n17:03.620 --> 17:10.800\n And so it's very easy to live life, like live day to day thinking, when is the next meal?\n\n17:10.800 --> 17:11.800\n Like what am I going to eat for lunch?\n\n17:11.800 --> 17:12.800\n What am I going to eat for dinner?\n\n17:12.800 --> 17:14.960\n What am I going to eat for breakfast?\n\n17:14.960 --> 17:21.120\n And if you're not careful, that's going to get in the way of you doing cool shit for\n\n17:21.120 --> 17:25.440\n like liberating yourself and thinking like, what am I actually passionate about in this\n\n17:25.440 --> 17:26.440\n life?\n\n17:26.440 --> 17:30.760\n Like creating and forgetting to eat those kinds of things and still being able to fuel\n\n17:30.760 --> 17:31.760\n your body.\n\n17:31.760 --> 17:32.760\n I don't know.\n\n17:32.760 --> 17:39.520\n It's been fascinating to, to figure out like later in life that carbs aren't necessary\n\n17:39.520 --> 17:40.520\n to function.\n\n17:40.520 --> 17:44.120\n Well, it makes me think like, we don't know anything about nutrition.\n\n17:44.120 --> 17:45.120\n That's right.\n\n17:45.120 --> 17:46.120\n Yes.\n\n17:46.120 --> 17:53.040\n You know, personally, I don't think I could have a diet without carbs.\n\n17:53.040 --> 17:54.920\n I love chocolate too much.\n\n17:54.920 --> 17:57.160\n For me eating, it's a, it's a pleasure of life.\n\n17:57.160 --> 17:58.160\n I love my carbs.\n\n17:58.160 --> 17:59.520\n I love my sugar.\n\n17:59.520 --> 18:06.480\n However, if you talk about that, I don't have a specific diet, but recently I, what I'm\n\n18:06.480 --> 18:13.520\n trying to do is the days that I do not work out, I only eat once.\n\n18:13.520 --> 18:14.760\n That's kind of my rules.\n\n18:14.760 --> 18:22.880\n Plus I try to respect 16 eight and do my three day fast, uh, uh, four times a year.\n\n18:22.880 --> 18:28.900\n But the rest of the thing, I, I, I, I let myself loose because I, I don't think I would\n\n18:28.900 --> 18:35.640\n be happy if I, if I, uh, if I, if I don't give myself the, the, the, the right to, to\n\n18:35.640 --> 18:38.920\n eat for me personally, I love to eat so much next.\n\n18:38.920 --> 18:45.640\n And you talk about a diet, carnivore diet is very interesting because I, um, a few years\n\n18:45.640 --> 18:53.280\n ago I went to Africa in, uh, Masai Mara and, uh, it's a tribe in, uh, in, in, uh, East\n\n18:53.280 --> 18:56.920\n Africa and, um, I want to visit them.\n\n18:56.920 --> 19:05.520\n I did a safari and I talked to them and these guys, they, their diet is 99% carnivore.\n\n19:05.520 --> 19:07.120\n They they, that's crazy.\n\n19:07.120 --> 19:10.840\n And you should see they're very beautiful people shredded.\n\n19:10.840 --> 19:12.200\n Some people would say, Oh, it's genetic.\n\n19:12.200 --> 19:13.480\n I'm like, yeah, maybe it's genetic.\n\n19:13.480 --> 19:21.040\n But I mean, think about the Eskimos also that like most of their diet is on, on fish, right?\n\n19:21.040 --> 19:26.200\n They, they, so I believe it can be done, you know, like, I believe it can be done and like\n\n19:26.200 --> 19:28.040\n an exclusive carnivore diet.\n\n19:28.040 --> 19:33.560\n And I, I think I'm going to try it pretty soon just to have the experience, you know,\n\n19:33.560 --> 19:34.560\n to see how it feels like.\n\n19:34.560 --> 19:39.040\n Well, you're going to hang out with Joe, uh, be careful bringing it up because he'll convince\n\n19:39.040 --> 19:41.120\n you to, uh, forever switch to carnivore.\n\n19:41.120 --> 19:42.120\n Definitely.\n\n19:42.120 --> 19:43.120\n He loves it.\n\n19:43.120 --> 19:47.260\n I mean, but just like you, I think he loves food.\n\n19:47.260 --> 19:50.160\n So he's, he can't ever stay on carnivore.\n\n19:50.160 --> 19:55.360\n It was funny cause we went to an Italian restaurant together and I still only eat meat.\n\n19:55.360 --> 20:00.880\n Like I love, um, I love the constraints of discipline.\n\n20:00.880 --> 20:03.440\n That's, that's partially why I like carnivore.\n\n20:03.440 --> 20:09.120\n I like saying no to food that is delicious.\n\n20:09.120 --> 20:12.800\n But a part of the problem is that I don't know how to moderate.\n\n20:12.800 --> 20:13.800\n You said chocolate.\n\n20:13.800 --> 20:15.080\n I don't know how to have one chocolate.\n\n20:15.080 --> 20:17.560\n Is that something you're able to do?\n\n20:17.560 --> 20:19.520\n Have like in moderation?\n\n20:19.520 --> 20:22.600\n No, it's when it, when I have an opportunity, I do it.\n\n20:22.600 --> 20:29.520\n I don't have any, I'm an extremist person, uh, Lex, I, I, that's the thing I, when I,\n\n20:29.520 --> 20:33.280\n when I have a chance, I, I like, I, I just eat, I go too much.\n\n20:33.280 --> 20:37.240\n And that's why I like about my life, you know, that's what I like about fasting.\n\n20:37.240 --> 20:42.620\n Because probably if I would not have discovered fasting, eating chocolate would give me cramps\n\n20:42.620 --> 20:48.400\n and all sorts of problems because people on ulcer colitis, normally they cannot eat chocolate.\n\n20:48.400 --> 20:49.660\n They cannot drink alcohol.\n\n20:49.660 --> 20:57.400\n But I believe because I'm fasting, that's the reason why I'm medication, medicine, medication\n\n20:57.400 --> 20:58.400\n free.\n\n20:58.400 --> 21:02.880\n I can eat whatever I want, whenever I want, but I have to do that, that fasting, you know,\n\n21:02.880 --> 21:07.440\n and now it becomes to a, it became to a point that it's no longer hard for me.\n\n21:07.440 --> 21:08.440\n It's like normal.\n\n21:08.440 --> 21:10.440\n I don't even force myself.\n\n21:10.440 --> 21:12.160\n I don't, it's easy.\n\n21:12.160 --> 21:13.160\n You know what I mean?\n\n21:13.160 --> 21:17.760\n Some of my friends thinks I'm, think I'm, I'm insane, you know, but I tell them it's\n\n21:17.760 --> 21:21.520\n like with, when you get used to it, it becomes like an habit.\n\n21:21.520 --> 21:26.920\n And, and I'm, and I know that hunter gatherer, like our ancestor did not eat three times\n\n21:26.920 --> 21:27.920\n a day.\n\n21:27.920 --> 21:30.160\n It's, it's, it's not true.\n\n21:30.160 --> 21:35.840\n They, they ate one day they could, and when they eat, they, they, they, they feed themselves\n\n21:35.840 --> 21:39.800\n as much as they can until that, because the next time, because they didn't know when they,\n\n21:39.800 --> 21:40.800\n they could eat again.\n\n21:40.800 --> 21:41.800\n Right.\n\n21:41.800 --> 21:47.760\n So it's, I think that's how we're, we're, we're built, you know, to, to, to have this\n\n21:47.760 --> 21:50.800\n similar lifestyle.\n\n21:50.800 --> 21:54.680\n If we could take a step back to the discussion about fear a little bit.\n\n21:54.680 --> 22:00.160\n So Mike Tyson talks about this process of him walking to the ring.\n\n22:00.160 --> 22:05.600\n He sounds similar to you in many ways of the anxiety and the fear that he experiences.\n\n22:05.600 --> 22:12.600\n And he has this sort of story that he tells about walking to the ring and being supremely\n\n22:12.600 --> 22:14.140\n afraid.\n\n22:14.140 --> 22:19.120\n But as he walks and gets closer and steps in, he finds the confidence and becomes supremely\n\n22:19.120 --> 22:20.120\n confident.\n\n22:20.120 --> 22:21.120\n I think he calls himself like a God.\n\n22:21.120 --> 22:24.120\n I feel like a God in the ring.\n\n22:24.120 --> 22:28.480\n Is, is, do you go through a similar process of finding the confidence?\n\n22:28.480 --> 22:31.840\n Well, it, yes.\n\n22:31.840 --> 22:38.040\n And I use, I use a James Lange theory that they did.\n\n22:38.040 --> 22:44.800\n So what I do is because I'm, I'm, I'm not afraid to admit that I'm afraid.\n\n22:44.800 --> 22:51.720\n And in the beginning of my career, I really thought I asked myself, because I was very\n\n22:51.720 --> 22:57.880\n good in mixed martial, but I, I really thought I wasn't made for this because the idea of\n\n22:57.880 --> 23:03.360\n fighting didn't, was, was, didn't make me happy.\n\n23:03.360 --> 23:09.140\n It's something like I, I was, I was forced to do in order to keep that lifestyle that\n\n23:09.140 --> 23:12.080\n I have and achieve my goal.\n\n23:12.080 --> 23:17.080\n Perhaps one day to make enough money to retire and you know, that, that was my dream.\n\n23:17.080 --> 23:22.200\n But when I was looking around the gym where I was training, most of my training partner,\n\n23:22.200 --> 23:23.200\n they were happy.\n\n23:23.200 --> 23:24.200\n They were excited.\n\n23:24.200 --> 23:27.480\n And sometime I corner, I corner a lot of guys and they're happy and they're in the locker\n\n23:27.480 --> 23:28.480\n room.\n\n23:28.480 --> 23:30.800\n They don't react the same way I do.\n\n23:30.800 --> 23:37.760\n Some perhaps does, but if you see me in the locker room, like when I get like my last\n\n23:37.760 --> 23:42.600\n fight with Michael Bisping, just to give you an example in my last fight with Michael Bisping,\n\n23:42.600 --> 23:46.760\n because it's fresh, it's the one that is the most recent and, but it's always the same\n\n23:46.760 --> 23:47.760\n thing.\n\n23:47.760 --> 23:55.080\n My last fight in Bisping, I get in the locker room, I like three guys that I train with,\n\n23:55.080 --> 23:59.600\n Mickey Gall, Eamon Zahabi and Joseph Duffy.\n\n23:59.600 --> 24:00.600\n They all lost.\n\n24:00.600 --> 24:05.200\n It was like, like my, my locker room was basically cursed.\n\n24:05.200 --> 24:10.280\n You know, when you're in a locker room and people from your locker room leave for a fight\n\n24:10.280 --> 24:14.280\n and then they come back, it's kind of a momentum, you know, you, you, you shake and yeah, good\n\n24:14.280 --> 24:15.280\n job.\n\n24:15.280 --> 24:16.280\n Now it's my turn.\n\n24:16.280 --> 24:19.640\n You know, it's kind of a team brotherhood sort of thing.\n\n24:19.640 --> 24:26.840\n So the, the, the, the atmosphere in my locker room was pretty bad.\n\n24:26.840 --> 24:32.400\n It was like going to a, you know, like a funeral.\n\n24:32.400 --> 24:39.880\n So I was very scared and before every fight, I asked myself, I asked myself always, shit,\n\n24:39.880 --> 24:41.320\n what the hell I'm doing here?\n\n24:41.320 --> 24:43.040\n Why did I choose to come back?\n\n24:43.040 --> 24:44.040\n Oh my God.\n\n24:44.040 --> 24:46.440\n And I'm freaking out.\n\n24:46.440 --> 24:53.400\n However, I'm putting on a mask like I'm acting because if I don't do that, it will reflect\n\n24:53.400 --> 24:54.720\n on my coaches.\n\n24:54.720 --> 24:59.880\n And if my coach, my, my, the confidence of my coaches is affected, it will reflect, reflect\n\n24:59.880 --> 25:00.880\n on me.\n\n25:00.880 --> 25:02.440\n So I need to feel strong.\n\n25:02.440 --> 25:09.000\n I need to make them believe that I'm excited to be there and I'm happy to be there.\n\n25:09.000 --> 25:15.560\n So this sort of play start when I get, when I first step in the locker room, even though\n\n25:15.560 --> 25:20.400\n I feel completely different, but that's how I play it.\n\n25:20.400 --> 25:24.120\n Normally the day, the fight day, I never fell, feel a hundred percent.\n\n25:24.120 --> 25:27.640\n I always feel exhausted, tired.\n\n25:27.640 --> 25:32.360\n My highs are hitching because I don't sleep enough the few nights before, because I'm\n\n25:32.360 --> 25:37.600\n constantly rehearse, rehearsing scenarios that might happen in the fight.\n\n25:37.600 --> 25:43.960\n So mentally it's not that I'm not on top, but you keep all that to yourself.\n\n25:43.960 --> 25:48.720\n I keep it to myself and I'm lying to everybody around me.\n\n25:48.720 --> 25:54.680\n But everybody knows, you know, fair ass John De Niro, they know Freddie Rose, they've\n\n25:54.680 --> 25:58.120\n been with me for a long time, so they know what's going on, but at least I'm lying to\n\n25:58.120 --> 25:59.120\n them.\n\n25:59.120 --> 26:00.120\n I'm like, I'm feeling great.\n\n26:00.120 --> 26:05.680\n So, and seeing all my training partner, like very disappointed because they lost our fight.\n\n26:05.680 --> 26:08.800\n Some were badly hurt as well.\n\n26:08.800 --> 26:10.480\n It was hard.\n\n26:10.480 --> 26:15.120\n So I remember I started to warm up and everything.\n\n26:15.120 --> 26:22.660\n And as you start to warm up, you become a different person because we know that certain\n\n26:22.660 --> 26:27.000\n posture and yoga can affect your mental state.\n\n26:27.000 --> 26:30.960\n But I would say it's a little bit the same thing in fighting, you know, like when you\n\n26:30.960 --> 26:37.360\n started hitting the pads, your muscle memory, your instincts comes back and you remember\n\n26:37.360 --> 26:42.000\n that you're good at this, you know, and your confidence start to grow.\n\n26:42.000 --> 26:47.300\n And as seeing your trainers holding the pad and repeating your moves, it makes you also\n\n26:47.300 --> 26:53.000\n remember all the sacrifice you have done through your training camp and confidence come from\n\n26:53.000 --> 26:55.200\n how you prepared yourself.\n\n26:55.200 --> 26:59.860\n And even you're afraid, you can be confident in the same time.\n\n26:59.860 --> 27:03.360\n Being afraid and being confident is two different things.\n\n27:03.360 --> 27:11.440\n And before every fight, just right before I walk in, when I'm scared, I go in the bathroom\n\n27:11.440 --> 27:12.680\n and I look at myself in the mirror.\n\n27:12.680 --> 27:18.360\n I used to have a bandana and a gi, but now I didn't have this for my last fight because\n\n27:18.360 --> 27:22.240\n of the new Reebok deal they had.\n\n27:22.240 --> 27:24.200\n But I did the same rehearsal that I always do.\n\n27:24.200 --> 27:28.120\n I look at myself in the mirror and I start to compliment myself.\n\n27:28.120 --> 27:32.760\n Like even if I don't believe it, I'm starting to trying to believe it as I am.\n\n27:32.760 --> 27:36.240\n I'm finding all the reasons why I'm going to win the fight.\n\n27:36.240 --> 27:41.440\n And all my trainer knows that before every fight, when the guy from the UFC goes and\n\n27:41.440 --> 27:46.160\n Steppen Maroon says, St. Pierre, you're up next, I always take a few minutes to do that\n\n27:46.160 --> 27:47.800\n same rehearsal.\n\n27:47.800 --> 27:52.320\n And I tell myself I'm going to win this fight because I'm better and I'm very cocky about\n\n27:52.320 --> 27:53.320\n myself.\n\n27:53.320 --> 27:55.920\n I'm telling all the reasons that I'm going to win.\n\n27:55.920 --> 27:56.920\n I got a better team.\n\n27:56.920 --> 28:01.800\n I made more sacrifice, you know, I'm faster, I'm more powerful, way more athletic.\n\n28:01.800 --> 28:03.440\n My fighting IQ is better than him.\n\n28:03.440 --> 28:08.440\n I got a strategy on point that he's never going to be able to keep up with and this\n\n28:08.440 --> 28:09.600\n and that.\n\n28:09.600 --> 28:14.800\n And I was telling myself, I'm going to show these young kids how things should be done.\n\n28:14.800 --> 28:16.960\n You know, I'm trying to boost myself.\n\n28:16.960 --> 28:19.800\n Try to boost yourself and you start to believe in it.\n\n28:19.800 --> 28:21.600\n You become a different person.\n\n28:21.600 --> 28:28.320\n So when you walk out the bathroom, now rock and roll, now I really believe it for real.\n\n28:28.320 --> 28:31.420\n You know, like I'm still scared, but I believe it for real.\n\n28:31.420 --> 28:33.900\n And that's the transformation that happened for me right there.\n\n28:33.900 --> 28:39.160\n And from that from now, from from there to the fight, it's until the fight is over.\n\n28:39.160 --> 28:44.400\n It's called I call it cruise control because you don't have time to think in a fight.\n\n28:44.400 --> 28:47.080\n If you're trying to think, you're missing the opportunity.\n\n28:47.080 --> 28:49.760\n So that's how I see it for myself.\n\n28:49.760 --> 28:53.560\n So at that point, you stop thinking and you just go cruise control, autopilot.\n\n28:53.560 --> 28:59.040\n Trust yourself, you know, trust yourself because you repeated all the scenarios, you know.\n\n28:59.040 --> 29:02.400\n So everything that you have done, it's inside your computer.\n\n29:02.400 --> 29:07.720\n Your computer, your brain is programmed to react accordingly to certain situations.\n\n29:07.720 --> 29:12.480\n And it's not the night of the fight that you will tell yourself, oh, finally, I'm going\n\n29:12.480 --> 29:13.480\n to do this.\n\n29:13.480 --> 29:14.480\n If you do this now.\n\n29:14.480 --> 29:18.160\n No, if you have not practiced it before, you're screwed.\n\n29:18.160 --> 29:22.600\n The preparation, the repetition that makes it happen, you know.\n\n29:22.600 --> 29:31.440\n What about like the really difficult moments in a fight where you are tested to your limits,\n\n29:31.440 --> 29:32.440\n essentially?\n\n29:32.440 --> 29:34.440\n Usually it's cardio related exhaustion, right?\n\n29:34.440 --> 29:39.680\n Where you have to ask yourself that same question is like, why the hell am I doing this?\n\n29:39.680 --> 29:44.160\n Do you experience those or are you able to ride through the autopilot?\n\n29:44.160 --> 29:47.040\n And if you do, like, what do you do in those moments?\n\n29:47.040 --> 29:48.040\n Never in a fight.\n\n29:48.040 --> 29:56.560\n In a fight when the fight is on, I never change my mind, I go until the end.\n\n29:56.560 --> 30:03.200\n However, for example, my first fight with BJ Penn, I had a terrible first round.\n\n30:03.200 --> 30:05.280\n So I had to switch gear.\n\n30:05.280 --> 30:08.400\n That happened sometimes, but it's part of my plan.\n\n30:08.400 --> 30:13.800\n I always have a plan B, plan A, plan B, plan C. You need to have that.\n\n30:13.800 --> 30:18.160\n If fighters go into a fight thinking, oh, I'm going to do this, this, this, and they\n\n30:18.160 --> 30:22.960\n don't have a plan B, if this doesn't work, that means they're not well prepared.\n\n30:22.960 --> 30:29.080\n If you talk to me before every fight, I can, like in 30 seconds, give you my old strategy.\n\n30:29.080 --> 30:33.800\n You know, for BJ Penn, my first fight with BJ Penn was, oh, I'm going to keep it standing\n\n30:33.800 --> 30:38.880\n up, keep the fight from the outside, you know, because I'm faster than him.\n\n30:38.880 --> 30:40.560\n Then the fight with BJ Penn started.\n\n30:40.560 --> 30:44.360\n I found out that I was not faster than him.\n\n30:44.360 --> 30:49.580\n And I found out that his reaction time was better than mine.\n\n30:49.580 --> 30:54.920\n So I got beat up the first round and I got a bloody nose and everything.\n\n30:54.920 --> 31:00.080\n So my plan B was now I'm going to wrestle him, you know, I'm going to wrestle him and,\n\n31:00.080 --> 31:02.880\n you know, make him tired and trying to put him down.\n\n31:02.880 --> 31:06.580\n And that's how I beat him because I switched gear, you know?\n\n31:06.580 --> 31:10.920\n But if you can't do that, if you cannot find a way to become the perfect nemesis to your\n\n31:10.920 --> 31:17.560\n opponent, you might win a few fights, but you're going to find, you're going to fight\n\n31:17.560 --> 31:23.520\n someone sooner or later that will, that will give you a lot of, a lot of trouble.\n\n31:23.520 --> 31:25.220\n So that's where the anxiety pays off.\n\n31:25.220 --> 31:26.960\n You're anticipating all the ways it goes wrong.\n\n31:26.960 --> 31:34.800\n So you've developed a plan B and plan C. You know, we talked a lot with, like John Donoher,\n\n31:34.800 --> 31:35.800\n who you work with.\n\n31:35.800 --> 31:36.800\n It's interesting.\n\n31:36.800 --> 31:41.920\n I don't think I've heard him talk about plan B and plan C. He usually has a really clear\n\n31:41.920 --> 31:50.400\n plan A, an entire system of plan A. I don't think I've heard him, we've had a good discussion\n\n31:50.400 --> 31:56.040\n about it in, over some cheeseburgers.\n\n31:56.040 --> 32:02.200\n And he's, he was kind of espousing the value of mastering escapes.\n\n32:02.200 --> 32:08.120\n So when you find yourself in bad situations, being exceptionally good at finding ways out\n\n32:08.120 --> 32:11.540\n of those bad situations, and that's a way of dominance.\n\n32:11.540 --> 32:16.680\n There's nothing, there's no better way to dominate your opponent according to him than\n\n32:16.680 --> 32:21.480\n to show that they can't possibly hurt you no matter how bad the position is.\n\n32:21.480 --> 32:25.520\n It's like, it's a, as opposed to a physical dominance, it's a psychological dominance.\n\n32:25.520 --> 32:27.380\n It's very interesting.\n\n32:27.380 --> 32:32.680\n But I wonder if he has plan B and plan C in his mind too.\n\n32:32.680 --> 32:36.600\n You know, in mixed martial arts, sometimes it's like in science, sometimes you can make\n\n32:36.600 --> 32:42.000\n a mistake, you know, like every human can make mistakes, you know.\n\n32:42.000 --> 32:48.960\n There's certain sport or a certain situation that you, if there's a mistake made, that's\n\n32:48.960 --> 32:49.960\n it exactly.\n\n32:49.960 --> 32:55.640\n Sometimes it's the case in MMA, but sometimes you're able to redeem yourself.\n\n32:55.640 --> 33:02.840\n And if you look the fight with BJ Penn 1 that I had, which was probably one of the most\n\n33:02.840 --> 33:08.760\n competitive fight and it was probably the, it was the fight that I got the most damage\n\n33:08.760 --> 33:09.760\n and I was messed up.\n\n33:09.760 --> 33:13.120\n It took me three days, like two, three days to recuperate from that fight.\n\n33:13.120 --> 33:15.200\n I was really damaged.\n\n33:15.200 --> 33:20.560\n And my first fight versus my second fight, I made a lot of adjustment because I have\n\n33:20.560 --> 33:22.860\n learned from my first fight.\n\n33:22.860 --> 33:28.000\n And also I had a guy, one thing people don't know, like they talk about fighters having\n\n33:28.000 --> 33:29.000\n secret weapons.\n\n33:29.000 --> 33:34.880\n See, for me, my secret weapons was not like some is that they use like certain, like different\n\n33:34.880 --> 33:35.880\n things.\n\n33:35.880 --> 33:36.880\n For me, it was knowledge.\n\n33:36.880 --> 33:40.000\n I had a guy in Montreal, he was measuring frames.\n\n33:40.000 --> 33:44.120\n He's not a scientist, he's a friend of Ferras and I.\n\n33:44.120 --> 33:47.800\n And what he does, he watch fight and he measure frames.\n\n33:47.800 --> 33:52.840\n The way he does it is when you watch a fight and one of the guy throw a punch, he cut\n\n33:52.840 --> 33:56.680\n the picture by frame, the video by frame.\n\n33:56.680 --> 34:02.960\n So he's able to see which fighter has better reaction time than others.\n\n34:02.960 --> 34:08.560\n And BJ Penn, he found out that BJ Penn of all the UFC roster at the time when he was\n\n34:08.560 --> 34:13.000\n in his prime, he had probably the best reaction time of all.\n\n34:13.000 --> 34:17.960\n According to him, Lyoto Machido was the second one, but BJ Penn was the first one.\n\n34:17.960 --> 34:23.960\n So I knew that if I would try to go first, because I always been the fastest guy normally\n\n34:23.960 --> 34:25.800\n when I fight someone.\n\n34:25.800 --> 34:32.040\n But when I fought BJ Penn, I tried to go first and he was always able to like, I never was\n\n34:32.040 --> 34:37.760\n never able to touch him with my jab and he came back with a counter punch.\n\n34:37.760 --> 34:43.600\n However, because of what he told me, I knew that BJ Penn has a very fast reaction time,\n\n34:43.600 --> 34:47.140\n but had a very poor reset time.\n\n34:47.140 --> 34:52.000\n To him, the way he described it to me is like your nervous system is like a muscle.\n\n34:52.000 --> 34:55.380\n BJ Penn was so fast, but he's like more like a sprinter.\n\n34:55.380 --> 34:59.480\n So when I did the second fight, when I fought BJ Penn, I made him flinch.\n\n34:59.480 --> 35:00.480\n Like I fake a lot.\n\n35:00.480 --> 35:02.240\n So I make him react and flinch.\n\n35:02.240 --> 35:10.240\n So all that reaction time that he used to flinch was not used properly to avoid my punches.\n\n35:10.240 --> 35:17.420\n So I burn, I load up his nervous system with a lot of information and fake and to make\n\n35:17.420 --> 35:21.720\n him flinch and pretending I was kicking and wrestling.\n\n35:21.720 --> 35:25.740\n So he got overwhelmed and he got tired very, very fast.\n\n35:25.740 --> 35:27.080\n So that's how I beat him.\n\n35:27.080 --> 35:31.080\n People sometimes they don't know really what's the strategy behind the thing.\n\n35:31.080 --> 35:32.560\n They only see the physical part.\n\n35:32.560 --> 35:36.400\n But when you fight someone, if I fight you, I look at you in the eyes, there's a lot of\n\n35:36.400 --> 35:39.000\n things that going on between you and I.\n\n35:39.000 --> 35:42.680\n I can look down here, bam, jab you in the face.\n\n35:42.680 --> 35:47.340\n The audience will not see these little detail, but you will see it.\n\n35:47.340 --> 35:50.640\n And that's what makes the magic during a fight.\n\n35:50.640 --> 35:55.040\n The relation that you have with the opponent, you know, like the mental game, what you make\n\n35:55.040 --> 35:56.040\n him believe.\n\n35:56.040 --> 35:58.680\n Those little things, I use a lot of those.\n\n35:58.680 --> 36:02.760\n If you talk to a lot of my opponents, they'll tell you, like, I use a lot of these little\n\n36:02.760 --> 36:06.680\n things, you know, like I look down at Banner, I go up or I am pretending I want to attack\n\n36:06.680 --> 36:12.480\n you so I make you flinch, but in reality, I'm just doing this because I want to rest.\n\n36:12.480 --> 36:15.560\n I want to recuperate and I'm tired.\n\n36:15.560 --> 36:18.720\n How much is, you know, people talk about that with poker, for example.\n\n36:18.720 --> 36:21.420\n How much is the value of this?\n\n36:21.420 --> 36:26.640\n You know, so like some people argue that poker is more about the betting, you know, just\n\n36:26.640 --> 36:27.640\n the money.\n\n36:27.640 --> 36:29.200\n It's just how much you bet and so on.\n\n36:29.200 --> 36:35.600\n So that would be more like the analogy there with with fighting would be just strictly\n\n36:35.600 --> 36:37.600\n the physical movement of your body.\n\n36:37.600 --> 36:41.440\n And then a lot of people argue that there's a lot here in the way you look and the little\n\n36:41.440 --> 36:42.440\n movements in the face.\n\n36:42.440 --> 36:47.240\n So do you think there's, do you think you're communicating with your opponent when you\n\n36:47.240 --> 36:49.000\n look at them?\n\n36:49.000 --> 36:51.320\n There's no way to know for sure, 100 percent.\n\n36:51.320 --> 36:54.640\n And I'm by no, no mean psychic, nothing like that.\n\n36:54.640 --> 36:56.280\n And I don't believe in that at all.\n\n36:56.280 --> 37:01.720\n The only thing is I know through looking through the eyes of my opponent when he's afraid and\n\n37:01.720 --> 37:03.600\n when he gives up on me.\n\n37:03.600 --> 37:09.480\n I've been accused very often in my career to not take enough risk, to not finish my\n\n37:09.480 --> 37:10.480\n opponent.\n\n37:10.480 --> 37:14.840\n But the reason why I didn't finish my opponent is because I saw in his eyes that he gave\n\n37:14.840 --> 37:15.840\n up.\n\n37:15.840 --> 37:17.920\n He gave me the fight and I'm winning the fight.\n\n37:17.920 --> 37:21.720\n So it's not up to me.\n\n37:21.720 --> 37:25.720\n It's not to me to make it, to try to sacrifice myself trying to finish him.\n\n37:25.720 --> 37:33.260\n Perhaps if I do that, I will open up for him to capitalize on my mistake.\n\n37:33.260 --> 37:35.960\n It's up to him to make a risk.\n\n37:35.960 --> 37:40.440\n So people sometimes they don't understand that is the art of fighting, my friend, you\n\n37:40.440 --> 37:45.200\n know, like if I'm winning the fight like an hockey, an ice hockey, if you're winning the\n\n37:45.200 --> 37:49.460\n game and it's the third period, it's at the end of the third period, you're not going\n\n37:49.460 --> 37:55.240\n to take out your goaltender trying to score another goal because winning five to three\n\n37:55.240 --> 37:58.060\n or five to four is the same thing.\n\n37:58.060 --> 37:59.060\n Same thing in MMA.\n\n37:59.060 --> 38:00.840\n We make a living out of this.\n\n38:00.840 --> 38:06.800\n And sometimes as bad as it can be, you want to save yourself for another day, you know,\n\n38:06.800 --> 38:09.120\n you want to minimize the damage.\n\n38:09.120 --> 38:13.760\n But if he knows he's losing the fight, it's up to him to take the risk.\n\n38:13.760 --> 38:15.580\n It's not up to me.\n\n38:15.580 --> 38:17.360\n So I'm a good counter fighter.\n\n38:17.360 --> 38:23.960\n I use a lot of my attack or counter strike or reactive take down or proactive take down.\n\n38:23.960 --> 38:25.540\n That's my specialty.\n\n38:25.540 --> 38:31.720\n So I'm not going to I have no desire to sacrifice myself trying to try to finish my opponent\n\n38:31.720 --> 38:38.160\n if he want to, if perhaps I might give him the opportunity to capitalize on me.\n\n38:38.160 --> 38:42.080\n It's not it's not smart to do that.\n\n38:42.080 --> 38:46.760\n And very often when I fight someone, I can read him, I see the fear in his eyes.\n\n38:46.760 --> 38:48.680\n Now I'm like, I got you now.\n\n38:48.680 --> 38:49.680\n He's very desperate.\n\n38:49.680 --> 38:54.280\n That doesn't mean I have to put my guard down because he's going to be desperate.\n\n38:54.280 --> 38:56.080\n But I know I'm beating you.\n\n38:56.080 --> 38:57.080\n And I know I'm beating you.\n\n38:57.080 --> 38:58.080\n I'm just going to do what I need.\n\n38:58.080 --> 39:00.420\n You know, if I have a chance, of course, I'll knock him out.\n\n39:00.420 --> 39:04.320\n But I'm not going to try to sacrifice myself to knock him out.\n\n39:04.320 --> 39:10.800\n And if you do that, maybe one day you'll make a mistake and you'll get dropped and you'll\n\n39:10.800 --> 39:14.440\n you'll tell yourself, I shoot, I just got brain damage.\n\n39:14.440 --> 39:16.040\n Maybe I'm never going to come back the same.\n\n39:16.040 --> 39:21.320\n Maybe you know, I ruined my career or, you know, it's a it's a very serious game that\n\n39:21.320 --> 39:22.320\n we're playing.\n\n39:22.320 --> 39:23.640\n It's very dangerous.\n\n39:23.640 --> 39:30.120\n In the face of that risk, I mean, Mike Tyson talked about, you know, when the opponent\n\n39:30.120 --> 39:38.120\n looks away, he knows he's got him, right, that that he's broken.\n\n39:38.120 --> 39:44.080\n For a person like me who has trouble making eye contact with people, there's truth to\n\n39:44.080 --> 39:45.080\n that.\n\n39:45.080 --> 39:49.400\n I mean, there's truth to that, that there's an animal nature to us looking away.\n\n39:49.400 --> 39:54.800\n I mean, you could see that the way the body language, the way the eyes move between two\n\n39:54.800 --> 40:01.880\n animals going at it in the wild when like two lions fight or two whatever fight.\n\n40:01.880 --> 40:06.520\n There's a certain beta move when you've you've been defeated.\n\n40:06.520 --> 40:07.520\n Yes.\n\n40:07.520 --> 40:13.040\n Or one thing when I know that, that when it happened, one of the signs is when I just\n\n40:13.040 --> 40:16.200\n like make a faint and the guy flinched like crazy.\n\n40:16.200 --> 40:17.960\n That's mean he's really scared of me.\n\n40:17.960 --> 40:21.320\n It's a little bit like you're you're you're doing this, that guy flinched a little bit\n\n40:21.320 --> 40:22.320\n or you're doing this.\n\n40:22.320 --> 40:26.920\n He's like, oh, that's mean you hurt him and he doesn't want to get hurt again.\n\n40:26.920 --> 40:34.060\n So he's really trying to run away and not not winning the fight anymore, but not losing\n\n40:34.060 --> 40:36.780\n sort of surviving the five round.\n\n40:36.780 --> 40:42.680\n And it's hard to to finish a guy who does doesn't want to fight a guy who's not fighting\n\n40:42.680 --> 40:45.600\n anymore to win in this fighting to not lose.\n\n40:45.600 --> 40:48.820\n And the proof of that, if you don't believe me, just look the reign of all the greatest\n\n40:48.820 --> 40:49.820\n champion in UFC.\n\n40:49.820 --> 40:55.880\n I don't care who they are, John Jones or like you could clearly see that in the beginning\n\n40:55.880 --> 40:59.860\n of their reign, they could, you know, finish a lot of their opponents, the same as me in\n\n40:59.860 --> 41:00.860\n the beginning.\n\n41:00.860 --> 41:02.120\n I was finishing a lot of my opponent.\n\n41:02.120 --> 41:08.720\n But there is a time that the entire UFC roster is studying you and they found ways to perhaps\n\n41:08.720 --> 41:15.360\n not beating you, but they found a way to navigate to the fight in a way that they minimize the\n\n41:15.360 --> 41:16.360\n damage.\n\n41:16.360 --> 41:17.360\n You know what I mean?\n\n41:17.360 --> 41:22.560\n So it's a big difference between fighting to win and fighting to not lose.\n\n41:22.560 --> 41:26.040\n You said that there's a difference between a fighter and a martial artist.\n\n41:26.040 --> 41:28.440\n So now we were talking about fighting.\n\n41:28.440 --> 41:32.960\n You're considered by many to be one of the greatest fighters of all time.\n\n41:32.960 --> 41:37.760\n But you said that there's a difference between a fighter and a martial artist.\n\n41:37.760 --> 41:39.680\n A fighter is training for a purpose.\n\n41:39.680 --> 41:41.320\n He has a fight.\n\n41:41.320 --> 41:43.680\n I'm I'm a martial artist.\n\n41:43.680 --> 41:44.960\n I don't train for a fight.\n\n41:44.960 --> 41:46.440\n I train for myself.\n\n41:46.440 --> 41:48.120\n I'm training all the time.\n\n41:48.120 --> 41:52.640\n My goal is perfection, but I will never reach perfection.\n\n41:52.640 --> 41:57.220\n So what to you does it mean to be a martial artist?\n\n41:57.220 --> 42:04.120\n Martial artist is because that lifestyle that I have has been introduced to me and the seed\n\n42:04.120 --> 42:09.440\n has been planted to my mind a long, long time ago by my father.\n\n42:09.440 --> 42:15.040\n I am I do not train because I have a fight.\n\n42:15.040 --> 42:16.440\n I will always train.\n\n42:16.440 --> 42:23.880\n Even now, it kind of amused me that to see that a lot of people, because I'm still training,\n\n42:23.880 --> 42:25.700\n because I love the science of fighting.\n\n42:25.700 --> 42:28.240\n I do not like to fight, but I love the science of it.\n\n42:28.240 --> 42:31.480\n And I will always do it as long as I can do it.\n\n42:31.480 --> 42:33.440\n People think I'm going to make a comeback and everything.\n\n42:33.440 --> 42:36.720\n I'm I'm about to get to have 40 years old.\n\n42:36.720 --> 42:44.440\n You know, like it's I'm, you know, like I don't want to fight in a cage at 40 years\n\n42:44.440 --> 42:45.440\n old.\n\n42:45.440 --> 42:46.440\n I mean, some people have done it.\n\n42:46.440 --> 42:47.440\n They did it very well.\n\n42:47.440 --> 42:48.760\n But I'm not one of them.\n\n42:48.760 --> 42:52.880\n I'm I feel a little bit to me that.\n\n42:52.880 --> 42:57.840\n And you never say never feel like to me like it's a little like a kid that you play with\n\n42:57.840 --> 43:02.560\n the strain when he's young, like when he's five years old, six years old, seven years\n\n43:02.560 --> 43:03.560\n old, eight years old.\n\n43:03.560 --> 43:07.000\n But then I was like, what the hell I'm doing here?\n\n43:07.000 --> 43:08.000\n And I'm too old for this.\n\n43:08.000 --> 43:09.000\n I like it.\n\n43:09.000 --> 43:16.520\n So I have done it, you know, and and I got out of it on top.\n\n43:16.520 --> 43:20.920\n And I'm I'm healthy, which is the most important thing right now, touching wood.\n\n43:20.920 --> 43:22.760\n And I'm I'm wealthy.\n\n43:22.760 --> 43:23.840\n I beat the game.\n\n43:23.840 --> 43:24.840\n You know what I mean?\n\n43:24.840 --> 43:27.520\n In a way, like that's not to be cocky, but I did it.\n\n43:27.520 --> 43:31.040\n And I wish more more fighters could do the same thing.\n\n43:31.040 --> 43:36.960\n I wish, but it's unfortunate because a lot of them, they stay there and hang out for\n\n43:36.960 --> 43:39.160\n too long and they get badly hurt.\n\n43:39.160 --> 43:48.600\n They get beaten and broken, you know, and they finish broke as well, because the lifestyle\n\n43:48.600 --> 43:53.560\n you have when you're a pro athlete, it's crazy, you know, it's it's it's unbelievable.\n\n43:53.560 --> 43:59.160\n However, everything that goes up and life goes down and you need to plan your future,\n\n43:59.160 --> 44:00.160\n you know.\n\n44:00.160 --> 44:04.600\n And for for me, what if some guys have the same mentality as me and they're watching\n\n44:04.600 --> 44:10.160\n us right now, I would say if you do it because you're just good at it, you like the money,\n\n44:10.160 --> 44:14.800\n the advantage, the freedom that it gives you, but you don't necessarily like to fight.\n\n44:14.800 --> 44:20.360\n When you're done, you finish on top, you know, go go cash out and get out of the way.\n\n44:20.360 --> 44:21.360\n Yes.\n\n44:21.360 --> 44:22.360\n Hard to do.\n\n44:22.360 --> 44:25.500\n However, actually, it's not everybody that does it for that reason.\n\n44:25.500 --> 44:28.940\n Some people generally love to fight, love to compete.\n\n44:28.940 --> 44:32.520\n So they do it because they love it, you know, or they do it because of the money.\n\n44:32.520 --> 44:36.400\n But if you don't love it, if you don't like to fight because it's very stressful and you\n\n44:36.400 --> 44:39.740\n don't enjoy you, you enjoy the training, perhaps, but you don't like to fight.\n\n44:39.740 --> 44:44.520\n You do it because it's part of what you need to do in order to keep that lifestyle.\n\n44:44.520 --> 44:49.640\n And you know, like you don't need the money to get out of here, man.\n\n44:49.640 --> 44:51.860\n If you're in your you're in your prime, get out of here.\n\n44:51.860 --> 44:56.780\n Because if you don't, you'll hurt your own legacy, you'll damage your health.\n\n44:56.780 --> 45:03.560\n It's very sad and it's a it's a sad business, you know what I mean?\n\n45:03.560 --> 45:12.160\n It's like a lot of what one of the place where is the one of the most happiest place for\n\n45:12.160 --> 45:15.320\n me to go and the most saddest place for me to go.\n\n45:15.320 --> 45:20.800\n It's in the gym, Tristar in Montreal, because it's one of the happiest place for me to go\n\n45:20.800 --> 45:24.820\n because I can go train and do what I love to do.\n\n45:24.820 --> 45:28.860\n But it's also a very sad place for me because after when I'm about to leave, there's always\n\n45:28.860 --> 45:35.440\n a bunch of young kid that comes or guys that are around 30, 33 years old.\n\n45:35.440 --> 45:38.960\n And they come to me and say, hey, George, you have some advice for me.\n\n45:38.960 --> 45:41.680\n And I look at them.\n\n45:41.680 --> 45:45.040\n And if they're my friend, they're real close friend of mine, I'll tell them the truth in\n\n45:45.040 --> 45:46.320\n their face.\n\n45:46.320 --> 45:49.000\n And I've done it many times and it was not well received.\n\n45:49.000 --> 45:53.200\n But if they're not my friend, I have to, you know, you know, it's always an advice about\n\n45:53.200 --> 45:55.380\n fighting and I answer their question.\n\n45:55.380 --> 45:56.560\n It's my pleasure.\n\n45:56.560 --> 46:02.960\n But the truth, if they they want me to tell the truth, the big majority of them, I would\n\n46:02.960 --> 46:10.160\n tell them, I said, listen, man, you're in maybe three, like on a losing street of three\n\n46:10.160 --> 46:11.160\n fight.\n\n46:11.160 --> 46:16.880\n You're 30, 33 years old, you know, I think you should think about doing something else\n\n46:16.880 --> 46:17.880\n in your life.\n\n46:17.880 --> 46:21.480\n You know, I have other goals, you know, because you're not going to make it.\n\n46:21.480 --> 46:26.720\n And, you know, I've seen that movie before and it's a very sad ending.\n\n46:26.720 --> 46:31.120\n And I'm I'm sad to tell you the truth because you're not going to make the money.\n\n46:31.120 --> 46:32.560\n You just choose some.\n\n46:32.560 --> 46:35.960\n But if I tell them that they're going to be angry at me because they'll be like, oh, you\n\n46:35.960 --> 46:37.780\n you make it and you think I cannot make it.\n\n46:37.780 --> 46:40.400\n So it's kind of they're going to think I'm cocky.\n\n46:40.400 --> 46:42.000\n But I was lucky to make it.\n\n46:42.000 --> 46:43.640\n You know, at the start, we're all aligned.\n\n46:43.640 --> 46:49.320\n But at one point, you need to be able to to have a plan B, you know, like like some parent\n\n46:49.320 --> 46:56.080\n they come to see me with their kids and this is the future world champion in the UFC.\n\n46:56.080 --> 46:57.920\n And what advice would you give him?\n\n46:57.920 --> 46:59.540\n I always tell the same thing.\n\n46:59.540 --> 47:01.440\n And it does not make everybody happy.\n\n47:01.440 --> 47:05.740\n When I said I say I go to the case, a are you good at school?\n\n47:05.740 --> 47:07.000\n Say stay at school.\n\n47:07.000 --> 47:08.560\n School is very important for you.\n\n47:08.560 --> 47:09.560\n Stay educated.\n\n47:09.560 --> 47:10.560\n Yeah.\n\n47:10.560 --> 47:13.040\n Do boxing, martial arts, a great sport.\n\n47:13.040 --> 47:17.320\n Stay in shape, but don't put your eggs all in the same basket.\n\n47:17.320 --> 47:20.360\n And the parents sometime are angry when I'm not angry, but I can see in their eyes, they're\n\n47:20.360 --> 47:24.560\n like they kind of surprised.\n\n47:24.560 --> 47:30.440\n And it's not because I made it that I will tell the kid to follow the same path that\n\n47:30.440 --> 47:31.440\n I did.\n\n47:31.440 --> 47:37.360\n I went to school to I've studied, I dropped off school when I had my first world championship\n\n47:37.360 --> 47:39.400\n fight against Matt Hughes.\n\n47:39.400 --> 47:41.480\n But before that, I was in school.\n\n47:41.480 --> 47:48.120\n Quite another, you know, another way to go if things would not have gone the same, the\n\n47:48.120 --> 47:49.120\n way I wanted.\n\n47:49.120 --> 47:53.440\n But the problem and I'm saying that it's not only about boxing in MMA, I'm talking about\n\n47:53.440 --> 47:56.660\n hockey, basketball, baseball, same, same thing.\n\n47:56.660 --> 47:59.820\n Maybe it's the one on the hundred thousand that make it.\n\n47:59.820 --> 48:02.920\n And I'm saying I'm saying that make it when I'm saying I make it.\n\n48:02.920 --> 48:08.360\n That's mean they can retire and have enough money for the rest of his life because it's\n\n48:08.360 --> 48:09.360\n a sad story.\n\n48:09.360 --> 48:13.000\n The only people only heard about the people that makes it.\n\n48:13.000 --> 48:18.440\n But a lot of fighters, even a UFC champion in boxing, champion, even in football, basketball,\n\n48:18.440 --> 48:19.720\n I don't I don't I don't care.\n\n48:19.720 --> 48:22.120\n Big names when they retire, they have zero.\n\n48:22.120 --> 48:23.940\n They're bankrupt, my friend.\n\n48:23.940 --> 48:29.660\n And it's a very sad, sad story and a sad reality that most people are not aware of.\n\n48:29.660 --> 48:36.160\n But having other paths in life actually can also increase the chance of you dominating\n\n48:36.160 --> 48:39.520\n and like reaching the highest peak in your main thing.\n\n48:39.520 --> 48:45.020\n I mean, Jimmy Pager, I don't know if you know who that is, is a judo coach in in America.\n\n48:45.020 --> 48:49.120\n He was he says that to all of his athletes is to make sure that you go.\n\n48:49.120 --> 48:52.600\n He has a lot of, you know, Kayla Harrison, two time Olympic gold medalist.\n\n48:52.600 --> 48:55.220\n He has a lot of Olympic medalists.\n\n48:55.220 --> 48:59.740\n But basically, there's something about going to school, like having an forget school, any\n\n48:59.740 --> 49:07.280\n other avenue in life that gives you the freedom to go all out in your main like that, you\n\n49:07.280 --> 49:09.520\n know, you're doing it for the right reasons.\n\n49:09.520 --> 49:11.080\n You're not stuck.\n\n49:11.080 --> 49:17.320\n It clears the mind to where you're free to be the best in the world as opposed to kind\n\n49:17.320 --> 49:18.320\n of you have to.\n\n49:18.320 --> 49:21.320\n I mean, different people are motivated by different things.\n\n49:21.320 --> 49:26.160\n So sometimes some people like having their back to the wall and that's the only option\n\n49:26.160 --> 49:27.160\n they have.\n\n49:27.160 --> 49:30.400\n But most people, I think, excel when you have other options.\n\n49:30.400 --> 49:35.160\n I think it's a distraction and I think it's important to have a distraction.\n\n49:35.160 --> 49:38.720\n When you say that, I think about one of my coach, John Danaher.\n\n49:38.720 --> 49:43.840\n He put his academic background experience into jiu jitsu.\n\n49:43.840 --> 49:49.560\n And that for me, that's why he's the best teacher I ever had is incredible.\n\n49:49.560 --> 49:56.020\n He start teaching me when I even couldn't speak much English at the time and I was able\n\n49:56.020 --> 50:00.680\n to communicate and understand, you know, that's how good he is.\n\n50:00.680 --> 50:07.040\n But I truly believe that most of the athletes, especially in sport like mixed martial arts,\n\n50:07.040 --> 50:08.440\n train way too much.\n\n50:08.440 --> 50:16.660\n If I could go back and talk to a young George, I would tell him, you do way too much volume.\n\n50:16.660 --> 50:20.780\n You train way too hard, train smarter, it's more important.\n\n50:20.780 --> 50:29.160\n And I think sometimes we underestimate the benefit of recuperation because I think we\n\n50:29.160 --> 50:35.920\n assimilate the information that we learn during a training when we recuperate and not during\n\n50:35.920 --> 50:37.800\n the training itself.\n\n50:37.800 --> 50:47.120\n And this whole mentality of harder, heavier, you know, it's good for someone who's lazy.\n\n50:47.120 --> 50:51.440\n And if you're an elite athlete, most of the time, you know, like you're not always, but\n\n50:51.440 --> 50:54.760\n most of the time is because you're not lazy.\n\n50:54.760 --> 51:00.360\n And a lot of guys, sometimes they're elite athletes, champions, and you'll hear people\n\n51:00.360 --> 51:05.040\n say, oh, I can't believe he's very gifted, but he doesn't work.\n\n51:05.040 --> 51:09.880\n But perhaps it's not really because perhaps it's because we don't understand, perhaps\n\n51:09.880 --> 51:14.980\n he's doing the right thing and it's us who's working too much and too hard.\n\n51:14.980 --> 51:17.100\n That's what I think.\n\n51:17.100 --> 51:21.720\n There's a guy I train with, he made me think about it.\n\n51:21.720 --> 51:28.000\n His name is Mansour Barnaoui, he's going to be a future star, he's an incredible fighter.\n\n51:28.000 --> 51:31.260\n He trained once a day.\n\n51:31.260 --> 51:34.120\n And he asked me some time advice when he came to Montreal, he's from France.\n\n51:34.120 --> 51:37.920\n You'll hear about him, he's very good.\n\n51:37.920 --> 51:43.080\n And I saw him in the morning at TriStar and I said, okay, I'll see you perhaps later in\n\n51:43.080 --> 51:44.080\n the other trainings.\n\n51:44.080 --> 51:46.680\n He said, no, I only train once a day.\n\n51:46.680 --> 51:54.880\n And he kind of waits for me to give him like, not an approval, but like to see how I react\n\n51:54.880 --> 51:59.680\n or, you know, I don't know, it was kind of a strange feeling, but I told myself at that\n\n51:59.680 --> 52:08.560\n point I kind of had an awakening and I told myself, man, maybe he's doing the right thing.\n\n52:08.560 --> 52:14.120\n Because a lot of people would say, for example, oh, that's a lazy way of doing it, but perhaps\n\n52:14.120 --> 52:15.680\n it's the best way to do it.\n\n52:15.680 --> 52:18.640\n I'm not saying that training once a day is the best way to do it.\n\n52:18.640 --> 52:19.640\n That's what I'm saying.\n\n52:19.640 --> 52:26.100\n I'm saying that everybody's different, but for him, it works beautifully.\n\n52:26.100 --> 52:31.800\n And I wouldn't change anything, you know, like if I would be him because he's improving\n\n52:31.800 --> 52:32.800\n like crazy.\n\n52:32.800 --> 52:33.800\n Yeah.\n\n52:33.800 --> 52:39.920\n And ultimately the bigger picture there is to do something that everyone else says is\n\n52:39.920 --> 52:40.920\n stupid.\n\n52:40.920 --> 52:45.580\n It's like the fasting thing that a lot of people would say, a lot of nutritional experts\n\n52:45.580 --> 52:48.480\n would say that that's a dumb way.\n\n52:48.480 --> 52:52.600\n You know, if you want to be an MMA fighter, you should be eating like many times a day.\n\n52:52.600 --> 52:55.080\n You should be starting every day with oatmeal.\n\n52:55.080 --> 53:00.120\n You should be carving up constantly, but that's not necessarily true for everybody.\n\n53:00.120 --> 53:01.120\n And it's possible.\n\n53:01.120 --> 53:04.320\n I'm sure there's actually now a few MMA fighters that are carnivore only.\n\n53:04.320 --> 53:05.360\n It's possible.\n\n53:05.360 --> 53:11.440\n I used to eat right before training and it didn't bother me.\n\n53:11.440 --> 53:23.960\n However, now my first training that I do normally in average around noon, 11 a.m., I haven't\n\n53:23.960 --> 53:26.000\n eaten anything when I do my first training.\n\n53:26.000 --> 53:32.200\n And it feels to me that I'm much more clear in my mind.\n\n53:32.200 --> 53:33.800\n I'm much more creative.\n\n53:33.800 --> 53:34.800\n I feel better.\n\n53:34.800 --> 53:35.800\n Yeah.\n\n53:35.800 --> 53:36.800\n Yeah.\n\n53:36.800 --> 53:37.800\n It's a big difference.\n\n53:37.800 --> 53:38.800\n I just wish I would have known that before.\n\n53:38.800 --> 53:42.080\n Well, it's fascinating, the role of the mind in all of this.\n\n53:42.080 --> 53:48.440\n How important is it for your mind to be clear, to really think deeply?\n\n53:48.440 --> 53:53.600\n There's a judoka American named Travis Stevens.\n\n53:53.600 --> 54:01.840\n I remember he said something that the right kind of practice is when your mind is exhausted\n\n54:01.840 --> 54:08.640\n at the end of it, that you were constantly thinking through things like your body shouldn't\n\n54:08.640 --> 54:12.160\n be exhausted first, your mind should be exhausted first.\n\n54:12.160 --> 54:13.360\n It's really fascinating.\n\n54:13.360 --> 54:20.120\n So people think about training hard, you know, a successful practice is where you walk away\n\n54:20.120 --> 54:23.760\n just overwhelmed how much you had to think.\n\n54:23.760 --> 54:27.360\n It's fascinating framing of a successful practice.\n\n54:27.360 --> 54:28.440\n It's true.\n\n54:28.440 --> 54:32.920\n Travis Stevens was one of my main training partner when I got ready for my fight with\n\n54:32.920 --> 54:38.080\n Nick Diaz and Carlos Candit.\n\n54:38.080 --> 54:44.600\n He drove every Friday from, I believe, Boston.\n\n54:44.600 --> 54:47.600\n It's like a six hour drive.\n\n54:47.600 --> 54:58.480\n Drive to the gym in Montreal, train with us an hour and a half, drive back.\n\n54:58.480 --> 55:01.320\n He's got such an amazing discipline.\n\n55:01.320 --> 55:06.200\n I was so happy for him when he won the medal at the Olympic game.\n\n55:06.200 --> 55:12.640\n And what a well deserved, you know, accomplishment.\n\n55:12.640 --> 55:13.640\n It's unbelievable.\n\n55:13.640 --> 55:14.640\n It paid off.\n\n55:14.640 --> 55:16.680\n You know, I was so happy for him.\n\n55:16.680 --> 55:26.160\n And every time we got to the gym, he was waiting for me in the kneeling position like a soldier.\n\n55:26.160 --> 55:31.720\n I was like, my God, this guy is made of steel, you know.\n\n55:31.720 --> 55:36.160\n And after training, I always offer him, I say, Travis, I know you like to train with\n\n55:36.160 --> 55:41.720\n that because in Montreal, they have very good judo team, Nicholas Gill and all those guys.\n\n55:41.720 --> 55:45.040\n And I say, if you want to stay, I'll get you at the hotel, you know, like anything\n\n55:45.040 --> 55:46.040\n you want.\n\n55:46.040 --> 55:47.040\n He's like, no, no, I got to go back.\n\n55:47.040 --> 55:48.040\n I have another training later.\n\n55:48.040 --> 55:53.200\n I'm like, not only did he train with us, he had to go back because he had another training.\n\n55:53.200 --> 55:55.440\n I'm like, this is insane.\n\n55:55.440 --> 55:57.880\n And he's gone through a huge number of injuries.\n\n55:57.880 --> 56:04.200\n So he's also an innovator because, I mean, it's difficult to say, but for American judo,\n\n56:04.200 --> 56:06.820\n there's not many high level judoka.\n\n56:06.820 --> 56:12.760\n So if you want to be the, like fight with the best in the world, you have to be alone.\n\n56:12.760 --> 56:14.600\n It's a lonely journey, actually.\n\n56:14.600 --> 56:16.680\n It's kind of sad.\n\n56:16.680 --> 56:19.880\n It's much easier to be in Japan where everybody's a killer.\n\n56:19.880 --> 56:23.320\n When you're alone at it, it's a difficult journey.\n\n56:23.320 --> 56:31.640\n And you know, it's funny we talked about kind of, there's some sports where a mistake is,\n\n56:31.640 --> 56:32.640\n that's it.\n\n56:32.640 --> 56:34.520\n You can't recover from a mistake.\n\n56:34.520 --> 56:43.360\n I think judo oftentimes is one of those sports and added on top of that is the Olympics only\n\n56:43.360 --> 56:45.480\n every four years.\n\n56:45.480 --> 56:50.640\n And Travis's story, he's the reason I, when I saw him in 2008, cause I started martial\n\n56:50.640 --> 56:51.640\n arts.\n\n56:51.640 --> 56:58.200\n I switched from like wrestling and street fighting to doing jiu jitsu and judo.\n\n56:58.200 --> 57:00.200\n And I just saw so much guts.\n\n57:00.200 --> 57:07.400\n And the, in 2000, I might be messing up the years here, but in the next Olympics he fought\n\n57:07.400 --> 57:11.280\n and he lost on just the referee call.\n\n57:11.280 --> 57:12.280\n Yeah.\n\n57:12.280 --> 57:18.840\n And just, he went to war and he just so much guts and just everything on the line and to\n\n57:18.840 --> 57:23.400\n lose and then to still persevere through all the injuries, through all of that, through\n\n57:23.400 --> 57:28.200\n incredibly difficult training sessions to go another four years and then compete and\n\n57:28.200 --> 57:29.200\n then win a medal.\n\n57:29.200 --> 57:35.320\n I mean, that guy's just, and like he clearly could have been very successful.\n\n57:35.320 --> 57:37.560\n He's also an incredible jiu jitsu competitor.\n\n57:37.560 --> 57:41.520\n So he could have switched to that, but he's stuck.\n\n57:41.520 --> 57:49.160\n In a lot of sport, when you're in elite, like for example, in Canada, ice hockey is the\n\n57:49.160 --> 57:52.520\n number one sport of the countries.\n\n57:52.520 --> 57:57.680\n Kids when they're in elite, when they're young, they get chosen and they're kind of already\n\n57:57.680 --> 58:02.080\n known as a superstar.\n\n58:02.080 --> 58:06.200\n The school where they go and the program they follow, like I'm sure it's the same thing\n\n58:06.200 --> 58:14.040\n in the US and basketball, baseball, perhaps American football, because they already chosen.\n\n58:14.040 --> 58:21.760\n So they grew up with that, that it's secure, that superstar stardom, so to speak.\n\n58:21.760 --> 58:25.440\n And it's already sort of glamorous.\n\n58:25.440 --> 58:34.680\n However, in MMA, there's no MMA, judo, wrestling, like in America, because it's not our national\n\n58:34.680 --> 58:40.400\n sport, it's actually, it's not like, even when I first started, it was not really well\n\n58:40.400 --> 58:42.680\n received by the media.\n\n58:42.680 --> 58:45.360\n There's no glamor into it.\n\n58:45.360 --> 58:48.840\n Now I don't know, it seems like it's another era now.\n\n58:48.840 --> 58:55.120\n And I feel sometimes that some people do it for the wrong reason.\n\n58:55.120 --> 59:00.160\n You know, some people do it because of the glamor, because of the money.\n\n59:00.160 --> 59:06.080\n But even if you're an elite and very good, the glamor and the money won't come in the\n\n59:06.080 --> 59:07.720\n beginning.\n\n59:07.720 --> 59:13.480\n It's a very long grind before, you know, it starts to come in.\n\n59:13.480 --> 59:16.280\n And you need to make those sacrifices.\n\n59:16.280 --> 59:23.520\n And it's a journey where you will be tested, you will be hurt repetitively.\n\n59:23.520 --> 59:28.920\n And you're going to have to reach the down deep and come back up.\n\n59:28.920 --> 59:33.720\n And then once you finally think you made it, you're going to go back in the down deep again.\n\n59:33.720 --> 59:39.880\n It's a very exhausting and decaraging adventure sometimes.\n\n59:39.880 --> 59:46.160\n But if you hold on to your dream and you believe in it, you know, and you have the stars aligned,\n\n59:46.160 --> 59:47.720\n you're going to make it.\n\n59:47.720 --> 59:51.800\n That's why it's only a few people that make it, you know.\n\n59:51.800 --> 59:57.360\n And that's why I feel sometimes that a lot of people in the new generation do it for\n\n59:57.360 --> 59:58.360\n the wrong reason.\n\n59:58.360 --> 1:00:02.600\n In my generation, because of sport, at first there were no rules.\n\n1:00:02.600 --> 1:00:04.880\n I thought it was more pure.\n\n1:00:04.880 --> 1:00:08.040\n The people that did it was really because of the passion.\n\n1:00:08.040 --> 1:00:11.880\n We didn't seek money, fame.\n\n1:00:11.880 --> 1:00:14.040\n We did it because we wanted to be...\n\n1:00:14.040 --> 1:00:16.560\n I did it because I wanted to be the man, you know.\n\n1:00:16.560 --> 1:00:21.480\n I like to have the confidence that when I walk somewhere, you know, I have the confidence\n\n1:00:21.480 --> 1:00:26.160\n that, you know, it's an illusion because nobody is faster than a bullet.\n\n1:00:26.160 --> 1:00:29.920\n But I wanted to achieve it for myself.\n\n1:00:29.920 --> 1:00:36.960\n Which today now, because I don't know if it's social media and all that, the world has changed.\n\n1:00:36.960 --> 1:00:42.120\n The glamour, you know, I feel it's a different thing right now.\n\n1:00:42.120 --> 1:00:47.880\n Yeah, if you get in it for the glamour or the money, you may not have the right amount\n\n1:00:47.880 --> 1:00:51.600\n of fuel to persevere through all the ups and downs, for sure.\n\n1:00:51.600 --> 1:01:00.480\n You know, when you talk about motivation of money and glamour, a guy comes to mind, and\n\n1:01:00.480 --> 1:01:06.800\n I don't know how many wrestlers, you know, but in Russia, there's a guy named Bovassiy\n\n1:01:06.800 --> 1:01:07.800\n Satiev.\n\n1:01:07.800 --> 1:01:15.000\n The Satiev brothers, one of the greatest freestyle wrestlers of all time, but he also has...\n\n1:01:15.000 --> 1:01:16.560\n It's funny that he doesn't have many interviews.\n\n1:01:16.560 --> 1:01:21.160\n One of my goals is to go out and talk to him in Russian, do an interview with him because\n\n1:01:21.160 --> 1:01:24.640\n he's exceptionally poetic and a deep thinker.\n\n1:01:24.640 --> 1:01:29.720\n He's the kind of martial artist that you are in the way that it's not just about the different\n\n1:01:29.720 --> 1:01:31.820\n battles you've been through or whatever.\n\n1:01:31.820 --> 1:01:35.000\n It's about the philosophy behind the way he approaches life.\n\n1:01:35.000 --> 1:01:41.400\n Now, he has spoken quite a bit about that the glamour, the fame, the money are all things\n\n1:01:41.400 --> 1:01:50.040\n that get in the way of the purity of the experience, the art, that the way to achieve greatness\n\n1:01:50.040 --> 1:01:58.620\n is to just lose yourself in the art of the actual combat, in his case, it's wrestling,\n\n1:01:58.620 --> 1:02:05.720\n and then kind of not to worry and actively make sure that you block out anybody who,\n\n1:02:05.720 --> 1:02:10.840\n you know, feeds you the narrative where you're supposed to be this famous person and all\n\n1:02:10.840 --> 1:02:16.920\n those kinds of things that he basically says, let others write your story.\n\n1:02:16.920 --> 1:02:19.440\n Make sure that you just focus on the art.\n\n1:02:19.440 --> 1:02:25.680\n And another person from that side of the world is, of course, Khabib, so he represents that\n\n1:02:25.680 --> 1:02:26.680\n side of the world.\n\n1:02:26.680 --> 1:02:32.080\n And we were talking about walking away and most people not being able to walk away at\n\n1:02:32.080 --> 1:02:39.520\n the top as you have, but also now Khabib has, it looks like, incredibly so.\n\n1:02:39.520 --> 1:02:45.360\n I mean, maybe you can comment about what your thoughts are about Khabib Nurmagomedov being\n\n1:02:45.360 --> 1:02:47.800\n able to just walk away.\n\n1:02:47.800 --> 1:02:53.520\n You know, we talk about the GOAT very often, Khabib is, you know, one of, isn't the argument\n\n1:02:53.520 --> 1:03:01.960\n because he has the most dominant carrier of all martial art, the guy, you know, some guys\n\n1:03:01.960 --> 1:03:07.760\n can be named the GOAT for different reasons, but Khabib for that reason, and he's undefeated.\n\n1:03:07.760 --> 1:03:15.360\n I don't even know if he lost, he might have lost a round, but he dominates all his opponents.\n\n1:03:15.360 --> 1:03:22.240\n It was ridiculous and such an incredible career that he had.\n\n1:03:22.240 --> 1:03:27.180\n I love to watch him fight, he's incredible.\n\n1:03:27.180 --> 1:03:35.760\n And when you talk about the art, when you say mixed martial art, the idea of a flawless\n\n1:03:35.760 --> 1:03:43.200\n performance, for me, everybody often, when we say flawless performance, thinks about\n\n1:03:43.200 --> 1:03:46.960\n a knockout, a brutal knockout.\n\n1:03:46.960 --> 1:03:55.880\n But for me, it's to be able to showcase beautiful technique, like a beautiful takedown, beautiful\n\n1:03:55.880 --> 1:04:04.840\n submission, like something beautiful that, you know, when you look at, for example, Wayne\n\n1:04:04.840 --> 1:04:13.360\n Gretzky or Michael Jordan or like Stephen Curry, even if you don't know nothing about\n\n1:04:13.360 --> 1:04:18.720\n basketball and you watch Michael Jordan, you'll be like, wow, that's beautiful what he just\n\n1:04:18.720 --> 1:04:19.720\n did.\n\n1:04:19.720 --> 1:04:25.680\n Like, we talk about fighting and trying to say the word beautiful in fighting for certain\n\n1:04:25.680 --> 1:04:31.320\n people, it could sound kind of crazy, you know, but I'm talking about the technique,\n\n1:04:31.320 --> 1:04:35.320\n a beautiful technique, you know, for me, that's the goal.\n\n1:04:35.320 --> 1:04:39.120\n You know, when I was fighting, it's no need to have a brutal knockout because some people\n\n1:04:39.120 --> 1:04:41.240\n are more gifted than others.\n\n1:04:41.240 --> 1:04:46.240\n I'm saying gifted, some people are better than others in certain phase of fighting.\n\n1:04:46.240 --> 1:04:51.860\n But for me, it was that it was to showcase, to win, of course, but to showcase some beautiful\n\n1:04:51.860 --> 1:04:56.720\n technique that you can watch it and be like, wow, that was incredible.\n\n1:04:56.720 --> 1:04:58.960\n The timing, he did it.\n\n1:04:58.960 --> 1:05:06.480\n And when I think about Khabib Nurmagomedov, I see all the detail of his work, especially\n\n1:05:06.480 --> 1:05:11.520\n when he's got his opponent against the fence, that's like, that's his area of expertise\n\n1:05:11.520 --> 1:05:18.920\n where he's, to me, he's the best that ever did it in terms of that fighting style, that\n\n1:05:18.920 --> 1:05:22.320\n particular expertise that he has, it's just incredible.\n\n1:05:22.320 --> 1:05:25.640\n The flawless execution of that particular set of techniques.\n\n1:05:25.640 --> 1:05:31.340\n And Conor McGregor had the accuracy.\n\n1:05:31.340 --> 1:05:37.440\n The Spider Anderson Silva was like, was, I would say, the most flamboyant of all, you\n\n1:05:37.440 --> 1:05:40.200\n know, like he was moving like the Matrix.\n\n1:05:40.200 --> 1:05:45.640\n Jon Jones was incredible in terms of creativity, spinning elbows and that, and he faced incredible\n\n1:05:45.640 --> 1:05:46.640\n adversity.\n\n1:05:46.640 --> 1:05:51.720\n Dimitrius Johnson was so complete.\n\n1:05:51.720 --> 1:05:54.880\n You could bring, like he was slamming a guy to an armbar.\n\n1:05:54.880 --> 1:05:55.880\n It was just unbelievable.\n\n1:05:55.880 --> 1:05:59.240\n Like, like he was like the complete fighter.\n\n1:05:59.240 --> 1:06:02.200\n BJ Penn was like so flexible.\n\n1:06:02.200 --> 1:06:07.800\n He did stuff with his body that like nobody could do his, the dexterity of his hips was\n\n1:06:07.800 --> 1:06:10.480\n just unbelievable.\n\n1:06:10.480 --> 1:06:15.880\n Dominic Cruz, to me, was incredible, his footwork, his distance control.\n\n1:06:15.880 --> 1:06:20.320\n So when you talk about like the GOAT, Royce Gracie, another one, he did things that I\n\n1:06:20.320 --> 1:06:21.920\n think for me is the number one.\n\n1:06:21.920 --> 1:06:25.520\n Yeah, I gotta, I gotta, and sorry to interrupt, Royce is a fascinating one.\n\n1:06:25.520 --> 1:06:31.480\n I'd love to hear what you think about him, but many people consider you, most people\n\n1:06:31.480 --> 1:06:38.320\n consider you to be the number one greatest mixed martial arts fighter ever.\n\n1:06:38.320 --> 1:06:44.160\n So it's fascinating to remove you from that list and continue this discussion and asking\n\n1:06:44.160 --> 1:06:46.680\n like, who do you think is the greatest fighter ever?\n\n1:06:46.680 --> 1:06:49.560\n You listed some amazing ones, Royce.\n\n1:06:49.560 --> 1:06:51.280\n You somehow skipped Fedor.\n\n1:06:51.280 --> 1:06:53.200\n I'm very, as a Russian, I'm very offended.\n\n1:06:53.200 --> 1:06:55.880\n No, I was, I was going to, there's so many.\n\n1:06:55.880 --> 1:06:57.440\n Fedor is one as well.\n\n1:06:57.440 --> 1:07:02.760\n Fedor, I think in his prime was like, when you say, when you talk about a name, for example,\n\n1:07:02.760 --> 1:07:07.320\n like we talk about him when he was in his prime.\n\n1:07:07.320 --> 1:07:10.520\n Like when I talk, for example, about Anderson Silva, I'm not talking about the Anderson\n\n1:07:10.520 --> 1:07:14.600\n Silva who fought, who fought his last fight against Uriah Hall.\n\n1:07:14.600 --> 1:07:18.080\n I'm talking about the Anderson Silva who knocked out Victor Belfer.\n\n1:07:18.080 --> 1:07:19.080\n Yes.\n\n1:07:19.080 --> 1:07:20.720\n BJ Penn, same thing.\n\n1:07:20.720 --> 1:07:25.400\n The problem is when fighters hang on for too long in the sport.\n\n1:07:25.400 --> 1:07:26.400\n That's what happened.\n\n1:07:26.400 --> 1:07:32.360\n They kind of make, make people forget how good they were.\n\n1:07:32.360 --> 1:07:33.360\n And it's very sad.\n\n1:07:33.360 --> 1:07:38.000\n We talk about Fedor and just, just think about Stipe Miocic.\n\n1:07:38.000 --> 1:07:41.200\n Miocic is probably the greatest heavyweight of all time.\n\n1:07:41.200 --> 1:07:46.320\n With Fedor, I would really wonder who would have won this fight, the both guys in their\n\n1:07:46.320 --> 1:07:47.320\n prime.\n\n1:07:47.320 --> 1:07:52.200\n I tend to lean towards Fedor because my heart was with Fedor, but he could have gone the\n\n1:07:52.200 --> 1:07:53.200\n other way.\n\n1:07:53.200 --> 1:07:57.760\n But just because Miocic lose his last fight, now everybody's like, oh yeah, they forgot\n\n1:07:57.760 --> 1:07:58.920\n about him.\n\n1:07:58.920 --> 1:08:00.360\n It's crazy, man.\n\n1:08:00.360 --> 1:08:01.440\n It's one fight.\n\n1:08:01.440 --> 1:08:04.720\n You zig when you should zag, boom.\n\n1:08:04.720 --> 1:08:06.600\n That's the reality of mixed martial arts.\n\n1:08:06.600 --> 1:08:13.240\n Well, that's why the thing is the mixed martial arts isn't just the performance, the strictly\n\n1:08:13.240 --> 1:08:14.440\n who won and who lost.\n\n1:08:14.440 --> 1:08:16.660\n It's also the stories we tell ourselves.\n\n1:08:16.660 --> 1:08:20.280\n And so, I mean, there's beautiful stories being weaved.\n\n1:08:20.280 --> 1:08:27.760\n And that also is part of who is the greatest of all time is what were the battles, what\n\n1:08:27.760 --> 1:08:29.920\n had to be overcome?\n\n1:08:29.920 --> 1:08:35.160\n What was the flavor of the flawless performances?\n\n1:08:35.160 --> 1:08:39.040\n You know, all of that plays into it and you're right.\n\n1:08:39.040 --> 1:08:42.360\n Being able to walk away at the top is also part of that.\n\n1:08:42.360 --> 1:08:48.200\n A lot of people ask me about Khabib and that fight.\n\n1:08:48.200 --> 1:08:50.080\n I want it to happen.\n\n1:08:50.080 --> 1:08:55.160\n Khabib wanted to happen, but UFC did not want to happen between you and Khabib.\n\n1:08:55.160 --> 1:08:56.160\n Yes.\n\n1:08:56.160 --> 1:09:00.840\n And we tried to make it like about three years ago when I retired, two, no, three, no, it\n\n1:09:00.840 --> 1:09:05.960\n was after two years ago and it never came to fruition.\n\n1:09:05.960 --> 1:09:06.960\n The UFC were clear.\n\n1:09:06.960 --> 1:09:12.080\n They said they have other plan for Khabib and it makes sense for the business standpoint\n\n1:09:12.080 --> 1:09:15.600\n because they want to keep the ball rolling.\n\n1:09:15.600 --> 1:09:21.160\n Now Khabib retired and like everybody else, after Justin Gaethje, I was doing the commentator\n\n1:09:21.160 --> 1:09:26.920\n in French for the UFC and I had Butterfly, I thought he was going to call me out.\n\n1:09:26.920 --> 1:09:30.960\n If there is one guy that I would have said, yes, it would be him, because for a fighter,\n\n1:09:30.960 --> 1:09:37.000\n the most exciting things to do, it's often the scariest one.\n\n1:09:37.000 --> 1:09:40.640\n And Khabib was, you know, the scariest macho.\n\n1:09:40.640 --> 1:09:41.640\n Yes.\n\n1:09:41.640 --> 1:09:47.600\n But he was worth the risk because nobody has ever been able to solve them.\n\n1:09:47.600 --> 1:09:50.800\n How would you solve the Khabib Nurmagomedov puzzle?\n\n1:09:50.800 --> 1:09:56.400\n Well, Khabib is very good against the fence.\n\n1:09:56.400 --> 1:10:01.840\n I would have to establish a game plan and everything, but I think what I would need\n\n1:10:01.840 --> 1:10:05.680\n it to do is take the center of the octagon right away.\n\n1:10:05.680 --> 1:10:08.000\n Use a lot of think and faith.\n\n1:10:08.000 --> 1:10:11.920\n Keep the fight all the way, all the way out or all the way in.\n\n1:10:11.920 --> 1:10:16.120\n And when I say all the way in is when you close the gap, use my proactive and reactive\n\n1:10:16.120 --> 1:10:20.280\n takedown and perhaps my superior explosive to put him down.\n\n1:10:20.280 --> 1:10:25.320\n I like to use those proactive and reactive techniques because for me, I feel it's more\n\n1:10:25.320 --> 1:10:26.320\n economical.\n\n1:10:26.320 --> 1:10:30.440\n Khabib is a much better chain wrestler than me.\n\n1:10:30.440 --> 1:10:34.080\n Chain wrestler is when you got that guy to the fence, it's pure wrestling.\n\n1:10:34.080 --> 1:10:36.960\n What makes my takedown very efficient?\n\n1:10:36.960 --> 1:10:37.960\n It's my karate.\n\n1:10:37.960 --> 1:10:40.400\n It's not my wrestling.\n\n1:10:40.400 --> 1:10:47.880\n I'm very good at timing my opponent and getting in with my explosivity.\n\n1:10:47.880 --> 1:10:52.780\n So if you watch my takedown, it does not demand often, it does not demand a lot of work.\n\n1:10:52.780 --> 1:10:56.200\n When I use the, I call it proactive takedown.\n\n1:10:56.200 --> 1:11:03.280\n When he's coming to punch me and I react, I mean, proactive is when I'm faking it.\n\n1:11:03.280 --> 1:11:08.700\n So I instigate the takedown by a fake, then I take him down.\n\n1:11:08.700 --> 1:11:13.520\n And reactive is when I'm baiting him to throw something, then I'm going.\n\n1:11:13.520 --> 1:11:14.520\n It's a counter.\n\n1:11:14.520 --> 1:11:15.520\n Yeah.\n\n1:11:15.520 --> 1:11:16.520\n Yes.\n\n1:11:16.520 --> 1:11:17.520\n But all my takedowns...\n\n1:11:17.520 --> 1:11:18.520\n In the center of the octagon.\n\n1:11:18.520 --> 1:11:19.520\n Yes.\n\n1:11:19.520 --> 1:11:20.520\n My takedowns are more in the center of the octagon.\n\n1:11:20.520 --> 1:11:24.280\n Like for example, another guy that does it well is Gleason Thibault that did it well\n\n1:11:24.280 --> 1:11:26.960\n in his best days.\n\n1:11:26.960 --> 1:11:31.880\n Khabib has more a style of chain wrestling, I would say like Kamaru Usman, so to speak,\n\n1:11:31.880 --> 1:11:32.880\n kind of guy.\n\n1:11:32.880 --> 1:11:33.880\n It's a different style.\n\n1:11:33.880 --> 1:11:36.640\n You cannot compare both styles.\n\n1:11:36.640 --> 1:11:38.520\n And that's the kind of takedown I'm good.\n\n1:11:38.520 --> 1:11:42.600\n And if I would have fight Khabib, that's one of the strategy I would have adopted.\n\n1:11:42.600 --> 1:11:46.840\n I would not have been afraid because everybody that I fought, I was able to put them down\n\n1:11:46.840 --> 1:11:52.520\n and I have the pedigree to prove it in my fight resume.\n\n1:11:52.520 --> 1:11:56.600\n So you would have perhaps seen him on his back and I would have perhaps be on my back\n\n1:11:56.600 --> 1:11:57.600\n as well.\n\n1:11:57.600 --> 1:11:59.480\n So it would have been a very interesting fight.\n\n1:11:59.480 --> 1:12:01.360\n How hard do you think he is to takedown?\n\n1:12:01.360 --> 1:12:04.640\n I mean, a lot of people speak about his wrestling being just...\n\n1:12:04.640 --> 1:12:07.320\n It has nothing to do with the wrestling because...\n\n1:12:07.320 --> 1:12:08.320\n It has to do with the karate.\n\n1:12:08.320 --> 1:12:13.320\n If I got that timing and I got my both hands around his knees, he's going down the other\n\n1:12:13.320 --> 1:12:14.320\n way.\n\n1:12:14.320 --> 1:12:15.320\n Everybody goes down.\n\n1:12:15.320 --> 1:12:16.320\n Yes, yes, he goes down.\n\n1:12:16.320 --> 1:12:18.520\n And I had a lot of that.\n\n1:12:18.520 --> 1:12:19.520\n That's what I would have adopted.\n\n1:12:19.520 --> 1:12:23.160\n I would not have been afraid of his wrestling.\n\n1:12:23.160 --> 1:12:24.960\n I would have be the instigator.\n\n1:12:24.960 --> 1:12:28.000\n I would have forced the fight forward.\n\n1:12:28.000 --> 1:12:35.160\n And that's how I would have approached that fight, which I believe most of his opponent\n\n1:12:35.160 --> 1:12:38.800\n were afraid of his wrestling because they didn't have the tools that I have to put him\n\n1:12:38.800 --> 1:12:40.080\n down.\n\n1:12:40.080 --> 1:12:41.760\n I would not have forced the wrestling.\n\n1:12:41.760 --> 1:12:42.760\n I would have...\n\n1:12:42.760 --> 1:12:44.720\n In the clinch, I would have tried to disengage.\n\n1:12:44.720 --> 1:12:47.720\n I have many ways to disengage a clinch.\n\n1:12:47.720 --> 1:12:54.840\n I would have wanted to force the fight in a fighting distance, like in a shoot box distance,\n\n1:12:54.840 --> 1:12:57.440\n not in a wrestling distance.\n\n1:12:57.440 --> 1:13:02.760\n Is it possible this fight still happens?\n\n1:13:02.760 --> 1:13:06.720\n You're young, you look great in a suit.\n\n1:13:06.720 --> 1:13:10.280\n Well, there's a lot of problems now.\n\n1:13:10.280 --> 1:13:14.600\n And the thing is, now I made peace with it.\n\n1:13:14.600 --> 1:13:17.480\n I no longer don't want to fight and I don't...\n\n1:13:17.480 --> 1:13:18.480\n It's not going to happen.\n\n1:13:18.480 --> 1:13:24.520\n UFC was not interested and I'm bound by contract with the UFC and by exclusivity.\n\n1:13:24.520 --> 1:13:32.520\n Some people says to me, oh, how about if a wealthy Russian guy come with the money?\n\n1:13:32.520 --> 1:13:37.200\n I said, I'm going to be in court with UFC.\n\n1:13:37.200 --> 1:13:43.720\n And also, I'm older now and when I go home and I'm like, I don't want to do this, you\n\n1:13:43.720 --> 1:13:44.720\n know?\n\n1:13:44.720 --> 1:13:45.720\n But you were always like this.\n\n1:13:45.720 --> 1:13:46.720\n No, I don't want to do this.\n\n1:13:46.720 --> 1:13:50.560\n But like, for example, I was training with Freddie Roach a few days ago and I'm hitting\n\n1:13:50.560 --> 1:13:53.280\n pads, you know?\n\n1:13:53.280 --> 1:13:56.240\n And Freddie is looking at me and he's like, hey, you have the hitch back.\n\n1:13:56.240 --> 1:13:57.240\n I'm like, yeah.\n\n1:13:57.240 --> 1:14:03.800\n If Dana White would walk in the room, in the gym at that precise moment with the UFC contract,\n\n1:14:03.800 --> 1:14:07.080\n I would sign it in the blink of an eye.\n\n1:14:07.080 --> 1:14:15.920\n But when I go home, I'm like, hell no, my belly is full, I'm healthy, I'm wealthy.\n\n1:14:15.920 --> 1:14:17.720\n Why would I want to fight for?\n\n1:14:17.720 --> 1:14:19.080\n I made peace with it.\n\n1:14:19.080 --> 1:14:22.920\n But the minute I go back in the gym, because I still get it inside me when I train with\n\n1:14:22.920 --> 1:14:25.200\n the young guys, I still get it.\n\n1:14:25.200 --> 1:14:29.360\n And a lot of guys think, hey, tell me the truth, you're preparing a comeback because\n\n1:14:29.360 --> 1:14:30.360\n I still get it.\n\n1:14:30.360 --> 1:14:36.440\n You know, I'm a little bit older, but I got more knowledge, I can compensate.\n\n1:14:36.440 --> 1:14:40.760\n I become a different animal because, you know, it changed you.\n\n1:14:40.760 --> 1:14:45.440\n But then after you go home and you're like, man, no way I'm doing this.\n\n1:14:45.440 --> 1:14:51.640\n It's very hard to explain, you need to be a fighter to understand that it's very, very\n\n1:14:51.640 --> 1:14:53.040\n hard to explain.\n\n1:14:53.040 --> 1:14:59.200\n Well, from your perspective, I think Khabib is one of the rare, one of the few fascinating\n\n1:14:59.200 --> 1:15:01.600\n scientific puzzles yet to be solved.\n\n1:15:01.600 --> 1:15:06.160\n So from that aspect, as a martial artist, it's just a fascinating journey to try to\n\n1:15:06.160 --> 1:15:07.160\n solve that puzzle.\n\n1:15:07.160 --> 1:15:12.960\n There is a thing too, like we say, oh, who's the best fighter, people, Lex, they don't,\n\n1:15:12.960 --> 1:15:18.680\n like I am this, I realized that later in my life and I'm sure a lot of young guy will\n\n1:15:18.680 --> 1:15:24.040\n say, oh, I say, Pierre, it's not, don't speak for me, but I'm telling you right now what\n\n1:15:24.040 --> 1:15:27.360\n I'm about to say, you will realize it later.\n\n1:15:27.360 --> 1:15:33.520\n When I was young, I think you can proclaim yourself the more, the badass man on the planet,\n\n1:15:33.520 --> 1:15:37.700\n you know, like nobody can beat you at, it's an illusion, man.\n\n1:15:37.700 --> 1:15:43.800\n That's the sad thing about, for example, DC, Daniel Cormier does probably one of the greatest,\n\n1:15:43.800 --> 1:15:49.880\n it's not the greatest of all time, you said Neotish, but like, it's almost because of\n\n1:15:49.880 --> 1:15:55.160\n that little matchup with John Jones, it's difficult for people to conceive of him as\n\n1:15:55.160 --> 1:15:56.480\n the greatest of all time.\n\n1:15:56.480 --> 1:16:02.800\n It's all about matchup, it's all about timing, and also you make a fight, you make both guys\n\n1:16:02.800 --> 1:16:11.840\n fight 10 times, the result might be different, like every time, you know, I mean, maybe he's\n\n1:16:11.840 --> 1:16:17.440\n gonna win eight out of 10, but that night, he's gonna lose, why?\n\n1:16:17.440 --> 1:16:21.120\n Because we don't know, the universe made it like that, you know, maybe he got sick, maybe\n\n1:16:21.120 --> 1:16:26.960\n he had the emotional issues, he didn't sleep well, and it makes him lose focus and he got\n\n1:16:26.960 --> 1:16:32.900\n caught, you don't, we don't know, but that's the thing, people ask me, would you have done\n\n1:16:32.900 --> 1:16:34.680\n it with Khabib, what would happen?\n\n1:16:34.680 --> 1:16:39.180\n I don't know, maybe out of 10 times, I don't know, maybe as a fighter, I hope I would have\n\n1:16:39.180 --> 1:16:45.520\n won more than him, he thinks the opposite is only one way to find out, but that night,\n\n1:16:45.520 --> 1:16:49.320\n if there is a fight, the guy that's gonna win doesn't mean he's the best fighter, that's\n\n1:16:49.320 --> 1:16:55.360\n mean that he's the one that fought the best the night of the fight, same thing in basketball\n\n1:16:55.360 --> 1:17:01.360\n or hockey, the team that wins the game, it's not necessarily the best team, it's the team\n\n1:17:01.360 --> 1:17:07.440\n that played the best the night of the game, and fighting is no different, so being the\n\n1:17:07.440 --> 1:17:11.920\n baddest man on the planet, it's an illusion.\n\n1:17:11.920 --> 1:17:17.000\n I mean that's the tragic thing about it, is on any one night, anything can happen and\n\n1:17:17.000 --> 1:17:24.200\n then that tells a story for all of human history, it's sad to think about, but that's what makes\n\n1:17:24.200 --> 1:17:30.400\n it beautiful, that there's so much at stake, like entire lives, all the dreams you've had\n\n1:17:30.400 --> 1:17:34.820\n growing up, all the hard work, all of it is decided in a single night, even though that\n\n1:17:34.820 --> 1:17:41.080\n means nothing in terms of who's actually better, I mean that's the beauty, that's why people\n\n1:17:41.080 --> 1:17:48.520\n love the Olympics especially, because it happens so rarely, and dreams are broken, or like\n\n1:17:48.520 --> 1:17:55.800\n triumph is achieved by the unlikely hero, all like right there, I mean that's why we\n\n1:17:55.800 --> 1:17:58.760\n love it, right, that's why we love it.\n\n1:17:58.760 --> 1:18:02.960\n If we wouldn't know always the result before, it would be boring, that's why we do it, you\n\n1:18:02.960 --> 1:18:12.160\n know, watch the odds, like sometimes I like to watch the odds before a fight, you know,\n\n1:18:12.160 --> 1:18:20.160\n because there's things, I believe in causality, everybody believes different things, but I\n\n1:18:20.160 --> 1:18:26.400\n believe everything is because there's a cause to everything, that's personally what I believe,\n\n1:18:26.400 --> 1:18:31.480\n I don't believe that I have like free will, I think I have the illusion of free will,\n\n1:18:31.480 --> 1:18:37.040\n but I believe there's a cause for everything, and if I'm doing something because of something,\n\n1:18:37.040 --> 1:18:41.520\n because of a cause, by definition, there's no free will in a way, if there's a cause,\n\n1:18:41.520 --> 1:18:43.920\n by definition, there's not.\n\n1:18:43.920 --> 1:18:49.000\n How does that make you feel by the way, like the idea that if we just look outside of even\n\n1:18:49.000 --> 1:18:53.120\n just human psychology and fighting and so on, if we look at like physics, if everything\n\n1:18:53.120 --> 1:18:58.960\n is predetermined, if all of these little molecules interacting, it's all already, like your story\n\n1:18:58.960 --> 1:19:00.280\n is already written.\n\n1:19:00.280 --> 1:19:06.080\n I mean, it depends, it's written, but I wouldn't need to know all the data and it's impossible,\n\n1:19:06.080 --> 1:19:07.080\n right?\n\n1:19:07.080 --> 1:19:15.800\n Like it's kind of weird, I gotta say, but to me, I don't see any argument to counter\n\n1:19:15.800 --> 1:19:24.160\n that idea, maybe I'm ignorant, but I haven't seen nobody and everything that I've read\n\n1:19:24.160 --> 1:19:31.280\n so far, there's nothing that counter that idea, because in a mechanical world, if your\n\n1:19:31.280 --> 1:19:39.880\n car broke, or we don't say, oh, the car decided to broke, or a tree is fall, there's reason\n\n1:19:39.880 --> 1:19:43.440\n why the tree is fall, we don't say the tree is decide to fall, right?\n\n1:19:43.440 --> 1:19:49.080\n So because us human being, I think it's our ego, we decide, and I'm no different than\n\n1:19:49.080 --> 1:19:56.240\n anybody when I make a decision, I decided to do this, I choose to do this, but I'm aware\n\n1:19:56.240 --> 1:20:04.720\n that there is causes that make me do certain things, and by definition, I think if there\n\n1:20:04.720 --> 1:20:09.160\n is a cause, there is no free will, by definition, right?\n\n1:20:09.160 --> 1:20:15.040\n Yes, but the thing is, just like you said, we understand so little about human intelligence,\n\n1:20:15.040 --> 1:20:25.320\n the human mind, and especially consciousness, that this giant mystery, this darkness, that\n\n1:20:25.320 --> 1:20:33.160\n we don't understand how it feels like to be something, to be a conscious being, that because\n\n1:20:33.160 --> 1:20:39.000\n of that, we're not able to really even reason about free will, or not, because there might\n\n1:20:39.000 --> 1:20:46.880\n be some magic that comes from consciousness, the consciousness might be the thing that\n\n1:20:46.880 --> 1:20:49.880\n makes us different from a car that breaks down.\n\n1:20:49.880 --> 1:20:58.040\n There might be something totally fascinating, totally undiscovered yet, that will make us\n\n1:20:58.040 --> 1:21:03.160\n realize that free will is actually real, and is somehow fundamental to the human experience.\n\n1:21:03.160 --> 1:21:11.940\n So it's, sometimes I think we forget when we talk about free will and physics and it\n\n1:21:11.940 --> 1:21:16.840\n all seeming to be predetermined, we forget how little we actually understand about the\n\n1:21:16.840 --> 1:21:23.360\n world, and I think in that mystery, there could be totally new ideas that are yet to\n\n1:21:23.360 --> 1:21:29.560\n be discovered, and will make us realize that it's not just an illusion, it is something\n\n1:21:29.560 --> 1:21:33.680\n that is like at the core of how the universe works.\n\n1:21:33.680 --> 1:21:39.880\n Some people believe that consciousness is a fundamental property of the universe, like\n\n1:21:39.880 --> 1:21:46.440\n it's one of the forces of physics, like consciousness permeates everything, it's in everything.\n\n1:21:46.440 --> 1:21:51.300\n Like this table is conscious, but it's not as conscious as us, and we're this little\n\n1:21:51.300 --> 1:21:56.600\n peak of consciousness, and if that's true, and if we get to understand that, maybe there's\n\n1:21:56.600 --> 1:22:03.400\n something, there's an extra bonus we get in terms of free will once you become one of\n\n1:22:03.400 --> 1:22:05.840\n those entities that are super conscious.\n\n1:22:05.840 --> 1:22:10.760\n So I tend to be sort of humbled by the mystery of it.\n\n1:22:10.760 --> 1:22:20.960\n Do you believe one day with the technology that keep improving, we will make robot that\n\n1:22:20.960 --> 1:22:25.800\n will be able to be somehow conscious?\n\n1:22:25.800 --> 1:22:31.720\n Absolutely, that's been my dream, that's been, I hope to do just that.\n\n1:22:31.720 --> 1:22:37.860\n First of all, I believe that all people are capable and want to be good to each other,\n\n1:22:37.860 --> 1:22:45.080\n and I think love is a really powerful thing that connects us and can create better and\n\n1:22:45.080 --> 1:22:52.760\n better worlds, sort of like create better and better societies that improve both the\n\n1:22:52.760 --> 1:22:57.080\n technology, the quality of life, and just the basics of human experience.\n\n1:22:57.080 --> 1:23:04.200\n And I think creating AI systems that are conscious, that are human like, can enable us to be better\n\n1:23:04.200 --> 1:23:05.400\n to each other.\n\n1:23:05.400 --> 1:23:12.300\n Like they can, it's almost like adding more and more kindness to the world through the\n\n1:23:12.300 --> 1:23:16.580\n systems we interact with will inspire us to be better and better to each other.\n\n1:23:16.580 --> 1:23:23.620\n In terms of them being conscious, I think that is an absolute requirement that entities\n\n1:23:23.620 --> 1:23:30.280\n we interact with communicate some element of consciousness to us, like that's how we\n\n1:23:30.280 --> 1:23:31.600\n connect to each other.\n\n1:23:31.600 --> 1:23:37.800\n The reason we, you and I connect is that we believe that each of us are conscious.\n\n1:23:37.800 --> 1:23:44.760\n And to me, what consciousness means is the ability to hurt, the ability to suffer, to\n\n1:23:44.760 --> 1:23:51.720\n struggle in this world, because just like you said, without the struggle, you don't\n\n1:23:51.720 --> 1:23:57.200\n have the love, you don't have the pleasure, and ultimately consciousness is an entity's\n\n1:23:57.200 --> 1:24:03.860\n ability to struggle, to suffer, and from that arises the pleasure.\n\n1:24:03.860 --> 1:24:17.320\n And us together being able to appreciate the highs and experience together the lows, that's\n\n1:24:17.320 --> 1:24:19.400\n how we form the deep connections.\n\n1:24:19.400 --> 1:24:24.000\n I personally think we can create that in robots, and I personally believe it's a lot easier\n\n1:24:24.000 --> 1:24:26.160\n than we think.\n\n1:24:26.160 --> 1:24:35.080\n Does it make you afraid sometimes about the fact that one day AI, like artificial intelligence\n\n1:24:35.080 --> 1:24:40.760\n could hurt us?\n\n1:24:40.760 --> 1:24:45.600\n Because of Hollywood, of course, the movies we watch, but it seems like when I hear sometimes\n\n1:24:45.600 --> 1:24:48.160\n Elon Musk talking, you know?\n\n1:24:48.160 --> 1:24:53.480\n Yeah, so Elon talks about with AI, we're summoning the demon.\n\n1:24:53.480 --> 1:24:58.360\n He is very concerned, and I talked to him about it quite a bit, he's very concerned\n\n1:24:58.360 --> 1:25:03.240\n about all the different ways AI could hurt us humans.\n\n1:25:03.240 --> 1:25:08.480\n I tend to believe that there's a lot more ways in which AI can make our lives better\n\n1:25:08.480 --> 1:25:11.200\n and can make life awesome for humans.\n\n1:25:11.200 --> 1:25:16.280\n I think humans are the ones that can do a lot of evil things.\n\n1:25:16.280 --> 1:25:20.200\n So I'm less worried about AI, I'm more worried about humans.\n\n1:25:20.200 --> 1:25:28.720\n If I look at what humans have done on the course of history, for example, in regards\n\n1:25:28.720 --> 1:25:36.000\n to the planet to the scale of the universe, I think what I'm afraid is that we have more\n\n1:25:36.000 --> 1:25:41.060\n of a destructive force than a beneficial force.\n\n1:25:41.060 --> 1:25:49.600\n So if AI take that in consideration in order to protect us against ourselves, it could\n\n1:25:49.600 --> 1:25:50.600\n hurt us in a way.\n\n1:25:50.600 --> 1:25:54.400\n I don't know if you understand, what do you think about that?\n\n1:25:54.400 --> 1:26:00.840\n Does it makes you afraid sometimes, not because of AI, but because of what humans are doing\n\n1:26:00.840 --> 1:26:06.880\n that AI could do to us to prevent us of hurting ourselves, you know?\n\n1:26:06.880 --> 1:26:15.000\n Yeah, I mean, definitely it can bring out the worst in human nature and provide tools\n\n1:26:15.000 --> 1:26:19.200\n for evil people to do evil things at a larger scale.\n\n1:26:19.200 --> 1:26:24.280\n But I just think it depends what you think human beings are.\n\n1:26:24.280 --> 1:26:34.040\n I tend to believe that as we get more intelligent, we start to see the value, the evolutionary\n\n1:26:34.040 --> 1:26:38.080\n value and the value in terms of happiness of being good to each other.\n\n1:26:38.080 --> 1:26:43.240\n And I think AI, if you look at AI as an optimization problem of how to create a civilization that\n\n1:26:43.240 --> 1:26:50.080\n works well and expands throughout the universe, I think love is much more effective.\n\n1:26:50.080 --> 1:26:53.360\n So AI will help us maximize that.\n\n1:26:53.360 --> 1:26:58.480\n I think there's going to be always spikes throughout, as it has been through human history,\n\n1:26:58.480 --> 1:27:03.960\n where charismatic leaders will do evil onto the world in the name of good.\n\n1:27:03.960 --> 1:27:07.520\n You have the Stalin and the Hitlers and all of that.\n\n1:27:07.520 --> 1:27:19.000\n But ultimately over time, I think technology will give the good people power and the evil\n\n1:27:19.000 --> 1:27:21.960\n people less power.\n\n1:27:21.960 --> 1:27:26.960\n Now there's a lot of ways that that won't be the case.\n\n1:27:26.960 --> 1:27:32.240\n There's a lot of ways for it to go wrong and Elon talks about them, but I honestly think\n\n1:27:32.240 --> 1:27:37.560\n in terms of intelligent AI, that's going to bring more love to the world.\n\n1:27:37.560 --> 1:27:40.880\n The thing I'm concerned about is dumb AI.\n\n1:27:40.880 --> 1:27:45.720\n So there's been a lot of discussion between China and the United States recently on autonomous\n\n1:27:45.720 --> 1:27:47.360\n weapons system.\n\n1:27:47.360 --> 1:27:56.200\n This is something people don't, they're afraid to talk about, but there's now a race where\n\n1:27:56.200 --> 1:28:02.640\n the United States has officially said that they're not against adding AI to its weapon\n\n1:28:02.640 --> 1:28:03.640\n systems.\n\n1:28:03.640 --> 1:28:14.000\n So now the US military is adding automation, adding intelligence to its drones, to anything\n\n1:28:14.000 --> 1:28:16.000\n that can create damage.\n\n1:28:16.000 --> 1:28:21.240\n And so of course, and they did this so in response to China doing that.\n\n1:28:21.240 --> 1:28:24.560\n So you can imagine this is Terminator.\n\n1:28:24.560 --> 1:28:30.360\n You think about Terminators and intelligent systems, they're not, they're pretty dumb.\n\n1:28:30.360 --> 1:28:34.480\n The point is they're efficient at doing what they do.\n\n1:28:34.480 --> 1:28:39.640\n And in the space of war, efficient at doing what you do means killing.\n\n1:28:39.640 --> 1:28:43.120\n So that I'm really afraid of, but those are dumb AI.\n\n1:28:43.120 --> 1:28:49.060\n Those aren't your loving, deep, fulfilling relationships.\n\n1:28:49.060 --> 1:28:55.880\n That's like efficiently being able to fly, to plan the trajectory of dropping bombs,\n\n1:28:55.880 --> 1:29:01.540\n of missiles, of how to do counter attacks, of how to maximize the destruction of a particular\n\n1:29:01.540 --> 1:29:04.040\n facility instead of individuals.\n\n1:29:04.040 --> 1:29:07.440\n And then that can just escalate.\n\n1:29:07.440 --> 1:29:12.480\n And as opposed to the cold war with the Soviet Union, this could be a hot war.\n\n1:29:12.480 --> 1:29:19.860\n And then the consequences, once you allow, it's kind of terrifying because currently\n\n1:29:19.860 --> 1:29:22.040\n the drones are operated by humans.\n\n1:29:22.040 --> 1:29:30.040\n So you have say, you have information about, intelligence gives you information about a\n\n1:29:30.040 --> 1:29:33.160\n particular terrorist located in this area.\n\n1:29:33.160 --> 1:29:40.060\n And then you use drones to maybe the automation there is to help you figure out what is the\n\n1:29:40.060 --> 1:29:44.320\n best trajectory to strike at that location.\n\n1:29:44.320 --> 1:29:49.840\n So you still have a human that pulls the trigger at the end and dropping the bomb.\n\n1:29:49.840 --> 1:29:56.640\n Now automation and AI and autonomous weapons systems might be where you say, there's a\n\n1:29:56.640 --> 1:29:58.840\n bad guy over here.\n\n1:29:58.840 --> 1:30:02.440\n You figure out how to get rid of the bad guy.\n\n1:30:02.440 --> 1:30:06.560\n So then of course the systems will be very good at finding the right trajectory and so\n\n1:30:06.560 --> 1:30:11.280\n on, but there's bugs that can happen.\n\n1:30:11.280 --> 1:30:16.880\n Unexpected bugs that the system might figure out that there is this bad guy might actually\n\n1:30:16.880 --> 1:30:20.140\n be in these other five locations.\n\n1:30:20.140 --> 1:30:24.980\n So might make sense to cover the entire area, right?\n\n1:30:24.980 --> 1:30:31.180\n And so you might drop bombs on the entire area and then that's just okay.\n\n1:30:31.180 --> 1:30:35.600\n So that's going to lead to a lot of destruction at the scale of a city, but then you can immediately\n\n1:30:35.600 --> 1:30:37.620\n take that to nuclear weapons.\n\n1:30:37.620 --> 1:30:43.960\n If you add automation to responding to counterattacks to nuclear weapons, somebody, you might get\n\n1:30:43.960 --> 1:30:48.320\n information that somebody is planning a nuclear attack on the United States and the AI system\n\n1:30:48.320 --> 1:30:53.560\n will immediately respond and you know, it can respond at a scale of launching nuclear\n\n1:30:53.560 --> 1:30:54.560\n weapons itself.\n\n1:30:54.560 --> 1:30:59.520\n And so there's all of these possibilities that don't require much intelligence.\n\n1:30:59.520 --> 1:31:04.320\n And that's exceptionally concerning.\n\n1:31:04.320 --> 1:31:09.200\n I'm like you, I do not believe there is babies that are born bad.\n\n1:31:09.200 --> 1:31:14.880\n I think people do bad things because of their experience.\n\n1:31:14.880 --> 1:31:23.360\n However, if I look through my experience and from what I can see is some very often, man's\n\n1:31:23.360 --> 1:31:29.440\n of power wants more power.\n\n1:31:29.440 --> 1:31:32.080\n That's what makes me afraid with, you know?\n\n1:31:32.080 --> 1:31:37.520\n Absolutely, listen, I've come from the Soviet Union.\n\n1:31:37.520 --> 1:31:41.280\n Stalin is arguably one of the most powerful humans in history.\n\n1:31:41.280 --> 1:31:44.160\n He's not talked often enough about by the evils he's done.\n\n1:31:44.160 --> 1:31:49.680\n Hitler gets all the attention, but Stalin has done arguably much more evil than Hitler.\n\n1:31:49.680 --> 1:31:52.280\n Yeah, well, this is human nature.\n\n1:31:52.280 --> 1:31:53.960\n It wants power.\n\n1:31:53.960 --> 1:31:57.320\n We see that with institutions, we see that with governments and nations.\n\n1:31:57.320 --> 1:32:04.680\n I think you see this with the internet, people are really hungry for the distribution of\n\n1:32:04.680 --> 1:32:05.680\n power.\n\n1:32:05.680 --> 1:32:11.680\n Like you see that people are very much distrustful of centralized places of power, of institutions\n\n1:32:11.680 --> 1:32:12.760\n and so on.\n\n1:32:12.760 --> 1:32:19.280\n So I think successful organizations, successful companies, successful governments will be\n\n1:32:19.280 --> 1:32:22.240\n run by people who distribute the power.\n\n1:32:22.240 --> 1:32:24.880\n Like I don't trust myself with power at all.\n\n1:32:24.880 --> 1:32:32.000\n And I think you have to build into the system that no one person can have power and that\n\n1:32:32.000 --> 1:32:33.000\n you distribute it.\n\n1:32:33.000 --> 1:32:37.040\n That's where you have in the financial sector, you have cryptocurrency right now with Bitcoin\n\n1:32:37.040 --> 1:32:38.600\n and all those kinds of things.\n\n1:32:38.600 --> 1:32:44.500\n People are exploring, how can we avoid the central bank to have the control?\n\n1:32:44.500 --> 1:32:49.440\n How do you put the power in the hands of people, thousands of people, millions of people?\n\n1:32:49.440 --> 1:32:58.960\n And same way with military, with any kind of, with technology, I think the future looks\n\n1:32:58.960 --> 1:33:01.040\n very distributed.\n\n1:33:01.040 --> 1:33:05.760\n What do you think about militarizing space?\n\n1:33:05.760 --> 1:33:12.400\n The space force, I don't think about it often because right now I'm filled with excitement\n\n1:33:12.400 --> 1:33:15.760\n about space exploration, which is the positive aspect.\n\n1:33:15.760 --> 1:33:22.040\n So Elon, I was born in an era where it was exciting.\n\n1:33:22.040 --> 1:33:28.400\n I don't know about you, but for me it's exciting to look up to the stars and dream about us\n\n1:33:28.400 --> 1:33:35.480\n humans colonizing Mars, colonizing other planets, expanding out to the galaxy, into the universe.\n\n1:33:35.480 --> 1:33:38.180\n That's really exciting.\n\n1:33:38.180 --> 1:33:43.320\n So the possibilities there are endless.\n\n1:33:43.320 --> 1:33:47.580\n I don't think, because also the resources are endless.\n\n1:33:47.580 --> 1:33:55.040\n And so I think we get into trouble with militarization, with wars when the resources are very constrained.\n\n1:33:55.040 --> 1:34:01.420\n So I think for a while we're not going to be fighting, the only wars we'll be fighting\n\n1:34:01.420 --> 1:34:05.440\n in space are the ones that kind of help us.\n\n1:34:05.440 --> 1:34:10.400\n Another nation to compete, who goes to the moon first, I guess.\n\n1:34:10.400 --> 1:34:15.440\n Those kinds of things are maybe for satellites and all those kinds of communication and maybe\n\n1:34:15.440 --> 1:34:19.160\n in assistance for cyber warfare, which is also very dangerous.\n\n1:34:19.160 --> 1:34:28.400\n But in terms of the wars out in space, I think everything out in space will be positive and\n\n1:34:28.400 --> 1:34:29.400\n inspiring.\n\n1:34:29.400 --> 1:34:33.580\n It's very hard, but all good things are hard, I think.\n\n1:34:33.580 --> 1:34:38.880\n This is where I've been talking to a bunch of people about extraterrestrial life.\n\n1:34:38.880 --> 1:34:45.320\n I'm really excited by, I don't know, it's the other thing.\n\n1:34:45.320 --> 1:34:48.220\n When I look out to the stars, it's exciting to me.\n\n1:34:48.220 --> 1:34:53.180\n I know I think you've spoken about it being scary, but to me it's exciting that there's\n\n1:34:53.180 --> 1:34:59.560\n intelligent creatures out there far beyond perhaps the intelligence of our own that are\n\n1:34:59.560 --> 1:35:04.780\n just too far away to explore yet, but we might one day come in contact with them.\n\n1:35:04.780 --> 1:35:11.440\n So that to me is the ultimate motivator is to meet other intelligence life forms out\n\n1:35:11.440 --> 1:35:13.040\n there and connect with them.\n\n1:35:13.040 --> 1:35:15.400\n Have you ever meet Jacques Vallée?\n\n1:35:15.400 --> 1:35:17.640\n No, but I've been in communication.\n\n1:35:17.640 --> 1:35:19.280\n I want to, I hope to talk to him.\n\n1:35:19.280 --> 1:35:20.280\n He's an amazing...\n\n1:35:20.280 --> 1:35:21.280\n French, yeah.\n\n1:35:21.280 --> 1:35:27.720\n I know that there's many theories about, you know, if there's alien, we don't know, right?\n\n1:35:27.720 --> 1:35:34.120\n But some people think it's from another star systems and Jacques Vallée has like to make\n\n1:35:34.120 --> 1:35:43.080\n a long story short, he has a different theory, thinks it's perhaps beings that could be living\n\n1:35:43.080 --> 1:35:44.960\n in a different dimension than us.\n\n1:35:44.960 --> 1:35:49.700\n And the reason why he says that is when he makes an experiment, when there is a sightings\n\n1:35:49.700 --> 1:35:58.980\n very often of a UFO, let's say I'm the UFO that you have three guys, they are looking\n\n1:35:58.980 --> 1:36:06.240\n at the UFO very often, one experiment that you can do, and sometimes that is the case,\n\n1:36:06.240 --> 1:36:11.040\n you ask your two friends to walk on the side and there's a point that it's like a corridor,\n\n1:36:11.040 --> 1:36:14.640\n you see the UFO and then you stop seeing it like a corridor.\n\n1:36:14.640 --> 1:36:20.000\n And that's one of the reasons why he's saying that it's perhaps dimension.\n\n1:36:20.000 --> 1:36:23.280\n And I found that fascinating, you know?\n\n1:36:23.280 --> 1:36:27.480\n This is what, you know, to the discussion of consciousness and all that, it feels like\n\n1:36:27.480 --> 1:36:33.000\n we might be just experiencing a very particular slice of this universe, we might not be understanding\n\n1:36:33.000 --> 1:36:37.980\n what's at the higher dimensions or, yeah, I mean, higher dimensions in whatever form\n\n1:36:37.980 --> 1:36:44.080\n that means, you know, there's all these physical theories now that describe a world with dimensions\n\n1:36:44.080 --> 1:36:47.800\n that's much higher than the four dimensions of the three dimension of space and the one\n\n1:36:47.800 --> 1:36:49.800\n dimension of time.\n\n1:36:49.800 --> 1:36:56.840\n So whatever the hell is going on in those other dimensions, it could be something, unfortunately,\n\n1:36:56.840 --> 1:37:02.240\n this is the sad part, it might be something we can't even comprehend with our human brains,\n\n1:37:02.240 --> 1:37:09.120\n that the limitations are just, I mean, we're just descendants of apes, so like it might\n\n1:37:09.120 --> 1:37:10.840\n not be possible to even understand.\n\n1:37:10.840 --> 1:37:11.840\n Is there alien?\n\n1:37:11.840 --> 1:37:12.840\n Is there another dimension?\n\n1:37:12.840 --> 1:37:14.720\n Are they human from the future?\n\n1:37:14.720 --> 1:37:19.880\n Is there perhaps Chinese or another, you know what I mean, a group of people that are working\n\n1:37:19.880 --> 1:37:21.960\n with technology far behind?\n\n1:37:21.960 --> 1:37:26.880\n But you know what, Lex, I had the chance to meet, you know, because of the sport I'm doing,\n\n1:37:26.880 --> 1:37:34.040\n I met a lot of people in military and politics sometimes that I ask them every time.\n\n1:37:34.040 --> 1:37:42.320\n I met one this week and I asked him, I say, is it true about the UFOs there?\n\n1:37:42.320 --> 1:37:47.600\n And he says to me, he's like, even before I asked him, I say, sorry, I have to ask you\n\n1:37:47.600 --> 1:37:48.600\n a question.\n\n1:37:48.600 --> 1:37:52.960\n I was in Los Angeles and I said, sorry, I have to ask you a question.\n\n1:37:52.960 --> 1:37:55.400\n He said, oh, you want to ask me about UFOs right away, you do.\n\n1:37:55.400 --> 1:37:56.400\n And I say, yes.\n\n1:37:56.400 --> 1:37:57.400\n He saw it in your eyes.\n\n1:37:57.400 --> 1:38:00.440\n He said, yeah, there is things that flies that we don't know.\n\n1:38:00.440 --> 1:38:04.360\n But he didn't tell me, he doesn't know it, they don't know if it's alien or whatever,\n\n1:38:04.360 --> 1:38:07.240\n but there's things apparently that are detected.\n\n1:38:07.240 --> 1:38:11.200\n And I know you met Fravor, you know, like Fravor is fascinating.\n\n1:38:11.200 --> 1:38:12.200\n It's crazy.\n\n1:38:12.200 --> 1:38:17.840\n It makes me sad that we live in a different era now that it used to be a subject that\n\n1:38:17.840 --> 1:38:23.840\n was ridicules and now it's so cool that it's, you know, I'm very excited to live in to that\n\n1:38:23.840 --> 1:38:25.320\n era, you know?\n\n1:38:25.320 --> 1:38:29.560\n Yeah, it's really exciting, but still the governments are kind of behind the times on\n\n1:38:29.560 --> 1:38:35.160\n that aspect is they're not transparent and they don't communicate well.\n\n1:38:35.160 --> 1:38:40.640\n You know, it saddens me to think the possibility that, that, you know, like the US government\n\n1:38:40.640 --> 1:38:46.560\n might be in possession of something that they don't tell the world about because they're\n\n1:38:46.560 --> 1:38:51.480\n just scared is because they don't know what the hell it is and they don't want the Chinese\n\n1:38:51.480 --> 1:38:54.600\n to gain the technology or all those kinds of things.\n\n1:38:54.600 --> 1:38:58.800\n Do you think the president of the United States, for example, because the president comes and\n\n1:38:58.800 --> 1:39:04.480\n go every, right, four or eight years, do you think he would know all the secret or it would\n\n1:39:04.480 --> 1:39:09.720\n be a guy like, for example, Vladimir Putin would know much of, you know what I mean?\n\n1:39:09.720 --> 1:39:14.800\n I don't think the president even know, like even knows all the secret.\n\n1:39:14.800 --> 1:39:15.800\n The US president.\n\n1:39:15.800 --> 1:39:20.720\n I don't think so because he goes, they go back and forth, you know, every four years,\n\n1:39:20.720 --> 1:39:22.980\n you know, they have the terms, right?\n\n1:39:22.980 --> 1:39:29.680\n So I, you know, I wasn't sure before, but I think I could trust the previous United\n\n1:39:29.680 --> 1:39:36.640\n States president of Donald Trump that if he knew, he would probably tweet about it.\n\n1:39:36.640 --> 1:39:45.680\n So I think from the, you know, I've worked with DARPA, I worked with DOD at a clearance\n\n1:39:45.680 --> 1:39:51.600\n and I think from the perspective, if you, if you see the world as fundamentally a dangerous\n\n1:39:51.600 --> 1:39:58.360\n world where secrets are important to have from a military perspective, I think it's\n\n1:39:58.360 --> 1:40:06.000\n very unsafe to tell the president of the United States that you have this kind of technology.\n\n1:40:06.000 --> 1:40:11.120\n So if you think of the world in that way, I hate that that's how that world is viewed\n\n1:40:11.120 --> 1:40:16.040\n because ultimately I think what's more powerful than the military secrets, and I hope that\n\n1:40:16.040 --> 1:40:23.520\n actually is what will happen in the 21st century, is what's more powerful is inspire people.\n\n1:40:23.520 --> 1:40:29.100\n Inspire the young Elon Musk's of the world to create cool new things.\n\n1:40:29.100 --> 1:40:35.800\n If we have technology that we've have come, have encountered that we don't understand\n\n1:40:35.800 --> 1:40:40.720\n that should only be inspiration to develop that kind of stuff.\n\n1:40:40.720 --> 1:40:46.700\n It shouldn't be seen as military, as a military threat, as a secret to hold on to.\n\n1:40:46.700 --> 1:40:53.720\n I think secrets, I hope we more and more let go of the idea that there are secrets that\n\n1:40:53.720 --> 1:40:59.720\n give us advantage, you know, like in the tech sector, people are more and more releasing\n\n1:40:59.720 --> 1:41:03.240\n the software and making it open source.\n\n1:41:03.240 --> 1:41:05.400\n Like secrets don't make sense.\n\n1:41:05.400 --> 1:41:07.280\n They share the knowledge, right?\n\n1:41:07.280 --> 1:41:08.280\n Share the knowledge.\n\n1:41:08.280 --> 1:41:13.200\n Like being afraid to share the knowledge, I think, I hope is an old idea.\n\n1:41:13.200 --> 1:41:14.200\n It's more, yeah.\n\n1:41:14.200 --> 1:41:16.880\n When you make it, things more compartmentalize, you know?\n\n1:41:16.880 --> 1:41:17.880\n Yes.\n\n1:41:17.880 --> 1:41:18.880\n Well, yeah.\n\n1:41:18.880 --> 1:41:23.460\n That's the other thing is the bureaucracy of government is like people only know their\n\n1:41:23.460 --> 1:41:25.800\n own little thing and they don't spread the information.\n\n1:41:25.800 --> 1:41:26.800\n It doesn't travel well.\n\n1:41:26.800 --> 1:41:30.320\n I mean, there's a lot of just inefficiencies that are, it makes me sad.\n\n1:41:30.320 --> 1:41:37.280\n It makes me sad because the science, the engineering that happens in governments, like Lockheed\n\n1:41:37.280 --> 1:41:42.360\n Martin developing the different airplanes that they use for military applications is\n\n1:41:42.360 --> 1:41:45.000\n some of the most incredible engineering ever.\n\n1:41:45.000 --> 1:41:49.640\n And it's secret because they're afraid to share it with the Russians and the Chinese\n\n1:41:49.640 --> 1:41:51.520\n and so on.\n\n1:41:51.520 --> 1:41:58.240\n But on that topic, I do think somebody like Vladimir Putin probably knows some stuff.\n\n1:41:58.240 --> 1:41:59.240\n My God.\n\n1:41:59.240 --> 1:42:00.240\n My God.\n\n1:42:00.240 --> 1:42:01.980\n I would love to know what he knows.\n\n1:42:01.980 --> 1:42:06.400\n But then again, you never know because even he is, you know, people think of him as an\n\n1:42:06.400 --> 1:42:12.460\n exceptionally powerful person, but he's also just managing a bunch of tribes.\n\n1:42:12.460 --> 1:42:14.320\n His power is very limited.\n\n1:42:14.320 --> 1:42:21.480\n He's trying to hold together a bunch of greedy, power hungry, mad men.\n\n1:42:21.480 --> 1:42:22.480\n That's right.\n\n1:42:22.480 --> 1:42:23.480\n Okay.\n\n1:42:23.480 --> 1:42:24.580\n And he's trying to establish a balance.\n\n1:42:24.580 --> 1:42:26.060\n He might not know everything.\n\n1:42:26.060 --> 1:42:31.800\n So I hope this changes because I think there's nothing more exciting about.\n\n1:42:31.800 --> 1:42:35.440\n I don't even know if there is a human that knows.\n\n1:42:35.440 --> 1:42:36.440\n You know what I mean?\n\n1:42:36.440 --> 1:42:42.180\n Like this idea that there is some civilization, alien civilization that that land on the White\n\n1:42:42.180 --> 1:42:44.200\n House and say, hi, I come to meet the president.\n\n1:42:44.200 --> 1:42:46.360\n And like, why would they do that?\n\n1:42:46.360 --> 1:42:47.360\n You know what I mean?\n\n1:42:47.360 --> 1:42:48.920\n It's kind of absurd.\n\n1:42:48.920 --> 1:42:49.920\n You know?\n\n1:42:49.920 --> 1:42:56.480\n Well, I do think that actually, I mean, that's one possibility, right, is LART, you know,\n\n1:42:56.480 --> 1:43:01.520\n if an alien civilization really wanted to contact us, I think everybody would know.\n\n1:43:01.520 --> 1:43:08.240\n So I think what we're, if there's any kind of interaction between humans and aliens,\n\n1:43:08.240 --> 1:43:15.320\n I think most likely what we're interacting with is a crappy like probe drone thing that\n\n1:43:15.320 --> 1:43:22.140\n kind of just like, like, it's like this, this dumb thing, you know, we're not interacting\n\n1:43:22.140 --> 1:43:23.140\n with the aliens.\n\n1:43:23.140 --> 1:43:32.120\n I think just like, just like for us, I think humans aren't when we venture out into space.\n\n1:43:32.120 --> 1:43:35.360\n The first thing that's going to meet aliens is our robots.\n\n1:43:35.360 --> 1:43:38.860\n It's not us humans because we keep sending robots out.\n\n1:43:38.860 --> 1:43:43.560\n So they're going to like, they're going to make decisions about humans by looking at\n\n1:43:43.560 --> 1:43:44.560\n the robots.\n\n1:43:44.560 --> 1:43:49.920\n I say the famous grays, the grays, maybe they are robots.\n\n1:43:49.920 --> 1:43:51.480\n Maybe it's all BS too, you know?\n\n1:43:51.480 --> 1:43:52.480\n Yeah.\n\n1:43:52.480 --> 1:43:58.080\n I don't know, I don't know what that interaction actually would look like if aliens really\n\n1:43:58.080 --> 1:44:00.280\n wanted to reach out, really communicate.\n\n1:44:00.280 --> 1:44:02.640\n And I don't know if we're able to actually communicate with them.\n\n1:44:02.640 --> 1:44:03.640\n That's one of the sad things.\n\n1:44:03.640 --> 1:44:09.600\n We may not be able to, that we might, the aliens might already be here and we might\n\n1:44:09.600 --> 1:44:16.040\n just not even know, know how to see them or know how to communicate with them.\n\n1:44:16.040 --> 1:44:24.600\n There's so much misinformation and sometimes there is peoples that are very credible that,\n\n1:44:24.600 --> 1:44:29.240\n that made crazy claims, you know, like, you don't know what to believe, you know, like,\n\n1:44:29.240 --> 1:44:36.420\n like Paul Aylor, the minister of defense of Canada said like some, that there is many\n\n1:44:36.420 --> 1:44:43.560\n alien rays that ever, that's what he said, research it and that scientists from, I think\n\n1:44:43.560 --> 1:44:49.760\n Israel recently have said something about Trump, he was keeping secret or Medvedev,\n\n1:44:49.760 --> 1:44:54.480\n you're from Russia, Medvedev have been caught in a, like during a break in between interviews\n\n1:44:54.480 --> 1:44:57.240\n to talks about like, oh, it's like men in black, so to speak.\n\n1:44:57.240 --> 1:44:58.240\n I don't know.\n\n1:44:58.240 --> 1:45:01.400\n He didn't look like he was joking, but I don't know if he was saying the truth.\n\n1:45:01.400 --> 1:45:02.400\n I didn't know about this.\n\n1:45:02.400 --> 1:45:03.400\n Yeah, you can check on YouTube.\n\n1:45:03.400 --> 1:45:05.560\n It's a, it's, it's, it went, it went viral.\n\n1:45:05.560 --> 1:45:06.560\n Yeah.\n\n1:45:06.560 --> 1:45:11.880\n There's a lot of things like that sometimes I'm like, or, or Bob Lazar, I'm like, imagine\n\n1:45:11.880 --> 1:45:13.880\n if it's true, man.\n\n1:45:13.880 --> 1:45:14.880\n Yeah.\n\n1:45:14.880 --> 1:45:19.920\n Imagine if we're like a fish in the water, we live in our own world and sometimes there's\n\n1:45:19.920 --> 1:45:25.320\n a fisherman that grabbed the fish, take him out of the water and threw it back in the\n\n1:45:25.320 --> 1:45:30.000\n water and the fish goes back to the other fish and say, Hey, there's someone that, that\n\n1:45:30.000 --> 1:45:31.000\n take me out of the water.\n\n1:45:31.000 --> 1:45:33.880\n Then I've seen things that I did not like.\n\n1:45:33.880 --> 1:45:34.880\n Imagine if it's true.\n\n1:45:34.880 --> 1:45:36.840\n Like we like, yeah.\n\n1:45:36.840 --> 1:45:42.600\n And one other thing, like I wanted to ask you because you were consciousness, how about\n\n1:45:42.600 --> 1:45:43.600\n dreams?\n\n1:45:43.600 --> 1:45:44.600\n What is a dream?\n\n1:45:44.600 --> 1:45:45.600\n Yeah.\n\n1:45:45.600 --> 1:45:48.360\n Well, I, I, I more and more, I don't know if you're paying attention to this.\n\n1:45:48.360 --> 1:45:52.400\n There's no, it's become more acceptable in the scientific community to do large scale\n\n1:45:52.400 --> 1:45:56.500\n studies of psychedelics, for example, and there's a lot of connection between psychedelics\n\n1:45:56.500 --> 1:45:57.500\n and dreams.\n\n1:45:57.500 --> 1:45:59.120\n There's very similar states.\n\n1:45:59.120 --> 1:46:04.120\n There's, there's a lot our mind does when it detaches itself from reality that it can\n\n1:46:04.120 --> 1:46:05.880\n just explore a lot of different ideas.\n\n1:46:05.880 --> 1:46:10.840\n It's very possible that dreams is you're traveling somewhere and the same thing with psychedelics.\n\n1:46:10.840 --> 1:46:15.640\n You're traveling somewhere in a different, not traveling to physical space.\n\n1:46:15.640 --> 1:46:17.640\n It's the other dimensions that we're talking about.\n\n1:46:17.640 --> 1:46:22.400\n You're traveling some other through some other dimension to meet some other creature.\n\n1:46:22.400 --> 1:46:24.520\n People talk with DMT that they meet some elves.\n\n1:46:24.520 --> 1:46:31.480\n I've never done, I I'd like to, I don't know if there's a safe legal way to do it, but\n\n1:46:31.480 --> 1:46:39.480\n they all talk about meeting elves and creatures like entities and like, who are they?\n\n1:46:39.480 --> 1:46:42.040\n What's what is this?\n\n1:46:42.040 --> 1:46:46.480\n Is it because they're high or it's because they're actually meeting something and maybe\n\n1:46:46.480 --> 1:46:47.480\n there's no difference.\n\n1:46:47.480 --> 1:46:52.000\n I mean that who knows exactly and that's takes us right back to us not being able to really\n\n1:46:52.000 --> 1:46:54.480\n understand how our mind works.\n\n1:46:54.480 --> 1:46:58.240\n You know, I work in artificial intelligence.\n\n1:46:58.240 --> 1:47:04.280\n It's clear that we understand so little about intelligence, some basic things about intelligence\n\n1:47:04.280 --> 1:47:09.740\n just at the, at the very sort of basic first principles level.\n\n1:47:09.740 --> 1:47:17.500\n We don't understand what it means to, to reason, to think, to assimilate pieces of knowledge\n\n1:47:17.500 --> 1:47:21.740\n together from the, from the basics to the complex.\n\n1:47:21.740 --> 1:47:22.740\n We don't understand it.\n\n1:47:22.740 --> 1:47:25.200\n We don't understand how the human mind does it.\n\n1:47:25.200 --> 1:47:30.600\n We don't understand how the human mind is able to take incredible waterfall of information\n\n1:47:30.600 --> 1:47:34.420\n and filter cleanly into just like clean.\n\n1:47:34.420 --> 1:47:37.960\n You only see the things that are important and are able to stitch them together and be\n\n1:47:37.960 --> 1:47:40.280\n able to reason about the world.\n\n1:47:40.280 --> 1:47:44.800\n And at the same time have moments of like genius of creativity.\n\n1:47:44.800 --> 1:47:46.320\n Like what is that?\n\n1:47:46.320 --> 1:47:50.480\n That also, you know, people, writers talk about that, that they're, you know, they're\n\n1:47:50.480 --> 1:47:54.160\n almost like communicating with a muse, like where do ideas come from?\n\n1:47:54.160 --> 1:47:56.000\n This is the Joe Rogan philosophy.\n\n1:47:56.000 --> 1:48:01.920\n But I do know that past civilization where a lot of them were based on shamanism.\n\n1:48:01.920 --> 1:48:02.920\n And you know what?\n\n1:48:02.920 --> 1:48:10.220\n I think it's sad is if someone drink alcohol and when he's drunk, he's going to commit\n\n1:48:10.220 --> 1:48:13.360\n like create like, like murders or something.\n\n1:48:13.360 --> 1:48:14.360\n We're going to blame the person.\n\n1:48:14.360 --> 1:48:15.360\n Right?\n\n1:48:15.360 --> 1:48:16.360\n You're going to say that's his fault.\n\n1:48:16.360 --> 1:48:17.960\n It's not the fault of alcohol.\n\n1:48:17.960 --> 1:48:23.880\n However, if someone does psychedelic or any things that is illegal and you do something\n\n1:48:23.880 --> 1:48:28.760\n crazy, now we're going to put the fault on psychedelic.\n\n1:48:28.760 --> 1:48:29.760\n You know what I mean?\n\n1:48:29.760 --> 1:48:36.140\n And perhaps the person itself is the reason why, you know, he's been doing these things,\n\n1:48:36.140 --> 1:48:37.280\n you know what I mean?\n\n1:48:37.280 --> 1:48:43.520\n So yeah, it's fascinating how like society, you know, like in Canada, they just legalize\n\n1:48:43.520 --> 1:48:44.520\n marijuana.\n\n1:48:44.520 --> 1:48:45.520\n Oh yeah?\n\n1:48:45.520 --> 1:48:46.520\n Yeah.\n\n1:48:46.520 --> 1:48:47.520\n Marijuana is legal.\n\n1:48:47.520 --> 1:48:51.680\n But before that, before they did it, like if you talk, for example, to my dad, my dad\n\n1:48:51.680 --> 1:48:56.920\n is against it, like, because the whole mentality is like, it's drug, it's bad.\n\n1:48:56.920 --> 1:48:59.440\n But drinking a glass, you know, drinking a beer, it's fine.\n\n1:48:59.440 --> 1:49:02.580\n I mean, what is, you know what I mean?\n\n1:49:02.580 --> 1:49:03.580\n What is good?\n\n1:49:03.580 --> 1:49:04.580\n What is bad?\n\n1:49:04.580 --> 1:49:09.920\n And I guess eating chocolate could be bad as well for your health or, I mean, I'm going\n\n1:49:09.920 --> 1:49:12.560\n to the extreme now, but what is good?\n\n1:49:12.560 --> 1:49:13.560\n What is bad?\n\n1:49:13.560 --> 1:49:20.400\n If you use it for recreation, you use it for an experience, to learn about yourself, it's\n\n1:49:20.400 --> 1:49:26.880\n a, the line is very tiny, you know, there's some countries that drugs are all legals,\n\n1:49:26.880 --> 1:49:27.880\n you know what I mean?\n\n1:49:27.880 --> 1:49:35.320\n And I don't know the stats, but I would be interesting to know if they have more crimes\n\n1:49:35.320 --> 1:49:39.000\n there than other countries where it's more strict.\n\n1:49:39.000 --> 1:49:41.280\n I would be interesting to know about that.\n\n1:49:41.280 --> 1:49:43.000\n It's fascinating to me, you know?\n\n1:49:43.000 --> 1:49:44.000\n Yeah.\n\n1:49:44.000 --> 1:49:47.520\n And I mean, we humans kind of just come up with arbitrary lines of what's good, what's\n\n1:49:47.520 --> 1:49:53.280\n bad that applies with drugs, that applies with anything, that applies with animals,\n\n1:49:53.280 --> 1:49:54.280\n for example.\n\n1:49:54.280 --> 1:49:56.560\n We talked about carnivore diet.\n\n1:49:56.560 --> 1:50:02.880\n Maybe the time we live in now will be remembered for the cruelty to animals, for example.\n\n1:50:02.880 --> 1:50:11.560\n And I believe this, the 21st century will be remembered for our cruelty to robots.\n\n1:50:11.560 --> 1:50:19.000\n That eventually there'll be a civil rights movement for robots where the ones who choose\n\n1:50:19.000 --> 1:50:25.080\n to be conscious, the ones who have consciousness will say, we deserve rights too.\n\n1:50:25.080 --> 1:50:28.120\n We deserve to be treated with respect too.\n\n1:50:28.120 --> 1:50:30.840\n How about the people we put in jail?\n\n1:50:30.840 --> 1:50:31.840\n People put in jail.\n\n1:50:31.840 --> 1:50:38.680\n I mean, I think in the future we'll look back and we'll think of ourselves being stupid,\n\n1:50:38.680 --> 1:50:45.400\n you know, to put people in jail instead of, you know, like trying to fix the problem at\n\n1:50:45.400 --> 1:50:46.400\n the base, you know?\n\n1:50:46.400 --> 1:50:52.160\n Of course now we're, or I guess it's our ignorance that made it in a way that we cannot sometimes\n\n1:50:52.160 --> 1:50:58.440\n understand what makes sometime a psychopath, a psychopath or a murderer, a murderer, but\n\n1:50:58.440 --> 1:51:03.760\n you know, if we can pinpoint the problem and take care of it before, you know what I mean?\n\n1:51:03.760 --> 1:51:09.400\n Or made it in a way that we can reestablish that person in the society.\n\n1:51:09.400 --> 1:51:12.680\n You know, who knows, you know, what was the future's hold.\n\n1:51:12.680 --> 1:51:13.680\n It's interesting.\n\n1:51:13.680 --> 1:51:15.800\n We live in an interesting time.\n\n1:51:15.800 --> 1:51:17.840\n You mentioned your father.\n\n1:51:17.840 --> 1:51:20.360\n What have you learned from your dad?\n\n1:51:20.360 --> 1:51:22.700\n You mentioned he was an important part of your childhood.\n\n1:51:22.700 --> 1:51:25.160\n My dad is amazing.\n\n1:51:25.160 --> 1:51:29.060\n I grew up, we didn't have a lot of money, but it doesn't mean if I'm born in a nice\n\n1:51:29.060 --> 1:51:33.320\n country that always nice thing happened, you know?\n\n1:51:33.320 --> 1:51:40.440\n My dad for me is a big role model because I see him through to my life facing a lot\n\n1:51:40.440 --> 1:51:41.440\n of adversity.\n\n1:51:41.440 --> 1:51:48.680\n You know, he stopped drinking when I was a teenager, he was an alcoholic and I seen him\n\n1:51:48.680 --> 1:51:58.280\n struggle through that, you know, and it was very, very hard and I've seen him work like\n\n1:51:58.280 --> 1:52:05.240\n crazy hours, like come leave in the morning, come home at night, burned out because of\n\n1:52:05.240 --> 1:52:15.040\n work through almost all his life to the point that it became a slave of the system.\n\n1:52:15.040 --> 1:52:21.160\n It became an habit and a normal way of living and it made me realize that I have learned\n\n1:52:21.160 --> 1:52:23.340\n a lot through my father.\n\n1:52:23.340 --> 1:52:28.360\n He taught me perseverance, hard work, you know, when you face adversity, you know, to\n\n1:52:28.360 --> 1:52:36.760\n never give up until you achieve it, but also he taught me a lesson that in a way that I\n\n1:52:36.760 --> 1:52:43.360\n don't want to be like him, even if he is happy, it's because I realized I don't think he knows\n\n1:52:43.360 --> 1:52:44.360\n anything else.\n\n1:52:44.360 --> 1:52:50.320\n Like he works through all his life and I don't want to live to work.\n\n1:52:50.320 --> 1:52:54.080\n I want to work for, you know what I mean, I want to decide when I work, you know, I\n\n1:52:54.080 --> 1:53:00.240\n feel like like he lived to work instead of working for a living.\n\n1:53:00.240 --> 1:53:06.680\n And perhaps it's because he did not have choice, he was the older of his family, they were\n\n1:53:06.680 --> 1:53:12.240\n nine kids, his dad, my grandfather died when he was young, so he had to become the father\n\n1:53:12.240 --> 1:53:16.520\n of the family and work to put money on the table.\n\n1:53:16.520 --> 1:53:24.800\n So perhaps that's what made him that way and it became like an habit for him.\n\n1:53:24.800 --> 1:53:30.040\n My dad taught me when I was at school, I was bullied at school, he's the first one who\n\n1:53:30.040 --> 1:53:32.140\n initiate me to martial art.\n\n1:53:32.140 --> 1:53:37.120\n He taught me karate, my dad was a black belt in Kyokushin karate as well.\n\n1:53:37.120 --> 1:53:43.000\n But because he was working too much, he didn't have time to teach me and I needed self defense\n\n1:53:43.000 --> 1:53:46.360\n in order to defend myself.\n\n1:53:46.360 --> 1:53:55.200\n I have a winning, a great career in mixed martial art, but in the school yard, my record\n\n1:53:55.200 --> 1:53:57.880\n is not very good.\n\n1:53:57.880 --> 1:54:05.440\n When you're a kid and you're about seven, eight years old and you're facing bullied\n\n1:54:05.440 --> 1:54:13.360\n bullies that are two to three years older than yourself, it's not the same thing than\n\n1:54:13.360 --> 1:54:15.520\n when you're 25 and the guy is 28.\n\n1:54:15.520 --> 1:54:21.540\n So there was a big discrepancy in terms of maturity.\n\n1:54:21.540 --> 1:54:29.180\n So my dad taught me, introduced me to karate, then he didn't have time to teach me.\n\n1:54:29.180 --> 1:54:37.440\n Then he put me in a school with a teacher, it was Jean Couture.\n\n1:54:37.440 --> 1:54:44.560\n And I grew up with a lot of anger and there were two persons I was afraid growing up.\n\n1:54:44.560 --> 1:54:49.360\n It was my dad, my dad was very severe, very strict with me.\n\n1:54:49.360 --> 1:54:53.760\n And I'm glad he was because I could have become very bad.\n\n1:54:53.760 --> 1:54:57.240\n I could have become chosen on a different path.\n\n1:54:57.240 --> 1:55:02.320\n People see me as a nice guy and I am a nice guy, I try to be a good role model, but I\n\n1:55:02.320 --> 1:55:06.520\n could easily have turned towards a wrong path.\n\n1:55:06.520 --> 1:55:08.000\n There's darkness somewhere in there.\n\n1:55:08.000 --> 1:55:09.560\n Yes, there are a lot.\n\n1:55:09.560 --> 1:55:19.480\n And a lot of my friends have chosen that path and unfortunately they are not with me today.\n\n1:55:19.480 --> 1:55:25.140\n Even if I'm from Canada and Canada seems like the nicest country in the world, like I said,\n\n1:55:25.140 --> 1:55:30.380\n even if you live in a nice country, it's not always a nice thing, it depends on the situation.\n\n1:55:30.380 --> 1:55:32.220\n But that's what my dad taught me.\n\n1:55:32.220 --> 1:55:41.440\n And he gave me that because I'm very good at learning by observing people and by observing\n\n1:55:41.440 --> 1:55:47.520\n him I see the struggle he had with alcoholism and what he did, the pain sometimes that he\n\n1:55:47.520 --> 1:55:50.800\n inflicted to us, to my family.\n\n1:55:50.800 --> 1:55:59.520\n But how he turned, he did a 180 degree and I really admire that.\n\n1:55:59.520 --> 1:56:05.480\n And I know it was very, very hard for him and he did it and for me that's a great role\n\n1:56:05.480 --> 1:56:07.240\n model for me.\n\n1:56:07.240 --> 1:56:13.720\n So with your dad being an engine of basically hard work and you finding a balance of being\n\n1:56:13.720 --> 1:56:19.280\n able to work your ass off, but also to be able to enjoy a piece of chocolate, what is\n\n1:56:19.280 --> 1:56:24.440\n a perfect day in the life of George St. Pierre look like?\n\n1:56:24.440 --> 1:56:30.320\n So like if you were to go through a day that's very productive, but also one that makes you\n\n1:56:30.320 --> 1:56:34.320\n sit back and enjoy and say that was a good day, what's that look like?\n\n1:56:34.320 --> 1:56:36.080\n What are we talking about?\n\n1:56:36.080 --> 1:56:37.080\n When do you wake up?\n\n1:56:37.080 --> 1:56:38.080\n What do you eat?\n\n1:56:38.080 --> 1:56:39.440\n What do you do?\n\n1:56:39.440 --> 1:56:41.160\n It changed over the years.\n\n1:56:41.160 --> 1:56:42.960\n When I was younger, I have a good day.\n\n1:56:42.960 --> 1:56:47.640\n It was like a good training session or, you know, achieving good thing in my training,\n\n1:56:47.640 --> 1:56:52.880\n you know, and that's why I was very good at it because when I, I was obsessed, you know,\n\n1:56:52.880 --> 1:56:56.360\n I think to be good at something, you need to become obsessed.\n\n1:56:56.360 --> 1:57:03.940\n And to me, performing in my training was everything, you know, like when I had a bad training session,\n\n1:57:03.940 --> 1:57:08.880\n I didn't tell my training partner, I was acting like a, like because of my ego, I didn't,\n\n1:57:08.880 --> 1:57:13.800\n you know, I didn't tell nobody, I was like, Hey, then I go in the locker room and like,\n\n1:57:13.800 --> 1:57:20.840\n man, then I'm playing the, the, the, the training in my mind and I'm saying, okay, I should\n\n1:57:20.840 --> 1:57:23.680\n have done this, should have done that, and it haunt me.\n\n1:57:23.680 --> 1:57:25.040\n It haunt me, man.\n\n1:57:25.040 --> 1:57:31.800\n It's a training and it haunt me until the next training session when I can redeem myself.\n\n1:57:31.800 --> 1:57:33.640\n That's how it is.\n\n1:57:33.640 --> 1:57:42.280\n When we used to train in, in all together, back in the day in Canada, we had David Loiseau,\n\n1:57:42.280 --> 1:57:49.840\n we had Patrick Côté, we had Dennis Kang, Steve Vignot, Jonathan Goulet, there was all\n\n1:57:49.840 --> 1:57:55.600\n like the best guy in Canada that were training with each other before we were training in\n\n1:57:55.600 --> 1:57:56.600\n different gyms.\n\n1:57:56.600 --> 1:58:02.960\n But once a week, I made it in a way that I contact everybody that we all join force and\n\n1:58:02.960 --> 1:58:06.320\n we exchange ideas and we train with each other.\n\n1:58:06.320 --> 1:58:09.200\n So a friendly, I would say friendly competition.\n\n1:58:09.200 --> 1:58:14.440\n It was not malicious, but it was hard training, you know, like not, our goal was to improve,\n\n1:58:14.440 --> 1:58:17.960\n you know, but it wasn't very competitive.\n\n1:58:17.960 --> 1:58:23.000\n And when that day you used to get out of the training session with a bad performance for\n\n1:58:23.000 --> 1:58:29.440\n me, it used to haunt me until the following week when I could give it back and perform\n\n1:58:29.440 --> 1:58:33.200\n better with the guy that I had the most trouble with.\n\n1:58:33.200 --> 1:58:34.580\n That's how it was.\n\n1:58:34.580 --> 1:58:41.040\n And that's how you get better, you know, but, but it was not a training where we were trying\n\n1:58:41.040 --> 1:58:43.400\n to do malicious thing to one another.\n\n1:58:43.400 --> 1:58:45.040\n You know what I mean?\n\n1:58:45.040 --> 1:58:49.440\n You need to be playful, but playful, but competitive.\n\n1:58:49.440 --> 1:58:53.800\n That when I had a good training session, because the sparring was on a Friday, I had the best\n\n1:58:53.800 --> 1:58:54.800\n weekend in the world.\n\n1:58:54.800 --> 1:58:57.840\n I was going out with my friend, drinking and partying and have fun.\n\n1:58:57.840 --> 1:59:05.920\n That that was, that was my, my, my, my ideal day back in the day.\n\n1:59:05.920 --> 1:59:06.920\n Today has changed.\n\n1:59:06.920 --> 1:59:09.640\n You know, my, my, my, my life has changed.\n\n1:59:09.640 --> 1:59:17.500\n You know, like I, I am not the same person I used to be when I got, went on my knees\n\n1:59:17.500 --> 1:59:20.040\n and beg the UFC for title shot.\n\n1:59:20.040 --> 1:59:21.040\n You know what I mean?\n\n1:59:21.040 --> 1:59:25.440\n I am a, I'm wealthy, I'm healthy.\n\n1:59:25.440 --> 1:59:28.200\n Most importantly, that's the most important thing.\n\n1:59:28.200 --> 1:59:35.320\n And as, and I'm going to tell you the truth, as good as my career was, man, my private\n\n1:59:35.320 --> 1:59:39.960\n life, man, is a million times better, man.\n\n1:59:39.960 --> 1:59:45.400\n I, and, and people ask me sometimes they always wonder, they, they try to ask me and it's\n\n1:59:45.400 --> 1:59:46.400\n normal.\n\n1:59:46.400 --> 1:59:54.160\n It's a lot of people is curious and the reporter and in the sport of mixed martial art, we\n\n1:59:54.160 --> 1:59:58.920\n say we play basketball, we play soccer, but you don't play fighting.\n\n1:59:58.920 --> 2:00:04.280\n So when you expose your private life, we seen that happen in the fight with sometime Conor\n\n2:00:04.280 --> 2:00:09.640\n McGregor and Khabib, your competitor knows that he cannot get to you.\n\n2:00:09.640 --> 2:00:13.680\n So what he will do, he will try to get to someone that you love.\n\n2:00:13.680 --> 2:00:16.440\n So may I never expose my, my private life.\n\n2:00:16.440 --> 2:00:21.480\n I never post Instagram of my family or my stuff.\n\n2:00:21.480 --> 2:00:26.920\n That's the reason why, because I'm in a, I'm in a business of fighting and people know\n\n2:00:26.920 --> 2:00:29.720\n that they cannot get to me.\n\n2:00:29.720 --> 2:00:37.640\n And I believe because I was bullied when I was young, I didn't realize that when I was\n\n2:00:37.640 --> 2:00:44.560\n young, but it helps me deal with the mental warfare that I need, that I had to face later\n\n2:00:44.560 --> 2:00:48.520\n on in my life and mixed martial art, because it's a very egotistic sport.\n\n2:00:48.520 --> 2:00:54.140\n And there's a lot of, a lot and a lot of intimidation.\n\n2:00:54.140 --> 2:00:57.520\n And I was used to, I've been used to this thing when I was young.\n\n2:00:57.520 --> 2:01:05.600\n So it does not get to me, however, the good way to get to me, go, go, go, go try to get\n\n2:01:05.600 --> 2:01:09.800\n to someone I love now, man, I'm going to go crazy.\n\n2:01:09.800 --> 2:01:11.280\n You know what I mean?\n\n2:01:11.280 --> 2:01:12.280\n And I'm aware of that.\n\n2:01:12.280 --> 2:01:18.800\n So in order to protect myself, I always, because I'm aware I'm a public person.\n\n2:01:18.800 --> 2:01:22.880\n So I try to always keep my surrounding like in the private.\n\n2:01:22.880 --> 2:01:31.120\n You know, one of the ways that like your friend and mine, Joe Rogan has been an inspiration\n\n2:01:31.120 --> 2:01:35.960\n that he's got like an incredible family and he, for the most part, it started to change\n\n2:01:35.960 --> 2:01:36.960\n recently.\n\n2:01:36.960 --> 2:01:39.160\n Actually, it's kind of interesting, but for the most part, throughout his life, he kept\n\n2:01:39.160 --> 2:01:41.160\n it pretty secret.\n\n2:01:41.160 --> 2:01:44.300\n Doesn't talk about it in his, he's a comedian, comedians talk about everything.\n\n2:01:44.300 --> 2:01:46.600\n He doesn't really talk about it.\n\n2:01:46.600 --> 2:01:48.320\n And there's something to that.\n\n2:01:48.320 --> 2:01:52.160\n It like preserves the magic of the silence of the private life.\n\n2:01:52.160 --> 2:01:57.040\n And I think it can affect the development of the kid.\n\n2:01:57.040 --> 2:02:04.360\n If the kid grow up being, oh, he's the son of that guy instead of being his own person.\n\n2:02:04.360 --> 2:02:06.200\n You know what I mean?\n\n2:02:06.200 --> 2:02:08.760\n So for me, it's very important.\n\n2:02:08.760 --> 2:02:11.800\n Like my parents are older, it's fine.\n\n2:02:11.800 --> 2:02:13.820\n But it taught me a big lesson.\n\n2:02:13.820 --> 2:02:18.560\n When I'm with my friend at the dinner or anything, I talk with person, always share a thing.\n\n2:02:18.560 --> 2:02:23.160\n But when I'm talking, I'm aware of the audience where I'm in front.\n\n2:02:23.160 --> 2:02:24.160\n Yeah.\n\n2:02:24.160 --> 2:02:26.480\n And I mean, but oftentimes those people are just incredible.\n\n2:02:26.480 --> 2:02:31.720\n It kind of makes me sad that, you know, there's a lot of people that love you, right?\n\n2:02:31.720 --> 2:02:35.600\n And there are a lot of really incredible people and you'll never get to really know their\n\n2:02:35.600 --> 2:02:36.600\n story.\n\n2:02:36.600 --> 2:02:38.720\n I mean, I don't know, for me, it makes me sad.\n\n2:02:38.720 --> 2:02:40.520\n You see them like at airports and stuff.\n\n2:02:40.520 --> 2:02:44.200\n People will tell me they listen to this podcast or something like that.\n\n2:02:44.200 --> 2:02:46.240\n And I could tell they're incredible people.\n\n2:02:46.240 --> 2:02:50.280\n It makes me it's like a little goodbye of a possible friend.\n\n2:02:50.280 --> 2:02:51.280\n I don't know.\n\n2:02:51.280 --> 2:02:52.280\n It makes me sad.\n\n2:02:52.280 --> 2:02:53.280\n All right.\n\n2:02:53.280 --> 2:02:55.320\n It makes me it's lonely.\n\n2:02:55.320 --> 2:02:57.980\n It's almost like celebrity is a lonely thing.\n\n2:02:57.980 --> 2:03:02.360\n So the higher the celebrity, the more lonely you become in some kind of way.\n\n2:03:02.360 --> 2:03:06.880\n But of course, you have that little gem of a private life where you can personally, I\n\n2:03:06.880 --> 2:03:14.540\n believe every relationship I like, I don't like to use this term, but it's always a give\n\n2:03:14.540 --> 2:03:20.880\n and take relationship, you know, like you can gain something and the person like it\n\n2:03:20.880 --> 2:03:26.560\n could be something like not materialist materialistic, like something always a good, confident like\n\n2:03:26.560 --> 2:03:30.640\n someone that can give me good advice or.\n\n2:03:30.640 --> 2:03:35.800\n It's a word I would say, like extensional, like if a pilot as a copilot is the copilot\n\n2:03:35.800 --> 2:03:40.280\n is extent as an extensional relationship with him, you know, so he knows if he gets sick\n\n2:03:40.280 --> 2:03:45.360\n or faint, he's there to make sure, you know, he's there to help.\n\n2:03:45.360 --> 2:03:50.600\n And I think in every relation it's about compatibility, but it's about extensionality, right?\n\n2:03:50.600 --> 2:03:56.800\n In a way that if that person is extensional and sometimes we talk about about love, you\n\n2:03:56.800 --> 2:04:01.440\n know, like sometimes I think is it is it a BS word or not?\n\n2:04:01.440 --> 2:04:08.080\n Because I myself sometimes look at I look at myself in the mirror and when I do stupid\n\n2:04:08.080 --> 2:04:12.140\n thing, sometimes I love myself a lot and sometimes I don't.\n\n2:04:12.140 --> 2:04:13.620\n You know what I mean?\n\n2:04:13.620 --> 2:04:17.320\n Because I'm angry at myself, I've done stupid thing.\n\n2:04:17.320 --> 2:04:20.360\n So that means sometimes you could love could be fluctuating.\n\n2:04:20.360 --> 2:04:21.360\n You know what I mean?\n\n2:04:21.360 --> 2:04:22.880\n How about in relationships?\n\n2:04:22.880 --> 2:04:26.360\n Sometimes people, they say, oh, they love each other, but then when they divorce, they\n\n2:04:26.360 --> 2:04:30.240\n go, oh, I want the house and the dog and the kids stay with me.\n\n2:04:30.240 --> 2:04:32.040\n And you know what I mean?\n\n2:04:32.040 --> 2:04:38.920\n If you love, by definition, if you really love someone and let's say you're an old man\n\n2:04:38.920 --> 2:04:43.200\n and you love a woman and she decides to leave you for a younger man, if you really love\n\n2:04:43.200 --> 2:04:47.540\n her, you're going to help her pack and leave.\n\n2:04:47.540 --> 2:04:51.680\n But in our society, sometimes we want to hone something.\n\n2:04:51.680 --> 2:04:57.520\n To me, love includes the missing somebody, the losing somebody, the anger at somebody.\n\n2:04:57.520 --> 2:05:00.440\n It's all the passion, feelings towards somebody.\n\n2:05:00.440 --> 2:05:01.440\n That's all love.\n\n2:05:01.440 --> 2:05:03.440\n I, you know, it's all part of the thing.\n\n2:05:03.440 --> 2:05:05.440\n It's the ups and downs.\n\n2:05:05.440 --> 2:05:13.040\n It's the sad thing is when the feelings towards a person, the ups and downs go away, the forgetting.\n\n2:05:13.040 --> 2:05:14.200\n That's the opposite of love.\n\n2:05:14.200 --> 2:05:16.160\n So the opposite of love isn't hate.\n\n2:05:16.160 --> 2:05:19.520\n To me, the opposite of love is forgetting.\n\n2:05:19.520 --> 2:05:23.340\n And that's a much bigger, that's the depth of human connection.\n\n2:05:23.340 --> 2:05:25.000\n That's how I see love.\n\n2:05:25.000 --> 2:05:30.780\n Sometimes I try to stay positive and I've been asked how I try to, because I have the\n\n2:05:30.780 --> 2:05:33.200\n image of someone who's positive.\n\n2:05:33.200 --> 2:05:36.120\n But I go through my own demon as well sometimes.\n\n2:05:36.120 --> 2:05:46.380\n However, when we talk about love, when I was young, you know, like, I didn't love who I\n\n2:05:46.380 --> 2:05:47.380\n was at first.\n\n2:05:47.380 --> 2:05:51.360\n That's how I love, I learned to kind of love myself.\n\n2:05:51.360 --> 2:05:57.360\n Like I didn't, when I was going to bullying, I was, I believe I was bullied because I didn't\n\n2:05:57.360 --> 2:06:03.960\n love myself because I project a very bad image of what I think of myself.\n\n2:06:03.960 --> 2:06:06.000\n I was a kid that lacked a lot of confidence.\n\n2:06:06.000 --> 2:06:08.360\n I was looking down when I was walking.\n\n2:06:08.360 --> 2:06:10.320\n I shrugged my shoulder.\n\n2:06:10.320 --> 2:06:14.120\n When someone was talking to me, I was avoiding eye contact.\n\n2:06:14.120 --> 2:06:17.520\n So I was a very easy target for bullies.\n\n2:06:17.520 --> 2:06:22.700\n And I think bullies are like a predatory animal in nature.\n\n2:06:22.700 --> 2:06:25.520\n They will hunt the easier prey.\n\n2:06:25.520 --> 2:06:30.040\n They don't go, the lion don't go for the alpha bull.\n\n2:06:30.040 --> 2:06:33.720\n They go for the one who's old or who's sick, the weakest one.\n\n2:06:33.720 --> 2:06:36.680\n And bullies are the same in society, I believe.\n\n2:06:36.680 --> 2:06:42.880\n And I didn't like to be bullied, of course, but I didn't like the person that I was.\n\n2:06:42.880 --> 2:06:53.040\n But I found out through martial art, the respect and my coach was extraordinary to me.\n\n2:06:53.040 --> 2:06:56.600\n He taught me discipline and self strength.\n\n2:06:56.600 --> 2:07:03.080\n And I found out that I needed to, in order to love myself, I needed to change myself.\n\n2:07:03.080 --> 2:07:07.040\n Because I didn't, when I looked at myself in the mirror, I didn't like what I saw.\n\n2:07:07.040 --> 2:07:12.680\n So I decided to become like someone that I would love.\n\n2:07:12.680 --> 2:07:23.600\n So I tried to look people straight up and try to showcase a more confident image that\n\n2:07:23.600 --> 2:07:24.600\n I had.\n\n2:07:24.600 --> 2:07:29.640\n And it was hard in the beginning because I didn't really believe in it, but I fake it\n\n2:07:29.640 --> 2:07:31.720\n until kind of I make it.\n\n2:07:31.720 --> 2:07:37.640\n So when I was walking at school, more and more I was learning how to become more confident\n\n2:07:37.640 --> 2:07:40.560\n and I was like taking charge.\n\n2:07:40.560 --> 2:07:44.520\n The teacher was asking questions, at first I was never answering, I was like this, waiting\n\n2:07:44.520 --> 2:07:45.920\n always to be the last.\n\n2:07:45.920 --> 2:07:49.640\n Then I was, hey, I know what the answer, this is the answer.\n\n2:07:49.640 --> 2:07:55.460\n I got out of my comfort zone, so to speak.\n\n2:07:55.460 --> 2:08:01.720\n And I wish I would tell you that I got out of bullying because a Hollywood story, I used\n\n2:08:01.720 --> 2:08:04.120\n martial art to beat up all the bullies.\n\n2:08:04.120 --> 2:08:06.060\n But it's not how it happened to me.\n\n2:08:06.060 --> 2:08:11.000\n It happened because I changed myself from the inside out.\n\n2:08:11.000 --> 2:08:18.160\n And I learned how to, because I didn't love myself in the beginning, I learned how to\n\n2:08:18.160 --> 2:08:21.200\n become like someone that I love.\n\n2:08:21.200 --> 2:08:28.600\n And even now, like I'm by no mean perfect, I do a lot of stupid things, but I learn as\n\n2:08:28.600 --> 2:08:29.600\n a person.\n\n2:08:29.600 --> 2:08:34.320\n And even I do as something stupid, I'm like, shoot, I did something stupid.\n\n2:08:34.320 --> 2:08:39.680\n At least I can apologize to the person if I realize, and then I know that I'm not the\n\n2:08:39.680 --> 2:08:45.280\n person I was in the past, I'm the person that I am right now.\n\n2:08:45.280 --> 2:08:49.960\n So I can learn and become that image of the person that I love.\n\n2:08:49.960 --> 2:08:55.640\n So in a way, the reason I'm trying to be positive and I'm able to stay positive sometime in\n\n2:08:55.640 --> 2:09:03.340\n life is because I'm always trying to be like that person that I love.\n\n2:09:03.340 --> 2:09:07.320\n And I think if you don't look yourself in the mirror and don't love yourself or don't\n\n2:09:07.320 --> 2:09:12.080\n see any positive future for yourself, how can you change your environment if you cannot\n\n2:09:12.080 --> 2:09:13.080\n change yourself?\n\n2:09:13.080 --> 2:09:14.340\n You know what I mean?\n\n2:09:14.340 --> 2:09:18.960\n You will never be happy if you're not happy when you look at yourself in the mirror.\n\n2:09:18.960 --> 2:09:22.560\n So change yourself first, then change, you know, it's not the environment that's going\n\n2:09:22.560 --> 2:09:24.120\n to change for yourself.\n\n2:09:24.120 --> 2:09:29.520\n You have to go from the inside out, you know.\n\n2:09:29.520 --> 2:09:30.720\n This I learned through martial art.\n\n2:09:30.720 --> 2:09:38.240\n I had a coach who was incredible, used to drill these ideas in my head and give me confidence,\n\n2:09:38.240 --> 2:09:44.200\n you know, like this, telling me all these beautiful things about myself and how he's\n\n2:09:44.200 --> 2:09:46.720\n dead now, unfortunately, peace to him.\n\n2:09:46.720 --> 2:09:49.400\n But he was incredible, incredible.\n\n2:09:49.400 --> 2:09:50.480\n He was very, very strict.\n\n2:09:50.480 --> 2:09:51.480\n I was afraid of him.\n\n2:09:51.480 --> 2:09:53.680\n I was afraid of my dad and afraid of him.\n\n2:09:53.680 --> 2:09:58.560\n He couldn't teach nowadays like he used to teach me because he would be probably in jail,\n\n2:09:58.560 --> 2:09:59.680\n you know.\n\n2:09:59.680 --> 2:10:04.960\n But I'm glad he did it because for the time being, that's what I needed.\n\n2:10:04.960 --> 2:10:10.800\n And I would never have had the career I had in mixed martial art without this because\n\n2:10:10.800 --> 2:10:15.400\n I would never have got out of my comfort zone, would have been impossible.\n\n2:10:15.400 --> 2:10:19.480\n And in order to improve in life, you need to get out of your comfort zone.\n\n2:10:19.480 --> 2:10:22.480\n It's hard, very hard to do.\n\n2:10:22.480 --> 2:10:28.160\n And strive to be the person that you can love, that's beautifully put, George.\n\n2:10:28.160 --> 2:10:34.520\n If you were to give advice to a young person today about life, what would you tell him?\n\n2:10:34.520 --> 2:10:47.920\n If he takes life with the same mentality that I do, if he has the same taste of things that\n\n2:10:47.920 --> 2:10:58.020\n I have, I would tell him, you know, for sport, for life in general, I would say, if you will\n\n2:10:58.020 --> 2:11:08.920\n have a dream, you know, like make everything in your power and work very hard, you know,\n\n2:11:08.920 --> 2:11:18.120\n never take no for an answer and go through hell in order to achieve it.\n\n2:11:18.120 --> 2:11:23.200\n Don't work hard only, but work smart.\n\n2:11:23.200 --> 2:11:27.520\n That's I think the problems with a lot of people, they work hard, they can work hard,\n\n2:11:27.520 --> 2:11:30.400\n they burden themselves, they don't work smart.\n\n2:11:30.400 --> 2:11:38.520\n Whether it is in science and business, they make bad choices or they're badly informed\n\n2:11:38.520 --> 2:11:39.520\n in sport.\n\n2:11:39.520 --> 2:11:47.000\n How many guys I've seen ruin their career in the gym, they spar so hard, they ruin themselves\n\n2:11:47.000 --> 2:11:51.000\n in the gyms, they leave their career in the gyms.\n\n2:11:51.000 --> 2:11:55.360\n What I would say to, for example, because my field of expertise, it's in sport of mixed\n\n2:11:55.360 --> 2:12:05.760\n martial art, I would say to a young kid, make your training playful.\n\n2:12:05.760 --> 2:12:14.080\n You know, when you get ready for competition, you need to train to recreate those elements\n\n2:12:14.080 --> 2:12:18.120\n that makes you go outside of your comfort zone.\n\n2:12:18.120 --> 2:12:23.260\n But in everyday life in general, make your training playful.\n\n2:12:23.260 --> 2:12:29.120\n What makes it like a hardcore competition about who's winning, who's losing, make it\n\n2:12:29.120 --> 2:12:30.120\n playful.\n\n2:12:30.120 --> 2:12:39.560\n So it will increase your, because you will not be afraid of getting hurt or losing.\n\n2:12:39.560 --> 2:12:49.440\n You will be tempted to try more things and it will make you become more creative.\n\n2:12:49.440 --> 2:12:53.200\n You know, that brings up another question about learning.\n\n2:12:53.200 --> 2:13:00.780\n So you value knowledge and you're exceptional at basically being very good at learning and\n\n2:13:00.780 --> 2:13:05.500\n figuring stuff out, new things or going deeper on the things you already know.\n\n2:13:05.500 --> 2:13:10.260\n So what advice would you have for how to learn effectively?\n\n2:13:10.260 --> 2:13:16.080\n How you say work smart, how do you figure this game out?\n\n2:13:16.080 --> 2:13:23.560\n I believe the best way to learn is learning from other people's mistake.\n\n2:13:23.560 --> 2:13:30.480\n However, I'm not perfect and I've learned from my mistakes as well.\n\n2:13:30.480 --> 2:13:37.960\n And sometimes it took me a few mistakes to learn the same thing.\n\n2:13:37.960 --> 2:13:44.600\n But especially in the sport of mixed martial art, because we're talking about the failure\n\n2:13:44.600 --> 2:13:51.600\n could have very serious outcome on someone's life and wellbeing.\n\n2:13:51.600 --> 2:13:56.280\n So it's crucial to trying to learn from other people's mistakes.\n\n2:13:56.280 --> 2:13:59.080\n Do you study others?\n\n2:13:59.080 --> 2:14:09.120\n Every fight I'm studying my opponent and I've studied myself as well to know how my strength\n\n2:14:09.120 --> 2:14:17.920\n mix versus my opponent weaknesses and how can I make the fight go in a way that I'm\n\n2:14:17.920 --> 2:14:22.020\n taking my opponent outside of his comfort zone.\n\n2:14:22.020 --> 2:14:25.960\n Very often people are good at studying their opponent, but they're not good at looking\n\n2:14:25.960 --> 2:14:31.400\n at themselves in the mirror and knowing what they should do in order to maximize their\n\n2:14:31.400 --> 2:14:34.360\n odds of success, right?\n\n2:14:34.360 --> 2:14:42.120\n That's why I always thought for me, it was important to not be the best at one thing,\n\n2:14:42.120 --> 2:14:47.120\n but be very good at everything.\n\n2:14:47.120 --> 2:14:54.240\n That's why I always seek advice, advices from the best in every discipline.\n\n2:14:54.240 --> 2:15:02.400\n I wrestle with the best wrestler I could be with, I box with the best boxers, I practice\n\n2:15:02.400 --> 2:15:05.000\n karate with the best karate fighters.\n\n2:15:05.000 --> 2:15:06.000\n Same thing in Jiu Jitsu.\n\n2:15:06.000 --> 2:15:09.800\n I train Jiu Jitsu with the best Jiu Jitsu guys.\n\n2:15:09.800 --> 2:15:19.220\n However, when I mix everything and mix martial art, because I'm very competent in every area.\n\n2:15:19.220 --> 2:15:27.700\n So when I'm fighting someone, I'm very good at identifying where is the less competent.\n\n2:15:27.700 --> 2:15:33.280\n And I know for a fact that because I'm competent everywhere, if I can bring the fight where\n\n2:15:33.280 --> 2:15:36.920\n he's outside of his comfort zone, it increased my odds of winning.\n\n2:15:36.920 --> 2:15:38.500\n There is no certainty.\n\n2:15:38.500 --> 2:15:43.320\n It's all about odds, I believe, because there is always X factor that you do not control.\n\n2:15:43.320 --> 2:15:48.920\n Yeah, it's fascinating to see you actually, because you've been a student of movement.\n\n2:15:48.920 --> 2:15:53.120\n You've been exploring all kinds of, I mean, gymnastics, all that kind of stuff.\n\n2:15:53.120 --> 2:15:59.120\n There's something reminiscent to, like Conor McGregor is one other martial artist that's\n\n2:15:59.120 --> 2:16:03.320\n kind of explored movement, been a scholar of movement.\n\n2:16:03.320 --> 2:16:09.000\n At least from my perspective, it's very sort of Bruce Lee like, it's almost making a study\n\n2:16:09.000 --> 2:16:12.440\n of the human body and all the possible things you can do.\n\n2:16:12.440 --> 2:16:15.820\n Is there a philosophy behind that, that you have?\n\n2:16:15.820 --> 2:16:20.800\n You talk about Bruce Lee, man, you said it best.\n\n2:16:20.800 --> 2:16:23.680\n He changes my life too.\n\n2:16:23.680 --> 2:16:25.160\n He was ahead of his time.\n\n2:16:25.160 --> 2:16:26.160\n Yeah.\n\n2:16:26.160 --> 2:16:27.160\n Incredible.\n\n2:16:27.160 --> 2:16:30.280\n A lot of people talk to me and ask me, hey, is Bruce Lee would have been able to fight\n\n2:16:30.280 --> 2:16:33.280\n in UFC?\n\n2:16:33.280 --> 2:16:34.960\n I don't think so.\n\n2:16:34.960 --> 2:16:36.320\n I don't know.\n\n2:16:36.320 --> 2:16:38.820\n I think he was a martial artist.\n\n2:16:38.820 --> 2:16:43.400\n He could have defended himself, but to say that he could have competed amongst the elite\n\n2:16:43.400 --> 2:16:48.360\n of the elite fighter, perhaps in his time, but for sure, if you put him in UFC right\n\n2:16:48.360 --> 2:16:55.200\n now, the sport has improved incredibly since then.\n\n2:16:55.200 --> 2:17:00.320\n But in terms of philosophy, Bruce, he was amazing.\n\n2:17:00.320 --> 2:17:04.640\n One thing that just to prove that he was ahead of his time, he was talking about using your\n\n2:17:04.640 --> 2:17:08.080\n longest weapon against your opponent nearest point.\n\n2:17:08.080 --> 2:17:17.220\n And we see that kick, it got popularized by John Jones, the sidekick to the tie, his longest\n\n2:17:17.220 --> 2:17:20.360\n weapon against your nearest point in boxing is the jab.\n\n2:17:20.360 --> 2:17:26.680\n But in MMA, when you can use it, all your weapon, that's the kick to the tie.\n\n2:17:26.680 --> 2:17:32.520\n And there is, I felt there is like kind of three dimension in martial art.\n\n2:17:32.520 --> 2:17:34.960\n There is the philosopher, like Bruce Lee.\n\n2:17:34.960 --> 2:17:40.880\n There is the choreography, the choreographed people, like for example, you see in movies\n\n2:17:40.880 --> 2:17:42.240\n that stun people.\n\n2:17:42.240 --> 2:17:43.240\n They're incredible.\n\n2:17:43.240 --> 2:17:49.240\n Or the one that does like forms and karate, like jumping, spin kick, back kick, like acrobatic\n\n2:17:49.240 --> 2:17:50.600\n stuff, mixed martial art.\n\n2:17:50.600 --> 2:17:52.360\n They are unbelievable.\n\n2:17:52.360 --> 2:17:57.240\n And there is also the one that competes in fighting.\n\n2:17:57.240 --> 2:17:58.240\n That's what I do.\n\n2:17:58.240 --> 2:18:01.120\n I personally specialize in.\n\n2:18:01.120 --> 2:18:03.160\n Well, you also do the philosophy.\n\n2:18:03.160 --> 2:18:07.960\n I do a little bit of philosophy, but that's the consequence of the fighting.\n\n2:18:07.960 --> 2:18:14.800\n I guess we are all like we all practice the three dimension because martial art is I would\n\n2:18:14.800 --> 2:18:20.240\n say it's whether you want it or not, you have to touch these three dimensions.\n\n2:18:20.240 --> 2:18:21.920\n But you will specialize in one.\n\n2:18:21.920 --> 2:18:29.020\n I specialize through my life in fighting like the real thing in terms of fighting, competition.\n\n2:18:29.020 --> 2:18:32.600\n Of course, if you do martial art, you'll be able to defend yourself because it's a self\n\n2:18:32.600 --> 2:18:33.600\n defense.\n\n2:18:33.600 --> 2:18:39.280\n However, you might not be able to fight as an elite and the most prestigious organization.\n\n2:18:39.280 --> 2:18:44.880\n And you might not be able to perform the stunt that, for example, the stuntman I've done\n\n2:18:44.880 --> 2:18:50.840\n in the series I was playing in the Falcon and Winter Soldier, these guys are incredible.\n\n2:18:50.840 --> 2:18:52.920\n They're like real life superhero.\n\n2:18:52.920 --> 2:18:57.420\n Things they do, to me, like it's fascinating.\n\n2:18:57.420 --> 2:18:58.640\n It's amazing.\n\n2:18:58.640 --> 2:19:01.160\n And also Bruce Lee, the philosophy.\n\n2:19:01.160 --> 2:19:08.040\n How many hours he took like thinking about these stuff, you know, I'm sure he did not\n\n2:19:08.040 --> 2:19:16.120\n just came out of nowhere, you know, like he was thinking that's mean he slept on this.\n\n2:19:16.120 --> 2:19:17.120\n How many hours?\n\n2:19:17.120 --> 2:19:18.120\n It's just unbelievable.\n\n2:19:18.120 --> 2:19:19.400\n He's like water, my friend.\n\n2:19:19.400 --> 2:19:24.360\n How many times has he thought about water going to bed before he said that?\n\n2:19:24.360 --> 2:19:27.880\n Well, let me ask a very important fundamental question about martial arts.\n\n2:19:27.880 --> 2:19:30.880\n We're both wearing a suit and tie.\n\n2:19:30.880 --> 2:19:35.000\n Joe Rogan thinks that wearing a tie is a huge disadvantage.\n\n2:19:35.000 --> 2:19:37.200\n Is it a clip on or is it an actual tie?\n\n2:19:37.200 --> 2:19:39.860\n It's an actual tie, I really want it.\n\n2:19:39.860 --> 2:19:47.600\n So do you agree or disagree with Joe Rogan that wearing a tie is a martial arts significant\n\n2:19:47.600 --> 2:19:51.680\n disadvantage in terms of combat, in a combat scenario?\n\n2:19:51.680 --> 2:19:53.920\n In a fight, I think it would be a disadvantage.\n\n2:19:53.920 --> 2:19:54.920\n Yes.\n\n2:19:54.920 --> 2:19:55.920\n Okay.\n\n2:19:55.920 --> 2:20:02.800\n I work as a security bouncer in nightclubs and event when I was 18 years old.\n\n2:20:02.800 --> 2:20:09.280\n And sometime I had to work in certain event that I was in suit and tie.\n\n2:20:09.280 --> 2:20:17.120\n I never had to use my force to take someone out when I was in suit and tie.\n\n2:20:17.120 --> 2:20:22.560\n But if I would have had to before going to the table to physically take the guy out,\n\n2:20:22.560 --> 2:20:26.800\n I would have removed my tie and I would have removed my vest for sure.\n\n2:20:26.800 --> 2:20:29.320\n And I would have called back up for sure.\n\n2:20:29.320 --> 2:20:36.240\n And I would have probably used the element of surprise to be first on the guy.\n\n2:20:36.240 --> 2:20:41.960\n When you're in a bar, same thing, you call back up first and you make sure you ask the\n\n2:20:41.960 --> 2:20:46.040\n waitress before to clean the table before you go.\n\n2:20:46.040 --> 2:20:49.960\n And when you go, you have to use the element of surprise.\n\n2:20:49.960 --> 2:20:54.200\n Because fighting, fighting in mixed martial arts and fighting in the street, it's two\n\n2:20:54.200 --> 2:20:56.000\n different things.\n\n2:20:56.000 --> 2:21:00.200\n And yes, I'm a mixed martial arts competitor.\n\n2:21:00.200 --> 2:21:01.280\n That's what I've done all my life.\n\n2:21:01.280 --> 2:21:04.640\n But I had a lot of street fight in my life, a lot when I was in...\n\n2:21:04.640 --> 2:21:05.640\n What's the difference?\n\n2:21:05.640 --> 2:21:06.640\n What's like the...\n\n2:21:06.640 --> 2:21:07.640\n Oh my God.\n\n2:21:07.640 --> 2:21:08.640\n It's a huge difference.\n\n2:21:08.640 --> 2:21:16.000\n There is guys that if I would have a choice, you know, to fight, like, for example, certain\n\n2:21:16.000 --> 2:21:20.800\n guys in UFC in a street fight and fight like other guys that are not in UFC, I would maybe\n\n2:21:20.800 --> 2:21:24.600\n sometimes pick guys that are not in UFC, not necessarily.\n\n2:21:24.600 --> 2:21:28.360\n Because in a street fight, there's no referee that says go.\n\n2:21:28.360 --> 2:21:29.700\n It's the element of surprise.\n\n2:21:29.700 --> 2:21:33.020\n And when you're a nice guy, you're not the aggressor.\n\n2:21:33.020 --> 2:21:35.340\n You always have the element of surprise.\n\n2:21:35.340 --> 2:21:36.340\n That's what it taught me.\n\n2:21:36.340 --> 2:21:37.340\n Oh, interesting.\n\n2:21:37.340 --> 2:21:38.340\n Yes.\n\n2:21:38.340 --> 2:21:45.420\n Because if the person will not come punch you without warning, it needs to, it needs\n\n2:21:45.420 --> 2:21:46.640\n to trigger some...\n\n2:21:46.640 --> 2:21:49.340\n It's something that needs to be triggered before.\n\n2:21:49.340 --> 2:21:54.320\n So if someone comes because he's looking for trouble, there is a sign that he's looking\n\n2:21:54.320 --> 2:21:56.020\n for trouble.\n\n2:21:56.020 --> 2:22:00.000\n So I was just talking with Bas Rutten this weekend about it.\n\n2:22:00.000 --> 2:22:01.360\n I saw that.\n\n2:22:01.360 --> 2:22:04.360\n Every martial art comes from...\n\n2:22:04.360 --> 2:22:11.340\n Like some martial art are from Exclusivik for competition, like sport karate, like certain\n\n2:22:11.340 --> 2:22:12.620\n martial art.\n\n2:22:12.620 --> 2:22:17.980\n But traditional martial art are for the street, are for self defense.\n\n2:22:17.980 --> 2:22:21.040\n And I start my background in Kyokushinkarate, so it's for...\n\n2:22:21.040 --> 2:22:22.320\n And I did Japanese Jiu Jitsu.\n\n2:22:22.320 --> 2:22:27.280\n So my background, before I even start training for mixed martial art, my background is in\n\n2:22:27.280 --> 2:22:30.040\n self defense.\n\n2:22:30.040 --> 2:22:33.960\n And it's very important to understand that in a street fight, the element of surprise\n\n2:22:33.960 --> 2:22:34.960\n is everything.\n\n2:22:34.960 --> 2:22:35.960\n And there are no rules.\n\n2:22:35.960 --> 2:22:39.200\n You can go for the eyes, the necks, the...\n\n2:22:39.200 --> 2:22:40.200\n It surprises everything.\n\n2:22:40.200 --> 2:22:43.040\n Total, total ballgame, you know what I mean?\n\n2:22:43.040 --> 2:22:48.220\n You have the chair, the beard, there's so much more thing going on.\n\n2:22:48.220 --> 2:22:50.120\n So the idea of...\n\n2:22:50.120 --> 2:22:52.880\n Because you are a UFC fighter, you think you're invincible.\n\n2:22:52.880 --> 2:22:55.160\n This is BS.\n\n2:22:55.160 --> 2:22:56.160\n Anybody can come.\n\n2:22:56.160 --> 2:23:00.000\n Like if a big guy who punch very hard, most people don't know how to punch.\n\n2:23:00.000 --> 2:23:02.800\n By the way, they don't know how to make a fist and throw it in a forward direction.\n\n2:23:02.800 --> 2:23:06.380\n But if someone knows how to do it, I don't care who you are.\n\n2:23:06.380 --> 2:23:10.880\n If you could be Francis and Genu, someone come behind your head and bang.\n\n2:23:10.880 --> 2:23:14.640\n Or let's say there's an argument and you get surprised by a punch.\n\n2:23:14.640 --> 2:23:17.920\n You can be drop and lose a fight, that doesn't matter.\n\n2:23:17.920 --> 2:23:20.160\n The element of surprise is everything.\n\n2:23:20.160 --> 2:23:25.400\n So you were saying remove all the sources of the elements of surprise, clear the bar,\n\n2:23:25.400 --> 2:23:26.400\n remove the tie.\n\n2:23:26.400 --> 2:23:30.800\n I still disagree with you about the tie.\n\n2:23:30.800 --> 2:23:38.280\n Just for your information, if someone comes looking for trouble and you see me do this\n\n2:23:38.280 --> 2:23:43.320\n and going sideways a little bit, that's my position that I'm thinking maybe something\n\n2:23:43.320 --> 2:23:52.440\n will happen and I'm about to punch you or to do something to take care of this situation.\n\n2:23:52.440 --> 2:23:58.320\n To flip the table on you then, wearing a tie is communicating the nice guy image.\n\n2:23:58.320 --> 2:24:03.160\n So it actually gives you the freedom for more elements of surprise by wearing the tie.\n\n2:24:03.160 --> 2:24:09.400\n If you take it off, you're limiting your options because nobody's going to expect the guy in\n\n2:24:09.400 --> 2:24:10.840\n the tie to do anything.\n\n2:24:10.840 --> 2:24:19.080\n I'm a big believer that sometimes it's not only materialism, it's what you project.\n\n2:24:19.080 --> 2:24:24.760\n Let's say I had troubles in a bar and I was able to deflect, the guy was looking for trouble\n\n2:24:24.760 --> 2:24:30.040\n talking to me and I was able to deflect his whole aggressivity by saying like, hey, man,\n\n2:24:30.040 --> 2:24:31.040\n that's a nice shirt.\n\n2:24:31.040 --> 2:24:32.520\n Where did you get it?\n\n2:24:32.520 --> 2:24:38.160\n Like saying like something or stupid like this, then it kind of breaks the momentum\n\n2:24:38.160 --> 2:24:40.960\n and he, you know, but the guy was looking for trouble.\n\n2:24:40.960 --> 2:24:42.520\n I don't want to fight you.\n\n2:24:42.520 --> 2:24:48.400\n I don't want to fight you, but I'm not going to wait until you pull, you make the first\n\n2:24:48.400 --> 2:24:54.360\n move because the minute you touch me, you push me or you touch me, you declare war and\n\n2:24:54.360 --> 2:25:00.280\n the war is unleashed, my friend, and I'm taking you out of order with the necessary force,\n\n2:25:00.280 --> 2:25:01.280\n of course.\n\n2:25:01.280 --> 2:25:02.280\n You know what I mean?\n\n2:25:02.280 --> 2:25:05.100\n That's the thing with martial art.\n\n2:25:05.100 --> 2:25:09.520\n If you use the necessary force to take care of the problem, it's okay.\n\n2:25:09.520 --> 2:25:13.860\n But if you, you know, you take advantage of it, that's when it's not all right because\n\n2:25:13.860 --> 2:25:15.280\n it's a weapon.\n\n2:25:15.280 --> 2:25:22.940\n So if someone comes up to me, that's my position and now I'm assessing the situation, you know,\n\n2:25:22.940 --> 2:25:25.120\n that's how they teach in self defense here.\n\n2:25:25.120 --> 2:25:26.120\n Never put your hands down.\n\n2:25:26.120 --> 2:25:33.120\n Always hand there because I'm down or boom, like what this is, this is very important\n\n2:25:33.120 --> 2:25:38.280\n and you never, you always your center line on the side like this.\n\n2:25:38.280 --> 2:25:42.280\n If someone knows martial art, he will recognize that pattern.\n\n2:25:42.280 --> 2:25:46.720\n But if you go like, if someone talked to you and you go like this, that's mean you're telling\n\n2:25:46.720 --> 2:25:47.900\n the guy that you want to fight.\n\n2:25:47.900 --> 2:25:48.900\n You don't want to do that.\n\n2:25:48.900 --> 2:25:55.400\n You don't want to, oh yeah, you know, that's, that's the position because your hands are\n\n2:25:55.400 --> 2:25:57.520\n here, you know, whatever you can do, you're here.\n\n2:25:57.520 --> 2:26:01.280\n Well, also your ear tells a story.\n\n2:26:01.280 --> 2:26:05.240\n It's not everybody that knows that, however, it's some people might think that it's my\n\n2:26:05.240 --> 2:26:09.400\n mom grabbed me by the ear and pulled me because I didn't listen to her, you know.\n\n2:26:09.400 --> 2:26:15.040\n A real fight in the street and a fight in mixed martial art is a different ball game.\n\n2:26:15.040 --> 2:26:19.040\n What do you think is the best martial art to prepare you for street fighting?\n\n2:26:19.040 --> 2:26:24.360\n You know, people often kind of have this discussion of Jiu Jitsu, maybe boxing, maybe wrestling.\n\n2:26:24.360 --> 2:26:29.160\n Do you think, when you talk about a young person studying martial arts to prepare themselves?\n\n2:26:29.160 --> 2:26:35.500\n For a street fight, it's often much different than a mixed martial art fight.\n\n2:26:35.500 --> 2:26:40.040\n And I know there is a lot of BS in the world of martial art, like self defense stuff that\n\n2:26:40.040 --> 2:26:50.360\n like, but I believe self defense is very important in a way to understand the situation, to understand\n\n2:26:50.360 --> 2:26:57.920\n those situations that might occur, how to deal with it.\n\n2:26:57.920 --> 2:27:04.540\n Because not necessarily that we talk about the technicality, we talk about the tacticality,\n\n2:27:04.540 --> 2:27:09.520\n the tactics, you know, like when I'm talking to you about the element of surprise is important.\n\n2:27:09.520 --> 2:27:15.760\n This is not technique, technique is a punch or techniques that I physically will use to\n\n2:27:15.760 --> 2:27:20.280\n enable my opponent, my aggressor.\n\n2:27:20.280 --> 2:27:24.240\n Tactic is the tactic I'm telling you about is in a street fight, if someone is looking\n\n2:27:24.240 --> 2:27:28.760\n for trouble and I feel the heat rising as the conversation goes, that's the position\n\n2:27:28.760 --> 2:27:32.320\n I'm going to take and I have to be first.\n\n2:27:32.320 --> 2:27:34.700\n I cannot let him go first.\n\n2:27:34.700 --> 2:27:36.660\n So I have to strike first or do something.\n\n2:27:36.660 --> 2:27:45.040\n This is the first thing that generally I have to agree on.\n\n2:27:45.040 --> 2:27:47.100\n After that, of course, there is the knowledge.\n\n2:27:47.100 --> 2:27:51.580\n If you're a professional fighter, you have a huge advantage.\n\n2:27:51.580 --> 2:27:53.760\n Once the fight is started, the war is declared.\n\n2:27:53.760 --> 2:27:56.040\n Now it's everything goes.\n\n2:27:56.040 --> 2:28:02.160\n But generally speaking, the person that will intervene, that will have the first blow or\n\n2:28:02.160 --> 2:28:08.320\n the first, you know, the first punch will have a huge disadvantage.\n\n2:28:08.320 --> 2:28:12.880\n It's like doing a hundred meter race and having a head start, you know, and that you can't\n\n2:28:12.880 --> 2:28:14.920\n prepare for with any martial arts.\n\n2:28:14.920 --> 2:28:15.920\n Yeah.\n\n2:28:15.920 --> 2:28:17.720\n And if I'm a smart guy, I know how to fight.\n\n2:28:17.720 --> 2:28:23.920\n If a guy like an heavyweight champion comes to me or like, like, like, you know, I know,\n\n2:28:23.920 --> 2:28:32.120\n I know what to do to disable him, like boom or here or the neck, you know, like, and if\n\n2:28:32.120 --> 2:28:33.720\n you blind him, what is he going to do?\n\n2:28:33.720 --> 2:28:34.720\n You know what I mean?\n\n2:28:34.720 --> 2:28:37.880\n So, so or a bottle, you know what I mean?\n\n2:28:37.880 --> 2:28:40.840\n So the element of surprise is it's everything.\n\n2:28:40.840 --> 2:28:45.760\n So that's why it's always, always good to be the nice guy and not looking for trouble.\n\n2:28:45.760 --> 2:28:48.960\n Because if you're not looking for trouble, you have the head start, you have the option\n\n2:28:48.960 --> 2:28:50.580\n of having a head start.\n\n2:28:50.580 --> 2:28:54.440\n So what you're saying is being a nice guy is the best form of self defense, maybe a\n\n2:28:54.440 --> 2:28:55.440\n little humor.\n\n2:28:55.440 --> 2:28:56.440\n Yes.\n\n2:28:56.440 --> 2:29:01.840\n And you know, I have learned that I've learned that when I was a kid, I was about maybe\n\n2:29:01.840 --> 2:29:04.520\n seven or six, six years old.\n\n2:29:04.520 --> 2:29:08.880\n We used to play in Montreal, there's a lot of snow, we used to play king of the mountain.\n\n2:29:08.880 --> 2:29:09.880\n Yeah.\n\n2:29:09.880 --> 2:29:13.540\n That's the first combat lesson that I've learned in my life.\n\n2:29:13.540 --> 2:29:17.160\n And I managed somehow, it was a lot of kids, I managed to get on the top of the mountain\n\n2:29:17.160 --> 2:29:22.160\n and another guy came in, come in on top of the mountain and he was angry that before\n\n2:29:22.160 --> 2:29:24.760\n I was there before him.\n\n2:29:24.760 --> 2:29:29.140\n When you play king of the mountain, it was a mountain of snow.\n\n2:29:29.140 --> 2:29:32.160\n You don't strike each other, we just wrestle and push.\n\n2:29:32.160 --> 2:29:33.160\n And I managed to be first.\n\n2:29:33.160 --> 2:29:38.960\n And when he came, he says to me, say, OK, you want to, you want to fight?\n\n2:29:38.960 --> 2:29:43.160\n And I said, yeah, I don't know what he means, like I want to fight, I want to wrestle.\n\n2:29:43.160 --> 2:29:45.020\n I say, yes.\n\n2:29:45.020 --> 2:29:46.840\n He punched me right in the face.\n\n2:29:46.840 --> 2:29:47.840\n Boom.\n\n2:29:47.840 --> 2:29:51.320\n And then I and then I fall on the bottom of the mountain.\n\n2:29:51.320 --> 2:29:57.840\n Then when I fall down, I remember that vision in my life because it's I will remember that\n\n2:29:57.840 --> 2:29:59.320\n for the rest of my life.\n\n2:29:59.320 --> 2:30:03.640\n I'm about to stand up and I see the blood coming out of my nose, I see that the snow\n\n2:30:03.640 --> 2:30:06.800\n is red because my nose is bleeding.\n\n2:30:06.800 --> 2:30:11.360\n Now I remember the element of surprises, everything.\n\n2:30:11.360 --> 2:30:13.640\n My first street fight, I lost it.\n\n2:30:13.640 --> 2:30:19.500\n I got I didn't get knocked out, but I got dropped on the bottom of the snow mountain.\n\n2:30:19.500 --> 2:30:25.040\n And I was like, oh, you got me because I wasn't expecting my hand, I was not expecting a punch.\n\n2:30:25.040 --> 2:30:31.400\n So from there, when I felt the heat of an injury, an argument or something was not right,\n\n2:30:31.400 --> 2:30:33.320\n I always stroke first.\n\n2:30:33.320 --> 2:30:39.240\n I didn't win all my fight because sometimes there were more than one guys on me, you know.\n\n2:30:39.240 --> 2:30:43.940\n But I think it's important to not be the aggressor.\n\n2:30:43.940 --> 2:30:47.560\n So you have the element of surprise and always use that in your favor.\n\n2:30:47.560 --> 2:30:48.560\n That's so brilliant.\n\n2:30:48.560 --> 2:30:54.840\n Let me go from the very practical to the most impractically huge question about the meaning\n\n2:30:54.840 --> 2:30:56.000\n of life.\n\n2:30:56.000 --> 2:31:03.160\n You said that when great depths of unrelenting sorrow are punctuated by great peaks of joy\n\n2:31:03.160 --> 2:31:07.740\n and liberation, the result is delicious.\n\n2:31:07.740 --> 2:31:13.840\n So what do you think is the meaning of this whole journey that we're on this life?\n\n2:31:13.840 --> 2:31:16.400\n What makes life delicious?\n\n2:31:16.400 --> 2:31:23.200\n To me, you know, satisfaction is the M for me.\n\n2:31:23.200 --> 2:31:30.160\n Like I always, if I'm satisfied, that means I have nothing to live for.\n\n2:31:30.160 --> 2:31:33.680\n I'm not talking only about my career, I'm talking about my life.\n\n2:31:33.680 --> 2:31:35.400\n What do you want in your life?\n\n2:31:35.400 --> 2:31:37.960\n You want kids, you want a family, you want to be champion.\n\n2:31:37.960 --> 2:31:38.960\n What do you want in your life?\n\n2:31:38.960 --> 2:31:45.000\n You have like a long term goal, short term goal.\n\n2:31:45.000 --> 2:31:48.520\n In mixed martial arts, I achieve what I needed to achieve.\n\n2:31:48.520 --> 2:31:50.400\n I'm satisfied.\n\n2:31:50.400 --> 2:31:54.440\n I'm no longer the same George St. Pierre than when I was begging for a title shot on my\n\n2:31:54.440 --> 2:31:55.760\n knees.\n\n2:31:55.760 --> 2:31:59.320\n I move on from it.\n\n2:31:59.320 --> 2:32:02.400\n Now I had a chance to go into movies.\n\n2:32:02.400 --> 2:32:14.040\n Now that same insane drive that I had to be the champion in the world, now I put it into\n\n2:32:14.040 --> 2:32:15.040\n acting.\n\n2:32:15.040 --> 2:32:20.480\n Like I'm having a lot of acting class now and luckily for me, the timing was amazing.\n\n2:32:20.480 --> 2:32:26.480\n I got cast for the Falcon and the Winter Soldier that is on Disney Plus channel.\n\n2:32:26.480 --> 2:32:34.840\n It's a huge, huge project to be part of for me because it's like you play basketball,\n\n2:32:34.840 --> 2:32:37.080\n you have a chance to go for the NBA right away.\n\n2:32:37.080 --> 2:32:38.760\n I was very lucky.\n\n2:32:38.760 --> 2:32:41.360\n The timing was just too perfect.\n\n2:32:41.360 --> 2:32:48.160\n And so you need to constantly challenging yourself and having goals to achieve, you\n\n2:32:48.160 --> 2:32:49.160\n know, like that.\n\n2:32:49.160 --> 2:32:53.920\n Keep your brain activated, like keep working.\n\n2:32:53.920 --> 2:33:00.720\n And the proof of that is that you see sometimes some old people, like when they retire, very\n\n2:33:00.720 --> 2:33:08.040\n often sometime you see that they got sick and they die or because they it's either because\n\n2:33:08.040 --> 2:33:18.720\n sometimes we think we we certainly may benefit, we do something good for them by making that\n\n2:33:18.720 --> 2:33:20.200\n work and giving them a break.\n\n2:33:20.200 --> 2:33:23.880\n So in our mind, we're like, oh, he's going to be able to relax.\n\n2:33:23.880 --> 2:33:26.960\n But in their mind, it's not good because they're not busy.\n\n2:33:26.960 --> 2:33:28.080\n They have nothing to live for.\n\n2:33:28.080 --> 2:33:32.920\n Like my dad is used to work all the time and he has always something to do.\n\n2:33:32.920 --> 2:33:34.880\n He's retired now.\n\n2:33:34.880 --> 2:33:39.440\n I myself now call him by force to find him some job.\n\n2:33:39.440 --> 2:33:42.480\n Hey, dad, can you come in my house?\n\n2:33:42.480 --> 2:33:44.040\n Have this thing to repair?\n\n2:33:44.040 --> 2:33:45.040\n I don't know how to do it.\n\n2:33:45.040 --> 2:33:50.040\n So it gives him it gives him a reason not to live on because he has other things to\n\n2:33:50.040 --> 2:33:51.040\n do.\n\n2:33:51.040 --> 2:33:58.040\n But but what I mean is also in life, I think you always don't be afraid to aim high.\n\n2:33:58.040 --> 2:34:03.560\n Don't don't be afraid to fix your objective very high and never be able to reach it.\n\n2:34:03.560 --> 2:34:06.000\n Be afraid of reaching your goals, essentially.\n\n2:34:06.000 --> 2:34:08.320\n I mean, you always have to keep moving it out.\n\n2:34:08.320 --> 2:34:13.040\n You think there's a it's an interesting question because you've been acting in some really\n\n2:34:13.040 --> 2:34:14.680\n exciting things.\n\n2:34:14.680 --> 2:34:21.580\n Do you think there's a dramatic role where it's basically, you know, you go full Robert\n\n2:34:21.580 --> 2:34:24.600\n De Niro in Taxi Driver?\n\n2:34:24.600 --> 2:34:28.080\n Do you think there'll be a full length feature film with George St. Pierre?\n\n2:34:28.080 --> 2:34:31.880\n I liken there is level to this thing.\n\n2:34:31.880 --> 2:34:35.720\n Am I aware that I have to restart as a white belt white belt?\n\n2:34:35.720 --> 2:34:38.480\n And for some people, it could be discouraging.\n\n2:34:38.480 --> 2:34:39.760\n But for me, man, it's great.\n\n2:34:39.760 --> 2:34:40.960\n I love it.\n\n2:34:40.960 --> 2:34:41.960\n I freaking love it.\n\n2:34:41.960 --> 2:34:47.460\n I embrace it because everybody told me like I would never be able to do it and it's fine.\n\n2:34:47.460 --> 2:34:55.200\n But the and also the outcome of a failure in the sport of mixed martial art is much\n\n2:34:55.200 --> 2:35:01.680\n more serious than the outcome of a failure for a movie, for example, for for if you think\n\n2:35:01.680 --> 2:35:05.480\n when you should zag in a fight, you get knocked out if you zig when you should zag and on\n\n2:35:05.480 --> 2:35:06.480\n set.\n\n2:35:06.480 --> 2:35:07.480\n Oh, cut.\n\n2:35:07.480 --> 2:35:09.080\n We'll do it again.\n\n2:35:09.080 --> 2:35:18.240\n And I know that I will be most likely be to chosen for action martial art roles because\n\n2:35:18.240 --> 2:35:19.960\n that's my background.\n\n2:35:19.960 --> 2:35:24.840\n There's this new trend in Hollywood now when they want someone to play an Italian guy,\n\n2:35:24.840 --> 2:35:27.960\n they're going to choose a real Italian person.\n\n2:35:27.960 --> 2:35:31.200\n When they want someone to play a Russian guy, they're going to choose someone who has a\n\n2:35:31.200 --> 2:35:33.320\n real Russian background.\n\n2:35:33.320 --> 2:35:36.600\n Now they want a real martial art fighter.\n\n2:35:36.600 --> 2:35:38.240\n I've done fighting all my life.\n\n2:35:38.240 --> 2:35:41.440\n I just need to improve my acting skill.\n\n2:35:41.440 --> 2:35:46.200\n But when I train in acting, I get myself out of my comfort zone.\n\n2:35:46.200 --> 2:35:48.400\n I'm not playing a role of a martial art guy.\n\n2:35:48.400 --> 2:35:52.600\n I'm playing like romance, comedy, drama.\n\n2:35:52.600 --> 2:36:00.320\n So when I go on set and playing the role of a badass martial art guy, it's it's easier.\n\n2:36:00.320 --> 2:36:07.080\n So like in training for a fight, I always make my preparation harder than the actual\n\n2:36:07.080 --> 2:36:08.640\n task.\n\n2:36:08.640 --> 2:36:13.040\n I would love to see where I don't know if you've seen the wrestler with Mickey Rourke.\n\n2:36:13.040 --> 2:36:14.040\n Oh, yeah.\n\n2:36:14.040 --> 2:36:15.040\n Those types of films.\n\n2:36:15.040 --> 2:36:19.400\n I would love to I would love to you do something like that.\n\n2:36:19.400 --> 2:36:23.920\n If not now, then in 10, 20 years, I could see that that would be amazing.\n\n2:36:23.920 --> 2:36:25.480\n It's levels to the game, right?\n\n2:36:25.480 --> 2:36:26.480\n Yes, it's gradual.\n\n2:36:26.480 --> 2:36:31.080\n And I don't and I'm aware that I don't want to take something on my shoulder that I won't\n\n2:36:31.080 --> 2:36:32.600\n be able to deliver.\n\n2:36:32.600 --> 2:36:35.440\n It's like a fighter wants to go for a title shot right away.\n\n2:36:35.440 --> 2:36:41.360\n It could very well break him, you know, and I don't want to do that because I know I've\n\n2:36:41.360 --> 2:36:47.360\n done some gigs in the past, but I was not focusing on it because I was focusing on competing\n\n2:36:47.360 --> 2:36:52.080\n as a martial art martial artist in competition in MMA.\n\n2:36:52.080 --> 2:36:53.680\n But now I take it very seriously.\n\n2:36:53.680 --> 2:36:57.040\n So I cannot do the same mistake again because I've done some stuff.\n\n2:36:57.040 --> 2:37:00.160\n I've done it for the money and it was good.\n\n2:37:00.160 --> 2:37:04.540\n It was fun to be beat up by Jacque Van Damme, Steven Seagal and everything.\n\n2:37:04.540 --> 2:37:08.660\n But my acting was not on point, you know, at that time.\n\n2:37:08.660 --> 2:37:14.040\n So if I ever every time I'm going to come back from now on, on screen, you need to be\n\n2:37:14.040 --> 2:37:16.360\n sharp because you cannot mess it up.\n\n2:37:16.360 --> 2:37:19.440\n If you mess it up, it's like a loss on your record.\n\n2:37:19.440 --> 2:37:21.400\n You're not taken seriously.\n\n2:37:21.400 --> 2:37:23.280\n So so that's how I see it.\n\n2:37:23.280 --> 2:37:29.960\n And it's very fun because I had a chance to talk to a lot of guys on top of all the class\n\n2:37:29.960 --> 2:37:31.520\n that I'm having.\n\n2:37:31.520 --> 2:37:36.040\n Like a few days ago, I was with Danny Trujo.\n\n2:37:36.040 --> 2:37:41.040\n And I always seek the advice of actors when I when I see some of them that because I really\n\n2:37:41.040 --> 2:37:44.120\n admire how they do, you know, how they project their emotion.\n\n2:37:44.120 --> 2:37:48.960\n And I asked him, Danny Trujo, I said, I said to him, he's an amazing guy, by the way.\n\n2:37:48.960 --> 2:37:50.460\n Very nice guy.\n\n2:37:50.460 --> 2:37:55.440\n And I asked him, I say, how how do you do to be?\n\n2:37:55.440 --> 2:37:57.800\n Because you scared the hell out of me.\n\n2:37:57.800 --> 2:38:00.900\n How do you do to be so scary?\n\n2:38:00.900 --> 2:38:03.000\n Like what is your trick?\n\n2:38:03.000 --> 2:38:08.000\n And he tells me, he's like, George, if you're threatening, if you're threatening someone\n\n2:38:08.000 --> 2:38:12.320\n and you scream at him, I'm going to kill you.\n\n2:38:12.320 --> 2:38:19.880\n It's not as scary if you're smiling and you say, I'm going to kill you like and he says\n\n2:38:19.880 --> 2:38:26.600\n also to me that another advice he gave me is like when you say this, think about you\n\n2:38:26.600 --> 2:38:31.160\n killing him for real, that how you hate him and how you're going to kill him.\n\n2:38:31.160 --> 2:38:35.200\n So the camera will take the emotion out.\n\n2:38:35.200 --> 2:38:36.960\n Don't try physically to do that.\n\n2:38:36.960 --> 2:38:38.800\n That's the mistake I used to do before.\n\n2:38:38.800 --> 2:38:44.240\n I used to physically show that I'm strong and angry and to be mean.\n\n2:38:44.240 --> 2:38:49.920\n So these are just an example of tricks that I learned sometimes when I met an actor.\n\n2:38:49.920 --> 2:38:53.260\n I always try to learn from everybody that I met in my life.\n\n2:38:53.260 --> 2:38:57.120\n It's a difficult journey because then you have to go to some dark places as a person\n\n2:38:57.120 --> 2:39:01.360\n because you really have to imagine imagine some dark things.\n\n2:39:01.360 --> 2:39:02.720\n It's fascinating, actually.\n\n2:39:02.720 --> 2:39:09.400\n I think a lot of the actors, they have sometimes problems because of that, because now I understand\n\n2:39:09.400 --> 2:39:13.880\n why it's like if you work on your bicep, your bicep will grow.\n\n2:39:13.880 --> 2:39:14.880\n Right.\n\n2:39:14.880 --> 2:39:20.240\n It's because it is the stress that you put on it that will make it grow.\n\n2:39:20.240 --> 2:39:21.240\n Right.\n\n2:39:21.240 --> 2:39:23.240\n Emotions are, I believe, are the same way.\n\n2:39:23.240 --> 2:39:32.200\n If you used to dig inside of you down deep to to to to make your negative emotion, depressive\n\n2:39:32.200 --> 2:39:39.240\n emotion comes out, if something bad in your life happened, you will fall into those emotion\n\n2:39:39.240 --> 2:39:43.480\n much more rapidly than someone who does not that every day.\n\n2:39:43.480 --> 2:39:44.480\n You know what I mean?\n\n2:39:44.480 --> 2:39:45.480\n Because it will.\n\n2:39:45.480 --> 2:39:46.480\n It's like a muscle memory.\n\n2:39:46.480 --> 2:39:51.640\n Like if you program yourself to react a certain way, you will reach that point very often.\n\n2:39:51.640 --> 2:39:56.800\n So that's why sometimes you see some some guys that we often blame it on drugs.\n\n2:39:56.800 --> 2:40:02.200\n But I think it's also because of the acting that I used to be so hot on the hot tub and\n\n2:40:02.200 --> 2:40:07.760\n sometimes they go to the down deep so they they they they they the boat extreme, you\n\n2:40:07.760 --> 2:40:08.760\n know.\n\n2:40:08.760 --> 2:40:09.760\n You got to be psychologically tough.\n\n2:40:09.760 --> 2:40:10.760\n And that's life.\n\n2:40:10.760 --> 2:40:14.280\n So I'm so excited to see you challenge yourself in that direction.\n\n2:40:14.280 --> 2:40:18.260\n That's one thing that I'm a little bit afraid.\n\n2:40:18.260 --> 2:40:19.260\n That happened to me.\n\n2:40:19.260 --> 2:40:26.000\n I really hope I'll always be, you know, like a problem, having a problem to control my\n\n2:40:26.000 --> 2:40:29.040\n emotion be too much extreme.\n\n2:40:29.040 --> 2:40:31.200\n I hope it does not happen to me.\n\n2:40:31.200 --> 2:40:39.800\n And if I feel that I'm going towards that, I'm going to, you know, give up on my new\n\n2:40:39.800 --> 2:40:43.800\n objective and find something else to to achieve.\n\n2:40:43.800 --> 2:40:46.520\n But in your personal life, you want to be real with your emotions.\n\n2:40:46.520 --> 2:40:47.720\n You don't want to.\n\n2:40:47.720 --> 2:40:52.600\n It doesn't, you know, just like with biceps, you don't want biceps that are too big.\n\n2:40:52.600 --> 2:40:56.720\n You are real, but you are extreme real.\n\n2:40:56.720 --> 2:41:02.120\n And that's the that's the that's what I think something that could happen to actors sometimes\n\n2:41:02.120 --> 2:41:04.360\n when they go too much into their emotion.\n\n2:41:04.360 --> 2:41:09.400\n Like we talk about like something guys that that that commit commit suicide, perhaps,\n\n2:41:09.400 --> 2:41:10.400\n you know, I don't know.\n\n2:41:10.400 --> 2:41:15.400\n It's because I don't know their real life, but it could be something that they get so\n\n2:41:15.400 --> 2:41:17.160\n much into their character.\n\n2:41:17.160 --> 2:41:20.840\n I didn't understand it at first because I never had acting class.\n\n2:41:20.840 --> 2:41:25.240\n But after a while that you have acting class, now you start to realize that, yeah, I understand\n\n2:41:25.240 --> 2:41:32.140\n why some actor get caught up in their emotion, because that can have an influence on their\n\n2:41:32.140 --> 2:41:33.140\n life.\n\n2:41:33.140 --> 2:41:34.140\n Right.\n\n2:41:34.140 --> 2:41:36.960\n You're on a fascinating journey, George.\n\n2:41:36.960 --> 2:41:41.040\n I can't tell you how much it means to me that you'll be so nice to me, that you'll give\n\n2:41:41.040 --> 2:41:42.520\n me so much respect.\n\n2:41:42.520 --> 2:41:46.240\n Just that that tells everything I need to know about you as a human being with everything\n\n2:41:46.240 --> 2:41:47.720\n you've accomplished.\n\n2:41:47.720 --> 2:41:53.080\n You waste all your time and you're so nice to me just as a fellow human being, man.\n\n2:41:53.080 --> 2:41:57.660\n I have so much respect from so honored and the energy you give me by just even showing\n\n2:41:57.660 --> 2:41:58.660\n up here.\n\n2:41:58.660 --> 2:42:00.920\n I'll carry that forward for a long time to come, George.\n\n2:42:00.920 --> 2:42:01.920\n I love it.\n\n2:42:01.920 --> 2:42:02.920\n Thank you so much for talking to me.\n\n2:42:02.920 --> 2:42:05.040\n Now, thank you, Lex, for having me on the show.\n\n2:42:05.040 --> 2:42:07.920\n You know, I've been looking to talk to you for a long time.\n\n2:42:07.920 --> 2:42:12.800\n For me, talking to a guy like you, it's it's a great learning experience because I always\n\n2:42:12.800 --> 2:42:13.800\n learn.\n\n2:42:13.800 --> 2:42:16.680\n And it's life is fascinating to me.\n\n2:42:16.680 --> 2:42:21.840\n And all the experience that we have in life, you know, it's something that can make us\n\n2:42:21.840 --> 2:42:22.840\n grow.\n\n2:42:22.840 --> 2:42:26.720\n And this experience for me just, you know, make me grow as as well.\n\n2:42:26.720 --> 2:42:27.720\n You know?\n\n2:42:27.720 --> 2:42:28.720\n Plus, we look pretty damn sharp today.\n\n2:42:28.720 --> 2:42:29.720\n So.\n\n2:42:29.720 --> 2:42:30.720\n Man in black, my friend.\n\n2:42:30.720 --> 2:42:31.720\n Man in black.\n\n2:42:31.720 --> 2:42:32.720\n Thanks, George.\n\n2:42:32.720 --> 2:42:35.320\n Nice.\n\n2:42:35.320 --> 2:42:38.200\n Thanks for listening to this conversation with George St. Pierre.\n\n2:42:38.200 --> 2:42:45.600\n And thank you to Allform, ExpressVPN, Blinkist, Theragun, and The Information.\n\n2:42:45.600 --> 2:42:49.200\n Check them out in the description to support this podcast.\n\n2:42:49.200 --> 2:42:53.640\n And now let me leave you with some words from Miyamoto Musashi.\n\n2:42:53.640 --> 2:42:57.640\n Think lightly of yourself and deeply of the world.\n\n2:42:57.640 --> 2:43:08.920\n Thank you for listening and hope to see you next time.\n\n"
}