{
  "title": "Anthony Pompliano: Bitcoin | Lex Fridman Podcast #171",
  "id": "IHg6ixt3CKc",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.960\n The following is a conversation with Anthony Pompliano, entrepreneur, technology\n\n00:04.960 --> 00:10.480\n investor, prolific writer, podcaster, and Twitter user on topics of finance,\n\n00:10.480 --> 00:13.040\n cryptocurrency, technology, and economics.\n\n00:13.560 --> 00:19.680\n I highly recommend his popular podcast and daily letter called The Pump\n\n00:19.760 --> 00:21.760\n Podcast and The Pump Letter.\n\n00:22.480 --> 00:27.340\n Quick thank you to our sponsors, Theragun Muscle Recovery Device, Sun Basket Meal\n\n00:27.340 --> 00:31.800\n Delivery Service, ExpressVPN, and Indeed Hiring website.\n\n00:32.040 --> 00:34.280\n Click their links to support this podcast.\n\n00:35.200 --> 00:39.600\n As a side note, let me say that I'll be having many conversations in the coming\n\n00:39.600 --> 00:44.240\n months about cryptocurrency with people of all kinds of backgrounds and worldviews.\n\n00:44.960 --> 00:50.080\n Those who are proponents of Bitcoin, like Anthony, Nick Carter, Robert\n\n00:50.080 --> 00:53.040\n Breedlove, Alex Glastine, and many others.\n\n00:53.040 --> 00:57.560\n And those who are proponents of other cryptocurrency technologies, like Vitalik\n\n00:57.560 --> 01:02.360\n Buterin, Charles Hoskinson, Richard Hart, Sergey Nazarov, Silvia\n\n01:02.360 --> 01:04.240\n Macaulay, and many others as well.\n\n01:04.960 --> 01:06.920\n I'm not framing this as a debate.\n\n01:07.200 --> 01:12.680\n I'm simply looking to explore exciting ideas in the space of technologies that\n\n01:12.680 --> 01:18.000\n could very well change human civilization and AGI civilization as well.\n\n01:18.000 --> 01:22.200\n I appreciate that some communities are a bit more intense in their style\n\n01:22.200 --> 01:26.760\n of communication and others, but I personally am only interested in open\n\n01:26.760 --> 01:30.480\n minded, respectful collaboration in exploring ideas.\n\n01:31.200 --> 01:36.640\n I personally try to like to approach conversations by considering that I may\n\n01:36.640 --> 01:40.400\n be wrong about everything and I'm looking to learn.\n\n01:41.200 --> 01:46.560\n I won't engage in groupthink, social signaling, outrage mobs, mocking,\n\n01:46.560 --> 01:50.920\n and derision. If you do, I understand, it's just not my thing.\n\n01:51.560 --> 01:56.800\n I send you my love either way and hope to meet you in person or some drinks, some\n\n01:56.800 --> 01:59.760\n good laughs, and a good conversation one day.\n\n02:00.160 --> 02:04.560\n No matter the difference in style or substance, we're all just human after all.\n\n02:05.120 --> 02:07.680\n This is an amazing ride we're all on together.\n\n02:08.360 --> 02:10.680\n Buy the ticket, take the ride, as Hunter S.\n\n02:10.680 --> 02:15.560\n Thompson said, whether you pay for that ticket with Bitcoin, Ethereum, or\n\n02:15.560 --> 02:21.080\n the dollar, gold, seashells, a beer, or just a good old smile.\n\n02:21.920 --> 02:24.280\n This is the Lex Friedman podcast.\n\n02:24.320 --> 02:28.280\n And here is my conversation with Anthony Pampliano.\n\n02:29.480 --> 02:35.000\n You served in the US Army for six years and spent 13 months in Iraq in 2008 and\n\n02:35.000 --> 02:40.080\n 2009. Can you tell the story of why you joined the army and what were some of\n\n02:40.080 --> 02:43.960\n the moving difficulties, maybe lasting experiences from the time you served?\n\n02:43.960 --> 02:50.200\n Sure. I joined when I was 17 years old, needed my parents to basically sign in\n\n02:50.200 --> 02:55.240\n order to join. And I graduated a semester early from high school and thought I was\n\n02:55.240 --> 02:58.200\n going to go play football in college and kind of enroll in the spring semester.\n\n02:58.200 --> 03:02.440\n And when that didn't happen, basically was working at Chick Fil A and Quiznos.\n\n03:02.440 --> 03:07.400\n And I had in my mind, look, this is probably not the path in life that I want.\n\n03:07.880 --> 03:09.200\n And so I knew I was going to go to college.\n\n03:09.200 --> 03:12.080\n I knew I was going to go play football in the fall, but I had this window of time\n\n03:12.080 --> 03:17.000\n and so I walked into a recruiting office and just basically was like, I'm assuming\n\n03:17.000 --> 03:17.840\n you guys need some help.\n\n03:18.360 --> 03:22.040\n And, uh, you know, they gave me the whole pitch and, uh, you know, give you a signing\n\n03:22.040 --> 03:24.800\n bonus, you can go jump out of planes and go do all this crazy stuff.\n\n03:25.360 --> 03:26.600\n I just said, okay, let's do it.\n\n03:26.640 --> 03:29.360\n This was, this was close to the 9 11.\n\n03:29.400 --> 03:33.520\n This was in 2006, about five years after.\n\n03:33.520 --> 03:36.400\n So what impact, I mean, do you remember 9 11?\n\n03:36.400 --> 03:38.600\n What impact did that have on your thinking about this?\n\n03:38.600 --> 03:42.520\n So I was, uh, in eighth grade, um, if I remember correctly.\n\n03:42.560 --> 03:48.640\n And, uh, I remember, uh, being in school when it happened and, uh, I walked into a\n\n03:48.640 --> 03:54.080\n classroom and the entire class, uh, somebody else's class, they were all talking to the\n\n03:54.080 --> 03:54.720\n teacher about something.\n\n03:54.720 --> 03:57.680\n The second that me and a couple other kids walked in and we got real quiet and the\n\n03:57.680 --> 03:59.360\n teacher was like, Hey, go back to your like, homeroom.\n\n04:00.160 --> 04:02.360\n And so it was just kind of a weird, like what's going on.\n\n04:02.720 --> 04:06.080\n Uh, and then next thing I know, they called all the students into the cafeteria.\n\n04:06.080 --> 04:10.160\n And this is back before, you know, every classroom really had a television in it and,\n\n04:10.160 --> 04:11.680\n you know, cable and all that kind of stuff.\n\n04:12.160 --> 04:14.760\n And so when we were there, they basically just said, listen, there's been this, uh,\n\n04:14.800 --> 04:16.120\n event that's occurred.\n\n04:16.160 --> 04:19.520\n All of your parents are going to come pick you guys up and, uh, they'll explain it to\n\n04:19.520 --> 04:19.800\n you.\n\n04:20.280 --> 04:25.200\n And so to, you know, a kid in eighth grade, you're basically like, what happened?\n\n04:25.280 --> 04:29.080\n And so I got home and, uh, and I remember talking to my dad about it and my dad\n\n04:29.080 --> 04:33.640\n basically gave me, you know, the, uh, the core American kind of talking points.\n\n04:33.640 --> 04:38.240\n Right. Look, somebody from another country came here and tried to kill Americans and\n\n04:38.240 --> 04:39.480\n was successful in doing that.\n\n04:40.000 --> 04:44.440\n Um, and to some extent he just said, and I'm willing to bet, you know, we're going\n\n04:44.440 --> 04:45.240\n to go back after them.\n\n04:45.320 --> 04:48.880\n Did that wake you up a little bit to the idea that there's evil out there that, you\n\n04:48.880 --> 04:53.520\n know, even just the idea of terrorism for many people that was, um, when it hits you\n\n04:53.520 --> 04:59.600\n on your own land, it's a, it really shakes up your mind in some sense, world war two.\n\n04:59.600 --> 05:04.400\n That's why world war two was fundamentally different for Americans than it is for the\n\n05:04.400 --> 05:10.960\n people like in Russia and England and France and, uh, in Europe in general is\n\n05:11.680 --> 05:17.200\n there's something about when there's a families, women, children dying on your own\n\n05:17.200 --> 05:19.240\n land, that's different.\n\n05:19.880 --> 05:24.480\n And that was one of the first times in America where like on your, uh, of course\n\n05:24.480 --> 05:29.880\n it's Pearl Harbor, but like, this is like in recent history, it's like, they hit us\n\n05:29.960 --> 05:33.680\n here, that was like a profound idea.\n\n05:34.000 --> 05:36.720\n I think America was very, very good at exporting the violence\n\n05:36.720 --> 05:38.040\n elsewhere for a long time.\n\n05:38.240 --> 05:43.160\n And, uh, there was this element of, uh, complacency, but also this element of,\n\n05:43.160 --> 05:47.280\n uh, um, you know, really just American superiority that doesn't happen here.\n\n05:47.440 --> 05:47.920\n Right.\n\n05:48.000 --> 05:52.840\n And, uh, I think that that woke people up, not only to, uh, you know, to the\n\n05:52.840 --> 05:56.920\n idea that other places around the world may not like the American ideals, may not\n\n05:56.920 --> 06:02.240\n like democracy and capitalism and, and that, but also, uh, maybe we aren't as\n\n06:02.240 --> 06:04.640\n big, tough and secure as we thought we were.\n\n06:04.920 --> 06:05.280\n Right.\n\n06:05.280 --> 06:08.640\n And so obviously I think you see the kind of the over rotation with a lot of the\n\n06:08.640 --> 06:12.280\n kind of security theater that came after that of almost psychologically, let's\n\n06:12.280 --> 06:15.880\n make our citizens feel like they're safe, even if the things that we're doing\n\n06:15.880 --> 06:18.400\n don't necessarily, you know, kind of change that apparatus.\n\n06:18.840 --> 06:22.760\n Uh, but on top of that, I think it's, it's, it's, it's, it's, it's, it's, it's\n\n06:22.760 --> 06:27.760\n I think that it really woke people up to, uh, extremism around the world.\n\n06:27.760 --> 06:32.120\n And, uh, I don't know if necessarily there was a change in the extremism as\n\n06:32.120 --> 06:34.440\n much as it just was an awareness thing, right.\n\n06:34.440 --> 06:39.120\n How, how many people, you know, kind of drew a line from, was it 92 or 93 with\n\n06:39.120 --> 06:44.000\n the world trade center bombing to, you know, deep levels of extremism and hatred\n\n06:44.000 --> 06:49.040\n of, uh, kind of the American industrial complex, probably not that many, 2001,\n\n06:49.360 --> 06:50.040\n a lot of people.\n\n06:50.040 --> 06:53.200\n And so I think that was, you know, again, as a, as a young kid, you don't\n\n06:53.200 --> 06:54.280\n understand a lot of this stuff.\n\n06:54.280 --> 06:58.480\n You basically just, Hey, somebody came here and tried to kill Americans.\n\n06:58.480 --> 07:01.280\n And so, you know, we should go fight back, right.\n\n07:01.280 --> 07:03.600\n Was kind of the, uh, the, the response I think that I had.\n\n07:03.800 --> 07:09.280\n What role did that have psychologically for you when you then in 2006 join the\n\n07:09.280 --> 07:15.480\n army, I mean, this is a very different joining the army than in the time when\n\n07:15.480 --> 07:20.320\n like it's more peaceful here, you're essentially facing, I mean, I don't\n\n07:20.320 --> 07:23.040\n know if you see it that way, but you know, there is a war on terror.\n\n07:23.040 --> 07:27.400\n And I know that people kind of, uh, criticize that whole formulation\n\n07:27.400 --> 07:31.080\n framework of thinking, but nevertheless, you are going to Iraq.\n\n07:31.080 --> 07:35.000\n You are going to Afghanistan, you're going to these places and are\n\n07:35.000 --> 07:40.280\n fighting these complicated, like, I mean, it's not even clear what you're fighting.\n\n07:40.520 --> 07:40.800\n Yeah.\n\n07:41.160 --> 07:43.480\n Well, I think that there's a couple of key pieces, right?\n\n07:43.480 --> 07:47.560\n So one, like what the actual most impactful data points, if you were, or\n\n07:47.560 --> 07:50.080\n kind of stories for me, uh, was the Pat Tillman story.\n\n07:50.160 --> 07:53.720\n So I played football, uh, in high school and it was going to go play in college.\n\n07:54.000 --> 07:58.640\n Um, and seeing, you know, this NFL player who basically just one day said, Hey, I'm\n\n07:58.640 --> 08:01.640\n going to go and do this instead, uh, and walk away.\n\n08:01.880 --> 08:06.480\n I don't know necessarily if it was a, uh, I want to pursue the same story right now.\n\n08:06.480 --> 08:07.800\n So he ended up dying.\n\n08:07.800 --> 08:10.760\n And so not exactly the, uh, the end result that you want, but I think it\n\n08:10.760 --> 08:13.360\n was almost like, uh, he made it okay.\n\n08:13.560 --> 08:17.240\n If you were on a certain trajectory in life to go take this detour and,\n\n08:17.280 --> 08:18.040\n and to go do it.\n\n08:18.480 --> 08:20.440\n Um, but the second thing is I was 17.\n\n08:20.840 --> 08:23.240\n You're pretty stupid when you're 17, you're pretty naive when you're 17.\n\n08:23.280 --> 08:23.560\n Right.\n\n08:23.920 --> 08:28.560\n And so, uh, I almost, um, kind of backed into the deployment because\n\n08:28.560 --> 08:31.680\n I signed up, uh, as a, uh, a reserve member.\n\n08:32.040 --> 08:34.840\n And so basically the plan was to sign up for the reserves.\n\n08:34.840 --> 08:37.600\n I was going to go to basic training, get all the, you know, kind of education\n\n08:37.600 --> 08:41.040\n and qualification, I was going to go to college and then after college,\n\n08:41.040 --> 08:44.440\n you know, maybe there's a chance that you will go and serve or do whatever.\n\n08:45.080 --> 08:48.400\n For me, I ended up getting deployed when I was a junior in college\n\n08:48.400 --> 08:49.800\n and we got pulled out of school.\n\n08:50.200 --> 08:54.040\n And so at 20 years old, uh, it's not exactly what you thought you were\n\n08:54.040 --> 08:54.960\n signing up for, right.\n\n08:54.960 --> 08:57.280\n Especially to kind of leave school to go do it.\n\n08:57.720 --> 09:01.760\n And then on top of that, uh, I probably had an advantage over most people, both\n\n09:01.760 --> 09:06.880\n on the entry to combat and the exit to, uh, kind of a combat situation, which\n\n09:06.880 --> 09:07.920\n that was football.\n\n09:08.280 --> 09:13.560\n So I always explain that, um, in hindsight, you're in a male dominated\n\n09:13.560 --> 09:17.720\n testosterone driven kind of combative sport where it's us first them.\n\n09:17.720 --> 09:21.520\n And, and, uh, there's training and, and, uh, you know, injuries and just kind of\n\n09:21.520 --> 09:25.400\n all of the things that go into playing a combat sport like football to now they\n\n09:25.400 --> 09:28.600\n give you guns, but you still have a uniform on still male dominated.\n\n09:28.920 --> 09:32.200\n It's just a little bit, you know, more serious in terms of the injuries and,\n\n09:32.200 --> 09:36.400\n and, uh, potential deaths and things like that, but also on the exit from that\n\n09:36.400 --> 09:40.600\n deployment, most guys I was there with, they're going back to being, you know,\n\n09:40.720 --> 09:45.800\n prison guards, police officers working at the lumber yard, you know, just kind\n\n09:45.800 --> 09:48.080\n of every day Americans.\n\n09:48.520 --> 09:53.320\n And so I had the fortunate ability to go back into, uh, kind of that combative\n\n09:53.320 --> 09:54.800\n environment, go back to play football.\n\n09:55.000 --> 09:58.800\n And so it was almost this like deescalation on the way out, uh, where\n\n09:58.840 --> 09:59.600\n they take your guns away.\n\n09:59.600 --> 10:02.840\n We still got a uniform, still male dominated, uh, still combative.\n\n10:02.840 --> 10:04.680\n And then eventually you're just a normal citizen.\n\n10:04.680 --> 10:07.640\n And so I think that in some weird way, I was, you know, very fortunate\n\n10:07.640 --> 10:11.000\n to kind of on the entry and exit, have that experience where other guys did.\n\n10:11.600 --> 10:17.720\n So what you were deployed to Iraq, were there any memories, experiences\n\n10:17.720 --> 10:22.160\n that changed you or in general, like you're probably a different\n\n10:22.160 --> 10:23.400\n man on the other side of it?\n\n10:23.680 --> 10:25.360\n How did that time change you?\n\n10:25.760 --> 10:28.360\n I think there, there was two main takeaways that I took, right?\n\n10:28.360 --> 10:32.880\n So one was, um, not a specific moment, but on multiple occasions, uh, I remember\n\n10:32.880 --> 10:36.880\n we were driving down the road and I would look and there would be a 10, 12,\n\n10:36.880 --> 10:37.880\n 14 year old kid.\n\n10:38.520 --> 10:42.880\n And if you've never seen somebody who literally has hate and disdain in their\n\n10:42.880 --> 10:47.640\n eyes, just not necessarily to you personally, just to the uniform, to what\n\n10:47.640 --> 10:49.080\n you stand for, it's all this stuff.\n\n10:49.840 --> 10:51.400\n When you see it, you see it right.\n\n10:51.400 --> 10:56.320\n And I always think of, um, if you've ever, uh, watched the movie, uh, 12 strong and\n\n10:56.320 --> 11:00.160\n in it, uh, they've got this Afghan, uh, Afghanistan warlord, and he's talking\n\n11:00.160 --> 11:03.280\n to a bunch of soldiers and he says, you know, you don't have killer eyes.\n\n11:03.280 --> 11:04.160\n You do, you do.\n\n11:04.160 --> 11:05.480\n And he's just like, he can just tell, right?\n\n11:05.480 --> 11:07.000\n He's, he's seen so many soldiers.\n\n11:07.560 --> 11:12.160\n And so I think that that was a, a memory on a number of occasions where I just saw\n\n11:12.160 --> 11:15.160\n young kids and I just said, they hate us.\n\n11:15.560 --> 11:15.920\n Right.\n\n11:16.120 --> 11:18.520\n And, and it's not you personally, it's what you stand for.\n\n11:19.000 --> 11:23.560\n But the really big event was, um, when you first get to these combat zones, a lot of\n\n11:23.560 --> 11:27.920\n times what will happen is, uh, you basically, your unit teams up with a unit\n\n11:27.920 --> 11:30.760\n that's leaving and there's a handoff and happens over a couple of weeks.\n\n11:30.760 --> 11:34.720\n And so you can imagine almost, you know, 1% of our team goes out with 99% of their\n\n11:34.720 --> 11:38.440\n team, then five, 95, 10, 90, all the way till it's 50, 50.\n\n11:38.480 --> 11:39.480\n And then eventually it rotates.\n\n11:39.480 --> 11:42.360\n And then it's majority of our team and a small number of their team.\n\n11:42.960 --> 11:46.920\n And so what a lot of people will explain is the two most dangerous times in war\n\n11:46.960 --> 11:50.200\n are actually the first two or three weeks and the last two or three weeks.\n\n11:50.640 --> 11:52.480\n When you first get there, you don't know who the people are.\n\n11:52.480 --> 11:55.920\n You don't know the terrain, you don't know, you know, kind of the local cultures\n\n11:55.920 --> 11:58.520\n and, and, uh, who to look out for, what signs, all that kind of stuff.\n\n11:58.920 --> 12:01.960\n And the last two or three weeks is you basically think you survived the\n\n12:01.960 --> 12:03.280\n deployment, you're looking forward to going home.\n\n12:03.280 --> 12:04.680\n So you become complacent, things like that.\n\n12:05.480 --> 12:08.680\n And so we made it through that transition period with no issues.\n\n12:08.720 --> 12:12.960\n Uh, but the literally the very first mission, uh, that we went out as a team,\n\n12:12.960 --> 12:16.960\n ourselves, a hundred percent, um, there was two separate incidents.\n\n12:17.000 --> 12:20.720\n Uh, one was we were driving in the middle of the night and, uh, what we think was a\n\n12:20.720 --> 12:25.600\n sniper shot at a truck that I was in, I was standing up outside of it, uh, along\n\n12:25.600 --> 12:26.880\n with a, uh, another guy.\n\n12:27.160 --> 12:31.240\n And that was kind of just a wake up call again of never been shot at before.\n\n12:31.600 --> 12:32.000\n Right.\n\n12:32.200 --> 12:36.880\n And so I'll never forget, uh, you kind of heard this whiz go by and the guy next to\n\n12:36.880 --> 12:38.680\n me was from a rural Pennsylvania.\n\n12:38.680 --> 12:41.240\n And he just said, you know, look, I've never been shot at before either, but\n\n12:41.240 --> 12:42.840\n I've done a lot of hunting, get the fuck down.\n\n12:44.560 --> 12:44.960\n Okay.\n\n12:45.680 --> 12:47.840\n And so, uh, we kept driving that night.\n\n12:48.040 --> 12:53.720\n Um, and, uh, later on in the night, uh, an IED went off, a guy ran over an IED,\n\n12:53.720 --> 12:55.440\n uh, who was at the front of the convoy.\n\n12:55.720 --> 13:00.560\n And when that IED went off, uh, again, I had never been in a convoy that had been\n\n13:00.560 --> 13:02.480\n blown up before, but the training kicks in.\n\n13:02.840 --> 13:05.960\n And so immediately every single person starts screaming out IED, IED, and they\n\n13:05.960 --> 13:07.480\n started looking and trying to figure it out.\n\n13:07.480 --> 13:12.320\n And you realize the United States military did a fantastic job training us before we\n\n13:12.320 --> 13:15.120\n went, because in that moment, nobody thought about anything.\n\n13:15.440 --> 13:17.400\n You just did what you had been programmed to do.\n\n13:17.760 --> 13:21.920\n Um, and so ultimately kind of through the end of that event, uh, there was a US\n\n13:21.920 --> 13:22.840\n soldier that ended up dying.\n\n13:22.840 --> 13:24.160\n He was, uh, shot in the head.\n\n13:24.400 --> 13:29.200\n And, um, when we got back to the base, uh, kind of after that entire event,\n\n13:29.680 --> 13:30.800\n I think it just hit us.\n\n13:31.280 --> 13:32.360\n We are at war.\n\n13:32.520 --> 13:37.320\n And if we make mistakes here, that is the cost of, you know, kind of those mistakes.\n\n13:37.680 --> 13:39.960\n And this was somebody who I didn't know.\n\n13:40.120 --> 13:43.120\n Uh, it was somebody who literally showed up, uh, kind of as secondary\n\n13:43.120 --> 13:48.120\n support, uh, for our unit and basically, uh, was there to help us.\n\n13:48.320 --> 13:48.760\n Right.\n\n13:48.760 --> 13:53.200\n And so it was one of those weird situations where, uh, you have this emotional connection\n\n13:53.200 --> 13:57.680\n because it's somebody who, uh, shared an event with you, but you didn't know them.\n\n13:57.880 --> 13:58.120\n Right.\n\n13:58.120 --> 14:01.200\n And you learn their name later and you understand that they have a family and\n\n14:01.200 --> 14:02.680\n they have young kids and all this stuff.\n\n14:03.040 --> 14:06.000\n And so again, as a 20 year old kid, you're kind of processing all this and\n\n14:06.000 --> 14:10.320\n you just realize like the gun I have in my arm, my hands, it's real for a reason.\n\n14:10.640 --> 14:11.080\n Right.\n\n14:11.160 --> 14:13.720\n And we better take this seriously.\n\n14:13.720 --> 14:17.320\n This is not, you know, let's joking around in kind of the barracks and, you\n\n14:17.320 --> 14:20.000\n know, all the things that you would expect, you know, guys you're doing in the army.\n\n14:20.560 --> 14:24.600\n So I think that was like the moment where I said, Hey, I'm going to learn a lot here.\n\n14:24.640 --> 14:26.080\n Uh, and I got to make sure I get home.\n\n14:26.440 --> 14:30.040\n And you snap it into the training, but nevertheless, I mean, you're somebody\n\n14:30.040 --> 14:32.320\n who thinks philosophically about this world now, right?\n\n14:32.320 --> 14:36.560\n You're, uh, very intelligent and things deeply about the world.\n\n14:37.120 --> 14:42.960\n So looking back, you mentioned hatred in the 14 year old kids eyes, there's death.\n\n14:42.960 --> 14:47.280\n So the way you kind of described this whole story is like training kicks in.\n\n14:47.800 --> 14:49.400\n This, this shit is serious.\n\n14:50.080 --> 14:54.120\n Like this is, uh, you know, there's a reason there's a gun in, in your hand.\n\n14:54.840 --> 14:56.440\n So there's a strategic element.\n\n14:56.480 --> 14:58.120\n There's like, you have to get the job done.\n\n14:58.120 --> 15:03.800\n There's a task at hand, but at the same time, if you zoom out, there's a kid who\n\n15:03.800 --> 15:09.080\n has hate for you, uh, some of those kids would probably, if they could, would kill\n\n15:09.080 --> 15:12.120\n you for the thing you stand for in the uniform.\n\n15:12.120 --> 15:15.320\n And then there's bullets flying at you.\n\n15:15.800 --> 15:22.240\n And then there's people that some of them you might already care for deeply are dying.\n\n15:22.800 --> 15:24.760\n What the hell do you make of that?\n\n15:26.120 --> 15:27.240\n Do you think about that?\n\n15:27.240 --> 15:28.600\n Does any of that haunt you?\n\n15:29.640 --> 15:32.520\n How do you think about the world having witnessed that?\n\n15:32.760 --> 15:33.260\n Yeah.\n\n15:33.680 --> 15:36.160\n A lot of times when we would talk about it, we were there.\n\n15:36.760 --> 15:40.120\n If I was that kid, I would want to kill that person too.\n\n15:40.240 --> 15:40.740\n Right.\n\n15:40.740 --> 15:42.300\n I would have hatred as well.\n\n15:42.340 --> 15:42.840\n Right.\n\n15:42.840 --> 15:46.940\n Imagine if in the United States tomorrow, you and I woke up and there was tanks\n\n15:46.940 --> 15:51.180\n rolling down the street from another country and they were basically imposing\n\n15:51.180 --> 15:55.500\n their rules on us, whether they thought it was the right thing to do or not, the\n\n15:55.500 --> 15:59.220\n soldiers were there and they were doing this, we would probably feel not so great\n\n15:59.220 --> 16:00.020\n about it, right.\n\n16:00.020 --> 16:03.260\n At kind of a minimum and at a maximum, we'd be really, really pissed off.\n\n16:03.260 --> 16:03.900\n We would fight back.\n\n16:04.540 --> 16:08.220\n And so what you don't understand when you're in the heat of the moment is why\n\n16:08.220 --> 16:09.260\n does this person feel this way?\n\n16:09.260 --> 16:15.500\n And so what's very weird is, well, what happens if a year ago, US soldiers came\n\n16:15.500 --> 16:19.820\n through, they got shot at, they returned fire and they killed that kid's uncle.\n\n16:20.820 --> 16:21.740\n You'd be pissed off.\n\n16:21.900 --> 16:22.400\n Right.\n\n16:22.700 --> 16:26.540\n And so you just start to understand, like we look at war very black and white.\n\n16:26.620 --> 16:29.300\n We look at it very much from a clinical perspective.\n\n16:29.500 --> 16:32.180\n We're going to go, we're going to go kind of invade somewhere.\n\n16:32.660 --> 16:34.900\n We are the most dominant military in the world.\n\n16:34.900 --> 16:36.180\n We're very good at invading.\n\n16:36.180 --> 16:40.540\n And we will crush wherever we invade, but when you're actually on the ground, what\n\n16:40.540 --> 16:42.180\n you understand is the humanity of it all.\n\n16:42.420 --> 16:42.920\n Right.\n\n16:42.940 --> 16:47.340\n And so what becomes very interesting is pretty much every veteran I know that\n\n16:47.340 --> 16:50.380\n comes back, they're some of the largest pacifists in the world.\n\n16:50.500 --> 16:55.500\n And I always revert back to Marcus Luttrell, who was a famous Navy SEAL, and\n\n16:55.500 --> 16:57.220\n there's a movie made about him and his story.\n\n16:57.700 --> 17:01.980\n He gave a speech one time that I saw and he basically said, listen, if you're a\n\n17:01.980 --> 17:06.340\n politician, your job is to be the diplomat, do everything you possibly can, not to\n\n17:06.340 --> 17:10.220\n send me and my friends anywhere, because when you send us, we're going to bring\n\n17:10.220 --> 17:11.940\n hell with us, right.\n\n17:12.340 --> 17:16.500\n And understand that is the business that we are in, but every single other person\n\n17:16.500 --> 17:19.820\n up until we get sent has a job to do to prevent having to send us.\n\n17:20.220 --> 17:23.620\n And I think that ultimately that's where you see a lot of kind of this generation\n\n17:23.620 --> 17:28.180\n that has fought in Iraq and Afghanistan that says, listen, maybe we shouldn't be\n\n17:28.180 --> 17:32.100\n running around the world being the police, maybe we shouldn't be going and invading\n\n17:32.100 --> 17:35.980\n all these different countries, because when you actually get to see firsthand\n\n17:35.980 --> 17:39.660\n what happens, it's just something that we should avoid at all costs.\n\n17:39.820 --> 17:44.820\n But if we have to go, or we have to actually send soldiers somewhere, understand\n\n17:44.820 --> 17:46.220\n what happens when that occurs.\n\n17:46.620 --> 17:48.820\n And you know, the United States is the best in the world at doing it.\n\n17:49.780 --> 17:53.180\n Do you think, I'm thinking about that kid with the hatred.\n\n17:53.180 --> 17:55.700\n Do you think there will always be hatred in the world?\n\n17:55.740 --> 17:57.220\n Do you think there will always be hatred?\n\n17:57.220 --> 18:01.340\n In the world, do you think, uh, from another perspective, do you think there'll\n\n18:01.340 --> 18:06.420\n be war always, is that a fundamental aspect of human nature or is that\n\n18:06.420 --> 18:07.740\n something we can escape?\n\n18:08.380 --> 18:08.700\n Yeah.\n\n18:08.700 --> 18:12.580\n So war, I think has like very negative connotations in terms of bullets and\n\n18:12.580 --> 18:18.660\n bombs and death and kind of just very morbid type, um, um, understanding.\n\n18:19.540 --> 18:22.620\n Conflict on the other hand, I think people look at and say, of course\n\n18:22.620 --> 18:23.820\n there will always be conflict, right.\n\n18:23.820 --> 18:27.900\n You just can't have billions of people all on the same planet without some\n\n18:27.900 --> 18:31.220\n level of disagreement, whether that's a disagreement of ideas, disagreement\n\n18:31.220 --> 18:34.460\n over physical, you know, geography, uh, or something else.\n\n18:34.460 --> 18:36.620\n And so I think conflict will always exist.\n\n18:37.100 --> 18:40.220\n The question is what form does war take moving forward?\n\n18:40.540 --> 18:44.620\n And so in my mind, you know, it's starting to look a lot more clinical,\n\n18:44.700 --> 18:45.020\n right?\n\n18:45.220 --> 18:49.380\n A lot more drones, a lot less soldiers on the ground, a lot more use of special\n\n18:49.380 --> 18:52.900\n forces and kind of these small, highly specialized teams rather than kind of big\n\n18:52.900 --> 18:53.820\n mechanical armies.\n\n18:54.140 --> 18:57.700\n Um, and then you get into like the information warfare and kind of cyber\n\n18:57.700 --> 19:01.460\n warfare and you start to understand that we're at war with a lot of people right\n\n19:01.460 --> 19:02.340\n now, right?\n\n19:02.420 --> 19:05.220\n Doesn't mean we're necessarily dropping bombs, uh, on their countries.\n\n19:05.500 --> 19:09.300\n Doesn't necessarily mean we're sending soldiers there, but on a daily basis, we\n\n19:09.300 --> 19:12.260\n are engaged in these kind of, you know, cyber battlefields.\n\n19:12.260 --> 19:17.300\n And so if that's where war starts to play out, um, it, one changes the tools\n\n19:17.300 --> 19:21.140\n and tactics and techniques that, uh, we need to arm our country and other\n\n19:21.140 --> 19:22.420\n countries will arm themselves with.\n\n19:22.420 --> 19:25.500\n But it also changes the way that we think about war, right?\n\n19:25.540 --> 19:30.020\n It seems, it sounds a lot less worrisome if I say, Hey, we're going to go to war\n\n19:30.020 --> 19:32.140\n with a country, but by the way, there's going to be no death.\n\n19:33.100 --> 19:33.460\n Right?\n\n19:33.500 --> 19:33.900\n Okay.\n\n19:33.980 --> 19:36.700\n Like that doesn't sound nearly as bad as, Hey, we're going to go send 10,000\n\n19:36.700 --> 19:39.620\n soldiers and you know, some percentage of them are going to die on the battlefield.\n\n19:39.620 --> 19:43.180\n And then we're going to, you know, basically pipe back videos and articles\n\n19:43.340 --> 19:45.020\n saying that American soldiers are dying.\n\n19:45.140 --> 19:45.420\n Yeah.\n\n19:45.780 --> 19:49.740\n It does seem to be a fundamental difference between the, the Genghis Khan\n\n19:49.740 --> 19:58.300\n style, like if I would feel differently if somebody like hand to hand with a knife\n\n19:58.340 --> 20:04.620\n murdered my family versus cyber security, why I stole all their data, stole all\n\n20:04.620 --> 20:08.980\n their money, stole everything they own, falsified their identity, all that kind\n\n20:08.980 --> 20:15.180\n of stuff that those are both traumatic events, but they do seem to be\n\n20:15.180 --> 20:19.740\n fundamentally different, but maybe that's actually very narrow style thinking,\n\n20:20.260 --> 20:24.860\n because ultimately you have to think about what is life and what's happiness.\n\n20:25.540 --> 20:31.460\n And, um, it's like the samurai thinking, I'm not sure what's more painful.\n\n20:32.380 --> 20:37.180\n If I take it to myself, like, I'm not sure what I would rather live through\n\n20:37.180 --> 20:46.740\n being stabbed, like to death, or having my identity stolen, all my money stolen,\n\n20:47.220 --> 20:53.660\n or maybe reputation destroyed, like with lies or something like that.\n\n20:54.620 --> 20:56.420\n That that's very interesting to think about.\n\n20:56.420 --> 20:58.860\n If you think about quality of life and all those kinds of things,\n\n20:58.980 --> 21:00.900\n well, one's finite, right?\n\n21:01.580 --> 21:05.780\n One's the pain ends and the other is kind of a long prolonged, almost torture.\n\n21:05.780 --> 21:08.260\n So it's physical pain versus psychological pain.\n\n21:08.380 --> 21:11.660\n It's really interesting to, it's really interesting to think about.\n\n21:12.180 --> 21:15.660\n And I think another key piece to this, which I don't have answers to, but,\n\n21:15.660 --> 21:19.740\n but there is an element of emotion and rage in the physical violence versus\n\n21:20.060 --> 21:22.940\n again, more of that clinical, you know, information warfare.\n\n21:22.980 --> 21:29.780\n And so, um, it's really easy to show a battlefield where there's death on both\n\n21:29.780 --> 21:34.340\n sides and bombs being dropped and buildings destroyed, um, it fits very\n\n21:34.340 --> 21:38.780\n well into propaganda for everyone involved, right, regardless of what side\n\n21:38.780 --> 21:42.780\n they're on, when you start talking about cyber warfare, how many times have\n\n21:42.780 --> 21:47.380\n we seen a big company get data hacked or information hacked and we all, you\n\n21:47.380 --> 21:50.620\n know, read the headlines, maybe throw a tweet out and then move on with our day\n\n21:50.620 --> 21:51.700\n and don't remember it anymore.\n\n21:52.020 --> 21:54.100\n And so it's just very, very different.\n\n21:54.100 --> 21:57.860\n I think, uh, in, in the, uh, motion and response that it invokes and people\n\n21:57.860 --> 21:58.900\n when they hear about it as well.\n\n21:59.820 --> 22:02.980\n Given the conflict, do you think people are fundamentally good?\n\n22:02.980 --> 22:08.020\n Are we all sort of like blank slates that could be evil given the environment\n\n22:08.300 --> 22:13.540\n or good given the environment, or can we kind of, is there some base that we can\n\n22:13.540 --> 22:21.420\n rely on that people, if left to their own devices will be good and trustworthy and\n\n22:21.740 --> 22:25.060\n honest, I think you have to separate out intention from action.\n\n22:25.700 --> 22:30.820\n So if you talk to some of the most heinous criminals in the world, they've\n\n22:30.820 --> 22:36.220\n rationalized their actions, and so you've got to ask yourself, what is the level\n\n22:36.220 --> 22:41.060\n of which they understood what they were doing, that they intended to be malicious,\n\n22:41.060 --> 22:47.620\n nefarious, um, and kind of do bad things versus the actual actions themselves.\n\n22:47.620 --> 22:52.980\n And so, um, even as a society, you know, if let's say, for example, you were to\n\n22:52.980 --> 22:55.860\n walk down the street and you were to murder somebody on the sidewalk, completely\n\n22:55.860 --> 23:01.500\n unprovoked, we would look at you and say, you are a, you know, a sociopath, uh, you\n\n23:01.500 --> 23:04.620\n have everything wrong with you and that is somebody that we do not want in our\n\n23:04.620 --> 23:09.780\n society, and therefore we will levy, you know, the extent of rule of law against\n\n23:09.780 --> 23:12.300\n you in order to protect society from you, right?\n\n23:12.300 --> 23:16.620\n And you become that monster, that beast, if in the same situation, somebody walks\n\n23:16.620 --> 23:22.660\n in your house with a knife and you murder them or you kill them, now we put you up\n\n23:22.660 --> 23:26.740\n on a pedestal as a hero, and those are two very, very different responses.\n\n23:26.780 --> 23:31.420\n They may be just as morbid, they may be just as violent, uh, in terms of the\n\n23:31.420 --> 23:35.380\n actual actions, the intentions, the way it's perceived is very, very different.\n\n23:35.420 --> 23:40.420\n And so I think that, uh, as a world, we like a very black and white, clean cut,\n\n23:40.460 --> 23:43.500\n you know, good, bad, uh, I think the world's a lot more messy than that.\n\n23:43.540 --> 23:48.340\n And I think that, uh, a lot of times when you look at intention, it's hard for us\n\n23:48.340 --> 23:53.140\n to tell what somebody's intention is, but I've looked at a lot of, you know, people\n\n23:53.140 --> 23:56.020\n who are both considered very good and also a lot of people are considered very\n\n23:56.020 --> 24:00.820\n bad and they sound very similar in terms of the motivations for their actions.\n\n24:01.340 --> 24:04.460\n And so I think that it's just a really hard problem that probably doesn't\n\n24:04.460 --> 24:06.180\n have a perfect solution or an answer.\n\n24:06.500 --> 24:10.860\n Do you give much value to the intention or do you think it's better to look at\n\n24:10.860 --> 24:17.100\n the results of the behavior, uh, as opposed to the, the underlying ideology?\n\n24:17.100 --> 24:21.580\n Underlying ideology, the underlying intention of, of the behavior.\n\n24:22.220 --> 24:25.300\n I think that intention gets at the question of like, are people inherently\n\n24:25.300 --> 24:26.580\n good or bad, right?\n\n24:26.780 --> 24:30.700\n Is I think that they're generally inherently good and the intention is\n\n24:30.700 --> 24:35.020\n driving towards the thing that they believe is the best outcome or the best\n\n24:35.260 --> 24:37.500\n thing for them to pursue the action.\n\n24:37.500 --> 24:39.900\n I think is where we spend most of our time focused on.\n\n24:40.180 --> 24:45.820\n Um, and frankly, we actually may be a better society or, uh, kind of kinder\n\n24:45.820 --> 24:48.500\n as a humanity to each other if we spent more time looking at\n\n24:48.500 --> 24:49.820\n intention rather than action.\n\n24:50.180 --> 24:53.300\n Um, but again, you know, if somebody walks down the street and murders\n\n24:53.300 --> 24:57.700\n somebody, uh, it's really hard to have a conversation and it may be inappropriate\n\n24:57.780 --> 25:02.140\n for us to have a conversation about intention versus, uh, any level of,\n\n25:02.140 --> 25:03.260\n of action, right?\n\n25:04.940 --> 25:10.900\n So you're one of the prominent, I would say even the faces of the, the world\n\n25:10.900 --> 25:16.380\n of cryptocurrency, Bitcoin, that whole entire world was dive straight in and\n\n25:16.380 --> 25:22.260\n ask, uh, do you think, do you consider yourself a Bitcoin maximalist?\n\n25:23.140 --> 25:28.020\n I think that the way I really look at it is, uh, I work backwards off of what\n\n25:28.020 --> 25:33.340\n is the maximalism that I believe in and the world that I believe in is, uh, kind\n\n25:33.340 --> 25:39.420\n of an automated world that is run on these open decentralized protocols.\n\n25:39.420 --> 25:45.660\n Uh, and what we ultimately do is we return sovereignty and individualism\n\n25:45.660 --> 25:49.420\n and, and kind of, uh, personal responsibility and liberty, uh,\n\n25:49.420 --> 25:50.940\n to people over institutions.\n\n25:51.380 --> 25:56.300\n And what we end up doing is we end up, uh, kind of taking what has historically\n\n25:56.300 --> 26:01.340\n been a very analog or physical world economy and, uh, geographic rule.\n\n26:01.860 --> 26:05.980\n And we then kind of put it in the cloud and this digital economy becomes the\n\n26:05.980 --> 26:11.180\n prevalent way that we all, uh, conduct commerce, communicate, uh, et cetera.\n\n26:11.180 --> 26:15.220\n And so it's less about any one single technology to me, right?\n\n26:15.220 --> 26:20.740\n I think that it's pretty stupid for people to, um, almost in a way, uh, put\n\n26:20.780 --> 26:26.540\n an inanimate object up for, uh, you know, some sort of obsession, uh, to me,\n\n26:26.540 --> 26:31.500\n it's much more about the ideals, the ethos, uh, and the most rational, uh,\n\n26:31.540 --> 26:35.420\n and likely path to that kind of end result or that world that I think, you\n\n26:35.420 --> 26:37.220\n know, is at this point, just a foregone conclusion.\n\n26:37.260 --> 26:41.340\n So the distinction there, and maybe people don't know the terminology,\n\n26:41.340 --> 26:47.780\n maximalism is basically saying, I really think this is a good idea.\n\n26:49.100 --> 26:52.820\n Like, uh, you know, if you prefer a certain kind of diet, it could be a\n\n26:52.820 --> 26:57.340\n keto maximalist saying like, this is probably, maybe it's not a hundred\n\n26:57.340 --> 27:01.300\n percent, but probably the diet that's healthiest for humans kind of thing.\n\n27:01.300 --> 27:06.620\n In the same sense, Bitcoin maximalism is saying, you know, of course we\n\n27:06.620 --> 27:10.060\n don't know, there's a lot of uncertainty, but this particular technology seems\n\n27:10.060 --> 27:14.740\n to be the best representations of some set of ideals that defines progress\n\n27:14.740 --> 27:20.060\n in the future, but you're drawing a distinction between sort of, um, cult\n\n27:20.060 --> 27:26.260\n like obsession about an object of any kind, whether it's keto, uh, or, uh,\n\n27:26.260 --> 27:32.140\n Bitcoin, and just sort of believing that a technology is the best representation\n\n27:32.180 --> 27:33.980\n of a particular set of ideals.\n\n27:34.300 --> 27:41.620\n And you believe that sort of, uh, this moving into the cloud, uh, both\n\n27:41.620 --> 27:45.700\n the distributed nature of it, but also just the digital nature of it is\n\n27:45.700 --> 27:49.260\n something that's going to, uh, be a positive step for humanity.\n\n27:49.500 --> 27:49.700\n Yeah.\n\n27:49.700 --> 27:53.180\n I would even take maximalism a step further, and it's not just the kind\n\n27:53.180 --> 27:58.300\n of singular viewpoint of this is the best, it's also, uh, an element\n\n27:58.300 --> 27:59.980\n of it's anti everything else.\n\n28:00.620 --> 28:00.980\n Right.\n\n28:01.100 --> 28:05.500\n So, you know, take keto, for example, uh, the keto diet is not only the best diet.\n\n28:05.540 --> 28:06.780\n All the other diets are bad.\n\n28:06.940 --> 28:07.140\n Yeah.\n\n28:07.220 --> 28:07.700\n Right.\n\n28:07.820 --> 28:10.100\n And so it's, it's a very binary view of the world.\n\n28:10.340 --> 28:14.180\n Um, I think that what's probably most misunderstood about, uh, let's take\n\n28:14.180 --> 28:18.780\n Bitcoin, uh, as a specific example, is that most of the people who are labeled\n\n28:18.780 --> 28:23.220\n Bitcoin maximalist, they would be open minded if they believe that something\n\n28:23.220 --> 28:28.020\n else came along that was a superior technology or had a, a better, um, kind\n\n28:28.020 --> 28:32.580\n of probability of achieving again, that ultimate vision, I think where, uh,\n\n28:32.660 --> 28:37.740\n there's this controversy and kind of clashing of, uh, ideas is that the\n\n28:37.740 --> 28:41.980\n Bitcoin community believes Bitcoin is the best way to do that and has very\n\n28:41.980 --> 28:45.900\n specific arguments as to why the other things are not right.\n\n28:45.900 --> 28:49.740\n And so what ultimately ends up happening, which is very weird in the investing\n\n28:49.740 --> 28:52.340\n world, right, it's unlikely that you and I are going to sit down and you're\n\n28:52.340 --> 28:54.660\n going to like Apple stock is the best stock and there's no other stock.\n\n28:54.660 --> 28:55.420\n That's worth anything.\n\n28:55.460 --> 28:55.660\n Yeah.\n\n28:55.700 --> 28:56.060\n Right.\n\n28:56.380 --> 29:00.540\n And, uh, and then also it's very weird if you said to me, um, you know, this\n\n29:00.540 --> 29:05.020\n stock is worth zero and that's where everything that I own, I've put on a\n\n29:05.020 --> 29:06.740\n short on one single company, right?\n\n29:06.740 --> 29:07.820\n There's diversification.\n\n29:07.820 --> 29:10.780\n There's a much more kind of probabilistic thinking in finance in general.\n\n29:10.780 --> 29:15.380\n Uh, when it comes to this specific world of cryptocurrency and kind of digital\n\n29:15.380 --> 29:20.740\n assets, if you will, uh, is there's two main groups of people who are trying to\n\n29:20.740 --> 29:25.660\n build two very, very different things at the onset, but when you unpack it and you\n\n29:25.660 --> 29:28.100\n start to spend more and more time on it, you rise, they're actually trying to\n\n29:28.100 --> 29:29.940\n accomplish the same thing in two different ways.\n\n29:30.340 --> 29:33.580\n So Bitcoin is seen, I think, as a, uh, a digital currency, right?\n\n29:33.580 --> 29:36.460\n Kind of the idea that this is going to ascend to become the next global\n\n29:36.460 --> 29:40.220\n reserve currency, it's a programmatic kind of digital currency, but it's\n\n29:40.220 --> 29:43.460\n also a programmatic kind of transparent, um, money.\n\n29:43.700 --> 29:47.820\n And, uh, it's essentially just 180 degrees difference than the inflationary,\n\n29:48.060 --> 29:51.500\n you know, non transparent, uh, fiat currencies that exist in the world.\n\n29:52.460 --> 29:54.460\n You then look at kind of everything else, right?\n\n29:54.460 --> 29:57.820\n And you have a lot of smart contract platforms and various things that\n\n29:57.820 --> 30:00.660\n they're all going after at Ethereum with kind of the world computer\n\n30:00.660 --> 30:02.860\n approach, and you can kind of go down the line with all their other\n\n30:02.860 --> 30:04.300\n arguments as to what they're trying to build.\n\n30:04.300 --> 30:09.860\n I think the big difference just comes down to, uh, innovation versus security.\n\n30:09.860 --> 30:15.860\n And when you simplistically look at it via that lens, you actually understand\n\n30:15.860 --> 30:16.780\n where both people are coming from.\n\n30:16.900 --> 30:19.500\n When you say security, sorry to interrupt, do you mean financial\n\n30:19.500 --> 30:22.740\n security or do you mean like literally the, the, the security of the,\n\n30:23.340 --> 30:25.620\n of the particular cryptocurrency?\n\n30:25.900 --> 30:28.100\n The, the technical security of a blockchain.\n\n30:28.100 --> 30:31.220\n So when you look at, let's say, um, Bitcoin versus Ethereum, right?\n\n30:31.220 --> 30:34.980\n Bitcoin has decided in that community has decided security is the number\n\n30:34.980 --> 30:36.340\n one thing that you have to optimize for.\n\n30:36.380 --> 30:41.220\n So decentralization, um, over everything else in terms of transaction\n\n30:41.220 --> 30:45.980\n speeds, uh, cost, anything that you could come up with, that is, uh, something\n\n30:45.980 --> 30:47.500\n that would be important for a currency.\n\n30:47.860 --> 30:49.700\n The number one thing to optimize for is security.\n\n30:50.020 --> 30:53.140\n And as we have seen, uh, with a lot of technologies, right?\n\n30:53.220 --> 30:56.260\n Facebook's, uh, Libra or now what's known as DiEM is a great example.\n\n30:56.260 --> 31:01.180\n Uh, not having decentralization is susceptible to the nation state.\n\n31:01.900 --> 31:07.380\n And so a lot of these other platforms and blockchains, uh, they say security\n\n31:07.380 --> 31:10.620\n is important, but it's not the most important thing we believe there's a\n\n31:10.620 --> 31:15.100\n trade off between, you know, a little less security and transaction speed or\n\n31:15.140 --> 31:17.020\n composability or whatever it is.\n\n31:17.460 --> 31:22.020\n And so take a theorem as kind of the second, uh, largest, uh, community\n\n31:22.020 --> 31:23.220\n and blockchain by market cap.\n\n31:23.220 --> 31:25.780\n It was created because somebody wanted to, or a group of people\n\n31:25.780 --> 31:26.980\n wanted to do something on Bitcoin.\n\n31:26.980 --> 31:27.980\n They felt like they couldn't do it.\n\n31:27.980 --> 31:30.220\n And so they said, Hey, we're going to go create something that has the smart\n\n31:30.220 --> 31:31.820\n contracts that we can then go do here.\n\n31:32.540 --> 31:33.860\n Again, this is technology, right?\n\n31:33.860 --> 31:37.420\n And so the tribalism of like, you're right, you're wrong to me is a little\n\n31:37.420 --> 31:40.620\n childish, just in the sense of like the market is going to decide what is most\n\n31:40.620 --> 31:41.140\n valuable.\n\n31:41.580 --> 31:44.420\n And then when you go inside of that community, like there's a lot of dumb\n\n31:44.420 --> 31:47.260\n ideas, people are trying to build around Bitcoin, but there's also a lot of really,\n\n31:47.260 --> 31:50.500\n really great ideas that people are trying to build around Bitcoin, same thing in\n\n31:50.500 --> 31:54.220\n the Ethereum world. And so what you end up getting, I think, is the tribalism\n\n31:54.220 --> 31:57.540\n really comes out of the idea that there's a ticker price that is attached\n\n31:57.540 --> 31:58.780\n to all of this, right?\n\n31:59.020 --> 32:04.540\n If you go back in history of technology, venture capitalists didn't sit around\n\n32:04.620 --> 32:08.300\n the table and yell and scream at each other in this like religious zealot way,\n\n32:08.500 --> 32:11.820\n right? Because you bet on one type of cloud computing platform.\n\n32:11.820 --> 32:13.460\n And I bet on another one, right?\n\n32:13.580 --> 32:15.820\n It's just the market's going to decide, we're both going to work on and try to\n\n32:15.820 --> 32:18.460\n make our successful, uh, here in the world.\n\n32:18.460 --> 32:21.660\n I think that the sensitivity and mainly it comes out of the Bitcoin community is\n\n32:21.660 --> 32:26.060\n that a lot of this is being funded, not only by venture capitalists and kind of\n\n32:26.060 --> 32:28.820\n professional money managers and asset allocators.\n\n32:29.300 --> 32:32.980\n There's also this element of including the retail investor and the public.\n\n32:33.540 --> 32:37.700\n And so it, whether it's through ICOs or some other forms of capital raising,\n\n32:38.020 --> 32:42.380\n um, there's arguments for it saying, Hey, look, uh, this now gives kind of the\n\n32:42.380 --> 32:45.540\n little guy, some sort of access and an ability to do it.\n\n32:45.540 --> 32:48.420\n But there's also arguments against it. Some people say, Hey, it's easier to dupe\n\n32:48.420 --> 32:50.860\n them and it's easier to run scams and kind of all this stuff.\n\n32:50.860 --> 32:55.900\n And so ultimately I think that, uh, crypto is this like arena of ideas.\n\n32:55.900 --> 33:00.660\n It is literally the war of attrition and, uh, what will end up happening is 10\n\n33:00.660 --> 33:04.140\n years from now, you and I will talk and we're going to say, well, the market said\n\n33:04.180 --> 33:05.740\n X was valuable and Y wasn't.\n\n33:06.300 --> 33:11.180\n And so all of the tribalism from between, you know, here and there, uh, it's fun.\n\n33:11.220 --> 33:12.340\n It's, you know, engaging.\n\n33:12.340 --> 33:15.580\n Whatever, but ultimately it doesn't really matter because the public is involved.\n\n33:15.580 --> 33:16.780\n There's a lot of personalities.\n\n33:16.780 --> 33:22.180\n And so a lot of times we focus on the extreme personalities that do a lot of\n\n33:22.220 --> 33:24.860\n maybe, uh, pardon the French shit talking.\n\n33:24.860 --> 33:28.980\n And, and so we kind of focus on that, but that's not necessarily a representative\n\n33:28.980 --> 33:30.340\n of the communities involved.\n\n33:30.540 --> 33:33.980\n Let's talk about Bitcoin first, and then it'll help us use as a kind of comparison\n\n33:33.980 --> 33:35.980\n to Ethereum or whatever else.\n\n33:36.260 --> 33:38.460\n So when you think about what is money, right?\n\n33:38.460 --> 33:39.500\n That's kind of the first question.\n\n33:39.500 --> 33:43.100\n People really kind of go down the rabbit hole on, and ultimately today,\n\n33:43.140 --> 33:44.620\n it's a belief system, right?\n\n33:44.660 --> 33:47.980\n And you may believe that one currency has more value over another because\n\n33:47.980 --> 33:52.580\n it's backed by a certain military or a certain government has a monetary policy\n\n33:52.580 --> 33:54.220\n that you believe in or don't believe in.\n\n33:54.580 --> 33:58.060\n Um, but ultimately it's a belief system that there's nothing backing this, uh,\n\n33:58.100 --> 34:01.180\n other than, uh, a government asks you to pay your taxes in it, right?\n\n34:01.220 --> 34:04.580\n And they can have a monopoly on violence, uh, in terms of they can put you in jail.\n\n34:04.580 --> 34:07.740\n If you don't pay your taxes, uh, they can, uh, they can, uh, they can\n\n34:07.740 --> 34:09.860\n go to other countries and they can invade and do all this stuff.\n\n34:11.900 --> 34:13.580\n It wasn't always like that, right?\n\n34:13.620 --> 34:17.260\n It was historically a layer one technology was gold.\n\n34:17.540 --> 34:20.660\n And so gold was a fantastic store of value.\n\n34:20.700 --> 34:23.380\n You knew that if you held gold, it wasn't going to be inflated away.\n\n34:23.380 --> 34:26.660\n It was sound money was outside the system and no one could create more of it.\n\n34:27.180 --> 34:30.700\n And the reason why that's important is because that optimization for store\n\n34:30.700 --> 34:35.860\n of value served as the bedrock of the entire stack of, uh, money.\n\n34:35.860 --> 34:40.300\n Uh, for 5,000 years. And so the problem with that though, again, trade off between\n\n34:40.300 --> 34:43.100\n store of value is it was really hard to transact with, right?\n\n34:43.100 --> 34:46.700\n If I came in here and I, and you said, Hey, I want a couple of ounces of gold and I\n\n34:46.700 --> 34:49.660\n had a whole bar, I'd have to literally shave off the ounces of gold.\n\n34:49.900 --> 34:51.700\n Uh, it's heavy to carry around.\n\n34:51.700 --> 34:55.940\n If you said to me, Hey, you're in one city, mail it to me, really expensive.\n\n34:55.940 --> 34:56.940\n You know, there's all these issues with it.\n\n34:57.460 --> 35:01.460\n And so ultimately what people said was, well, let's create a second layer on top\n\n35:01.460 --> 35:03.900\n of that gold in order to make it easier to transact with it.\n\n35:03.900 --> 35:06.100\n That gold in order to make it easier to transact.\n\n35:06.420 --> 35:08.340\n And so we created paper claims on the gold.\n\n35:08.380 --> 35:10.220\n So, Hey, don't carry around the gold in your pocket anymore.\n\n35:10.460 --> 35:11.780\n Put it in a vault or a bank.\n\n35:11.940 --> 35:13.700\n They're going to issue a paper claim.\n\n35:13.900 --> 35:16.020\n Now you and I can trade these paper claims around.\n\n35:16.220 --> 35:18.660\n And at any point, if you want the gold, you just show up and you say, Hey, give\n\n35:18.660 --> 35:20.900\n me three ounces of gold or two bars or whatever.\n\n35:21.540 --> 35:24.260\n And so that actually made the store of value.\n\n35:24.340 --> 35:27.420\n It was allowed that to be the anchor and kind of the most important part, the\n\n35:27.420 --> 35:31.060\n security of your, of your purchasing power, but now it became easier to transact.\n\n35:31.100 --> 35:32.940\n And then eventually we built layers even on top of that.\n\n35:32.940 --> 35:36.420\n So everything from electronic money, uh, kind of electronic UCIPS, all the way\n\n35:36.420 --> 35:40.540\n to credit and other systems on top of that gold 1971 comes around and obviously\n\n35:40.540 --> 35:42.980\n we D peg from that gold, right?\n\n35:42.980 --> 35:44.420\n And it was a temporary measure at the time.\n\n35:44.420 --> 35:45.660\n We ended up not going back to it.\n\n35:45.980 --> 35:49.380\n And so what you moved or transitioned from was sound money, which was outside\n\n35:49.380 --> 35:52.740\n the system, no one could create more to now the government had full control.\n\n35:52.740 --> 35:54.300\n They could create as much as they wanted to.\n\n35:54.660 --> 35:57.460\n They tried to be responsible and disciplined, but obviously hard to do.\n\n35:57.460 --> 35:58.660\n Sometimes we've been really good at it.\n\n35:58.660 --> 35:59.940\n Sometimes we've been less good at it.\n\n35:59.940 --> 36:02.540\n And then you go around the world and some countries have absolutely sucked\n\n36:02.540 --> 36:03.540\n at it and some have been good at it.\n\n36:04.260 --> 36:07.860\n And so when you look into the Bitcoin world, I think that when you look at\n\n36:07.860 --> 36:12.460\n this optimization for security, similar to gold store value, people hold it.\n\n36:12.620 --> 36:15.020\n Purchasing power has gone up a lot year over year.\n\n36:15.020 --> 36:19.500\n It's like a 200% year over year compound annual growth for over a decade.\n\n36:19.620 --> 36:19.820\n Right?\n\n36:19.820 --> 36:22.860\n And so you measure this in kind of the us dollar exchange price, et cetera.\n\n36:23.420 --> 36:26.860\n But there's still a lot of people who will yell and scream about it's slow.\n\n36:27.180 --> 36:28.180\n It's costly, right?\n\n36:28.180 --> 36:32.300\n All the things around those transactions that are obstacles or challenges.\n\n36:32.740 --> 36:35.380\n And so there's basically two schools of thought, and this is where we\n\n36:35.380 --> 36:36.940\n kind of get into the bifurcation.\n\n36:37.260 --> 36:40.380\n Some people just said, Hey, this technology is antiquated.\n\n36:40.380 --> 36:41.180\n We can't use it.\n\n36:41.180 --> 36:42.100\n It doesn't make sense.\n\n36:42.340 --> 36:44.900\n Uh, and so what we're going to do is we're going to go build something new.\n\n36:45.180 --> 36:47.820\n And so you go get, you know, kind of all of the various versions there.\n\n36:48.700 --> 36:52.580\n The Bitcoin community says, no, just like gold had paper claims and other\n\n36:52.580 --> 36:55.820\n things built on top and layer two, three, four, five, we're going to do that here.\n\n36:55.820 --> 36:58.380\n And so they've already started to build kind of this layer two where\n\n36:58.540 --> 36:59.740\n it's easier to transact.\n\n36:59.740 --> 37:01.580\n It's cheaper, it's faster, et cetera.\n\n37:02.180 --> 37:05.980\n And so I actually think that both of those worlds are going\n\n37:05.980 --> 37:07.260\n to coexist in the future.\n\n37:07.580 --> 37:11.020\n The big question is just which one has more importance, right?\n\n37:11.020 --> 37:13.020\n So again, get out of binary.\n\n37:13.060 --> 37:14.340\n It's just probabilistically.\n\n37:14.860 --> 37:19.700\n And so my personal belief is that the security that the store of value\n\n37:19.700 --> 37:23.820\n component as the bedrock for a monetary system is essential, right?\n\n37:23.820 --> 37:28.340\n Like that is the most important thing because you can always improve\n\n37:28.340 --> 37:31.860\n the other components, but you can't go back and fix that kind of core piece.\n\n37:32.660 --> 37:37.460\n So money, money's a, an idea that we all it's like an emergent\n\n37:37.460 --> 37:38.580\n idea that we believe in.\n\n37:39.060 --> 37:44.260\n You're saying that security is one of the most fundamental catalysts or fuels\n\n37:44.540 --> 37:50.660\n for that idea to sort of take hold and be stable and sort of take over the world.\n\n37:50.660 --> 37:54.420\n The other stuff is really nice to have, but if you don't have the security,\n\n37:54.420 --> 37:57.820\n you're not going to, like, it's not going to spread in the viral\n\n37:57.820 --> 38:00.380\n sense in, in our human brains.\n\n38:00.860 --> 38:04.660\n Well, and especially in light of the kind of the macro economy, right?\n\n38:04.660 --> 38:09.180\n So like, what's so fascinating about the last 12 months is, um, in\n\n38:09.180 --> 38:12.140\n investing in general, the best returns, right?\n\n38:12.140 --> 38:15.340\n I kind of put that in air quotes a little bit is something that is different\n\n38:15.660 --> 38:17.460\n than everything else and right.\n\n38:17.460 --> 38:20.300\n So being different and wrong just means you're an idiot, right?\n\n38:20.420 --> 38:23.580\n Being different and right means that that's where kind of the outsize returns\n\n38:23.580 --> 38:27.660\n are. And so if you look around the world at currencies today, they're all the same.\n\n38:27.900 --> 38:32.340\n They're all inflationary, unlimited supply controlled by a government done and\n\n38:32.340 --> 38:34.900\n decisions made in a very non transparent process.\n\n38:35.620 --> 38:38.380\n And what we've watched is the manipulation of all of those currencies\n\n38:38.380 --> 38:43.300\n over the last 12 months in direct contrast to that is this thing, Bitcoin,\n\n38:43.300 --> 38:47.900\n which is outside of the system, has a finite supply, transparent and programmatic\n\n38:47.900 --> 38:53.140\n monetary policy. And so when you see those two systems kind of, um, in comparison\n\n38:53.140 --> 38:56.740\n to each other in the United States, there's a lot of people who say the dollar\n\n38:56.740 --> 39:00.260\n works great for me. I can go to the ATM, I can get out physical cash.\n\n39:00.300 --> 39:02.140\n If I want to swipe a card, I could do that.\n\n39:02.700 --> 39:06.340\n My money in my bank doesn't lose 50% of its value in a day in terms of\n\n39:06.340 --> 39:08.620\n purchasing power. Like the dollar's pretty good.\n\n39:09.340 --> 39:11.980\n When you go to other countries, that might not be the case.\n\n39:11.980 --> 39:16.300\n And so I do think that there's a kind of a relative analysis that goes on here.\n\n39:16.340 --> 39:19.740\n If you compare Bitcoin to the dollar, there's all kinds of arguments to make\n\n39:19.740 --> 39:22.260\n that the dollar is better as a medium of exchange today.\n\n39:22.900 --> 39:26.780\n But if I go and I tell you, well, what about in these kind of extreme examples\n\n39:26.780 --> 39:29.860\n of Venezuela, Zimbabwe, Turkey, et cetera.\n\n39:30.540 --> 39:34.420\n And so I think that that's kind of one perspective to view this through is\n\n39:34.460 --> 39:38.140\n security versus all of the innovative components of a medium of exchange, et\n\n39:38.140 --> 39:41.700\n cetera. The second thing, though, that I think is really important is\n\n39:41.700 --> 39:42.700\n around censorship.\n\n39:43.620 --> 39:47.340\n And so when you look at, again, every currency in the world today, every\n\n39:47.340 --> 39:51.060\n single financial service, they're highly susceptible to censorship.\n\n39:51.380 --> 39:54.780\n And actually, I would argue the United States is in the business of\n\n39:54.780 --> 39:58.940\n censorship in terms of how many countries around the world do we sanction\n\n39:59.180 --> 40:04.860\n and cut them off in either a minimal or a very material way from the global\n\n40:04.860 --> 40:08.140\n financial system. So when you define it, when you talk about censorship,\n\n40:08.140 --> 40:12.460\n do you mean just the censoring your ability to operate freely in the world?\n\n40:13.020 --> 40:16.220\n Well, look at it a little bit differently, which is that the United\n\n40:16.220 --> 40:20.020\n States has kind of the American superiority because we have the bombs,\n\n40:20.020 --> 40:22.660\n the bullets, the soldiers and that military might.\n\n40:23.140 --> 40:26.860\n We basically impose our will around the world.\n\n40:27.260 --> 40:32.300\n And so there's a very strong argument to be made that there are certain\n\n40:32.300 --> 40:35.660\n countries around the world that are being sanctioned, that the people\n\n40:35.660 --> 40:39.980\n of those countries did nothing wrong. Now, the governments are bad, right?\n\n40:39.980 --> 40:43.500\n In terms of the way that you and I would look at democratic rule or\n\n40:43.700 --> 40:48.060\n communism or whatever it is, but the people are being hurt as well.\n\n40:48.100 --> 40:51.020\n So there's a whole group of people who would just argue, listen, we\n\n40:51.020 --> 40:55.300\n shouldn't hurt anyone at the expense of punishing one person or a group\n\n40:55.300 --> 40:58.780\n of people. There's other people argue against that. But I do think that\n\n40:58.940 --> 41:02.700\n if you really kind of zoom out and you say, I'm going to take myself out\n\n41:02.700 --> 41:05.940\n of the Western worldview, and I'm simply going to look at this as we're\n\n41:05.940 --> 41:10.020\n all part of the human race, it's censorship. And there might be an\n\n41:10.140 --> 41:13.060\n argument for censorship, but there also might be an argument against\n\n41:13.060 --> 41:18.300\n the censorship. And so what Bitcoin does, as that specific kind of\n\n41:18.300 --> 41:21.300\n payment network is it says anyone in the world with an internet connection,\n\n41:21.460 --> 41:24.100\n I don't care where you were born, what language you speak, what\n\n41:24.100 --> 41:27.940\n religion you are, your wealth status, your education status, none of it\n\n41:27.940 --> 41:30.940\n matters. If you have an internet connection, you're not going to\n\n41:30.940 --> 41:34.540\n care. If you have an internet connection, you can plug into this\n\n41:34.540 --> 41:38.180\n monetary system. And you can move value around the world to anyone\n\n41:38.180 --> 41:43.060\n else without asking for permission. And in the United States, we\n\n41:43.060 --> 41:45.820\n basically have that ability in the US dollar kind of traditional\n\n41:45.820 --> 41:48.460\n banking system, I can pretty much send money to almost anyone I want\n\n41:48.460 --> 41:50.820\n unless they're a really bad person that's on some list or something.\n\n41:51.860 --> 41:54.900\n Most people in the world don't have that capability. And so what\n\n41:54.900 --> 41:59.820\n you're essentially doing is you're democratizing access to a true store\n\n41:59.820 --> 42:05.620\n value, and a medium of exchange, right. And so what you see in many\n\n42:05.620 --> 42:09.420\n of these countries is that when their currency starts to fail, the\n\n42:09.420 --> 42:13.500\n first thing that a government or a group of people in power and\n\n42:13.500 --> 42:16.980\n influence do is they lock the citizens into the currency with\n\n42:16.980 --> 42:22.220\n capital controls. Why? Because if you let them out, it exasperates\n\n42:22.220 --> 42:27.580\n the problem. And so now what we're seeing is we basically are giving\n\n42:27.580 --> 42:30.940\n a tool to billions of people around the world that is a peaceful\n\n42:30.940 --> 42:36.620\n protest. Right? You and I had no say at all. When not only the\n\n42:36.620 --> 42:38.500\n Federal Reserve and elected officials here in the United\n\n42:38.500 --> 42:41.180\n States, but central banks around the world over the last 12 months\n\n42:41.180 --> 42:44.460\n decided to create trillions of dollars and injected into the\n\n42:44.460 --> 42:47.380\n monetary system. Right? They have arguments, and some of them are\n\n42:47.380 --> 42:49.380\n very good arguments as to why they should do that. They're\n\n42:49.380 --> 42:51.740\n trying to mitigate short term pain. Long term, they'll figure\n\n42:51.740 --> 42:55.940\n out the other issues, right? They have very kind of elaborate and\n\n42:55.940 --> 42:58.660\n well articulated kind of viewpoint as to why they're\n\n42:58.660 --> 43:02.500\n doing it. But you and I had no say. And so when you start to\n\n43:02.500 --> 43:05.540\n look at, we have a very small group of people in this world,\n\n43:06.060 --> 43:08.420\n both in our country and in countries around the world that\n\n43:08.420 --> 43:12.340\n make these decisions that have very, very far reaching kind of\n\n43:12.340 --> 43:16.460\n impact. And on top of that, in many cases, there's actually not\n\n43:16.460 --> 43:19.580\n that much kind of accountability. Because usually\n\n43:19.580 --> 43:21.660\n these are not elected officials who are making some of these\n\n43:21.660 --> 43:24.900\n decisions, these are appointed. And you can argue that, hey, we\n\n43:24.900 --> 43:28.140\n elected somebody who appointed them. But at the same time, that\n\n43:28.140 --> 43:31.300\n accountability isn't quite there. And so I think ultimately,\n\n43:31.300 --> 43:33.940\n when you just back out, you say, you know, what is Bitcoin? Why\n\n43:33.940 --> 43:37.980\n is it important to the world? It is giving access to anyone in\n\n43:37.980 --> 43:40.380\n the world with an internet connection to a store of value\n\n43:40.540 --> 43:43.380\n and a monitoring network that allows them to peacefully\n\n43:43.380 --> 43:48.780\n protest and to opt out of a system that pretty much is not\n\n43:48.780 --> 43:50.860\n working for majority of people in the world.\n\n43:51.260 --> 43:54.020\n So it's moving the power from these centralized places,\n\n43:54.020 --> 43:58.940\n sometimes unelected to the individuals and to the people.\n\n43:59.740 --> 44:04.180\n So the dollar does seem to work for Americans and for many\n\n44:04.180 --> 44:08.500\n people in the world. But you kind of have a vision, you paint\n\n44:08.500 --> 44:11.380\n a picture of a future where potentially we move to\n\n44:11.380 --> 44:15.660\n cryptocurrency. So what kind of trajectory do you see where\n\n44:15.660 --> 44:19.220\n Bitcoin can become the main currency in the world, or at\n\n44:19.220 --> 44:23.220\n least cryptocurrency become the main way of storing value in the\n\n44:23.220 --> 44:25.220\n world and basically overtake the dollar?\n\n44:25.540 --> 44:29.980\n Yeah, so I always go first to we don't need to have competition\n\n44:30.020 --> 44:33.260\n like in terms of like a direct competition between the dollar\n\n44:33.300 --> 44:37.060\n and Bitcoin, right? If you look at most technologies in the\n\n44:37.060 --> 44:40.420\n world, the really valuable ones are actually market expanding\n\n44:40.420 --> 44:44.140\n technologies, rather than simply just market share stealing\n\n44:44.140 --> 44:47.460\n technologies, right. So if you look at Uber, for example, Uber\n\n44:47.460 --> 44:49.740\n didn't just say, Hey, I'm gonna go take out all the taxis,\n\n44:49.900 --> 44:52.900\n right? It actually drastically expanded the market for people\n\n44:52.900 --> 44:55.020\n now there's literally millions of people in the United States\n\n44:55.020 --> 44:57.900\n who don't have cars because they use Uber, right. And so I think\n\n44:57.900 --> 45:02.100\n that Bitcoin is very similar in that, yes, there is a component\n\n45:02.100 --> 45:06.020\n of medium of exchange, in terms of the dollar. But also there is\n\n45:06.020 --> 45:09.140\n this component of just store value assets in general. And so\n\n45:09.140 --> 45:11.860\n when you start to look at Bitcoin, specifically, I think\n\n45:11.860 --> 45:14.700\n that what you're seeing is you're seeing a generational gap,\n\n45:14.860 --> 45:17.900\n where young people say, I grew up with a phone in my hand, I'm\n\n45:17.900 --> 45:20.940\n digitally native, the whole idea of going to the bank and\n\n45:20.940 --> 45:24.820\n sending a wire, or going to an ATM and getting physical cash is\n\n45:24.820 --> 45:27.580\n an antiquated idea in their mind, right? I one time asked my\n\n45:27.580 --> 45:30.180\n brother, he's 24 years old. And I said, Hey, how do you send\n\n45:30.180 --> 45:32.980\n money to your friends? And he gave me one answer, which I\n\n45:32.980 --> 45:35.500\n expected, which was Venmo. And the second answer, I didn't\n\n45:35.500 --> 45:38.940\n expect he said Uber. I said, How do you send money via Uber? He\n\n45:38.940 --> 45:40.860\n said, Well, we get in a car together. And at the end, we\n\n45:40.860 --> 45:44.420\n split the ride. And so again, you and I have probably both\n\n45:44.420 --> 45:47.220\n done that. But I never thought of it as a way to send money to\n\n45:47.220 --> 45:51.100\n each other. And so it is a psychological difference between\n\n45:51.100 --> 45:54.020\n even me, who's only, you know, a decade older than him or so,\n\n45:54.660 --> 45:57.940\n and his peer group. And so I think as we're watching kind of\n\n45:57.940 --> 46:02.220\n Bitcoin continue this ascent, ultimately, what we're seeing is\n\n46:02.260 --> 46:05.580\n an entire generation of kids are saying, Listen, if I look at\n\n46:05.580 --> 46:08.780\n financial assets across the board, I have stocks, I have\n\n46:08.780 --> 46:12.100\n bonds, I have currencies, and I have commodities, I know that\n\n46:12.180 --> 46:16.380\n bonds, from a real rate return perspective, is flat to\n\n46:16.380 --> 46:19.380\n negative, right? I'm gonna make no money on this, because I have\n\n46:19.380 --> 46:23.580\n a belief that my dollar is being devalued. And actually, what\n\n46:23.580 --> 46:26.780\n we're starting to see is, again, the internet has broken down\n\n46:26.780 --> 46:30.140\n these walled gardens and kind of these centralized hubs of\n\n46:30.140 --> 46:33.260\n information, in that if you were to look at, let's say the stock\n\n46:33.260 --> 46:37.980\n market, from 1971 to today, in dollar terms, it's a 45 degree\n\n46:37.980 --> 46:39.900\n angle right up into the right, right, you know, it's kind of\n\n46:39.900 --> 46:44.220\n seven, 810% growth, every year, it's amazing, just get invested\n\n46:44.220 --> 46:45.940\n in the stock market, and you'll make money over a long period of\n\n46:45.940 --> 46:49.060\n time, regardless of the dips along the way. If you do not\n\n46:49.060 --> 46:52.380\n make that same stock market in gold, the stock market is down\n\n46:52.380 --> 46:57.140\n since 1971. And so is it so much that the stock market is accruing\n\n46:57.140 --> 47:00.020\n true value? Or is it that the underlying currency in which it\n\n47:00.020 --> 47:03.700\n is denominated in is being devalued? Right? And I was being\n\n47:03.700 --> 47:06.940\n devalued in a very disciplined way, right, in terms of it's not\n\n47:06.940 --> 47:10.180\n like it went 50% devaluation in a short period of time, but it's\n\n47:10.180 --> 47:13.260\n still being devalued. And so I think that people are waking up\n\n47:13.260 --> 47:16.740\n to this idea that a traditional 6040 type global portfolio\n\n47:16.820 --> 47:21.660\n doesn't work anymore, right? 40% of it in bonds is just not going\n\n47:21.660 --> 47:24.780\n to get it done. And so when you start to look at this, people\n\n47:24.780 --> 47:28.860\n first look at Bitcoin via two main ways, in my opinion, they\n\n47:28.860 --> 47:31.580\n look at it one as a store value, should I actually go and put\n\n47:31.580 --> 47:34.340\n some of my wealth there use it as a savings technology, right?\n\n47:34.340 --> 47:37.340\n We ask people in the traditional world, if you're a teacher, a\n\n47:37.340 --> 47:41.260\n fireman, an accounting, you know, mid level manager, we say,\n\n47:41.260 --> 47:44.100\n hey, go do your job, be best in class as a fireman or as a\n\n47:44.100 --> 47:45.900\n teacher. And then Oh, by the way, you have to be a\n\n47:45.900 --> 47:48.180\n professional investor as well. Because if you just put your\n\n47:48.180 --> 47:50.700\n dollars in your bank account, you're literally going to have\n\n47:50.700 --> 47:54.020\n your wealth devalued away over time. So you can't just save you\n\n47:54.020 --> 47:58.500\n have to invest. That is a really tall task for people, they have\n\n47:58.500 --> 48:00.860\n a hard enough time just doing their job, right? Taking care of\n\n48:00.860 --> 48:03.620\n their family, right? Now they got to go be an investor. So I\n\n48:03.620 --> 48:06.580\n think savings technology for Bitcoin standpoint is, if you\n\n48:06.580 --> 48:11.500\n buy satoshis or Bitcoin, over time, it will increase from a\n\n48:11.500 --> 48:13.420\n purchasing power standpoint, because there's a fixed supply\n\n48:13.420 --> 48:16.700\n and demand continues to rise. But then you start to look at\n\n48:16.700 --> 48:19.820\n well, what other assets do people put in their portfolios,\n\n48:19.980 --> 48:23.900\n whether it's art, it's real estate, precious metals, or\n\n48:23.900 --> 48:27.300\n something else. Most of those assets are not because people\n\n48:27.300 --> 48:29.740\n actually think that they're going to go up in value over\n\n48:29.740 --> 48:33.100\n time, they're using the store of value. Right? The reason why\n\n48:33.100 --> 48:35.660\n somebody buys gold is because the store of value, right\n\n48:35.660 --> 48:39.940\n historically, that's a narrative driven type asset, though,\n\n48:40.100 --> 48:43.060\n right? We tell people it's scarce, we tell people that it\n\n48:43.060 --> 48:46.100\n is a store of value. When you look at it, though, we don't\n\n48:46.100 --> 48:48.620\n know how much gold exists in the world, we have a good estimate,\n\n48:48.700 --> 48:50.980\n right? But we don't actually we can't prove how much there is.\n\n48:51.660 --> 48:53.660\n We don't know how much is coming out of the ground every day.\n\n48:53.700 --> 48:57.300\n Again, great, fantastic estimate. But we can't prove it.\n\n48:57.500 --> 48:59.260\n And we don't know what the total supply and that's what you mean\n\n48:59.260 --> 49:01.380\n by narrative driven, we can't really prove it, like\n\n49:01.380 --> 49:04.140\n mathematically, we you I and everyone else in the world has\n\n49:04.140 --> 49:06.780\n lived in a narrative driven world for the last couple of\n\n49:06.780 --> 49:10.140\n decades, right? And what the internet and digital technologies\n\n49:10.140 --> 49:14.180\n have done is it opened up the possibility and the desire from\n\n49:14.180 --> 49:19.340\n people to have a world now where I can validate things. So when I\n\n49:19.340 --> 49:24.220\n see that headline, I want to see you say whatever happened to the\n\n49:24.220 --> 49:26.340\n news, if you're the subject of the news, rather than have\n\n49:26.340 --> 49:29.620\n somebody else tell me the story. If I see that you say something\n\n49:29.620 --> 49:33.860\n is scarce, prove to me that it is scarce. And so I think that's\n\n49:33.860 --> 49:36.260\n kind of a psychological shift, the younger generation is\n\n49:36.260 --> 49:39.220\n starting to understand because ultimately, you and I probably\n\n49:39.220 --> 49:41.380\n grew up in a world where parents could tell us the story. And we\n\n49:41.380 --> 49:45.260\n just believed it. You know, dad or mom says it must be true. If\n\n49:45.260 --> 49:47.540\n my brother heard a story, what does he do? He goes to Google\n\n49:47.540 --> 49:50.140\n and he looks it up. Randy comes back and usually tells my\n\n49:50.140 --> 49:52.620\n parents, oh, you got the story wrong, right. And so I think\n\n49:52.620 --> 49:56.060\n that that that provability or that that validation ends up\n\n49:56.060 --> 49:57.980\n becoming really, really important. And so, you know,\n\n49:57.980 --> 50:00.460\n look at something like gold, I think that people are\n\n50:00.460 --> 50:03.780\n drastically underestimating the shift that's underway right now.\n\n50:03.780 --> 50:08.820\n Gold is one down in value since April, or I'm sorry, August of\n\n50:08.820 --> 50:13.860\n 2020. And so in a timeframe where central banks have had\n\n50:13.860 --> 50:16.540\n historic quantitative using literally $6 trillion in the\n\n50:16.540 --> 50:19.660\n United States, the one asset that historically has been the\n\n50:19.660 --> 50:23.180\n best store of value and has, you know, in 2008 financial crisis\n\n50:23.300 --> 50:26.580\n hit an all time high based on the government response has\n\n50:26.580 --> 50:31.580\n actually suffered for a main part of this financial crisis.\n\n50:32.380 --> 50:34.620\n You then look at central banks around the world who have been\n\n50:34.620 --> 50:37.660\n very large holders of gold for a long time and net buyers on a\n\n50:37.660 --> 50:41.540\n monthly basis. For multiple months, over the last six\n\n50:41.540 --> 50:45.020\n months, they've been net sellers of gold. And then you\n\n50:45.020 --> 50:47.860\n start to look at jewelry demand. So the actual non\n\n50:47.860 --> 50:53.020\n monetary value of gold, and that demand for gold jewelry peaked\n\n50:53.020 --> 50:57.100\n in 2013, and has continued to fall since. And so what you\n\n50:57.100 --> 50:59.740\n start to say to yourself is take just the asset of gold, which\n\n50:59.740 --> 51:03.020\n about $10 trillion market cap, and you say, Okay, well,\n\n51:03.020 --> 51:05.460\n jewelry demand continues to fall, even if it's at a slight\n\n51:05.460 --> 51:08.020\n rate, but it's continues to contract. You have central\n\n51:08.020 --> 51:11.380\n banks that now at some times are net sellers and sometimes net\n\n51:11.380 --> 51:14.620\n buyers, right? So okay, again, contraction there. And then from\n\n51:14.620 --> 51:19.020\n the investment standpoint, the actual price, the daily price of\n\n51:19.020 --> 51:21.940\n this continues to fall, which is a signal that there's a\n\n51:21.940 --> 51:25.100\n contracting demand from an investment perspective. That's\n\n51:25.100 --> 51:29.180\n 93% of all use of gold, only 7% of it's used for actual\n\n51:29.180 --> 51:32.300\n technology and metal conduction and things like that. And so\n\n51:32.300 --> 51:36.020\n you have a $10 trillion asset that it appears and again, maybe\n\n51:36.060 --> 51:38.380\n data changes, and I'll change my mind and other people change\n\n51:38.380 --> 51:41.220\n their mind, but it appears is on the decline. And so if that\n\n51:41.220 --> 51:43.620\n happens, you're going to get the contraction of a $10 trillion\n\n51:43.620 --> 51:47.460\n asset, where's all that value go. And what you're seeing is at\n\n51:47.460 --> 51:50.980\n the same time that that asset is contracting, you're also seeing\n\n51:50.980 --> 51:56.340\n a massive influx from not only retail investors, not only kind\n\n51:56.340 --> 51:58.900\n of the wealthy and the elite, but also from financial\n\n51:58.900 --> 52:02.980\n institutions, corporations, pension funds, etc. into this\n\n52:02.980 --> 52:04.380\n kind of digital sound money.\n\n52:04.420 --> 52:07.580\n So you're saying that there's a kind of shift from gold to\n\n52:07.580 --> 52:10.660\n Bitcoin, because they have a lot of the same properties, except\n\n52:10.660 --> 52:13.940\n one is in the physical space, the other is in the digital\n\n52:13.940 --> 52:18.100\n space. So do you see like central banks, quietly\n\n52:18.100 --> 52:24.380\n potentially switching out from sort of gold to Bitcoin, like\n\n52:24.380 --> 52:28.900\n naturally just doing is seeing a pattern that you're referring\n\n52:28.900 --> 52:31.660\n to now, but more drastically into the future, where there's\n\n52:31.660 --> 52:32.580\n a complete shift,\n\n52:32.660 --> 52:35.020\n if you line up the gold community and the Bitcoin\n\n52:35.020 --> 52:37.380\n community next to each other, they'll agree on all the\n\n52:37.380 --> 52:41.100\n problems that they that they see in the world, right? They'll\n\n52:41.100 --> 52:43.900\n actually agree on the solution that sound money is the solution\n\n52:43.900 --> 52:47.500\n where they differentiate is the gold communities believes that\n\n52:47.500 --> 52:50.660\n it's the analog application of sound money, right? The physical\n\n52:50.660 --> 52:53.860\n gold, that is the solution. The Bitcoin community believes the\n\n52:53.860 --> 52:56.500\n digital application of sound money, Bitcoin, can you define\n\n52:56.500 --> 52:59.020\n sound money, by the way, someone is just outside the system, and\n\n52:59.020 --> 53:01.700\n no one can create more of it. So nobody controls it. This is\n\n53:01.700 --> 53:05.500\n scarcity is fundamental. Exactly why scarcity important in money?\n\n53:06.020 --> 53:09.660\n I think scarcity just has this very high correlation to value\n\n53:09.660 --> 53:12.140\n across all assets, not just money, right? Money happens to\n\n53:12.140 --> 53:15.820\n be the unit of account that we use in terms of daily commerce.\n\n53:16.460 --> 53:21.380\n But whether it is, you know, as we're seeing now, sneakers, or\n\n53:21.420 --> 53:24.540\n you know, whatever it is, scarcity, ultimately, is that\n\n53:24.540 --> 53:27.860\n signal of value, I think, and that's just been the way that\n\n53:27.860 --> 53:31.140\n humans derive value for literally, you know, thousands\n\n53:31.140 --> 53:33.740\n and thousands of years. Yeah, I gotta say, that's my view on\n\n53:33.740 --> 53:37.700\n life and love in general, is scarcity is what makes it\n\n53:38.060 --> 53:40.220\n valuable. People talk about immortality.\n\n53:40.220 --> 53:43.820\n You know, I would like to be immortal, but it does, it does\n\n53:43.820 --> 53:50.460\n seem that when you let go of the finiteness of life, I feel like\n\n53:50.900 --> 53:56.500\n that meals and the experiences you have get devalued\n\n53:56.500 --> 54:00.860\n significantly, like, the longer you live, the less value there\n\n54:00.860 --> 54:05.540\n are in infinity, if you live forever, I worry that all the\n\n54:05.540 --> 54:08.820\n meaning will dissipate. And the same thing with love, I think\n\n54:08.820 --> 54:11.220\n criticism of sort of dating culture and all that kind of\n\n54:11.220 --> 54:15.580\n stuff. Like I haven't had shocking revelation that I've\n\n54:15.580 --> 54:19.060\n never been on a tinder date or any of those things. I believe\n\n54:19.060 --> 54:24.660\n that scarcity in dating and interaction is like, intensifies\n\n54:24.660 --> 54:28.140\n the value of when the interactions do happen. So, when\n\n54:28.140 --> 54:31.980\n they like when love does happen. And so in that sense, there's\n\n54:31.980 --> 54:34.900\n something magical about scarcity in the more subjective\n\n54:34.900 --> 54:38.860\n psychological social world, as well. And perhaps money is just\n\n54:38.860 --> 54:41.260\n another version of that, right? It's just it's all about the\n\n54:41.260 --> 54:43.420\n stories and ideas we tell ourselves.\n\n54:43.540 --> 54:46.060\n I think they're actually more interconnected than you're\n\n54:46.060 --> 54:49.420\n giving it credit for, right? Which is, what is money? Money\n\n54:49.420 --> 54:56.420\n is time, ultimately, right? The pursuit of the acquisition of\n\n54:56.420 --> 55:00.460\n money, right, of whether it's a currency or true money, is\n\n55:00.460 --> 55:04.060\n because that should give you more time, right? And that's\n\n55:04.060 --> 55:06.820\n what would give you more time. And so one of my favorite\n\n55:06.820 --> 55:10.740\n movies ever is, and it's funny, because Justin Timberlake is in\n\n55:10.740 --> 55:14.820\n it, is this movie in a lot of me, I lose most people at that\n\n55:14.820 --> 55:17.900\n point, in time, in time. And basically, the premise of the\n\n55:17.900 --> 55:21.060\n movie is that everyone has a clock that is embedded into\n\n55:21.060 --> 55:25.900\n their arm. And so if you go to work, you basically put your\n\n55:25.900 --> 55:28.220\n arm underneath when you leave, and there's time that's\n\n55:28.220 --> 55:31.220\n deposited into your clock. And if your clock ever hits all\n\n55:31.220 --> 55:35.300\n the arrows, you're dead, you die on the spot. And so there's\n\n55:35.300 --> 55:38.180\n a number of scenes where people are basically running, you know,\n\n55:38.180 --> 55:40.260\n to get to you, and I give you a little bit more time so that\n\n55:40.260 --> 55:43.220\n you can get to work on Monday, and then you work to acquire\n\n55:43.220 --> 55:46.460\n time. And so basically, time becomes this currency. But what\n\n55:46.460 --> 55:49.620\n becomes very fascinating about it is there are sections in\n\n55:49.620 --> 55:53.340\n society, where literally, there's physical places, if you\n\n55:53.340 --> 55:57.140\n only have, let's say, 72 hours or less, you're allowed to go to\n\n55:57.140 --> 56:00.220\n Section One. Section Five, though, is because you have\n\n56:00.220 --> 56:03.900\n years and years and years on your clock. And in this movie,\n\n56:03.940 --> 56:08.900\n everyone at the age of 25 freezes from a biological aging\n\n56:08.900 --> 56:12.060\n standpoint. So everyone stays the same, but you may have lived\n\n56:12.060 --> 56:16.180\n for 1000 years. And so what becomes so fascinating about it\n\n56:16.460 --> 56:20.500\n is that rich people have time, poor people do not have time.\n\n56:21.020 --> 56:23.980\n And so in it, Justin Timberlake, the main character at one\n\n56:23.980 --> 56:27.860\n point, essentially acquires a bunch of time, and he's able to\n\n56:27.860 --> 56:32.180\n go to one of the higher levels. And now he's attending all these\n\n56:32.180 --> 56:35.300\n galas and, you know, poker nights and all this stuff. And\n\n56:35.300 --> 56:39.580\n one of the first things that he learns is that in the lower end\n\n56:39.580 --> 56:43.060\n of society, everyone is running everywhere at all times in the\n\n56:43.060 --> 56:46.740\n movie, because time is so finite, and it is so scarce.\n\n56:46.820 --> 56:49.500\n And so therefore, why would I walk down the street, I must run\n\n56:49.500 --> 56:54.940\n down the street. In the highest level of society, no one runs\n\n56:54.940 --> 56:58.620\n anywhere. And in fact, if you run, you are seen as lower\n\n56:58.620 --> 57:03.100\n class. Yeah, because wealth is time. And so that movie is, you\n\n57:03.100 --> 57:05.780\n know, it's got a ton of kind of things that you can pull out of\n\n57:05.780 --> 57:10.100\n it, but to me is the perfect epitome of money is time. And so\n\n57:10.100 --> 57:14.820\n when you start to think about the acquisition of money, right,\n\n57:14.820 --> 57:17.140\n it goes to this whole idea of time billionaire. And I know\n\n57:17.140 --> 57:20.100\n that there's probably a lot of people who've heard about this\n\n57:20.100 --> 57:24.900\n already. But if you think of a million seconds, it's about 11\n\n57:24.900 --> 57:30.580\n days, a billion seconds is 31 years. And so if I said to\n\n57:30.580 --> 57:34.220\n somebody, you have to switch lives with Warren Buffett,\n\n57:34.820 --> 57:38.180\n would you do it? Some people would say, Sure, that'd be\n\n57:38.180 --> 57:41.100\n their initial reaction. But you got have to be you know, 92\n\n57:41.100 --> 57:46.060\n years old, is the money worth the lack of time? Most people\n\n57:46.060 --> 57:48.780\n would say no, right? And there's this guy, Graham Duncan, who\n\n57:48.780 --> 57:52.700\n really articulated this well. And ultimately, what ends up\n\n57:52.700 --> 57:54.980\n happening is you rest time is more valuable than the money.\n\n57:55.340 --> 58:00.300\n But the you acquire the money to gain more time. And the reason\n\n58:00.300 --> 58:03.580\n is valuable is because of the scarcity of time. We currently\n\n58:03.580 --> 58:10.300\n have the by the biology, the physics means that this is not\n\n58:10.300 --> 58:13.180\n just the narrative we tell ourselves, maybe it is, I don't\n\n58:13.180 --> 58:18.820\n know, but it feels like pretty sure we're mortal. And in that\n\n58:18.820 --> 58:22.620\n sense, the scarcity there gives value to time, it's fascinating\n\n58:22.620 --> 58:26.380\n to think about all the thought experiments here of if that\n\n58:26.380 --> 58:28.780\n could actually be on the economy, if you can actually\n\n58:28.780 --> 58:32.620\n convert time in a frictionless way to money.\n\n58:33.140 --> 58:35.740\n Well, and if you start to pull on this a little bit and say,\n\n58:35.740 --> 58:38.340\n okay, a young person today, let's say somebody in their\n\n58:38.380 --> 58:41.860\n 20s, has about 2 billion seconds left in their life, right, kind\n\n58:41.860 --> 58:47.260\n of 60 years, give or take, based on life expectancy. They\n\n58:47.500 --> 58:51.660\n usually, until they start to understand this concept, think\n\n58:51.660 --> 58:57.500\n of wealth in dollar terms. But dollars are being devalued. And\n\n58:57.500 --> 59:00.140\n so you know, a million dollars doesn't get you what it used to\n\n59:00.140 --> 59:03.340\n get, right is kind of an old adage. And so what you're doing\n\n59:03.340 --> 59:07.540\n is you're pursuing something that ends up losing value. And\n\n59:07.540 --> 59:11.220\n so it's the constant rat race, it's how do I constantly try to\n\n59:11.220 --> 59:13.020\n get more? How do I get more dollars? How do I get more\n\n59:13.020 --> 59:15.900\n dollars? Because even if I say to myself, you know, I'm going\n\n59:15.900 --> 59:21.340\n to retire when I get $100,000. When I get the $100,000, the\n\n59:21.340 --> 59:23.740\n $100,000 five years from now doesn't buy me what I thought it\n\n59:23.740 --> 59:27.340\n did. So now I need 500,000 or 200,000 or a million or whatever\n\n59:27.340 --> 59:29.860\n the number is. And so ultimately, what ends up\n\n59:29.900 --> 59:33.660\n occurring is that the Bitcoin community and many people in\n\n59:33.660 --> 59:36.980\n kind of this idea of sound money is you want to be able to\n\n59:36.980 --> 59:41.540\n acquire an asset that not only will hold the value, right, the\n\n59:41.540 --> 59:45.340\n store of value over time, but it will actually appreciate over\n\n59:45.340 --> 59:48.860\n time. And so when you look at something like Bitcoin against\n\n59:48.860 --> 59:51.940\n the dollar against other types of assets, all of these assets\n\n59:51.940 --> 59:55.100\n are down compared to Bitcoin, right? Now, some of that's just\n\n59:55.220 --> 59:58.660\n in the early days of kind of the pricing of an asset, you go from\n\n59:58.660 --> 1:00:01.780\n very small to something much larger. But now what you start\n\n1:00:01.780 --> 1:00:04.540\n to look at is well, if you have a finite supply of something,\n\n1:00:05.140 --> 1:00:09.980\n what ends up happening is people begin to value it more. And so\n\n1:00:10.260 --> 1:00:13.740\n in a world where dollars are infinite, and other fiat\n\n1:00:13.740 --> 1:00:17.660\n currencies are infinite, Bitcoin becomes very, very interesting,\n\n1:00:17.660 --> 1:00:21.860\n very special, and something that is very aspirational. And so I\n\n1:00:21.860 --> 1:00:23.300\n think that's where you're starting to see people say,\n\n1:00:23.300 --> 1:00:28.260\n wait a second, this is something where that finite, secure store\n\n1:00:28.260 --> 1:00:32.580\n of value is essential to wealth generation and preservation over\n\n1:00:32.580 --> 1:00:33.380\n a long period of time.\n\n1:00:33.980 --> 1:00:37.540\n And if Sam Harris is right, that free will is an illusion. This\n\n1:00:37.540 --> 1:00:42.460\n is really interesting to think about. Maybe time is a kind of\n\n1:00:42.460 --> 1:00:46.540\n blockchain, because you can't change anything. And then the\n\n1:00:46.540 --> 1:00:54.580\n physical space time of the universe is a ledger. So maybe\n\n1:00:55.060 --> 1:00:58.580\n it won't be Bitcoin that replaces gold, maybe it'll be\n\n1:00:58.700 --> 1:01:03.100\n time, once we crack open that, in fact, the universe is fully\n\n1:01:03.100 --> 1:01:05.900\n deterministic. So maybe that's what like Eric Weinstein is\n\n1:01:05.900 --> 1:01:09.700\n afraid of, once you figure out the theories of everything of\n\n1:01:09.700 --> 1:01:15.220\n physics, we'll be able to then start trading, create a market\n\n1:01:15.220 --> 1:01:19.700\n out of like the very fabric of reality. And that way break it.\n\n1:01:19.780 --> 1:01:25.060\n Well, if you look at infinite inflationary type currencies,\n\n1:01:25.380 --> 1:01:27.900\n you can't do that, right? Because it constantly is losing\n\n1:01:27.900 --> 1:01:31.780\n value. When you look at a finite asset, again, that has the\n\n1:01:31.780 --> 1:01:36.900\n provability of the actual finite element to it. Ultimately, the\n\n1:01:36.900 --> 1:01:42.820\n wealth is that marketplace. Yeah. And so, you know, I always\n\n1:01:42.820 --> 1:01:47.140\n kind of try to highlight for people, the top 55% of Americans\n\n1:01:47.380 --> 1:01:51.460\n understand something that the bottom 45% don't, they invest,\n\n1:01:51.940 --> 1:01:56.780\n right, the bottom 45% consume the top 55% invest. And that's\n\n1:01:56.780 --> 1:01:59.700\n why we have a wealth inequality gap. And it continues to get\n\n1:01:59.740 --> 1:02:02.620\n wider and wider and wider is because the people who are\n\n1:02:02.620 --> 1:02:06.660\n holding the devaluing assets, and saving are watching their\n\n1:02:06.660 --> 1:02:09.260\n wealth be devalued away. And there's arguments and\n\n1:02:09.260 --> 1:02:11.980\n controversy over how fast that's happening, but it's\n\n1:02:11.980 --> 1:02:15.460\n happening. The people who are holding the assets that have any\n\n1:02:15.460 --> 1:02:18.380\n level of scarcity, right, real estate may not be finite, but\n\n1:02:18.380 --> 1:02:22.660\n it's scarce, right? Art may not be finite, but it's scarce. Gold\n\n1:02:22.660 --> 1:02:26.580\n may not be finite, but it's scarce. Those assets continue to\n\n1:02:26.620 --> 1:02:30.300\n appreciate against the devaluing currency. And so when\n\n1:02:30.300 --> 1:02:35.140\n you then say, No, I have complete finite supply, with\n\n1:02:35.140 --> 1:02:38.180\n provability, and this transparency around it, where\n\n1:02:38.180 --> 1:02:41.940\n everyone knows how much is there and what where it's going. And\n\n1:02:41.940 --> 1:02:45.300\n now all of a sudden, you and I can transact back and forth that\n\n1:02:45.300 --> 1:02:48.460\n value. And it is a representation of time. Because\n\n1:02:48.460 --> 1:02:51.860\n what I can essentially do is if I gather or acquire more of\n\n1:02:51.860 --> 1:02:57.500\n that wealth, I then can apply leverage to my life. I can use\n\n1:02:57.500 --> 1:03:03.820\n machines, humans, or some other resources. And basically now\n\n1:03:03.860 --> 1:03:05.020\n free up my time.\n\n1:03:05.100 --> 1:03:07.660\n Yeah, and it's not fun about the way you are trading time.\n\n1:03:07.660 --> 1:03:12.260\n Maybe it's a little bit indirect, but maybe not. So just\n\n1:03:12.260 --> 1:03:15.500\n because I brought up Eric and you're on Twitter, I'd love to\n\n1:03:15.500 --> 1:03:19.620\n hear your opinions. I talk to him a lot. He seems to have\n\n1:03:19.620 --> 1:03:23.780\n stepped into the beautiful dance of human communication and the\n\n1:03:23.780 --> 1:03:26.340\n social dynamics that is the Bitcoin cryptocurrency\n\n1:03:26.340 --> 1:03:33.780\n community. Do you have thoughts on gauge, theoretic concepts,\n\n1:03:33.780 --> 1:03:37.740\n conceptualization of the world, or just Eric in general? He's\n\n1:03:37.740 --> 1:03:40.860\n got a lot of love in his heart, and he's got a grace in the way\n\n1:03:40.860 --> 1:03:46.660\n he communicates. But he's also loves to play with ideas and\n\n1:03:46.660 --> 1:03:49.460\n seems to have touched a sensitive point with the Bitcoin\n\n1:03:49.460 --> 1:03:52.900\n community. Is there anything you could say that's hopeful,\n\n1:03:52.900 --> 1:03:55.940\n inspiring about that whole dynamic that went down?\n\n1:03:56.700 --> 1:04:00.100\n So I don't know all the details. But what I will say is I've\n\n1:04:00.100 --> 1:04:03.820\n listened to a number of his podcasts, and him and there's a\n\n1:04:03.820 --> 1:04:07.340\n whole bunch of people like him. I basically put them in the\n\n1:04:07.340 --> 1:04:10.660\n bucket of they're an independent thinker who are courageous\n\n1:04:10.660 --> 1:04:15.820\n enough to speak their truth, whatever that may be. They are\n\n1:04:15.820 --> 1:04:20.740\n humble enough to revisit their ideas and say, I got this right,\n\n1:04:20.780 --> 1:04:23.020\n I got this wrong information change, I'll change my mind.\n\n1:04:23.500 --> 1:04:25.900\n Obviously, a sign of intelligence to be able to do\n\n1:04:25.900 --> 1:04:28.380\n that type of stuff. And I actually think that one of the\n\n1:04:28.380 --> 1:04:30.820\n most scarce things in our society are those independent\n\n1:04:30.820 --> 1:04:33.620\n thinkers who are able to do all this. Right? Speaking of\n\n1:04:33.620 --> 1:04:38.460\n scarcity. Yeah. And so to me, I put Eric and the whole host of\n\n1:04:38.460 --> 1:04:40.780\n other people kind of, if you look at like the intellectual\n\n1:04:40.780 --> 1:04:44.460\n dark web is kind of a label that's been used. They're\n\n1:04:44.460 --> 1:04:47.100\n actually some of the most important people in our society,\n\n1:04:47.420 --> 1:04:50.020\n because they're the people who are willing to stand up against\n\n1:04:50.020 --> 1:04:54.340\n the mass kind of thought process. They're willing to talk\n\n1:04:54.340 --> 1:04:57.100\n about things that others may think are taboo, right? They're\n\n1:04:57.100 --> 1:05:00.340\n willing to change their mind, which all of a sudden has become\n\n1:05:00.340 --> 1:05:04.020\n a bad thing rather than a good thing. And so when I see the\n\n1:05:04.020 --> 1:05:08.140\n exploration of ideas in public, I actually think that those are\n\n1:05:08.140 --> 1:05:12.740\n the people who are most open to the kind of VM it blowback as\n\n1:05:12.740 --> 1:05:15.700\n well. Right? Because that's part of what they're doing is that\n\n1:05:15.700 --> 1:05:18.100\n they're eliciting, hey, I'm going to throw an idea into the\n\n1:05:18.100 --> 1:05:20.660\n arena. If it doesn't get attacked, they actually may be\n\n1:05:20.660 --> 1:05:23.620\n more nervous than if there is some level of, you know, kind of\n\n1:05:23.620 --> 1:05:26.620\n war of attrition, if you will. And so what I've seen with a\n\n1:05:26.620 --> 1:05:29.180\n number of the people who have done this, everyone from some of\n\n1:05:29.180 --> 1:05:31.100\n the best, you know, hedge fund managers and kind of money\n\n1:05:31.100 --> 1:05:33.260\n managers in the world, all the way to what I'll consider some\n\n1:05:33.260 --> 1:05:37.740\n of the most intellectual people in the world is they play with\n\n1:05:37.740 --> 1:05:40.020\n these ideas. And they play with the ideas and they play with\n\n1:05:40.020 --> 1:05:42.300\n them and they put them and they all arrive at the same\n\n1:05:42.300 --> 1:05:45.180\n conclusion. And sometimes it takes a month, sometimes it\n\n1:05:45.180 --> 1:05:49.060\n takes years, but they arrive at this Bitcoin thesis. And what's\n\n1:05:49.060 --> 1:05:52.740\n so interesting about it is it highlights something that many\n\n1:05:52.740 --> 1:05:56.140\n people view as a bug. But I think people in the Bitcoin\n\n1:05:56.140 --> 1:05:59.940\n community view as a feature, which is that community. And so\n\n1:05:59.940 --> 1:06:02.940\n what ends up happening is when you have something that is as\n\n1:06:02.940 --> 1:06:07.820\n ambitious as creating a global reserve currency doesn't mean\n\n1:06:07.820 --> 1:06:10.060\n needs to unseat any of the existing ones, but become the\n\n1:06:10.060 --> 1:06:12.500\n global reserve currency of the internet, right, this digital\n\n1:06:12.500 --> 1:06:16.260\n economy, you need shepherds of it. And so just like a\n\n1:06:16.260 --> 1:06:19.260\n technology company wants to find those loyal fans that are\n\n1:06:19.260 --> 1:06:22.740\n willing to go out and market and word of mouth and, and kind of\n\n1:06:22.740 --> 1:06:27.980\n not only promote it, but also protect it. This technology\n\n1:06:27.980 --> 1:06:31.260\n that is this decentralized thing, which uses a financial\n\n1:06:31.260 --> 1:06:35.460\n incentive in order to elicit the buy in, not from a financial\n\n1:06:35.460 --> 1:06:39.940\n perspective, but from a mental energy standpoint, has built one\n\n1:06:39.940 --> 1:06:44.500\n of the most rabid, powerful and engaged communities on the\n\n1:06:44.500 --> 1:06:48.660\n internet. And what ends up happening is those people have\n\n1:06:48.660 --> 1:06:52.940\n thought more about these ideas, and actually challenged those\n\n1:06:52.940 --> 1:06:56.260\n ideas more than anyone else in the world. And so I've got a lot\n\n1:06:56.260 --> 1:06:59.100\n of folks who will just say, there's this guy Marty Bent, who\n\n1:06:59.100 --> 1:07:02.660\n will talk all the time about the Bitcoin critics haven't done\n\n1:07:02.660 --> 1:07:05.260\n their homework in a lot of cases. So they show up and\n\n1:07:05.260 --> 1:07:07.580\n sometimes it's super intellectual, lazy arguments,\n\n1:07:07.620 --> 1:07:10.180\n sometimes actually very well thought out arguments, you know,\n\n1:07:10.180 --> 1:07:13.500\n on the counter to the Bitcoin thesis. But ultimately, what\n\n1:07:13.500 --> 1:07:16.180\n ends up happening is you're talking to somebody who's an\n\n1:07:16.180 --> 1:07:18.700\n expert, they've been thinking about for five, seven, eight, 10\n\n1:07:18.700 --> 1:07:20.580\n years, right? They've gone through every simulation you\n\n1:07:20.580 --> 1:07:25.060\n possibly can. And they show up with data, examples, and\n\n1:07:25.060 --> 1:07:27.940\n responses. Now, they're not always right. But they've just\n\n1:07:27.940 --> 1:07:31.340\n done the work. And so what I actually like about folks like\n\n1:07:31.340 --> 1:07:33.460\n Eric and others is as they're kind of going through this\n\n1:07:33.460 --> 1:07:36.900\n journey, they're incredibly smart, right? And they provide,\n\n1:07:37.340 --> 1:07:41.060\n or they apply a lot of intellectual rigor to some of\n\n1:07:41.060 --> 1:07:43.540\n these arguments. And so what it does is what does it do? It's a\n\n1:07:43.540 --> 1:07:48.060\n marketplace. It keeps people honest. Let me sort of make a\n\n1:07:48.060 --> 1:07:50.540\n few comments. It's kind of interesting. So you're exactly\n\n1:07:50.540 --> 1:07:54.940\n right. Maybe the blowback is part of the mechanism that\n\n1:07:54.940 --> 1:07:57.660\n actually develops these ideas and so on. I do want to kind of\n\n1:07:57.660 --> 1:08:01.540\n speak to a little bit of the toxicity that I've experienced\n\n1:08:01.540 --> 1:08:04.340\n in the Bitcoin community. I kind of see it, the Bitcoin\n\n1:08:04.340 --> 1:08:06.940\n community, I think you paint a really nice picture, which I\n\n1:08:06.940 --> 1:08:10.540\n kind of see it as an immune system that protects against\n\n1:08:10.540 --> 1:08:17.140\n sort of the viruses that are bad ideas. That said, the immune\n\n1:08:17.140 --> 1:08:21.900\n system can destroy a body, right? And the thing you\n\n1:08:21.900 --> 1:08:25.780\n mentioned about Eric and maybe about myself, and in general,\n\n1:08:25.780 --> 1:08:29.940\n just people exploring ideas, is there is a Dunning Kruger\n\n1:08:29.940 --> 1:08:34.060\n effect, which is when you first start exploring ideas deeply,\n\n1:08:34.540 --> 1:08:39.420\n you have an overblown level of confidence about like how much\n\n1:08:39.420 --> 1:08:42.020\n you understand. And that's actually the process about\n\n1:08:42.020 --> 1:08:44.380\n learning, then you realize you don't understand much. What\n\n1:08:44.380 --> 1:08:48.860\n I've noticed with the Bitcoin community is they're not as\n\n1:08:49.140 --> 1:08:52.780\n patient with the basics of the Dunning Kruger effect. Like if\n\n1:08:52.780 --> 1:08:58.220\n I step in and make declarative statements about Bitcoin, like\n\n1:08:58.500 --> 1:09:03.940\n I, you know, I read a long time ago, the white paper, like at\n\n1:09:03.940 --> 1:09:08.980\n the cursory level, I felt that I understand the technology,\n\n1:09:08.980 --> 1:09:11.620\n this is basic intuitions. You know, I didn't think about the\n\n1:09:11.620 --> 1:09:14.260\n social dynamics. I didn't think about any like financial\n\n1:09:14.260 --> 1:09:17.620\n implications and a lot of the deep, actually the ongoing\n\n1:09:17.620 --> 1:09:20.100\n innovations and all that kind of stuff. But I thought I\n\n1:09:20.100 --> 1:09:22.260\n understood that technology. And so I step in and make\n\n1:09:22.260 --> 1:09:25.540\n declarative statements. I think those are the first time you\n\n1:09:25.540 --> 1:09:28.100\n say, okay, what's the role of Bitcoin in the world? You start\n\n1:09:28.100 --> 1:09:31.860\n thinking about it deeply. And then you make statements. The\n\n1:09:31.860 --> 1:09:36.020\n toxicity that you get in those first few statements is really\n\n1:09:36.020 --> 1:09:38.900\n off putting to me. I'm somebody that tries to communicate love\n\n1:09:38.900 --> 1:09:44.900\n and live that with everything I do. And there is a level of\n\n1:09:44.900 --> 1:09:48.020\n disrespect that I've experienced, not directly just\n\n1:09:48.020 --> 1:09:51.300\n observing others, people have been mostly kind to me. And I\n\n1:09:51.300 --> 1:09:55.940\n appreciate that. But if you're going to criticize me about my\n\n1:09:55.940 --> 1:09:59.540\n exploration of ideas in Bitcoin, you have to also\n\n1:09:59.540 --> 1:10:02.740\n acknowledge that I'm a human being that got like a PhD in\n\n1:10:02.740 --> 1:10:06.900\n stuff. Like I did some hard shit that it could be in farming or\n\n1:10:06.900 --> 1:10:09.780\n it could be in whatever. Like I've lived life and I've\n\n1:10:09.780 --> 1:10:12.500\n really thought deeply and I really care. Like I know a lot\n\n1:10:12.500 --> 1:10:17.540\n of shit. And it's possible that I actually have a lot of ideas\n\n1:10:17.540 --> 1:10:22.100\n that you can learn from. Now, if it's agriculture, fine. Or if\n\n1:10:22.100 --> 1:10:25.060\n it's artificial intelligence, fine. Like I know what I'm\n\n1:10:25.060 --> 1:10:27.780\n talking about, about certain things. And I could be wrong\n\n1:10:27.780 --> 1:10:29.940\n about a lot of things. And there's like an exchange of\n\n1:10:29.940 --> 1:10:35.620\n ideas that makes that mechanism that you talked about more\n\n1:10:35.620 --> 1:10:38.660\n efficient. Sometimes when the blowback is too strong too\n\n1:10:38.660 --> 1:10:42.660\n early on, the development of ideas is just inefficient. And\n\n1:10:42.660 --> 1:10:46.900\n I'm not sure if there's a, you know, the way it was explained\n\n1:10:46.900 --> 1:10:53.940\n to me is that for so long, that community was like bombarded\n\n1:10:53.940 --> 1:10:58.100\n with just like bad ideas, like criticisms. They're just overly\n\n1:10:58.100 --> 1:11:03.860\n sensitive now to bullshit. They're like triggered by\n\n1:11:03.860 --> 1:11:07.060\n statements. They've heard it all before and they're like,\n\n1:11:07.060 --> 1:11:10.500\n oh, there they go again with the same old arguments. But\n\n1:11:10.500 --> 1:11:14.660\n that doesn't mean that you have to sort of, I guess, develop\n\n1:11:14.660 --> 1:11:18.420\n patience and so on. Especially when you feel like in my case\n\n1:11:18.420 --> 1:11:20.820\n that the person is coming from a good place, right? I don't\n\n1:11:20.820 --> 1:11:23.940\n know if there's something you could say that's positive about\n\n1:11:23.940 --> 1:11:26.500\n the future of this kind of overcoming this toxicity.\n\n1:11:26.500 --> 1:11:29.300\n I think there's a couple of trends that are all kind of\n\n1:11:29.300 --> 1:11:32.580\n coalescing here in these types of experiences. So one is when\n\n1:11:32.580 --> 1:11:35.860\n you look at a community, there's always a spectrum in\n\n1:11:35.860 --> 1:11:39.460\n terms of there's some people who over index on kindness and\n\n1:11:39.460 --> 1:11:41.700\n stupidity. And there's some people who over index on\n\n1:11:41.700 --> 1:11:45.300\n intelligence and basically just being an asshole. And then you\n\n1:11:45.300 --> 1:11:48.740\n get everyone in between. And so naturally, as we know, the\n\n1:11:48.740 --> 1:11:52.740\n extremist ends of any community end up being the loudest\n\n1:11:52.740 --> 1:11:58.820\n usually. The second thing is there is from the outsider\n\n1:11:58.820 --> 1:12:02.580\n view, like at the beginning of the exploration of ideas, it's\n\n1:12:02.580 --> 1:12:06.740\n very much a learning process. I don't know if I understand\n\n1:12:06.740 --> 1:12:11.140\n this or not, but here's ideas A, B, and C. From the internal\n\n1:12:11.140 --> 1:12:14.660\n perspective, there's a trillion dollars of value at stake and\n\n1:12:14.660 --> 1:12:18.500\n we must protect it with our lives. The truth is probably\n\n1:12:18.500 --> 1:12:21.460\n somewhere in between there. And again, the world's not black\n\n1:12:21.460 --> 1:12:24.260\n and white. There's this kind of more gray area that I think\n\n1:12:24.260 --> 1:12:28.020\n actually is where most people exist. The other thing that's\n\n1:12:28.020 --> 1:12:32.500\n at play here is I think the Bitcoin community understands\n\n1:12:32.500 --> 1:12:35.940\n the internet and internet culture and narratives better\n\n1:12:35.940 --> 1:12:39.540\n than almost anyone. And so you see this with kind of the just\n\n1:12:39.540 --> 1:12:44.500\n complete destruction of narratives with memes and just\n\n1:12:44.500 --> 1:12:48.020\n the visceral reaction and the use of things like Reddit and\n\n1:12:48.020 --> 1:12:53.140\n Twitter and YouTube, podcasts, just areas where I think a lot\n\n1:12:53.140 --> 1:12:58.580\n about if you are an upstart and you are going to go challenge\n\n1:12:58.580 --> 1:13:03.700\n the most well respected elite kind of establishment\n\n1:13:03.700 --> 1:13:07.940\n institutions in the world, if you walk in in a suit and tie\n\n1:13:07.940 --> 1:13:12.260\n and you say, I'm here to debate you with ideas, you're going to\n\n1:13:12.260 --> 1:13:15.780\n get your clock cleaned because they're going to trot out their\n\n1:13:15.780 --> 1:13:18.900\n lawyers, their regulators, their lobbyists, right? Like all this\n\n1:13:18.900 --> 1:13:23.060\n stuff. If you instead say, I'm going to meme you to death on\n\n1:13:23.060 --> 1:13:26.020\n the internet and I'm going to control the public narrative.\n\n1:13:26.020 --> 1:13:29.220\n You've shifted the power. The asymmetry of power is more\n\n1:13:29.220 --> 1:13:32.660\n symmetrical now. It's the ultimate insurgency, right? If\n\n1:13:32.660 --> 1:13:36.180\n you bring it back to the the conflict. Yes. And so when you\n\n1:13:36.180 --> 1:13:39.460\n think about this, you have to lean into the advantage that\n\n1:13:39.460 --> 1:13:44.900\n you have. And so what ends up happening is you and I would\n\n1:13:44.900 --> 1:13:48.660\n absolutely lose it if we saw JP Morgan or Goldman Sachs or the\n\n1:13:48.660 --> 1:13:52.420\n Federal Reserve start tweeting memes. Yeah, right. It it would\n\n1:13:52.420 --> 1:13:56.180\n almost the the validation that would give to the medium and\n\n1:13:56.180 --> 1:14:01.380\n the even playing field that it would provide would pull these\n\n1:14:01.380 --> 1:14:06.020\n establishments down to the level of what is this upstart?\n\n1:14:06.020 --> 1:14:08.660\n But now what you're starting to see is that the Bitcoin\n\n1:14:08.660 --> 1:14:13.300\n community, even though there's some level of toxicity at\n\n1:14:13.300 --> 1:14:16.820\n times, even though there's this visceral reaction, sometimes\n\n1:14:16.820 --> 1:14:21.460\n there's even what I would call bullying or or or kind of\n\n1:14:21.460 --> 1:14:23.780\n outward projection of things, right? Even though it may be a\n\n1:14:23.780 --> 1:14:26.980\n small percentage, it'll happen every once in a while. What\n\n1:14:26.980 --> 1:14:30.100\n they do understand, though, is that these establishments are\n\n1:14:30.100 --> 1:14:33.300\n made up of humans. And what you can actually do, one of the\n\n1:14:33.300 --> 1:14:37.460\n best ways to pick apart an institution is to recruit from\n\n1:14:37.460 --> 1:14:41.220\n inside of them one by one. Yes. And so what you're starting\n\n1:14:41.220 --> 1:14:44.420\n to see now is I mean, I get the messages on Twitter and\n\n1:14:44.420 --> 1:14:47.940\n LinkedIn all the time. Hey, I'm a banker by trade, but I'm a\n\n1:14:47.940 --> 1:14:51.620\n bitcoiner at heart, right? And so what you're doing is you're\n\n1:14:51.620 --> 1:14:55.300\n essentially infiltrating the organizations, not in in\n\n1:14:55.300 --> 1:15:00.500\n physical, you know, population. Yeah. But with the ideas and\n\n1:15:00.500 --> 1:15:04.260\n with the philosophies, banker in the streets, bitcoiner in the\n\n1:15:04.260 --> 1:15:10.100\n sheets. Yeah. Okay. I like it. With that said, in terms of\n\n1:15:10.100 --> 1:15:17.940\n shitposting and memes, I gotta say like bring it on because I\n\n1:15:17.940 --> 1:15:22.100\n believe in terms of asymmetry of power, I believe in that\n\n1:15:22.100 --> 1:15:28.020\n love will save the world, not memes. Or at least good vibe\n\n1:15:28.020 --> 1:15:31.380\n memes as opposed to shitposting. It's an interesting\n\n1:15:31.380 --> 1:15:34.100\n battleground, though. It's an interesting battleground to\n\n1:15:34.100 --> 1:15:37.300\n think about. The other thing I would say, too, is one of the\n\n1:15:37.300 --> 1:15:42.020\n elements that's always kind of funny to me is how much of the\n\n1:15:42.020 --> 1:15:45.620\n entertainment is love, right? So, when you start to think\n\n1:15:45.620 --> 1:15:48.340\n about how many of the memes that are posted, for example,\n\n1:15:48.340 --> 1:15:52.340\n are for outsiders versus insiders. Yes. Laser eyes,\n\n1:15:52.340 --> 1:15:56.260\n right? Which seems absolutely ridiculous, elementary, and\n\n1:15:56.260 --> 1:16:00.500\n frankly, beneath anyone in any level of power or influence in\n\n1:16:00.500 --> 1:16:03.700\n the world somehow has congressmen and senators who\n\n1:16:03.700 --> 1:16:07.540\n have done it. Yeah. They're not trying to convince their\n\n1:16:07.540 --> 1:16:11.380\n colleagues in elected positions to become bitcoiners. Yeah.\n\n1:16:11.380 --> 1:16:13.540\n They're speaking directly internally to the Bitcoin\n\n1:16:13.540 --> 1:16:17.140\n community. Yeah, there's some sense in which, yes, memes is\n\n1:16:17.140 --> 1:16:21.380\n love. Even I keep hearing Bitcoin is love. They're trying\n\n1:16:21.380 --> 1:16:26.340\n to convert me. The one that you have to laugh at, right?\n\n1:16:26.340 --> 1:16:28.260\n Probably my favorite one out of all of it is I've seen on\n\n1:16:28.260 --> 1:16:31.940\n multiple occasions, you know, Mark Cuban a couple of years\n\n1:16:31.940 --> 1:16:35.140\n ago, Kevin O Leary, whoever, you know, wealthy people,\n\n1:16:35.140 --> 1:16:38.100\n billionaires, etcetera, and you have people on anonymous\n\n1:16:38.100 --> 1:16:40.500\n accounts who who knows who they are telling them have fun\n\n1:16:40.500 --> 1:16:45.460\n staying poor, right? It's just, you know, it's just, again,\n\n1:16:45.460 --> 1:16:48.660\n part of a community and I think it's a feature, not a bug.\n\n1:16:48.660 --> 1:16:52.260\n There's bad aspects to it at times but I do think it's a net\n\n1:16:52.260 --> 1:16:56.100\n positive. Yeah, just like the immune system. It does a lot of\n\n1:16:56.100 --> 1:17:01.460\n crappy stuff but overall, it's a major net positive. Maybe\n\n1:17:01.460 --> 1:17:03.860\n this is a bit of a personal question for me. It just added\n\n1:17:03.860 --> 1:17:07.540\n my own curiosity but I've talked to Ray Dalio a few\n\n1:17:07.540 --> 1:17:10.900\n times. So, Ray Dalio, I think was one of those people that\n\n1:17:10.900 --> 1:17:16.260\n took that journey, the Bitcoin journey. Do you have thoughts\n\n1:17:16.260 --> 1:17:20.100\n about him specifically about that whole world and about the\n\n1:17:20.100 --> 1:17:22.660\n journey maybe of others that are going through the same\n\n1:17:22.660 --> 1:17:26.740\n process because Ray is, at least from my perspective, I'm a\n\n1:17:26.740 --> 1:17:33.620\n bit of an outsider. He's one of the most insightful and deep\n\n1:17:33.620 --> 1:17:37.060\n thinkers about investment, about finance, about economics\n\n1:17:37.060 --> 1:17:41.620\n in general. Actually, about life. So, it's interesting to\n\n1:17:41.620 --> 1:17:44.260\n see him go on that journey. Do you have something to comment\n\n1:17:44.260 --> 1:17:47.460\n about Ray or just those kinds of people in general? So, if we\n\n1:17:47.460 --> 1:17:50.420\n look at what I'll just consider the legends of Wall Street in\n\n1:17:50.420 --> 1:17:53.060\n general. Yeah. Right? There's no denying that they're\n\n1:17:53.060 --> 1:17:56.180\n incredibly intelligent. There's no denying that actually,\n\n1:17:56.180 --> 1:17:58.100\n especially in the hedge fund world, they're some of the most\n\n1:17:58.100 --> 1:18:01.540\n open minded people in terms of they're willing to change their\n\n1:18:01.540 --> 1:18:04.340\n mind when they get new information. There's no doubt\n\n1:18:04.340 --> 1:18:07.540\n that they are historians in the sense of having studied\n\n1:18:07.540 --> 1:18:11.700\n financial markets and cycles over time. And also, one of the\n\n1:18:11.700 --> 1:18:14.340\n things that I really respect about all those guys is almost\n\n1:18:14.340 --> 1:18:18.100\n all of them are willing to put ideas out via various writings\n\n1:18:18.100 --> 1:18:21.140\n that they do and accept the public criticism, right?\n\n1:18:21.140 --> 1:18:23.940\n Whether it's Howard Marks, Ray or others, they will put this\n\n1:18:23.940 --> 1:18:28.180\n stuff out in public. And sure, there's a lot of people who are\n\n1:18:28.180 --> 1:18:31.860\n supportive and kind of are part of a fan base, if you will. But\n\n1:18:31.860 --> 1:18:33.540\n there's a lot of people who also think that sometimes they\n\n1:18:33.540 --> 1:18:36.100\n say stupid things. And so, putting that out takes kind of\n\n1:18:36.100 --> 1:18:40.020\n courage, right? I think Ray's actually the most fascinating\n\n1:18:40.020 --> 1:18:42.900\n though out of all of these kind of legends of Wall Street in\n\n1:18:42.900 --> 1:18:46.740\n that he understands debt cycles. He understands\n\n1:18:46.740 --> 1:18:51.620\n currencies. He, for a while now, has been all over and\n\n1:18:51.620 --> 1:18:55.300\n famously said, you know, cash is trash, investible assets,\n\n1:18:55.300 --> 1:18:58.340\n right? He kind of like just knew all of it. And for a long\n\n1:18:58.340 --> 1:19:00.500\n time, Bitcoiners have said, Ray, you understand the Bitcoin\n\n1:19:00.500 --> 1:19:02.740\n argument, you're just missing the last part, which is Bitcoin\n\n1:19:02.740 --> 1:19:05.940\n is the solution, right? And so, he was gold and some other\n\n1:19:05.940 --> 1:19:10.340\n ideas. But I think that he's a perfect example of when you are\n\n1:19:10.340 --> 1:19:14.900\n part of the establishment, people view you in a very\n\n1:19:14.900 --> 1:19:18.900\n static way as the leader of a part of establishment. But\n\n1:19:18.900 --> 1:19:22.340\n whether it's Bill Gates, Ray Dalio, or somebody else, each\n\n1:19:22.340 --> 1:19:24.980\n one of these people were innovators and challengers to a\n\n1:19:24.980 --> 1:19:27.700\n system. They were upstarts at one point. And so, it's kind of\n\n1:19:27.700 --> 1:19:29.780\n this idea that like if you live long enough, you eventually\n\n1:19:29.780 --> 1:19:33.300\n become the man, right? And so, you know, Gates is a good\n\n1:19:33.300 --> 1:19:36.660\n example, right? Warren Buffett is a good example. Ray Dalio is\n\n1:19:36.660 --> 1:19:39.780\n a good example, etc. And so, you have to give credit, I think,\n\n1:19:39.780 --> 1:19:43.700\n to Dalio in the sense of he kept an open mind about all of\n\n1:19:43.700 --> 1:19:48.100\n this and more so than many of his peers has continued to do\n\n1:19:48.100 --> 1:19:51.460\n the work and come around to this idea. And now, I don't\n\n1:19:51.460 --> 1:19:53.460\n want to know if I wanted to say that he's a Bitcoin\n\n1:19:53.460 --> 1:19:58.100\n proponent as much as he believes it is one of a portion\n\n1:19:58.100 --> 1:20:01.940\n of assets that can be a solution. And so, to me, when\n\n1:20:01.940 --> 1:20:04.660\n you start to convince those types of people, when it's\n\n1:20:04.660 --> 1:20:07.620\n Paul Tudor Jones, a Stanley Druckenmiller, Ray Dalio,\n\n1:20:08.180 --> 1:20:11.060\n Howard Marks now even writing about it saying, hey, I was\n\n1:20:11.060 --> 1:20:14.420\n anti Bitcoin and put a ton of intellectual rigor into it.\n\n1:20:14.420 --> 1:20:17.460\n But thank God my son bought a bunch for our family, right?\n\n1:20:17.460 --> 1:20:21.780\n And kind of we've had exposure to it. I think what it does is\n\n1:20:21.780 --> 1:20:24.020\n more than anything, it's not going to convince somebody to\n\n1:20:24.020 --> 1:20:29.620\n go and take it seriously or go ahead and make an allocation.\n\n1:20:29.620 --> 1:20:33.540\n It reduces career risk. And so, if all of a sudden when Paul\n\n1:20:33.540 --> 1:20:35.380\n Tudor Jones and Stanley Druckenmiller come out and\n\n1:20:35.380 --> 1:20:38.820\n say, hey, I own Bitcoin and here's why, every other\n\n1:20:38.820 --> 1:20:41.140\n investor on Wall Street now can say to an investment\n\n1:20:41.140 --> 1:20:44.260\n committee, well, it's good enough for Paul Tudor Jones,\n\n1:20:44.260 --> 1:20:46.740\n it's good enough for Stanley Druckenmiller. And so, I think\n\n1:20:46.740 --> 1:20:49.620\n that it's very interesting because Ray doesn't just\n\n1:20:49.620 --> 1:20:53.700\n represent Wall Street. I think Ray in some weird way\n\n1:20:53.700 --> 1:20:57.700\n represents this like macro economic investor. And so,\n\n1:20:57.700 --> 1:21:00.180\n some of those are in hedge funds and some of those people\n\n1:21:00.180 --> 1:21:02.740\n would be like CIOs at organizations. Some of them\n\n1:21:02.740 --> 1:21:05.060\n would be at corporations and some of them are just kind of\n\n1:21:05.060 --> 1:21:09.620\n retail investors. And so, you can see this kind of inflection\n\n1:21:09.620 --> 1:21:12.980\n point throughout the adoption of Bitcoin, right? There was\n\n1:21:12.980 --> 1:21:15.620\n infrastructure that got built. Okay, that kind of led to more\n\n1:21:15.620 --> 1:21:18.980\n adoption. There was certain individuals, right? Usually\n\n1:21:18.980 --> 1:21:22.740\n they were kind of technology oriented, entrepreneurial\n\n1:21:22.740 --> 1:21:25.220\n billionaires. They would buy it and come out and say it. Okay,\n\n1:21:25.220 --> 1:21:28.820\n that led to inflection points. You started to have some of\n\n1:21:28.820 --> 1:21:32.500\n these kind of Wall Street legends come out, sort of\n\n1:21:32.500 --> 1:21:35.380\n financial institutions started. And now, you're seeing\n\n1:21:35.380 --> 1:21:38.100\n corporations start to do it, right? Eventually, there's\n\n1:21:38.100 --> 1:21:40.420\n going to be a central bank that does it. And so, you kind of\n\n1:21:40.420 --> 1:21:43.140\n walk through that line and what you understand is like, it's\n\n1:21:43.140 --> 1:21:46.900\n the same thing every time. It's just somebody new, right? That\n\n1:21:46.900 --> 1:21:50.980\n path, right? That Bitcoiners journey, if you will. And I\n\n1:21:50.980 --> 1:21:55.460\n think that that is almost the beauty of it is if you\n\n1:21:55.460 --> 1:21:58.340\n short circuit the journey, it's almost like somebody doesn't\n\n1:21:58.340 --> 1:22:01.700\n appreciate it, right? If you take, let's say, somebody who's\n\n1:22:01.700 --> 1:22:03.700\n a young kid and you just give them a bunch of money and they\n\n1:22:03.700 --> 1:22:05.940\n didn't have to work hard for it. They don't really\n\n1:22:05.940 --> 1:22:09.940\n appreciate it. Well, and Ray actually has a book\n\n1:22:09.940 --> 1:22:12.900\n principles, right? And he talks about the hero's journey. So,\n\n1:22:12.900 --> 1:22:16.740\n he's like living it in some sense in terms of, you know,\n\n1:22:16.740 --> 1:22:20.420\n thinking about digital currency in general, like digital\n\n1:22:20.420 --> 1:22:26.660\n finance. It's one of the big transitions, transformations of\n\n1:22:26.660 --> 1:22:31.060\n our world in some sense. It's not just about money. Or you\n\n1:22:31.060 --> 1:22:33.780\n could argue that money is everything. I mean, it's like\n\n1:22:33.780 --> 1:22:37.380\n money isn't just the narrow definition of money. Money is\n\n1:22:37.380 --> 1:22:40.180\n really everything. And so, where you could argue that sort\n\n1:22:40.180 --> 1:22:44.900\n of cryptocurrency is like the base layer of this\n\n1:22:44.900 --> 1:22:47.540\n transformation to the digital space and everything else would\n\n1:22:47.540 --> 1:22:52.500\n just be built on top of it. I use a different word that I\n\n1:22:52.500 --> 1:22:56.020\n think is kind of closer to your world, which is it's ultimately\n\n1:22:56.020 --> 1:23:00.900\n automation. And what I mean by that is, you know, before 1970\n\n1:23:00.900 --> 1:23:03.940\n or 1980, all the assets were analog. And so, when you have\n\n1:23:03.940 --> 1:23:06.740\n analog assets, physical stock certificates, physical bonds,\n\n1:23:06.740 --> 1:23:11.060\n right, physical deed to a home, you have to physically exchange\n\n1:23:11.060 --> 1:23:16.180\n them. When we wanted to increase transactions and\n\n1:23:16.180 --> 1:23:19.700\n increase kind of global finance and access, we took those\n\n1:23:19.700 --> 1:23:22.980\n physical assets and we created electronic QCIP assets. So, now\n\n1:23:22.980 --> 1:23:26.740\n we have in centralized databases kind of a file, represents the\n\n1:23:26.740 --> 1:23:29.700\n asset that's sitting somewhere in custody. And you and I can\n\n1:23:29.700 --> 1:23:32.020\n transact them a little bit easier, but still centralized.\n\n1:23:32.020 --> 1:23:34.820\n There's still some bureaucracy and, you know, maybe it takes\n\n1:23:34.820 --> 1:23:37.620\n two days to transact rather than actually mailing it across\n\n1:23:37.620 --> 1:23:42.500\n the world. Now, what we're seeing is a transition from\n\n1:23:42.500 --> 1:23:45.780\n those electronic QCIPs to these digital assets. And so, if you\n\n1:23:45.780 --> 1:23:49.620\n look at, again, just let's say money or currency, every\n\n1:23:49.620 --> 1:23:51.620\n currency in the world is going to be digital. You're going to\n\n1:23:51.620 --> 1:23:55.300\n have a digital dollar, a digital euro, yen, RMB. You're\n\n1:23:55.300 --> 1:23:59.460\n going to have decentralized kind of open source money like\n\n1:23:59.460 --> 1:24:02.660\n Bitcoin. You're also going to have private currencies like\n\n1:24:02.660 --> 1:24:05.860\n Facebook's attempt at DiEM and there will be others that will\n\n1:24:05.860 --> 1:24:09.460\n try to do this. And so, when you get everything digital, right,\n\n1:24:09.460 --> 1:24:11.060\n and I think that's the kind of the first step that everyone\n\n1:24:11.060 --> 1:24:13.940\n focuses on, the competition at the technology layer\n\n1:24:13.940 --> 1:24:16.740\n essentially goes away. You get some level of feature parity\n\n1:24:16.740 --> 1:24:18.500\n and sure, there's bells and whistles on each kind of\n\n1:24:18.500 --> 1:24:21.140\n implementation of a digital currency, but at the end of the\n\n1:24:21.140 --> 1:24:23.620\n day, the technology is relatively the same. And\n\n1:24:23.620 --> 1:24:26.340\n ultimately, what it will do is it will facilitate the adoption\n\n1:24:26.340 --> 1:24:29.140\n of digital wallets. So, you have to have a digital wallet\n\n1:24:29.140 --> 1:24:31.380\n regardless of what digital currency you have. Same with me,\n\n1:24:31.380 --> 1:24:34.340\n same with everybody else in the world. But what it does do is\n\n1:24:34.340 --> 1:24:37.540\n when you kind of push away and reduce the friction of\n\n1:24:37.540 --> 1:24:41.460\n competition at the technology layer, it moves the competition\n\n1:24:41.460 --> 1:24:44.900\n to the monetary policy layer. And so, when you get to that\n\n1:24:44.900 --> 1:24:47.220\n layer, now it becomes interesting because all of the\n\n1:24:47.220 --> 1:24:50.500\n currencies are the same except for this one right now and maybe\n\n1:24:50.500 --> 1:24:53.380\n there will be others in the future. But for sure, Bitcoin\n\n1:24:53.380 --> 1:24:55.780\n today and people may try to replicate in a private manner\n\n1:24:55.780 --> 1:24:59.140\n or something, but Bitcoin is kind of the only finite scarce\n\n1:24:59.140 --> 1:25:04.180\n digital somebody. And so, when you then have that pretty big\n\n1:25:04.180 --> 1:25:06.820\n difference in that competition at the monetary policy layer,\n\n1:25:06.820 --> 1:25:10.020\n it's actually not going to matter where you get paid.\n\n1:25:10.020 --> 1:25:12.980\n Right? And what I mean by that is like you and I both live in\n\n1:25:12.980 --> 1:25:18.100\n a single currency environment. I get paid in dollars. I\n\n1:25:18.100 --> 1:25:21.060\n historically have saved in dollars. All of the assets in\n\n1:25:21.060 --> 1:25:25.460\n my life are denominated in dollars and I owe my debts in\n\n1:25:25.460 --> 1:25:29.460\n dollars, whether it's taxes or in the private market. And I\n\n1:25:29.460 --> 1:25:31.300\n don't have to worry about foreign currencies. I don't\n\n1:25:31.300 --> 1:25:33.460\n exchange anything. The only time I would ever think about\n\n1:25:33.460 --> 1:25:35.540\n another currency is if I'm going to another country in\n\n1:25:35.540 --> 1:25:38.740\n their single currency environment. And in order to\n\n1:25:39.460 --> 1:25:43.220\n change or exchange my currency, I go to the bank or I go get\n\n1:25:43.220 --> 1:25:46.020\n ripped off at the airport. Right? Those are my two options.\n\n1:25:46.020 --> 1:25:49.380\n So, it's high friction to change between currencies. When\n\n1:25:49.380 --> 1:25:54.580\n the competition of technology is kind of innovated away, now\n\n1:25:54.580 --> 1:25:57.140\n I can get paid in dollars, these digital dollars, and with\n\n1:25:57.140 --> 1:25:59.220\n a click of a button, switch into any other currency in the\n\n1:25:59.220 --> 1:26:03.220\n world. And so, what ultimately happens is value and liquidity\n\n1:26:03.220 --> 1:26:07.460\n is going to coalesce around the best monetary policy. And so,\n\n1:26:07.460 --> 1:26:09.220\n you get in this very weird world where even if the United\n\n1:26:09.220 --> 1:26:11.060\n States says, hey, you're going to get paid in dollars, you have\n\n1:26:11.060 --> 1:26:13.380\n to pay your taxes in dollars. You're going to start to see\n\n1:26:13.380 --> 1:26:15.860\n people operate in a multi currency environment where they\n\n1:26:15.860 --> 1:26:17.860\n say, okay, I got paid in my digital dollar, click a button,\n\n1:26:17.860 --> 1:26:21.380\n I save in Bitcoin. It stays there or grows my purchasing\n\n1:26:21.380 --> 1:26:23.620\n power. Oh, I need to pay my taxes. Let me switch back into\n\n1:26:23.620 --> 1:26:26.820\n dollars with click of a button and pay. When you go to a\n\n1:26:26.820 --> 1:26:30.580\n multi currency world, it's not just about currency. It's now\n\n1:26:30.580 --> 1:26:34.660\n multi asset world. Because not only is the currency\n\n1:26:34.660 --> 1:26:38.340\n digitized, but that same technology is used to digitize\n\n1:26:38.340 --> 1:26:42.100\n stocks, bonds, and commodities as well. And so, today we live\n\n1:26:42.100 --> 1:26:44.580\n in a very fragmented financial world where basically I have a\n\n1:26:44.580 --> 1:26:46.980\n brokerage account, I have a bank account, I may have an\n\n1:26:46.980 --> 1:26:50.820\n alternative asset account, etc. When I can put all those assets\n\n1:26:50.820 --> 1:26:55.140\n in a single digital wallet, and I can then go from asset to\n\n1:26:55.140 --> 1:26:58.180\n asset without having to go back to a single unit of account.\n\n1:26:58.180 --> 1:27:01.860\n Like frictionless going from asset to asset. Yeah. So now\n\n1:27:01.860 --> 1:27:03.940\n what you end up doing is you start to open up the\n\n1:27:03.940 --> 1:27:07.220\n possibility for machine to machine transactions. Yeah. So\n\n1:27:07.220 --> 1:27:10.660\n today, if you and I write software code for two machines\n\n1:27:10.660 --> 1:27:13.940\n to transact with each other, they can't transact physical\n\n1:27:13.940 --> 1:27:16.740\n currency. And in many cases, they can't actually transact\n\n1:27:16.740 --> 1:27:19.700\n the electronic QCIP currencies or assets either because\n\n1:27:19.700 --> 1:27:21.620\n there's too long of a settlement time. So you can't\n\n1:27:21.620 --> 1:27:24.500\n get true automation, right? So the whole idea of the car's\n\n1:27:24.500 --> 1:27:26.740\n going to drive over a strip in the road and it's going to\n\n1:27:26.740 --> 1:27:29.620\n pay the toll, right? Well, that can't happen right now\n\n1:27:29.620 --> 1:27:31.220\n because literally the transaction won't go through,\n\n1:27:31.780 --> 1:27:35.380\n right? And so I always joke that in an automated world,\n\n1:27:35.380 --> 1:27:38.260\n it's like a CD ROM, but we're trying to take cassette tape\n\n1:27:38.260 --> 1:27:40.900\n player assets and put it in the CD ROM. It's just incompatible\n\n1:27:40.900 --> 1:27:44.660\n technology. Reference is nobody understands at this point.\n\n1:27:44.660 --> 1:27:46.900\n By the way, you need to update your reference. I probably\n\n1:27:46.900 --> 1:27:48.900\n do. It's like taking a CD ROM and trying to put an MP3\n\n1:27:48.900 --> 1:27:52.740\n player into a streaming. But I think that the reason why\n\n1:27:52.740 --> 1:27:54.900\n that becomes really interesting is when you start to create\n\n1:27:54.900 --> 1:27:57.860\n these digital assets, now you open up the world of\n\n1:27:57.860 --> 1:27:59.940\n possibilities. So when new technology is created, you can\n\n1:27:59.940 --> 1:28:02.420\n do two things. You can either create new things the world's\n\n1:28:02.420 --> 1:28:04.980\n never seen before, or you can use it to improve the old\n\n1:28:04.980 --> 1:28:08.180\n world. Most people, because it's the easiest thing to\n\n1:28:08.180 --> 1:28:11.620\n think about, want to improve the old world. So an equivalent\n\n1:28:11.620 --> 1:28:14.820\n of this would be when the internet came along, a media\n\n1:28:14.820 --> 1:28:17.300\n company that had newspapers would say, hey, we should take\n\n1:28:17.300 --> 1:28:20.100\n a PDF of the newspaper and we should put it on a website. And\n\n1:28:20.100 --> 1:28:21.860\n now anyone in the world can go to this website and they can\n\n1:28:21.860 --> 1:28:26.180\n read the newspaper today. That was valuable, but it missed out\n\n1:28:26.180 --> 1:28:29.140\n on the ability to change headlines, to test, to put\n\n1:28:29.140 --> 1:28:32.740\n multimedia, to distribute it differently, to do all kinds of\n\n1:28:32.740 --> 1:28:35.300\n things that today we understand the internet really empowered.\n\n1:28:35.860 --> 1:28:38.180\n And so what I think we're about to watch happen is we're going\n\n1:28:38.180 --> 1:28:40.660\n to digitize the assets. We're going to put them all into\n\n1:28:40.660 --> 1:28:43.700\n these digital wallets. You're going to get automated\n\n1:28:43.700 --> 1:28:46.420\n technologies where machines can now transact with each other.\n\n1:28:46.420 --> 1:28:50.020\n And we're going to do simple things like why do we pay\n\n1:28:50.020 --> 1:28:53.780\n people once every two weeks? Why don't we just pay them at\n\n1:28:53.780 --> 1:28:56.420\n the end of every day? Or why don't I literally stream\n\n1:28:56.420 --> 1:28:59.300\n payments to you on an hour by hour basis based on the work\n\n1:28:59.300 --> 1:29:03.460\n you do? It would solve incredible economic issues in\n\n1:29:03.460 --> 1:29:05.620\n our country and in countries around the world. But\n\n1:29:05.620 --> 1:29:08.180\n historically businesses can't do this because of the\n\n1:29:08.180 --> 1:29:10.580\n technology problem. They can't keep track of it all. How do\n\n1:29:10.580 --> 1:29:12.340\n they pay everyone every day? How do they pay everyone every\n\n1:29:12.340 --> 1:29:13.780\n hour? You just can't do it.\n\n1:29:13.780 --> 1:29:17.300\n Yeah, it's funny. The vision of the future you're painting,\n\n1:29:18.180 --> 1:29:22.500\n it's kind of an exciting one. And it almost makes me sad\n\n1:29:22.500 --> 1:29:24.980\n looking into the future when we'll look back at this time.\n\n1:29:24.980 --> 1:29:30.180\n It's like how incredibly inefficient financial\n\n1:29:30.180 --> 1:29:33.940\n transactions were. Like the transaction of value of any\n\n1:29:33.940 --> 1:29:38.260\n kind. Like how to pay each other. Like there has to be\n\n1:29:38.260 --> 1:29:43.300\n processes. There's like payroll and all this kind of just the\n\n1:29:43.300 --> 1:29:47.620\n entirety of the transactions is just like painful. Almost\n\n1:29:47.620 --> 1:29:51.220\n all transactions are painful. And the companies that\n\n1:29:51.220 --> 1:29:55.540\n innovate to make the transactions a little bit more\n\n1:29:55.540 --> 1:29:58.660\n frictionless like Amazon with the one click purchase button\n\n1:29:58.660 --> 1:30:02.500\n like went out huge. But even that's really painful. It's\n\n1:30:02.500 --> 1:30:04.660\n actually really interesting especially when you start to\n\n1:30:04.660 --> 1:30:07.540\n move that into the space of data. There's a lot of people\n\n1:30:07.540 --> 1:30:11.380\n thinking about privacy and data and like can we put, can\n\n1:30:11.380 --> 1:30:17.460\n we like convert data into like money so that you can pay for\n\n1:30:17.460 --> 1:30:19.780\n how much you reveal to the companies about your own\n\n1:30:19.780 --> 1:30:24.340\n private data that can then be used to assign value to you so\n\n1:30:24.340 --> 1:30:27.140\n you can use the service for free if you hand over the data\n\n1:30:27.140 --> 1:30:30.100\n but there's like explicit transaction going on. So you\n\n1:30:30.100 --> 1:30:34.660\n can empower all those kinds of things that will just like\n\n1:30:34.660 --> 1:30:37.220\n fundamentally change our world. That's really, really,\n\n1:30:37.220 --> 1:30:37.860\n really exciting.\n\n1:30:37.860 --> 1:30:41.300\n One of the most interesting things to me is I invested in\n\n1:30:41.300 --> 1:30:43.460\n a company called Bridget and what they told me was they said\n\n1:30:43.460 --> 1:30:49.140\n $8 billion was paid to the top four banks last year on\n\n1:30:49.140 --> 1:30:52.980\n overdraft fees. So literally they took $8 billion from\n\n1:30:52.980 --> 1:30:55.940\n people who didn't have money in their bank account, right?\n\n1:30:55.940 --> 1:30:58.420\n And so when you dig into why is that a lot of times it's not\n\n1:30:58.420 --> 1:31:01.060\n that the people don't have the money. It's actually a\n\n1:31:01.060 --> 1:31:04.500\n mismatch of the payments. So what ends up happening is you\n\n1:31:04.500 --> 1:31:06.820\n get paid on the 1st and the 15th but on the 12th your\n\n1:31:06.820 --> 1:31:10.500\n Netflix bill hits, on the 13th you went grocery shopping, and\n\n1:31:10.500 --> 1:31:13.460\n on the 14th your car payments hit, you overdraft, and then\n\n1:31:13.460 --> 1:31:15.140\n on the 15th you actually get the check and then you're able\n\n1:31:15.140 --> 1:31:18.020\n to pay not only the overdraft but for the expenses that you\n\n1:31:18.020 --> 1:31:21.060\n have. And so something as simple as just getting paid at\n\n1:31:21.060 --> 1:31:24.420\n the end of every day immediately would eliminate\n\n1:31:24.420 --> 1:31:27.700\n some big percentage of those $8 billion of value that flows\n\n1:31:27.700 --> 1:31:30.260\n to large institutions on overdraft fees.\n\n1:31:30.260 --> 1:31:34.100\n Yeah and also I mean this whole process with overdraft fees\n\n1:31:34.100 --> 1:31:37.060\n and just many of the financial transactions we have to live\n\n1:31:37.060 --> 1:31:42.740\n through today forces many of us to be like accountants, like\n\n1:31:42.740 --> 1:31:46.820\n to understand the different mechanism of financial like\n\n1:31:46.820 --> 1:31:50.100\n the movement of money as opposed to you which is what we\n\n1:31:50.100 --> 1:31:53.860\n want to do as human beings operating in high layers of\n\n1:31:53.860 --> 1:31:58.340\n like providing services for others, of like following your\n\n1:31:58.340 --> 1:32:01.860\n passions and like working for others, like doing cool shit\n\n1:32:01.860 --> 1:32:07.060\n or you know basically providing value, exchanging value\n\n1:32:07.060 --> 1:32:09.700\n in the world and not thinking about the money. The money\n\n1:32:09.700 --> 1:32:12.420\n takes care of itself and then you see the results of it.\n\n1:32:12.420 --> 1:32:19.460\n So you're able to think in terms of money but not have to\n\n1:32:19.460 --> 1:32:22.180\n know how like the accounting works.\n\n1:32:22.980 --> 1:32:26.340\n Automation simply frees humans up to do more creative\n\n1:32:26.340 --> 1:32:26.740\n work.\n\n1:32:26.740 --> 1:32:27.300\n Yeah.\n\n1:32:27.300 --> 1:32:27.460\n Right?\n\n1:32:27.460 --> 1:32:28.340\n Yeah.\n\n1:32:28.340 --> 1:32:29.380\n Like that's it.\n\n1:32:29.380 --> 1:32:29.700\n Yeah.\n\n1:32:29.700 --> 1:32:30.340\n And what we\n\n1:32:30.340 --> 1:32:34.180\n Which is why you use the term automation which I think is\n\n1:32:34.180 --> 1:32:36.740\n kind of brilliant reframing of all of this.\n\n1:32:36.740 --> 1:32:40.100\n Yeah because ultimately digital technologies are merely\n\n1:32:40.100 --> 1:32:44.980\n the conduit to ushers into that world and I think the most\n\n1:32:44.980 --> 1:32:50.020\n fascinating part of this entire industry is people who are\n\n1:32:50.020 --> 1:32:52.980\n trying to figure out now that we're going to have these\n\n1:32:52.980 --> 1:32:56.900\n digital technologies how do we usher in that automated world\n\n1:32:56.900 --> 1:33:00.020\n faster and so there's people who are building all kinds of\n\n1:33:00.020 --> 1:33:04.420\n incredible things right there's literally some technologies\n\n1:33:04.420 --> 1:33:09.300\n where you can stream for paying for consumption of content.\n\n1:33:09.300 --> 1:33:09.940\n Yeah.\n\n1:33:09.940 --> 1:33:13.060\n Right there's I saw somebody recently who they basically\n\n1:33:13.060 --> 1:33:16.660\n said hey I have created something but it's not going to\n\n1:33:16.660 --> 1:33:20.580\n be released until everyone and almost like a GoFundMe type\n\n1:33:20.580 --> 1:33:23.540\n situation pays for it in combination then it gets\n\n1:33:23.540 --> 1:33:26.580\n unlocked and so when you start to think about this it's not\n\n1:33:26.580 --> 1:33:28.820\n only innovation on the technology front it's innovation\n\n1:33:28.820 --> 1:33:33.300\n around the way that we form capital it's the way that we\n\n1:33:34.180 --> 1:33:36.820\n organize resources it's the way that we build companies it's\n\n1:33:36.820 --> 1:33:39.540\n the business models right it's the application of those\n\n1:33:39.540 --> 1:33:43.860\n technologies all that stuff starts to change and go back to\n\n1:33:43.860 --> 1:33:49.540\n a 2007 that's when the iPhone came out Uber wasn't possible\n\n1:33:49.540 --> 1:33:51.620\n right I'm just going to lie like all these companies that\n\n1:33:51.620 --> 1:33:54.980\n weren't possible before when the digital technologies are\n\n1:33:54.980 --> 1:33:58.500\n kind of adopted on a global scale I think that we all myself\n\n1:33:58.500 --> 1:34:02.500\n included drastically underestimate how fast and how\n\n1:34:02.500 --> 1:34:06.100\n big innovation can be because it's just hard right like like\n\n1:34:06.100 --> 1:34:08.500\n we like to think linearly and that's not how the world works.\n\n1:34:08.500 --> 1:34:14.180\n Yeah I do find it kind of interesting it is NFT based but\n\n1:34:14.180 --> 1:34:20.180\n I don't think it has to be this this idea of I think big clout\n\n1:34:20.180 --> 1:34:23.860\n it's called or whatever the idea of sort of investing in\n\n1:34:23.860 --> 1:34:26.660\n individuals it makes me immediately think about\n\n1:34:26.660 --> 1:34:32.100\n investing in ideas so even just the words you speak having\n\n1:34:32.100 --> 1:34:38.420\n value and sort of if you have a frictionless like automated\n\n1:34:39.140 --> 1:34:42.500\n financial system then you could do a bunch of interesting\n\n1:34:42.500 --> 1:34:46.580\n things about what it means to add value to the world I mean\n\n1:34:47.860 --> 1:34:50.420\n I don't know if big cloud is currently an efficient\n\n1:34:50.420 --> 1:34:58.180\n representation of that but I am truly happy that however that\n\n1:34:58.180 --> 1:35:03.060\n thing works I'm just one notch above Vladimir Putin which is\n\n1:35:03.060 --> 1:35:06.180\n one of the that's like one of the bucket list items for me to\n\n1:35:06.180 --> 1:35:09.460\n to have a list where I'm one notch above Putin well what I\n\n1:35:09.460 --> 1:35:12.740\n think you're talking about here is important because there's\n\n1:35:12.740 --> 1:35:16.660\n historical examples you could invest in a patent in some\n\n1:35:16.660 --> 1:35:20.340\n situations you could invest in an organization that has an\n\n1:35:20.340 --> 1:35:23.940\n idea right so these are super inefficient given kind of the\n\n1:35:23.940 --> 1:35:26.020\n vision that you're painting in terms of like investing directly\n\n1:35:26.020 --> 1:35:29.380\n in an idea in a super efficient automated fashion yeah but\n\n1:35:29.380 --> 1:35:32.980\n that's how the technology evolution works right is it's\n\n1:35:32.980 --> 1:35:35.540\n really hard to do at first and then slowly kind of becomes\n\n1:35:35.540 --> 1:35:39.060\n easier and easier as technology is more prevalent the other\n\n1:35:39.060 --> 1:35:40.580\n thing that I think is interesting is this whole idea\n\n1:35:40.580 --> 1:35:43.860\n of investing in people if you really think about the\n\n1:35:43.860 --> 1:35:48.180\n origination of that is I would hire somebody right I pay you\n\n1:35:48.180 --> 1:35:50.660\n money and then you're going to create production but I take\n\n1:35:50.660 --> 1:35:54.820\n the lion's share and you don't now there's things like these\n\n1:35:54.820 --> 1:35:57.940\n ISAs these income sharing agreements where basically I\n\n1:35:57.940 --> 1:36:01.620\n will educate you on something train you on something I'll put\n\n1:36:01.620 --> 1:36:05.140\n up capital right and then over time you'll pay me back plus\n\n1:36:05.140 --> 1:36:09.300\n profits as some version eventually I don't know what it\n\n1:36:09.300 --> 1:36:14.420\n looks like but being able to get upside in somebody's success\n\n1:36:14.420 --> 1:36:18.020\n for having risk capital early on doesn't seem that far off\n\n1:36:18.020 --> 1:36:20.740\n see it in professional sports you see it in you know a lot of\n\n1:36:20.740 --> 1:36:24.660\n these things and so I just think that a lot of the focus\n\n1:36:24.660 --> 1:36:30.020\n right now is on the technology but ultimately these are ideas\n\n1:36:30.020 --> 1:36:33.540\n that are very old and have had lots of success and traction\n\n1:36:33.540 --> 1:36:36.180\n and we're just merely standing in the way of the evolution of\n\n1:36:36.180 --> 1:36:40.820\n these ideas with new technology and so it's easy to get caught\n\n1:36:40.820 --> 1:36:43.380\n up in the technology but when you really zoom out and look at\n\n1:36:43.380 --> 1:36:46.180\n it from the ideological standpoint and kind of the\n\n1:36:46.180 --> 1:36:49.220\n progress of humanity it's a foregone conclusion this stuff's\n\n1:36:49.220 --> 1:36:52.500\n going to happen it's just how I think the world is waiting and\n\n1:36:52.500 --> 1:36:56.660\n some of us are trying to create that future world which is like\n\n1:36:56.660 --> 1:36:59.140\n what are the applications of this technology that will\n\n1:36:59.140 --> 1:37:03.140\n transform the world and then you know I hate the term but\n\n1:37:03.140 --> 1:37:08.100\n killer apps like cool ideas that are implemented effectively at\n\n1:37:08.100 --> 1:37:11.540\n scale that transform the world and there's been a there's been\n\n1:37:11.540 --> 1:37:15.300\n a lot of different ideas popping up like the there's a\n\n1:37:15.300 --> 1:37:17.940\n lot of ideas about social networks that are built on top\n\n1:37:17.940 --> 1:37:21.140\n of the technology and all that kind of stuff so but let me\n\n1:37:21.140 --> 1:37:25.620\n actually drag this back down to something basic if a person\n\n1:37:25.620 --> 1:37:32.500\n wanted to buy Bitcoin store Bitcoin how do they actually do\n\n1:37:32.500 --> 1:37:36.900\n it yeah so there's a couple of different ways to kind of\n\n1:37:36.900 --> 1:37:40.820\n acquire Bitcoin and in every way you've got to exchange\n\n1:37:40.820 --> 1:37:44.420\n some form of value for Bitcoin right which is part of why it\n\n1:37:44.420 --> 1:37:49.140\n has values because you're giving up value so in one way is\n\n1:37:49.140 --> 1:37:54.420\n to exchange energy and computational power for Bitcoin\n\n1:37:54.420 --> 1:37:57.780\n so you can mine it you can literally take computer power\n\n1:37:57.780 --> 1:38:01.860\n that you have you can rent it to the network and run that\n\n1:38:01.860 --> 1:38:05.620\n software and then it will pay you a portion of the kind of\n\n1:38:05.620 --> 1:38:09.220\n daily revenue off that system and you can acquire Bitcoin in\n\n1:38:09.220 --> 1:38:13.060\n exchange for your power and your computational kind of\n\n1:38:13.060 --> 1:38:15.380\n contribution and that's the fundamental principle behind\n\n1:38:15.380 --> 1:38:20.100\n Bitcoin is the proof of work so I got a hundred bucks like I\n\n1:38:20.100 --> 1:38:25.540\n use cash app the you know they there's Coinbase there's all\n\n1:38:25.540 --> 1:38:32.500\n these exchanges like how do I convert my $100 to Bitcoin is\n\n1:38:32.500 --> 1:38:36.340\n there something disclaimer this is not financial advice and\n\n1:38:36.340 --> 1:38:40.180\n this is just us talking and just your opinions this do not\n\n1:38:40.180 --> 1:38:46.820\n use this to invest or take as financial expertise that said\n\n1:38:46.820 --> 1:38:50.500\n like is there something you recommend that's an easy entry\n\n1:38:50.500 --> 1:38:54.100\n point for somebody that's like hmm I wonder if I can convert\n\n1:38:54.100 --> 1:38:57.620\n this hundred dollars into whatever amount of Bitcoin what\n\n1:38:57.620 --> 1:39:00.180\n do you recommend what are the options so there's a lot of\n\n1:39:00.180 --> 1:39:03.620\n options I'm heavily biased I went out and I scoured the\n\n1:39:03.620 --> 1:39:05.700\n market looked at all of them I've invested a lot of money in\n\n1:39:05.700 --> 1:39:08.820\n a company called BlockFi that basically basically has\n\n1:39:08.820 --> 1:39:11.540\n financial products for crypto investors so you can go you can\n\n1:39:11.540 --> 1:39:14.820\n take dollars or other currency you have you can convert it\n\n1:39:14.820 --> 1:39:18.420\n through an exchange you can leave it on these interest\n\n1:39:18.420 --> 1:39:20.180\n bearing accounts you can earn interest just like you would\n\n1:39:20.180 --> 1:39:22.980\n earn in a traditional account but higher levels of interest\n\n1:39:22.980 --> 1:39:26.580\n because it's this new thing or you can withdraw it and you can\n\n1:39:26.580 --> 1:39:29.620\n put it into cold storage on a hardware device you can leave\n\n1:39:29.620 --> 1:39:31.540\n it in a software wallet there's kind of all these storage\n\n1:39:31.540 --> 1:39:34.660\n options so BlockFi is you know kind of the one that I'm biased\n\n1:39:34.660 --> 1:39:40.740\n towards because I'm sorry to interrupt so BlockFi is Bitcoin\n\n1:39:40.740 --> 1:39:43.140\n only or is it an exchange with other crypto it's got a bunch\n\n1:39:43.140 --> 1:39:46.180\n of different ones yeah they basically are agnostic to what\n\n1:39:46.180 --> 1:39:50.340\n it is but they provide kind of financial you know products to\n\n1:39:50.340 --> 1:39:53.620\n crypto investors okay so you mentioned a few interesting\n\n1:39:53.620 --> 1:39:57.220\n ideas that'd be nice for people who would not be familiar with\n\n1:39:57.220 --> 1:40:02.100\n it cold storage hot storage what does that mean so like I go to\n\n1:40:02.100 --> 1:40:06.820\n a website and I convert dollars to Bitcoin that's a kind of\n\n1:40:06.820 --> 1:40:12.100\n storage that's like online banking right what else is\n\n1:40:12.100 --> 1:40:14.740\n there so there's a couple of different things that you can\n\n1:40:14.740 --> 1:40:17.220\n do right and let's use the legacy system as kind of an\n\n1:40:17.220 --> 1:40:23.140\n example so if I want to get currency and I put in my bank\n\n1:40:23.140 --> 1:40:27.300\n account it sits there I have to trust that the bank doesn't go\n\n1:40:27.300 --> 1:40:30.820\n under nobody steals it all this kind of stuff there's insurance\n\n1:40:30.820 --> 1:40:33.140\n for it right there's all these kind of benefits in the legacy\n\n1:40:33.140 --> 1:40:35.620\n system to make sure that as long as I don't have you know\n\n1:40:35.620 --> 1:40:37.300\n millions and millions of dollars there I'm going to be\n\n1:40:37.300 --> 1:40:40.260\n protected pretty much if anything happens through FDIC\n\n1:40:40.260 --> 1:40:44.980\n insurance if I want to do that I'm taking that counterparty\n\n1:40:44.980 --> 1:40:47.460\n risk though so it's mitigated but there's still counterparty\n\n1:40:47.460 --> 1:40:50.260\n risk I'm counting on that bank but it is easier to move it\n\n1:40:50.260 --> 1:40:52.180\n around right if all of a sudden you call me up and say hey send\n\n1:40:52.180 --> 1:40:54.580\n me some money I can press a couple buttons on my computer\n\n1:40:54.580 --> 1:40:58.740\n and it'll send it to you if I want deeper level of security I\n\n1:40:58.740 --> 1:41:02.180\n can go and I can get the physical dollars and I can go\n\n1:41:02.180 --> 1:41:05.460\n and I can you know put under my mattress right and I can say\n\n1:41:05.460 --> 1:41:07.860\n you know what it's not gonna be as easy to send it to you\n\n1:41:07.860 --> 1:41:10.820\n immediately but if I really want to I can go underneath my\n\n1:41:10.820 --> 1:41:13.380\n mattress pretty quickly I can grab it I can get it back to\n\n1:41:13.380 --> 1:41:16.420\n the bank and then I can send you the money the third thing I\n\n1:41:16.420 --> 1:41:18.500\n could do is I could basically take those physical dollars out\n\n1:41:18.500 --> 1:41:21.700\n of the bank and I could go and I could go put it literally you\n\n1:41:21.700 --> 1:41:24.420\n know in a vault somewhere that I don't have control over that's\n\n1:41:24.420 --> 1:41:27.780\n behind 10 passwords and biometric scanning and like it's\n\n1:41:27.780 --> 1:41:30.740\n really difficult to even get to it right so if you can almost\n\n1:41:30.740 --> 1:41:33.540\n look at it it's like there's three stages of security that\n\n1:41:33.540 --> 1:41:35.540\n you could have in the traditional world the same thing\n\n1:41:35.540 --> 1:41:38.500\n is true in Bitcoin so you could buy Bitcoin on any exchange you\n\n1:41:38.500 --> 1:41:40.420\n can do it on BlockFi but you also can do it on places like\n\n1:41:40.420 --> 1:41:46.100\n Coinbase, Gemini, Kraken, etc. Also Cash App. Cash App. You can\n\n1:41:46.100 --> 1:41:48.900\n do it on Cash App. I think I think they're still sponsoring\n\n1:41:48.900 --> 1:41:54.020\n this podcast. I'm not biased at all. So once you get Bitcoin\n\n1:41:54.020 --> 1:41:58.820\n on any of these venues you can leave it there on that venue.\n\n1:41:58.820 --> 1:42:02.580\n Now the trade off is you're taking counterparty risk so\n\n1:42:02.580 --> 1:42:04.980\n somebody else is responsible for the security and the\n\n1:42:04.980 --> 1:42:09.140\n protection of it in many cases big well known companies who\n\n1:42:09.140 --> 1:42:11.380\n have billions of billions of dollars of assets they have\n\n1:42:11.380 --> 1:42:13.540\n higher levels of security that's why they're well known\n\n1:42:13.540 --> 1:42:15.300\n that's why people trust them whatever but you are taking\n\n1:42:15.300 --> 1:42:19.460\n counterparty risk it is easier to quickly send to somebody so\n\n1:42:19.460 --> 1:42:22.660\n that so the trade off of like ease of use but counterparty\n\n1:42:22.660 --> 1:42:25.380\n risk is big and in the Bitcoin community specifically there's\n\n1:42:25.380 --> 1:42:29.140\n a huge thing of they really really have a keep for not\n\n1:42:29.140 --> 1:42:32.660\n leaving the Bitcoin there right for the obvious counterparty\n\n1:42:32.660 --> 1:42:35.620\n the second thing you can do is you can basically get it off of\n\n1:42:35.620 --> 1:42:38.660\n an exchange and you can put it in some level of kind of what\n\n1:42:38.660 --> 1:42:41.220\n I'll call a second layer of storage that second layer\n\n1:42:41.220 --> 1:42:43.700\n storage could be a hardware device that you can quickly\n\n1:42:43.700 --> 1:42:45.540\n just you know grab off your desk and plug into your\n\n1:42:45.540 --> 1:42:47.860\n computer and immediately use that's what they call like a\n\n1:42:47.860 --> 1:42:51.460\n hardware wallet or you can have some sort of software wallet\n\n1:42:51.460 --> 1:42:53.940\n right where it's not on an exchange but there is some\n\n1:42:53.940 --> 1:42:57.060\n level of in between between the hardware wallet and the\n\n1:42:57.060 --> 1:42:59.540\n exchange and the software wallet but the software wallet\n\n1:42:59.540 --> 1:43:02.980\n is connected to the internet yeah and so if you kind of\n\n1:43:02.980 --> 1:43:05.700\n think of it as like the exchange software wallet\n\n1:43:05.700 --> 1:43:07.780\n hardware wallet and then there's something called deep\n\n1:43:07.780 --> 1:43:11.060\n storage right or cold storage and this is you know\n\n1:43:11.060 --> 1:43:15.700\n literally there was a company called Zappo that would put\n\n1:43:15.700 --> 1:43:19.060\n things in deep cold storage and it was literally buried in\n\n1:43:19.060 --> 1:43:22.660\n a mountain right so like the odds that somebody's\n\n1:43:22.660 --> 1:43:24.900\n physically going to go there there's armed guards there's\n\n1:43:24.900 --> 1:43:27.460\n you know kind of all this type of stuff but again you're\n\n1:43:27.460 --> 1:43:29.620\n taking some level of counterparty risk because they\n\n1:43:29.620 --> 1:43:33.780\n have your Bitcoin and so the saying or the phrase is not\n\n1:43:33.780 --> 1:43:38.180\n your keys not your coins whereas my buddy Isaiah Jackson\n\n1:43:38.180 --> 1:43:42.420\n came up with he said not your keys not your cheese right in\n\n1:43:42.420 --> 1:43:46.420\n terms of sovereignty is important right and ultimately\n\n1:43:46.420 --> 1:43:48.180\n this goes back to kind of the beginning of our conversation\n\n1:43:48.180 --> 1:43:52.180\n around Bitcoin's ethos sovereignty right giving the\n\n1:43:52.180 --> 1:43:55.300\n power back to people you don't have to rely on this\n\n1:43:55.300 --> 1:43:58.020\n infrastructure in order to be able to participate in this\n\n1:43:58.020 --> 1:44:01.540\n monetary kind of economy what you are now able to do is\n\n1:44:01.540 --> 1:44:04.420\n you're able to use digital sound money you're able to\n\n1:44:04.420 --> 1:44:07.620\n keep control of it you and you alone are responsible for it\n\n1:44:07.620 --> 1:44:10.900\n so the idea of personal responsibility and then also\n\n1:44:10.900 --> 1:44:13.540\n you and you alone make the decisions as to whether you\n\n1:44:13.540 --> 1:44:16.900\n hold on to it or you use it without censorship right no\n\n1:44:16.900 --> 1:44:19.060\n one can tell you what you can do with it or can't do with it\n\n1:44:19.060 --> 1:44:24.580\n and so the purchase and the storage what I find is\n\n1:44:24.580 --> 1:44:29.460\n depending on who you are there's varying degrees of kind\n\n1:44:29.460 --> 1:44:32.660\n of concern or decisions that get made there and a lot of it\n\n1:44:32.660 --> 1:44:35.300\n comes down to personal preference the Bitcoin\n\n1:44:35.300 --> 1:44:38.740\n community though absolutely will over optimize for\n\n1:44:38.740 --> 1:44:42.260\n sovereignty and kind of hardware or cold storage I\n\n1:44:42.260 --> 1:44:45.220\n wonder if you can sort of comment on that because you\n\n1:44:45.220 --> 1:44:52.100\n have both sort of cash app and the BlockFi and Coinbase like\n\n1:44:52.100 --> 1:44:56.020\n you can store it that you can purchase and trade it there\n\n1:44:56.020 --> 1:44:59.620\n and store it there and so on but ultimately they're saying\n\n1:44:59.620 --> 1:45:02.340\n you wanna you know keep some of it there but you wanna move\n\n1:45:02.340 --> 1:45:06.260\n it to the hardware wallet and the cold storage of the\n\n1:45:06.260 --> 1:45:08.820\n hardware wallet is like you can disconnect this from the\n\n1:45:08.820 --> 1:45:11.540\n computer because ultimately stuff that's connected to the\n\n1:45:11.540 --> 1:45:16.180\n internet can be compromised can be controlled by governments\n\n1:45:16.180 --> 1:45:19.860\n and other parties and so on what are your thoughts about\n\n1:45:19.860 --> 1:45:24.340\n sort of practically speaking for maybe like a regular\n\n1:45:24.340 --> 1:45:28.100\n citizen what's what should be the role of the hardware wallet\n\n1:45:28.100 --> 1:45:31.060\n in their lives yeah so at the highest level I just think\n\n1:45:31.060 --> 1:45:33.860\n that like learning about it is important right so even if you\n\n1:45:33.860 --> 1:45:37.540\n only have five dollars equivalent of Bitcoin going and\n\n1:45:37.540 --> 1:45:39.940\n understanding here's how it works here's why it's important\n\n1:45:39.940 --> 1:45:42.900\n here's how I would actually withdraw from an exchange under\n\n1:45:42.900 --> 1:45:45.700\n the hardware wall like that alone just as an intellectual\n\n1:45:45.700 --> 1:45:47.860\n exercise is a worthwhile pursuit I think people should\n\n1:45:47.860 --> 1:45:50.500\n go do that actually go through the process of the steps so\n\n1:45:50.500 --> 1:45:53.460\n you feel like you can you can do it yeah yeah it's kind of\n\n1:45:53.460 --> 1:45:55.620\n like if I said to you you know hey we're gonna go buy an\n\n1:45:55.620 --> 1:45:57.940\n asset and you never went and you looked at it you never went\n\n1:45:57.940 --> 1:46:01.060\n and you know made a decision like sure maybe I did it or I\n\n1:46:01.060 --> 1:46:03.380\n didn't do it but like you didn't actually experience it\n\n1:46:03.380 --> 1:46:05.540\n right and so I think that that's important part the\n\n1:46:05.540 --> 1:46:09.780\n second thing is each person is different from a how they view\n\n1:46:09.780 --> 1:46:12.020\n this asset so there are some people who are speculating\n\n1:46:12.020 --> 1:46:14.260\n right there's three use cases for Bitcoin their store value\n\n1:46:14.260 --> 1:46:16.900\n medium of exchange and speculation and the people who\n\n1:46:16.900 --> 1:46:19.780\n are speculating they can't put it in deep cold storage because\n\n1:46:19.780 --> 1:46:22.660\n they need to be able to trade it right so what ends up\n\n1:46:22.660 --> 1:46:25.140\n happening is they fall in the bucket of like high risk high\n\n1:46:25.140 --> 1:46:28.580\n reward they're trying to trade they're trying to do all these\n\n1:46:28.580 --> 1:46:30.900\n things and sure maybe there are profits that they can generate\n\n1:46:30.900 --> 1:46:33.620\n if they're good at it but also they're introducing a lot of\n\n1:46:33.620 --> 1:46:36.260\n risk and so that person is very different than the person who\n\n1:46:36.260 --> 1:46:38.740\n says hey you know I bought one Bitcoin and I'm gonna save it\n\n1:46:38.740 --> 1:46:40.900\n for my child right and I'm gonna give it to them on their\n\n1:46:40.900 --> 1:46:44.180\n 18th birthday yeah and so when you start to look at this what\n\n1:46:44.180 --> 1:46:48.340\n you end up saying is what are you actually purchasing this\n\n1:46:48.340 --> 1:46:50.900\n for kind of like why are you doing it and then what's your\n\n1:46:50.900 --> 1:46:55.060\n time horizon and what ends up happening is more and more\n\n1:46:55.060 --> 1:46:57.540\n people in the Bitcoin community have longer time horizons one\n\n1:46:57.540 --> 1:47:01.060\n of the advantages to this community right if you look at\n\n1:47:01.060 --> 1:47:04.980\n the on chain metrics 60% of Bitcoin haven't moved from the\n\n1:47:04.980 --> 1:47:08.340\n digital wallet in which they sit in the last 12 months so\n\n1:47:08.340 --> 1:47:10.740\n even though it's appreciated hundreds of percent on the\n\n1:47:10.740 --> 1:47:13.940\n upside there's been lots of volatility a 50% drop in a\n\n1:47:13.940 --> 1:47:17.540\n single day in terms of US dollar price still doesn't move\n\n1:47:17.540 --> 1:47:19.620\n and so these are the kind of long term holders right these\n\n1:47:19.620 --> 1:47:22.980\n are the the iron fist or or as recently has become popular the\n\n1:47:22.980 --> 1:47:27.780\n diamond hands right they just they're not going anywhere and\n\n1:47:27.780 --> 1:47:32.180\n so I think that those people are much more likely to not have\n\n1:47:32.180 --> 1:47:35.780\n their Bitcoin on exchanges or in software walls they've got it\n\n1:47:35.780 --> 1:47:39.540\n in some sort of like highly secure environment and what and\n\n1:47:39.540 --> 1:47:43.780\n one in which they have deep sovereignty or kind of prevalent\n\n1:47:43.780 --> 1:47:46.980\n sovereignty and the reason for that is because they have that\n\n1:47:46.980 --> 1:47:50.820\n long time horizon they don't want to be kind of convicted\n\n1:47:50.820 --> 1:47:55.700\n around Bitcoin sound money macro environment all stuff and\n\n1:47:55.700 --> 1:47:58.100\n then they make a mistake because they trusted you know\n\n1:47:58.100 --> 1:48:01.940\n ABCD company and that counterparty risk ends up\n\n1:48:01.940 --> 1:48:06.100\n actually being you know fatal or or detrimental so again this\n\n1:48:06.100 --> 1:48:12.340\n is not financial advice disclaimer but let me ask so\n\n1:48:12.340 --> 1:48:16.180\n in terms of investment advice on Bitcoin so you see Bitcoin\n\n1:48:16.180 --> 1:48:19.700\n potentially not just the thing that you speculate over like\n\n1:48:19.700 --> 1:48:22.580\n buy and sell buy and sell buy and sell but it's something\n\n1:48:22.580 --> 1:48:26.500\n that you can just buy only and I believe I've heard that you\n\n1:48:26.500 --> 1:48:31.220\n own quite a large percentage of of your wealth in in Bitcoin\n\n1:48:31.220 --> 1:48:34.980\n and you're basically buying only and storing long term so\n\n1:48:34.980 --> 1:48:38.180\n that's something that's a legitimate way to approach\n\n1:48:38.180 --> 1:48:41.940\n Bitcoin in your recommendation go to other cultures so if we\n\n1:48:41.940 --> 1:48:45.060\n remove ourselves from the Western world culture of\n\n1:48:45.060 --> 1:48:48.020\n investing in gamification of financial markets and the\n\n1:48:48.020 --> 1:48:51.540\n financialization of everything let's say we go to the culture\n\n1:48:51.540 --> 1:48:55.860\n of India for hundreds if not thousands of years families\n\n1:48:55.860 --> 1:49:00.420\n basically saved their wealth in gold and in jewelry and in\n\n1:49:00.420 --> 1:49:04.820\n these hard assets with the expectation to pass it on to\n\n1:49:04.820 --> 1:49:09.620\n the next generation and so it would be blasphemous to sell\n\n1:49:09.620 --> 1:49:12.660\n the family's gold in that culture right you know your\n\n1:49:12.660 --> 1:49:14.820\n great grandfather gave to your grandfather your grandfather\n\n1:49:14.820 --> 1:49:17.700\n gave to your father your father gave it to you right and\n\n1:49:17.700 --> 1:49:24.020\n so in that culture the long term kind of holding is the\n\n1:49:24.020 --> 1:49:28.820\n default I think that what Bitcoin has presented again is\n\n1:49:28.820 --> 1:49:32.900\n a digital application of the exact same thing which is that\n\n1:49:32.900 --> 1:49:35.540\n while everything else in the world is being devalued that is\n\n1:49:35.540 --> 1:49:40.500\n denominated in a currency that is being inflated away whether\n\n1:49:40.500 --> 1:49:45.220\n it's quickly or not this finite supply this scarce asset ends\n\n1:49:45.220 --> 1:49:49.460\n up accruing more and more value over time right and so I think\n\n1:49:49.460 --> 1:49:53.940\n that for me personally I've got you know over 95% of my net\n\n1:49:53.940 --> 1:49:59.540\n worth that's in this 90 over 95% of your net worth there's\n\n1:49:59.540 --> 1:50:04.900\n two important caveats to this one is I didn't you know buy\n\n1:50:04.900 --> 1:50:08.260\n some Bitcoin in 2011 or 12 right and then all of a sudden it\n\n1:50:08.260 --> 1:50:11.620\n appreciated a bunch and it grew into that but from a cost\n\n1:50:11.620 --> 1:50:14.580\n basis perspective you know put $100 and now it's a ton of\n\n1:50:14.580 --> 1:50:21.140\n money instead what I did was I basically in 2018 saw Bitcoin\n\n1:50:21.140 --> 1:50:23.140\n from a US dollar price standpoint was falling and\n\n1:50:23.140 --> 1:50:26.020\n falling and falling and in December 2018 as I take about\n\n1:50:26.020 --> 1:50:30.420\n 50% of my net worth and convert it from dollar denominated\n\n1:50:30.420 --> 1:50:32.660\n assets into Bitcoin so it's a very kind of intentional\n\n1:50:32.660 --> 1:50:34.980\n decision with a very specific view on the world as to like\n\n1:50:34.980 --> 1:50:38.820\n why I was doing it I then essentially just let it sit\n\n1:50:38.820 --> 1:50:44.100\n there grow whatever until the spring of 2020 and when I saw\n\n1:50:44.100 --> 1:50:47.620\n the government step in and start to say hey we're going to\n\n1:50:47.620 --> 1:50:50.100\n really be aggressive in terms of interest rate manipulation\n\n1:50:50.100 --> 1:50:52.820\n and quantitative easing I then decided to go ahead and take\n\n1:50:52.820 --> 1:50:55.940\n basically the remainder and start to convert it as well so\n\n1:50:55.940 --> 1:50:59.700\n became very aggressive in doing that and so the way that I look\n\n1:50:59.700 --> 1:51:03.780\n at it is that's actually my savings right and so in some\n\n1:51:03.780 --> 1:51:06.100\n weird way if I said to you know what's the dollar worth you'd\n\n1:51:06.100 --> 1:51:09.860\n say well a one dollar bill is worth one dollar right Bitcoin\n\n1:51:09.860 --> 1:51:13.620\n to me I denominate my wealth in Bitcoin so I think of one\n\n1:51:13.620 --> 1:51:16.420\n Bitcoin is worth one Bitcoin not one Bitcoin is worth 60,000\n\n1:51:16.420 --> 1:51:19.140\n or 55,000 or 70,000 right I denominated everything in\n\n1:51:19.140 --> 1:51:22.340\n Bitcoin when I make a purchase in my head I'm calculating how\n\n1:51:22.340 --> 1:51:25.460\n much Bitcoin am I spending right now right well guess what\n\n1:51:25.460 --> 1:51:28.420\n happens when you have a devaluing currency as the\n\n1:51:28.420 --> 1:51:32.100\n denominator doesn't matter right like your financial\n\n1:51:32.100 --> 1:51:36.100\n incentivize to spend or invest right to consume when you have\n\n1:51:36.100 --> 1:51:41.060\n an appreciating currency all of a sudden you become much less\n\n1:51:41.060 --> 1:51:44.980\n consumptive in your behavior yeah because you're actually\n\n1:51:44.980 --> 1:51:50.580\n trading off future purchasing power for the consumption today\n\n1:51:50.580 --> 1:51:55.380\n it's fascinating to think that if if when you move about this\n\n1:51:55.380 --> 1:51:59.860\n world you think in Bitcoin you behave differently is if you\n\n1:51:59.860 --> 1:52:05.380\n think in dollars that's really fascinating people but here's\n\n1:52:05.380 --> 1:52:09.060\n the thing is the last 50 years or so is actually the outlier\n\n1:52:09.060 --> 1:52:14.500\n in history most people used to think this way yeah it's only\n\n1:52:14.500 --> 1:52:18.740\n when a fiat currency got introduced that one argument the\n\n1:52:18.740 --> 1:52:21.380\n positive argument or perspective is there was an\n\n1:52:21.380 --> 1:52:24.980\n explosion in growth but really it's because there was a\n\n1:52:24.980 --> 1:52:28.820\n financial incentive to consume yeah right and there's nobody\n\n1:52:28.820 --> 1:52:31.620\n better in the world than the United States at consuming and\n\n1:52:31.620 --> 1:52:34.740\n we consume anything and everything and if you want to\n\n1:52:34.740 --> 1:52:37.540\n see a great example look at how big the coca colas are at\n\n1:52:37.540 --> 1:52:40.020\n McDonald's right you know you go to other places they don't\n\n1:52:40.020 --> 1:52:44.500\n serve them that big and so the other example though or the\n\n1:52:44.500 --> 1:52:50.660\n negative argument is we have to consume because if not you end\n\n1:52:50.660 --> 1:52:53.700\n up being the bottom 45% of Americans that help no\n\n1:52:53.700 --> 1:52:56.900\n investable assets and actually are just having their wealth\n\n1:52:56.900 --> 1:53:01.140\n devalued away so holding the dollars end up being a very bad\n\n1:53:01.140 --> 1:53:05.060\n economic decision and so when you then switch to this sound\n\n1:53:05.060 --> 1:53:09.620\n money you say wait a second why would I if today I can trade\n\n1:53:09.620 --> 1:53:13.140\n one Bitcoin you know back in October of last year one Bitcoin\n\n1:53:13.140 --> 1:53:17.620\n for 10 thousand US dollars why would I spend that if at some\n\n1:53:17.620 --> 1:53:20.580\n point in the future whether it's a month from now or 10\n\n1:53:20.580 --> 1:53:23.540\n years from now I could trade it for something much much more\n\n1:53:23.540 --> 1:53:30.340\n than that you just become much more of a anti consumer and\n\n1:53:30.340 --> 1:53:32.980\n much more of a long term thinker yeah from the individual\n\n1:53:32.980 --> 1:53:35.380\n perspective that's pretty powerful I wonder I mean I\n\n1:53:35.380 --> 1:53:38.340\n think that's a interesting debate what's better for the\n\n1:53:38.340 --> 1:53:44.420\n long term economy no better for the growth of the civilization\n\n1:53:44.420 --> 1:53:49.620\n because capitalism is fascinating it seems to it seems\n\n1:53:49.620 --> 1:53:54.340\n to work pretty well there's this kind of like Eric Weinstein\n\n1:53:54.340 --> 1:53:59.300\n says that one of the problems is for the past several decades\n\n1:53:59.300 --> 1:54:03.860\n this whole economy society is built on the idea that we have\n\n1:54:03.860 --> 1:54:08.100\n to keep growing like it depends on that idea and it's a\n\n1:54:08.100 --> 1:54:11.460\n good question whether that's going to result in huge\n\n1:54:11.460 --> 1:54:17.540\n problems or if like a college student on a deadline the\n\n1:54:17.540 --> 1:54:21.780\n the dependence on growth will mean that we'll have to grow\n\n1:54:21.780 --> 1:54:25.620\n like the fear of death will force us to grow but I think\n\n1:54:25.620 --> 1:54:29.300\n there's a false equivalency between we're dependent on\n\n1:54:29.300 --> 1:54:32.660\n growth and then if the world was denominated in sound money\n\n1:54:32.660 --> 1:54:36.980\n we don't grow what I think ends up happening is we remove a\n\n1:54:36.980 --> 1:54:41.300\n lot of the society's bullshit yeah because right now when the\n\n1:54:41.300 --> 1:54:45.140\n money is free or the currency is free you come with all kinds\n\n1:54:45.140 --> 1:54:48.260\n of crazy stuff and people will give it to you right when all\n\n1:54:48.260 --> 1:54:53.060\n of a sudden it's really really valued by the population the\n\n1:54:53.060 --> 1:54:56.900\n decisions are better yeah you you have to provide real value\n\n1:54:56.900 --> 1:54:59.140\n in the goods and services you provide in order to get them to\n\n1:54:59.140 --> 1:55:01.540\n give it to you there's less room for corruption less room\n\n1:55:01.540 --> 1:55:04.740\n for manipulation that's and like that's not actually\n\n1:55:04.740 --> 1:55:10.340\n productive yeah definitely so you said you moved a lot of\n\n1:55:10.340 --> 1:55:16.500\n your investment into bitcoin is there when you look so you're\n\n1:55:16.500 --> 1:55:21.220\n a special human being in many ways so you're like a strategic\n\n1:55:21.220 --> 1:55:23.540\n thinker but you're also like a deep thinker about this whole\n\n1:55:23.540 --> 1:55:27.620\n thing but when you look at a regular club like me in terms\n\n1:55:27.620 --> 1:55:31.540\n of just investing and moving into thinking about\n\n1:55:31.540 --> 1:55:34.740\n cryptocurrency is there a strategy that you recommend\n\n1:55:34.740 --> 1:55:38.420\n what are the different options about investing into bitcoin\n\n1:55:38.420 --> 1:55:41.860\n yeah so i think that there's just uh kind of timeless advice\n\n1:55:41.860 --> 1:55:45.540\n when it comes to uh investing or or acquiring an asset in\n\n1:55:45.540 --> 1:55:48.260\n general uh dollar cost averaging is usually the the\n\n1:55:48.260 --> 1:55:51.780\n best way to think about it and what i mean by that is um most\n\n1:55:51.780 --> 1:55:55.300\n people don't just have a pile of uh currency sitting there\n\n1:55:55.300 --> 1:55:57.060\n right it's not like they have a million dollars sitting in\n\n1:55:57.060 --> 1:56:00.740\n their bank like what do i do with it uh that situation aside\n\n1:56:00.740 --> 1:56:05.460\n what happens is they trade their hours and their effort for\n\n1:56:05.460 --> 1:56:08.500\n currency and so as they get paid every two weeks let's say\n\n1:56:08.500 --> 1:56:12.660\n um the best way to acquire bitcoin without having to worry about timing\n\n1:56:12.660 --> 1:56:15.940\n markets and being a professional trader is to simply take whatever the\n\n1:56:15.940 --> 1:56:19.780\n percentages that you want and to buy bitcoin when you get your\n\n1:56:19.780 --> 1:56:22.820\n paycheck so if you get paid on the first and 15th of every month\n\n1:56:22.820 --> 1:56:25.780\n on that day you should go take you know let's say it's three percent of your\n\n1:56:25.780 --> 1:56:28.260\n paycheck take three percent go buy bitcoin don't\n\n1:56:28.260 --> 1:56:30.820\n worry about what the price is you should do that over time and the\n\n1:56:30.820 --> 1:56:35.220\n reason why that's important is um if in december of 2017 when bitcoin\n\n1:56:35.220 --> 1:56:38.180\n is at twenty thousand dollars it was the height of kind of this last\n\n1:56:38.180 --> 1:56:41.700\n uh big upwards movement you had taken all of your money\n\n1:56:41.700 --> 1:56:45.220\n and you had put it into bitcoin you would have had to wait almost three\n\n1:56:45.220 --> 1:56:48.180\n years just to get back to quote unquote break even\n\n1:56:48.180 --> 1:56:54.820\n in us dollar terms if at the same time you had simply bought then and over the\n\n1:56:54.820 --> 1:56:58.180\n next three years bought every two weeks you would have been up hundreds of\n\n1:56:58.180 --> 1:57:01.460\n percent three years later because what ended up\n\n1:57:01.460 --> 1:57:03.540\n happening was you bought a bunch of bitcoin when it was at\n\n1:57:03.540 --> 1:57:09.620\n 15 12 10 9 8 3 4 5 5 5 you know all the way back up on the\n\n1:57:09.620 --> 1:57:12.660\n other side and so dollar cost averaging is one of\n\n1:57:12.660 --> 1:57:17.140\n these weird things that uh it almost sounds too easy but what we\n\n1:57:17.140 --> 1:57:21.300\n find is in america we have a lack of financial education\n\n1:57:21.300 --> 1:57:24.740\n and so rather than try to be smarter than markets what most people are better\n\n1:57:24.740 --> 1:57:27.540\n off doing is just saying hey set your what's called an asset\n\n1:57:27.540 --> 1:57:32.100\n allocation plan i want 30 in stocks i want 10 in real\n\n1:57:32.100 --> 1:57:35.300\n estate i want this this whatever and every time you get your paycheck\n\n1:57:35.300 --> 1:57:38.500\n just think of it as a savings account right just put it in\n\n1:57:38.500 --> 1:57:41.620\n based on those percentages and don't think about it\n\n1:57:41.620 --> 1:57:44.820\n and over a long enough period of time what we find is\n\n1:57:44.820 --> 1:57:48.020\n almost anyone in the united states right there's exceptions but almost anyone in\n\n1:57:48.020 --> 1:57:50.340\n the united states can become a millionaire in their\n\n1:57:50.340 --> 1:57:54.100\n lifetime if they follow these plans and have that long term view and they allow\n\n1:57:54.100 --> 1:57:57.460\n compounding to work for them and so don't look at the price of\n\n1:57:57.460 --> 1:58:00.020\n bitcoin and all that kind of stuff just pick a\n\n1:58:00.020 --> 1:58:04.340\n specific time specific day that you just buy\n\n1:58:04.340 --> 1:58:07.700\n and you just keep buying that's probably good investment advice across any kind\n\n1:58:07.700 --> 1:58:10.420\n of assets it's like if you don't believe in\n\n1:58:10.420 --> 1:58:13.220\n bitcoin and you just want to let's say you just want to do the s&p 500\n\n1:58:13.220 --> 1:58:16.500\n yeah you shouldn't try to time the market of the s&p 500 either right you\n\n1:58:16.500 --> 1:58:18.580\n should just every two weeks you should just buy some\n\n1:58:18.580 --> 1:58:21.860\n and over a 20 year period you're gonna end up buying it at all kinds\n\n1:58:21.860 --> 1:58:24.740\n of different prices but you're gonna get kind of a blended average\n\n1:58:24.740 --> 1:58:28.420\n and the more important thing is the compounding and the time in the market\n\n1:58:28.420 --> 1:58:32.260\n then did you buy it at you know two percent higher or lower than where you\n\n1:58:32.260 --> 1:58:35.300\n bought it doesn't really matter and buying often makes you i guess\n\n1:58:35.300 --> 1:58:40.020\n uh resistant robust to the uh to the volatility of the market or the\n\n1:58:40.020 --> 1:58:46.340\n volatility of bitcoin price and so on that said uh you know bitcoin price\n\n1:58:46.340 --> 1:58:53.620\n is volatile and you know again the argument i've heard\n\n1:58:53.620 --> 1:59:00.340\n is like everything that's going to be a lot more valuable in the future\n\n1:59:00.340 --> 1:59:04.580\n like if you look at the history like companies like apple like teslas\n\n1:59:04.580 --> 1:59:08.740\n now i mean but let's look at companies that\n\n1:59:08.740 --> 1:59:12.660\n have now stabilized right uh apple is a good example\n\n1:59:12.660 --> 1:59:17.140\n it's like volatile in the beginning and so the argument for bitcoin is like\n\n1:59:17.140 --> 1:59:21.540\n yeah this is the early stages because it's going to be a lot more valuable\n\n1:59:21.540 --> 1:59:24.420\n right now it's volatile and this is why you have to have these kinds of\n\n1:59:24.420 --> 1:59:28.500\n strategies to ride out the volatility of course everything that goes to zero is\n\n1:59:28.500 --> 1:59:33.060\n also volatile like the early days are volatile uh\n\n1:59:33.060 --> 1:59:36.740\n do you see like this volatility as like a feature or a bug\n\n1:59:36.740 --> 1:59:40.420\n or is this just like a way of life so amazon is the one that i know the\n\n1:59:40.420 --> 1:59:45.460\n numbers on in terms of early volatility uh every year since it has gone public\n\n1:59:45.460 --> 1:59:50.180\n it's had a double digit drawdown in that year uh the average\n\n1:59:50.180 --> 1:59:55.300\n is over 30 percent and one time it drew down over 95 percent\n\n1:59:55.300 --> 1:59:58.980\n sounds a lot like bitcoin right like oh wow this is crazy\n\n1:59:58.980 --> 2:00:01.860\n but it's one of the best performing stocks in the last 20 years if not the\n\n2:00:01.860 --> 2:00:05.700\n best performing stock and so volatility is not positive or\n\n2:00:05.700 --> 2:00:08.820\n negative it's positive or negative compared to the\n\n2:00:08.820 --> 2:00:12.660\n position you're in so if you're long and it's volatile to the\n\n2:00:12.660 --> 2:00:16.500\n upside it's positive if you're long holding something and\n\n2:00:16.500 --> 2:00:19.460\n it's volatile to the downside you see it as a negative it's all about\n\n2:00:19.460 --> 2:00:23.700\n perspective with that said um another way that i\n\n2:00:23.700 --> 2:00:28.180\n look at this is every asset priced in bitcoin\n\n2:00:28.180 --> 2:00:32.500\n is down significantly so over the last one\n\n2:00:32.500 --> 2:00:36.260\n three five years the dollar priced in bitcoin\n\n2:00:36.260 --> 2:00:41.700\n has crashed 99 percent if you denominate stocks it's down like\n\n2:00:41.700 --> 2:00:44.820\n 80 85 if you denominate gold if you\n\n2:00:44.820 --> 2:00:47.700\n denominate bonds if you just go down the line real estate etc\n\n2:00:47.700 --> 2:00:53.060\n it's all down massively against bitcoin now you could argue that that's because\n\n2:00:53.060 --> 2:00:55.700\n bitcoin is appreciating in us dollar terms\n\n2:00:55.700 --> 2:00:58.980\n or you could actually argue that the world is\n\n2:00:58.980 --> 2:01:02.100\n repricing this asset it's doing price discovery on this asset\n\n2:01:02.100 --> 2:01:05.460\n and it's essentially comparing it's saying hey bitcoin verse\n\n2:01:05.460 --> 2:01:08.500\n this stock or bitcoin verse this ounce of gold or bitcoin verse\n\n2:01:08.500 --> 2:01:11.540\n you know this dollar which is more valuable and it continues to move up in\n\n2:01:11.540 --> 2:01:13.700\n the rankings in terms of the value that the world\n\n2:01:13.700 --> 2:01:16.580\n ascribes to this some of that's based on lindy effect just\n\n2:01:16.580 --> 2:01:20.340\n the longer it persists the more likely it is to survive some of that's based on\n\n2:01:20.340 --> 2:01:23.780\n like the underlying fundamentals of how much computing power the usage\n\n2:01:23.780 --> 2:01:28.340\n transaction volume things like that but some of it also is that as more\n\n2:01:28.340 --> 2:01:31.860\n and more people wake up to the fact that it's a finite supply asset that has a\n\n2:01:31.860 --> 2:01:35.220\n place in the world and demand increases people just naturally\n\n2:01:35.220 --> 2:01:38.580\n compete and ascribe more value to it and so the\n\n2:01:38.580 --> 2:01:42.420\n volatility i think all comes back to like what do you\n\n2:01:42.420 --> 2:01:45.780\n price your life in for majority people that's dollars\n\n2:01:45.780 --> 2:01:49.220\n and so you look at the us dollar price you get all this volatility\n\n2:01:49.220 --> 2:01:52.980\n the beauty of this is that 60 that doesn't move regardless of\n\n2:01:52.980 --> 2:01:57.220\n price upward or downward and movement those people aren't looking at the day\n\n2:01:57.220 --> 2:01:59.700\n to day price what they've basically said is i've\n\n2:01:59.700 --> 2:02:04.020\n acquired x amount of bitcoin and i'm just going to hold it for years\n\n2:02:04.020 --> 2:02:07.780\n and every time somebody's done that right if if uh you bought bitcoin at any point\n\n2:02:07.780 --> 2:02:13.700\n in the last 12 years and you held it till today you are up in us dollar terms\n\n2:02:13.700 --> 2:02:18.100\n now if we had this conversation 18 months ago couldn't say that\n\n2:02:18.100 --> 2:02:21.140\n so it's all about not only the acquisition\n\n2:02:21.140 --> 2:02:24.260\n price if you will it's also when are you looking at it\n\n2:02:24.260 --> 2:02:27.380\n right because there was a point in 2017 you could have said the same thing but\n\n2:02:27.380 --> 2:02:30.820\n in 18 you couldn't and so i tend to think a lot about um\n\n2:02:30.820 --> 2:02:33.540\n humans are really really bad at short term\n\n2:02:33.540 --> 2:02:36.580\n uh decision making because we're so emotional\n\n2:02:36.580 --> 2:02:40.580\n especially when something has a price tied to it and so it's in terms of our\n\n2:02:40.580 --> 2:02:43.540\n strategies and decision making we should be long term and have like a\n\n2:02:43.540 --> 2:02:46.500\n regular almost think like an algorithm that\n\n2:02:46.500 --> 2:02:50.260\n in that in that kind of way so i think you've tweeted that\n\n2:02:50.260 --> 2:02:53.700\n you believe that bitcoin has a chance of reaching 1 million i don't know what it\n\n2:02:53.700 --> 2:02:59.700\n is currently i think it's five the 60s which is incredible\n\n2:02:59.700 --> 2:03:03.780\n i think i remember when it was at least in the double digits i think i remember\n\n2:03:03.780 --> 2:03:09.700\n it was in the signal digits of a dollar so the fact that it's cross 50 is crazy\n\n2:03:09.700 --> 2:03:15.220\n uh but uh you're even crazier apparently thinking that it can reach a million\n\n2:03:15.220 --> 2:03:18.580\n so do you think it's possible for it to reach a million is there some kind of\n\n2:03:18.580 --> 2:03:21.140\n transformative effects we have to see first\n\n2:03:21.140 --> 2:03:25.540\n when might it reach a million like what are the signs that we would look for\n\n2:03:25.540 --> 2:03:29.780\n what's required for it to reach a million so let's just look at it from a macro\n\n2:03:29.780 --> 2:03:33.620\n perspective uh gold is a 10 trillion dollar asset\n\n2:03:33.620 --> 2:03:38.020\n and when you compare the technology of gold to the technology of bitcoin\n\n2:03:38.020 --> 2:03:41.620\n bitcoin is superior in every single way right it's more portable it's more\n\n2:03:41.620 --> 2:03:44.260\n divisible uh it's more verifiable it's more\n\n2:03:44.260 --> 2:03:48.100\n scarce on everything and so some people would argue it's a\n\n2:03:48.100 --> 2:03:51.380\n 10x improvement some people argue it's 100x improvement from a technology\n\n2:03:51.380 --> 2:03:55.700\n standpoint and so we don't need bitcoin to\n\n2:03:55.700 --> 2:04:00.340\n actually kind of um capture the full 10x or 100x\n\n2:04:00.340 --> 2:04:04.420\n improvement from a market cap standpoint if bitcoin simply captures\n\n2:04:04.420 --> 2:04:08.260\n 2x the value be a 20 trillion dollar market cap\n\n2:04:08.260 --> 2:04:10.260\n which would put bitcoin at about a million dollars\n\n2:04:10.260 --> 2:04:13.620\n right so kind of just from a macro perspective if you have a 10x or 100x\n\n2:04:13.620 --> 2:04:17.940\n improvement from a technology standpoint and you directionally get some value\n\n2:04:17.940 --> 2:04:21.780\n capture in that direction you're hitting around a million or more\n\n2:04:21.780 --> 2:04:25.540\n uh dollar price point can ask a quick question which is uh\n\n2:04:25.540 --> 2:04:28.740\n what's the current market cap for bitcoin uh the current market cap is\n\n2:04:28.740 --> 2:04:31.780\n right around a trillion just over a trillion dollars and you're saying gold\n\n2:04:31.780 --> 2:04:35.700\n is 10 trillion and uh sorry where did you get the 20\n\n2:04:35.700 --> 2:04:39.620\n trillion 20 trillion would just be 2x gold market cap\n\n2:04:39.620 --> 2:04:42.740\n got it right so if it's a 10x technology improvement let's just say it only\n\n2:04:42.740 --> 2:04:46.740\n captures 2x the market cap got it right and so again if it was to\n\n2:04:46.740 --> 2:04:49.060\n capture just gold market cap kind of the equivalent\n\n2:04:49.060 --> 2:04:52.740\n puts you around 500 000 right so you can kind of see there's bitcoin\n\n2:04:52.740 --> 2:04:55.940\n so if you capture the entirety of the gold market\n\n2:04:55.940 --> 2:05:00.260\n uh then it would be value of a single bitcoin uh the price of a single bitcoin\n\n2:05:00.260 --> 2:05:04.660\n would be five hundred thousand dollars okay\n\n2:05:04.660 --> 2:05:08.420\n to reach a million it would be double that that's what the 20 trillion comes\n\n2:05:08.420 --> 2:05:11.780\n from correct got it so if you then say to yourself\n\n2:05:11.780 --> 2:05:18.340\n okay how does the uh the pricing um kind of cycles work right or the\n\n2:05:18.340 --> 2:05:23.780\n boom and bust cycles gold is a very um\n\n2:05:23.780 --> 2:05:27.220\n kind of linear type supply schedule meaning that\n\n2:05:27.220 --> 2:05:30.660\n uh there is a certain amount of gold that comes out of the ground each year\n\n2:05:30.660 --> 2:05:35.860\n the interyear variation in that incoming supply is not much\n\n2:05:35.860 --> 2:05:38.980\n right maybe there's an extra mining company that gets set up or a couple of\n\n2:05:38.980 --> 2:05:40.980\n them maybe one goes out of business but for the\n\n2:05:40.980 --> 2:05:46.500\n most part the kind of inflationary uh increase to the supply of gold\n\n2:05:46.500 --> 2:05:52.660\n is pretty stagnant uh year over year bitcoin has a very unique feature which\n\n2:05:52.660 --> 2:05:56.580\n every four years there is a programmatic supply shock\n\n2:05:56.580 --> 2:06:00.500\n meaning that uh in the beginning 50 bitcoin every 10 minutes was introduced\n\n2:06:00.500 --> 2:06:03.380\n into the supply after four years of that happening every\n\n2:06:03.380 --> 2:06:06.900\n 10 minutes it was cut in half so on a in a single\n\n2:06:06.900 --> 2:06:11.860\n moment it went from 50 to now it was 25 four years every 10 minutes 25 got cut\n\n2:06:11.860 --> 2:06:16.900\n in half again to 12 and a half and then recently in may 2020 got cut to 6.25\n\n2:06:16.900 --> 2:06:20.500\n when you have an asset that is determined the price\n\n2:06:20.500 --> 2:06:23.460\n based on supply and demand you normally have\n\n2:06:23.460 --> 2:06:27.540\n two inputs to the equation what is the supply and what is the demand\n\n2:06:27.540 --> 2:06:31.060\n in an asset like gold or a stock or anything else\n\n2:06:31.060 --> 2:06:34.180\n we have to do our best guess at the supply\n\n2:06:34.180 --> 2:06:37.700\n both the existing supply and the incoming supply and do our best guess at\n\n2:06:37.700 --> 2:06:40.820\n the demand and we're actually pretty good at this a lot of times in terms of\n\n2:06:40.820 --> 2:06:44.020\n directionally saying it's going to go up or down and here's kind of some price\n\n2:06:44.020 --> 2:06:48.180\n point milestones bitcoin's unique in that there's 100\n\n2:06:48.180 --> 2:06:52.740\n verifiable proof of the existing supply\n\n2:06:52.740 --> 2:06:56.180\n the total supply and the incoming daily supply\n\n2:06:56.180 --> 2:06:59.620\n so we know 100 i can show you on the actual blockchain\n\n2:06:59.620 --> 2:07:03.620\n or in the code that there's 21 million bitcoin and that's all there will ever\n\n2:07:03.620 --> 2:07:06.820\n be i can show you that there's 18.6 million\n\n2:07:06.820 --> 2:07:09.860\n give or take bitcoin that actually are in circulation\n\n2:07:09.860 --> 2:07:12.500\n today right and i can go all the way back to every single transaction that's ever\n\n2:07:12.500 --> 2:07:15.300\n occurred since january 2009 and then i can show you on a daily\n\n2:07:15.300 --> 2:07:18.820\n basis that 900 bitcoin a day are coming into the circulating supply\n\n2:07:18.820 --> 2:07:22.660\n and so when you have 100 confidence because you can prove\n\n2:07:22.660 --> 2:07:26.180\n the supply side of this equation you can hold it constant\n\n2:07:26.180 --> 2:07:31.860\n i know with 100 accuracy the supply side so now i've reduced the mathematical\n\n2:07:31.860 --> 2:07:34.900\n equation that i need to do to determine price movements\n\n2:07:34.900 --> 2:07:38.420\n to a 50 reduction i only have to worry about demand i don't have to worry about\n\n2:07:38.420 --> 2:07:41.380\n supply and so when i look at demand i can do\n\n2:07:41.380 --> 2:07:44.580\n all kinds of things i can take the demand over the last 10 years and\n\n2:07:44.580 --> 2:07:47.460\n the growth and just extrapolate it out i can increase it i can decrease it\n\n2:07:47.460 --> 2:07:51.700\n whatever but what you find is that these supply\n\n2:07:51.700 --> 2:07:55.700\n shocks lead to significant price appreciation\n\n2:07:55.700 --> 2:07:59.860\n as the asset gets repriced because there there's a supply shock to\n\n2:07:59.860 --> 2:08:03.700\n and so probably the best thing that i've done over the last couple of years\n\n2:08:03.700 --> 2:08:07.940\n was in 2019 i started to talk about the idea that we were going to have both a\n\n2:08:07.940 --> 2:08:13.140\n supply shock and the demand shock in 2021\n\n2:08:13.140 --> 2:08:17.620\n or i'm sorry in 2020 i didn't know when this bull market that we were in was\n\n2:08:17.620 --> 2:08:20.340\n going to end nobody knows right it's impossible to time\n\n2:08:20.340 --> 2:08:23.620\n these things but you could tell that we were kind of at late stages of a cycle\n\n2:08:23.620 --> 2:08:27.940\n there was inverted yield curves there was rep uh gyrations in the repo markets\n\n2:08:27.940 --> 2:08:31.620\n a lot of ceos leaving their jobs you know all this kind of stuff\n\n2:08:31.620 --> 2:08:34.980\n and all i said was at some point when the market turns over\n\n2:08:34.980 --> 2:08:37.940\n the government's gonna have to step in we were addicted to stimulus they're\n\n2:08:37.940 --> 2:08:40.180\n gonna have to manipulate interest rates down and they're gonna have to print\n\n2:08:40.180 --> 2:08:43.380\n money i had no clue that there was going to be a global\n\n2:08:43.380 --> 2:08:45.700\n pandemic that they were going to have to step in\n\n2:08:45.700 --> 2:08:49.620\n in such an aggressive way and move rates not down but down to zero\n\n2:08:49.620 --> 2:08:52.100\n and that they not only were going to print hundreds of billions but they could\n\n2:08:52.100 --> 2:08:56.420\n print trillions of dollars but the framework that i used to think\n\n2:08:56.420 --> 2:09:00.420\n about this was when they do that everyone is going to\n\n2:09:00.420 --> 2:09:03.860\n run to store value assets they're going to run the gold they're going to run the\n\n2:09:03.860 --> 2:09:07.540\n bitcoin etc and right as they do that it appears at\n\n2:09:07.540 --> 2:09:09.540\n the same time there's going to be this supply shock\n\n2:09:09.540 --> 2:09:12.420\n so you're gonna get a supply shock and a demand shock that are both positive for\n\n2:09:12.420 --> 2:09:15.940\n the the price i called it rocket fuel for bitcoin\n\n2:09:15.940 --> 2:09:20.980\n well it happened and here we are i now look forward and i say okay we are\n\n2:09:20.980 --> 2:09:22.900\n likely going to see a hundred thousand bitcoin\n\n2:09:22.900 --> 2:09:25.700\n a hundred thousand dollar bitcoin this year or at some point i don't know when\n\n2:09:25.700 --> 2:09:28.740\n it happens but we're moving in that so you think in 2021 we'll see a hundred\n\n2:09:28.740 --> 2:09:32.740\n thousand that would be uh my most conservative\n\n2:09:32.740 --> 2:09:35.540\n view uh i i've said a hundred thousand dollars\n\n2:09:35.540 --> 2:09:38.820\n since 2019 and people thought that was insane and\n\n2:09:38.820 --> 2:09:41.780\n crazy and all stuff now i'm the conservative guy in the room\n\n2:09:41.780 --> 2:09:44.260\n because i stick with a hundred thousand dollars and people are saying\n\n2:09:44.260 --> 2:09:48.820\n you know multiples of that number here uh so we'll see what happens but\n\n2:09:48.820 --> 2:09:52.100\n but i think that there's still a lot of room kind of to run from a us dollar\n\n2:09:52.100 --> 2:09:56.100\n price standpoint what is on the horizon is in 2024 we\n\n2:09:56.100 --> 2:09:59.940\n will have another supply shock and so that's what i think will carry\n\n2:09:59.940 --> 2:10:04.500\n us to the million dollar bitcoin from 6 to 5 to whatever 50 reduction yeah\n\n2:10:04.500 --> 2:10:06.900\n yeah and so that's what i think uh well\n\n2:10:06.900 --> 2:10:10.020\n basically when we get that that next supply shock that'll carry us up over a\n\n2:10:10.020 --> 2:10:15.780\n hundred or over a one million dollar bitcoin price which if historical\n\n2:10:15.780 --> 2:10:20.100\n examples persist and again sometimes it's hard to use historical examples to\n\n2:10:20.100 --> 2:10:23.780\n look at future events um but if that happens we would see\n\n2:10:23.780 --> 2:10:27.380\n a million dollars of bitcoin by the end of 2026\n\n2:10:27.380 --> 2:10:32.420\n after that wave so 2024 basically is the supply shock and within\n\n2:10:32.420 --> 2:10:35.540\n you know 18 to 24 months you would see the uh\n\n2:10:35.540 --> 2:10:39.140\n the kind of top of the next market hopefully without a coupling to the net\n\n2:10:39.140 --> 2:10:44.020\n to another pandemic yes we we would like to do all of this without a\n\n2:10:44.020 --> 2:10:47.860\n public health crisis so that would take it to\n\n2:10:47.860 --> 2:10:51.540\n 20 trillion you don't have to compare it to the dollar\n\n2:10:51.540 --> 2:10:55.780\n essentially in some sense that the dollar could also lose value i mean\n\n2:10:55.780 --> 2:10:58.660\n there's a lot of kind of dynamics at play here\n\n2:10:58.660 --> 2:11:02.020\n now but like fundamentally there's going to be a huge\n\n2:11:02.020 --> 2:11:06.420\n move uh in your prediction of uh value into into bitcoin\n\n2:11:06.420 --> 2:11:10.340\n i mean that's a fascinating world uh to think about\n\n2:11:10.340 --> 2:11:16.180\n uh i mean but i do have to kind of ask you about the whole space of\n\n2:11:16.180 --> 2:11:19.140\n technology there because we're talking about the value of security we're\n\n2:11:19.140 --> 2:11:22.820\n talking about the the future which bitcoin will be at the\n\n2:11:22.820 --> 2:11:26.980\n center of but from my perspective of\n\n2:11:26.980 --> 2:11:31.540\n thinking how like i and others can build technologies on top of\n\n2:11:31.540 --> 2:11:35.140\n this kind of decentralized world i'm thinking about different\n\n2:11:35.140 --> 2:11:38.340\n different technologies out there different cryptocurrencies out there\n\n2:11:38.340 --> 2:11:42.100\n ethereum being one but there's a lot of others\n\n2:11:42.100 --> 2:11:45.300\n so i'd love to get your sort of ideas about some of these but\n\n2:11:45.300 --> 2:11:50.180\n so first let me ask you about what the hell is shit coin\n\n2:11:50.180 --> 2:11:54.900\n is this connected to uh to our previous discussion of the meme\n\n2:11:54.900 --> 2:11:59.460\n uh this shit coin cover basically all coins that are not\n\n2:11:59.460 --> 2:12:05.620\n bitcoin is it uh uh mean is it a beautiful is it's a mixture of\n\n2:12:05.620 --> 2:12:08.660\n both as with most things in life uh depends\n\n2:12:08.660 --> 2:12:14.100\n who you ask um the uh most um\n\n2:12:14.100 --> 2:12:19.140\n kind of enthusiastic and uh uh parts of the bitcoin community shit\n\n2:12:19.140 --> 2:12:23.300\n coin is anything else right kind of if you ascribe to kind\n\n2:12:23.300 --> 2:12:27.060\n of a maximalistic view of the world shit crime be anything if you look at\n\n2:12:27.060 --> 2:12:31.780\n people who i would say are bitcoin proponents uh yet\n\n2:12:31.780 --> 2:12:35.700\n see value in other things shit coin may be the bottom half\n\n2:12:35.700 --> 2:12:39.620\n of the other things right so i think again it's really important kind of who\n\n2:12:39.620 --> 2:12:42.100\n you ask is how you'll get that answer so\n\n2:12:42.100 --> 2:12:45.700\n there's tiers and the way you divide those tiers might be different depending\n\n2:12:45.700 --> 2:12:48.980\n who you ask ultimately what it is is it's a meme yeah\n\n2:12:48.980 --> 2:12:54.500\n and it's used to uh articulate the idea that whatever you want to put in\n\n2:12:54.500 --> 2:12:57.860\n that bucket has no value so shit coin right are coins that have\n\n2:12:57.860 --> 2:13:02.260\n no value yeah uh what is fascinating about it and i\n\n2:13:02.260 --> 2:13:05.060\n think that again speaks to the power of the bitcoin community\n\n2:13:05.060 --> 2:13:08.580\n is uh there was congressional hearings a couple years ago\n\n2:13:08.580 --> 2:13:13.460\n oh no and at one point uh a congressman from ohio warren davidson who uh\n\n2:13:13.460 --> 2:13:17.860\n who's definitely uh open minded and excited about bitcoin\n\n2:13:17.860 --> 2:13:20.900\n asked a an individual on the congress floor\n\n2:13:20.900 --> 2:13:26.740\n uh during testimony to uh talk about these other coins and at one point\n\n2:13:26.740 --> 2:13:31.300\n basically read into the record the terminology of shit coin\n\n2:13:31.300 --> 2:13:34.900\n he said the word shit coin uh i can't remember if he said it first\n\n2:13:34.900 --> 2:13:38.340\n somebody else did or if uh the other person did and then he uh um\n\n2:13:38.340 --> 2:13:42.180\n you know repeated it that's awesome but he definitely he was trying to get that\n\n2:13:42.180 --> 2:13:46.420\n read into the record yes uh for sure and so uh you know you\n\n2:13:46.420 --> 2:13:50.980\n can imagine one again the meme speaking insolently to\n\n2:13:50.980 --> 2:13:54.180\n the bitcoin community was you know made him very uh very well\n\n2:13:54.180 --> 2:14:00.020\n liked uh but also too was um it does go back to this idea almost of\n\n2:14:00.020 --> 2:14:05.460\n uh if you and i sat down with 10 ceos and we interviewed each one of them and\n\n2:14:05.460 --> 2:14:07.940\n then we went in a room and we deliberated and we said we have to pick\n\n2:14:07.940 --> 2:14:10.820\n the person who's going to be the most successful\n\n2:14:10.820 --> 2:14:13.540\n one of the inputs not all the inputs but one of the inputs would be\n\n2:14:13.540 --> 2:14:16.900\n who's the person who we believe has the best ability to\n\n2:14:16.900 --> 2:14:20.180\n raise capital recruit people and tell a story\n\n2:14:20.180 --> 2:14:26.020\n to the world that will get them to follow and so somebody like elon would\n\n2:14:26.020 --> 2:14:30.740\n probably be the best example of this when you have decentralized products you\n\n2:14:30.740 --> 2:14:34.340\n have no kind of leader right in the sense of somebody who is\n\n2:14:34.340 --> 2:14:37.620\n financially ascribed to be that leader and kind of the\n\n2:14:37.620 --> 2:14:40.260\n executive decision maker so what you have to do is you have to\n\n2:14:40.260 --> 2:14:43.140\n look at these technologies in these communities and say\n\n2:14:43.140 --> 2:14:48.260\n well which volunteer teams or which technologies have been able to coalesce\n\n2:14:48.260 --> 2:14:53.380\n these groups around it and in some way build the same level of\n\n2:14:53.380 --> 2:14:57.460\n engagement and protection and things like that and so\n\n2:14:57.460 --> 2:15:00.820\n you actually get tribalism but you also get things like\n\n2:15:00.820 --> 2:15:05.380\n shitcoin because what it does is it's not only a um\n\n2:15:05.380 --> 2:15:12.100\n kind of verbal attack towards uh others it's a rallying cry for\n\n2:15:12.100 --> 2:15:16.500\n internal what's so funny is that it was started with the bitcoin community\n\n2:15:16.500 --> 2:15:19.780\n talking about everybody but now you've seen adoption in other communities who\n\n2:15:19.780 --> 2:15:21.700\n use it you know basically say well we're not a\n\n2:15:21.700 --> 2:15:26.020\n shitcoin it's the it's the next guy yeah i mean the meaning to be honest\n\n2:15:26.020 --> 2:15:29.380\n it's it's one it's off it's sometimes\n\n2:15:29.380 --> 2:15:32.900\n misused i think like with anything it's like\n\n2:15:32.900 --> 2:15:37.540\n people adopt memes that used to be brilliant or still brilliant\n\n2:15:37.540 --> 2:15:40.980\n and they're just not good at using them so they become\n\n2:15:40.980 --> 2:15:47.300\n mean uh but when you do with with grace it can tear down an\n\n2:15:47.300 --> 2:15:51.220\n argument and at the same time have like love and\n\n2:15:51.220 --> 2:15:54.820\n respect underneath it i mean it's a beautiful dance they have to be good at\n\n2:15:54.820 --> 2:15:59.060\n like you know people just can suck at communication and even\n\n2:15:59.060 --> 2:16:02.820\n uh like even a powerful weapon like a meme in the wrong hands\n\n2:16:02.820 --> 2:16:09.460\n just uh fires in a way that doesn't get anything done but this is like a war\n\n2:16:09.460 --> 2:16:13.620\n of humor and memes it's kind of fascinating exactly like you formulated\n\n2:16:13.620 --> 2:16:16.740\n that there's a symmetry of power so you have to\n\n2:16:16.740 --> 2:16:22.740\n have guerrilla warfare in this internet game especially when there's no leader\n\n2:16:22.740 --> 2:16:26.900\n like you said in a distributed culture i would say here that is um\n\n2:16:26.900 --> 2:16:31.300\n is really important i think is from a society standpoint\n\n2:16:31.300 --> 2:16:37.540\n we've become very soft and very kind of coddling and not in um\n\n2:16:37.540 --> 2:16:40.660\n not in a way that's like i think people take this argument like too far\n\n2:16:40.660 --> 2:16:45.380\n sometimes but what i mean by that is um it's almost like if you're the person\n\n2:16:45.380 --> 2:16:49.060\n who holds somebody accountable you become the bad person right if you're\n\n2:16:49.060 --> 2:16:53.380\n the person who um says hey you know that's wrong you're\n\n2:16:53.380 --> 2:16:57.620\n the bad person right and so in a world where i think in um\n\n2:16:57.620 --> 2:17:02.180\n this kind of influencery you know all positive if you have any negative\n\n2:17:02.180 --> 2:17:06.020\n you know feedback or constructive criticism like you're the bad person\n\n2:17:06.020 --> 2:17:11.780\n uh it's the ultimate echo chamber right and so i think that what the bitcoin\n\n2:17:11.780 --> 2:17:15.860\n world does in in some crazy crazy way to look\n\n2:17:15.860 --> 2:17:20.180\n at it is bitcoin is ultimately about truth\n\n2:17:20.180 --> 2:17:26.420\n not about narrative not about feelings or emotion it's math yeah\n\n2:17:26.420 --> 2:17:30.340\n you look at a blockchain and you can prove something\n\n2:17:30.340 --> 2:17:34.500\n or you can't and so naturally people who are attracted to that\n\n2:17:34.500 --> 2:17:37.860\n have a very similar approach in life yeah right they say hey\n\n2:17:37.860 --> 2:17:41.060\n you made x claim prove it and as you can imagine\n\n2:17:41.060 --> 2:17:45.700\n you know a great example is like the financial media meets bitcoiners\n\n2:17:45.700 --> 2:17:50.900\n and it's a bloodbath right in kind of the the arena of ideas because\n\n2:17:50.900 --> 2:17:54.020\n what do they do the financial media is used to the soft\n\n2:17:54.020 --> 2:17:57.700\n you know opinion pieces etc and bitcoiners show up and they're like\n\n2:17:57.700 --> 2:18:01.300\n uh here's data point a b and c here's example one two and three\n\n2:18:01.300 --> 2:18:05.060\n and you're wrong and then all they yell and scream about is like\n\n2:18:05.060 --> 2:18:08.420\n uh i'm wrong i'm wrong i'm wrong like you can't say i'm wrong and they're like\n\n2:18:08.420 --> 2:18:12.260\n nerd like disprove what i just said and so you get in this like very very weird\n\n2:18:12.260 --> 2:18:14.340\n it's fascinating it's a fascinating battlefield but\n\n2:18:14.340 --> 2:18:17.780\n i i do want to say it's i've been watching this\n\n2:18:17.780 --> 2:18:23.540\n it's kind of interesting i think that the pursuit of truth\n\n2:18:23.540 --> 2:18:29.460\n like tearing down bad ideas can be done with grace and to do it with\n\n2:18:29.460 --> 2:18:32.660\n grace requires a lot of skill like what people\n\n2:18:32.660 --> 2:18:38.900\n don't realize about disagreement they think that disagreement is easy\n\n2:18:38.900 --> 2:18:44.500\n like they they see the the the lies or the inaccuracies in the\n\n2:18:44.500 --> 2:18:47.220\n statement and and they just think they can say\n\n2:18:47.220 --> 2:18:51.860\n wrong uh yes you can say that but if you want\n\n2:18:51.860 --> 2:18:57.300\n to be effective it requires great skill like you look at\n\n2:18:57.300 --> 2:19:03.620\n i don't know um a beautiful uh verbal shit poster which is Christopher\n\n2:19:03.620 --> 2:19:08.020\n Hitchens right it requires a lot of skill\n\n2:19:08.020 --> 2:19:11.860\n through your words to tear down an argument\n\n2:19:11.860 --> 2:19:16.660\n to criticize and to take a step towards truth\n\n2:19:16.660 --> 2:19:20.900\n what i'm disheartened by internet culture like the negative side\n\n2:19:20.900 --> 2:19:25.140\n is people don't put a lot of effort in their tear downs\n\n2:19:25.140 --> 2:19:29.060\n like into your shit posting into your memes\n\n2:19:29.060 --> 2:19:34.820\n you should put effort and see it as a skill that you want to if you want to be\n\n2:19:34.820 --> 2:19:39.540\n a part of this culture you want to uh get good at it\n\n2:19:39.540 --> 2:19:45.860\n like any skill it's the 10 000 hours like get improve deliberate practice\n\n2:19:45.860 --> 2:19:50.580\n self criticism all of those things uh just because you're anonymous\n\n2:19:50.580 --> 2:19:55.060\n doesn't mean you won't get deep joy and actually have an impact on the world if\n\n2:19:55.060 --> 2:19:59.620\n you get good at shitposting but but i think this is really really\n\n2:19:59.620 --> 2:20:01.300\n important right because you're right in that\n\n2:20:01.300 --> 2:20:05.300\n uh it's all about intention versus action if your intention is to\n\n2:20:05.300 --> 2:20:09.220\n uh tell somebody that they are wrong in an effort to get them to\n\n2:20:09.220 --> 2:20:12.500\n see the truth yes that's very different than if your intention is to tell\n\n2:20:12.500 --> 2:20:14.420\n someone they're wrong and hurt their feelings yes\n\n2:20:14.420 --> 2:20:18.660\n right and so when you can unpack intention and action\n\n2:20:18.660 --> 2:20:22.100\n you really quickly can tell what somebody ultimately is trying to\n\n2:20:22.100 --> 2:20:25.620\n accomplish i also think that one of the craziest\n\n2:20:25.620 --> 2:20:30.180\n things that i've seen play out is uh memes when i use that term i'm not\n\n2:20:30.180 --> 2:20:32.900\n just talking about like a static photo right when i'm talking about these\n\n2:20:32.900 --> 2:20:35.940\n elaborate uh kind of edited videos and kind of\n\n2:20:35.940 --> 2:20:41.620\n all this stuff um when done right it is\n\n2:20:41.620 --> 2:20:47.620\n uh the most articulate way to deliver a blunt message and it's\n\n2:20:47.620 --> 2:20:51.300\n done in such a way that is humorous and entertaining\n\n2:20:51.300 --> 2:20:57.380\n yet really hammers the point home and so it's a skill set that many people don't\n\n2:20:57.380 --> 2:21:00.100\n have i don't make those i'm assuming you don't make them either\n\n2:21:00.100 --> 2:21:03.060\n right i see them i share the ones that i like right\n\n2:21:03.060 --> 2:21:06.420\n uh but it does take practice and you can tell\n\n2:21:06.420 --> 2:21:10.340\n look there's people who are fantastic meme lords right and there are\n\n2:21:10.340 --> 2:21:15.780\n people who absolutely suck at it and it's like anything it's just\n\n2:21:15.780 --> 2:21:20.340\n how good are you at communicating and uh i've heard the idea a bunch of times so\n\n2:21:20.340 --> 2:21:24.180\n i don't know who to kind of credit for it but uh whether it's emojis\n\n2:21:24.180 --> 2:21:29.140\n it's gifs it's memes whatever this is the extension and evolution of\n\n2:21:29.140 --> 2:21:33.460\n just hieroglyphics right yeah like like we have been doing\n\n2:21:33.460 --> 2:21:36.820\n this for literally centuries it's just that now we're doing it on\n\n2:21:36.820 --> 2:21:38.660\n the internet you can press a button and go to\n\n2:21:38.660 --> 2:21:43.140\n millions and millions of people immediately uh but speaking of memes\n\n2:21:43.140 --> 2:21:48.260\n what the heck do you think is up with elon musk talking about dogecoin a lot\n\n2:21:48.260 --> 2:21:51.780\n sort of uh from the cryptocurrency community i\n\n2:21:51.780 --> 2:21:56.100\n from i've been talking to a lot of sort of technologists i guess\n\n2:21:56.100 --> 2:21:59.380\n and reading papers on cryptocurrency it's like\n\n2:21:59.380 --> 2:22:04.100\n nobody really sees dogecoin as a revolutionary\n\n2:22:04.100 --> 2:22:07.940\n crypto technology a lot of people talk about it's security issues there's a\n\n2:22:07.940 --> 2:22:13.380\n bunch of issues it has nevertheless you did say that money is the\n\n2:22:13.380 --> 2:22:19.380\n kind of social construct right and uh elon musk's\n\n2:22:19.380 --> 2:22:24.020\n combination of humor and brilliant engineering in the various\n\n2:22:24.020 --> 2:22:29.140\n companies he runs combines to create a kind of value\n\n2:22:29.140 --> 2:22:32.660\n and excitement behind dogecoin it's like\n\n2:22:32.660 --> 2:22:38.980\n um what is it he says uh that the most amusing outcome is the most likely\n\n2:22:38.980 --> 2:22:44.580\n kind of idea which sounds silly but there could be like profound truth to it\n\n2:22:44.580 --> 2:22:50.340\n it's like what do you make of dogecoin philosophically or technically is is it\n\n2:22:50.340 --> 2:22:55.380\n possible that dogecoin will overtake bitcoin and run the\n\n2:22:55.380 --> 2:22:59.380\n run the entire world i can't even because it could happen\n\n2:22:59.380 --> 2:23:04.740\n it could happen but what uh if there's any serious way to answer that question\n\n2:23:04.740 --> 2:23:12.020\n well we have to start with uh techno king of tesla yeah and master of coin\n\n2:23:12.020 --> 2:23:15.860\n as they are so articulately called in the latest scc filing\n\n2:23:15.860 --> 2:23:19.460\n he officially changed his title techno king yes no king of tesla\n\n2:23:19.460 --> 2:23:24.020\n and the cfo's new uh title is a master of coin\n\n2:23:24.020 --> 2:23:32.100\n and so uh when you have a sense of humor yeah and frankly uh a level of uh\n\n2:23:32.100 --> 2:23:39.540\n self confidence and uh an element of uh an appreciation for irony in the world\n\n2:23:39.540 --> 2:23:44.340\n dogecoin is actually one of the least crazy things that you could talk about\n\n2:23:44.340 --> 2:23:48.180\n when you're willing to go to techno king of tesla master of coin\n\n2:23:48.180 --> 2:23:51.540\n uh and all this stuff and so i think that\n\n2:23:51.540 --> 2:23:55.540\n elon uh doesn't get enough credit frankly for his understanding of internet\n\n2:23:55.540 --> 2:23:58.900\n culture understanding of memes and understanding\n\n2:23:58.900 --> 2:24:02.660\n of frankly human psychology and marketing and so\n\n2:24:02.660 --> 2:24:06.740\n in some crazy way every time he talks about dogecoin\n\n2:24:06.740 --> 2:24:09.860\n it's a rallying cry for an entire generation of kids\n\n2:24:09.860 --> 2:24:13.700\n it's a rallying cry for an entire industry uh in terms of cryptocurrencies\n\n2:24:13.700 --> 2:24:19.060\n and digital technologies but this is the flag yeah\n\n2:24:19.060 --> 2:24:22.020\n and this is the thing that he can yell and scream about\n\n2:24:22.020 --> 2:24:26.020\n and tweet about without worry of punishment\n\n2:24:26.020 --> 2:24:29.620\n so he could be talking about bitcoin he could be talking about cryptocurrency\n\n2:24:29.620 --> 2:24:33.460\n but that's not going to be uh as beautifully\n\n2:24:33.460 --> 2:24:37.380\n humorous and whatever the hell internet culture is as dogecoin\n\n2:24:37.380 --> 2:24:40.980\n he's finding the right language he's speaking the language of the people\n\n2:24:40.980 --> 2:24:45.380\n of the of the in the digital age if you want to reach weird people\n\n2:24:45.380 --> 2:24:49.220\n yeah you can't be serious and most people are weird\n\n2:24:49.220 --> 2:24:52.740\n the masses are weird so he's speaking to the masses\n\n2:24:52.740 --> 2:24:56.420\n yeah and the techno king and even further than that i think is\n\n2:24:56.420 --> 2:25:04.100\n he essentially is um he's using dogecoin as a way to say\n\n2:25:04.100 --> 2:25:08.020\n i'm doing this because i can yeah he couldn't do it\n\n2:25:08.020 --> 2:25:13.300\n with securities he couldn't do it with certain types of other assets right\n\n2:25:13.300 --> 2:25:16.020\n like i almost look at it as like a venn diagram what's the thing that a bunch of\n\n2:25:16.020 --> 2:25:19.700\n people know about care about thinkers funny whatever and\n\n2:25:19.700 --> 2:25:21.700\n also overlay that with the things that like he\n\n2:25:21.700 --> 2:25:24.180\n could actually talk about they won't get in trouble for\n\n2:25:24.180 --> 2:25:27.380\n that's a big f you to the sec i could see the\n\n2:25:27.380 --> 2:25:30.660\n the people just freaking out i i mean i love it\n\n2:25:30.660 --> 2:25:34.580\n but um i i don't know if i would have the guts to do it myself\n\n2:25:34.580 --> 2:25:37.860\n but i i think he's an inspiration to a lot of us\n\n2:25:37.860 --> 2:25:40.900\n to be like well maybe you should grow the guts\n\n2:25:40.900 --> 2:25:45.220\n when you're the techno king you can do whatever you want right\n\n2:25:45.860 --> 2:25:49.700\n and i mean that's something to aspire to is to be the techno king in your own\n\n2:25:49.700 --> 2:25:52.500\n little world if you also think about it in the sense\n\n2:25:52.500 --> 2:25:58.100\n of uh when you're somebody on a mission to create interplanetary\n\n2:25:58.100 --> 2:26:05.300\n life yeah when you're trying to solve a or put a dent in the climate crisis\n\n2:26:05.300 --> 2:26:08.660\n or create electric vehicles and be the first american company and you know\n\n2:26:08.660 --> 2:26:13.380\n however long frankly the sec\n\n2:26:13.380 --> 2:26:16.740\n or other things in your life that just don't\n\n2:26:16.740 --> 2:26:20.660\n you don't ascribe that much importance to compared to those things\n\n2:26:20.660 --> 2:26:25.540\n they're almost uh nuisances and that's scary i think for shareholders\n\n2:26:25.540 --> 2:26:28.820\n of a company when the person that you're trusting to lead\n\n2:26:28.820 --> 2:26:31.620\n you to the promised land and create shareholder value\n\n2:26:31.620 --> 2:26:36.260\n doesn't put value on certain things but at the same time\n\n2:26:36.260 --> 2:26:40.820\n i always look at it as a tug of war how much of the actions of what he's doing\n\n2:26:40.820 --> 2:26:44.100\n and calling attention to actually change the way\n\n2:26:44.100 --> 2:26:50.660\n that regulators lawmakers politicians countries whatever act he may not be\n\n2:26:50.660 --> 2:26:55.300\n able to say do acts i'm the techno king and they go do it\n\n2:26:55.300 --> 2:27:01.700\n but with every step he makes he changes some of their behavior and so i\n\n2:27:01.700 --> 2:27:07.140\n think that it's um a really kind of game of like 3d chess\n\n2:27:07.140 --> 2:27:11.220\n that frankly i'm not privy to right i'm kind of watching from the sidelines and\n\n2:27:11.220 --> 2:27:17.060\n uh figuring out alongside everybody else but i also don't think that it's just\n\n2:27:17.060 --> 2:27:20.580\n elon uh bought a bunch of dogecoin and tweets about it because he thinks he's\n\n2:27:20.580 --> 2:27:23.380\n going to a dollar and he's gonna you know make money right like i don't think\n\n2:27:23.380 --> 2:27:26.340\n i don't think it's an economic argument as to why he's so\n\n2:27:26.340 --> 2:27:31.780\n interested in i think it's much more uh it's almost like meta message\n\n2:27:31.780 --> 2:27:35.060\n for a lot of other stuff yeah he's kind of\n\n2:27:35.060 --> 2:27:38.820\n trying to break apart internet communication from first principles like\n\n2:27:38.820 --> 2:27:42.100\n it does so many other problems it's kind of fascinating to watch i know he's been\n\n2:27:42.100 --> 2:27:45.540\n uh he's he's taught me quite a bit about communication\n\n2:27:45.540 --> 2:27:52.980\n and uh at least for me it's been liberating to not give a fuck\n\n2:27:52.980 --> 2:27:57.940\n about the old school way of things i've been always bothered by\n\n2:27:57.940 --> 2:28:01.540\n a place i deeply admire which is mit but there's\n\n2:28:01.540 --> 2:28:05.620\n problems the bureaucracies and hierarchies that hold back innovation\n\n2:28:05.620 --> 2:28:10.820\n brilliant minds and in that sense doge is a kind of fu to\n\n2:28:10.820 --> 2:28:15.060\n the system that's kind of positive but also\n\n2:28:15.060 --> 2:28:22.500\n uh kind of uh but it was also an fu so in that sense i think\n\n2:28:22.500 --> 2:28:26.180\n elon has a perspective on the world that's similar to bitcoin folks\n\n2:28:26.180 --> 2:28:30.100\n which i really like which is like thinking long term\n\n2:28:30.100 --> 2:28:35.460\n it's how visionaries think is like how will if i take these ideas\n\n2:28:35.460 --> 2:28:42.260\n what and the ideas hold true what will the world look like in 20 30\n\n2:28:42.260 --> 2:28:45.380\n 50 years and think about everything in that way\n\n2:28:45.380 --> 2:28:51.460\n yeah i like uh bezos's view which is uh is essentially how do you minimize\n\n2:28:51.460 --> 2:28:55.300\n regret how do you accelerate your life mentally\n\n2:28:55.300 --> 2:28:59.060\n and go to 80 90 100 150 years whatever we end up\n\n2:28:59.060 --> 2:29:02.420\n being you know fortunate enough to live to and then look backwards\n\n2:29:02.420 --> 2:29:06.340\n yes and say this decision that i'm going to make i have two\n\n2:29:06.340 --> 2:29:10.100\n options which one is going to be the one that i least regret\n\n2:29:10.100 --> 2:29:13.140\n and if you continue to make decisions that way\n\n2:29:13.140 --> 2:29:15.700\n one you have that long term view kind of built in because you're working\n\n2:29:15.700 --> 2:29:19.300\n backwards uh two you are ultimately going to optimize\n\n2:29:19.300 --> 2:29:23.620\n for uh minimal regret but also three is\n\n2:29:23.620 --> 2:29:27.620\n even if you only look forward 10 years that's much much further than most\n\n2:29:27.620 --> 2:29:29.300\n people do and so it gives you a significant\n\n2:29:29.300 --> 2:29:33.620\n advantage and i think that um bitcoin has kind of this like um\n\n2:29:33.620 --> 2:29:36.820\n you know proxy for time as we talked about uh\n\n2:29:36.820 --> 2:29:41.940\n interplant uh planetary travel where there's multiple steps from creating a\n\n2:29:41.940 --> 2:29:46.260\n reusable rocket to landing it to you know all this stuff all the way\n\n2:29:46.260 --> 2:29:49.860\n to simple things just like if you're simply trying to figure out\n\n2:29:49.860 --> 2:29:52.500\n where the world's going to be 30 years from now\n\n2:29:52.500 --> 2:29:56.020\n you know bill gates says that we overestimate what we can do in one year\n\n2:29:56.020 --> 2:30:02.580\n underestimate what we can do in 10 well to me it's a um kind of degree of\n\n2:30:02.580 --> 2:30:07.860\n uh mistake if you will 10 years maybe you're off by 10 percent\n\n2:30:07.860 --> 2:30:11.860\n well if that line of progress continues 20 years you may be off by\n\n2:30:11.860 --> 2:30:15.620\n 100 and 30 years you may be off by a thousand percent\n\n2:30:15.620 --> 2:30:20.500\n right like almost the further you go out the more inaccurate you become\n\n2:30:20.500 --> 2:30:26.100\n and so i think that people who want to iterate their way to success right\n\n2:30:26.100 --> 2:30:29.060\n that's a common thing in like the startup world\n\n2:30:29.060 --> 2:30:33.940\n end up actually following kind of the breadcrumbs to where the\n\n2:30:33.940 --> 2:30:38.100\n world is taking them but people like an elon musk a jeff\n\n2:30:38.100 --> 2:30:41.060\n bezos a jack dorsey all the way down the line all these\n\n2:30:41.060 --> 2:30:45.060\n innovators they actually say to themselves there is\n\n2:30:45.060 --> 2:30:48.820\n a point in time in the future where there's a world i want to\n\n2:30:48.820 --> 2:30:52.420\n construct and then they go and they construct it\n\n2:30:52.420 --> 2:30:56.260\n regardless of the short term iterations and incentives\n\n2:30:56.260 --> 2:30:59.220\n it is just they're driving towards that point and i think that it's this whole\n\n2:30:59.220 --> 2:31:03.780\n idea of having this like you know kind of set vision and this\n\n2:31:03.780 --> 2:31:07.700\n uh refusal to kind of move or budge off of that\n\n2:31:07.700 --> 2:31:11.300\n that's what makes them special one of the\n\n2:31:11.300 --> 2:31:14.260\n things that garnered a lot of excitement in the crypto\n\n2:31:14.260 --> 2:31:21.300\n community is nfts i i have no idea really the depths the\n\n2:31:21.300 --> 2:31:26.340\n fundamental technological philosophical depths of the second of this technology\n\n2:31:26.340 --> 2:31:30.180\n whether this is just like a little bit of a fad or there's some deep lessons to\n\n2:31:30.180 --> 2:31:33.460\n learn whether it's bitcoin or cryptocurrency in general about it\n\n2:31:33.460 --> 2:31:38.500\n do you have thoughts about like the long lasting fundamental aspects of nfts\n\n2:31:38.500 --> 2:31:41.940\n i think there's probably both things happening fad\n\n2:31:41.940 --> 2:31:47.220\n and things to learn right and um if we just start with like what is an\n\n2:31:47.220 --> 2:31:52.020\n nft it's a non fungible token meaning that um there's no fungibility\n\n2:31:52.020 --> 2:31:56.020\n and fungibility is a fancy word um i always describe it as\n\n2:31:56.020 --> 2:31:58.580\n if i took a hundred dollar bill and i put it on the table with a bunch of the\n\n2:31:58.580 --> 2:32:01.220\n hundred dollar bills and we mixed them up and i just grabbed a hundred dollar\n\n2:32:01.220 --> 2:32:04.420\n bill and left i'm no worse as long as they're all you\n\n2:32:04.420 --> 2:32:07.700\n know uh official hundred dollar bills because as long as i have a hundred\n\n2:32:07.700 --> 2:32:10.580\n dollars i have hundred dollars i don't need that exact same bill back\n\n2:32:10.580 --> 2:32:13.300\n so that means that those hundred dollar bills are fungible\n\n2:32:13.300 --> 2:32:17.540\n non fungible would be like art if i took a picasso and i put it down on the table\n\n2:32:17.540 --> 2:32:20.180\n and you brought three artists that no one's ever heard of before and we mixed\n\n2:32:20.180 --> 2:32:22.100\n them up and i just took any random piece of art\n\n2:32:22.100 --> 2:32:25.060\n it wasn't the picasso i lose because the picasso is really\n\n2:32:25.060 --> 2:32:28.500\n important there right so non fungibility is important in art\n\n2:32:28.500 --> 2:32:32.740\n what these non fungible tokens essentially are doing is they are uh\n\n2:32:32.740 --> 2:32:38.900\n creating scarcity and originality in a digital environment and what i mean by\n\n2:32:38.900 --> 2:32:42.980\n that is um take a music file if i had a music\n\n2:32:42.980 --> 2:32:45.140\n file and you wanted it you said send it to me\n\n2:32:45.140 --> 2:32:49.380\n i press send it essentially creates a copy and you get one music file i get\n\n2:32:49.380 --> 2:32:51.540\n another we don't care you can listen to music i\n\n2:32:51.540 --> 2:32:57.220\n can listen to music we're super happy if i instead though have a digital file\n\n2:32:57.220 --> 2:33:03.220\n that entire premise is based on scarcity and i hit send and you get a copy and i\n\n2:33:03.220 --> 2:33:05.620\n keep the original or you get the original i get a copy\n\n2:33:05.620 --> 2:33:11.700\n there's a problem and so ultimately what i think is playing out with nfts is\n\n2:33:11.700 --> 2:33:15.220\n it's a technology regardless of where it plays out from\n\n2:33:15.220 --> 2:33:19.620\n blockchains or uh what in communities or environments\n\n2:33:19.620 --> 2:33:25.940\n that just brings true digital scarcity to the internet and so naturally what\n\n2:33:25.940 --> 2:33:28.100\n people do they look at the legacy world and they\n\n2:33:28.100 --> 2:33:30.420\n say well what's scarce there that has value\n\n2:33:30.420 --> 2:33:33.780\n how do we bring that to the digital world so art is a perfect example right\n\n2:33:33.780 --> 2:33:36.260\n and you know frankly last year i started to\n\n2:33:36.260 --> 2:33:40.260\n look at this because it felt like this was going to be really really big\n\n2:33:40.260 --> 2:33:45.860\n and the conclusion i came to was just as bitcoin is going to be bigger\n\n2:33:45.860 --> 2:33:48.500\n than gold right the digital application of\n\n2:33:48.500 --> 2:33:50.900\n something is going to be bigger than the analog application\n\n2:33:50.900 --> 2:33:54.180\n the same thing's going to be true in art the digital art world is going to be\n\n2:33:54.180 --> 2:33:57.620\n bigger than the traditional art world people think that sounds crazy at first\n\n2:33:57.620 --> 2:34:01.540\n until you start to realize it's very very similar the art is more\n\n2:34:01.540 --> 2:34:04.660\n portable it can be divisible right it's got a\n\n2:34:04.660 --> 2:34:08.100\n larger demand market in terms of the internet rather than an auction right\n\n2:34:08.100 --> 2:34:12.100\n all this kind of stuff when you display it it can have motion\n\n2:34:12.100 --> 2:34:16.180\n and music and all of these aspects to it that are better than the traditional\n\n2:34:16.180 --> 2:34:18.740\n art what the traditional art market has that\n\n2:34:18.740 --> 2:34:23.780\n the digital art market has not had is the narrative narrative based world\n\n2:34:23.780 --> 2:34:30.100\n scarcity kind of in digital sense and so what i think the entire world is\n\n2:34:30.100 --> 2:34:33.380\n going through right now is an exploration of how do we use this\n\n2:34:33.380 --> 2:34:38.100\n technology to create new things frankly\n\n2:34:38.100 --> 2:34:40.420\n we're not going to be good at it for a while\n\n2:34:40.420 --> 2:34:43.700\n and so the only place i've really focused on is\n\n2:34:43.700 --> 2:34:50.100\n digital art itself and i've always been interested in art but i wasn't going to\n\n2:34:50.100 --> 2:34:52.100\n go buy a painting and hang it on the wall\n\n2:34:52.100 --> 2:34:55.700\n right in the sense of uh that's how i was going to store value\n\n2:34:55.700 --> 2:34:59.380\n what i find fascinating though is that i now can take\n\n2:34:59.380 --> 2:35:02.900\n that concept which most of the wealthiest people in the world\n\n2:35:02.900 --> 2:35:06.420\n have a significant portion some you know some people have 20 percent in terms of\n\n2:35:06.420 --> 2:35:10.660\n you know number of billionaires 20 percent of their wealth is in art\n\n2:35:10.660 --> 2:35:13.940\n and you can bring to this digital realm which is much more um\n\n2:35:13.940 --> 2:35:19.140\n kind of natural to a digital native and so the best way to describe the\n\n2:35:19.140 --> 2:35:22.820\n importance is imagine a serial number being placed on\n\n2:35:22.820 --> 2:35:26.100\n something take the eiffel tower the only eiffel\n\n2:35:26.100 --> 2:35:30.900\n tower that has value is the first one every replica of it regardless of size\n\n2:35:30.900 --> 2:35:33.780\n location you know who made it where they sent it\n\n2:35:33.780 --> 2:35:38.260\n they have no value eiffel tower 001 is the most important\n\n2:35:38.260 --> 2:35:41.220\n and so i think that's ultimately what we're starting to see here\n\n2:35:41.220 --> 2:35:45.380\n and what we're looking at is probably one percent of what it's going to grow\n\n2:35:45.380 --> 2:35:49.220\n into so you're you're bullish you're saying\n\n2:35:49.220 --> 2:35:52.580\n it could grow into something for one percent it could grow into something\n\n2:35:52.580 --> 2:35:55.220\n significant like all the kinds of different applications\n\n2:35:55.220 --> 2:35:58.420\n strip away all the applications right now and just think about\n\n2:35:58.420 --> 2:36:01.700\n is digital scarcity going to be important on the internet moving all the things\n\n2:36:01.700 --> 2:36:04.260\n that are scarce in the physical world into digital space\n\n2:36:04.260 --> 2:36:07.140\n us trying to figure out which things can be moved and not\n\n2:36:07.140 --> 2:36:10.340\n and also there's things in the digital space just like you're saying that\n\n2:36:10.340 --> 2:36:13.300\n don't exist in the physical world that might also\n\n2:36:13.300 --> 2:36:18.020\n benefit from gaining scarcity like you know people are i guess creating\n\n2:36:18.020 --> 2:36:21.700\n nfts out of like tweets or whatever so like you're you have you\n\n2:36:21.700 --> 2:36:24.980\n have a fun twitter account you know you could say like you\n\n2:36:24.980 --> 2:36:27.620\n could put value to a single tweet and then be\n\n2:36:27.620 --> 2:36:31.460\n able to invest in it and trade it and buy parts of it and all those kinds of\n\n2:36:31.460 --> 2:36:33.780\n things you know you can invest in people you\n\n2:36:33.780 --> 2:36:38.820\n can invest in you know art can be defined broadly as\n\n2:36:38.820 --> 2:36:42.340\n any kind of creation right and in some sense\n\n2:36:42.340 --> 2:36:47.860\n this whole idea of scarcity can overtake the entirety\n\n2:36:47.860 --> 2:36:52.820\n of the digital world it can like consume the\n\n2:36:52.820 --> 2:36:56.660\n all of the markets we see as financial markets and just turn\n\n2:36:56.660 --> 2:37:01.620\n everything into a market well so if i take you on like a i don't know\n\n2:37:01.620 --> 2:37:06.900\n 10 year fast forward yeah and i paint a picture of uh something today that seems\n\n2:37:06.900 --> 2:37:09.780\n absolutely insane but there's early signs that people are\n\n2:37:09.780 --> 2:37:12.580\n building this and let's just give them the benefit of the doubt that\n\n2:37:12.580 --> 2:37:16.980\n some of the early iterations will work and some of or most of them won't\n\n2:37:16.980 --> 2:37:21.860\n there's a world where you and i are participating in a digital economy\n\n2:37:21.860 --> 2:37:26.340\n in a virtual world where uh whether it is a piece of art\n\n2:37:26.340 --> 2:37:29.620\n it is a digital sculpture it is a digital\n\n2:37:29.620 --> 2:37:36.340\n skin from a video game it is a digital good that we purchased somewhere online\n\n2:37:36.340 --> 2:37:42.740\n and we bring it and we display it in a digital museum or a virtual museum\n\n2:37:42.740 --> 2:37:46.260\n and so now all of a sudden you can charge people for entry\n\n2:37:46.260 --> 2:37:50.420\n you can consign digital goods it's the replication of what happens in the\n\n2:37:50.420 --> 2:37:53.860\n analog world now just in digital and when you do that\n\n2:37:53.860 --> 2:37:58.020\n what you do is you take the addressable markets\n\n2:37:58.020 --> 2:38:01.860\n of these assets or these mechanisms and they explode\n\n2:38:01.860 --> 2:38:05.300\n in the digital realm and so now all of a sudden\n\n2:38:05.300 --> 2:38:10.500\n how fast does the human race accelerate when it comes to human\n\n2:38:10.500 --> 2:38:14.500\n production intelligence learning all in the digital\n\n2:38:14.500 --> 2:38:19.540\n output it's just if i said to you 20 years ago i'm going to give you a\n\n2:38:19.540 --> 2:38:22.900\n global education that means i'm going to take you and i'm\n\n2:38:22.900 --> 2:38:26.820\n going to physically move you to geography after geography after\n\n2:38:26.820 --> 2:38:29.060\n geography it's going to take time it's going to\n\n2:38:29.060 --> 2:38:32.820\n take resources and ultimately it's going to take lots of effort\n\n2:38:32.820 --> 2:38:36.020\n if i now said to you hey i'm going to transport you\n\n2:38:36.020 --> 2:38:40.260\n in this virtual world to multiple geographies\n\n2:38:40.260 --> 2:38:44.500\n but you're going to experience it in this virtual\n\n2:38:44.500 --> 2:38:47.780\n world and you're going to have digital goods that you can take\n\n2:38:47.780 --> 2:38:52.420\n from economy to economy or from location to location\n\n2:38:52.420 --> 2:38:55.540\n all of a sudden you may get maybe you get 90 of the value you don't get 100\n\n2:38:55.540 --> 2:38:58.980\n of the same value we get 90 of the value but you can\n\n2:38:58.980 --> 2:39:02.580\n do it at a much faster pace and so in the six month period\n\n2:39:02.580 --> 2:39:05.620\n you've actually made three times the progress\n\n2:39:05.620 --> 2:39:09.140\n than you would have if you had to do in the physical world so that's where i\n\n2:39:09.140 --> 2:39:13.460\n think we're heading so there's digital art being displayed\n\n2:39:13.460 --> 2:39:17.940\n in the digital museum and people are being charged for access\n\n2:39:17.940 --> 2:39:22.020\n and perhaps we plug in our senses which means we start to operate more and more\n\n2:39:22.020 --> 2:39:25.540\n in a virtual reality augmented reality virtual reality way\n\n2:39:25.540 --> 2:39:29.860\n with this digital world and increasingly going to this world\n\n2:39:29.860 --> 2:39:33.700\n basically lived most of our productive and uh\n\n2:39:33.700 --> 2:39:39.540\n social lives in this digital world uh and increasingly essentially create a\n\n2:39:39.540 --> 2:39:44.420\n simulation where the biological basis is just there\n\n2:39:44.420 --> 2:39:49.300\n to say sustain the brain that's used to operate in the in the virtual world\n\n2:39:49.300 --> 2:39:53.380\n uh taking us back to the original when we started talking about war\n\n2:39:53.380 --> 2:39:57.460\n i wonder what conflict looks like in that world\n\n2:39:57.460 --> 2:40:02.180\n that uh the people who are born today maybe will be fighting wars\n\n2:40:02.180 --> 2:40:07.700\n in the space in in that museum world in that digital world remember what i said\n\n2:40:07.700 --> 2:40:11.300\n we're moving from a world of conflict surrounded\n\n2:40:11.300 --> 2:40:14.820\n and determined by bombs bullets and soldiers\n\n2:40:14.820 --> 2:40:19.300\n to a battlefield that is determined by war of information\n\n2:40:19.300 --> 2:40:24.340\n and cyber capabilities and so in that virtual world\n\n2:40:24.340 --> 2:40:31.300\n is it about death and destruction of human life in the physical analog world\n\n2:40:31.300 --> 2:40:35.780\n or will it become more important to attack or defend\n\n2:40:35.780 --> 2:40:40.420\n virtual property and virtual life and you know some level of virtual\n\n2:40:40.420 --> 2:40:45.620\n sovereignty in my opinion the latter is more likely\n\n2:40:45.620 --> 2:40:48.980\n and so what you start to understand is well\n\n2:40:48.980 --> 2:40:55.220\n what do you truly value in your life is it the physical analog materialistic\n\n2:40:55.220 --> 2:41:00.340\n consumptive goods or is it virtual\n\n2:41:00.340 --> 2:41:05.540\n and in many cases something as simple as the ability to connect\n\n2:41:05.540 --> 2:41:10.420\n with somebody it's really important and so one of the most disruptive\n\n2:41:10.420 --> 2:41:15.060\n combative violent things that a country may do to another country in the future\n\n2:41:15.060 --> 2:41:18.180\n simply take down the internet\n\n2:41:18.580 --> 2:41:23.220\n and put people in isolation yeah i don't need to physically harm you if i can\n\n2:41:23.220 --> 2:41:27.620\n psychologically harm you i don't need to it's terrifying yeah i\n\n2:41:27.620 --> 2:41:32.580\n don't need to uh actually convince you\n\n2:41:32.580 --> 2:41:36.260\n through a monopoly on violence on physical violence\n\n2:41:36.260 --> 2:41:39.620\n what if i can psychologically change the way you see the world\n\n2:41:39.620 --> 2:41:42.900\n through misinformation through all sorts of\n\n2:41:42.900 --> 2:41:46.180\n nefarious activities and i think that you know the united states has been\n\n2:41:46.180 --> 2:41:49.780\n struggling with this idea over the last couple of years in the political arena\n\n2:41:49.780 --> 2:41:54.340\n but what happens when it starts to come to other aspects of our life\n\n2:41:54.340 --> 2:41:58.740\n and i think it's very likely it's almost obviously likely that we're moving into\n\n2:41:58.740 --> 2:42:01.620\n the digital world\n\n2:42:01.620 --> 2:42:05.300\n the one of the features of the digital world\n\n2:42:05.300 --> 2:42:11.220\n is that artificial intelligence systems can operate with much more power in a\n\n2:42:11.220 --> 2:42:16.180\n in a frictionless way in that world currently as we understand it it's hard\n\n2:42:16.180 --> 2:42:20.340\n it's hard to build robots that operate at scale and do like\n\n2:42:20.340 --> 2:42:24.340\n arbitrary large amount of impact damage or positive\n\n2:42:24.340 --> 2:42:28.740\n in the physical world it's much easier to do in the digital world\n\n2:42:28.740 --> 2:42:31.780\n do you have do you ever think about ai systems\n\n2:42:31.780 --> 2:42:38.420\n just swimming about uh doing extraordinarily powerful destructive\n\n2:42:38.420 --> 2:42:42.340\n things in the digital world is that something of a concern to you\n\n2:42:42.340 --> 2:42:46.020\n or is this something into a very distant future\n\n2:42:46.020 --> 2:42:49.460\n i think a lot of artificial intelligence is\n\n2:42:49.460 --> 2:42:54.660\n uh in the name it's simply the replication of human intelligence\n\n2:42:54.660 --> 2:43:00.820\n at scale automated and program uh programmatic meaning\n\n2:43:00.820 --> 2:43:04.660\n that in the analog world you could go hire a\n\n2:43:04.660 --> 2:43:07.700\n thousand employees or in you know an amazon case hire\n\n2:43:07.700 --> 2:43:12.420\n millions of employees and set a mission or a goal and push\n\n2:43:12.420 --> 2:43:16.740\n them to go do that that requires recruiting retention\n\n2:43:16.740 --> 2:43:22.580\n training resources all that stuff in the virtual world or in this digital\n\n2:43:22.580 --> 2:43:26.180\n economy what if you can just program the resources\n\n2:43:26.180 --> 2:43:30.500\n and gain the same leverage and do it at scale and do it in a very\n\n2:43:30.500 --> 2:43:35.540\n programmatic way and then have them actually make decisions\n\n2:43:35.540 --> 2:43:39.860\n in a way that doesn't require you to have thought of every single\n\n2:43:39.860 --> 2:43:43.780\n potential scenario or edge case that's ultimately what we're talking about when\n\n2:43:43.780 --> 2:43:45.780\n we talk about artificial intelligence right\n\n2:43:45.780 --> 2:43:49.620\n and so when you look at that when technology is created\n\n2:43:49.620 --> 2:43:53.460\n everyone uses it for good or bad but both get used\n\n2:43:53.460 --> 2:43:57.300\n right and so whether we're talking about cell phones beepers the internet\n\n2:43:57.300 --> 2:44:01.700\n uh guns whatever it's always used for good and bad\n\n2:44:01.700 --> 2:44:05.060\n the big question is and i think that you know yourself and many other people have\n\n2:44:05.060 --> 2:44:10.020\n rightfully said this is the question really becomes\n\n2:44:10.020 --> 2:44:16.740\n is the negative and nefarious uses of this inadvertent potentially\n\n2:44:16.740 --> 2:44:20.260\n or does it actually come from a malicious person it's the intention\n\n2:44:20.260 --> 2:44:22.980\n malicious and to me that's what i i don't know\n\n2:44:22.980 --> 2:44:25.620\n enough you know much more about this and there's plenty of other people who do as\n\n2:44:25.620 --> 2:44:29.860\n well but i do think that there will be\n\n2:44:29.860 --> 2:44:34.180\n nefarious actors and malicious people but we're going to treat them the same\n\n2:44:34.180 --> 2:44:38.260\n way we've always treated people who use technology poorly right we're going to\n\n2:44:38.260 --> 2:44:40.740\n understand it we're going to identify it we're going to control it and then we're\n\n2:44:40.740 --> 2:44:44.420\n going to end up reversing it or preventing that from doing them it's the\n\n2:44:44.420 --> 2:44:47.620\n inadvertent things that i think are actually the most dangerous\n\n2:44:47.620 --> 2:44:51.700\n because when you have something that can think for itself\n\n2:44:51.700 --> 2:44:56.020\n and there is no way to leverage a monopoly on violence\n\n2:44:56.020 --> 2:45:02.020\n for control it's a very scary thing and it can i mean the the thing that's\n\n2:45:02.020 --> 2:45:06.260\n scary to me is this it can scale arbitrarily so it can outnumber humans\n\n2:45:06.260 --> 2:45:12.420\n very quickly even if it's dumber than humans and so\n\n2:45:12.420 --> 2:45:16.820\n i don't know if we're able to reason about a world\n\n2:45:16.820 --> 2:45:21.460\n like let's look at the physical analog where all of a sudden\n\n2:45:21.460 --> 2:45:26.020\n uh let's talk about something kind of like humans but dumber than humans like\n\n2:45:26.020 --> 2:45:30.020\n chimps okay imagine that all of a sudden chimps\n\n2:45:30.020 --> 2:45:35.140\n could multiply arbitrarily quickly and you could have\n\n2:45:35.140 --> 2:45:39.300\n like a trillion chimps the next day when you\n\n2:45:39.300 --> 2:45:42.500\n when you only had maybe a million the day before\n\n2:45:42.500 --> 2:45:46.980\n like how does that world look different where the fuck all these chimps come\n\n2:45:46.980 --> 2:45:50.100\n from and they like and then we can we can\n\n2:45:50.100 --> 2:45:54.660\n pretend to be like well let's hope the chimps like don't get violent because\n\n2:45:54.660 --> 2:45:59.380\n they don't seem to get violent when the resources aren't constrained\n\n2:45:59.380 --> 2:46:02.340\n but like we don't know and the problem is\n\n2:46:02.340 --> 2:46:07.060\n it all starts by building that first chip multiplier\n\n2:46:07.060 --> 2:46:10.660\n device and everyone's like okay yeah there's a lot of good applications you\n\n2:46:10.660 --> 2:46:14.580\n want you know uh you can make all kinds of\n\n2:46:14.580 --> 2:46:19.060\n arguments for why you have more chimps maybe they can help you out around the\n\n2:46:19.060 --> 2:46:23.540\n house or something like that in the physical space uh but\n\n2:46:23.540 --> 2:46:27.220\n ultimately it's the unintended consequences that you're referring to is\n\n2:46:27.220 --> 2:46:31.460\n you don't know what's going to happen i'm really worried about\n\n2:46:31.460 --> 2:46:38.740\n dumb ai agents uh like having impact when they're multiplied\n\n2:46:38.740 --> 2:46:44.660\n to a million to a billion and are allowed to operate in the digital space\n\n2:46:44.660 --> 2:46:48.100\n especially as we clearly are moving more and more\n\n2:46:48.100 --> 2:46:54.020\n of our lives into the digital space so it's kind of terrifying because we you\n\n2:46:54.020 --> 2:46:57.860\n know a lot of people are terrified or like concerned about super\n\n2:46:57.860 --> 2:47:02.020\n intelligence systems i think i'm definitely much more\n\n2:47:02.020 --> 2:47:06.180\n concerned about super dumb systems at scale that\n\n2:47:06.180 --> 2:47:09.860\n that's terrifying i always think about um the inadvertent\n\n2:47:09.860 --> 2:47:12.340\n but as you were talking what it made me think of is\n\n2:47:12.340 --> 2:47:16.580\n also the irreversible irreversible that's right so it's one thing if there's\n\n2:47:16.580 --> 2:47:20.500\n your inadvertent negative impact but we have\n\n2:47:20.500 --> 2:47:24.980\n reversibility built into a system and we can fix our mistakes yeah i think\n\n2:47:24.980 --> 2:47:28.820\n the really scary part is when you overlay inadvertent mistakes with the\n\n2:47:28.820 --> 2:47:34.020\n irreversible aspect of it and therefore humans have no control\n\n2:47:34.020 --> 2:47:38.180\n yeah if you if you have the trillion chimps you can't\n\n2:47:38.180 --> 2:47:43.140\n they're not gonna like it when you try to start killing them off\n\n2:47:44.020 --> 2:47:51.460\n uh all right but back to bitcoin those chimps in the bitcoin community\n\n2:47:51.460 --> 2:47:55.540\n anytime you bring up chimps some people say joe rogan entered the chat\n\n2:47:55.540 --> 2:48:00.180\n can i ask you about sort of learning about bitcoin books and resources you\n\n2:48:00.180 --> 2:48:04.100\n have an amazing podcast that's not just about\n\n2:48:04.100 --> 2:48:08.100\n bitcoin or cryptocurrency it's about everything including life but you do\n\n2:48:08.100 --> 2:48:12.420\n have a lot of really amazing conversations about this whole\n\n2:48:12.420 --> 2:48:17.300\n digital world but you obviously you also have a newsletter\n\n2:48:17.300 --> 2:48:23.780\n that's incredible on substack and and um\n\n2:48:23.780 --> 2:48:27.380\n but do you have recommendations maybe it would be great if you could talk about\n\n2:48:27.380 --> 2:48:31.860\n first of all your podcast and the newsletter but also other\n\n2:48:31.860 --> 2:48:35.220\n resources that you recommend people should check out in order to learn\n\n2:48:35.220 --> 2:48:40.820\n about bitcoin yeah so the podcast and uh email are like the two most selfish\n\n2:48:40.820 --> 2:48:43.620\n things i do because the podcast is a way for me to\n\n2:48:43.620 --> 2:48:46.740\n learn from other people so i get them to come on and tell me all\n\n2:48:46.740 --> 2:48:49.380\n the things they're thinking about and i could ask some questions what's it\n\n2:48:49.380 --> 2:48:52.100\n called by the way uh just the pomp podcast\n\n2:48:52.100 --> 2:48:57.940\n and so in doing that um it really is informative for me and i think that my\n\n2:48:57.940 --> 2:49:00.900\n whole goal is just like if i'm learning other people will be learning\n\n2:49:00.900 --> 2:49:05.220\n and then the email uh i read it every morning because it forces me to\n\n2:49:05.220 --> 2:49:08.420\n collect my thoughts and actually articulate them in somewhat of a\n\n2:49:08.420 --> 2:49:12.180\n coherent way and so it's just something that um is\n\n2:49:12.180 --> 2:49:14.740\n like a practice that i probably would do even if no one read it\n\n2:49:14.740 --> 2:49:19.380\n and then by being able to publish it uh what does it do it elicits you know\n\n2:49:19.380 --> 2:49:22.100\n both the good and bad responses and so people will let me know if they think\n\n2:49:22.100 --> 2:49:24.740\n i'm an idiot and they'll usually not respond if they think that\n\n2:49:24.740 --> 2:49:29.140\n it's something smart and so um those two things are really um\n\n2:49:29.140 --> 2:49:32.740\n educational for me and i think kind of forced me to uh to be able to\n\n2:49:32.740 --> 2:49:36.580\n articulate a lot of ideas but a lot of what i share or learn on\n\n2:49:36.580 --> 2:49:38.660\n those things come from these other resources\n\n2:49:38.660 --> 2:49:41.780\n so i'm definitely subscribing people should subscribe but\n\n2:49:41.780 --> 2:49:45.860\n what are bitcoin resources books that you recommend\n\n2:49:45.860 --> 2:49:49.460\n i think you got to start with bitcoin standard uh that one to me feels like\n\n2:49:49.460 --> 2:49:52.740\n uh it really lays out the picture nicely um\n\n2:49:52.740 --> 2:49:56.340\n there is uh bitcoin uh money you can't fuck with\n\n2:49:56.340 --> 2:49:59.700\n i was written by our friend jason williams uh as you can imagine it's\n\n2:49:59.700 --> 2:50:03.140\n basically what it talks about uh there's another book layered money\n\n2:50:03.140 --> 2:50:06.820\n um it's written by nick who uh who's done a great uh great job\n\n2:50:06.820 --> 2:50:10.900\n kind of laying it out um there's a book uh called bitcoin in black america\n\n2:50:10.900 --> 2:50:14.980\n written by a guy isaiah jackson and he basically lays out the argument for\n\n2:50:14.980 --> 2:50:18.820\n why the black community um can benefit in a\n\n2:50:18.820 --> 2:50:22.260\n asymmetric way from something like bitcoin um and there's a whole bunch\n\n2:50:22.260 --> 2:50:25.700\n more i'm gonna forget them all um there's the uh i think it's called the\n\n2:50:25.700 --> 2:50:30.260\n cost of tomorrow a guy jeff booth uh jeff booth wrote it\n\n2:50:30.260 --> 2:50:33.220\n um and just if you get on twitter basically you're gonna see all these\n\n2:50:33.220 --> 2:50:38.260\n books flying around um but i do have to say that uh from a\n\n2:50:38.260 --> 2:50:41.860\n psychological concept uh or philosophical\n\n2:50:41.860 --> 2:50:45.860\n concept the number one book that i've ever read uh that aligns with bitcoin\n\n2:50:45.860 --> 2:50:47.780\n ethos but doesn't say a word about bitcoin\n\n2:50:47.780 --> 2:50:51.220\n is a book called the dow of capital by mark spitznagel\n\n2:50:51.220 --> 2:50:55.220\n and so what he essentially does is he just reiterates over and over and over\n\n2:50:55.220 --> 2:50:59.300\n again long term thinking outliers disruption\n\n2:50:59.300 --> 2:51:02.340\n all the stuff and so he's a guy who he runs a fund\n\n2:51:02.340 --> 2:51:05.940\n uh that essentially they just do uh tail risk hedging\n\n2:51:05.940 --> 2:51:09.700\n and so in you know march or february of 2020\n\n2:51:09.700 --> 2:51:13.220\n they're up like four thousand percent right\n\n2:51:13.220 --> 2:51:16.260\n by the way they pretty much lose money you know\n\n2:51:16.260 --> 2:51:18.980\n for eight nine years then that happens and so\n\n2:51:18.980 --> 2:51:22.660\n uh but they're still one of the best performing funds if you look at it over\n\n2:51:22.660 --> 2:51:25.700\n you know years and years and so it's just this mindset of\n\n2:51:25.700 --> 2:51:29.380\n uh everyone is so short term focused and so i think it's just a great reminder\n\n2:51:29.380 --> 2:51:34.420\n to long term thinking uh and also i mean i've gotten quite a\n\n2:51:34.420 --> 2:51:37.220\n bit of value just reading the papers and that's perhaps more\n\n2:51:37.220 --> 2:51:40.980\n like for technical folks there's quite an active research community\n\n2:51:40.980 --> 2:51:44.260\n and also going back to the original white paper and just\n\n2:51:44.260 --> 2:51:48.100\n original documents old school old school is still\n\n2:51:48.100 --> 2:51:52.100\n what uh like what a few years ago still really interesting\n\n2:51:52.100 --> 2:51:56.900\n to think about to look at what people were thinking about\n\n2:51:56.900 --> 2:52:00.500\n because the the principles are carried through\n\n2:52:00.500 --> 2:52:04.020\n with uh other cryptocurrencies as well like it's it's all\n\n2:52:04.020 --> 2:52:07.300\n it's all there even in the early documents so\n\n2:52:07.300 --> 2:52:10.660\n that's kind of fascinating to see that whole history from if you're more\n\n2:52:10.660 --> 2:52:14.420\n like tech savvy and like you said twitter is actually an interesting place\n\n2:52:14.420 --> 2:52:17.940\n if you can look past all the shit coin talk\n\n2:52:17.940 --> 2:52:21.620\n it's a it's a fascinating place for news and resources\n\n2:52:21.620 --> 2:52:24.980\n is there books outside of all this cryptocurrency sort of\n\n2:52:24.980 --> 2:52:29.060\n technical fiction philosophical that impact on your life\n\n2:52:29.060 --> 2:52:32.420\n because you've you have interests that are all over the place is there\n\n2:52:32.420 --> 2:52:36.500\n something that um you would recommend to others so\n\n2:52:36.500 --> 2:52:39.060\n doubt capital is definitely probably my favorite book\n\n2:52:39.060 --> 2:52:43.940\n um books that have been impactful i read uh when i was 20 actually sitting in the\n\n2:52:43.940 --> 2:52:47.540\n desert of iraq um rich dad poor dad thinking grow rich\n\n2:52:47.540 --> 2:52:51.940\n and the richest man in babble on and i don't think i took a single thing\n\n2:52:51.940 --> 2:52:54.260\n and like implemented it from like an execution\n\n2:52:54.260 --> 2:52:59.060\n standpoint uh but it was a complete shift in mentality\n\n2:52:59.060 --> 2:53:02.340\n and understanding a relationship with money and um\n\n2:53:02.340 --> 2:53:05.140\n just kind of what i wanted to do with my life and stuff like that so i think\n\n2:53:05.140 --> 2:53:07.300\n those three books i read them in succession\n\n2:53:07.300 --> 2:53:11.060\n were really impactful um and then i think one of the best books probably\n\n2:53:11.060 --> 2:53:14.340\n ever written is uh i think it's called uh when breath becomes air\n\n2:53:14.340 --> 2:53:18.340\n um or air becomes breath i can't remember uh but it's basically a\n\n2:53:18.340 --> 2:53:21.460\n doctor or a medical professional who's dying\n\n2:53:21.460 --> 2:53:26.020\n and he essentially writes about the experience and thoughts and kind of all\n\n2:53:26.020 --> 2:53:29.620\n the stuff and i think that it's just uh one of these\n\n2:53:29.620 --> 2:53:32.660\n things where if you said to me you know what's the number one thing i took out\n\n2:53:32.660 --> 2:53:37.220\n of my experience in iraq that's a book like that also gives you is\n\n2:53:37.220 --> 2:53:40.100\n we're all gonna die right and you and i can want to be as\n\n2:53:40.100 --> 2:53:42.660\n immortal as we want but at some point we're gonna die\n\n2:53:42.660 --> 2:53:45.860\n and so it really does kind of focus you on\n\n2:53:45.860 --> 2:53:49.540\n time being that scarce asset and use it for\n\n2:53:49.540 --> 2:53:53.300\n enjoyment and happiness uh more so than anything else and i think that's part of\n\n2:53:53.300 --> 2:53:58.020\n your message and it's a great one do you think do you like literally\n\n2:53:58.020 --> 2:54:02.660\n meditate on your own mortality i necessarily think i uh meditate on it\n\n2:54:02.660 --> 2:54:06.420\n as much as um are you afraid of death were you afraid of\n\n2:54:06.420 --> 2:54:09.380\n death when you're in iraq i mean if you're coming face to face with it\n\n2:54:09.380 --> 2:54:12.740\n are you afraid of death today no i i think that it was just one of these\n\n2:54:12.740 --> 2:54:16.820\n things where like if you fixate on something and you\n\n2:54:16.820 --> 2:54:21.700\n worry about it then at least to me like you become\n\n2:54:21.700 --> 2:54:28.020\n uneasy about it and so after an experience like going to war\n\n2:54:28.020 --> 2:54:32.180\n i think that everything is just so not important compared to that\n\n2:54:32.180 --> 2:54:35.620\n right like when i came back i remember uh going back into\n\n2:54:35.620 --> 2:54:39.300\n the college environment and like things people worried about i was like\n\n2:54:39.300 --> 2:54:43.860\n listen let me explain to you you know what the real world is like right\n\n2:54:43.860 --> 2:54:47.300\n but i think even today right if you talk to people who know me really well\n\n2:54:47.300 --> 2:54:50.660\n i don't get worked up about a lot of stuff i don't get you know in either\n\n2:54:50.660 --> 2:54:53.780\n direction good or bad uh anything because ultimately it just\n\n2:54:53.780 --> 2:54:58.100\n comes down to if that's the final result\n\n2:54:58.100 --> 2:55:01.380\n let's enjoy it it's fascinating to ask you\n\n2:55:01.380 --> 2:55:08.180\n because this reformulation of money essentially buying time\n\n2:55:08.180 --> 2:55:16.100\n and uh you know there's the old question of does money buy happiness\n\n2:55:16.100 --> 2:55:22.580\n do you think money can buy happiness in the context of money being able to buy\n\n2:55:22.580 --> 2:55:26.500\n time or is happiness something else that is\n\n2:55:26.500 --> 2:55:30.900\n beyond all of this when people talk about this question i\n\n2:55:30.900 --> 2:55:36.100\n think that they really focus on money as a means to getting materialistic\n\n2:55:36.100 --> 2:55:40.420\n things so they want a big house they want a boat they want a fast car they\n\n2:55:40.420 --> 2:55:44.020\n want you know whatever they think that's the stuff that will\n\n2:55:44.020 --> 2:55:48.100\n make them happy what i think about it is if you have\n\n2:55:48.100 --> 2:55:51.620\n resources you can have time and if you have time and\n\n2:55:51.620 --> 2:55:54.980\n you spend it the way that you want to spend it then that's ultimately\n\n2:55:54.980 --> 2:55:57.620\n happiness so i always say to people if you think that money doesn't\n\n2:55:57.620 --> 2:56:01.220\n buy you happiness what if i told you that if you had more money you could\n\n2:56:01.220 --> 2:56:06.180\n spend more time with your family it reframes it yeah and now is all\n\n2:56:06.180 --> 2:56:09.460\n about i want to do certain things in life but\n\n2:56:09.460 --> 2:56:11.620\n there's a lot of people who spend their life\n\n2:56:11.620 --> 2:56:16.580\n not doing those things because they feel the need to pursue economic\n\n2:56:16.580 --> 2:56:20.900\n means as a way to provide a living or\n\n2:56:20.900 --> 2:56:24.900\n whatever and so i explain this listen in my opinion again it's my opinion it's\n\n2:56:24.900 --> 2:56:29.220\n what makes me happy if i can leverage financial resources to\n\n2:56:29.220 --> 2:56:34.180\n create more time to do the things i like i'm happier\n\n2:56:34.180 --> 2:56:37.140\n might not work for everybody but like that's what works for me and so there's\n\n2:56:37.140 --> 2:56:39.780\n this element of like i don't care what other people think if\n\n2:56:39.780 --> 2:56:43.540\n they like that or not because they're not me right like there's\n\n2:56:43.540 --> 2:56:46.020\n almost this element of like you gotta figure out what works for you and if it\n\n2:56:46.020 --> 2:56:50.260\n works for me then like no i think that resonate that that will\n\n2:56:50.260 --> 2:56:53.620\n resonate with a lot of people i think that's a brilliant reframing of it\n\n2:56:53.620 --> 2:56:57.700\n uh that said uh you kind of imply there's a\n\n2:56:57.700 --> 2:57:01.860\n there's a reason behind this whole existence of ours there's a meaning to it\n\n2:57:01.860 --> 2:57:04.980\n so let me ask what is the meaning of life\n\n2:57:04.980 --> 2:57:09.300\n anthony do you think about these ridiculous big questions\n\n2:57:09.300 --> 2:57:12.740\n that have no answer every once in a while or do you just enjoy the shit out\n\n2:57:12.740 --> 2:57:17.380\n of every day i answer it in a way that um isn't meant\n\n2:57:17.380 --> 2:57:22.420\n to be accurate it's meant to um\n\n2:57:22.420 --> 2:57:26.580\n be the right answer for me which is ultimately you know and i talk to a lot\n\n2:57:26.580 --> 2:57:29.620\n of people who always ask like what's the what are you doing why are you doing this\n\n2:57:29.620 --> 2:57:34.180\n i say it's to be happy and the reason why i think of it that\n\n2:57:34.180 --> 2:57:37.700\n way is i've got a friend jonathan galler who talks about uh\n\n2:57:37.700 --> 2:57:41.540\n you know enough being enough and recently he talked about it in the\n\n2:57:41.540 --> 2:57:45.300\n um context of bitcoin and so bitcoiners are have two things any\n\n2:57:45.300 --> 2:57:47.700\n bitcoiner if you talk to them they believe the same two things one\n\n2:57:47.700 --> 2:57:50.580\n they don't want the us dollar price to go up because they actually want to\n\n2:57:50.580 --> 2:57:53.540\n acquire more bitcoin right and then let it go once they feel like they've got\n\n2:57:53.540 --> 2:57:56.580\n enough but two is no matter how much they own they think that they don't own\n\n2:57:56.580 --> 2:58:02.660\n enough and they want to acquire more and so at some point you say to yourself\n\n2:58:02.660 --> 2:58:06.660\n what is enough and and i think that the whole meaning of life\n\n2:58:06.660 --> 2:58:12.500\n is to understand kind of what your level of satisfaction is and for\n\n2:58:12.500 --> 2:58:15.860\n some people that's a monetary thing some people that's a freedom of time thing\n\n2:58:15.860 --> 2:58:18.820\n for some people it's an impact thing whatever but just\n\n2:58:18.820 --> 2:58:22.420\n understanding that's important and then going and accomplishing it\n\n2:58:22.420 --> 2:58:26.500\n and what i've found is that the people who i know who have done this and been\n\n2:58:26.500 --> 2:58:29.300\n intentional about it they accomplish it on a much shorter\n\n2:58:29.300 --> 2:58:31.940\n timeline than people who don't right there's some people who start thinking\n\n2:58:31.940 --> 2:58:34.980\n about this when they're 60 naturally you're not going to accomplish\n\n2:58:34.980 --> 2:58:37.540\n before you're 60 if you just start thinking about it 60\n\n2:58:37.540 --> 2:58:40.260\n people who are thinking about it earlier can do it and so i think that's really\n\n2:58:40.260 --> 2:58:43.140\n it for me it's just like the meaning of life is to enjoy it\n\n2:58:43.140 --> 2:58:46.660\n the way i think about it that's because it's a really nice formulation i i\n\n2:58:46.660 --> 2:58:49.140\n almost like to sort of oscillate back and forth so\n\n2:58:49.140 --> 2:58:54.100\n majority of the time is spent at the moment of enough is enough\n\n2:58:54.100 --> 2:58:59.060\n of gratitude of basically being content with where you're at like deeply\n\n2:58:59.060 --> 2:59:03.380\n appreciative of every moment and all the bitcoin whatever bitcoin you\n\n2:59:03.380 --> 2:59:07.460\n have being deeply appreciative of it and that being enough and then some\n\n2:59:07.460 --> 2:59:10.980\n fraction of time perhaps it shrinks as you get older that's\n\n2:59:10.980 --> 2:59:13.460\n maybe there's an optimal trajectory there but\n\n2:59:13.460 --> 2:59:18.020\n some fraction of time is spent being yeah like deeply self critical\n\n2:59:18.020 --> 2:59:22.180\n and nothing is enough nothing you've ever done is worth anything it's the\n\n2:59:22.180 --> 2:59:25.540\n marvin minsky said like the secret to success\n\n2:59:25.540 --> 2:59:29.940\n is hating everything you've ever done so like that mode of just hating\n\n2:59:29.940 --> 2:59:33.620\n everything you've ever done and just like trying to improve trying to make\n\n2:59:33.620 --> 2:59:37.380\n stuff better nothing is enough it's never enough that\n\n2:59:37.380 --> 2:59:39.860\n kind of stuff and then oscillating back and forth like\n\n2:59:39.860 --> 2:59:42.820\n you don't have to have the same algorithm operating throughout the day\n\n2:59:42.820 --> 2:59:44.980\n you could just like oscillate back and forth\n\n2:59:44.980 --> 2:59:50.020\n and maybe reserve that gratitude part the chill part to when you're hanging\n\n2:59:50.020 --> 2:59:52.180\n out with family and friends and loved ones\n\n2:59:52.180 --> 2:59:55.540\n and then when you're like alone or maybe at work\n\n2:59:55.540 --> 2:59:59.620\n that's the madman comes out kind of thing i also think it's um\n\n2:59:59.620 --> 3:00:03.620\n kind of purpose driven in the sense of there's a lot of people who have the\n\n3:00:03.620 --> 3:00:08.340\n uh i need to do more but in a somewhat altruistic way\n\n3:00:08.340 --> 3:00:11.780\n so they're you know take elon as an example\n\n3:00:11.780 --> 3:00:18.180\n the idea of colonizing mars sure if he is successful he will be very\n\n3:00:18.180 --> 3:00:20.420\n rich i don't think you or i or many people\n\n3:00:20.420 --> 3:00:23.300\n believe he's doing it for the money right there's a lot of other things he\n\n3:00:23.300 --> 3:00:26.820\n could do that would be much easier that would make him tons of money\n\n3:00:26.820 --> 3:00:33.700\n and so in some weird way he has enough because he's able to free himself from\n\n3:00:33.700 --> 3:00:37.620\n the constraints of i need to acquire more resources\n\n3:00:37.620 --> 3:00:40.420\n and he can focus on what is the thing that i want to work on regardless of\n\n3:00:40.420 --> 3:00:44.660\n money and so in that pursuit that is\n\n3:00:44.660 --> 3:00:47.780\n non economic you can be as selfish as you want\n\n3:00:47.780 --> 3:00:50.980\n because ultimately you're not tied back to\n\n3:00:50.980 --> 3:00:54.260\n this like measurement tool and so it's this\n\n3:00:54.260 --> 3:00:59.540\n uh again like altruistic non monetary purpose and i think that there's a lot\n\n3:00:59.540 --> 3:01:01.380\n of people who spend their whole life looking for that and they don't know\n\n3:01:01.380 --> 3:01:05.620\n what it is and so again some people may not think\n\n3:01:05.620 --> 3:01:09.060\n of it that way but if you can find something to do that\n\n3:01:09.060 --> 3:01:13.620\n you win i don't think there's a better way to end it anthony i'm a huge fan\n\n3:01:13.620 --> 3:01:16.740\n it's a huge honor that you waste all this time with me today\n\n3:01:16.740 --> 3:01:21.300\n uh you know i thank you for just educating the world for\n\n3:01:21.300 --> 3:01:24.980\n for teaching me uh inspire me to learn more about this new\n\n3:01:24.980 --> 3:01:29.220\n set of technologies that look like they have a potential to change\n\n3:01:29.220 --> 3:01:33.300\n transform all of human civilization so thank you for coming today and thank you\n\n3:01:33.300 --> 3:01:36.900\n for being who you are absolutely thank you so much for having me\n\n3:01:36.900 --> 3:01:40.340\n thanks for listening to this conversation with anthony pampliano\n\n3:01:40.340 --> 3:01:44.420\n and thank you to our sponsors theragun muscle recovery device\n\n3:01:44.420 --> 3:01:48.260\n sun basket meal delivery service express vpn\n\n3:01:48.260 --> 3:01:51.780\n and indeed hiring website click their links\n\n3:01:51.780 --> 3:01:55.860\n to support this podcast and now let me leave you some words\n\n3:01:55.860 --> 3:01:59.780\n from mahatma gandhi freedom is not worth having\n\n3:01:59.780 --> 3:02:04.260\n if it doesn't include the freedom to make mistakes\n\n3:02:04.260 --> 3:02:19.060\n thank you for listening and hope to see you next time\n\n"
}