{
  "title": "Diana Walsh Pasulka: Aliens, Technology, Religion & the Nature of Belief | Lex Fridman Podcast #149",
  "id": "iqBh7G4uDR8",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:12.640\n The following is a conversation with Diana Walsh Basolka, a professor of philosophy and religion at UNCW and author of American Cosmic, UFOs, Religion and Technology.\n\n00:12.640 --> 00:21.760\n This book is one of the most fascinating explorations of the interconnected nature of technology, belief and the mystery of alien intelligence.\n\n00:21.760 --> 00:30.480\n Quick mention of our sponsors, Element Electrolyte Drink, Grammarly Writing Plugin, Business Wars Podcast and Cash App.\n\n00:30.480 --> 00:36.960\n So the choice is health, grammar, knowledge or money. Choose wisely, my friends.\n\n00:36.960 --> 00:42.160\n And if you wish, click the sponsor links below to get a discount and to support this podcast.\n\n00:42.160 --> 01:01.840\n As a side note, let me say, as I did in the recent video on how many intelligent alien civilizations are out there, that the nature of alien life, intelligence and how they might communicate with us humans is likely stranger than we imagine, and perhaps stranger than we can imagine.\n\n01:01.840 --> 01:14.800\n What is most fascinating to me is how the belief in the communication with such civilizations changes people's understanding of the world and, as Diana argues, the technology we create.\n\n01:14.800 --> 01:30.160\n Technological innovation itself seems to manifest the mythology in our collective intelligence that turns the seemingly impossible into reality in just a matter of years through the belief of individual humans that carry out that innovation.\n\n01:30.160 --> 01:47.840\n The nature and power of this belief, in both technology and extraterrestrial intelligence, is mysterious and fascinating, perhaps holding the key to us humans understanding our own mind, our consciousness, and engineering versions of it in the machines we create.\n\n01:47.840 --> 01:58.080\n If you enjoy this thing, subscribe on YouTube, review it on Apple Podcast, follow on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n01:58.080 --> 02:03.520\n And now, here's my conversation with Diana Walsh Pasalka.\n\n02:03.520 --> 02:08.080\n You are a scholar of religious belief, or belief in general.\n\n02:08.080 --> 02:16.240\n So, the fascinating question, what do you think is the difference between our beliefs and objective reality?\n\n02:16.240 --> 02:17.600\n What is real, period?\n\n02:17.600 --> 02:19.840\n Sure, what is real?\n\n02:19.840 --> 02:22.000\n Easy question.\n\n02:22.000 --> 02:23.920\n So first, let me start with belief.\n\n02:23.920 --> 02:32.880\n So, belief is generally, there are different definitions of belief, just as there are different definitions of what is real, okay?\n\n02:32.880 --> 02:40.720\n So, for belief in my field, it would be attitudes toward something that dictate our actions, okay?\n\n02:40.720 --> 02:46.400\n So, we believe the sun is going to rise tomorrow, therefore we act as if it will rise tomorrow, all right?\n\n02:46.400 --> 02:47.920\n Beliefs can be wrong.\n\n02:47.920 --> 02:54.400\n For a long time, people believed, and actually some still do, that the earth was flat, okay?\n\n02:54.400 --> 02:57.040\n Well, that's obviously an erroneous belief.\n\n02:57.040 --> 03:00.160\n So, beliefs can be wrong.\n\n03:00.160 --> 03:08.880\n Now, the bigger question that philosophers ask is, is this belief accurate toward what we consider to be objective reality?\n\n03:08.880 --> 03:10.800\n So, now let me go to objective reality.\n\n03:10.800 --> 03:12.160\n So, what is real?\n\n03:12.160 --> 03:18.560\n I don't think we can actually obtain a correct understanding of what is real.\n\n03:18.560 --> 03:23.360\n And in that sense, I have to refer to a philosopher again, and that would be Immanuel Kant.\n\n03:23.360 --> 03:32.400\n So, Immanuel Kant is one of the, he was basically in the 1750s, he wrote critiques of reason and things like that.\n\n03:32.400 --> 03:38.480\n So, he said, well, if you're a philosopher or have any kind of understanding of Western history, you know who he is.\n\n03:38.480 --> 03:43.840\n He had this idea that we can actually never get to the thing in itself, okay?\n\n03:43.840 --> 03:46.720\n So, and he called that the numeral, the thing in itself.\n\n03:46.720 --> 03:51.120\n He said, let's take this table, for instance, that you and I are talking across.\n\n03:51.120 --> 03:52.800\n So, this thing is a table.\n\n03:52.800 --> 03:54.080\n You and I both know that.\n\n03:54.080 --> 03:55.520\n We assume it's real.\n\n03:55.520 --> 04:00.320\n We believe in it because we put our water on it and our water stays on it, okay?\n\n04:00.320 --> 04:05.520\n However, can we know this thing in and of itself as a table?\n\n04:05.520 --> 04:10.320\n So, that would be what he then would call the phenomenal.\n\n04:10.320 --> 04:15.680\n How do we know that that phenomena exists as we know it is, okay?\n\n04:15.680 --> 04:16.640\n How do we know?\n\n04:16.640 --> 04:17.520\n We use our faculties.\n\n04:17.520 --> 04:19.440\n So, we use our senses and things like that.\n\n04:19.440 --> 04:22.080\n But again, even our senses can be wrong.\n\n04:22.080 --> 04:31.440\n So, I've been on committees just recently this year, last year, for hiring professors in my department who are philosophers.\n\n04:31.440 --> 04:37.120\n And we're hiring metaphysicians and people who are thinking about the nature of reality.\n\n04:37.120 --> 04:40.640\n And basically, what I've learned from them, yeah, they're very good.\n\n04:40.640 --> 04:45.040\n I'd love to attend those faculty talks of metaphysics professors.\n\n04:45.040 --> 04:49.120\n What's funny is that for each one of them, I'm convinced each time.\n\n04:49.120 --> 04:51.440\n They all say different things, but they're so convincing.\n\n04:51.440 --> 04:53.760\n I'm like, yes, hire that one, right?\n\n04:53.760 --> 04:56.080\n Is it like historical philosophy, like a particular talk?\n\n04:56.080 --> 04:56.560\n No, no.\n\n04:56.560 --> 04:59.600\n Or do they have an actual belief?\n\n04:59.600 --> 05:01.680\n They're practicing metaphysicians.\n\n05:01.680 --> 05:03.280\n Metaphysicians, yes.\n\n05:03.280 --> 05:11.120\n So, what they do is they come and they're usually excellent philosophers from Harvard or USC or whatever.\n\n05:11.120 --> 05:13.520\n They come and they give what's called a job talk.\n\n05:13.520 --> 05:18.160\n That's what every academic does a job talk in order to get it.\n\n05:18.160 --> 05:21.760\n They talk to us about a department about what they do.\n\n05:21.760 --> 05:27.600\n And so, it so happens that we need a metaphysician and now we're hiring again for one.\n\n05:27.600 --> 05:31.520\n And so, I've learned a lot about metaphysics in the last year.\n\n05:31.520 --> 05:37.600\n And this is what I've learned that they use physics as a basis for understanding\n\n05:37.600 --> 05:39.760\n what we can know about what is real.\n\n05:39.760 --> 05:42.880\n And what is real is really difficult to pin down.\n\n05:42.880 --> 05:45.760\n And so, your question is, what is belief?\n\n05:45.760 --> 05:48.480\n Well, belief, does it correspond to reality?\n\n05:48.480 --> 05:50.160\n That's the question I would ask.\n\n05:50.160 --> 05:52.800\n And first, we don't even know what is real.\n\n05:52.800 --> 05:55.760\n So, the table, they would say, how do we know that the table even exists?\n\n05:55.760 --> 05:59.200\n Well, how do we differentiate it from the floor, for example?\n\n05:59.200 --> 06:01.600\n So, these are the questions that philosophers are asking.\n\n06:01.600 --> 06:02.960\n No one else is, of course.\n\n06:02.960 --> 06:06.320\n But philosophers are asking these questions and they have different answers for it.\n\n06:06.320 --> 06:10.160\n So, I would say that it's very difficult to know what is real.\n\n06:10.160 --> 06:17.760\n And in fact, what I do usually is I paraphrase my friend and colleague, Brother Guy Consolmagno.\n\n06:17.760 --> 06:23.280\n He's a Jesuit priest who's also an astronomer and he's the director of the Vatican Observatory.\n\n06:23.280 --> 06:25.520\n And so, he says this, he's a very smart person.\n\n06:25.520 --> 06:29.200\n He says, well, truth is a moving target.\n\n06:30.320 --> 06:36.720\n So, basically, to know what is real out there, like gravity or something like that,\n\n06:36.720 --> 06:38.720\n you've got to approximate it.\n\n06:38.720 --> 06:45.600\n And as human beings, we have senses to tell us what, at least so we don't get hurt.\n\n06:45.600 --> 06:48.400\n We're not going to fall off a building or something like that.\n\n06:48.400 --> 06:50.160\n We have eyes to see and things like that.\n\n06:50.160 --> 06:54.000\n So, we can approximate what reality is, but we're never going to get to it\n\n06:54.000 --> 06:58.480\n unless we develop better senses, okay?\n\n06:58.480 --> 07:01.360\n And I think that that is what we are in the process of doing.\n\n07:01.360 --> 07:03.200\n We're developing better senses.\n\n07:03.200 --> 07:07.520\n We have telescopes, we have microscopes, we have extensions of ourselves,\n\n07:07.520 --> 07:09.360\n which are now called technology.\n\n07:09.360 --> 07:15.760\n And we can get to a better understanding of what reality is and what the objective world is.\n\n07:15.760 --> 07:18.160\n And therefore, our beliefs can be honed.\n\n07:18.160 --> 07:20.480\n So, we can get better beliefs, more accurate beliefs.\n\n07:20.480 --> 07:24.880\n But can we get beliefs that actually correspond to reality?\n\n07:24.880 --> 07:28.560\n Not in any precise way, but in approximate ways.\n\n07:28.560 --> 07:31.840\n So, I hope that's not like too big an answer to your question.\n\n07:31.840 --> 07:35.200\n Well, do you think beliefs are in themselves can become reality?\n\n07:35.200 --> 07:41.760\n I mean, so you've now adapted the, in this little bit of a conversation,\n\n07:41.760 --> 07:45.680\n adapted the metaphysician view of reality, which is the physics.\n\n07:45.680 --> 07:46.080\n Yes.\n\n07:46.080 --> 07:50.800\n But, you know, we humans kind of operate in the space of ideas very much so.\n\n07:51.600 --> 07:54.720\n Like we've kind of in the collective intelligence of human beings,\n\n07:54.720 --> 07:59.680\n have come up with a set of ideas that persist in the minds of these many people.\n\n07:59.680 --> 08:02.080\n And they become quite strong and powerful.\n\n08:02.080 --> 08:04.800\n Like in terms of like impact on our lives,\n\n08:05.360 --> 08:11.840\n they can have sometimes more impact than this table does than the physics.\n\n08:11.840 --> 08:12.960\n Yeah, I agree.\n\n08:12.960 --> 08:19.760\n And in that sense, is there some sense in which our beliefs are reality,\n\n08:19.760 --> 08:22.160\n even if they're not connected to the physics?\n\n08:22.160 --> 08:23.600\n Yes, even if they're not real.\n\n08:23.600 --> 08:25.120\n Yeah, even if, okay.\n\n08:25.120 --> 08:26.560\n So, yes, absolutely.\n\n08:26.560 --> 08:33.520\n So, our beliefs are tremendously, they create social effects, absolutely.\n\n08:34.800 --> 08:38.480\n There was a belief that, I'm going to use this example.\n\n08:38.480 --> 08:40.960\n There was a belief back in the day, and we're talking about,\n\n08:40.960 --> 08:44.720\n when I say back in the day, I'm a historian, so I'm talking about like 1000 years ago,\n\n08:44.720 --> 08:45.200\n right?\n\n08:45.200 --> 08:47.040\n That women had no souls, okay?\n\n08:47.040 --> 08:49.920\n So, look, I don't know if human beings have souls.\n\n08:49.920 --> 08:54.160\n I can tell you this, though, that if human beings have souls, probably animals do too.\n\n08:54.160 --> 08:55.280\n That's my own personal belief.\n\n08:55.280 --> 08:57.280\n That's not a professor belief there.\n\n08:58.080 --> 09:04.240\n But there was this belief among the Catholic magisterium, which runs Europe,\n\n09:04.240 --> 09:05.280\n that women had no souls.\n\n09:05.280 --> 09:08.640\n So, they had to have this big meeting about it, you know, did women have souls?\n\n09:08.640 --> 09:13.120\n But that belief had consequences for women.\n\n09:13.120 --> 09:17.760\n I mean, women were treated and have been treated as if they didn't have souls.\n\n09:18.560 --> 09:19.280\n Okay, so there's...\n\n09:19.280 --> 09:21.920\n And the soul was really the essence of the human being.\n\n09:21.920 --> 09:22.320\n It was.\n\n09:22.320 --> 09:24.240\n It's called the animus, right?\n\n09:24.240 --> 09:29.920\n It's what is the essence of what is eternal, you know, when women weren't eternal.\n\n09:29.920 --> 09:31.360\n Here's another example, okay?\n\n09:31.360 --> 09:33.760\n This is an example from my own research.\n\n09:33.760 --> 09:34.160\n All right.\n\n09:34.160 --> 09:40.320\n So, in the Catholic tradition, there's this idea of purgatory, hell, and heaven.\n\n09:40.320 --> 09:45.040\n And these are three destinations that people can go to when they die.\n\n09:45.040 --> 09:49.440\n And if you're great, you go to heaven automatically and you're considered a saint.\n\n09:49.440 --> 09:52.400\n If you're okay, you go to purgatory, right?\n\n09:52.400 --> 09:55.440\n And you suffer for a time and then get back into heaven.\n\n09:55.440 --> 09:57.360\n If you're terrible, you go to hell, right?\n\n09:57.360 --> 09:58.000\n Okay.\n\n09:58.000 --> 10:04.640\n Well, there was a place that the Catholics determined, and this was a belief for a long time,\n\n10:04.640 --> 10:09.360\n like a thousand years or more, and it was called limbo, all right?\n\n10:09.360 --> 10:13.120\n And limbo comes from the Latin limbus, and it means edge.\n\n10:13.120 --> 10:16.400\n And it was either on the edge of hell or on the edge of heaven.\n\n10:16.400 --> 10:18.320\n No one really could determine which it was.\n\n10:18.320 --> 10:22.000\n No historians are like, well, this person says it was on the edge of heaven.\n\n10:22.000 --> 10:24.400\n Well, listen, this was a terrible...\n\n10:24.400 --> 10:26.080\n First of all, there is no limbo anymore.\n\n10:26.080 --> 10:32.880\n In 2007, Benedict, the then Pope, got rid of the idea that there was limbo, okay?\n\n10:32.880 --> 10:35.840\n So Catholics kind of went crazy because they didn't really know.\n\n10:35.840 --> 10:38.880\n They forgot that limbo existed and they thought it was purgatory.\n\n10:38.880 --> 10:40.880\n And they said, how could you get rid of purgatory?\n\n10:40.880 --> 10:43.040\n But actually, he just got rid of this idea of limbo.\n\n10:43.040 --> 10:45.200\n Oh, so that's a distinct thing from purgatory.\n\n10:45.200 --> 10:45.840\n It was.\n\n10:45.840 --> 10:50.000\n And by the way, people should know they have a book on purgatory that came before...\n\n10:50.000 --> 10:50.880\n American Cosmic.\n\n10:50.880 --> 10:52.800\n Yes, I wrote a book on purgatory, yeah.\n\n10:52.800 --> 10:55.600\n Anyway, so limbo is a distinct thing from purgatory?\n\n10:55.600 --> 10:56.000\n Yeah.\n\n10:56.000 --> 11:04.160\n And the types of people who go to limbo happen to be virtuous pagans, okay?\n\n11:04.160 --> 11:05.920\n Like Socrates or somebody like that.\n\n11:07.520 --> 11:09.760\n And children who weren't baptized.\n\n11:09.760 --> 11:11.280\n So think of this.\n\n11:11.280 --> 11:18.160\n Think of for like more than a thousand years, mothers and fathers gave birth to babies who\n\n11:18.160 --> 11:23.200\n weren't baptized and couldn't be buried with their family in these burial...\n\n11:23.200 --> 11:26.240\n And then they couldn't be reunited with them in heaven.\n\n11:26.240 --> 11:28.640\n Think of the pain and suffering that that caused.\n\n11:28.640 --> 11:29.760\n And that was nothing.\n\n11:30.480 --> 11:32.000\n Limbo's nothing.\n\n11:32.000 --> 11:35.360\n Yet the belief in it caused untold suffering.\n\n11:35.360 --> 11:37.040\n And that's just a small example.\n\n11:37.040 --> 11:39.120\n And that was as real to them?\n\n11:39.120 --> 11:40.640\n It was absolutely real.\n\n11:40.640 --> 11:42.640\n I mean, the effects were real, let's put it that way.\n\n11:42.640 --> 11:44.640\n The place itself, not real.\n\n11:44.640 --> 11:47.600\n But the families themselves, do you think they really believed it?\n\n11:47.600 --> 11:48.880\n They totally believed it.\n\n11:48.880 --> 11:50.640\n As much as the table is real?\n\n11:50.640 --> 11:51.120\n Yes.\n\n11:51.120 --> 11:54.880\n I've read, listen, we have trigger warnings today, right?\n\n11:54.880 --> 11:57.040\n So don't read this, it's gonna make you upset, okay?\n\n11:57.680 --> 12:01.360\n History, primary sources, no trigger warnings, okay?\n\n12:01.360 --> 12:07.920\n So you're going through like somebody's diary from 1400 and you hear the suffering and pain\n\n12:07.920 --> 12:08.880\n that they went through.\n\n12:08.880 --> 12:14.720\n There were times in my research where I'd have to put my primary source down and just\n\n12:14.720 --> 12:18.240\n basically go outside and take a walk because it was so horrific.\n\n12:18.240 --> 12:22.720\n I knew it was true because they wouldn't write something, they're not gonna write in their\n\n12:22.720 --> 12:24.800\n diary something that's not true and it was horrible.\n\n12:24.800 --> 12:30.800\n So yes, these people went through untold suffering for nothing because they had an erroneous belief.\n\n12:30.800 --> 12:32.480\n But they didn't know it was erroneous.\n\n12:32.480 --> 12:33.760\n So it was real to them?\n\n12:33.760 --> 12:34.260\n Yeah.\n\n12:34.960 --> 12:37.120\n So I don't know if you're familiar with Donald Hoffman.\n\n12:37.920 --> 12:46.320\n He has this idea that in terms of the distance we are from being able to know the reality,\n\n12:46.320 --> 12:51.120\n which is there, the physics reality, is we're actually really, really, really, really far\n\n12:51.120 --> 12:52.240\n away from that.\n\n12:52.240 --> 12:52.720\n Yeah.\n\n12:52.720 --> 12:59.440\n So like it's, I think his ideas that were basically like completely detached from it.\n\n13:00.000 --> 13:00.500\n Yes.\n\n13:01.040 --> 13:04.080\n What's your sense, how close are we to the reality?\n\n13:04.080 --> 13:13.040\n We'll talk about a bunch of ideas about our beliefs in technology and beyond, but in terms\n\n13:13.040 --> 13:18.240\n of what is actually real from a physical sense, how close are we to understanding that?\n\n13:18.240 --> 13:19.040\n Pretty far.\n\n13:19.040 --> 13:21.600\n I'm gonna use examples from what I do.\n\n13:21.600 --> 13:29.680\n Okay, so this idea that we're suspicious of what we actually think is real is not new.\n\n13:29.680 --> 13:33.520\n Of course, it goes back a long time, thousands of years, in fact.\n\n13:33.520 --> 13:39.360\n And philosophers, I'm not actually technically a philosopher, but I was one.\n\n13:39.360 --> 13:42.880\n I'm a professor of religious studies.\n\n13:42.880 --> 13:47.040\n Yeah, what do you introduce yourself at, like at a bar when the bartender asks, what do\n\n13:47.040 --> 13:47.760\n you do?\n\n13:47.760 --> 13:52.000\n I never tell people what I do, especially on airplanes.\n\n13:52.000 --> 13:52.880\n It's a bad idea.\n\n13:53.440 --> 13:58.160\n So generally if they push though, I say, I'm the chair of philosophy and religion, although\n\n13:58.160 --> 14:00.720\n I stepped down last year, so I'm no longer the chair.\n\n14:00.720 --> 14:06.720\n But I have like a master's degree in philosophy and I was a philosophy major and I still study\n\n14:06.720 --> 14:09.520\n philosophy, so I integrate it into my research.\n\n14:09.520 --> 14:16.160\n All right, so this idea that we can't know, we're suspicious of what we know, it's called\n\n14:16.160 --> 14:18.160\n external world skepticism.\n\n14:18.160 --> 14:20.480\n That's the official philosophical name for it.\n\n14:21.520 --> 14:27.520\n Our faculties and our senses don't give us accurate perceptions of what is there, okay,\n\n14:27.520 --> 14:30.880\n especially at a quantum level or a molecular level.\n\n14:30.880 --> 14:32.400\n I mean, that's just obvious.\n\n14:32.400 --> 14:36.480\n So yeah, so I think that the person you mentioned is correct in that.\n\n14:36.480 --> 14:37.760\n I think we're far away from it.\n\n14:37.760 --> 14:44.240\n I think you're talking about our direct senses, but you know, we have tools, measurement tools\n\n14:44.240 --> 14:51.280\n from microscopes to all the tools of astronomy, cosmology that gives us a sense of the big\n\n14:51.280 --> 14:53.360\n universe and also the sense of the very small.\n\n14:54.800 --> 15:01.840\n Do you think there's some other things that are completely sort of other dimensions or\n\n15:01.840 --> 15:09.520\n there's ideas of panpsychism, that consciousness permeates all matter, that there's like fundamental\n\n15:09.520 --> 15:13.040\n forces of physics we're not even aware of yet?\n\n15:13.040 --> 15:14.720\n Oh, absolutely.\n\n15:14.720 --> 15:21.520\n I do think, and this is why I write about technology and I mean, that's actually what\n\n15:21.520 --> 15:25.440\n I specialize in is belief in technology with respect to religion.\n\n15:25.440 --> 15:32.640\n So in my opinion, thank goodness for technology because where would we be without it?\n\n15:32.640 --> 15:39.760\n I mean, frankly, I think that it's like Marshall McLuhan was the person who said technology\n\n15:39.760 --> 15:44.240\n is like an extension of our senses and I absolutely believe that to be true.\n\n15:44.240 --> 15:51.680\n I think that we're lucky that Prometheus gave us technology, okay, and that we use it and\n\n15:51.680 --> 15:54.320\n we're making it better and better and better and better.\n\n15:54.320 --> 15:57.040\n And that makes us more efficient.\n\n15:57.040 --> 15:58.960\n It makes us more efficient as a species.\n\n16:00.240 --> 16:09.680\n And like my point is that I think that our instruments, I mean, I don't want to be a\n\n16:09.680 --> 16:16.320\n religious technologist, you know, but our instruments will save us.\n\n16:16.320 --> 16:18.960\n I mean, they're already making life better for us.\n\n16:18.960 --> 16:23.200\n You think it's important that they also help us understand reality more directly, more\n\n16:23.200 --> 16:24.000\n deeply?\n\n16:24.000 --> 16:26.400\n I think directly is better than deeply.\n\n16:26.400 --> 16:31.920\n I think directly, more directly is probably a more accurate term for what you're trying\n\n16:31.920 --> 16:35.920\n to, I think, ask me, you know, can we actually, I mean, I think you're asking me that question\n\n16:35.920 --> 16:40.480\n that Kant basically was trying to get at was can we know the thing in itself?\n\n16:40.480 --> 16:41.440\n Can we know that?\n\n16:41.440 --> 16:45.440\n Can we have like some kind of like intense knowing of it?\n\n16:45.440 --> 16:46.480\n It's almost mystical.\n\n16:47.200 --> 16:52.320\n And I would say that that's where religion comes in, okay?\n\n16:52.320 --> 16:54.080\n That's where we talk about religion.\n\n16:54.640 --> 16:58.080\n And if I may also go back to Immanuel Kant.\n\n16:58.080 --> 17:04.160\n This idea that he, just before he died, just as he died, he was working on, he did this\n\n17:04.160 --> 17:12.240\n critique of reason where basically he believed, he basically talks about can we know what's\n\n17:12.240 --> 17:12.480\n real?\n\n17:12.480 --> 17:15.840\n He basically has this long, you know, that question, can we know what's real?\n\n17:15.840 --> 17:19.360\n And then, you know, a thousand pages later, no.\n\n17:19.360 --> 17:22.080\n I'll just give you the rundown.\n\n17:22.080 --> 17:22.720\n Okay.\n\n17:22.720 --> 17:24.720\n So, okay, yeah, yeah, exactly.\n\n17:25.360 --> 17:29.600\n Then he does this other critique and okay, so he does like three critiques.\n\n17:29.600 --> 17:31.600\n Then he does this critique of judgment.\n\n17:31.600 --> 17:32.080\n Okay.\n\n17:32.080 --> 17:34.400\n Well, judgment is this other thing altogether.\n\n17:34.400 --> 17:36.240\n And I think that that's what you're getting at.\n\n17:36.240 --> 17:37.840\n So how do we know things?\n\n17:37.840 --> 17:41.280\n How can we know things really intensely and intimately?\n\n17:41.280 --> 17:48.400\n And I think that he thought that judgment was the idea that we can actually know the\n\n17:48.400 --> 17:49.040\n thing in itself.\n\n17:49.040 --> 17:52.560\n And he was working on that as he died and then he never finished it.\n\n17:52.560 --> 17:58.240\n Hannah Arendt, another philosopher of the 20th century, took it up, took up the critique\n\n17:58.240 --> 18:00.240\n of judgment and tried to finish it.\n\n18:01.360 --> 18:02.480\n Why the word judgment?\n\n18:03.280 --> 18:09.040\n Because judgment, think about it, when you see a work of art, who judges that to be decent?\n\n18:09.040 --> 18:09.360\n Okay.\n\n18:09.360 --> 18:17.520\n So there is a group of people who come to the decision that that's rotten or, you know,\n\n18:17.520 --> 18:18.640\n that's pretty good.\n\n18:18.640 --> 18:21.840\n You know, like, I noticed that you like to play guitar.\n\n18:21.840 --> 18:24.480\n Well, you choose music that I happen to like too.\n\n18:24.480 --> 18:24.960\n Okay.\n\n18:24.960 --> 18:27.600\n So you and I both have a sense of judgment.\n\n18:27.600 --> 18:28.320\n It's a sense.\n\n18:28.960 --> 18:31.280\n So he said, there's a sense that some people have.\n\n18:32.880 --> 18:36.160\n Why do certain communities have a similar sense?\n\n18:37.120 --> 18:38.160\n What dictates that?\n\n18:38.160 --> 18:39.280\n And so he was working on that.\n\n18:39.280 --> 18:43.440\n He thought it had something to do with the knowledge, the intimate knowledge of the thing\n\n18:43.440 --> 18:44.000\n in itself.\n\n18:44.000 --> 18:49.120\n Yeah, so another philosopher that philosophers actually don't like at all, but religious\n\n18:49.120 --> 18:51.680\n studies people do, is Martin Heidegger.\n\n18:51.680 --> 18:54.400\n So Martin Heidegger has some great essays.\n\n18:54.400 --> 18:56.240\n One is called What is a Work of Art?\n\n18:56.240 --> 19:00.320\n And again, he gets to, you know, he talks about Van Gogh and Van Gogh's shoes.\n\n19:00.320 --> 19:06.240\n You know, that picture, the painting Van Gogh's shoes, it's really a really intense picture.\n\n19:06.240 --> 19:07.840\n It's just shoes.\n\n19:07.840 --> 19:12.000\n It's, you know, it's an amazing painting of shoes.\n\n19:12.000 --> 19:16.880\n And I think everybody can agree that's a cool picture of shoes, right?\n\n19:16.880 --> 19:20.720\n And so why, you know, the question is, why is that a cool picture of shoes?\n\n19:20.720 --> 19:27.360\n You know, what kind of knowledge are we accessing to determine that indeed that works, right?\n\n19:27.360 --> 19:28.880\n And in fact, we still like it.\n\n19:28.880 --> 19:32.800\n So basically the nature of knowledge and what does it represent?\n\n19:32.800 --> 19:39.200\n It can operate in the space of, that's detached from reality or can it ultimately represent\n\n19:39.200 --> 19:39.920\n reality?\n\n19:39.920 --> 19:43.520\n I guess that's the, is that, that's the space of metaphysics?\n\n19:43.520 --> 19:44.560\n Is that the, is that the...\n\n19:44.560 --> 19:45.040\n Yeah.\n\n19:45.040 --> 19:47.600\n So what can we know is actually called epistemology.\n\n19:47.600 --> 19:48.160\n Epistemology.\n\n19:48.160 --> 19:53.200\n But metaphysics is, is basically what is the nature of reality.\n\n19:53.200 --> 19:53.760\n Right.\n\n19:53.760 --> 19:55.120\n And those intersect.\n\n19:55.120 --> 19:56.080\n Absolutely.\n\n19:56.080 --> 19:56.560\n Yeah.\n\n19:56.560 --> 19:58.160\n A lot of things intersect in philosophy.\n\n19:58.160 --> 20:00.400\n We just have fancy names for them.\n\n20:00.400 --> 20:07.280\n Another non philosopher that may be considered a philosopher, since we're talking about reality\n\n20:07.280 --> 20:10.960\n is Ayn Rand and her philosophy of objectivism.\n\n20:12.000 --> 20:19.520\n What are your thoughts on her sense of taking this idea of reality, calling her philosophy\n\n20:19.520 --> 20:28.320\n objectivism, and kind of starting at the idea that you really could know everything, and\n\n20:28.320 --> 20:34.880\n it's pretty obvious, and then from that, you can derive an ethics about how to live life,\n\n20:34.880 --> 20:40.400\n like what is the, what is the good ethical life and all the virtue of selfishness, all\n\n20:40.400 --> 20:40.960\n that kind of stuff.\n\n20:42.960 --> 20:44.880\n So you talked to a lot of academic philosophers.\n\n20:44.880 --> 20:53.360\n So I'd be curious to see from the perspective of like, is she somebody that's taken seriously\n\n20:53.360 --> 20:53.920\n at all?\n\n20:55.680 --> 21:02.640\n Why is she dismissed as I see from my distant perspective by serious philosophers, and also\n\n21:02.640 --> 21:07.280\n like your own personal thoughts of like, is there some interesting bits that you find\n\n21:07.280 --> 21:10.160\n inspiring in her work or not?\n\n21:10.160 --> 21:21.120\n Okay, so Ayn Rand, I've had so many exceedingly intelligent students basically give me her\n\n21:21.120 --> 21:25.920\n books, and basically say, please, Dr. Basilka, read this book.\n\n21:25.920 --> 21:29.680\n And I'll tell them, yes, thank you, I've read this book before.\n\n21:29.680 --> 21:35.360\n And then want to engage in, let me put it this way, they're religious about Ayn Rand.\n\n21:35.360 --> 21:42.480\n Okay, so to them, Ayn Rand represents some type of way of life, her objectivism.\n\n21:43.520 --> 21:47.920\n Now, why is she not taken seriously by philosophers in general?\n\n21:48.960 --> 21:56.000\n Well, let me put it this way, philosophers in general tend to get pretty, I guess you\n\n21:56.000 --> 22:01.040\n could call it, they're kind of scientists, but with words.\n\n22:01.040 --> 22:04.960\n I always call philosophy, when I describe it to someone who's going to take a philosophy\n\n22:04.960 --> 22:10.560\n class, I say, it's basically math problems, like word math problems, okay?\n\n22:10.560 --> 22:11.920\n So that's basically what it is.\n\n22:11.920 --> 22:14.880\n So they take words very seriously, and they're very formal.\n\n22:14.880 --> 22:16.640\n And definitions very seriously, yeah.\n\n22:16.640 --> 22:20.240\n So they all want to get on the same page, so there is no confusion.\n\n22:20.240 --> 22:25.040\n So for Ayn Rand to basically say, you can know everything, and you know, it's like,\n\n22:25.040 --> 22:30.880\n okay, and establish ethics from that, I think philosophers automatically say no.\n\n22:30.880 --> 22:32.480\n Now, that doesn't mean I say no.\n\n22:33.200 --> 22:38.560\n In fact, we have at my university a wonderful business school.\n\n22:38.560 --> 22:45.520\n And when you walk into the dean of the business school's office, Ayn Rand is everywhere.\n\n22:45.520 --> 22:51.040\n So I want to say that not all academics are anti Ayn Rand.\n\n22:51.040 --> 22:56.080\n And in fact, I don't think philosophers are either, except that they don't teach Ayn Rand,\n\n22:56.080 --> 22:56.560\n okay?\n\n22:56.560 --> 23:01.600\n So in one sense, you could say that because they don't teach her, they're being exclusive\n\n23:01.600 --> 23:05.760\n in what they teach, or very particular, perhaps, is another way to put it.\n\n23:06.480 --> 23:11.120\n Yeah, it's hard to know where to place people like her, because, you know, do you put\n\n23:11.120 --> 23:13.120\n Albert Camus as a philosopher?\n\n23:13.120 --> 23:15.040\n So I guess, what's the good term for that?\n\n23:15.040 --> 23:22.240\n Like literary philosophers, or whatever the term is, it's annoying to me that the academic\n\n23:22.240 --> 23:26.640\n philosophers get to own the word philosophy, because like, it's just like people who think\n\n23:26.640 --> 23:30.960\n deeply about life is what I think about as philosophy.\n\n23:30.960 --> 23:36.080\n And like, to me, it's like, all right, so I know Nietzsche is another person that's\n\n23:36.080 --> 23:42.080\n probably not respected in the philosophy circles, because he is, you know, full of contradictions,\n\n23:42.080 --> 23:42.800\n full of...\n\n23:42.800 --> 23:43.840\n I love Nietzsche.\n\n23:43.840 --> 23:47.280\n Nietzsche is my favorite philosopher.\n\n23:47.280 --> 23:47.840\n Oh, really?\n\n23:47.840 --> 23:49.440\n Yes, I absolutely love Nietzsche.\n\n23:49.440 --> 23:53.360\n So he's definitely, you know, I love people that are full of ideas, even if they're full\n\n23:53.360 --> 23:55.760\n of contradictions, and Nietzsche is certainly that.\n\n23:55.760 --> 23:58.000\n And Ayn Rand is also that.\n\n23:58.000 --> 24:06.320\n I'm able to look past the obvious ego that's there on the page, and the fact that she actually\n\n24:06.320 --> 24:08.960\n has, in my view, a lot of wrong ideas.\n\n24:08.960 --> 24:14.160\n But there's a lot of interesting tidbits to pick up, and the same goes with Nietzsche.\n\n24:14.160 --> 24:20.320\n And I'm weirded out by the religious aspect here, on both the people who like worship\n\n24:20.320 --> 24:23.440\n Ayn Rand, and people who completely dismiss her.\n\n24:23.440 --> 24:29.120\n I just kind of see it as, oh, can we just read a few interesting things and get inspired\n\n24:29.120 --> 24:30.960\n by it and move on, as opposed to...\n\n24:30.960 --> 24:31.440\n No.\n\n24:31.440 --> 24:33.360\n...have a diplomatic conversation.\n\n24:33.360 --> 24:36.800\n Is there something you find about her work that's interesting to you?\n\n24:36.800 --> 24:39.360\n Or her personality, or any of that?\n\n24:39.360 --> 24:40.880\n Oh, I think she's fascinating.\n\n24:41.600 --> 24:43.200\n I don't dismiss her.\n\n24:43.200 --> 24:50.880\n She was a woman who reached a level of success with her mind at a time when that was difficult.\n\n24:50.880 --> 24:56.320\n So, I mean, she's definitely worth looking at for even that reason.\n\n24:56.320 --> 25:04.640\n But also, her idea, I guess, part of the situation with Rand, first of all, I think that she\n\n25:04.640 --> 25:08.720\n her work is, you have to, it's misinterpreted, okay?\n\n25:08.720 --> 25:10.720\n And I think that's the same with Nietzsche.\n\n25:10.720 --> 25:18.160\n A lot of people think that, I mean, in fact, it is the case that Nietzsche's writing before\n\n25:18.160 --> 25:26.560\n the 20th century, so he's got the, he's somewhat, his rhetoric is sexist and racist and of the\n\n25:26.560 --> 25:27.680\n time period, right?\n\n25:27.680 --> 25:36.640\n He was a educated philosopher of that time period.\n\n25:36.640 --> 25:44.960\n However, his books are amazing, and Nietzsche's philosophy is incredible.\n\n25:44.960 --> 25:49.280\n And I think that's what you're saying about Rand, too.\n\n25:49.280 --> 25:49.840\n And I agree.\n\n25:49.840 --> 25:53.840\n I mean, I think that we get caught up.\n\n25:53.840 --> 25:59.760\n I mean, likely we should, and we should contextualize these thinkers in the time period within which\n\n25:59.760 --> 26:00.640\n they are.\n\n26:00.640 --> 26:04.640\n We should not forgive their, you know, because there were people during Nietzsche's time\n\n26:04.640 --> 26:09.840\n that were, you know, feminist and not racist and things like that.\n\n26:09.840 --> 26:15.440\n And, you know, so, but each has merit.\n\n26:15.440 --> 26:20.880\n I mean, I would say Nietzsche is, and you did ask me to talk about some of the books\n\n26:20.880 --> 26:25.200\n that made the largest impact on me, and Nietzsche's Gay Science is one of them.\n\n26:25.200 --> 26:28.720\n It's one of the best books ever, in my opinion.\n\n26:28.720 --> 26:33.840\n I do think Nietzsche was, I don't know about exactly sexist.\n\n26:33.840 --> 26:39.280\n He certainly was sexist, but it felt like he didn't get laid much in his life.\n\n26:40.000 --> 26:40.560\n No.\n\n26:40.560 --> 26:42.640\n It felt like he was extra sexist.\n\n26:43.360 --> 26:46.160\n I was like, his theories on women are like, all right.\n\n26:46.160 --> 26:47.360\n He's pretty angry.\n\n26:47.360 --> 26:48.880\n He seems frustrated.\n\n26:48.880 --> 26:49.380\n Yeah.\n\n26:49.380 --> 26:52.020\n He's like, all right, calm down, buddy.\n\n26:53.140 --> 26:54.500\n The fate of philosophers.\n\n26:55.540 --> 26:57.860\n I just ignore everything Nietzsche says about women.\n\n27:00.500 --> 27:03.940\n So can we talk about myth and religion a little bit?\n\n27:03.940 --> 27:04.440\n Yes.\n\n27:04.440 --> 27:09.860\n I mean, can we start at the beginning, which is like myths, how are they born?\n\n27:10.660 --> 27:15.060\n There's this collective intelligence amongst us human beings, and we seem to create these\n\n27:15.060 --> 27:19.460\n beautiful ideas that captivate the minds of millions.\n\n27:19.460 --> 27:21.460\n How is such a myth born?\n\n27:21.460 --> 27:22.580\n Great question.\n\n27:22.580 --> 27:23.060\n Okay.\n\n27:23.060 --> 27:25.300\n So that brings us to terminology again.\n\n27:25.940 --> 27:33.860\n And in my field, we definitely, I think, try not to distinguish between religion.\n\n27:33.860 --> 27:38.260\n I guess it's going to be controversial, I think, between religion and myth, because\n\n27:39.220 --> 27:43.940\n we call other cultures, religions, myths, right?\n\n27:43.940 --> 27:46.660\n And then we call our myths, religions.\n\n27:46.660 --> 27:50.660\n And I guess myth has a bad connotation to it, that it's not somehow real.\n\n27:50.660 --> 27:51.300\n Yeah.\n\n27:51.300 --> 27:57.620\n Now, what's interesting is that people like Plato, who lived thousands of years ago, 2500\n\n27:57.620 --> 28:05.140\n about, basically made this distinction himself within his own culture, which was Greek, right?\n\n28:05.140 --> 28:08.180\n So Plato is a very famous Greek philosopher.\n\n28:08.180 --> 28:09.620\n And he would say things like this.\n\n28:09.620 --> 28:17.620\n He would say that he would make a distinction between the reality of the one God, or the\n\n28:17.620 --> 28:23.060\n one, he would call it, he didn't use the word God, but he's referencing a divinity,\n\n28:24.500 --> 28:25.860\n and he believes in the soul.\n\n28:27.540 --> 28:32.420\n But he would also say that the gods and goddesses of the Greeks are just myths.\n\n28:33.140 --> 28:35.140\n So even he would make that distinction.\n\n28:35.140 --> 28:40.980\n Again, he would say the population is not too bright, so they believe in these gods\n\n28:40.980 --> 28:42.020\n and goddesses.\n\n28:42.020 --> 28:48.740\n But he himself is talking to his students, and he's basically talking about forms, so\n\n28:49.540 --> 28:52.580\n that seem to live in these other dimensions.\n\n28:52.580 --> 28:56.980\n Like this table, let's go back to this table that we're talking around right now.\n\n28:56.980 --> 29:01.700\n He would say that this table is the instantiation of the form table, and that there is this\n\n29:01.700 --> 29:03.620\n table that actually exists somewhere.\n\n29:03.620 --> 29:07.220\n It's this place where numbers exist, like the number two, okay?\n\n29:07.220 --> 29:11.140\n So we use the number two mathematically, therefore it exists.\n\n29:11.140 --> 29:13.060\n But have you ever seen a real one?\n\n29:13.060 --> 29:14.740\n Have you ever seen the real two?\n\n29:14.740 --> 29:16.180\n No, okay.\n\n29:16.180 --> 29:17.380\n So but where does it exist?\n\n29:17.380 --> 29:18.660\n So he says that tables...\n\n29:18.660 --> 29:25.700\n So he was also talking about things that he says are real, making a distinction between\n\n29:26.260 --> 29:32.980\n the people, and by the way, he got this from Socrates, his mentor, who was killed by Athens\n\n29:32.980 --> 29:34.980\n because he would say such things.\n\n29:34.980 --> 29:38.660\n People don't like to be told that what they believe in is not real, right?\n\n29:38.660 --> 29:39.060\n Yeah.\n\n29:39.060 --> 29:44.980\n By the way, his idea of forms, you're just making me realize how incredible was that\n\n29:44.980 --> 29:46.820\n somebody like that was able to come up with that.\n\n29:47.460 --> 29:51.780\n I mean, that idea became a myth, the idea of forms, right?\n\n29:51.780 --> 29:59.140\n That permeated probably the most influential set of ideas in the history of philosophy,\n\n29:59.140 --> 30:00.420\n in the history of ideas.\n\n30:00.420 --> 30:01.620\n Yes, yeah.\n\n30:01.620 --> 30:03.540\n I mean, Plato, we know him for a reason, right?\n\n30:03.540 --> 30:04.100\n Yeah.\n\n30:04.100 --> 30:10.180\n So let's say that it's a gray area between religious and myths, and maybe not even...\n\n30:10.180 --> 30:11.220\n It is gray, yeah.\n\n30:12.500 --> 30:18.660\n So how's that idea with little Plato start and permeate through all of society?\n\n30:18.660 --> 30:19.540\n Oh, how does it happen?\n\n30:19.540 --> 30:22.180\n Okay, so there are different ways that religions work.\n\n30:22.980 --> 30:29.460\n So a lot of people would call the UFO narrative today, and this is what I talk about in my\n\n30:29.460 --> 30:31.700\n book, like a myth, right, the UFO myth.\n\n30:31.700 --> 30:33.940\n But a lot of people believe in it, okay?\n\n30:33.940 --> 30:35.380\n So how do these things work?\n\n30:35.380 --> 30:36.660\n Well, what I did was I took...\n\n30:38.260 --> 30:42.500\n There's a Ann Taves at UC Santa Barbara.\n\n30:42.500 --> 30:47.460\n She's a pretty well known academic who studies religion, and she has this building block\n\n30:48.020 --> 30:50.500\n definition of religion, like it builds, okay?\n\n30:50.500 --> 30:56.820\n And so she says there are no religious experiences or mythic experiences.\n\n30:56.820 --> 30:59.060\n There are experiences.\n\n30:59.060 --> 31:03.540\n And then they get interpreted as religious or mythic, okay?\n\n31:03.540 --> 31:08.340\n And so I use that with the UFO narrative.\n\n31:08.340 --> 31:12.180\n So I take and I compare it to the religious narrative.\n\n31:12.180 --> 31:13.700\n So basically what happens?\n\n31:14.660 --> 31:19.780\n What happens is this, is that a person generally has a very intense experience.\n\n31:20.580 --> 31:26.580\n It could be with something that they see in the sky, a being that they see, like Moses\n\n31:26.580 --> 31:28.340\n in the burning bush or something like that.\n\n31:28.340 --> 31:30.100\n They tell other people, okay?\n\n31:30.100 --> 31:34.820\n And those other people believe them because they say, that guy, let's take you.\n\n31:34.820 --> 31:35.620\n Okay, Lex.\n\n31:35.620 --> 31:38.420\n Okay, so you're playing some of your music.\n\n31:39.220 --> 31:41.380\n Jimi Hendrix shows up out of the blue.\n\n31:41.380 --> 31:44.740\n So Jimi Hendrix, who does Electric Church stuff, right?\n\n31:44.740 --> 31:46.420\n The Electric Church movement.\n\n31:46.420 --> 31:47.540\n So he shows up.\n\n31:47.540 --> 31:49.540\n I was, sorry for the small tension.\n\n31:50.100 --> 31:53.540\n I'm not aware of, I apologize if I should be.\n\n31:53.540 --> 31:59.620\n I just know how to play all of the songs, Electric Church.\n\n31:59.620 --> 32:00.580\n Is this a thing?\n\n32:00.580 --> 32:02.740\n Yeah, it's Jimi Hendrix's thing.\n\n32:02.740 --> 32:03.380\n Yeah.\n\n32:03.380 --> 32:05.620\n That was like a philosophy of his or what?\n\n32:05.620 --> 32:06.420\n Yes, yes, yes.\n\n32:06.420 --> 32:10.900\n So he thought it was like a mission for him, like he was a missionary.\n\n32:10.900 --> 32:13.380\n And he was like doing the Electric Church.\n\n32:13.380 --> 32:18.580\n It was through his mission of music that he was actually impacting people spiritually.\n\n32:18.580 --> 32:21.860\n And I think you have to agree that his music is really spiritual, yeah.\n\n32:21.860 --> 32:24.660\n Wow, that's so cool to know that there's like a philosophy there.\n\n32:24.660 --> 32:24.900\n Yeah.\n\n32:24.900 --> 32:26.420\n I wonder if he's ever written anything.\n\n32:26.980 --> 32:28.900\n He's spoken about it many times.\n\n32:28.900 --> 32:29.380\n Interesting.\n\n32:29.380 --> 32:29.620\n Yeah.\n\n32:29.620 --> 32:31.860\n I need to actually do some research here.\n\n32:31.860 --> 32:33.700\n Wow, that adds another level of depth.\n\n32:33.700 --> 32:34.580\n That's awesome.\n\n32:34.580 --> 32:35.140\n Okay, so.\n\n32:35.700 --> 32:40.580\n Okay, so say Lex is playing one of his songs.\n\n32:40.580 --> 32:41.300\n He shows up.\n\n32:41.300 --> 32:42.740\n What's your favorite Hendrix song by the way?\n\n32:43.300 --> 32:44.420\n Oh, that's a hard one.\n\n32:44.420 --> 32:45.940\n I like Castles in the Sand.\n\n32:45.940 --> 32:48.500\n It's a sad one, but I like it.\n\n32:48.500 --> 32:50.740\n So I'm playing something and they show up.\n\n32:50.740 --> 32:53.700\n And all of a sudden, boom, just like Elvis does for people.\n\n32:54.580 --> 32:56.260\n Hendrix shows up, all right?\n\n32:56.260 --> 33:00.980\n And then you're amazed and he tells you something that's very, very significant.\n\n33:00.980 --> 33:03.380\n And he says, you need to tell other people this, okay?\n\n33:03.380 --> 33:04.500\n So then like, okay.\n\n33:04.500 --> 33:06.180\n I go on social media.\n\n33:06.180 --> 33:07.620\n Yes, and you start.\n\n33:07.620 --> 33:15.300\n And because people believe you and because you are a person of credibility, people believe you.\n\n33:15.300 --> 33:17.620\n And so all of a sudden a movement starts, okay?\n\n33:17.620 --> 33:19.220\n And it's the Hendrix movement.\n\n33:19.220 --> 33:21.140\n It's Hendrix 2 or something like that.\n\n33:21.140 --> 33:25.060\n You know, we call it something, the next iteration of Hendrix, right?\n\n33:25.060 --> 33:28.180\n Hendrix lives, but he lives as this vibration.\n\n33:28.180 --> 33:32.820\n And only Lex can manifest this vibration, okay?\n\n33:32.820 --> 33:35.380\n So this is how religions start.\n\n33:36.500 --> 33:37.860\n Excuse your audience who are religious.\n\n33:37.860 --> 33:39.140\n I'm actually a practicing Catholic.\n\n33:39.140 --> 33:40.980\n So this is how religion starts.\n\n33:40.980 --> 33:43.860\n They start with, first off, a contact experience.\n\n33:45.140 --> 33:47.140\n Not all of them, but a good portion of them.\n\n33:47.140 --> 33:52.660\n And some person has an experience that's transcendent, sacred to them.\n\n33:52.660 --> 33:54.340\n And they go and they tell other people.\n\n33:54.340 --> 33:56.740\n And then those people tell other people.\n\n33:56.740 --> 33:59.380\n And then something gets written about it, okay?\n\n33:59.380 --> 34:04.340\n And then it becomes, because it's a charismatic movement, people become affected by it.\n\n34:04.340 --> 34:10.100\n And if too many people are affected by it, an institution steps in and tries to control\n\n34:10.100 --> 34:10.740\n the narrative.\n\n34:10.740 --> 34:16.660\n So this is what you'd call the beginning of a religion or a myth, a very powerful myth.\n\n34:16.660 --> 34:19.060\n And so it's almost like a star, right?\n\n34:19.060 --> 34:20.100\n A star is born.\n\n34:20.100 --> 34:20.660\n A star is born.\n\n34:20.660 --> 34:21.140\n Okay, yeah.\n\n34:21.140 --> 34:25.940\n When you say institution, do you mean some other organization that's already powerful?\n\n34:25.940 --> 34:26.260\n Yes.\n\n34:26.260 --> 34:29.620\n Doesn't want to become overpowered by this new movement?\n\n34:29.620 --> 34:30.420\n Yes, absolutely.\n\n34:30.420 --> 34:31.700\n Is this usually governments?\n\n34:31.700 --> 34:32.660\n It's usually, yeah.\n\n34:32.660 --> 34:34.740\n So I have a couple of examples.\n\n34:34.740 --> 34:38.980\n I use the example of the Christian church in my book, because I'm most familiar with the\n\n34:38.980 --> 34:40.820\n history of Christianity.\n\n34:40.820 --> 34:45.140\n And Christianity was started by this Jewish man.\n\n34:45.140 --> 34:50.660\n And it was a movement that he was a very powerful, charismatic person.\n\n34:50.660 --> 34:52.420\n Other people believed in him.\n\n34:52.420 --> 34:54.340\n And then his followers talked about him.\n\n34:54.340 --> 35:04.500\n And then usually early Christians before the 300s were generally people who were disenfranchised,\n\n35:04.500 --> 35:09.780\n because he had a pretty radical idea that humans should have dignity.\n\n35:10.340 --> 35:12.580\n And this was pretty radical during that time.\n\n35:12.580 --> 35:19.380\n So women who didn't have dignity and slaves who didn't have dignity at the time converged\n\n35:19.380 --> 35:20.980\n to Christianity in droves.\n\n35:20.980 --> 35:27.700\n And so what happened was that all of a sudden it became this belief system that was undercurrent.\n\n35:27.700 --> 35:36.180\n And then Constantine, who was an elite, had an experience and made Christianity a state\n\n35:36.180 --> 35:36.660\n religion.\n\n35:37.380 --> 35:41.860\n By that time, there were different forms of Christianity, probably hundreds of them.\n\n35:41.860 --> 35:43.140\n Well, most likely.\n\n35:43.140 --> 35:51.380\n And Constantine and the people who were powerful with him decided that their idea, this is\n\n35:51.380 --> 35:56.660\n the Council of Nicaea now, decided that there was one form, and they called it universal.\n\n35:56.660 --> 36:00.020\n It's the one form of Christianity, and this should be it.\n\n36:00.020 --> 36:04.900\n And so they kind of took out all the other denominations of Christianity and different\n\n36:04.900 --> 36:05.780\n forms of it.\n\n36:05.780 --> 36:15.060\n So you can see that a very, very powerful set of beliefs put a culture on fire, right?\n\n36:15.060 --> 36:19.060\n And so they had to deal with that fire somehow.\n\n36:19.060 --> 36:20.580\n And so they narrativized it.\n\n36:20.580 --> 36:22.980\n They decided, how do we interpret this?\n\n36:22.980 --> 36:25.220\n And they interpreted it as they wished.\n\n36:25.220 --> 36:27.940\n But that wasn't the only interpretation of Christianity.\n\n36:27.940 --> 36:28.980\n I have another example.\n\n36:29.700 --> 36:37.540\n In the Catholic Church, a lot of times, and I'm going to use the example of Faustina.\n\n36:39.460 --> 36:41.700\n She's a nun, and she's Polish.\n\n36:41.700 --> 36:47.700\n And I think it was in the early 20th century, if not the 1800s, that she had a very powerful,\n\n36:49.300 --> 36:52.260\n many experiences, actually, of Jesus.\n\n36:52.260 --> 36:57.220\n And she saw Jesus with rays coming out of his heart.\n\n36:57.220 --> 37:03.060\n And basically, she called this his divine mercy, and it became a devotion in Poland,\n\n37:03.060 --> 37:04.260\n and it spread.\n\n37:04.260 --> 37:07.620\n The Catholic Church was not into this at all, okay?\n\n37:07.620 --> 37:13.140\n And so they did everything they could to try to suppress Faustina's influence, which was\n\n37:13.140 --> 37:16.660\n growing and growing and growing and growing, okay?\n\n37:16.660 --> 37:20.740\n And so they were very successful in trying to keep her quiet, and she died, okay?\n\n37:20.740 --> 37:28.740\n Years later, John Paul II, Polish, sainted her and created the divine mercy devotion,\n\n37:28.740 --> 37:32.340\n which is worldwide now, and millions and millions of people.\n\n37:32.340 --> 37:35.620\n But do you see how they completely controlled it there?\n\n37:35.620 --> 37:41.380\n So fascinating that it just starts with a single, like you said, contact experience.\n\n37:41.380 --> 37:42.660\n Experience is the key word.\n\n37:42.660 --> 37:48.820\n And is your sense that those experiences are legitimate, so it's not...\n\n37:48.820 --> 37:50.980\n Yes, for the most part.\n\n37:50.980 --> 37:52.660\n Somehow artificially constructed?\n\n37:52.660 --> 37:52.980\n Yeah.\n\n37:52.980 --> 37:56.180\n I think for the most part, they're legitimate experiences that people have.\n\n37:56.180 --> 37:58.740\n Why would someone want to put themselves through what they go through?\n\n37:58.740 --> 38:00.900\n Like, why would Jesus want to get crucified?\n\n38:00.900 --> 38:02.820\n I mean, that's a pretty nasty way to die.\n\n38:03.940 --> 38:06.900\n Why would Faustina bring this upon herself?\n\n38:08.100 --> 38:12.180\n The people that I meet who said that they've seen UFOs, that most of them don't want to\n\n38:12.180 --> 38:15.300\n be known because of the ridicule that goes along with it.\n\n38:15.300 --> 38:21.300\n So I honestly think that there are people who are maybe not stable and would like the\n\n38:21.300 --> 38:25.380\n attention, but for the most part, normal people don't want this attention.\n\n38:25.380 --> 38:26.820\n So you mentioned building blocks.\n\n38:28.100 --> 38:33.940\n You didn't mention the word God or sort of the afterlife.\n\n38:33.940 --> 38:36.580\n Are those essential to the myth?\n\n38:36.580 --> 38:38.500\n So there's a contact experience.\n\n38:38.500 --> 38:43.540\n Is there some other aspects of myth and religion which makes them viral?\n\n38:43.540 --> 38:48.740\n Which makes them spread and captivate the imagination of people?\n\n38:49.780 --> 38:50.260\n Yes.\n\n38:50.260 --> 38:52.580\n Is there a pattern to them?\n\n38:53.060 --> 38:56.340\n I think that for each era, it's different and people have...\n\n38:56.340 --> 39:00.020\n First, let's talk about the definition of religion, if that's okay, because most people\n\n39:00.020 --> 39:06.260\n assume the definitions that we in the West are familiar with, which is that, you know,\n\n39:06.260 --> 39:11.940\n that of Christianity, Islam, Judaism, you know, monotheistic religions.\n\n39:11.940 --> 39:16.740\n And those are just some religions.\n\n39:16.740 --> 39:18.580\n There are so many different types of religions.\n\n39:18.580 --> 39:20.260\n Some religions have no God at all.\n\n39:21.460 --> 39:28.260\n Zen Buddhism, for example, is a religion that asks you to take away your belief structures,\n\n39:28.260 --> 39:29.300\n like to kind of like...\n\n39:29.300 --> 39:32.580\n In fact, I would call that a Kantian type religion, right?\n\n39:32.580 --> 39:37.940\n In that it's basically telling you to get rid of your concepts of what you think about\n\n39:37.940 --> 39:42.420\n things so that you can actually have the experience, like you were talking about earlier,\n\n39:42.420 --> 39:43.940\n of the thing in itself.\n\n39:43.940 --> 39:45.700\n And they call that Satori.\n\n39:45.700 --> 39:49.700\n So there are people who believe, you know, they try to...\n\n39:49.700 --> 39:55.700\n They call it meditation, Zen meditation, and it's fairly radical, actually.\n\n39:55.700 --> 40:00.340\n In some monasteries, I don't know if they still do this, but they'll whack you on the\n\n40:00.340 --> 40:06.980\n head if you appear to be not focusing and, you know, that kind of thing.\n\n40:06.980 --> 40:13.700\n You know, they do things to basically take you away from your conceptions of reality\n\n40:13.700 --> 40:18.980\n and bring you into a state of all that is, which is what they call Satori.\n\n40:19.540 --> 40:21.220\n And that has nothing to do with God.\n\n40:22.500 --> 40:23.700\n I like this religion.\n\n40:23.700 --> 40:28.900\n And anything that involves sticks and whacking in order for you to focus better, I'm gonna\n\n40:28.900 --> 40:30.100\n have to join a monastery.\n\n40:30.100 --> 40:34.900\n So, okay, so digging into definitions of religion.\n\n40:34.900 --> 40:40.340\n So like, what do you think is the scope that defines a religion?\n\n40:41.060 --> 40:41.700\n Oh, okay.\n\n40:41.700 --> 40:46.900\n So in my field, we have a few different definitions of religion, as you can imagine, just like\n\n40:46.900 --> 40:49.620\n philosophers have different definitions of what is real.\n\n40:50.340 --> 40:54.100\n So I take this definition and it comes from John Livingston.\n\n40:54.100 --> 41:02.660\n And it's, religion is that set of beliefs and practices that is inspired by a transformative,\n\n41:02.660 --> 41:07.220\n what is perceived actually to be a transformative and sacred power.\n\n41:07.940 --> 41:08.820\n Can you say that again?\n\n41:08.820 --> 41:09.540\n Yeah.\n\n41:09.540 --> 41:13.540\n So religion is a set of, it's not just belief, it's also practices.\n\n41:13.540 --> 41:17.460\n It's both belief and practices, because you won't have the practices without the belief.\n\n41:17.460 --> 41:22.900\n So you have those together, okay, and it's inspired by what is perceived, because we\n\n41:22.900 --> 41:28.260\n don't know if it's real or not, what is perceived to be of sacred and transforming power.\n\n41:28.260 --> 41:33.060\n So perceived by the followers, or is this connected to the original sort of experience?\n\n41:33.060 --> 41:36.020\n No, no, well, it's perceived by the followers.\n\n41:36.020 --> 41:37.300\n That's a really good definition.\n\n41:37.300 --> 41:45.220\n So, and that's the governing idea is that there's something of great power, perceived\n\n41:45.220 --> 41:51.620\n to be of great power, which you can connect yourself either emotionally or intellectually\n\n41:51.620 --> 41:55.860\n somehow in order to explore the world that is beyond your own capabilities.\n\n41:55.860 --> 41:56.580\n Yes.\n\n41:56.580 --> 41:58.980\n And is there communication also involved?\n\n41:58.980 --> 42:00.980\n Generally, yeah.\n\n42:00.980 --> 42:02.260\n That's a great definition.\n\n42:02.260 --> 42:02.740\n Okay.\n\n42:02.740 --> 42:08.420\n So within that falls everything that we've talked about so far, including technology\n\n42:08.420 --> 42:11.860\n and alien life and so on.\n\n42:12.580 --> 42:19.700\n Do you think ultimately religion is good for human civilization?\n\n42:19.700 --> 42:25.380\n Let me maybe phrase it differently is what's religion good for?\n\n42:25.380 --> 42:27.460\n Okay, yeah, that's a great question.\n\n42:27.460 --> 42:28.740\n Thanks for asking that.\n\n42:28.740 --> 42:30.260\n Most people don't ask that.\n\n42:30.260 --> 42:34.900\n And I think it's the question to ask, why do we still have religion?\n\n42:34.900 --> 42:36.020\n That's the question, right?\n\n42:36.020 --> 42:45.780\n Because scientists and others, scholars, humanists even thought that there's this thing called\n\n42:45.780 --> 42:53.780\n the secularization thesis, and it's this idea that the more we progress rationally and we\n\n42:53.780 --> 42:57.940\n have better instruments for understanding our reality, the less religious we will be.\n\n42:57.940 --> 43:00.340\n But that's been found to be untrue.\n\n43:00.340 --> 43:01.860\n We're still very religious, okay?\n\n43:01.860 --> 43:02.500\n So why?\n\n43:02.500 --> 43:03.540\n Why is it around?\n\n43:03.540 --> 43:05.860\n Well, it's adaptive in some way, in my opinion.\n\n43:06.420 --> 43:12.180\n Many people would not agree with me, but I kind of see it as an evolutionary adaptation.\n\n43:12.180 --> 43:17.700\n Now, think about religions, okay?\n\n43:17.700 --> 43:20.340\n Think about Christianity again, for one.\n\n43:20.340 --> 43:25.780\n Here comes this idea when you have this ruthless empire called the Roman Empire, which litters\n\n43:25.780 --> 43:33.140\n its roads with crucified bodies to let you know, don't mess with us, okay?\n\n43:33.140 --> 43:33.700\n All right.\n\n43:33.700 --> 43:37.780\n Here all of a sudden you have this guy saying, God is love, okay?\n\n43:37.780 --> 43:39.460\n All right, well, that's weird.\n\n43:39.460 --> 43:40.580\n Okay, so why?\n\n43:40.580 --> 43:41.860\n Why does this take off?\n\n43:41.860 --> 43:47.140\n Well, it takes off because we're becoming a colonial power.\n\n43:47.780 --> 43:51.700\n That means we're going into other countries, we're conquering them.\n\n43:54.100 --> 44:00.020\n How do we survive together as cultures that don't clash?\n\n44:00.020 --> 44:04.340\n Well, we have to have a belief structure that allows us to, and I think religions function\n\n44:04.340 --> 44:05.620\n that way, frankly.\n\n44:05.620 --> 44:14.100\n So religions help us, so Richard Dawkins's meme idea, it allows us to explore a space\n\n44:14.100 --> 44:22.660\n of ideas, and that in itself is the, so it's like evolution of ideas, and religion is a\n\n44:22.660 --> 44:25.220\n powerful tool for us to explore ideas.\n\n44:25.220 --> 44:29.380\n Because if I believe that men have souls.\n\n44:31.300 --> 44:31.700\n Do they?\n\n44:31.700 --> 44:36.820\n Yes, they do, okay.\n\n44:36.820 --> 44:39.380\n I'm still trying to figure that out.\n\n44:39.380 --> 44:47.860\n Well, I still, in terms of souls, do believe cats don't have souls, but we'll never be\n\n44:47.860 --> 44:48.820\n able to confirm that.\n\n44:49.460 --> 44:53.620\n Maybe if we get better instruments, the soul instrument, you need to come up with that\n\n44:53.620 --> 44:54.180\n one, please.\n\n44:54.740 --> 44:55.620\n For cats?\n\n44:55.620 --> 44:58.660\n Yeah, not just for cats, but for all animals and people in general.\n\n44:58.660 --> 45:04.020\n For sure, you could put them in like a little, you know, soul machine and find out what's\n\n45:04.020 --> 45:05.380\n the status of their soul.\n\n45:07.300 --> 45:08.260\n That's funny.\n\n45:08.260 --> 45:13.060\n I hope we'll become a scientific discipline of consciousness, and consciousness is in\n\n45:13.060 --> 45:18.180\n some sense connected to maybe what the meaning of the word soul used to be.\n\n45:18.900 --> 45:23.460\n And I think it's a fascinating open question, like what is consciousness and so on that\n\n45:23.460 --> 45:26.740\n maybe we'll touch on in a little bit.\n\n45:26.740 --> 45:28.820\n But yeah, anyway, back to our...\n\n45:28.820 --> 45:30.260\n Religions being adaptive.\n\n45:30.260 --> 45:37.540\n I think that Christianity probably helped us become better people to each other as we\n\n45:37.540 --> 45:40.500\n moved into a more global society.\n\n45:40.500 --> 45:45.460\n And I also, it goes along with my book, which is basically making the argument that belief\n\n45:45.460 --> 45:51.860\n in nonhuman intelligence or ETs or UFOs, UAPs, whatever you want to call them, is a new form\n\n45:51.860 --> 45:52.820\n of religion.\n\n45:52.820 --> 45:57.460\n And how does that work with the scientific method?\n\n45:58.260 --> 46:03.700\n Do you think there's always this role of religion as being, in its broad definition of religion,\n\n46:03.700 --> 46:09.700\n as being a complement to our sort of very rigorous empirical pursuit of understanding\n\n46:09.700 --> 46:10.500\n reality?\n\n46:10.500 --> 46:12.660\n There's always going to be this coupling.\n\n46:12.660 --> 46:19.300\n We'll always define, redefine new eras of civilization of what that religion actually\n\n46:19.300 --> 46:19.780\n looks like.\n\n46:19.780 --> 46:25.220\n So you talk about technology and so on being the modern set of religious beliefs around\n\n46:25.220 --> 46:25.700\n that.\n\n46:26.420 --> 46:27.860\n So is that always going to...\n\n46:27.860 --> 46:33.620\n Is religion always going to kind of cover the space of things we can't quite understand\n\n46:33.620 --> 46:36.740\n with science yet, but we still want to be thinking about?\n\n46:37.460 --> 46:38.340\n Oh, I see what you're saying.\n\n46:38.340 --> 46:39.300\n That's a great question.\n\n46:39.780 --> 46:45.860\n When you say religion, I would use the word religiosity because I think that we're moving\n\n46:45.860 --> 46:51.060\n out of the dogmatic types of religions into more of a, I hate to put it this way, but\n\n46:51.060 --> 46:56.660\n an X Files type religion where we can say, I want to believe, or the truth is out there,\n\n46:56.660 --> 47:01.060\n but we don't know that it's out there, or we don't know yet what it is, but we know\n\n47:01.060 --> 47:01.860\n it's out there.\n\n47:01.860 --> 47:08.740\n So there's this kind of built in capacity for belief in something that we don't have\n\n47:08.740 --> 47:11.620\n evidence for yet, and that's a sort of faith.\n\n47:11.620 --> 47:15.060\n So I would say yes to that question, absolutely.\n\n47:15.060 --> 47:16.660\n I think it's adaptive in that way.\n\n47:16.660 --> 47:17.860\n We're moving into a new...\n\n47:17.860 --> 47:20.500\n I mean, heck, we've already moved into this culture.\n\n47:20.500 --> 47:22.740\n Most people have not caught up with it yet.\n\n47:22.740 --> 47:31.140\n I see that in the school systems, and I think that I'm hoping we can catch up fast because\n\n47:31.140 --> 47:32.820\n really it's moving faster than we are.\n\n47:33.780 --> 47:41.300\n So I mentioned to you offline that I'm finishing up on the rise and fall of the Third Reich.\n\n47:41.300 --> 47:47.700\n I'm not sure if you have anything in your exploration, interesting to say, but the use\n\n47:47.700 --> 47:53.940\n of religion by dictators or the lack of the use of religion by dictators, whether we're\n\n47:53.940 --> 47:59.700\n talking about Stalin, which is mostly secular, I apologize if I'm historically incorrect\n\n47:59.700 --> 48:02.340\n on this, but I believe it's secular.\n\n48:02.340 --> 48:09.780\n And Hitler, I think there's some controversy about how much religion played a role in his\n\n48:09.780 --> 48:16.500\n own personal life and in general in terms of influencing the...\n\n48:18.900 --> 48:24.100\n using it to manipulate the public, but definitely the church played a role.\n\n48:25.060 --> 48:30.660\n Do you have a sense of the use of religion by governments to control the populations,\n\n48:31.380 --> 48:38.980\n by dictators, for example, or is that outside of your little explorations as a religious\n\n48:38.980 --> 48:39.780\n scholar?\n\n48:39.780 --> 48:42.980\n It's not outside of my framework, absolutely not.\n\n48:43.540 --> 48:45.940\n I think that it's done routinely.\n\n48:46.980 --> 48:54.180\n Propaganda is done routinely, especially there's nothing more powerful than religion to get\n\n48:54.180 --> 48:56.260\n people to act, I think.\n\n49:00.020 --> 49:06.180\n My mother's Jewish and my father was Roman Catholic, okay, from Irish extraction.\n\n49:06.180 --> 49:16.580\n And so, both great grandparents came here under duress because they were being, what\n\n49:16.580 --> 49:22.180\n would you call it, there was an act of genocide on both sides being done by other cultures,\n\n49:22.180 --> 49:22.420\n okay?\n\n49:22.420 --> 49:26.100\n So, on the one hand, obviously, we know about the Holocaust, okay?\n\n49:26.100 --> 49:30.420\n So, they came, the great grandparents came here to avoid that and they made it.\n\n49:30.420 --> 49:38.740\n On the other hand, there was an English genocide, we just have to say it, of the Irish, it was\n\n49:38.740 --> 49:42.740\n called a famine, but it wasn't fun, it was a staged thing.\n\n49:42.740 --> 49:49.060\n And so, millions of Irish left Ireland on coffin ships is what they called them because\n\n49:49.060 --> 49:52.580\n they usually wouldn't get here, mine happened to get here, okay?\n\n49:52.580 --> 49:55.220\n So, that's the context that I'm coming from.\n\n49:55.220 --> 50:03.700\n So, in each case, for one thing, Irish weren't considered, Catholics weren't considered,\n\n50:03.700 --> 50:08.180\n they were considered to be terrible and there was a lot of anti Catholic rhetoric here in\n\n50:08.180 --> 50:13.620\n the United States, which is kind of strange because one of the, in fact, the most wealthy\n\n50:13.620 --> 50:17.460\n colonial family were the Carrolls in Maryland and they were Catholic.\n\n50:17.460 --> 50:21.780\n So, when you look at the United States, at our history, and you see the separation of\n\n50:21.780 --> 50:24.340\n church and state, do you wanna know where that came from?\n\n50:24.340 --> 50:31.140\n That came from those guys, they convinced George Washington and Thomas Jefferson, I\n\n50:31.140 --> 50:38.740\n mean, they couldn't vote, yet they have their names on the constitution, is that not a strange\n\n50:38.740 --> 50:39.380\n contradiction?\n\n50:40.420 --> 50:47.060\n So, here you can see how propaganda works, there was anti Catholic propaganda, there\n\n50:47.060 --> 50:54.340\n was anti Jewish propaganda and a lot of it was that these people weren't human, they\n\n50:54.340 --> 50:55.220\n weren't human beings.\n\n50:55.780 --> 51:02.340\n Another thing I'd like to say is that when the Irish did come here, they were indentured,\n\n51:02.340 --> 51:09.460\n a lot of times indentured servants, but that's terminology, what is an indentured servant?\n\n51:10.900 --> 51:11.860\n Slave.\n\n51:11.860 --> 51:12.340\n Pretty much.\n\n51:12.340 --> 51:20.500\n So, in that sense, religion can be used derogatorily as a useful grouping mechanism of\n\n51:20.500 --> 51:21.860\n saying, this is the other.\n\n51:22.500 --> 51:29.460\n And it's powerful too, because behind it is a force of what people contend to be sacred,\n\n51:29.460 --> 51:31.140\n a sacred force, right?\n\n51:31.140 --> 51:38.420\n So, it's up to God to decide who's, so you have to go along with what God says, of course.\n\n51:38.420 --> 51:42.660\n Well, that's basically, that's not the contact event.\n\n51:42.660 --> 51:49.300\n The contact event is usually some type of very specific, legitimate event that a person\n\n51:49.300 --> 51:53.060\n has with something that is non human or considered divine.\n\n51:54.100 --> 52:02.420\n But when religions become narrativized, I would call it, by different institutions,\n\n52:02.420 --> 52:04.580\n that's when you're in danger of getting propaganda.\n\n52:04.580 --> 52:07.380\n You said Nietzsche, one of your favorite philosophers.\n\n52:07.380 --> 52:12.980\n He said, famously, one of the many famous things he said is that God is dead.\n\n52:13.620 --> 52:14.120\n Yes.\n\n52:14.740 --> 52:15.940\n What do you think he meant?\n\n52:16.740 --> 52:17.780\n Do you think he was right?\n\n52:18.740 --> 52:19.300\n Okay, good.\n\n52:19.300 --> 52:20.260\n I love this question.\n\n52:20.260 --> 52:21.700\n No one asks me about Nietzsche.\n\n52:24.260 --> 52:25.540\n And I love Nietzsche.\n\n52:25.540 --> 52:30.420\n Okay, so first, actually, I do think, and I could be corrected and probably will be in\n\n52:30.420 --> 52:33.620\n all the comments, but I think that's a good question.\n\n52:33.620 --> 52:38.260\n Well, first, Nietzsche, it's true, wasn't the first to say God is dead.\n\n52:38.260 --> 52:40.100\n I think Hegel said it, okay?\n\n52:40.100 --> 52:41.220\n No one reads Hegel.\n\n52:41.220 --> 52:44.260\n He's like so difficult to read that it's impossible.\n\n52:44.260 --> 52:45.620\n Same with Heidegger, as you mentioned.\n\n52:46.500 --> 52:48.260\n I love him, but yeah, he's really hard to read.\n\n52:48.980 --> 52:51.060\n So Nietzsche basically said God is dead.\n\n52:51.060 --> 52:53.540\n And let me give you the context for him saying that.\n\n52:53.540 --> 52:54.580\n He also said this.\n\n52:54.580 --> 52:56.340\n He said there was only one Christian.\n\n52:56.340 --> 52:58.740\n He died on the cross, okay?\n\n52:58.740 --> 53:02.420\n So he despised Christianity.\n\n53:02.420 --> 53:03.780\n And he said that...\n\n53:03.780 --> 53:05.460\n And the people who practice it.\n\n53:05.460 --> 53:06.420\n Absolutely, yeah.\n\n53:06.420 --> 53:09.300\n But again, he believed in Jesus, and he believed Jesus was...\n\n53:09.300 --> 53:10.980\n He didn't believe He was a divinity.\n\n53:10.980 --> 53:14.500\n He believed Jesus was a good man, and he died on the cross, okay?\n\n53:14.500 --> 53:16.100\n So he believed in the morality of Jesus.\n\n53:16.100 --> 53:17.220\n Yeah, he absolutely did.\n\n53:17.220 --> 53:17.860\n Yeah, he did.\n\n53:18.980 --> 53:23.300\n And Nietzsche basically was making a historical statement about God is dead.\n\n53:24.260 --> 53:25.380\n And he was right.\n\n53:25.380 --> 53:31.860\n He was basically saying that in the century in which he lived, and he died, I think, in 1900.\n\n53:31.860 --> 53:34.020\n Again, I could be wrong about that.\n\n53:34.020 --> 53:36.820\n So I just want to say that I believe he died in 1900.\n\n53:36.820 --> 53:39.540\n Okay, so he's writing in the 1800s.\n\n53:39.540 --> 53:44.260\n And he's basically saying God is dead, and we killed Him, okay?\n\n53:44.260 --> 53:49.380\n So he's making a historical statement that at that point in time, with science just kind\n\n53:49.380 --> 54:00.100\n of getting better and industrialization happening, the idea of this thing beyond\n\n54:00.100 --> 54:04.260\n what we know as material reality is dead.\n\n54:05.060 --> 54:10.100\n So the substrate of Western civilization is dead.\n\n54:10.100 --> 54:13.540\n That's what Nietzsche is saying, if that makes sense.\n\n54:13.540 --> 54:13.940\n Yes.\n\n54:13.940 --> 54:20.660\n And he basically says with that comes the übermensch, okay, which is the superhuman.\n\n54:20.660 --> 54:22.580\n And he says there aren't many of them.\n\n54:22.580 --> 54:23.780\n He says, but they're going to come.\n\n54:23.780 --> 54:26.580\n And he also talks about the philosophers of the future.\n\n54:26.580 --> 54:29.860\n And he's speaking and writing to them, is my belief.\n\n54:29.860 --> 54:35.620\n So he's basically telling you and me, because we're now the philosophers of his future.\n\n54:35.620 --> 54:36.100\n Yeah.\n\n54:36.100 --> 54:41.940\n He's basically telling us this is what's happening now, and look what it has done.\n\n54:41.940 --> 54:49.380\n He says now everything is possible, all manner of terrible evil, because no one has the belief\n\n54:49.380 --> 54:53.780\n in God anymore, the belief that there is an afterlife.\n\n54:53.780 --> 54:54.980\n You asked about an afterlife.\n\n54:54.980 --> 55:00.740\n So with this kind of belief in a morality comes this belief, you can have morals without\n\n55:00.740 --> 55:01.940\n God, okay, people do.\n\n55:01.940 --> 55:08.100\n But Christianity is this idea that you will reap what you sow.\n\n55:08.100 --> 55:10.900\n So if people don't believe that anymore, what will happen?\n\n55:10.900 --> 55:16.820\n And so that's what he's basically saying, is that the basic anchor for Western society\n\n55:16.820 --> 55:17.620\n is now gone.\n\n55:18.260 --> 55:19.380\n Do you think he was right?\n\n55:19.380 --> 55:21.460\n Absolutely, absolutely right.\n\n55:21.460 --> 55:27.860\n But then again, what do you think if we brought him back to life and he read American Cosmic,\n\n55:27.860 --> 55:36.580\n your book, and he wrote, he tweeted about it, writing a review maybe for the, I don't\n\n55:36.580 --> 55:38.180\n know what they post, for New York Times.\n\n55:38.180 --> 55:42.580\n He'd be an editorial writer with a blue check mark on Twitter.\n\n55:43.860 --> 55:48.660\n What do you think he would say about this idea that you present that's a grander idea\n\n55:48.660 --> 55:51.780\n of religion and, you know.\n\n55:52.740 --> 55:54.900\n Like religiosity, like this new form.\n\n55:54.900 --> 55:58.660\n Yeah, wouldn't that kind of reverse the idea that God is dead?\n\n55:59.300 --> 56:05.540\n Yeah, because it would bring up this idea of external intelligences that are not human,\n\n56:05.540 --> 56:08.980\n which is basically a lot of religions talk about that, right?\n\n56:08.980 --> 56:14.020\n There are bodhisattvas, there are angels, there are demons, you know, there's all these\n\n56:14.020 --> 56:20.020\n types of non human intelligences that religion makes space for.\n\n56:20.020 --> 56:25.540\n So what I'm basically saying in American Cosmic is these new things are within the\n\n56:25.540 --> 56:28.580\n realm of UFOs and UAPs.\n\n56:28.580 --> 56:35.860\n So no, I think that, well, I think Nietzsche would say that that's a progressive adaptation\n\n56:35.860 --> 56:38.500\n of religion is what I would hope he would say.\n\n56:38.500 --> 56:41.620\n Nietzsche, however, is unpredictable, I think.\n\n56:41.620 --> 56:43.460\n I couldn't predict him.\n\n56:43.460 --> 56:51.540\n So I would say that it would be my hope that he would say this is an accurate representation\n\n56:51.540 --> 56:54.100\n of a move into a new type of religion.\n\n56:54.980 --> 56:57.300\n And it's adaptive, therefore, progressive.\n\n56:57.940 --> 57:02.660\n He would probably be uncomfortable reading a book by a brilliant female professor.\n\n57:02.660 --> 57:04.180\n Who happens also to be short.\n\n57:06.340 --> 57:07.780\n I don't know if you read that.\n\n57:07.780 --> 57:12.580\n He said some pretty nasty things about short women.\n\n57:12.580 --> 57:14.100\n Oh, my God.\n\n57:14.100 --> 57:15.140\n Yeah.\n\n57:15.140 --> 57:16.100\n Oh, Nietzsche.\n\n57:16.100 --> 57:17.140\n He should be canceled.\n\n57:18.100 --> 57:20.020\n No, no, please don't cancel Nietzsche.\n\n57:20.580 --> 57:22.740\n You have to take people in the context of their time.\n\n57:23.780 --> 57:26.660\n Although I'm pretty sure in his time he was also an asshole.\n\n57:26.660 --> 57:27.060\n He was.\n\n57:28.740 --> 57:30.180\n But assholes are people too.\n\n57:30.740 --> 57:31.060\n Okay.\n\n57:31.620 --> 57:32.420\n Just bad ones.\n\n57:32.420 --> 57:40.740\n You wrote the book, American Cosmic UFOs, Religion, Technology.\n\n57:41.460 --> 57:43.140\n What was the goal of writing this book?\n\n57:43.860 --> 57:46.340\n What, maybe we'll mention it.\n\n57:46.340 --> 57:53.140\n We have already mentioned it many times, but in this little space of a conversation,\n\n57:54.020 --> 57:59.540\n can you say maybe what is the key insight that you found that lingers with you to this day\n\n57:59.540 --> 58:04.340\n from the process, the long process of putting this book together?\n\n58:04.340 --> 58:04.840\n Sure.\n\n58:05.380 --> 58:12.260\n Just like with my book on purgatory, I went into the research thinking that it would be something\n\n58:12.260 --> 58:13.780\n that it was entirely not.\n\n58:13.780 --> 58:15.780\n It ended up being something completely different.\n\n58:15.780 --> 58:16.900\n And I think that's good.\n\n58:16.900 --> 58:22.500\n I think that people who do research are very excited actually when their research surprises\n\n58:22.500 --> 58:23.060\n them.\n\n58:23.060 --> 58:30.100\n So I was happily surprised by my purgatory book to learn that it was a place.\n\n58:30.100 --> 58:38.420\n And so I went into American Cosmic being a nonbeliever in UFOs entirely.\n\n58:39.140 --> 58:42.100\n And I came out being agnostic.\n\n58:42.820 --> 58:43.320\n Okay.\n\n58:44.900 --> 58:45.700\n Kind of believer.\n\n58:49.380 --> 58:49.880\n Yeah.\n\n58:49.880 --> 58:54.520\n But agnostic, sort of open to the mysteries of the world.\n\n58:54.520 --> 58:55.160\n Yes.\n\n58:55.160 --> 59:04.520\n And I didn't think that, first of all, I knew that the government was part of the situation.\n\n59:04.520 --> 59:06.280\n I just didn't know how much.\n\n59:06.280 --> 59:19.880\n And so I learned that quickly and acclimated to it, accepted it, and noted that, indeed,\n\n59:19.880 --> 59:27.400\n Horatio, the world is much more mysterious than we think it is.\n\n59:28.680 --> 59:33.960\n There are more mysteries in this life than your philosophy provides for.\n\n59:33.960 --> 59:41.400\n So is the sense American Cosmic is about the mysteries of the modern life as encapsulated\n\n59:41.400 --> 59:46.760\n by the realm of technology and the realm of alien intelligences?\n\n59:47.560 --> 59:48.060\n Yes.\n\n59:52.920 --> 59:56.440\n I'd have to go off record as a professor and talk personally.\n\n59:56.440 --> 1:00:05.560\n As a person, I do think that there are mysteries of which we have an inkling.\n\n1:00:06.120 --> 1:00:13.480\n And if it's something as powerful as nonhuman intelligence, whether or not it's from another\n\n1:00:13.480 --> 1:00:20.120\n planet, extraterrestrial, or it happens to be from another dimension or something else,\n\n1:00:20.120 --> 1:00:26.280\n I think that this is going to get the attention of institutions of power.\n\n1:00:26.280 --> 1:00:28.520\n And indeed, I think that's what has happened.\n\n1:00:29.160 --> 1:00:39.640\n And although probably people have had interactions with these things, it appears to me historically\n\n1:00:40.600 --> 1:00:49.640\n for a long time, as long as humans have existed, I would imagine that indeed this is something\n\n1:00:49.640 --> 1:00:56.520\n that's quite powerful and could change the belief structures of our entire societies,\n\n1:00:56.520 --> 1:00:58.040\n our civilization, basically.\n\n1:00:58.040 --> 1:01:02.120\n So it's the same way that you're talking the belief structures were strongly affected\n\n1:01:02.120 --> 1:01:06.280\n by religious beliefs throughout history in the same way this has the potential.\n\n1:01:08.520 --> 1:01:18.600\n It serves as a source of concern for the powerful because it can have very significant effects\n\n1:01:18.600 --> 1:01:19.720\n on the populace.\n\n1:01:20.520 --> 1:01:26.040\n Is there some broader understanding of how we should think about alien intelligences\n\n1:01:26.600 --> 1:01:33.240\n than like little green men that you can maybe elaborate on and talk about?\n\n1:01:34.040 --> 1:01:34.680\n Yes.\n\n1:01:34.680 --> 1:01:38.040\n This comes directly out of my research in Catholic history.\n\n1:01:38.040 --> 1:01:43.320\n What I found was that let's take, for instance, this idea of an angel.\n\n1:01:43.320 --> 1:01:45.480\n Okay, so we all think we know what an angel looks like.\n\n1:01:45.480 --> 1:01:45.880\n Why?\n\n1:01:45.880 --> 1:01:47.560\n Well, we've been told what an angel looks like.\n\n1:01:47.560 --> 1:01:49.480\n We see what an angel looks like.\n\n1:01:49.480 --> 1:01:52.760\n Throughout history, people have painted angels and they all look pretty much the same.\n\n1:01:53.640 --> 1:02:02.040\n But actually, if you go to the primary sources on either in Hebrew or in Greek or in whatever\n\n1:02:02.040 --> 1:02:09.320\n language and in Latin, and you look at experiences that people have talked about where they've\n\n1:02:09.320 --> 1:02:16.040\n written down their experiences about angels, angels don't at all look like what we think\n\n1:02:16.040 --> 1:02:18.440\n they look like. They don't look like little cherubs with wings.\n\n1:02:18.440 --> 1:02:26.600\n They don't look like tall, strong, anthropomorphic, human looking things.\n\n1:02:26.600 --> 1:02:27.160\n They don't.\n\n1:02:27.160 --> 1:02:28.280\n They look really weird.\n\n1:02:28.840 --> 1:02:32.520\n And sometimes they don't look at all humanoid.\n\n1:02:33.240 --> 1:02:39.000\n They look like strange spinning things with eyes and things like that.\n\n1:02:39.560 --> 1:02:42.120\n They communicate telepathically with us.\n\n1:02:42.120 --> 1:02:47.560\n Okay, so what does that mean for the idea of extraterrestrials or what we consider to\n\n1:02:47.560 --> 1:02:48.280\n be aliens?\n\n1:02:48.280 --> 1:02:58.760\n Like, I do think that they're first, if we are, listen, I'm not the first to say this.\n\n1:02:58.760 --> 1:03:05.240\n If we're in contact with nonhuman intelligence, we're most likely in contact with its technology.\n\n1:03:06.280 --> 1:03:07.720\n Because think about us.\n\n1:03:08.840 --> 1:03:11.480\n Do we send human beings to Mars yet?\n\n1:03:11.480 --> 1:03:14.360\n Some people would say yes, but let's put that aside.\n\n1:03:14.360 --> 1:03:15.640\n So no, we don't.\n\n1:03:15.640 --> 1:03:16.760\n We use our technology.\n\n1:03:16.760 --> 1:03:19.320\n We send our rovers to Mars, okay?\n\n1:03:19.320 --> 1:03:26.600\n Okay, so if there's an extraterrestrial civilization, are they coming by themselves?\n\n1:03:26.600 --> 1:03:28.040\n Are they coming to see us?\n\n1:03:28.040 --> 1:03:29.800\n Or are they sending their technology?\n\n1:03:29.800 --> 1:03:34.440\n Most likely they either are technology or they are sending their technology.\n\n1:03:34.440 --> 1:03:37.960\n Yeah, there might be a gray area between what is technology and what the aliens are.\n\n1:03:37.960 --> 1:03:43.400\n Yeah, so but you're saying like basically a robotic probe that would be the equivalent\n\n1:03:43.400 --> 1:03:46.040\n of us, our human civilization created technology.\n\n1:03:46.040 --> 1:03:52.120\n Way more advanced than what we could believe to be a probe, all right?\n\n1:03:52.680 --> 1:04:03.240\n It's kind of funny to think about like if whatever sort of extraterrestrial creations\n\n1:04:03.240 --> 1:04:09.320\n have visited Earth that we're interacting with some like dumb crappy drone technology.\n\n1:04:09.320 --> 1:04:10.120\n Yeah, it's true.\n\n1:04:11.880 --> 1:04:19.560\n And we're like building these like myths and so on from like an experience with some like\n\n1:04:19.560 --> 1:04:22.680\n crappy drone made by some crappy startup somewhere.\n\n1:04:22.680 --> 1:04:23.560\n That is correct.\n\n1:04:25.320 --> 1:04:29.800\n When the actual intelligence is like something much grander.\n\n1:04:29.800 --> 1:04:34.040\n Yeah, that's the more likely situation I describe.\n\n1:04:34.040 --> 1:04:35.560\n That's what I like to tell people.\n\n1:04:35.560 --> 1:04:38.360\n I'm like, no, it's probably a lot weirder than you think.\n\n1:04:38.360 --> 1:04:39.880\n Yeah, oh boy.\n\n1:04:40.360 --> 1:04:44.040\n So but what forms can it possibly take?\n\n1:04:44.040 --> 1:04:51.240\n So like I really love this idea that I tend to be humble in the face of all that we don't\n\n1:04:51.240 --> 1:04:57.560\n know and I tend to believe that the form alien life forms would take.\n\n1:04:57.560 --> 1:05:04.360\n And the way they would communicate is much more likely to be of a form that we can't\n\n1:05:04.360 --> 1:05:08.360\n even comprehend or perhaps can't even perceive directly.\n\n1:05:08.360 --> 1:05:15.240\n So like, you know, it could be in the space of, you know, we don't understand most of\n\n1:05:15.240 --> 1:05:16.440\n how our mind works.\n\n1:05:16.440 --> 1:05:19.080\n It could be in the space of whatever the heck consciousness is.\n\n1:05:19.800 --> 1:05:25.960\n Like maybe consciousness itself is communication with aliens.\n\n1:05:25.960 --> 1:05:36.360\n Or like, I don't know, it could be just our own thoughts is actually the alien life forms\n\n1:05:36.360 --> 1:05:37.160\n communicating.\n\n1:05:37.720 --> 1:05:41.320\n Like, I know all that sounds crazy, but I'm saying like, I'm just trying to come up with\n\n1:05:41.320 --> 1:05:45.480\n the craziest possible thing that doesn't make any sense that could very well be true.\n\n1:05:45.480 --> 1:05:50.200\n And you can't say it's not true, because we don't understand basically anything about\n\n1:05:50.200 --> 1:05:50.920\n our mind.\n\n1:05:50.920 --> 1:05:57.000\n So it could be all of those things, everything from hallucinations, all the things that are\n\n1:05:57.000 --> 1:06:05.000\n explored through the different drugs that we've talked about in this podcast in general.\n\n1:06:05.000 --> 1:06:09.080\n Joe Rogan loves to talk about DMT and all those kinds of hallucinogenic drugs.\n\n1:06:09.800 --> 1:06:16.120\n All of it, including love and fear, all those things that could be aliens communicating\n\n1:06:16.120 --> 1:06:20.200\n with us, memes on the internet that could be pretty sure here.\n\n1:06:20.200 --> 1:06:22.840\n Pretty sure humor is alien communication.\n\n1:06:22.840 --> 1:06:24.040\n No, I don't know.\n\n1:06:24.040 --> 1:06:29.640\n But is there some way that's helpful for you to think about beyond the little green\n\n1:06:29.640 --> 1:06:30.280\n men?\n\n1:06:30.280 --> 1:06:31.240\n Oh, absolutely.\n\n1:06:31.240 --> 1:06:34.520\n It accords exactly with how I think, actually.\n\n1:06:35.240 --> 1:06:36.280\n So I'll explain.\n\n1:06:38.280 --> 1:06:43.880\n I liked in American Cosmic, I attained the status of full professor.\n\n1:06:43.880 --> 1:06:46.920\n So I was like, OK, I can pretty much write this book like I want to do it.\n\n1:06:46.920 --> 1:06:47.560\n And I did.\n\n1:06:47.560 --> 1:06:51.160\n So I used a lot of quotes from cool artists like David Bowie.\n\n1:06:52.040 --> 1:06:56.280\n So David Bowie opens the book, and he basically says, and so does Nietzsche, by the way.\n\n1:06:56.280 --> 1:07:00.760\n David Bowie and Nietzsche, boom, two awesome quotes right together.\n\n1:07:00.760 --> 1:07:01.320\n That's how I opened my book.\n\n1:07:01.320 --> 1:07:02.440\n No better opener.\n\n1:07:02.440 --> 1:07:02.760\n Yeah.\n\n1:07:02.760 --> 1:07:03.800\n Do you remember the quotes?\n\n1:07:03.800 --> 1:07:04.760\n Yeah, of course.\n\n1:07:04.760 --> 1:07:09.240\n So the first quote by David Bowie, and that's what I'm going to concentrate on in response\n\n1:07:09.240 --> 1:07:12.120\n to what you just said, which I think is absolutely correct.\n\n1:07:12.920 --> 1:07:15.560\n David Bowie said, the internet is an alien life form.\n\n1:07:15.560 --> 1:07:21.640\n OK, and if you've not seen David Bowie's interview where he says that, I highly recommend it.\n\n1:07:21.640 --> 1:07:22.920\n He's so brilliant.\n\n1:07:22.920 --> 1:07:27.320\n OK, so David Bowie is actually quite brilliant about the idea of UFOs.\n\n1:07:27.320 --> 1:07:29.800\n He's also brilliant about the idea of technology.\n\n1:07:29.800 --> 1:07:34.760\n OK, and most people wouldn't think that, but I mean, he's pretty darn smart.\n\n1:07:34.760 --> 1:07:36.360\n OK, so all right.\n\n1:07:36.360 --> 1:07:37.880\n So I started to think about it.\n\n1:07:37.880 --> 1:07:41.320\n And I also early on in my research met Jacques Vallée.\n\n1:07:41.320 --> 1:07:42.840\n OK, so he's a technologist.\n\n1:07:42.840 --> 1:07:48.360\n He has a Ph.D. in information technology from computer science, basically, from Northwestern.\n\n1:07:48.360 --> 1:07:49.640\n And he got that back in the day.\n\n1:07:49.640 --> 1:07:52.200\n You know, when I say back in the day, I'm not talking a thousand years ago.\n\n1:07:52.200 --> 1:07:53.400\n I'm talking like in the 60s.\n\n1:07:53.400 --> 1:07:58.280\n OK, so he's back when computer science wasn't really even the field you can get a degree.\n\n1:07:58.280 --> 1:08:00.280\n Yeah, he has a Ph.D. in it.\n\n1:08:00.280 --> 1:08:01.480\n And he's French.\n\n1:08:01.480 --> 1:08:03.480\n He's from France, but he lives in Silicon Valley.\n\n1:08:03.480 --> 1:08:06.760\n And he worked on ARPANET, which is the proto internet.\n\n1:08:06.760 --> 1:08:07.720\n He mapped Mars.\n\n1:08:07.720 --> 1:08:08.760\n He's also an astronomer.\n\n1:08:08.760 --> 1:08:11.160\n I mean, he's just this all around brilliant guy, right?\n\n1:08:11.160 --> 1:08:13.400\n And he's also interested in UFOs.\n\n1:08:13.400 --> 1:08:17.800\n And most people take those two interests of his as separate interests.\n\n1:08:18.280 --> 1:08:22.920\n And I remember being at a very small conference and listening to him, being in awe, of course,\n\n1:08:22.920 --> 1:08:27.880\n because he's an awe inspiring person, and then thinking, wait a minute, why do people\n\n1:08:28.440 --> 1:08:30.920\n compartmentalize those two things about him?\n\n1:08:30.920 --> 1:08:32.360\n They're one in the same.\n\n1:08:32.360 --> 1:08:39.000\n OK, so when we talk about UFOs and UAPs and stuff, we have to talk about digital technology\n\n1:08:39.000 --> 1:08:40.120\n and things like that.\n\n1:08:40.120 --> 1:08:41.160\n And things like that.\n\n1:08:41.160 --> 1:08:47.800\n Now, if we're going back to what I so if I were to say what if I were to believe in and\n\n1:08:47.800 --> 1:08:53.480\n I like I said earlier, I was agnostic bordering on belief, most likely a believer in these\n\n1:08:53.480 --> 1:08:59.080\n this extraterrestrial or not extraterrestrial, let me put it another way, nonhuman intelligence\n\n1:08:59.080 --> 1:09:00.520\n that's communicating with us.\n\n1:09:00.520 --> 1:09:02.840\n I'm going to tell you how I think they communicate with us.\n\n1:09:02.840 --> 1:09:04.600\n And I go back to the Greeks again.\n\n1:09:04.600 --> 1:09:09.400\n OK, and the Greeks had this idea of muses, you know, the muses.\n\n1:09:09.400 --> 1:09:13.960\n So, OK, so there are these things called muses and we tend to think of them as metaphors.\n\n1:09:13.960 --> 1:09:14.520\n Right.\n\n1:09:14.520 --> 1:09:16.040\n But what if they're not?\n\n1:09:16.040 --> 1:09:20.280\n What if they're actually nonhuman intelligence trying to communicate with us, but we're so\n\n1:09:20.280 --> 1:09:21.000\n stupid?\n\n1:09:21.000 --> 1:09:22.120\n We can't like understand.\n\n1:09:22.120 --> 1:09:29.240\n Like, so only people with like, you know, in super amazing capacities, like poetic,\n\n1:09:29.240 --> 1:09:34.360\n creative, you know, intelligent, mathematical, whatever, you know, because they tend to do\n\n1:09:34.360 --> 1:09:35.240\n this symbolically.\n\n1:09:35.240 --> 1:09:38.360\n They tend to communicate with us in symbols form.\n\n1:09:38.360 --> 1:09:43.000\n And so music, you know, symbols, we've got math that are, you know, it's a symbolic language.\n\n1:09:43.000 --> 1:09:43.800\n And so what?\n\n1:09:43.800 --> 1:09:49.480\n So, OK, so muses are probably a good idea for me of what this would be.\n\n1:09:49.480 --> 1:09:55.560\n Now, would muses have spaceships, you know, or those things that we call physical counterparts\n\n1:09:55.560 --> 1:09:56.920\n to what they are?\n\n1:09:58.120 --> 1:09:59.800\n That's another question altogether.\n\n1:09:59.800 --> 1:10:02.600\n But if, you know, I know why would I think this?\n\n1:10:02.600 --> 1:10:08.280\n Because if you look at the history, there are space programs, both Russian and American,\n\n1:10:08.280 --> 1:10:12.040\n you're going to find some pretty weird stuff, pretty weird history there, Lex.\n\n1:10:12.680 --> 1:10:18.280\n So you want to get an idea, go back to Tchaikovsky and read a little bit about what he has to\n\n1:10:18.280 --> 1:10:18.840\n say.\n\n1:10:18.840 --> 1:10:23.720\n If you look back at the history of our space programs, the viable space programs are both\n\n1:10:23.720 --> 1:10:32.920\n Russian and American, and each has an amazingly strange history because the founders of the\n\n1:10:32.920 --> 1:10:37.240\n calculations that got us up into space, the rocket scientists, basically, were doing some\n\n1:10:37.240 --> 1:10:40.120\n pretty weird rituals and doing religious things, right?\n\n1:10:40.120 --> 1:10:45.000\n They weren't necessarily, like, Jack Parsons on our side was out in the desert with people\n\n1:10:45.000 --> 1:10:51.560\n like L. Ron Hubbard and doing really intense rituals, believing that they were opening\n\n1:10:51.560 --> 1:10:53.160\n stargates and things like that, OK?\n\n1:10:53.160 --> 1:10:53.720\n That's awesome.\n\n1:10:53.720 --> 1:10:55.400\n And they were really doing that, OK?\n\n1:10:55.400 --> 1:11:03.800\n So then you go to the Russian side, and they had a very specific non dogmatic, according\n\n1:11:03.800 --> 1:11:09.000\n to Catholics or Orthodox Christianity, idea of what Christianity was, and they believed\n\n1:11:09.000 --> 1:11:13.240\n that they were interacting with angels, nonhuman intelligences.\n\n1:11:13.240 --> 1:11:19.160\n So if you look back and you see muses, you can contextualize them within this tradition.\n\n1:11:19.160 --> 1:11:23.720\n And so when I started to talk to people who were actually in the space program and who\n\n1:11:23.720 --> 1:11:28.120\n were in these programs that now the government has said, oh, yeah, we do have these programs,\n\n1:11:29.000 --> 1:11:30.840\n they have the same belief structures.\n\n1:11:30.840 --> 1:11:34.760\n They believe that they were also in contact with these nonhuman intelligences, and they\n\n1:11:34.760 --> 1:11:39.400\n were getting what they called downloads of information and creating, sometimes with Tyler\n\n1:11:39.400 --> 1:11:44.920\n Dee in my book, creating technologies that were real, and they were selling them on NASDAQ\n\n1:11:44.920 --> 1:11:50.200\n for a lot of money, like, say, $100 million or something like that, undisclosed amounts,\n\n1:11:50.760 --> 1:11:52.040\n but a lot.\n\n1:11:52.040 --> 1:11:58.280\n And these things are viable technologies that we use now, and they make our lives better,\n\n1:11:58.280 --> 1:12:00.840\n and we progress as a species because of them.\n\n1:12:00.840 --> 1:12:03.640\n Now, that has nothing to do with the scientific method.\n\n1:12:04.360 --> 1:12:10.040\n As much as I know, as much as anybody's going to get angry at me for saying that, but sorry,\n\n1:12:10.040 --> 1:12:16.200\n those were strange encounters that created our ability to go into space.\n\n1:12:16.920 --> 1:12:19.960\n I don't know if they're real or not, but these people believe they were real.\n\n1:12:19.960 --> 1:12:28.440\n YARO Right, so they have a power in actually having an impact on this world, in inspiring\n\n1:12:29.080 --> 1:12:33.560\n humans to create technology, which enables us to do things we haven't been able to do before.\n\n1:12:33.560 --> 1:12:34.040\n KATE Yeah.\n\n1:12:34.040 --> 1:12:38.120\n YARO And these, I like how we're putting angels,\n\n1:12:39.320 --> 1:12:48.920\n alien life forms, aliens, and technology all in the nonhuman intelligence camp, which I really\n\n1:12:48.920 --> 1:12:52.840\n like that because that's very true.\n\n1:12:53.640 --> 1:13:01.480\n It's this other source of wisdom, intelligence, maybe a connection to the mysterious.\n\n1:13:01.480 --> 1:13:04.760\n KATE Yes, I was really surprised by it.\n\n1:13:04.760 --> 1:13:09.800\n YARO Can you speak a little bit more to the connection\n\n1:13:09.800 --> 1:13:19.000\n between aliens and technology that Jacques Vallée had in his own one individual mind,\n\n1:13:19.000 --> 1:13:24.920\n that's very tempting to kind of separate as two separate endeavors.\n\n1:13:25.880 --> 1:13:33.240\n Why did you come to believe that they are one and the same, or at least part of the same\n\n1:13:35.640 --> 1:13:36.760\n intellectual journey?\n\n1:13:36.760 --> 1:13:40.040\n KATE Thanks for asking that again, because nobody\n\n1:13:40.040 --> 1:13:45.720\n asks me that question, and it's central to my project.\n\n1:13:46.280 --> 1:13:50.280\n So Jacques was a huge influence, is a huge influence on me.\n\n1:13:51.400 --> 1:13:53.000\n He taught me a lot.\n\n1:13:54.760 --> 1:13:59.880\n He gave me access to some of his information that he keeps.\n\n1:14:00.920 --> 1:14:04.520\n But a lot of his information is actually there out there for everyone to read.\n\n1:14:04.520 --> 1:14:11.080\n He has an academia.edu page, so he didn't have this, unfortunately, when I was doing\n\n1:14:11.080 --> 1:14:13.640\n my research in 2012 and 2013.\n\n1:14:13.640 --> 1:14:16.600\n So I had to go back and do microfiche type stuff.\n\n1:14:16.600 --> 1:14:20.200\n What I did was I began to read everything that he wrote, and he actually gave me a lot\n\n1:14:20.200 --> 1:14:21.240\n of his books too.\n\n1:14:21.240 --> 1:14:26.200\n And he told me, I remember, he dropped me off from, this is actually quite interesting\n\n1:14:26.200 --> 1:14:31.720\n if you'll allow me to tell you a little story, and it also includes ayahuasca.\n\n1:14:31.720 --> 1:14:35.560\n SIMON Great, every story that includes ayahuasca\n\n1:14:35.560 --> 1:14:36.280\n is a great story.\n\n1:14:36.280 --> 1:14:39.800\n KATE Okay, so I was at a conference, and it was\n\n1:14:39.800 --> 1:14:45.240\n a small conference of very interesting people in California, on the Pacific Ocean.\n\n1:14:45.240 --> 1:14:46.680\n And Jacques was there.\n\n1:14:46.680 --> 1:14:49.160\n And this actually opens my book.\n\n1:14:49.160 --> 1:14:53.480\n This is the, I go, it's the preface to my book.\n\n1:14:53.480 --> 1:14:54.760\n I go on this ride.\n\n1:14:54.760 --> 1:14:56.120\n He takes me through Silicon Valley.\n\n1:14:56.760 --> 1:14:58.520\n I've lived there, right?\n\n1:14:58.520 --> 1:15:03.000\n My grandparents grew up in the same place that he raised his children, in Belmont.\n\n1:15:03.000 --> 1:15:09.080\n And so, but we were there with Robbie Graham, who's a great ufologist in his own right,\n\n1:15:09.080 --> 1:15:11.560\n and film theorist.\n\n1:15:12.120 --> 1:15:13.560\n I highly recommend his work.\n\n1:15:14.520 --> 1:15:18.360\n So we were together, and he was taking us to San Francisco, where I was going to meet\n\n1:15:18.360 --> 1:15:20.680\n my brother, who was going to take me home.\n\n1:15:20.680 --> 1:15:24.360\n And so he took us on this long journey, and he talked to us.\n\n1:15:24.360 --> 1:15:29.880\n And as we got out of the car, he gave me several of his books.\n\n1:15:29.880 --> 1:15:33.080\n And one in particular he gave me, and he said, read this first.\n\n1:15:34.360 --> 1:15:37.160\n And I was like, okay, I definitely will read that first.\n\n1:15:37.160 --> 1:15:39.480\n Okay, so this is how the ayahuasca figures in.\n\n1:15:39.480 --> 1:15:43.160\n So we were, I didn't take it, nor have I taken it.\n\n1:15:43.160 --> 1:15:49.560\n Okay, so we were at this place in California, and Alex Gray and his wife were there.\n\n1:15:49.560 --> 1:15:53.720\n And they were talking about their experiences with psychedelics.\n\n1:15:53.720 --> 1:15:56.600\n He's an amazing visionary artist, okay?\n\n1:15:56.600 --> 1:16:01.480\n So he believes that there's a place that you can enter, and he and his wife would enter\n\n1:16:01.480 --> 1:16:06.760\n this space with either ayahuasca or LSD or something like that.\n\n1:16:06.760 --> 1:16:11.560\n And they would not talk to each other, but they would be having the same exact experience.\n\n1:16:11.560 --> 1:16:14.920\n So it was almost like having the same dream, right?\n\n1:16:14.920 --> 1:16:23.480\n Okay, so somehow that whole event with Jacques there, and them talking about their experiences\n\n1:16:23.480 --> 1:16:27.960\n in these realms, of which religious studies people are quite familiar, by the way, because\n\n1:16:27.960 --> 1:16:30.680\n visionary experiences are what we study.\n\n1:16:30.680 --> 1:16:36.280\n So all of this seems super familiar to me, and I recognized that immediately that Jacques,\n\n1:16:38.200 --> 1:16:46.600\n that it hit me like, you know, very obvious that UFOs and these experiences and technology\n\n1:16:46.600 --> 1:16:50.600\n all seemed, they were all meshed together.\n\n1:16:50.600 --> 1:16:54.360\n And I knew that I had to take them, I knew I had to read everything Jacques ever wrote.\n\n1:16:54.360 --> 1:16:59.240\n And the best stuff he's written, by the way, is his little essays that he wrote in the\n\n1:16:59.240 --> 1:17:04.440\n 1970s, and they were peer reviewed essays about the beginning of the internet and how a lot\n\n1:17:04.440 --> 1:17:13.960\n of it was based on basically neural connection with the internet, like somehow psychic connection\n\n1:17:13.960 --> 1:17:15.800\n through the internet with others and things like that.\n\n1:17:15.800 --> 1:17:21.000\n So the brain is a biological neural network, there's this connection between visual neurons\n\n1:17:21.000 --> 1:17:26.680\n and so on, and that's what ultimately is able to have memories and has cognitive ability\n\n1:17:26.680 --> 1:17:31.400\n and is able to perceive the world and generate ideas.\n\n1:17:31.400 --> 1:17:37.320\n And those ideas are then spread on the internet, even from the very early days to other humans.\n\n1:17:37.320 --> 1:17:42.840\n So it gets injected or travels into the brains of other humans and that goes around in there\n\n1:17:42.840 --> 1:17:45.880\n and then spits out other stuff and it goes back and forth.\n\n1:17:45.880 --> 1:17:53.640\n So it's nice to think of the network that's in our mind, individual mind as, I mean, very\n\n1:17:53.640 --> 1:17:59.160\n much even deeply connected to the network that is the connection between humans through\n\n1:17:59.160 --> 1:18:00.200\n the internet.\n\n1:18:00.200 --> 1:18:09.640\n And so in that sense, Jacques saw the internet as this powerful, as a source of power and\n\n1:18:09.640 --> 1:18:11.400\n wisdom that is beyond our own.\n\n1:18:11.400 --> 1:18:17.240\n Exactly, that's external to us, like if you could call it autonomous AI, right?\n\n1:18:17.240 --> 1:18:21.400\n It's nonhuman intelligence in a sense, even though humans are a part of it.\n\n1:18:21.400 --> 1:18:24.600\n Yes, or we're invaded by it or whatever you want to call it.\n\n1:18:24.600 --> 1:18:28.040\n Yeah, whoever, right, it's the chicken and the egg, right.\n\n1:18:28.040 --> 1:18:33.480\n So if I can go on, I don't want to experience things, I'm not done with that.\n\n1:18:33.480 --> 1:18:41.880\n So this is where I come to this idea that we're in this space, we're in now a new space\n\n1:18:41.880 --> 1:18:43.560\n of religion, of religiosity.\n\n1:18:43.560 --> 1:18:48.200\n So what happens is then, and it's like a biosphere and I'll talk about that in a minute.\n\n1:18:48.200 --> 1:18:55.800\n So Jacques takes us back, we get to San Francisco and my brother, who is your straight lace\n\n1:18:55.800 --> 1:19:00.360\n person, army guy and everything like that, I get into his car and the first thing he\n\n1:19:00.360 --> 1:19:04.600\n tells me is, I took ayahuasca and I was like, what?\n\n1:19:04.600 --> 1:19:06.840\n And he goes, it's going to save humanity.\n\n1:19:06.840 --> 1:19:07.880\n That's great.\n\n1:19:07.880 --> 1:19:14.360\n As I mentioned to you offline, I talked to Matthew Johnson, he's a Hopkins professor\n\n1:19:14.360 --> 1:19:22.440\n and he's really a scholar of most, he's studied most drugs, he's also really deeply studied\n\n1:19:22.440 --> 1:19:28.320\n cocaine and all those stuff and negative effects and he's focused on a lot of positive effects\n\n1:19:28.320 --> 1:19:29.560\n of the different psychedelics.\n\n1:19:29.560 --> 1:19:31.000\n It's kind of fascinating.\n\n1:19:31.000 --> 1:19:41.200\n So I'm very much interested in exploring the science of what these things do to the human\n\n1:19:41.200 --> 1:19:43.880\n mind and also personally exploring it.\n\n1:19:43.880 --> 1:19:50.480\n Although it's like this weird gray area, which he's masterful at, which is he's a professor\n\n1:19:50.480 --> 1:19:55.920\n at John Hopkins, one of the most prestigious universities in the world and doing large\n\n1:19:55.920 --> 1:20:03.360\n scale studies of this stuff and until he got a lot of money for these studies, even in\n\n1:20:03.360 --> 1:20:05.520\n Hopkins itself, there's not much respect.\n\n1:20:05.520 --> 1:20:12.600\n It's not even respect, it was like people just didn't want to talk about it as a legitimate\n\n1:20:12.600 --> 1:20:13.600\n field of inquiry.\n\n1:20:13.600 --> 1:20:21.800\n It's kind of fascinating how hesitant we are as a little human civilization to legitimize\n\n1:20:21.800 --> 1:20:27.360\n the exploration of the mysterious, of whatever the definition of the mysterious is for that\n\n1:20:27.360 --> 1:20:29.160\n particular period of time.\n\n1:20:29.160 --> 1:20:32.360\n So for us now, there's like little groups of things.\n\n1:20:32.360 --> 1:20:37.880\n I would say consciousness in the space of computer science research is something that's\n\n1:20:37.880 --> 1:20:43.600\n still like, I don't know, maybe let philosophers kick it around for a little longer.\n\n1:20:43.600 --> 1:20:55.200\n And then certainly extraterrestrial life forms in most formulations of that problem space\n\n1:20:55.200 --> 1:21:01.080\n is still the other, it's still the source of the mysterious, except maybe like SETI,\n\n1:21:01.080 --> 1:21:06.320\n which is like, how can we detect signals from far away alien intelligences that we'll be\n\n1:21:06.320 --> 1:21:10.960\n able to perceive?\n\n1:21:10.960 --> 1:21:15.440\n And psychedelics is another one of those that's like, we're starting to see, okay, well, can\n\n1:21:15.440 --> 1:21:22.360\n we try to see if there's some medical applications of like helping you get, like he does studies\n\n1:21:22.360 --> 1:21:27.600\n of help you quit smoking or help you in some kind of treatment of some disease.\n\n1:21:27.600 --> 1:21:32.360\n And he's sneaking into that, I mean, it's like openly sneaking into it, he's doing studies\n\n1:21:32.360 --> 1:21:40.160\n on it of like, how can you expand the mind with these tools and what can the mind discover\n\n1:21:40.160 --> 1:21:42.480\n through psychedelics and so on.\n\n1:21:42.480 --> 1:21:47.680\n And we're like slowly creeping into the space of being able to explore these mysterious\n\n1:21:47.680 --> 1:21:48.680\n questions.\n\n1:21:48.680 --> 1:21:55.200\n But it's like, it sucks that sometimes a lot of people have to die, meaning, sorry, they\n\n1:21:55.200 --> 1:21:58.120\n have to age out.\n\n1:21:58.120 --> 1:22:06.320\n Like it's like faculty have, and people have a fixed set of ideas and they stick by them.\n\n1:22:06.320 --> 1:22:13.640\n In order for new ideas to come in, then the young folks have to be born with an open mind,\n\n1:22:13.640 --> 1:22:18.280\n the possibility of those ideas, and then they have to become old enough and get A's in school\n\n1:22:18.280 --> 1:22:21.800\n and whatever to then carry those ideas forward.\n\n1:22:21.800 --> 1:22:27.360\n So the acceptance of the exploration of the mysterious takes time.\n\n1:22:27.360 --> 1:22:28.360\n It's kind of sad.\n\n1:22:28.360 --> 1:22:30.040\n It is sad.\n\n1:22:30.040 --> 1:22:31.580\n I agree.\n\n1:22:31.580 --> 1:22:38.280\n Maybe to go into my source of passion, which is artificial intelligence.\n\n1:22:38.280 --> 1:22:48.520\n What's your sense about the possibility, like Pamela McCordick has this quote that I like,\n\n1:22:48.520 --> 1:22:57.280\n I talked to her a couple of years ago, I guess already on this podcast, that artificial intelligence\n\n1:22:57.280 --> 1:23:00.580\n began with the ancient wish to forge the gods.\n\n1:23:00.580 --> 1:23:14.080\n So do you think artificial intelligence may become the very kind of gods that were at\n\n1:23:14.080 --> 1:23:17.320\n the center of our, the religions of most of our history?\n\n1:23:17.320 --> 1:23:19.680\n Yeah, there's a lot there.\n\n1:23:19.680 --> 1:23:26.640\n So I'm going to start by addressing this idea of artificial intelligence being separate\n\n1:23:26.640 --> 1:23:27.960\n from human beings.\n\n1:23:27.960 --> 1:23:34.680\n So I don't think that's actually, that might happen.\n\n1:23:34.680 --> 1:23:36.960\n I mean, it's already happened, but let's put it this way.\n\n1:23:36.960 --> 1:23:42.320\n You're talking about super artificial intelligence, like autonomous, conscious artificial intelligence?\n\n1:23:42.320 --> 1:23:43.320\n Yes.\n\n1:23:43.320 --> 1:23:44.320\n Okay, yeah.\n\n1:23:44.320 --> 1:23:45.320\n Something with artificial consciousness.\n\n1:23:45.320 --> 1:23:52.960\n First of all, I think she's correct, but also there's an awesome quote.\n\n1:23:52.960 --> 1:24:00.640\n I'd also like to bring up this writer of fiction, actually, Ted Chiang, and one of his essays,\n\n1:24:00.640 --> 1:24:01.840\n he writes short essays.\n\n1:24:01.840 --> 1:24:06.160\n One of them was The Basis for the Movie Arrival, which if you haven't seen it, it's a really\n\n1:24:06.160 --> 1:24:15.380\n great movie about UFOs, and it has a very creative way of proposing an idea of how they\n\n1:24:15.380 --> 1:24:20.900\n might be able to communicate, first of all, how they appear to us, and second of all,\n\n1:24:20.900 --> 1:24:24.200\n how they may be communicating with us humans.\n\n1:24:24.200 --> 1:24:25.200\n Exactly.\n\n1:24:25.200 --> 1:24:32.200\n The author Ted Chiang has a lot, I recommend his writings, his short stories.\n\n1:24:32.200 --> 1:24:40.360\n One is very short, and it appeared in Nature about 20 years ago, and it is called, I think\n\n1:24:40.360 --> 1:24:45.480\n it's called Eating the Crumbs from the Table or something like that, and it's basically\n\n1:24:45.480 --> 1:24:52.280\n this short essay, and I hate to do a spoiler here, but if you don't want to know what it's\n\n1:24:52.280 --> 1:24:54.240\n about, don't listen right now for five minutes.\n\n1:24:54.240 --> 1:24:55.240\n Yeah, spoiler alert.\n\n1:24:55.240 --> 1:24:56.240\n Yeah.\n\n1:24:56.240 --> 1:24:57.240\n Okay.\n\n1:24:57.240 --> 1:24:58.240\n So this is what it's about.\n\n1:24:58.240 --> 1:25:03.760\n So basically it's about human beings becoming two different species, okay?\n\n1:25:03.760 --> 1:25:09.240\n And one of them is created, they're called metahumans, and they start biohacking themselves\n\n1:25:09.240 --> 1:25:10.240\n with tech.\n\n1:25:10.240 --> 1:25:11.240\n Okay?\n\n1:25:11.240 --> 1:25:12.240\n Sound familiar?\n\n1:25:12.240 --> 1:25:19.120\n So they do this, and they become metahumans and another species, right, and just kind\n\n1:25:19.120 --> 1:25:28.120\n of another fork, such that humans can barely understand them because they're so far removed.\n\n1:25:28.120 --> 1:25:32.040\n So in a sense, are they gods, right?\n\n1:25:32.040 --> 1:25:35.440\n No, they're metahumans, they're superhumans, they're enhanced humans, okay?\n\n1:25:35.440 --> 1:25:38.360\n I see that hopefully on the horizon, frankly.\n\n1:25:38.360 --> 1:25:39.580\n I hope so.\n\n1:25:39.580 --> 1:25:46.260\n Not that we have two species, but that we can use our technology or we can become so\n\n1:25:46.260 --> 1:25:50.160\n integrated with our technology that we can survive, okay?\n\n1:25:50.160 --> 1:25:53.040\n We can survive the radiation in space.\n\n1:25:53.040 --> 1:25:56.080\n We can't go places now because of the radiation in space.\n\n1:25:56.080 --> 1:26:01.120\n Perhaps we can develop our bodies such that we can survive the radiation in space.\n\n1:26:01.120 --> 1:26:03.240\n So there's this idea of these metahumans.\n\n1:26:03.240 --> 1:26:09.400\n Now, there's also this idea that technology is just another form of humans.\n\n1:26:09.400 --> 1:26:11.000\n We've created it, right?\n\n1:26:11.000 --> 1:26:18.140\n And so maybe it is bent on surviving, thereby using us kind of as a meme or a team.\n\n1:26:18.140 --> 1:26:23.480\n Some people are calling them teams now, these self generating, they're replicating themselves\n\n1:26:23.480 --> 1:26:24.960\n through us, okay?\n\n1:26:24.960 --> 1:26:29.160\n I see that also, and I don't think that's terribly bad.\n\n1:26:29.160 --> 1:26:32.100\n Maybe it's just the way that we are evolving.\n\n1:26:32.100 --> 1:26:37.600\n It doesn't mean that we're evolving all the time, like we're taller than we used to be,\n\n1:26:37.600 --> 1:26:40.700\n we have different skills.\n\n1:26:40.700 --> 1:26:43.340\n So I don't see that as a bad thing.\n\n1:26:43.340 --> 1:26:47.600\n I think a lot of people see it as if we're not how we are now, it's a tragedy.\n\n1:26:47.600 --> 1:26:48.700\n But it's not a tragedy.\n\n1:26:48.700 --> 1:26:51.440\n How we are now is actually a tragedy for most people alive.\n\n1:26:51.440 --> 1:26:54.760\n Yeah, and we might be evolving in ways we can't possibly perceive.\n\n1:26:54.760 --> 1:27:02.960\n Like you said, that humans have created Twitter and Twitter may be changing us in ways that\n\n1:27:02.960 --> 1:27:06.320\n we can't even understand now, currently.\n\n1:27:06.320 --> 1:27:10.240\n From a perspective, if you look at the entirety of the network of Twitter, that might be an\n\n1:27:10.240 --> 1:27:20.560\n organism that the organism understands what's happening from its level of perception.\n\n1:27:20.560 --> 1:27:25.680\n But we humans are just like the cells of the human body, we're interacting individually,\n\n1:27:25.680 --> 1:27:29.280\n but we're not actually aware of the big picture that's happening.\n\n1:27:29.280 --> 1:27:33.680\n And we naturally somehow, or whatever the force that's creating the entirety of this,\n\n1:27:33.680 --> 1:27:42.040\n whatever one version of it is the evolutionary process, like biological evolution, whatever\n\n1:27:42.040 --> 1:27:46.440\n force that is, is just creating these greater and greater level of complexity, and maybe\n\n1:27:46.440 --> 1:27:55.000\n somehow not other kinds of non human intelligence are involved that we're calling alien intelligences.\n\n1:27:55.000 --> 1:28:01.320\n So just to step back, and we'll come back to AI, because I love the topic, but through\n\n1:28:01.320 --> 1:28:05.680\n American Cosmic and in general, you've interacted with much of the UFO community, you mentioned\n\n1:28:05.680 --> 1:28:06.680\n ufologists.\n\n1:28:06.680 --> 1:28:12.680\n By the way, is it ufologists or is it ufologists?\n\n1:28:12.680 --> 1:28:13.680\n It's ufologists.\n\n1:28:13.680 --> 1:28:14.680\n Ufologists.\n\n1:28:14.680 --> 1:28:15.680\n Yeah.\n\n1:28:15.680 --> 1:28:17.700\n So first of all, what is a ufologist?\n\n1:28:17.700 --> 1:28:23.840\n And second of all, what have you learned about this community of ufologists?\n\n1:28:23.840 --> 1:28:30.880\n Or also as you refer to them as the invisibles, or the members of the invisible college, or\n\n1:28:30.880 --> 1:28:35.280\n just in general, people who study UFOs from the different, all the different kinds of\n\n1:28:35.280 --> 1:28:36.880\n groups that study UFOs?\n\n1:28:36.880 --> 1:28:37.880\n Sure.\n\n1:28:37.880 --> 1:28:43.600\n Generally, what I found is that they are okay, so people who are interested in UFOs from\n\n1:28:43.600 --> 1:28:48.440\n like being a kid, you know, and seeing some cool movie like Star Wars or something, and\n\n1:28:48.440 --> 1:28:54.760\n then they become interested, and then they study it as best they can, UFOs, or UAPs.\n\n1:28:54.760 --> 1:29:00.800\n They're generally an honest group of people who are using their tools, and they're generally\n\n1:29:00.800 --> 1:29:03.360\n two types of them.\n\n1:29:03.360 --> 1:29:06.880\n There are those who believe in the nuts and bolts, like the physical craft, and they believe\n\n1:29:06.880 --> 1:29:10.400\n in that these are things from other planets, okay?\n\n1:29:10.400 --> 1:29:15.800\n So that's like the ETH hypothesis, you know.\n\n1:29:15.800 --> 1:29:19.480\n I'm sorry, ETH hypothesis, ETH is what we call it.\n\n1:29:19.480 --> 1:29:20.480\n Yeah.\n\n1:29:20.480 --> 1:29:21.480\n Sorry about that.\n\n1:29:21.480 --> 1:29:26.840\n So this is like there's an actual spaceship, like something akin, but much more advanced\n\n1:29:26.840 --> 1:29:29.200\n than the rockets we use now.\n\n1:29:29.200 --> 1:29:35.240\n And there's some kind of, not necessarily biological, but something like biological\n\n1:29:35.240 --> 1:29:37.680\n organisms that travel on these spaceships.\n\n1:29:37.680 --> 1:29:38.680\n Yes.\n\n1:29:38.680 --> 1:29:43.960\n So this would be like what, to the Star Academy, is trying to decipher, like how, you know,\n\n1:29:43.960 --> 1:29:44.960\n how do they do it?\n\n1:29:44.960 --> 1:29:48.760\n You know, maybe we could use that technology, the propulsion and things like that.\n\n1:29:48.760 --> 1:29:50.280\n They look at the rocket technology.\n\n1:29:50.280 --> 1:29:54.840\n Okay, so there are those, and then there are people who believe that it's more consciousness\n\n1:29:54.840 --> 1:29:55.840\n based, okay?\n\n1:29:55.840 --> 1:30:01.880\n So these are your two types of ufologists who are known, and these are people who we\n\n1:30:01.880 --> 1:30:02.980\n know about.\n\n1:30:02.980 --> 1:30:08.400\n Then I found that there are people who are, quote, unquote, I call them the invisibles,\n\n1:30:08.400 --> 1:30:13.920\n because Jacques Vallée in the 70s, he and I think actually Allen Hynek, his colleague\n\n1:30:13.920 --> 1:30:19.160\n quoted, this is a Francis Bacon thing, by the way, it goes back to the early modern\n\n1:30:19.160 --> 1:30:24.920\n time period when scientists could be killed for basically trying to go outside with the\n\n1:30:24.920 --> 1:30:29.800\n church or the government institution determined was dogma.\n\n1:30:29.800 --> 1:30:31.240\n And so they had to be really careful.\n\n1:30:31.240 --> 1:30:33.680\n So he called it the invisible college.\n\n1:30:33.680 --> 1:30:39.920\n So Hynek took that term and reused it, or what do you call it, repurposed it.\n\n1:30:39.920 --> 1:30:41.080\n So he repurposed it.\n\n1:30:41.080 --> 1:30:44.360\n So they were still talking to each other, though.\n\n1:30:44.360 --> 1:30:48.920\n So what I found to be the case was that there was a group of people who were scientists\n\n1:30:48.920 --> 1:30:51.380\n but were not on the internet.\n\n1:30:51.380 --> 1:30:57.280\n You know, people today, and students of mine in particular, and my own kids, actually,\n\n1:30:57.280 --> 1:31:01.260\n they think that you only exist if you're on the internet or something only exists if it's\n\n1:31:01.260 --> 1:31:02.260\n on the internet.\n\n1:31:02.260 --> 1:31:04.040\n And that's, of course, untrue.\n\n1:31:04.040 --> 1:31:08.480\n And so what I found was that most people who are the most powerful people of our society\n\n1:31:08.480 --> 1:31:10.800\n and are doing things are not on the internet.\n\n1:31:10.800 --> 1:31:12.720\n You're not going to find any trace of them.\n\n1:31:12.720 --> 1:31:18.960\n So a lot of these people are what I call invisibles, people who are studying, at least their work\n\n1:31:18.960 --> 1:31:19.960\n is invisible.\n\n1:31:19.960 --> 1:31:22.560\n You might find them on the internet, but you're going to find that they're part of the bowling\n\n1:31:22.560 --> 1:31:24.000\n league or something like that.\n\n1:31:24.000 --> 1:31:30.080\n You will not find that they are actually engaged in research about this topic.\n\n1:31:30.080 --> 1:31:33.560\n And so I called them the invisibles because I was surprised to find them.\n\n1:31:33.560 --> 1:31:37.320\n And I thought, well, this is no longer the invisible college because these people are\n\n1:31:37.320 --> 1:31:39.040\n not even talking to each other.\n\n1:31:39.040 --> 1:31:42.800\n And that's why I reference this movie Fight Club.\n\n1:31:42.800 --> 1:31:49.480\n In it, you have an invisible, and his name is Tyler Durden, and he's incredible.\n\n1:31:49.480 --> 1:31:52.280\n He does incredible things.\n\n1:31:52.280 --> 1:31:58.380\n He's like a person who should not exist because he does so many things that are amazing.\n\n1:31:58.380 --> 1:32:02.160\n And so I found a person like that, and he's a real person.\n\n1:32:02.160 --> 1:32:07.280\n He's partially on the internet, but nothing that he does around that topic of UFOs is\n\n1:32:07.280 --> 1:32:08.280\n on the internet.\n\n1:32:08.280 --> 1:32:11.680\n So I decided to call him Tyler D after Tyler Durden.\n\n1:32:11.680 --> 1:32:17.640\n And so these people, I've termed the UFO Fight Club because they work together, but they\n\n1:32:17.640 --> 1:32:20.880\n don't know, in fact, his boss doesn't know what he does.\n\n1:32:20.880 --> 1:32:25.080\n They don't talk to each other because, you know, the first rule of Fight Club.\n\n1:32:25.080 --> 1:32:26.080\n Same as the second, yeah.\n\n1:32:26.080 --> 1:32:27.080\n Exactly, yeah.\n\n1:32:27.080 --> 1:32:28.080\n You don't talk about people.\n\n1:32:28.080 --> 1:32:30.000\n No, you don't do it.\n\n1:32:30.000 --> 1:32:36.560\n Why do you have a sense that there's such a, I don't want to say fear, but a principle\n\n1:32:36.560 --> 1:32:39.080\n of staying out of the limelight?\n\n1:32:39.080 --> 1:32:44.880\n I think there's something real, and I think that the use of it could be dangerous for\n\n1:32:44.880 --> 1:32:45.880\n people.\n\n1:32:45.880 --> 1:32:50.920\n Oh, sorry, you mean like something real, like there's actual, I don't know, what's the\n\n1:32:50.920 --> 1:32:53.440\n right terminology here to use it?\n\n1:32:53.440 --> 1:33:02.060\n Alien technology, ideas about technology that are being explored that are dangerous have\n\n1:33:02.060 --> 1:33:05.760\n made public, that may become dangerous have made public.\n\n1:33:05.760 --> 1:33:06.920\n So that's the word.\n\n1:33:06.920 --> 1:33:09.120\n You don't have to call it alien technology.\n\n1:33:09.120 --> 1:33:13.840\n You can call it ideas about alien technology because I don't know if it's actual alien\n\n1:33:13.840 --> 1:33:14.840\n technology or not.\n\n1:33:14.840 --> 1:33:16.040\n I honestly don't know.\n\n1:33:16.040 --> 1:33:24.760\n But I do know for a fact, because it's a historical fact, that Jack Parsons and Konstantin Tchaikovsky,\n\n1:33:24.760 --> 1:33:29.860\n who's Russian, believed in these things and believed that they were downloading this information.\n\n1:33:29.860 --> 1:33:34.400\n Whether or not they were, I don't, I mean, they definitely created the rocket technologies.\n\n1:33:34.400 --> 1:33:36.060\n That's true.\n\n1:33:36.060 --> 1:33:41.280\n How they did and whether their process was exactly what they said it was, I don't know.\n\n1:33:41.280 --> 1:33:42.640\n So this is the same thing today.\n\n1:33:42.640 --> 1:33:46.040\n So we've got some powerful technologies going on here.\n\n1:33:46.040 --> 1:33:50.720\n And of course we have a military and we have a military for a reason.\n\n1:33:50.720 --> 1:33:53.200\n Almost every government who needs a military has one.\n\n1:33:53.200 --> 1:33:59.720\n And so they're going to keep these the way they should be kept, in my interpretation.\n\n1:33:59.720 --> 1:34:01.640\n I mean, think about it.\n\n1:34:01.640 --> 1:34:03.800\n Everybody accepts the fact that we have a military.\n\n1:34:03.800 --> 1:34:04.800\n Almost everybody does.\n\n1:34:04.800 --> 1:34:08.880\n Why are they so upset then that the military keeps secrets?\n\n1:34:08.880 --> 1:34:09.880\n Yeah.\n\n1:34:09.880 --> 1:34:11.200\n Well, that's the nature of things.\n\n1:34:11.200 --> 1:34:13.880\n We can get into that whole thing.\n\n1:34:13.880 --> 1:34:22.760\n I tend to, I've spoken with the CTO Lockheed Martin on this, I obviously read and think\n\n1:34:22.760 --> 1:34:23.760\n about war a lot.\n\n1:34:23.760 --> 1:34:29.980\n It's such a difficult question because this space, this particular space of technology,\n\n1:34:29.980 --> 1:34:34.600\n there's a gray area that I think is evolving over time.\n\n1:34:34.600 --> 1:34:40.480\n I think nuclear weapons change the game in terms of what should and shouldn't be secret.\n\n1:34:40.480 --> 1:34:45.920\n I think there's already technology that will enable us to destroy each other.\n\n1:34:45.920 --> 1:34:49.680\n And so there's some sense in which some technology should be made public.\n\n1:34:49.680 --> 1:34:56.280\n This is the same discussion of, you know, between companies, which part of your technology\n\n1:34:56.280 --> 1:35:01.440\n should you make public through like, for example, academic publications and all that kind of\n\n1:35:01.440 --> 1:35:02.440\n stuff.\n\n1:35:02.440 --> 1:35:07.640\n Like how the Google search engine works, PageRank algorithm, or how the different deep learning,\n\n1:35:07.640 --> 1:35:12.660\n like there's pretty vibrant machine learning research communities within Google, Facebook\n\n1:35:12.660 --> 1:35:13.720\n and so on.\n\n1:35:13.720 --> 1:35:16.080\n And they release a lot of different ideas.\n\n1:35:16.080 --> 1:35:20.960\n It's an interesting question, like how dangerous is it to release some of the ideas?\n\n1:35:20.960 --> 1:35:24.440\n I think it's a gray area that's constantly changing.\n\n1:35:24.440 --> 1:35:27.440\n I do also think it's super interesting.\n\n1:35:27.440 --> 1:35:35.260\n I wonder if you could elaborate on a little bit that there's this gray area between what's\n\n1:35:35.260 --> 1:35:43.720\n actually real in terms of alien technology and the belief of it when held in the minds\n\n1:35:43.720 --> 1:35:49.720\n of really brilliant people that they ultimately may produce the same kind of result in terms\n\n1:35:49.720 --> 1:35:56.920\n of being able to create new technologies that are human usable.\n\n1:35:56.920 --> 1:36:08.920\n Like is there, in your mind, they're one in the same as like believing in alien craft\n\n1:36:08.920 --> 1:36:12.080\n and actually being in possession of an alien craft?\n\n1:36:12.080 --> 1:36:14.240\n I don't think they're the same, no.\n\n1:36:14.240 --> 1:36:17.800\n Belief is powerful, okay?\n\n1:36:17.800 --> 1:36:22.440\n In new age communities, you know, people think thoughts are things, okay?\n\n1:36:22.440 --> 1:36:24.280\n That's been said, you know, thoughts are things.\n\n1:36:24.280 --> 1:36:27.080\n You can make them happen kind of thing, believe in them enough.\n\n1:36:27.080 --> 1:36:34.920\n It is true that if I believe I can run a 540 mile, I'll do it, okay, and I probably will\n\n1:36:34.920 --> 1:36:35.920\n do it.\n\n1:36:35.920 --> 1:36:41.040\n And I've done it before actually, much younger, but I did it.\n\n1:36:41.040 --> 1:36:44.240\n But my coach is the one that instilled that belief in me, right?\n\n1:36:44.240 --> 1:36:48.240\n And so, but can I run like a one minute mile?\n\n1:36:48.240 --> 1:36:49.240\n No.\n\n1:36:49.240 --> 1:36:50.240\n Okay.\n\n1:36:50.240 --> 1:36:51.720\n So I guess, does that answer your question?\n\n1:36:51.720 --> 1:36:55.480\n Like there's only so far belief goes in generating reality.\n\n1:36:55.480 --> 1:36:56.480\n Well, yeah.\n\n1:36:56.480 --> 1:37:04.080\n I mean, I guess that's what, just having listened to Jacques Vallée, it seemed like reality\n\n1:37:04.080 --> 1:37:10.880\n is not, was not as important for the scientific exploration of the concept of alien technology.\n\n1:37:10.880 --> 1:37:13.880\n I could be wrong, but this is what I think Jacques getting at.\n\n1:37:13.880 --> 1:37:20.960\n There are other ways to access places in reality other than what we consider to be physical.\n\n1:37:20.960 --> 1:37:23.720\n There's consciousness, okay?\n\n1:37:23.720 --> 1:37:30.760\n So like I said, so religious studies is, among other things, it's looking at visionary experiences,\n\n1:37:30.760 --> 1:37:31.760\n all right?\n\n1:37:31.760 --> 1:37:33.400\n So people do have visionary experiences.\n\n1:37:33.400 --> 1:37:39.440\n They did without drugs, they did with drugs, they do with drugs, they do, many have them\n\n1:37:39.440 --> 1:37:40.960\n without drugs today.\n\n1:37:40.960 --> 1:37:46.540\n And oftentimes those visionary experiences correspond to each other.\n\n1:37:46.540 --> 1:37:48.880\n Now how do we make sense of that?\n\n1:37:48.880 --> 1:37:52.080\n So do these places actually exist?\n\n1:37:52.080 --> 1:37:54.080\n In a sense, I think they do.\n\n1:37:54.080 --> 1:37:59.880\n And so I think that, let's take that very famous case of a Virgin Mary apparition in\n\n1:37:59.880 --> 1:38:04.520\n Fatima where I think there was like a lot of people, thousands and thousands, if not\n\n1:38:04.520 --> 1:38:10.640\n like I think 50,000 or something like that, a lot of people gathered to see what's now\n\n1:38:10.640 --> 1:38:14.840\n called the miracle of Fatima, which was the spinning of the sun.\n\n1:38:14.840 --> 1:38:20.280\n Well, a lot of people saw different things, but they all saw some kind of thing, okay?\n\n1:38:20.280 --> 1:38:25.920\n So they all saw different things, but it was, something happened, okay?\n\n1:38:25.920 --> 1:38:36.280\n So I guess the question is, what are these places where we access what I'd call like\n\n1:38:36.280 --> 1:38:38.680\n nonphysical realities, okay?\n\n1:38:38.680 --> 1:38:42.480\n Where we actually do get information, like who could say that Jack Parsons didn't get\n\n1:38:42.480 --> 1:38:45.400\n information from doing these rituals and accessing these?\n\n1:38:45.400 --> 1:38:50.260\n We have to say that he actually did because we see the results, the physical results.\n\n1:38:50.260 --> 1:38:55.840\n The same thing with Tyler, and that's why I put Tyler in this camp with this tradition\n\n1:38:55.840 --> 1:38:56.880\n with Jack Parsons.\n\n1:38:56.880 --> 1:39:03.600\n I say that Tyler is getting these, what he calls downloads, and you can see the results\n\n1:39:03.600 --> 1:39:05.640\n of them physically.\n\n1:39:05.640 --> 1:39:06.640\n He sells them on the Nasdaq.\n\n1:39:06.640 --> 1:39:08.580\n He makes millions of dollars from them.\n\n1:39:08.580 --> 1:39:09.720\n They help people.\n\n1:39:09.720 --> 1:39:14.280\n I've seen people who they've helped, okay?\n\n1:39:14.280 --> 1:39:22.960\n Do you think psychedelics that I just mentioned earlier have a possibility of going to these\n\n1:39:22.960 --> 1:39:34.160\n kind of, same kind of places of exploring ideas that are outside of our more commonplace\n\n1:39:34.160 --> 1:39:37.160\n understanding of the world?\n\n1:39:37.160 --> 1:39:41.440\n In my, yeah, I think so, absolutely, however, I think we have to be really careful about\n\n1:39:41.440 --> 1:39:48.280\n those because young people or people in general, I should say, absolutely can get hurt by them.\n\n1:39:48.280 --> 1:39:53.480\n I mean, but we get hurt by alcohol, you know, we drive our cars and we kill each other.\n\n1:39:53.480 --> 1:40:01.080\n But psychedelics are really interesting because I know that within the history of our country,\n\n1:40:01.080 --> 1:40:08.320\n we have used psychedelics in various capacities for our military in order to try to stimulate\n\n1:40:08.320 --> 1:40:13.800\n ideas and access places and information that can't be accessed normally.\n\n1:40:13.800 --> 1:40:14.800\n This is all fact.\n\n1:40:14.800 --> 1:40:15.800\n Yeah.\n\n1:40:15.800 --> 1:40:20.320\n I talked to Matt for like four hours, so we ran out of time being able to talk, but I\n\n1:40:20.320 --> 1:40:25.240\n wanted to talk to him about MK Alter and Ted Kaczynski.\n\n1:40:25.240 --> 1:40:27.200\n There's so many mysterious things there.\n\n1:40:27.200 --> 1:40:31.680\n There's like layers of what's known or what's not known, it's fascinating.\n\n1:40:31.680 --> 1:40:37.320\n But I think what is interesting is psychedelics were used or were attempted to be used as\n\n1:40:37.320 --> 1:40:40.020\n tools of different kinds.\n\n1:40:40.020 --> 1:40:41.020\n That's the point.\n\n1:40:41.020 --> 1:40:48.440\n So like we think of technology as tools to enable us to do things in that same way that\n\n1:40:48.440 --> 1:40:54.640\n psychedelics, like many drugs could be used as tools, some more effective than others.\n\n1:40:54.640 --> 1:40:55.640\n Absolutely.\n\n1:40:55.640 --> 1:41:03.080\n I'm not sure what you can do effectively with alcohol, although I think somebody commented\n\n1:41:03.080 --> 1:41:10.120\n somewhere on social media that, I don't know why everyone is so negative about alcohol\n\n1:41:10.120 --> 1:41:17.180\n because I think the person said that it's given me some of the most incredible, it enabled\n\n1:41:17.180 --> 1:41:23.320\n me to let go and have some of the most incredible experiences with friends in my life.\n\n1:41:23.320 --> 1:41:24.320\n And it's true.\n\n1:41:24.320 --> 1:41:28.080\n People sometimes say alcohol is dangerous, it can make you do horrible.\n\n1:41:28.080 --> 1:41:36.760\n But the reality is it's also a fascinating tool for letting go of trying to be somebody\n\n1:41:36.760 --> 1:41:41.520\n maybe that you're not and allowing you to be yourself fully in whatever crazy form that\n\n1:41:41.520 --> 1:41:46.680\n is and allow you to have really deep and interesting experiences with those you love.\n\n1:41:46.680 --> 1:41:53.600\n So yeah, even alcohol can be used as an effective tool for exploring experiences and becoming\n\n1:41:53.600 --> 1:41:57.720\n expanding your mind and becoming a better person.\n\n1:41:57.720 --> 1:42:02.840\n So what the hell was I talking about?\n\n1:42:02.840 --> 1:42:11.200\n So yes, so psychedelics and MK Ultra, is there something interesting to say in our historical\n\n1:42:11.200 --> 1:42:12.200\n use of psychedelics?\n\n1:42:12.200 --> 1:42:15.880\n I mean, think about it, when did we start doing that?\n\n1:42:15.880 --> 1:42:17.320\n When did we start using those?\n\n1:42:17.320 --> 1:42:18.320\n That's true.\n\n1:42:18.320 --> 1:42:20.440\n It's quite a long time ago, right?\n\n1:42:20.440 --> 1:42:26.720\n But okay, but true, but when did our government start experimenting with them with us?\n\n1:42:26.720 --> 1:42:28.480\n Our government is the United States government.\n\n1:42:28.480 --> 1:42:29.480\n Yeah.\n\n1:42:29.480 --> 1:42:30.480\n Okay.\n\n1:42:30.480 --> 1:42:33.680\n So that happened in around the 1950s.\n\n1:42:33.680 --> 1:42:42.480\n After quote unquote, the 1940s, where we have 47 and we have this Roswell type stuff going\n\n1:42:42.480 --> 1:42:45.500\n on, like crash sites and things like that.\n\n1:42:45.500 --> 1:42:50.640\n So I think that there might be a correlation there.\n\n1:42:50.640 --> 1:42:52.600\n I don't know what it is.\n\n1:42:52.600 --> 1:42:53.600\n But I do think...\n\n1:42:53.600 --> 1:42:54.600\n That's fascinating actually.\n\n1:42:54.600 --> 1:42:55.600\n Yeah.\n\n1:42:55.600 --> 1:42:59.480\n A lot of interesting things started around that time period.\n\n1:42:59.480 --> 1:43:04.960\n And so Aldous Huxley would say, we opened the doors of perception, okay, and what flew\n\n1:43:04.960 --> 1:43:05.960\n in.\n\n1:43:05.960 --> 1:43:10.800\n Oh man, that was beautifully put.\n\n1:43:10.800 --> 1:43:18.640\n It'd be interesting to get your opinions on certain more concrete sightings that are sort\n\n1:43:18.640 --> 1:43:26.240\n of monumental sightings with alien intelligences in the history, in the recent history that\n\n1:43:26.240 --> 1:43:32.560\n at least I'm aware of, I'm not very much aware of this history.\n\n1:43:32.560 --> 1:43:38.720\n But the most recent one, I've spoken with David Fravor on this podcast, I really like\n\n1:43:38.720 --> 1:43:39.720\n him as a person.\n\n1:43:39.720 --> 1:43:44.160\n He's a fun guy, but also he's gotten a chance to...\n\n1:43:44.160 --> 1:43:50.200\n He's described his account of having an experience with what he and others now term the TikTok\n\n1:43:50.200 --> 1:43:51.200\n UFO.\n\n1:43:51.200 --> 1:43:56.240\n What do you think of that particular sighting, which has captivated the imagination of many\n\n1:43:56.240 --> 1:44:01.520\n in particular because there's been videos released of it, of these UFOs.\n\n1:44:01.520 --> 1:44:09.200\n But I find the videos to be way too blurry and grainy to be of interest to me personally,\n\n1:44:09.200 --> 1:44:15.800\n to me the most fascinating thing is the first person account from David and others about\n\n1:44:15.800 --> 1:44:16.860\n that experience.\n\n1:44:16.860 --> 1:44:18.620\n But what are your thoughts?\n\n1:44:18.620 --> 1:44:24.700\n Those videos have been out for a while, actually much, I think in the mid 2000s they were out.\n\n1:44:24.700 --> 1:44:30.640\n But what you have is you have kind of like this corroboration from a group and also the\n\n1:44:30.640 --> 1:44:34.040\n New York Times involvement in 2017.\n\n1:44:34.040 --> 1:44:40.560\n My opinion about the TikToks is that first, I believe the people who have had the experiences,\n\n1:44:40.560 --> 1:44:45.680\n I know some of them, like some of the radar people and things like that, they'd saw them\n\n1:44:45.680 --> 1:44:46.680\n and they're not...\n\n1:44:46.680 --> 1:44:48.480\n I don't believe they're making it up, okay.\n\n1:44:48.480 --> 1:44:55.660\n I do think that this is being used as a spin, okay, and I'm just gonna say that.\n\n1:44:55.660 --> 1:44:59.680\n And the reason I think that is this is because at the time it was released, I was still in\n\n1:44:59.680 --> 1:45:04.240\n touch with many people who were among the UFO Fight Club.\n\n1:45:04.240 --> 1:45:07.220\n And so they had intimate knowledge of these things.\n\n1:45:07.220 --> 1:45:12.720\n And the first thing they said was, we have satellites that can read the news on your\n\n1:45:12.720 --> 1:45:14.560\n phone when you're reading it.\n\n1:45:14.560 --> 1:45:19.600\n So we've got better footage than this and this is not good footage at all.\n\n1:45:19.600 --> 1:45:24.000\n Therefore they believe that it was authentic footage that had been doctored up.\n\n1:45:24.000 --> 1:45:26.160\n Now, why?\n\n1:45:26.160 --> 1:45:29.060\n I don't know why.\n\n1:45:29.060 --> 1:45:31.280\n So I honestly don't know if it's accurate or not.\n\n1:45:31.280 --> 1:45:36.960\n I mean, I believe the people, absolutely, but was this something out there to fool these\n\n1:45:36.960 --> 1:45:37.960\n people?\n\n1:45:37.960 --> 1:45:38.960\n Perhaps.\n\n1:45:38.960 --> 1:45:39.960\n I don't know.\n\n1:45:39.960 --> 1:45:41.120\n Is it spun?\n\n1:45:41.120 --> 1:45:45.760\n The people who I know who are part of the UFO Fight Club believed it was real, okay,\n\n1:45:45.760 --> 1:45:48.480\n and said, this is badly done, but real.\n\n1:45:48.480 --> 1:45:49.480\n Okay.\n\n1:45:49.480 --> 1:45:50.480\n I see.\n\n1:45:50.480 --> 1:45:51.480\n But so there's some kind of...\n\n1:45:51.480 --> 1:45:55.920\n When you say spinning, there's some parties involved that are trying to leverage it from\n\n1:45:55.920 --> 1:45:56.920\n the...\n\n1:45:56.920 --> 1:45:58.200\n For funds, probably.\n\n1:45:58.200 --> 1:45:59.560\n For funds, for financial interests.\n\n1:45:59.560 --> 1:46:01.040\n Yeah, I think so.\n\n1:46:01.040 --> 1:46:11.240\n Nevertheless, it has inspired a conversation and just a lot of people in the world that\n\n1:46:11.240 --> 1:46:16.880\n there's something mysterious out there that we're not fully informed about.\n\n1:46:16.880 --> 1:46:20.560\n And I was certainly grateful that the New York Times ran the story right before my book\n\n1:46:20.560 --> 1:46:21.560\n came out.\n\n1:46:21.560 --> 1:46:27.120\n Well, see, but there's the financial interest that to me, as a person who doesn't give a\n\n1:46:27.120 --> 1:46:34.920\n damn about money, actually, I don't like money, except for when it's used in the context of\n\n1:46:34.920 --> 1:46:37.480\n a company to build cool things.\n\n1:46:37.480 --> 1:46:45.360\n But personally, I don't know, I find the financial interest side off putting, especially when\n\n1:46:45.360 --> 1:46:48.360\n we're talking about the exploration of some of the most...\n\n1:46:48.360 --> 1:46:51.440\n Money is a silly creation of human beings.\n\n1:46:51.440 --> 1:46:52.440\n I agree.\n\n1:46:52.440 --> 1:46:58.560\n And it's used to provide temporary...\n\n1:46:58.560 --> 1:47:06.120\n The unfortunate thing with money is that it helps you buy things that too easily allow\n\n1:47:06.120 --> 1:47:12.760\n you to forget the important things in life and also to forget the difficult aspects of\n\n1:47:12.760 --> 1:47:18.720\n life, to do the difficult intellectual work of being cognizant of your mortality, of fully\n\n1:47:18.720 --> 1:47:25.360\n engaging in life, in a life of reason too, of thinking deeply about the world, all those\n\n1:47:25.360 --> 1:47:26.520\n kinds of things.\n\n1:47:26.520 --> 1:47:31.320\n If you get a nice car or something like that and just, I don't know, all the different\n\n1:47:31.320 --> 1:47:34.760\n things you can do with money, it can make you forget that.\n\n1:47:34.760 --> 1:47:40.760\n Anyway, there's a long way to say that, yes, yes, it's very nice that it coincided nicely\n\n1:47:40.760 --> 1:47:42.000\n with the book.\n\n1:47:42.000 --> 1:47:49.960\n But also, I think it, like I said, I think it inspired quite a lot of people that maybe\n\n1:47:49.960 --> 1:47:53.000\n there's a lot of things out there that were...\n\n1:47:53.000 --> 1:47:56.360\n It reminded a lot of people, there's things out there we don't know about.\n\n1:47:56.360 --> 1:48:00.280\n Lex, I can agree with you on that, but can I push back on two things?\n\n1:48:00.280 --> 1:48:01.280\n Mm hmm.\n\n1:48:01.280 --> 1:48:02.280\n Okay.\n\n1:48:02.280 --> 1:48:03.280\n Let's do it.\n\n1:48:03.280 --> 1:48:04.280\n All right.\n\n1:48:04.280 --> 1:48:06.920\n The first one is that I was happy to receive money from the book because of the New York\n\n1:48:06.920 --> 1:48:07.920\n Times article.\n\n1:48:07.920 --> 1:48:09.320\n That's absolutely false.\n\n1:48:09.320 --> 1:48:14.360\n So I published my book with Oxford, which is an academic press, and you don't get paid\n\n1:48:14.360 --> 1:48:15.720\n with an academic press.\n\n1:48:15.720 --> 1:48:16.720\n Okay.\n\n1:48:16.720 --> 1:48:18.000\n So money was not it for me.\n\n1:48:18.000 --> 1:48:21.880\n What it was, was recognition that my research was being validated.\n\n1:48:21.880 --> 1:48:26.400\n So because then people called me and said, well, maybe it's more than interesting.\n\n1:48:26.400 --> 1:48:27.400\n Okay.\n\n1:48:27.400 --> 1:48:28.400\n And they did.\n\n1:48:28.400 --> 1:48:29.400\n Okay.\n\n1:48:29.400 --> 1:48:35.000\n The other thing about money is just as you say that, now I agree with you, I'm upset\n\n1:48:35.000 --> 1:48:36.000\n about money too.\n\n1:48:36.000 --> 1:48:40.480\n I think there should be universal health care, a universal income.\n\n1:48:40.480 --> 1:48:44.640\n I don't think people should be in poverty, especially because we are so wealthy as a\n\n1:48:44.640 --> 1:48:45.640\n species, frankly.\n\n1:48:45.640 --> 1:48:46.640\n Okay.\n\n1:48:46.640 --> 1:48:53.200\n That said, think about this, if you don't have money, you can't have a life of the mind\n\n1:48:53.200 --> 1:48:54.200\n either.\n\n1:48:54.200 --> 1:48:55.200\n Right?\n\n1:48:55.200 --> 1:48:56.200\n 100%.\n\n1:48:56.200 --> 1:48:57.960\n So I'm not espousing that money is the devil.\n\n1:48:57.960 --> 1:49:04.720\n I just think that money can be a drug.\n\n1:49:04.720 --> 1:49:09.440\n Or I would compare it to like food or something like that, where like you really should have\n\n1:49:09.440 --> 1:49:11.920\n enough to nourish yourself.\n\n1:49:11.920 --> 1:49:12.920\n Yes.\n\n1:49:12.920 --> 1:49:13.920\n Right.\n\n1:49:13.920 --> 1:49:17.220\n And too much can be a huge problem.\n\n1:49:17.220 --> 1:49:19.440\n So that's where I come from with money.\n\n1:49:19.440 --> 1:49:24.380\n And I'm just aware, I'm fortunate enough to have the skills and the health to be able\n\n1:49:24.380 --> 1:49:30.120\n to earn a living in whatever way, like I wish of having being in the United States and being\n\n1:49:30.120 --> 1:49:31.200\n able to speak English.\n\n1:49:31.200 --> 1:49:37.680\n So the very least I could work with McDonald's and my standards are, I told Joe, I made a\n\n1:49:37.680 --> 1:49:38.680\n mistake.\n\n1:49:38.680 --> 1:49:44.160\n I told Joe Rogan that I've always had a few money and people are like, oh, Lex was always\n\n1:49:44.160 --> 1:49:45.160\n rich.\n\n1:49:45.160 --> 1:49:46.160\n No, no, no.\n\n1:49:46.160 --> 1:49:47.160\n I was always broke.\n\n1:49:47.160 --> 1:49:54.080\n What I mean by I've always had a few monies, my standard, what it takes to have a few is\n\n1:49:54.080 --> 1:49:55.200\n always very little.\n\n1:49:55.200 --> 1:49:57.200\n I'm just happy with very little.\n\n1:49:57.200 --> 1:50:04.080\n But yes, it's true that money for many people, including for myself, it's just a different\n\n1:50:04.080 --> 1:50:06.640\n level for different people, is freedom.\n\n1:50:06.640 --> 1:50:07.640\n Yes, absolutely.\n\n1:50:07.640 --> 1:50:11.480\n Freedom to think, freedom to pursue your passions.\n\n1:50:11.480 --> 1:50:18.200\n It just so happens I am very fortunate that many of my passions often come with a salary\n\n1:50:18.200 --> 1:50:19.200\n if I wished.\n\n1:50:19.200 --> 1:50:20.200\n Right.\n\n1:50:20.200 --> 1:50:23.300\n So everything like me, I love programming.\n\n1:50:23.300 --> 1:50:29.080\n So even just like working as a basic level software engineer will be a source of a lot\n\n1:50:29.080 --> 1:50:30.080\n of joy for me.\n\n1:50:30.080 --> 1:50:34.460\n And that happens in this modern world to come with a salary.\n\n1:50:34.460 --> 1:50:36.520\n So yeah, it's definitely true.\n\n1:50:36.520 --> 1:50:38.960\n I just mean that it can become a dangerous drug.\n\n1:50:38.960 --> 1:50:46.480\n So I'm glad you are in this pursuit that you are in for the love of knowledge.\n\n1:50:46.480 --> 1:50:49.960\n And it's true.\n\n1:50:49.960 --> 1:50:51.520\n People should definitely buy your book.\n\n1:50:51.520 --> 1:50:53.960\n I won't be making money off of it.\n\n1:50:53.960 --> 1:50:55.960\n Oh yeah, it's true actually.\n\n1:50:55.960 --> 1:50:56.960\n Absolutely.\n\n1:50:56.960 --> 1:50:58.440\n Maybe my next book.\n\n1:50:58.440 --> 1:50:59.440\n Yes.\n\n1:50:59.440 --> 1:51:00.440\n Yeah.\n\n1:51:00.440 --> 1:51:12.160\n Your sense is there's some groups of people that may be trying to leverage this for financial\n\n1:51:12.160 --> 1:51:13.160\n gains.\n\n1:51:13.160 --> 1:51:17.160\n And you know, probably good financial, I mean, they may have good reasons for this too.\n\n1:51:17.160 --> 1:51:20.440\n Like, okay, let's take the study of UFOs, okay?\n\n1:51:20.440 --> 1:51:25.240\n Maybe many people in government that decide who dole out the money, let's put it that\n\n1:51:25.240 --> 1:51:27.900\n way, they think UFOs aren't real.\n\n1:51:27.900 --> 1:51:30.280\n So they're not going to give these programs money.\n\n1:51:30.280 --> 1:51:33.080\n So how do these programs make money?\n\n1:51:33.080 --> 1:51:34.740\n They're going to have to find a way to do it.\n\n1:51:34.740 --> 1:51:36.840\n So maybe that's how they do it.\n\n1:51:36.840 --> 1:51:37.840\n Okay.\n\n1:51:37.840 --> 1:51:38.840\n So I...\n\n1:51:38.840 --> 1:51:39.840\n That's fascinating.\n\n1:51:39.840 --> 1:51:42.040\n This is a way to raise money for science.\n\n1:51:42.040 --> 1:51:43.040\n Doing the research.\n\n1:51:43.040 --> 1:51:44.040\n Yeah, I think so.\n\n1:51:44.040 --> 1:51:49.480\n So let's take a step back to Roswell, we talked about it a little bit.\n\n1:51:49.480 --> 1:51:58.520\n What's your sense about that whole time, Roswell and just Area 51, and the sightings, and also\n\n1:51:58.520 --> 1:52:02.840\n the follow on mythology around those sightings?\n\n1:52:02.840 --> 1:52:03.840\n That's with us today.\n\n1:52:03.840 --> 1:52:04.840\n Of course.\n\n1:52:04.840 --> 1:52:05.840\n All right.\n\n1:52:05.840 --> 1:52:06.840\n So...\n\n1:52:06.840 --> 1:52:07.840\n Where do I get started?\n\n1:52:07.840 --> 1:52:10.240\n Well, I mean, it is a mythology here, right?\n\n1:52:10.240 --> 1:52:15.120\n The mythology of Roswell, it's very religious like in the sense that there's a pilgrimage\n\n1:52:15.120 --> 1:52:20.880\n to Roswell people make and they go to, there's a festival there as well, like a religious\n\n1:52:20.880 --> 1:52:23.000\n festival.\n\n1:52:23.000 --> 1:52:26.780\n You can get little kitschy stuff like you can get at a religious festival there.\n\n1:52:26.780 --> 1:52:31.360\n So it's very much like a place of pilgrimage where a herophany occurred and a herophany\n\n1:52:31.360 --> 1:52:34.760\n is basically contact with nonhuman intelligence.\n\n1:52:34.760 --> 1:52:35.760\n Okay.\n\n1:52:35.760 --> 1:52:40.840\n So nonhuman intelligence is thought to have contacted humans or crashed at this place\n\n1:52:40.840 --> 1:52:42.720\n in Roswell, New Mexico.\n\n1:52:42.720 --> 1:52:48.760\n Now what's fascinating is that I begin my book by going out to a crash site in New Mexico.\n\n1:52:48.760 --> 1:52:55.040\n I have to get blindfolded with my, well, to tell you the truth, the story is that I'm\n\n1:52:55.040 --> 1:53:01.600\n with Tyler, who's an invisible, and he wants to show me a place in New Mexico where a crash\n\n1:53:01.600 --> 1:53:02.600\n happened.\n\n1:53:02.600 --> 1:53:08.320\n And he says that he thinks that I need to see physical evidence because I don't believe.\n\n1:53:08.320 --> 1:53:11.520\n And so I said, I'll go, but I'm going to bring a friend of mine.\n\n1:53:11.520 --> 1:53:12.960\n And he said, no, you have to go alone.\n\n1:53:12.960 --> 1:53:19.640\n He goes, it's a place that is on government owned property and it's a no fly zone.\n\n1:53:19.640 --> 1:53:22.320\n And when you go, you'll be blindfolded.\n\n1:53:22.320 --> 1:53:27.680\n And I said, I definitely need to bring a friend.\n\n1:53:27.680 --> 1:53:29.720\n So he said, well, who do you want to bring?\n\n1:53:29.720 --> 1:53:35.360\n I just had met this university scientist who's very well known and I call him James in my\n\n1:53:35.360 --> 1:53:36.360\n book.\n\n1:53:36.360 --> 1:53:40.320\n And I asked, and I had a feeling James would definitely want to do this.\n\n1:53:40.320 --> 1:53:43.360\n And I asked James and he said, I'll go tomorrow.\n\n1:53:43.360 --> 1:53:48.600\n So I suggested this to Tyler and Tyler said, absolutely not.\n\n1:53:48.600 --> 1:53:52.680\n And I thought, I know he's going to look up James and he's going to say yes, because if\n\n1:53:52.680 --> 1:53:56.760\n anybody can figure out what this material is that you're going to go look for, it's\n\n1:53:56.760 --> 1:53:57.760\n going to be James.\n\n1:53:57.760 --> 1:53:59.240\n He has the instruments.\n\n1:53:59.240 --> 1:54:04.720\n And so Tyler did, in fact, look him up and finally said, okay, you can go.\n\n1:54:04.720 --> 1:54:07.880\n So we both head out there and we get blindfolded and Tyler takes us out there.\n\n1:54:07.880 --> 1:54:11.920\n It takes about 40 minutes outside of a certain place in New Mexico.\n\n1:54:11.920 --> 1:54:16.600\n So in terms of Roswell, this is what I can say is that according to Tyler, there were\n\n1:54:16.600 --> 1:54:25.560\n about seven crashes out in the 1940s in New Mexico in various places.\n\n1:54:25.560 --> 1:54:29.120\n We went to one of them according to Tyler.\n\n1:54:29.120 --> 1:54:33.880\n At the time I was completely an atheist with regard to anything that had to do with UFOs.\n\n1:54:33.880 --> 1:54:41.480\n So we were out there, we had specially configured metal detectors for these metals.\n\n1:54:41.480 --> 1:54:44.120\n And we did find these, okay.\n\n1:54:44.120 --> 1:54:49.720\n And they've since been studied by various scientists, material scientists, so forth.\n\n1:54:49.720 --> 1:54:57.240\n And I believe Jacques talked about not those particular ones, but others on the Joe Rogan\n\n1:54:57.240 --> 1:54:58.240\n show.\n\n1:54:58.240 --> 1:55:05.680\n They're anomalies, so there are scientists, I'm not a scientist, so I can't weigh in on\n\n1:55:05.680 --> 1:55:12.560\n whether, I just believe the people, these people I believe because they're well known\n\n1:55:12.560 --> 1:55:13.560\n scientists.\n\n1:55:13.560 --> 1:55:14.560\n What do you mean they're not anomalies?\n\n1:55:14.560 --> 1:55:15.560\n No, they are anomalous.\n\n1:55:15.560 --> 1:55:23.480\n Oh, anomalous in terms of the materials that are naturally occurring on earth.\n\n1:55:23.480 --> 1:55:24.960\n Yes.\n\n1:55:24.960 --> 1:55:36.880\n Okay, so there's some kind of inklings of evidence that something happened in Roswell\n\n1:55:36.880 --> 1:55:40.840\n in terms of crashes of alien technology.\n\n1:55:40.840 --> 1:55:42.960\n What else is there to the mythology?\n\n1:55:42.960 --> 1:55:45.960\n So there's some crashes, right?\n\n1:55:45.960 --> 1:55:46.960\n Yeah.\n\n1:55:46.960 --> 1:55:47.960\n I mean, that's kind of epic.\n\n1:55:47.960 --> 1:55:50.360\n It's pretty epic, yeah.\n\n1:55:50.360 --> 1:55:55.800\n And what else, like what are we supposed to take away from this?\n\n1:55:55.800 --> 1:55:56.800\n Right, yeah.\n\n1:55:56.800 --> 1:55:57.800\n So it's weird.\n\n1:55:57.800 --> 1:56:03.200\n Okay, so there's this, okay, so in religious studies, like I said, we call it a herophany,\n\n1:56:03.200 --> 1:56:08.480\n which is the meeting of a nonhuman intelligent thing, whatever it is, an angel, a god, whatever,\n\n1:56:08.480 --> 1:56:12.520\n a goddess with, or an alien, with humans.\n\n1:56:12.520 --> 1:56:16.440\n And that's the place, okay, so the place is New Mexico.\n\n1:56:16.440 --> 1:56:22.720\n So New Mexico becomes folded into the mythology of this new religion, is what I call a new\n\n1:56:22.720 --> 1:56:26.280\n type of religion, of the UFO.\n\n1:56:26.280 --> 1:56:30.360\n And it becomes ground zero for this new mythology.\n\n1:56:30.360 --> 1:56:35.600\n Just like Mecca is the place where Muslims go, they have to go, right, at least once\n\n1:56:35.600 --> 1:56:38.200\n in their lives, it's a pilgrimage place now.\n\n1:56:38.200 --> 1:56:41.480\n So in my book, that's how I tell it.\n\n1:56:41.480 --> 1:56:45.920\n Now what about Roswell in the public imagination?\n\n1:56:45.920 --> 1:56:51.800\n Really according to Annie Jacobson, who's good, she's a great author, investigative\n\n1:56:51.800 --> 1:56:53.840\n journalist, she's written about Roswell too.\n\n1:56:53.840 --> 1:56:58.040\n I don't agree with all of what she comes up with, but part of it is that there's a lot\n\n1:56:58.040 --> 1:57:03.180\n of military stuff going on there that is classified, and there's a reason why you can't get in,\n\n1:57:03.180 --> 1:57:07.080\n and nor would you want to, right?\n\n1:57:07.080 --> 1:57:10.960\n So there's a lot of experimentation going on there.\n\n1:57:10.960 --> 1:57:18.160\n I don't believe that it has to do with ETs, frankly, but in the imaginations of Americans,\n\n1:57:18.160 --> 1:57:22.920\n Roswell is that place, but I went to a different place, and apparently there are several places\n\n1:57:22.920 --> 1:57:23.920\n in New Mexico.\n\n1:57:23.920 --> 1:57:29.800\n Now, strangely enough, I traveled back to New Mexico at the very end chapter of my book,\n\n1:57:29.800 --> 1:57:33.080\n but I don't go there physically.\n\n1:57:33.080 --> 1:57:40.640\n I go there through the story of a Catholic nun who actually believes that she bilocated\n\n1:57:40.640 --> 1:57:47.000\n to New Mexico in the, gosh, in the 1600s.\n\n1:57:47.000 --> 1:57:48.960\n So yeah, it was very strange.\n\n1:57:48.960 --> 1:57:54.280\n And I was at the Vatican at the Space Observatory when I made that connection that she probably\n\n1:57:54.280 --> 1:57:59.880\n went to the very, well, she believed she went to this very place that I had gone.\n\n1:57:59.880 --> 1:58:01.920\n Can you elaborate a little bit?\n\n1:58:01.920 --> 1:58:03.560\n What does it mean to go to that place?\n\n1:58:03.560 --> 1:58:04.560\n For her?\n\n1:58:04.560 --> 1:58:05.560\n Yeah, yeah.\n\n1:58:05.560 --> 1:58:06.560\n For her.\n\n1:58:06.560 --> 1:58:13.800\n What does it mean, so we're kind of breaking down the barrier between what it means to\n\n1:58:13.800 --> 1:58:15.920\n be in a place and time, right?\n\n1:58:15.920 --> 1:58:16.920\n Right.\n\n1:58:16.920 --> 1:58:17.920\n I agree with you.\n\n1:58:17.920 --> 1:58:19.720\n This is the field of religious studies.\n\n1:58:19.720 --> 1:58:23.040\n So, and again, I don't say it's true in my book.\n\n1:58:23.040 --> 1:58:28.440\n I just say it's a very strange coincidence that I'm at the Vatican Observatory.\n\n1:58:28.440 --> 1:58:33.280\n In fact, I'd finished my book, but while I was at the Vatican Observatory, I was there\n\n1:58:33.280 --> 1:58:37.480\n with Tyler, and we were looking at the records.\n\n1:58:37.480 --> 1:58:42.180\n They're called the trial records, but they're the canonization records of these two saints.\n\n1:58:42.180 --> 1:58:44.520\n Each was said to have done amazing things.\n\n1:58:44.520 --> 1:58:50.480\n One was Joseph of Cupertino, who levitated, okay, or is said to have levitated.\n\n1:58:50.480 --> 1:58:56.400\n The other was Maria of Agrida from Spain, their contemporaries in the 1600s, who was\n\n1:58:56.400 --> 1:59:00.680\n said to have been able to bilocate, which is to be in two places at once, okay?\n\n1:59:00.680 --> 1:59:05.560\n So this is a belief in Catholicism that certain very holy people can do these kinds of things\n\n1:59:05.560 --> 1:59:11.080\n like levitate, which, by the way, is also associated with UFO abductions.\n\n1:59:11.080 --> 1:59:13.680\n People get levitated out of their beds and things like that.\n\n1:59:13.680 --> 1:59:21.540\n So we were sent there by a billionaire who was interested in levitation and bilocation.\n\n1:59:21.540 --> 1:59:27.960\n And since I could get into the Vatican and I knew the director of the Vatican Observatory,\n\n1:59:27.960 --> 1:59:33.600\n both Tyler and I were able to go to the secret archives and look at the canonization records\n\n1:59:33.600 --> 1:59:40.300\n and then go to Castle Gandolfo, which is about an hour from the Vatican where the first observatory,\n\n1:59:40.300 --> 1:59:44.240\n the space observatory of the Vatican is.\n\n1:59:44.240 --> 1:59:48.000\n The second one is in Arizona and it has a much larger telescope.\n\n1:59:48.000 --> 1:59:53.760\n So we went and Brother Guy gave me the keys to the archive and said, look at anything\n\n1:59:53.760 --> 1:59:54.760\n you want.\n\n1:59:54.760 --> 1:59:56.760\n And I got to see a lot of stuff by Carl Sagan, by the way.\n\n1:59:56.760 --> 1:59:58.600\n I know he talked about, yeah, it was awesome.\n\n1:59:58.600 --> 2:00:03.480\n So they have a whole section on the search for extraterrestrial life.\n\n2:00:03.480 --> 2:00:04.480\n And they don't, by the way.\n\n2:00:04.480 --> 2:00:05.480\n How awesome is that?\n\n2:00:05.480 --> 2:00:06.480\n It was awesome.\n\n2:00:06.480 --> 2:00:07.480\n Yeah.\n\n2:00:07.480 --> 2:00:08.480\n So we got to stay there.\n\n2:00:08.480 --> 2:00:09.480\n They have a scholars quarters.\n\n2:00:09.480 --> 2:00:11.100\n And so they had two.\n\n2:00:11.100 --> 2:00:13.840\n And so Tyler stayed in one and I stayed in the other.\n\n2:00:13.840 --> 2:00:20.800\n And Brother Guy probably shouldn't have been so nice to me and given me the keys because\n\n2:00:20.800 --> 2:00:24.640\n when I got home, we were there for two weeks, when I got home, I got this frantic phone\n\n2:00:24.640 --> 2:00:29.120\n call from him and he basically said, Diana, he goes, do you remember where you put the\n\n2:00:29.120 --> 2:00:30.800\n original Kepler?\n\n2:00:30.800 --> 2:00:33.240\n And so I had this Kepler, right?\n\n2:00:33.240 --> 2:00:36.040\n And so I misplaced it.\n\n2:00:36.040 --> 2:00:39.760\n Luckily I remembered where it went.\n\n2:00:39.760 --> 2:00:42.160\n I was like, oh gosh, thank goodness I found it.\n\n2:00:42.160 --> 2:00:47.200\n But he'll probably change the rules of the Vatican observatory after my visit.\n\n2:00:47.200 --> 2:00:55.840\n So Maria, she's actually in the history of our country in that she first wrote a cosmography\n\n2:00:55.840 --> 2:00:59.400\n of what she said was the spinning earth.\n\n2:00:59.400 --> 2:01:01.200\n And this was in the 1600s.\n\n2:01:01.200 --> 2:01:03.000\n And that's her first book.\n\n2:01:03.000 --> 2:01:04.840\n And she wrote that.\n\n2:01:04.840 --> 2:01:11.960\n And then she said that she was transported on the wings of angels to the new world.\n\n2:01:11.960 --> 2:01:19.480\n And she said that she met a culture of people and she basically told them about the faith\n\n2:01:19.480 --> 2:01:21.480\n of Catholicism.\n\n2:01:21.480 --> 2:01:27.440\n And then what happened was that the people that, and she described the fauna, she described\n\n2:01:27.440 --> 2:01:29.720\n the people and everything like that.\n\n2:01:29.720 --> 2:01:32.220\n And so there were actually missionaries there.\n\n2:01:32.220 --> 2:01:40.480\n And when they went to try to convert some of the people who already lived there, apparently\n\n2:01:40.480 --> 2:01:42.000\n they already knew a bunch of stuff.\n\n2:01:42.000 --> 2:01:43.480\n And they said, how did you know all this stuff?\n\n2:01:43.480 --> 2:01:48.760\n And they said, this lady in blue came and told us, and they said, did it look like this?\n\n2:01:48.760 --> 2:01:53.240\n And they showed them, they obviously didn't have a photograph, but they had a picture\n\n2:01:53.240 --> 2:01:56.200\n of a sister, a nun.\n\n2:01:56.200 --> 2:02:02.400\n And they said, yeah, she wore similar clothes, but she was much younger.\n\n2:02:02.400 --> 2:02:04.400\n And these guys thought that was weird.\n\n2:02:04.400 --> 2:02:08.960\n But when they went back to Spain, they found that this woman had been doing that in her\n\n2:02:08.960 --> 2:02:11.320\n mind, had been traveling.\n\n2:02:11.320 --> 2:02:12.960\n I mean, I don't know what to make of it.\n\n2:02:12.960 --> 2:02:18.880\n There's so many things that are sort of forcing you to kind of go outside of, you know, I'm\n\n2:02:18.880 --> 2:02:19.880\n of many minds.\n\n2:02:19.880 --> 2:02:25.840\n I have a very, most of my days spent with very rigorous scientific kind of things and\n\n2:02:25.840 --> 2:02:27.480\n even engineering kind of things.\n\n2:02:27.480 --> 2:02:34.240\n And then I'm also open minded and just the entirety of the idea of extraterrestrial life\n\n2:02:34.240 --> 2:02:41.400\n forces you to think outside of conventional boundaries of thought, scientific, current\n\n2:02:41.400 --> 2:02:43.200\n scientific thought.\n\n2:02:43.200 --> 2:02:44.200\n Let's put it that way.\n\n2:02:44.200 --> 2:02:45.200\n And your story right now.\n\n2:02:45.200 --> 2:02:46.200\n It's freaking you out.\n\n2:02:46.200 --> 2:02:47.200\n Yeah.\n\n2:02:47.200 --> 2:02:48.200\n That's okay.\n\n2:02:48.200 --> 2:02:50.640\n That's a nice way to put it.\n\n2:02:50.640 --> 2:02:57.520\n What do you, just another person that seems to be a key figure in this, in the mythology\n\n2:02:57.520 --> 2:02:59.360\n of this is Bob Lazar.\n\n2:02:59.360 --> 2:03:01.380\n It'd be interesting.\n\n2:03:01.380 --> 2:03:07.120\n Maybe there's others you can tell me about, but Bob, who's also been on Joe Rogan, but\n\n2:03:07.120 --> 2:03:16.080\n his story has been told quite a bit that he's got, I think he said that he witnessed some\n\n2:03:16.080 --> 2:03:25.760\n of the work being done on the spacecraft that was, you know, that was captured and so on\n\n2:03:25.760 --> 2:03:30.640\n in order to try to reverse engineer some of the technology in terms of the propulsion\n\n2:03:30.640 --> 2:03:31.640\n and so on.\n\n2:03:31.640 --> 2:03:37.080\n What are your thoughts about his story, how it fits into the mythology of this whole thing\n\n2:03:37.080 --> 2:03:40.240\n and broader ufologist community?\n\n2:03:40.240 --> 2:03:41.240\n Okay.\n\n2:03:41.240 --> 2:03:50.920\n So regarding Bob Lazar, with respect to his claims, again, I have no way to adjudicate\n\n2:03:50.920 --> 2:03:55.800\n whether or not he actually encountered this.\n\n2:03:55.800 --> 2:03:59.520\n I do have friends who are.\n\n2:03:59.520 --> 2:04:08.680\n And the people that I know who know his story, some know him, believe him.\n\n2:04:08.680 --> 2:04:16.520\n And they have said to me that the most important thing that they think he has said, in fact,\n\n2:04:16.520 --> 2:04:25.360\n one of them I think made a meme out of it or something like that was basically he said,\n\n2:04:25.360 --> 2:04:28.200\n maybe the public, you know, I regret making it public.\n\n2:04:28.200 --> 2:04:30.940\n Maybe the public isn't ready for this kind of information.\n\n2:04:30.940 --> 2:04:37.120\n And basically they've, they emphasize that to me and they emphasized it so much that\n\n2:04:37.120 --> 2:04:39.860\n they wanted me to know, right?\n\n2:04:39.860 --> 2:04:43.180\n So that is somewhat creepy to me.\n\n2:04:43.180 --> 2:04:49.300\n So I think, okay, this poor guy, Bob Lazar, so many people, you know, this is what happens\n\n2:04:49.300 --> 2:04:52.160\n to people who have experiences like this.\n\n2:04:52.160 --> 2:05:00.200\n They're questioned, their reputations are put on the line, in some instances their reputations\n\n2:05:00.200 --> 2:05:04.900\n are manipulated on purpose to make them look uncredible.\n\n2:05:04.900 --> 2:05:14.320\n To me, as a scientist, it's just inspiring that it kind of gives this kind of, I'm not\n\n2:05:14.320 --> 2:05:19.440\n even thinking of it, is there an actual spacecraft being hidden somewhere and studied and so\n\n2:05:19.440 --> 2:05:20.440\n on?\n\n2:05:20.440 --> 2:05:24.640\n But I think of it like, I don't know, it's a thing that gives you a spark of a dream,\n\n2:05:24.640 --> 2:05:32.720\n you know, as a reminder that we don't understand most of how this world works.\n\n2:05:32.720 --> 2:05:38.380\n And then we can build technologies that aren't here today that will allow us to understand\n\n2:05:38.380 --> 2:05:39.380\n much more.\n\n2:05:39.380 --> 2:05:44.240\n And it's kind of like, almost like a feeling that it provides and that it inspires and\n\n2:05:44.240 --> 2:05:45.920\n makes you dream.\n\n2:05:45.920 --> 2:05:47.320\n That's the way I see the Bob Lazar story.\n\n2:05:47.320 --> 2:05:52.040\n I don't necessarily, people ask me, because I'm at MIT, people ask me, did Bob Lazar actually\n\n2:05:52.040 --> 2:05:53.880\n go to MIT and so on?\n\n2:05:53.880 --> 2:05:57.960\n I don't know, and I personally don't care.\n\n2:05:57.960 --> 2:06:01.080\n That's not what's interesting to me about that story.\n\n2:06:01.080 --> 2:06:06.360\n To me, the myth is more interesting, not interesting actually, but inspiring.\n\n2:06:06.360 --> 2:06:11.760\n Yes, because inspiring, you're suggesting that the myth inspires you to create reality.\n\n2:06:11.760 --> 2:06:12.760\n Yes.\n\n2:06:12.760 --> 2:06:15.120\n Yeah, I think that's true.\n\n2:06:15.120 --> 2:06:25.720\n So even if it's not real, in some sense, just like you said, it does in some sense, it doesn't.\n\n2:06:25.720 --> 2:06:28.840\n So a lot of people know how much I love 2001 Space Odyssey.\n\n2:06:28.840 --> 2:06:38.640\n So I got a lot of these emails asking like, hey bro, do you know what's up with the monoliths\n\n2:06:38.640 --> 2:06:41.440\n in the middle of the desert or whatever it was?\n\n2:06:41.440 --> 2:06:47.680\n I haven't been actually paying attention, I apologize, but you kind of mentioned offline\n\n2:06:47.680 --> 2:06:49.760\n that this is kind of cool and interesting.\n\n2:06:49.760 --> 2:06:56.920\n What do you make of these monoliths and in general, are you a fan of 2001 Space Odyssey\n\n2:06:56.920 --> 2:06:58.920\n where monoliths showed up?\n\n2:06:58.920 --> 2:07:02.620\n Do you have any thoughts about either the science fiction, the mythology of it or the\n\n2:07:02.620 --> 2:07:04.280\n reality of it?\n\n2:07:04.280 --> 2:07:05.280\n Yes.\n\n2:07:05.280 --> 2:07:06.280\n Okay.\n\n2:07:06.280 --> 2:07:07.720\n No, okay.\n\n2:07:07.720 --> 2:07:09.720\n And please say more.\n\n2:07:09.720 --> 2:07:10.720\n Right.\n\n2:07:10.720 --> 2:07:18.320\n So first of all, Kubrick's films are not ever easy for me because they're so weird, right?\n\n2:07:18.320 --> 2:07:25.080\n And I don't actually enjoy watching them, but it doesn't take away from their incredible\n\n2:07:25.080 --> 2:07:29.480\n brilliance though and their visionary merit.\n\n2:07:29.480 --> 2:07:37.400\n So 2001 Space Odyssey is incredibly visionary and of course, all those things that people\n\n2:07:37.400 --> 2:07:40.200\n say, I don't have to restate them.\n\n2:07:40.200 --> 2:07:43.160\n In terms of what I have, it's a subtext to my book, by the way.\n\n2:07:43.160 --> 2:07:49.760\n I didn't mean it to be, but it's almost a character in my book, 2001 Space Odyssey.\n\n2:07:49.760 --> 2:07:54.920\n And when the monoliths started to appear, again, everything went crazy with my everything,\n\n2:07:54.920 --> 2:07:57.440\n internet, social media, phone.\n\n2:07:57.440 --> 2:07:58.440\n What's up?\n\n2:07:58.440 --> 2:07:59.440\n What's going on, right?\n\n2:07:59.440 --> 2:08:00.520\n Is this disclosure?\n\n2:08:00.520 --> 2:08:05.120\n And I thought, well, I'll tell you one thing, is let's look at the timing of it.\n\n2:08:05.120 --> 2:08:09.920\n It's a cool, it isn't art and then copy art and things like that.\n\n2:08:09.920 --> 2:08:15.160\n It's actually happening at a really interesting time when all of us are forced to go online.\n\n2:08:15.160 --> 2:08:17.480\n When all of us are forced, because of COVID, right?\n\n2:08:17.480 --> 2:08:22.880\n We're completely now invaded by the screen or we're invading the screen.\n\n2:08:22.880 --> 2:08:25.240\n Our infrastructure now is completely changed.\n\n2:08:25.240 --> 2:08:31.280\n So the monolith, basically, if art is supposed to show us life, it certainly has.\n\n2:08:31.280 --> 2:08:33.860\n If that's an art project, somebody did an awesome job with it.\n\n2:08:33.860 --> 2:08:36.400\n But apparently that monolith was there for a long time, right?\n\n2:08:36.400 --> 2:08:37.560\n I mean, that's the thing.\n\n2:08:37.560 --> 2:08:41.120\n It's been there for a couple of years, so they said, okay, all right.\n\n2:08:41.120 --> 2:08:47.840\n That said, if your audience is interested, I think the best theory about the meaning\n\n2:08:47.840 --> 2:08:54.000\n of the monolith is Robert Ager or Robert Ayer.\n\n2:08:54.000 --> 2:08:56.480\n I think it's Robert Ager.\n\n2:08:56.480 --> 2:09:01.560\n He's got a website where he does analyses of films and it's called Collative Learning\n\n2:09:01.560 --> 2:09:05.760\n or Collative Learning, and he does the meaning of the monolith.\n\n2:09:05.760 --> 2:09:09.160\n Everyone should go look at that because I fully agree with him.\n\n2:09:09.160 --> 2:09:13.440\n I studied different meanings of the monolith in 2001 A Space Odyssey.\n\n2:09:13.440 --> 2:09:14.440\n I was fascinated.\n\n2:09:14.440 --> 2:09:17.240\n Okay, so what is this about?\n\n2:09:17.240 --> 2:09:21.720\n I accepted as soon as I listened to it and watched it.\n\n2:09:21.720 --> 2:09:27.160\n So basically, he says that the monolith is, okay, can you pick up your phone here?\n\n2:09:27.160 --> 2:09:29.840\n What does that look like?\n\n2:09:29.840 --> 2:09:33.440\n It looks awfully a lot like a monolith.\n\n2:09:33.440 --> 2:09:34.440\n Yeah.\n\n2:09:34.440 --> 2:09:39.560\n So basically, that's what he was saying was that Kubrick was basically, the monolith was\n\n2:09:39.560 --> 2:09:45.760\n technology or the screen in particular, and he basically was saying that the cinema screen,\n\n2:09:45.760 --> 2:09:46.760\n we're being completely...\n\n2:09:46.760 --> 2:09:50.140\n And if you think about it, look at all this, we live in a screen culture.\n\n2:09:50.140 --> 2:09:56.720\n We have computer screens, iPhone screens, there's phone screens, we have TV screens,\n\n2:09:56.720 --> 2:09:57.720\n everything is something...\n\n2:09:57.720 --> 2:10:01.880\n And now that COVID has come, we're forced to go into these screens and we're forced\n\n2:10:01.880 --> 2:10:06.680\n to live a different material existence than we have lived before.\n\n2:10:06.680 --> 2:10:12.880\n So in my sense, I think that if it's an art project, it's a really good one for that.\n\n2:10:12.880 --> 2:10:20.440\n So I like that meaning of it, it's a screen and a screen could take all kinds of forms.\n\n2:10:20.440 --> 2:10:27.640\n I mean, our perception system in a sense is a screen between reality and our mind.\n\n2:10:27.640 --> 2:10:33.960\n The screen of the computer is a screen, the virtual reality worlds that we might be one\n\n2:10:33.960 --> 2:10:39.920\n day living in, there'll be an interface, I mean, ultimately it's about the interface.\n\n2:10:39.920 --> 2:10:40.920\n That's interesting.\n\n2:10:40.920 --> 2:10:46.040\n It's an interface to another world of ideas.\n\n2:10:46.040 --> 2:10:49.080\n It's also a material change.\n\n2:10:49.080 --> 2:10:50.080\n It's a change in our material...\n\n2:10:50.080 --> 2:10:55.780\n I mean, when people talk about augmented reality, I say we already live in augmented reality,\n\n2:10:55.780 --> 2:10:56.780\n don't we?\n\n2:10:56.780 --> 2:11:00.720\n I mean, this isn't our grandparents existence.\n\n2:11:00.720 --> 2:11:01.720\n Yeah.\n\n2:11:01.720 --> 2:11:07.800\n I sometimes, you have to pause and remind yourself how weirdly different this reality\n\n2:11:07.800 --> 2:11:11.880\n is than just even like, I mean, 30 years ago.\n\n2:11:11.880 --> 2:11:19.360\n The internet changed so much and social media has changed so much about actually just the\n\n2:11:19.360 --> 2:11:21.040\n space of our thinking.\n\n2:11:21.040 --> 2:11:25.860\n Wikipedia changed so much about the offloading of our knowledge.\n\n2:11:25.860 --> 2:11:28.680\n The way we interact with knowledge.\n\n2:11:28.680 --> 2:11:35.680\n I mean, it offloaded our longterm memory about facts onto a digital format.\n\n2:11:35.680 --> 2:11:40.760\n So in the sense that expanded our mind, it's kind of interesting.\n\n2:11:40.760 --> 2:11:44.160\n I'd be curious to see if he has just one interpretation.\n\n2:11:44.160 --> 2:11:45.160\n I wonder if there's others.\n\n2:11:45.160 --> 2:11:46.880\n I've corresponded with him, yes.\n\n2:11:46.880 --> 2:11:50.240\n So over the years he and I have corresponded.\n\n2:11:50.240 --> 2:11:53.120\n And I told him, I said, look, I'm going to be using this in my book.\n\n2:11:53.120 --> 2:11:55.500\n So I think you should read what I say.\n\n2:11:55.500 --> 2:11:57.640\n And he was, he of course wanted to see it.\n\n2:11:57.640 --> 2:11:58.640\n So.\n\n2:11:58.640 --> 2:11:59.640\n What do you think about your book?\n\n2:11:59.640 --> 2:12:01.320\n Did he get a chance to read it?\n\n2:12:01.320 --> 2:12:02.320\n Yeah.\n\n2:12:02.320 --> 2:12:03.320\n Oh yeah.\n\n2:12:03.320 --> 2:12:12.000\n So he is a nonbeliever in alien intelligence and UFOs, but he, and that's fine, but I still\n\n2:12:12.000 --> 2:12:16.200\n agree with him that the meaning of the monolith was the screen, but that doesn't mean the\n\n2:12:16.200 --> 2:12:20.800\n screen isn't like what David Bowie said, right?\n\n2:12:20.800 --> 2:12:22.680\n So it's not exclusive.\n\n2:12:22.680 --> 2:12:26.920\n So I could still use his theory, but differ from the conclusions.\n\n2:12:26.920 --> 2:12:34.560\n In terms of nonbeliever and believer, there's, when you say believer, you also are kind of\n\n2:12:34.560 --> 2:12:42.880\n implying this, the idea that aliens have visited or had made direct contact with humans in\n\n2:12:42.880 --> 2:12:45.680\n some form.\n\n2:12:45.680 --> 2:12:54.000\n There's also the exploration and the idea of just alien intelligence is out there in\n\n2:12:54.000 --> 2:12:55.000\n the universe.\n\n2:12:55.000 --> 2:12:56.000\n Yeah.\n\n2:12:56.000 --> 2:13:01.840\n You know, the Drake equation estimating how many intelligent civilizations may be out\n\n2:13:01.840 --> 2:13:02.840\n there.\n\n2:13:02.840 --> 2:13:03.840\n How many have ever existed?\n\n2:13:03.840 --> 2:13:05.640\n How many are about to communicate with us?\n\n2:13:05.640 --> 2:13:12.140\n I mean, when you just zoom out from our own little selfish perspective of earth and look\n\n2:13:12.140 --> 2:13:18.200\n at the entirety, let's say the Milky Way galaxy, but maybe even the universe, does the idea\n\n2:13:18.200 --> 2:13:24.040\n that there are intelligent civilizations out there, something that you're excited about\n\n2:13:24.040 --> 2:13:27.300\n or something that you're terrified about?\n\n2:13:27.300 --> 2:13:28.900\n That's a good question.\n\n2:13:28.900 --> 2:13:35.400\n So basically I would say I'm not so keen on it.\n\n2:13:35.400 --> 2:13:42.000\n I think that our relationship with technology as it is and as it, as I hope it will go will\n\n2:13:42.000 --> 2:13:46.320\n help us survive, okay?\n\n2:13:46.320 --> 2:13:53.440\n I don't think we're equipped to do it as we stand now, but I think that if we can up our\n\n2:13:53.440 --> 2:13:58.600\n game or let's just put it this way, if technology is an extension of ourselves, which it actually\n\n2:13:58.600 --> 2:14:04.080\n is, it will help us because it'll probably be smarter than us, okay?\n\n2:14:04.080 --> 2:14:07.720\n It'll help us survive in the ways in which it determines best, okay?\n\n2:14:07.720 --> 2:14:17.240\n So with that said, if there are nonhuman intelligences out there and they have more advanced, you\n\n2:14:17.240 --> 2:14:25.320\n know, obviously technologies than us and they actually come, the history of human engagement\n\n2:14:25.320 --> 2:14:34.440\n with, you know, other cultures has not gone well for cultures that are less aggressive.\n\n2:14:34.440 --> 2:14:35.440\n So you see what I'm saying?\n\n2:14:35.440 --> 2:14:37.000\n Like, it's not a good idea.\n\n2:14:37.000 --> 2:14:43.240\n Well, I wonder where we stand on the, where humans stand in the full spectrum of aggression.\n\n2:14:43.240 --> 2:14:45.480\n Well, heck, where are we now, Lex?\n\n2:14:45.480 --> 2:14:47.560\n I mean, we're not too great here.\n\n2:14:47.560 --> 2:14:49.600\n We're still aggressing against each other.\n\n2:14:49.600 --> 2:14:52.680\n No, I know, but that will give us a benefit, right?\n\n2:14:52.680 --> 2:14:57.240\n Like, oh, you're saying, I thought, okay, I see.\n\n2:14:57.240 --> 2:15:03.480\n I just have a sense that there may be a lot of intelligences out there that are less aggressive\n\n2:15:03.480 --> 2:15:06.000\n because they've evolved past it.\n\n2:15:06.000 --> 2:15:07.680\n We can't assume that.\n\n2:15:07.680 --> 2:15:10.440\n No, I know we can't assume that, but like.\n\n2:15:10.440 --> 2:15:14.480\n If we can't assume it, then I'm going to assume the worst.\n\n2:15:14.480 --> 2:15:22.760\n Well, that's, despite the fact that I am a Russian and think that life is suffering,\n\n2:15:22.760 --> 2:15:31.640\n I tend to assume, not the best, but I tend to assume that there is a best core to creatures,\n\n2:15:31.640 --> 2:15:35.000\n to people and to creatures that ultimately wins out.\n\n2:15:35.000 --> 2:15:43.240\n I think there's an evolutionary advantage to being good to other living creatures.\n\n2:15:43.240 --> 2:15:49.440\n And so, ultimately, I think that if there's intelligent civilizations out there that prosper\n\n2:15:49.440 --> 2:15:58.400\n sufficiently to be able to travel across the great spans of space, that they've evolved\n\n2:15:58.400 --> 2:16:08.120\n past silly aggression, that it's more likely in my mind to be deeply cooperative.\n\n2:16:08.120 --> 2:16:16.000\n So like growth over destruction, like growth does not require destruction, I think.\n\n2:16:16.000 --> 2:16:22.080\n But if you see the universe as ultimately a place where it's highly constrained in resources\n\n2:16:22.080 --> 2:16:30.640\n that are necessary for traveling across space and time, then perhaps aggression is necessary\n\n2:16:30.640 --> 2:16:36.800\n in order to aggress against others that are desiring to get access to those resources.\n\n2:16:36.800 --> 2:16:37.880\n I don't know.\n\n2:16:37.880 --> 2:16:41.560\n I tend to try to be optimistic on that front.\n\n2:16:41.560 --> 2:16:46.440\n I think I'm emotionally optimistic and intellectually nonoptimistic.\n\n2:16:46.440 --> 2:16:51.160\n Yeah, I guess I'm there with you.\n\n2:16:51.160 --> 2:16:57.600\n I tend to believe that the happiness and deep fulfillment in life is found in that emotional\n\n2:16:57.600 --> 2:16:58.600\n place.\n\n2:16:58.600 --> 2:17:07.000\n The intellectual place is really useful for building cool new technologies and ideas and\n\n2:17:07.000 --> 2:17:08.000\n so on.\n\n2:17:08.000 --> 2:17:10.600\n But happiness is in the emotional place.\n\n2:17:10.600 --> 2:17:15.360\n And there it pays off to be optimistic, I think.\n\n2:17:15.360 --> 2:17:19.080\n You said that technology might be able to save us.\n\n2:17:19.080 --> 2:17:22.080\n That's also kind of optimistic, too.\n\n2:17:22.080 --> 2:17:23.080\n It might kill us.\n\n2:17:23.080 --> 2:17:29.760\n But there's, talking to you offline a little bit, there was a sense that we humans are\n\n2:17:29.760 --> 2:17:38.400\n facing existential risks, that it's not obvious that we will survive for long.\n\n2:17:38.400 --> 2:17:45.160\n Is there things that you worry about in terms of ways we may destroy ourselves or deeply\n\n2:17:45.160 --> 2:17:55.080\n damage the fabric of human civilization that technology may allow us to avoid or alleviate?\n\n2:17:55.080 --> 2:18:01.520\n Yes, I think that you can choose anything, actually.\n\n2:18:01.520 --> 2:18:08.160\n And it could destroy us, pollution.\n\n2:18:08.160 --> 2:18:12.880\n Here we're in a pandemic, a meteor.\n\n2:18:12.880 --> 2:18:19.240\n So we can use technology, or the thing is, is that we say we use technology, but actually\n\n2:18:19.240 --> 2:18:24.440\n that's not a correct way of putting it, in my opinion.\n\n2:18:24.440 --> 2:18:31.640\n So there is a term used by others, coined by somebody I don't know, and I'm sorry to\n\n2:18:31.640 --> 2:18:35.800\n not give credit where credit's due, but it's called technogenesis.\n\n2:18:35.800 --> 2:18:39.720\n And it's this idea, Heidegger actually had this idea, but he didn't use that term.\n\n2:18:39.720 --> 2:18:44.140\n And it's this idea that we coevolve with technology, that we don't actually use it.\n\n2:18:44.140 --> 2:18:49.400\n Most people think it's like a tool we use, okay, let's use technology to do this.\n\n2:18:49.400 --> 2:18:54.800\n Well, actually when we engage with technology, we actually engage with it and it engages\n\n2:18:54.800 --> 2:18:57.200\n back with us and we engage with it.\n\n2:18:57.200 --> 2:18:59.620\n So it's this coevolution that's happening.\n\n2:18:59.620 --> 2:19:11.400\n And in that sense, I think that as we create more autonomous, intelligent AI, it will help\n\n2:19:11.400 --> 2:19:21.360\n us survive because if we coevolve with it, it will need us as much as we need it, is\n\n2:19:21.360 --> 2:19:23.720\n my opinion.\n\n2:19:23.720 --> 2:19:31.280\n How that happens or if that bears out to be true, we'll see, but I don't think the idea\n\n2:19:31.280 --> 2:19:34.680\n that we use technology is a correct way to put it.\n\n2:19:34.680 --> 2:19:39.360\n I think that technology is something so strange, the way it is today, like digital technology,\n\n2:19:39.360 --> 2:19:45.120\n I'm not talking about hammers or things like that, those kinds of tools, okay, is technology\n\n2:19:45.120 --> 2:19:53.280\n is so far removed from that and our environment is so now conditioned by our technology and\n\n2:19:53.280 --> 2:19:55.800\n the infrastructure we live within, the material structure.\n\n2:19:55.800 --> 2:20:01.760\n I think that it's going to, I don't think it's going to be a Frankenstein.\n\n2:20:01.760 --> 2:20:05.120\n I think it's actually going, like a Mary Shelley type idea of technology.\n\n2:20:05.120 --> 2:20:12.560\n I think it's actually going to be more Promethean in the sense of, think about it, we create\n\n2:20:12.560 --> 2:20:18.720\n children and then we get old and we rely upon our children to help us, okay?\n\n2:20:18.720 --> 2:20:20.840\n Well, I feel like that about technology.\n\n2:20:20.840 --> 2:20:23.400\n We've created, well, we've created it, right?\n\n2:20:23.400 --> 2:20:28.480\n And so it's kind of growing up now.\n\n2:20:28.480 --> 2:20:34.200\n Or maybe it's in its teenage years and we'll see.\n\n2:20:34.200 --> 2:20:41.180\n What do you think about in terms of this coevolution of the work around brain computer interfaces\n\n2:20:41.180 --> 2:20:54.400\n and maybe Neuralink and Elon seeing Neuralink in particular as its longterm mission as a\n\n2:20:54.400 --> 2:20:57.000\n symbiosis with artificial intelligence.\n\n2:20:57.000 --> 2:21:07.480\n So like giving a greater bandwidth channel of communication between technology, AI systems\n\n2:21:07.480 --> 2:21:14.200\n and the biological neural networks of our human mind.\n\n2:21:14.200 --> 2:21:20.520\n What do you think about this idea of connecting directly to the brain in AI systems?\n\n2:21:20.520 --> 2:21:25.360\n I mean, okay, I've listened to your podcast with Elon.\n\n2:21:25.360 --> 2:21:29.960\n I've listened to Elon before, he's very intelligent, obviously super smart guy.\n\n2:21:29.960 --> 2:21:35.680\n I think this is already, I mean, not in the specific ways that he is doing it, but I think\n\n2:21:35.680 --> 2:21:37.360\n we are already doing that, okay?\n\n2:21:37.360 --> 2:21:41.440\n And I can give you some examples.\n\n2:21:41.440 --> 2:21:44.880\n And there are really trivial examples, but they do make the point and this is one of\n\n2:21:44.880 --> 2:21:45.880\n them.\n\n2:21:45.880 --> 2:21:53.240\n So before he started this research on UFOs and UAPs and technology, I actually was looking\n\n2:21:53.240 --> 2:22:01.840\n at the effects of technology and in particular media on religion.\n\n2:22:01.840 --> 2:22:10.160\n And what I did was I was lucky to be asked to be a consultant for various movies and\n\n2:22:10.160 --> 2:22:13.620\n one in particular I learned a lot from and that was The Conjuring.\n\n2:22:13.620 --> 2:22:17.480\n So I was a history consultant for The Conjuring.\n\n2:22:17.480 --> 2:22:21.480\n It happens to be my field, it's Catholic studies, right?\n\n2:22:21.480 --> 2:22:25.060\n And you've got these people who are real people and they're, you know, exercising demons and\n\n2:22:25.060 --> 2:22:26.060\n things like that.\n\n2:22:26.060 --> 2:22:28.880\n Okay, so I thought, wow, this is a great example for me.\n\n2:22:28.880 --> 2:22:30.520\n You know, I didn't do it for the money.\n\n2:22:30.520 --> 2:22:33.440\n It doesn't pay well, but I did it to learn, right?\n\n2:22:33.440 --> 2:22:37.880\n So I work closely with the screenwriters who I work with now all the time.\n\n2:22:37.880 --> 2:22:40.280\n I work with them all the time now.\n\n2:22:40.280 --> 2:22:44.960\n And what I found was this, I found that as the most interesting part of the creation\n\n2:22:44.960 --> 2:22:51.640\n of this movie was the editing process because it would go through editing and they would\n\n2:22:51.640 --> 2:22:58.060\n use test audiences and a lot of the test audiences would be like, you know, there's like these\n\n2:22:58.060 --> 2:23:02.040\n things where they test their flicker rates and things like that, the eye flicker rates.\n\n2:23:02.040 --> 2:23:08.920\n And so, and when it goes really intense, they go to UC Irvine and they do this thing called\n\n2:23:08.920 --> 2:23:16.680\n cognitive consumption, which is basically, or I'm sorry, cognitive consumerism, where\n\n2:23:16.680 --> 2:23:22.680\n they basically hook test audiences up to EKGs and they read their brains and they figure\n\n2:23:22.680 --> 2:23:25.680\n out which scenes create the most.\n\n2:23:25.680 --> 2:23:26.680\n Arousal.\n\n2:23:26.680 --> 2:23:27.680\n Yeah.\n\n2:23:27.680 --> 2:23:29.400\n And then they cut out all the other scenes.\n\n2:23:29.400 --> 2:23:30.400\n Okay?\n\n2:23:30.400 --> 2:23:33.680\n So what we're getting is we're getting like this drug when we go to the movies or when\n\n2:23:33.680 --> 2:23:40.080\n we do video games or when we watch, we're literally physiologically responding to our\n\n2:23:40.080 --> 2:23:41.080\n technologies.\n\n2:23:41.080 --> 2:23:42.080\n So we're already there.\n\n2:23:42.080 --> 2:23:44.520\n We're already interfacing with them physiologically.\n\n2:23:44.520 --> 2:23:45.840\n So that's my example.\n\n2:23:45.840 --> 2:23:52.560\n Now, the kind of thing that he's doing, Musk is doing with Neuralink, I say, go for it.\n\n2:23:52.560 --> 2:23:53.560\n That's awesome.\n\n2:23:53.560 --> 2:23:54.560\n I hope he does it.\n\n2:23:54.560 --> 2:23:55.560\n You know, I'm fascinated.\n\n2:23:55.560 --> 2:23:57.520\n I want it to happen.\n\n2:23:57.520 --> 2:23:59.080\n Why do I want it to happen?\n\n2:23:59.080 --> 2:24:03.600\n Because I think that, well, first it's inevitable that it's going to happen.\n\n2:24:03.600 --> 2:24:08.040\n I also want to point out that Jacques Vallée was trying to get this done back in the sixties\n\n2:24:08.040 --> 2:24:09.120\n and the seventies.\n\n2:24:09.120 --> 2:24:17.960\n He was writing papers about, in fact, the ARPANET, the ProtoInternet was called Augmentation\n\n2:24:17.960 --> 2:24:19.920\n of the Human Intellect.\n\n2:24:19.920 --> 2:24:21.960\n So we've been doing this for a while.\n\n2:24:21.960 --> 2:24:22.960\n Okay?\n\n2:24:22.960 --> 2:24:27.000\n So props to Elon Musk, but we've been thinking about this for a good time.\n\n2:24:27.000 --> 2:24:29.760\n We've even been visioning it.\n\n2:24:29.760 --> 2:24:30.760\n Okay?\n\n2:24:30.760 --> 2:24:37.800\n So there was a really interesting Jesuit priest, he was French, Tellur de Chardin.\n\n2:24:37.800 --> 2:24:39.640\n I don't know if you know who he is.\n\n2:24:39.640 --> 2:24:41.360\n If not, he's fascinating.\n\n2:24:41.360 --> 2:24:45.900\n He was actually a soldier before he became a priest.\n\n2:24:45.900 --> 2:24:49.920\n And so he believed, he also saw what he called a biosphere.\n\n2:24:49.920 --> 2:24:55.340\n Now this guy is talking in like the early 20th century, like the 1917, 19, you know,\n\n2:24:55.340 --> 2:24:56.520\n that time period.\n\n2:24:56.520 --> 2:25:01.480\n And so basically he said and wrote about this thing called the noosphere.\n\n2:25:01.480 --> 2:25:05.520\n And he basically said, there will be a point when we merge with our technology and it's\n\n2:25:05.520 --> 2:25:08.240\n going to be somewhat like some kind of a biosphere.\n\n2:25:08.240 --> 2:25:13.240\n We have this atmosphere and then we have the stratosphere and it's going to be this biosphere\n\n2:25:13.240 --> 2:25:16.140\n and we're all going to be hooked into it mentally.\n\n2:25:16.140 --> 2:25:20.600\n So we'll be able to communicate in a way in which we don't communicate now.\n\n2:25:20.600 --> 2:25:23.940\n So you know, that sounds so similar to the singularity.\n\n2:25:23.940 --> 2:25:30.720\n So after I've read him many, many years ago, but when I read the Kurzweil's book about\n\n2:25:30.720 --> 2:25:36.460\n the singularity, to me, it read just like religious language.\n\n2:25:36.460 --> 2:25:42.640\n Like it read like, you know, cause he, in fact, it's so much like revelation to me when\n\n2:25:42.640 --> 2:25:46.040\n I read it that I even assign it to my students in my classes.\n\n2:25:46.040 --> 2:25:48.200\n I'm like, this is, this is it.\n\n2:25:48.200 --> 2:25:53.080\n You know, this is like a really great book of the singularity, you know, the coming singularity.\n\n2:25:53.080 --> 2:25:58.240\n And this religious event, because it seems like it, when he writes about it, he says,\n\n2:25:58.240 --> 2:26:01.320\n I felt it before I even understood it.\n\n2:26:01.320 --> 2:26:02.320\n You know?\n\n2:26:02.320 --> 2:26:03.320\n He, I mean Kurzweil.\n\n2:26:03.320 --> 2:26:04.320\n Kurzweil, yeah, Kurzweil.\n\n2:26:04.320 --> 2:26:10.000\n So what, I mean, what are your feelings about, not feelings, thoughts, feelings too, about\n\n2:26:10.000 --> 2:26:12.760\n the idea of the singularity?\n\n2:26:12.760 --> 2:26:17.080\n Do you think it's ultimately the thing that echoes throughout the history of ideas is\n\n2:26:17.080 --> 2:26:27.240\n this like moment of a revelation, like this, this almost mythological religious moment?\n\n2:26:27.240 --> 2:26:37.200\n Or is there something more physical to this idea of concrete about the idea of, there'll\n\n2:26:37.200 --> 2:26:43.880\n come a point where our technology, there'll be like a phase shift between the basic fabric\n\n2:26:43.880 --> 2:26:49.120\n of like humanity, of how we interact, you know, how evolution brought us to be these\n\n2:26:49.120 --> 2:26:56.040\n biological interaction, that our technology crosses some kind of line of capability that\n\n2:26:56.040 --> 2:27:01.960\n the world would be more technology than human to where it'll leave us behind.\n\n2:27:01.960 --> 2:27:02.960\n Sort of.\n\n2:27:02.960 --> 2:27:03.960\n Oh yeah.\n\n2:27:03.960 --> 2:27:05.680\n I don't think it's going to leave us behind.\n\n2:27:05.680 --> 2:27:08.400\n I think it's going to take us along.\n\n2:27:08.400 --> 2:27:12.320\n But it will be, I mean, I guess the idea of the singularity, first of all, isn't the\n\n2:27:12.320 --> 2:27:15.520\n idea of the singularity is like, we can't possibly predict what's on the other side\n\n2:27:15.520 --> 2:27:16.520\n of the singularity.\n\n2:27:16.520 --> 2:27:21.240\n These are the senses like, this is like the world will be fundamentally transformed.\n\n2:27:21.240 --> 2:27:22.240\n Yes.\n\n2:27:22.240 --> 2:27:23.240\n Okay.\n\n2:27:23.240 --> 2:27:24.240\n So right.\n\n2:27:24.240 --> 2:27:28.280\n And then it was, you know, this was characterized in various movies like Lucy and stuff like\n\n2:27:28.280 --> 2:27:29.280\n that.\n\n2:27:29.280 --> 2:27:34.360\n You know, Lucy being the first human that, right, we, so kind of replicating that this\n\n2:27:34.360 --> 2:27:38.960\n is going to be the next iteration of humans is the singularity.\n\n2:27:38.960 --> 2:27:41.360\n I actually don't believe that.\n\n2:27:41.360 --> 2:27:47.040\n I'm frankly, however, and the reason I don't believe it is because we're material beings\n\n2:27:47.040 --> 2:27:49.440\n and technology has to have a host.\n\n2:27:49.440 --> 2:27:54.000\n So we're not going to, you know, become something super abstract.\n\n2:27:54.000 --> 2:27:56.480\n Like there's, it's just impossible to do.\n\n2:27:56.480 --> 2:27:57.480\n There's nothing like that.\n\n2:27:57.480 --> 2:28:01.680\n Well, people will be listening to this podcast a hundred years from now and laughing at it\n\n2:28:01.680 --> 2:28:08.880\n because they'll be all existing in a virtual reality where it will be all information as\n\n2:28:08.880 --> 2:28:17.000\n opposed to material, meaning connected to some kind of concept of physical, physical\n\n2:28:17.000 --> 2:28:18.000\n reality.\n\n2:28:18.000 --> 2:28:19.000\n I don't even know the right words to use here.\n\n2:28:19.000 --> 2:28:24.680\n You see, that's because there are none because there's no place from, there's no view from\n\n2:28:24.680 --> 2:28:25.680\n nowhere.\n\n2:28:25.680 --> 2:28:32.320\n There's no non material, like we have thoughts, but they're connected to us, right?\n\n2:28:32.320 --> 2:28:35.280\n They're in our, you know, they're somehow, okay.\n\n2:28:35.280 --> 2:28:37.640\n As far as, as far as you know.\n\n2:28:37.640 --> 2:28:43.840\n Listen, platonic forms, I think is about as, as, you know, close to what we're talking\n\n2:28:43.840 --> 2:28:45.640\n about as possible.\n\n2:28:45.640 --> 2:28:50.280\n Like this place where these things exist and then there's like a physical instantiation\n\n2:28:50.280 --> 2:28:51.280\n of it.\n\n2:28:51.280 --> 2:28:57.840\n No, but see we're, the question is from the perspective of the platonic form, what does\n\n2:28:57.840 --> 2:29:00.440\n our physical world look like?\n\n2:29:00.440 --> 2:29:01.440\n You know what I'm saying?\n\n2:29:01.440 --> 2:29:06.680\n Like, you know, if, if, if say you're a creature existing in a virtual reality, like if you\n\n2:29:06.680 --> 2:29:13.720\n grew up your whole life in a virtual reality game, like what is it?\n\n2:29:13.720 --> 2:29:18.400\n And somebody in that virtual reality world tells you that there actually exists this\n\n2:29:18.400 --> 2:29:25.960\n physical world and in fact your own, you think you're in this virtual world, but it's actually\n\n2:29:25.960 --> 2:29:31.200\n you're in a body and this is just your mind putting yourself and there's a piece of technology.\n\n2:29:31.200 --> 2:29:35.800\n Like how will they, how will they be able to think of that physical world?\n\n2:29:35.800 --> 2:29:40.160\n Would they, would they sound exactly like you just sounded a minute ago saying like,\n\n2:29:40.160 --> 2:29:41.800\n well, that's silly.\n\n2:29:41.800 --> 2:29:44.440\n Who cares if there's a physical world?\n\n2:29:44.440 --> 2:29:52.900\n It's the, the entirety of the perception and my memories and all of that is in this other\n\n2:29:52.900 --> 2:29:57.200\n realm of, of like information.\n\n2:29:57.200 --> 2:29:58.980\n It's just all just information.\n\n2:29:58.980 --> 2:30:02.800\n Why do I need some kind of weird meat bag to contain?\n\n2:30:02.800 --> 2:30:08.120\n So there's a great, again, I always, you know, return to something for your audience to read\n\n2:30:08.120 --> 2:30:14.280\n or you, there's a great, very short article online for free by David Chalmers.\n\n2:30:14.280 --> 2:30:15.600\n Do you know him?\n\n2:30:15.600 --> 2:30:16.600\n He's the philosopher of consciousness.\n\n2:30:16.600 --> 2:30:17.600\n Yeah.\n\n2:30:17.600 --> 2:30:18.600\n Interviewed him on this podcast.\n\n2:30:18.600 --> 2:30:19.600\n Yeah.\n\n2:30:19.600 --> 2:30:20.600\n Yeah.\n\n2:30:20.600 --> 2:30:21.600\n Yeah.\n\n2:30:21.600 --> 2:30:22.600\n He's cool.\n\n2:30:22.600 --> 2:30:27.160\n I used to, I was friends with his best friend for a while when, in, when I was in grad school.\n\n2:30:27.160 --> 2:30:29.360\n He probably has some weird friends.\n\n2:30:29.360 --> 2:30:30.360\n He does.\n\n2:30:30.360 --> 2:30:32.960\n He's a philosopher.\n\n2:30:32.960 --> 2:30:33.960\n Okay.\n\n2:30:33.960 --> 2:30:39.440\n So, I like his fashion choice and his style too and hang out with him a little bit.\n\n2:30:39.440 --> 2:30:40.440\n It's a great guy.\n\n2:30:40.440 --> 2:30:41.440\n Okay.\n\n2:30:41.440 --> 2:30:44.960\n So he wrote this article, which I use a lot.\n\n2:30:44.960 --> 2:30:51.200\n I love it because it's accessible to undergraduates and it's called Matrix as Metaphysics.\n\n2:30:51.200 --> 2:30:56.960\n And basically it's, it's an answer to external world skepticism, which is basically how do\n\n2:30:56.960 --> 2:30:58.940\n we know there's an external world, right?\n\n2:30:58.940 --> 2:31:01.540\n How do we know that we're not in a matrix right now?\n\n2:31:01.540 --> 2:31:09.680\n And so basically he's using, he's also, he even references, he uses a religious reference\n\n2:31:09.680 --> 2:31:10.680\n even.\n\n2:31:10.680 --> 2:31:19.600\n He says, you could think of the Matrix of the movie as a new, as the new book of Genesis\n\n2:31:19.600 --> 2:31:21.600\n for our new world, right?\n\n2:31:21.600 --> 2:31:28.360\n And I thought, yeah, that's absolutely correct because, you know, we don't know and we don't,\n\n2:31:28.360 --> 2:31:34.960\n we won't know for sure or for certain, therefore what we know is what is real to us.\n\n2:31:34.960 --> 2:31:40.280\n And so he goes through these scenarios and within philosophy it's called, there's a,\n\n2:31:40.280 --> 2:31:43.440\n this is different from that, but it's like this brain in a vat, right?\n\n2:31:43.440 --> 2:31:48.880\n If you're a brain in a vat and some not so kind scientist is like recreating this world\n\n2:31:48.880 --> 2:31:54.080\n for you just to see, you know, and you think you're this awesome rock star, right?\n\n2:31:54.080 --> 2:31:57.260\n And you're living this awesome existence, but you're actually just this brain in this\n\n2:31:57.260 --> 2:31:58.260\n vat.\n\n2:31:58.260 --> 2:31:59.260\n Okay.\n\n2:31:59.260 --> 2:32:01.300\n But there's still a brain in a vat, okay?\n\n2:32:01.300 --> 2:32:08.680\n So his idea in The Matrix as metaphysics kind of takes out the brain in a vat like this.\n\n2:32:08.680 --> 2:32:10.480\n I don't know if this is possible.\n\n2:32:10.480 --> 2:32:15.880\n So I've read critiques of this that, you know, what you're talking about is a non dualism,\n\n2:32:15.880 --> 2:32:24.920\n like there's like, you know, or it's not necessarily a non dualism.\n\n2:32:24.920 --> 2:32:32.080\n I just, I mean, information in and of itself has to have some kind of material component\n\n2:32:32.080 --> 2:32:33.080\n to it.\n\n2:32:33.080 --> 2:32:38.920\n I mean, it's that when taking it outside of the realm of human beings, because dualism\n\n2:32:38.920 --> 2:32:44.660\n is kind of talking about humans in a sense, it's just possible to me that there could\n\n2:32:44.660 --> 2:32:51.480\n be creatures that exist in a very different form, perhaps rely on very different set of\n\n2:32:51.480 --> 2:32:57.680\n materials that may perhaps not even look like materials to us.\n\n2:32:57.680 --> 2:32:58.880\n Yes, I agree.\n\n2:32:58.880 --> 2:33:06.880\n Which is why like information, it could be, even in computers, the information that's\n\n2:33:06.880 --> 2:33:15.680\n traveling inside a computer is connected to actual material movement, right?\n\n2:33:15.680 --> 2:33:20.600\n So like it is ultimately connected to material movement, but it's less and less about the\n\n2:33:20.600 --> 2:33:24.160\n material and more and more about the information.\n\n2:33:24.160 --> 2:33:27.360\n So I just mean that there's, it's possible that...\n\n2:33:27.360 --> 2:33:32.520\n You think the singularity is basically like sloughing off our material existence?\n\n2:33:32.520 --> 2:33:38.920\n Because I can tell you that this has been the hope of philosophers and theologians forever.\n\n2:33:38.920 --> 2:33:43.360\n Yeah, well, I don't, I think we're living in a, through a singularity.\n\n2:33:43.360 --> 2:33:50.440\n I don't think, I think this world, just like, as you've said already, has been already\n\n2:33:50.440 --> 2:33:53.360\n transformed significantly and keeps continually being transformed.\n\n2:33:53.360 --> 2:33:54.360\n Yes.\n\n2:33:54.360 --> 2:33:59.120\n And we're just riding this big, beautiful wave of transformation.\n\n2:33:59.120 --> 2:34:08.600\n And that's why it's both exciting and terrifying from a scientific perspective that like we're\n\n2:34:08.600 --> 2:34:15.000\n so bad at predicting the future and the future is always so amazing in terms of the things\n\n2:34:15.000 --> 2:34:16.240\n that has brought us.\n\n2:34:16.240 --> 2:34:21.560\n I mean, I don't know if it's always will be this exciting in terms of the rate of innovation,\n\n2:34:21.560 --> 2:34:23.760\n but it seems to be increasing still.\n\n2:34:23.760 --> 2:34:25.600\n And it's really exciting.\n\n2:34:25.600 --> 2:34:26.600\n It's exciting.\n\n2:34:26.600 --> 2:34:27.600\n I think so too.\n\n2:34:27.600 --> 2:34:28.600\n Yeah.\n\n2:34:28.600 --> 2:34:32.720\n It's terrifying because obviously we're building better and better tools for destroying ourselves.\n\n2:34:32.720 --> 2:34:38.720\n But I, on the optimistic side, believe that we're also can build better and better tools\n\n2:34:38.720 --> 2:34:41.600\n to defend against all the ways we can destroy ourselves.\n\n2:34:41.600 --> 2:34:45.560\n And it's kind of this interesting race of innovation.\n\n2:34:45.560 --> 2:34:47.680\n Yeah.\n\n2:34:47.680 --> 2:34:48.680\n Books are great.\n\n2:34:48.680 --> 2:34:53.160\n Of course, the greatest book of all time, two of the greatest books of all time are\n\n2:34:53.160 --> 2:34:54.160\n yours.\n\n2:34:54.160 --> 2:35:04.440\n But besides those, what books, technical, fiction or philosophical, had an impact on\n\n2:35:04.440 --> 2:35:10.800\n your life or possibly you think others might want to read and get some insights from?\n\n2:35:10.800 --> 2:35:13.040\n And what ideas did you pick up from them?\n\n2:35:13.040 --> 2:35:14.040\n Great.\n\n2:35:14.040 --> 2:35:16.480\n Okay, I really enjoy Nietzsche.\n\n2:35:16.480 --> 2:35:17.480\n Okay.\n\n2:35:17.480 --> 2:35:19.800\n So anything by Nietzsche, Friedrich Nietzsche.\n\n2:35:19.800 --> 2:35:20.800\n He's a philosopher.\n\n2:35:20.800 --> 2:35:25.880\n I actually hated him when I first read him in my early twenties.\n\n2:35:25.880 --> 2:35:28.400\n That's like the opposite of most people's experience, right?\n\n2:35:28.400 --> 2:35:32.960\n They usually love them in their twenties and then they throw them to the curb.\n\n2:35:32.960 --> 2:35:33.960\n Later.\n\n2:35:33.960 --> 2:35:34.960\n Yeah.\n\n2:35:34.960 --> 2:35:38.240\n I think he's totally misrepresented and misinterpreted.\n\n2:35:38.240 --> 2:35:39.240\n He grew on you.\n\n2:35:39.240 --> 2:35:41.500\n Well, it happened in one night.\n\n2:35:41.500 --> 2:35:45.440\n So let me just describe it because it's kind of funny.\n\n2:35:45.440 --> 2:35:46.440\n Yeah.\n\n2:35:46.440 --> 2:35:47.440\n Happened on New Year's.\n\n2:35:47.440 --> 2:35:51.960\n So I had friends when I was in my twenties and they kept telling me, you have to read\n\n2:35:51.960 --> 2:35:52.960\n Nietzsche, you have to read Nietzsche.\n\n2:35:52.960 --> 2:35:53.960\n And I tried.\n\n2:35:53.960 --> 2:35:54.960\n Okay.\n\n2:35:54.960 --> 2:36:02.080\n But again, you know, no, I was not into how he described the philosophical concepts he\n\n2:36:02.080 --> 2:36:04.360\n was trying to get across.\n\n2:36:04.360 --> 2:36:09.320\n But they weren't giving up, I have very persistent friends.\n\n2:36:09.320 --> 2:36:18.160\n So one of them gave me The Gay Science and I had it on my bookstand and it was New Year's\n\n2:36:18.160 --> 2:36:22.120\n Eve and I'm actually not a big part, I'm actually an introvert.\n\n2:36:22.120 --> 2:36:24.160\n I'm a geeky introvert, okay?\n\n2:36:24.160 --> 2:36:26.320\n So I don't go out and party a lot.\n\n2:36:26.320 --> 2:36:29.440\n It was New Year's Eve, even that couldn't get me out to go party.\n\n2:36:29.440 --> 2:36:34.780\n So I just wanted to go to bed and New Year's Eve hit and everybody went out and I was asleep\n\n2:36:34.780 --> 2:36:38.680\n and they woke me up and I was like, darn, they woke me up, eh, might as well read this\n\n2:36:38.680 --> 2:36:39.680\n book by Nietzsche.\n\n2:36:39.680 --> 2:36:40.680\n Okay.\n\n2:36:40.680 --> 2:36:45.200\n So I picked it up and lo and behold, I turned to a page that was exactly about, it was called\n\n2:36:45.200 --> 2:36:50.320\n Sanctus Januarius, which is basically St. January and it was about New Year's Eve.\n\n2:36:50.320 --> 2:36:53.000\n And I thought, whoa, what a weird coincidence.\n\n2:36:53.000 --> 2:36:59.040\n And it was also super Catholic and it was a really beautiful little aphorism.\n\n2:36:59.040 --> 2:37:03.180\n It's actually a book of aphorisms, which are kind of religious, right?\n\n2:37:03.180 --> 2:37:08.080\n And so it's religious, the genre is religious, let's put it that way, but he's not.\n\n2:37:08.080 --> 2:37:13.760\n So basically he says, today's the day when people are supposed to make these resolutions,\n\n2:37:13.760 --> 2:37:14.760\n right?\n\n2:37:14.760 --> 2:37:20.600\n And he says, from here on out, I will never say no, I will only say yes.\n\n2:37:20.600 --> 2:37:21.600\n Okay.\n\n2:37:21.600 --> 2:37:24.400\n I look away, if something's horrible, I'll just look away from it, I won't get angry\n\n2:37:24.400 --> 2:37:25.400\n at it.\n\n2:37:25.400 --> 2:37:28.440\n And then he also says, I will be like St. January.\n\n2:37:28.440 --> 2:37:33.600\n And St. January is actually the saint whose blood is in this place in Italy.\n\n2:37:33.600 --> 2:37:39.660\n I think it's in Italy, and every year it turns to blood again.\n\n2:37:39.660 --> 2:37:46.800\n So it's like it's desiccated, so it's this miracle, it says, my blood is now, it flows\n\n2:37:46.800 --> 2:37:47.800\n again.\n\n2:37:47.800 --> 2:37:48.800\n And I was like, wow, that's really beautiful.\n\n2:37:48.800 --> 2:37:54.120\n And I said, and a strange coincidence because it just turned 12th.\n\n2:37:54.120 --> 2:37:59.060\n So it's like New Year's Eve, I pick up the book, I read this aphorism and I said, strange\n\n2:37:59.060 --> 2:38:00.680\n coincidence that.\n\n2:38:00.680 --> 2:38:03.720\n And then I turned the page, and the page is about coincidences.\n\n2:38:03.720 --> 2:38:07.440\n And I was like, I shut it, and I thought, this is weird.\n\n2:38:07.440 --> 2:38:11.280\n And I felt like it was alive, I felt like the book was alive and Nietzsche was speaking\n\n2:38:11.280 --> 2:38:12.280\n to me, right?\n\n2:38:12.280 --> 2:38:15.540\n I had a experience and engagement with Nietzsche.\n\n2:38:15.540 --> 2:38:21.240\n And so after that, I couldn't put his stuff down, it was engaging, fascinating, everything.\n\n2:38:21.240 --> 2:38:23.600\n So yeah, so that's one book, The Gay Science.\n\n2:38:23.600 --> 2:38:27.520\n What did you pick up from The Gay Science or from Nietzsche in general?\n\n2:38:27.520 --> 2:38:30.920\n Because there's some ideas that just kind of...\n\n2:38:30.920 --> 2:38:35.840\n Yeah, the idea is basically that truth, he's got awesome one liners.\n\n2:38:35.840 --> 2:38:39.280\n So truth is a woman.\n\n2:38:39.280 --> 2:38:42.740\n So okay, what does he mean by that?\n\n2:38:42.740 --> 2:38:43.740\n Truth is a woman.\n\n2:38:43.740 --> 2:38:45.560\n Basically, she's going to lie to you.\n\n2:38:45.560 --> 2:38:49.840\n She looks real attractive, but she's not going to tell you the truth.\n\n2:38:49.840 --> 2:38:51.560\n Oh, Nietzsche.\n\n2:38:51.560 --> 2:38:52.560\n Yeah.\n\n2:38:52.560 --> 2:38:56.720\n So okay, so basically, I'm not saying that that's true about women.\n\n2:38:56.720 --> 2:38:58.800\n I'm obviously a woman.\n\n2:38:58.800 --> 2:39:04.680\n So basically what he's saying is that truth is like what I said, Brother Guy said, it's\n\n2:39:04.680 --> 2:39:06.560\n a moving target, okay?\n\n2:39:06.560 --> 2:39:09.920\n We started this whole conversation with what's real, right?\n\n2:39:09.920 --> 2:39:11.880\n So I should have just gone straight to Nietzsche.\n\n2:39:11.880 --> 2:39:13.880\n Haven't you heard truth is a woman?\n\n2:39:13.880 --> 2:39:17.080\n Okay, so truth is a woman.\n\n2:39:17.080 --> 2:39:21.480\n All right, so that and also, and Foucault, this other philosopher, French philosopher\n\n2:39:21.480 --> 2:39:28.120\n actually takes up this idea and creates his own framework called genealogy from it.\n\n2:39:28.120 --> 2:39:34.080\n So the genealogy of morals, so that we only believe certain things and we sediment them\n\n2:39:34.080 --> 2:39:35.080\n into truth.\n\n2:39:35.080 --> 2:39:38.920\n So we say a truth told, who said that?\n\n2:39:38.920 --> 2:39:40.400\n Was it Lenin or Stalin?\n\n2:39:40.400 --> 2:39:46.440\n A truth told enough times, I mean, a lie told enough times becomes the truth.\n\n2:39:46.440 --> 2:39:48.520\n So that's basically Nietzschean right there, okay?\n\n2:39:48.520 --> 2:39:49.520\n So that's Nietzsche.\n\n2:39:49.520 --> 2:39:56.000\n So Nietzsche also is a huge critic of Christianity, which I'm actually Catholic, I'm a practicing\n\n2:39:56.000 --> 2:39:57.000\n Catholic.\n\n2:39:57.000 --> 2:40:02.640\n So I appreciated his critique, I thought it was actually quite accurate.\n\n2:40:02.640 --> 2:40:06.400\n He's a critique of religion in general and he's fascinating.\n\n2:40:06.400 --> 2:40:12.160\n And also I find that he talks about altered states of consciousness and he calls them\n\n2:40:12.160 --> 2:40:14.240\n elevated states.\n\n2:40:14.240 --> 2:40:18.280\n And I think through his book, you can actually experience elevated states.\n\n2:40:18.280 --> 2:40:23.680\n So yeah, Nietzsche, thumbs up.\n\n2:40:23.680 --> 2:40:24.680\n So what other books?\n\n2:40:24.680 --> 2:40:25.680\n Yeah, okay.\n\n2:40:25.680 --> 2:40:30.600\n So Hannah Rent, she is a philosopher that not a lot of people know about, but she was\n\n2:40:30.600 --> 2:40:38.560\n a Jewish woman during the Holocaust and she was interned at Bergen Belsen, which was basically\n\n2:40:38.560 --> 2:40:42.000\n Auschwitz for women and she escaped.\n\n2:40:42.000 --> 2:40:45.600\n She came to the United States and she had worked with Heidegger, even though he's supposed\n\n2:40:45.600 --> 2:40:50.800\n to be anti Semitic and a Nazi and everything, but they were lovers, okay?\n\n2:40:50.800 --> 2:40:55.160\n So she comes out and she's at Columbia University and she teaches philosophy there.\n\n2:40:55.160 --> 2:40:58.680\n And she writes two books, which I'll recommend.\n\n2:40:58.680 --> 2:41:03.480\n One is called Eichmann in Jerusalem, where she attends the Nuremberg trials.\n\n2:41:03.480 --> 2:41:07.800\n And she basically makes this really astute observation about evil.\n\n2:41:07.800 --> 2:41:11.720\n And she says, Eichmann is one of the people who sent the Jews to the concentration camps\n\n2:41:11.720 --> 2:41:14.220\n who ran the trains, okay?\n\n2:41:14.220 --> 2:41:19.960\n And she said, the thing about Eichmann was that he didn't seem particularly evil.\n\n2:41:19.960 --> 2:41:23.360\n Actually, he seemed to be quite a nice guy.\n\n2:41:23.360 --> 2:41:28.360\n She said, what was interesting about him was he seemed incredibly thoughtless and stupid.\n\n2:41:28.360 --> 2:41:31.520\n And she said, and he used a lot of stereotypes like memes.\n\n2:41:31.520 --> 2:41:34.640\n So she actually wrote about memes before we had them.\n\n2:41:34.640 --> 2:41:38.280\n And now people just use memes and they're actually used against us even.\n\n2:41:38.280 --> 2:41:42.800\n There's even a segments of warfare called memetic warfare, all right?\n\n2:41:42.800 --> 2:41:47.040\n So memes are something that can sway a whole population of people.\n\n2:41:47.040 --> 2:41:50.680\n So she wrote about memes before they were even in existence.\n\n2:41:50.680 --> 2:41:51.680\n And that's Eichmann in Jerusalem.\n\n2:41:51.680 --> 2:41:58.400\n And I think she also has some really amazing things to say about evil is that when people\n\n2:41:58.400 --> 2:42:02.880\n remain thoughtless, she has another book called The Life of the Mind, which is gigantic.\n\n2:42:02.880 --> 2:42:07.480\n And I don't think anybody will read it, but frankly, it's one of the best books I've\n\n2:42:07.480 --> 2:42:08.480\n ever read.\n\n2:42:08.480 --> 2:42:09.920\n And I've read it many times.\n\n2:42:09.920 --> 2:42:13.720\n And basically, The Life of the Mind, in The Life of the Mind, she asks a very simple question.\n\n2:42:13.720 --> 2:42:15.840\n She says, why do people do bad things?\n\n2:42:15.840 --> 2:42:17.040\n Why are they evil?\n\n2:42:17.040 --> 2:42:22.580\n And what she says is she wonders if it's, she says that bad people sleep well at night\n\n2:42:22.580 --> 2:42:25.720\n contrary to, you know how the saying, how do you sleep at night?\n\n2:42:25.720 --> 2:42:29.160\n Well, that's only because you're a good person that you're asking that question because you\n\n2:42:29.160 --> 2:42:33.640\n actually have a conscience and a conscience is this dual kind of, you fight with yourself\n\n2:42:33.640 --> 2:42:36.480\n about the consequences of your actions.\n\n2:42:36.480 --> 2:42:39.820\n And she says, bad people don't seem to have a conscience.\n\n2:42:39.820 --> 2:42:41.640\n Do they actually sleep well at night?\n\n2:42:41.640 --> 2:42:45.880\n And so she goes through a whole history of philosophy about evil, and that's really a\n\n2:42:45.880 --> 2:42:46.880\n good one too.\n\n2:42:46.880 --> 2:42:49.040\n But I also have to recommend this one too.\n\n2:42:49.040 --> 2:42:50.040\n There's one more.\n\n2:42:50.040 --> 2:42:53.100\n So I know I recommended two, but just from the same philosopher.\n\n2:42:53.100 --> 2:42:58.600\n My friend Jeffrey Kreipel, he's at Rice University and he's in my field, religious studies.\n\n2:42:58.600 --> 2:42:59.880\n He's written several books.\n\n2:42:59.880 --> 2:43:02.600\n I mean, he's written a heck of a lot of books, let's put it that way.\n\n2:43:02.600 --> 2:43:07.520\n But I think his best book or the one that impacted me the most is called Authors of\n\n2:43:07.520 --> 2:43:09.200\n the Impossible.\n\n2:43:09.200 --> 2:43:15.120\n And his book, his writing is very much like Nietzsche's writing in the sense that he,\n\n2:43:15.120 --> 2:43:19.200\n it's almost as if he reaches out of the pages and he grabs you and he kind of slaps you\n\n2:43:19.200 --> 2:43:24.600\n around and says, think about this, you know, and you can't help but be changed after you've\n\n2:43:24.600 --> 2:43:25.600\n read it.\n\n2:43:25.600 --> 2:43:27.720\n And he's got a great chapter in there about Jacques Vallée.\n\n2:43:27.720 --> 2:43:37.240\n Oh, so he covers a bunch of different thinkers and authors that somehow are, what is it?\n\n2:43:37.240 --> 2:43:39.720\n Some aspect of revolutionism aspect.\n\n2:43:39.720 --> 2:43:42.180\n They're thinking the impossible.\n\n2:43:42.180 --> 2:43:47.520\n There's a great one he's written called Mutants and Mystics, where he talks about the comic\n\n2:43:47.520 --> 2:43:52.040\n strips, the, gosh, why can't I remember the name of the person?\n\n2:43:52.040 --> 2:43:53.760\n He just died, Stan Lee.\n\n2:43:53.760 --> 2:43:58.700\n He talks about the history of the comics by Stan Lee and they're all paranormal.\n\n2:43:58.700 --> 2:44:03.240\n They all start off super paranormal and it's fascinating.\n\n2:44:03.240 --> 2:44:13.280\n On the topic of Hannah Arendt, so I haven't read her work, but I've vaguely touched upon\n\n2:44:13.280 --> 2:44:20.320\n sort of like commentary of her work and it seems like some people think her work is dangerous\n\n2:44:20.320 --> 2:44:21.320\n in some aspect.\n\n2:44:21.320 --> 2:44:27.160\n I don't know if you can comment on why that is.\n\n2:44:27.160 --> 2:44:32.400\n It feels like similar with Ayn Rand or something like that, where like this is, I should say\n\n2:44:32.400 --> 2:44:34.120\n not dangerous, but controversial.\n\n2:44:34.120 --> 2:44:35.120\n Yes, it is.\n\n2:44:35.120 --> 2:44:36.880\n Yes, they think it's controversial.\n\n2:44:36.880 --> 2:44:40.360\n This is the reason I believe, I've heard of the controversy.\n\n2:44:40.360 --> 2:44:47.520\n The controversy is that she didn't, first of all, she is Jewish and she did escape a\n\n2:44:47.520 --> 2:44:54.360\n concentration camp and yet she's called, she's been called anti Jewish.\n\n2:44:54.360 --> 2:45:01.600\n And I think part of that was that she basically was saying something that I believe that a\n\n2:45:01.600 --> 2:45:08.760\n lot of normal people are like Eichmann and evil things are done by people who just follow\n\n2:45:08.760 --> 2:45:12.640\n the rules and they don't think about what they're doing.\n\n2:45:12.640 --> 2:45:18.320\n And that's one of the most pernicious forms of evil of our time.\n\n2:45:18.320 --> 2:45:24.820\n So we talked quite a bit about the definitions of religion and what are the different building\n\n2:45:24.820 --> 2:45:26.280\n blocks of religion.\n\n2:45:26.280 --> 2:45:32.020\n So one of the, I don't think we touched on, we did a little bit with the afterlife, but\n\n2:45:32.020 --> 2:45:36.440\n in a sense, I don't know if you're familiar with the Ernest Becker work and all the philosophies\n\n2:45:36.440 --> 2:45:44.940\n around there about the fear of death and how the fear of our own mortality, awareness of\n\n2:45:44.940 --> 2:45:57.120\n our mortality and its fear is in case of Ernest Becker is a significant component in the psychology\n\n2:45:57.120 --> 2:46:01.320\n in the way we humans develop our understanding of the world.\n\n2:46:01.320 --> 2:46:09.440\n So what are your thoughts in the context of religion or maybe in the context of your own\n\n2:46:09.440 --> 2:46:19.760\n mind about the role of death in life or fear of death in life and are you afraid of death?\n\n2:46:19.760 --> 2:46:22.520\n We cover everything in this podcast.\n\n2:46:22.520 --> 2:46:25.280\n Every single topic is covered.\n\n2:46:25.280 --> 2:46:26.280\n Wow.\n\n2:46:26.280 --> 2:46:27.280\n Okay.\n\n2:46:27.280 --> 2:46:36.600\n I so happen to have benefited perhaps from living with an older brother who seemingly\n\n2:46:36.600 --> 2:46:42.880\n had no fear of death while growing up and he did everything, okay?\n\n2:46:42.880 --> 2:46:49.440\n So he climbed mountains, he was a rock climber, he jumped out of airplanes.\n\n2:46:49.440 --> 2:46:53.720\n Of course, he had to be a Green Beret and go into the special forces where that type\n\n2:46:53.720 --> 2:46:57.800\n of thing is a requirement, right?\n\n2:46:57.800 --> 2:47:03.340\n And so because of that, I did a lot of things outside of my comfort zone and which probably\n\n2:47:03.340 --> 2:47:09.560\n I shouldn't have done and hope to goodness, my kids don't do them, okay?\n\n2:47:09.560 --> 2:47:10.560\n Okay.\n\n2:47:10.560 --> 2:47:12.560\n So do I fear death?\n\n2:47:12.560 --> 2:47:14.920\n I think about death a lot actually.\n\n2:47:14.920 --> 2:47:20.720\n You may not know this about me, but in my field, I was the head, I was the co chair\n\n2:47:20.720 --> 2:47:22.640\n of the death panel.\n\n2:47:22.640 --> 2:47:23.640\n It's called the death panel.\n\n2:47:23.640 --> 2:47:31.240\n No, it's like it's the panel to think about death in religious studies and I was that\n\n2:47:31.240 --> 2:47:32.240\n for many years.\n\n2:47:32.240 --> 2:47:34.120\n So you've thought about it a bit.\n\n2:47:34.120 --> 2:47:35.120\n A bit.\n\n2:47:35.120 --> 2:47:40.240\n Let's see, I think that people are a little too confident, I think about life in general\n\n2:47:40.240 --> 2:47:43.680\n that they're gonna kind of live all the time and not die.\n\n2:47:43.680 --> 2:47:48.800\n I happen to, I mean, I hate to say it, I'm super positive and most people would consider\n\n2:47:48.800 --> 2:47:52.000\n me to be too happy almost, right?\n\n2:47:52.000 --> 2:47:56.440\n And so it's odd then that I spend a lot of time thinking about death, but I wonder if\n\n2:47:56.440 --> 2:47:58.520\n there's a connection there.\n\n2:47:58.520 --> 2:48:01.240\n I'm happy to be alive, right?\n\n2:48:01.240 --> 2:48:04.880\n That's kind of what the thinking about death does is it makes you appreciate the days that\n\n2:48:04.880 --> 2:48:05.880\n you do have.\n\n2:48:05.880 --> 2:48:06.880\n Yeah.\n\n2:48:06.880 --> 2:48:07.880\n It's a weird controversy.\n\n2:48:07.880 --> 2:48:17.520\n I tend to believe that the fact that this life ends gives each day a significant amount\n\n2:48:17.520 --> 2:48:19.560\n of meaning.\n\n2:48:19.560 --> 2:48:23.600\n So I don't know, it seems like an important feature of life.\n\n2:48:23.600 --> 2:48:28.680\n It's not like a bug, it seems like a feature that it ends, but it's a strange feature because\n\n2:48:28.680 --> 2:48:32.040\n I wish it, like all the good stuff you wish it wouldn't end.\n\n2:48:32.040 --> 2:48:36.160\n Well, you know what's interesting, Lex, and I do point this out to my students because\n\n2:48:36.160 --> 2:48:41.640\n we cover in a lot of the basic studies courses I teach, we cover all religions or as many\n\n2:48:41.640 --> 2:48:43.720\n as we can, like the major religions.\n\n2:48:43.720 --> 2:48:46.680\n And so take Hinduism, for example.\n\n2:48:46.680 --> 2:48:48.760\n Now this is an ancient religion, okay?\n\n2:48:48.760 --> 2:48:52.720\n So you and I are here talking about how we enjoy living and life and things like that.\n\n2:48:52.720 --> 2:48:57.800\n Well, the goal of Hinduism is basically never to get reincarnated again, is basically to\n\n2:48:57.800 --> 2:48:59.440\n not live, okay?\n\n2:48:59.440 --> 2:49:02.720\n And to get off samsara, which is the wheel of life and death.\n\n2:49:02.720 --> 2:49:03.720\n Yeah.\n\n2:49:03.720 --> 2:49:04.720\n Escape the whole thing.\n\n2:49:04.720 --> 2:49:05.720\n Yeah, exactly.\n\n2:49:05.720 --> 2:49:06.720\n Think of that.\n\n2:49:06.720 --> 2:49:11.380\n Conditions are so different that you and I and my students are happy to be alive.\n\n2:49:11.380 --> 2:49:17.000\n But back in the day, thousands of years ago, when they wrote, they actually didn't write\n\n2:49:17.000 --> 2:49:21.120\n it, they spoke the Vedas, which were the sacred traditions of India.\n\n2:49:21.120 --> 2:49:22.120\n They wanted off.\n\n2:49:22.120 --> 2:49:24.160\n They didn't want to come back.\n\n2:49:24.160 --> 2:49:25.720\n Life was terrible.\n\n2:49:25.720 --> 2:49:30.680\n That's what people don't have the adequate understanding of history, that for the majority\n\n2:49:30.680 --> 2:49:34.400\n of people, life is really hard, right?\n\n2:49:34.400 --> 2:49:38.600\n And you and I are, and your audience, among the lucky.\n\n2:49:38.600 --> 2:49:39.600\n Yeah.\n\n2:49:39.600 --> 2:49:42.440\n Yeah, we actually like life.\n\n2:49:42.440 --> 2:49:45.160\n We want to live.\n\n2:49:45.160 --> 2:49:46.160\n Most of the time.\n\n2:49:46.160 --> 2:49:47.160\n Yeah, most of the time.\n\n2:49:47.160 --> 2:49:51.400\n What do you think the biggest, since we're covering every single possible topic, let\n\n2:49:51.400 --> 2:49:54.960\n me ask the biggest one, the unanswerable one.\n\n2:49:54.960 --> 2:49:59.600\n From the perspective of alien intelligence, or from the perspective of religious studies,\n\n2:49:59.600 --> 2:50:05.960\n or from the perspective of just Diana, what do you think is the meaning of this existence\n\n2:50:05.960 --> 2:50:07.960\n of this life of ours?\n\n2:50:07.960 --> 2:50:08.960\n Yes.\n\n2:50:08.960 --> 2:50:09.960\n Okay.\n\n2:50:09.960 --> 2:50:10.960\n So, all right.\n\n2:50:10.960 --> 2:50:20.200\n So, well, of course I have to, my philosophical training as an undergrad always makes me think\n\n2:50:20.200 --> 2:50:24.400\n about like, what's the assumption in your question?\n\n2:50:24.400 --> 2:50:25.400\n There's an assumption there.\n\n2:50:25.400 --> 2:50:26.400\n It's like, there is a meaning.\n\n2:50:26.400 --> 2:50:27.400\n Okay.\n\n2:50:27.400 --> 2:50:28.400\n That's the assumption.\n\n2:50:28.400 --> 2:50:29.400\n What do you mean by meaning?\n\n2:50:29.400 --> 2:50:30.400\n What do you mean by life?\n\n2:50:30.400 --> 2:50:31.400\n Yeah.\n\n2:50:31.400 --> 2:50:32.400\n Can you define the terms?\n\n2:50:32.400 --> 2:50:33.400\n No, no.\n\n2:50:33.400 --> 2:50:34.400\n But listen.\n\n2:50:34.400 --> 2:50:35.400\n Okay.\n\n2:50:35.400 --> 2:50:36.400\n I'll answer your question.\n\n2:50:36.400 --> 2:50:37.400\n I'm just going to say that there's this assumption that we should have meaning to life.\n\n2:50:37.400 --> 2:50:38.400\n Okay.\n\n2:50:38.400 --> 2:50:39.400\n Well, maybe we shouldn't.\n\n2:50:39.400 --> 2:50:40.400\n Maybe it's just all random.\n\n2:50:40.400 --> 2:50:41.400\n Okay.\n\n2:50:41.400 --> 2:50:42.400\n However, I believe that it's not.\n\n2:50:42.400 --> 2:50:46.960\n And in my opinion, the meaning of life, in my opinion, is intrinsic.\n\n2:50:46.960 --> 2:50:48.200\n I enjoy living.\n\n2:50:48.200 --> 2:50:49.200\n I want to live.\n\n2:50:49.200 --> 2:50:50.680\n Sometimes I don't enjoy living.\n\n2:50:50.680 --> 2:50:53.320\n And when I don't enjoy living, I change my circumstances.\n\n2:50:53.320 --> 2:50:54.960\n So it's intrinsic.\n\n2:50:54.960 --> 2:50:59.600\n And I think that certain things are intrinsic and like love, love of your children is kind\n\n2:50:59.600 --> 2:51:03.800\n of, well, it's actually physiological, but it's also intrinsic.\n\n2:51:03.800 --> 2:51:04.800\n It's beautiful.\n\n2:51:04.800 --> 2:51:12.320\n You know, there's something about it that is intrinsically desirable.\n\n2:51:12.320 --> 2:51:17.000\n So I think the meaning of life is like that, intrinsically desirable.\n\n2:51:17.000 --> 2:51:25.560\n So it's something that just is born inside you based on what makes you feel good?\n\n2:51:25.560 --> 2:51:27.720\n No, that's hedonism.\n\n2:51:27.720 --> 2:51:32.080\n That's about what a wordy place, love, love, love of your children.\n\n2:51:32.080 --> 2:51:33.080\n Yeah.\n\n2:51:33.080 --> 2:51:39.120\n So basically, love of your children, by the way, is not always easy because they do things\n\n2:51:39.120 --> 2:51:40.840\n that they shouldn't do.\n\n2:51:40.840 --> 2:51:41.880\n You have to discipline them.\n\n2:51:41.880 --> 2:51:45.280\n That's one of the worst things about parenthood to me is disciplining my children.\n\n2:51:45.280 --> 2:51:46.280\n I don't like to do that.\n\n2:51:46.280 --> 2:51:48.360\n I love them.\n\n2:51:48.360 --> 2:51:55.120\n So a lot of things that I do that I feel are good are not easy.\n\n2:51:55.120 --> 2:52:01.180\n So there's an intrinsic sense that, like, okay, let's take animals, okay?\n\n2:52:01.180 --> 2:52:02.640\n So we have dogs and cats, okay?\n\n2:52:02.640 --> 2:52:05.000\n So you might not, but I do.\n\n2:52:05.000 --> 2:52:07.760\n I told you about them.\n\n2:52:07.760 --> 2:52:10.520\n Can you share their names?\n\n2:52:10.520 --> 2:52:12.560\n If I share their names, I will share their names.\n\n2:52:12.560 --> 2:52:13.560\n Okay.\n\n2:52:13.560 --> 2:52:18.160\n So we have a cat, and it has red fluffy hair, and so we called it Trump.\n\n2:52:18.160 --> 2:52:23.560\n Well, when we got our dog, we figured that it needed a companion, so we called it Putin.\n\n2:52:23.560 --> 2:52:24.880\n So we have Trump and Putin.\n\n2:52:24.880 --> 2:52:30.480\n Those are the greatest pet names of all time, I'm sorry.\n\n2:52:30.480 --> 2:52:36.280\n And maybe we'll be able to share a picture of your cat because this is awesome.\n\n2:52:36.280 --> 2:52:38.880\n It is really cute, yeah.\n\n2:52:38.880 --> 2:52:39.880\n Very photogenic.\n\n2:52:39.880 --> 2:52:49.360\n I mean, is this something that's, whether we're talking about love or the intrinsic\n\n2:52:49.360 --> 2:52:54.960\n meaning, do you think that's something that's really special to humans?\n\n2:52:54.960 --> 2:53:01.640\n Or if there is intelligent alien civilizations out there, do you think that's something that\n\n2:53:01.640 --> 2:53:06.000\n they possess as well, maybe in different forms?\n\n2:53:06.000 --> 2:53:13.720\n Like whatever this thing that meaning is, this intrinsic drive that we have, do you\n\n2:53:13.720 --> 2:53:19.680\n think that's just a property of life, of some level of complexity?\n\n2:53:19.680 --> 2:53:22.640\n That we will see that everywhere in this universe?\n\n2:53:22.640 --> 2:53:28.600\n In my opinion, and this is just my opinion, I do think that it is, but I also think that\n\n2:53:28.600 --> 2:53:30.360\n it can take different forms.\n\n2:53:30.360 --> 2:53:33.480\n So if there is like, think of gravity, right?\n\n2:53:33.480 --> 2:53:36.280\n Gravity kind of like makes stuff stick to it, right?\n\n2:53:36.280 --> 2:53:37.480\n It attracts stuff.\n\n2:53:37.480 --> 2:53:38.920\n Well, what is love to you?\n\n2:53:38.920 --> 2:53:40.280\n That does that too, right?\n\n2:53:40.280 --> 2:53:43.840\n So people who are, we call them charismatic.\n\n2:53:43.840 --> 2:53:46.120\n Charism, it means love.\n\n2:53:46.120 --> 2:53:47.560\n Charism means light and love.\n\n2:53:47.560 --> 2:53:54.000\n So a charismatic person is a person who attracts people to them like the sun does, right?\n\n2:53:54.000 --> 2:53:56.780\n Like, you know?\n\n2:53:56.780 --> 2:54:02.980\n So I think that whatever this property is, that's intrinsic, is like gravity and most\n\n2:54:02.980 --> 2:54:06.720\n likely takes different forms in different types of life forms.\n\n2:54:06.720 --> 2:54:12.960\n Yeah, I can't wait until like a Albert Einstein type of figure in the future will discover\n\n2:54:12.960 --> 2:54:17.240\n that love is in fact one of the fundamental forces of physics.\n\n2:54:17.240 --> 2:54:19.280\n That would be cool.\n\n2:54:19.280 --> 2:54:23.440\n Diana, this is one of the favorite conversations I've ever had.\n\n2:54:23.440 --> 2:54:28.080\n It's truly an honor to talk to you and thank you so much for spending all this time with\n\n2:54:28.080 --> 2:54:29.080\n me.\n\n2:54:29.080 --> 2:54:30.080\n Absolutely.\n\n2:54:30.080 --> 2:54:31.080\n It's been fun.\n\n2:54:31.080 --> 2:54:32.080\n Thank you.\n\n2:54:32.080 --> 2:54:34.600\n Thank you for this conversation with Diana Walsh Pasalka.\n\n2:54:34.600 --> 2:54:40.840\n And thank you to our sponsors, Element Electrolight Drink, Grammarly Writing Plugin, Business\n\n2:54:40.840 --> 2:54:43.320\n Wars Podcast, and Cash App.\n\n2:54:43.320 --> 2:54:48.040\n So the choice is health, grammar, knowledge, or money.\n\n2:54:48.040 --> 2:54:49.600\n Choose wisely, my friends.\n\n2:54:49.600 --> 2:54:55.000\n And if you wish, click the sponsor links below to get a discount and to support this podcast.\n\n2:54:55.000 --> 2:55:00.160\n And now let me leave you with some words from Carl Sagan, somewhere something incredible\n\n2:55:00.160 --> 2:55:02.440\n is waiting to be known.\n\n2:55:02.440 --> 2:55:30.560\n Thank you for listening and hope to see you next time.\n\n"
}