{
  "title": "Ronald Sullivan: The Ideal of Justice in the Face of Controversy and Evil | Lex Fridman Podcast #170",
  "id": "Iuven0crywo",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.620\n The following is a conversation with Ronald Sullivan, a professor at Harvard Law School\n\n00:04.620 --> 00:08.500\n known for taking on difficult and controversial cases.\n\n00:08.500 --> 00:14.120\n He was on the head legal defense team for the Patriots football player Aaron Hernandez\n\n00:14.120 --> 00:16.020\n in his double murder case.\n\n00:16.020 --> 00:21.780\n He represented one of the Gena 6 defendants and never lost the case during his years in\n\n00:21.780 --> 00:25.960\n Washington D.C.'s Public Defender Services office.\n\n00:25.960 --> 00:32.240\n In 2019, Ronald joined the legal defense team of Harvey Weinstein, a film producer\n\n00:32.240 --> 00:36.460\n facing multiple charges of rape and other sexual assault.\n\n00:36.460 --> 00:41.860\n This decision met with criticism from Harvard University students, including an online petition\n\n00:41.860 --> 00:46.640\n by students seeking his removal as faculty dean of Winthrop House.\n\n00:46.640 --> 00:52.240\n Then, a letter supporting him signed by 52 Harvard Law School professors appeared in\n\n00:52.240 --> 00:56.100\n the Boston Globe on March 8, 2019.\n\n00:56.100 --> 00:59.600\n Following this, the Harvard administration succumbed to the pressure of a few Harvard\n\n00:59.600 --> 01:05.720\n students and announced that they will not be renewing Ronald Sullivan's dean position.\n\n01:05.720 --> 01:11.800\n This created a major backlash in the public discourse over the necessary role of universities\n\n01:11.800 --> 01:19.220\n in upholding the principles of law and freedom at the very foundation of the United States.\n\n01:19.220 --> 01:24.360\n This conversation is brought to you by Brooklyn & Sheets, WineAxis online wine store, Monk\n\n01:24.360 --> 01:28.600\n Pack low carb snacks, and Blinkist app that summarizes books.\n\n01:28.600 --> 01:31.440\n Click their links to support this podcast.\n\n01:31.440 --> 01:37.440\n As a side note, let me say that the free exchange of difficult ideas is the only mechanism through\n\n01:37.440 --> 01:39.780\n which we can make progress.\n\n01:39.780 --> 01:42.560\n Truth is not a safe space.\n\n01:42.560 --> 01:46.520\n Truth is humbling, and being humbled can hurt.\n\n01:46.520 --> 01:52.880\n But this is the role of education, not just in the university but in business and in life.\n\n01:52.880 --> 01:58.520\n Freedom and compassion can coexist, but it requires work and patience.\n\n01:58.520 --> 02:03.600\n It requires listening to the voices and to the experiences unlike our own.\n\n02:03.600 --> 02:06.680\n Listening, not silencing.\n\n02:06.680 --> 02:14.100\n This is the Lex Friedman Podcast, and here is my conversation with Ronald Sullivan.\n\n02:14.100 --> 02:20.160\n You were one of the lawyers who represented the Hollywood producer Harvey Weinstein in\n\n02:20.160 --> 02:22.400\n advance of a sexual assault trial.\n\n02:22.400 --> 02:27.840\n For this, Harvard forced you to step down as faculty deans, you and your wife of Winthrop\n\n02:27.840 --> 02:28.840\n House.\n\n02:28.840 --> 02:35.240\n Can you tell the story of this saga from first deciding to represent Harvey Weinstein to\n\n02:35.240 --> 02:38.880\n the interesting complicated events that followed?\n\n02:38.880 --> 02:40.000\n Yeah, sure.\n\n02:40.000 --> 02:48.360\n So I got a call one morning from a colleague at the Harvard Law School who asked if I would\n\n02:48.360 --> 02:52.600\n consent to taking a call from Harvey.\n\n02:52.600 --> 02:56.560\n He wanted to meet me and chat with me about representing him.\n\n02:56.560 --> 03:00.520\n I said yes, and one thing led to another.\n\n03:00.520 --> 03:08.200\n I drove out to Connecticut where he was staying and met with him and some of his advisors,\n\n03:08.200 --> 03:13.300\n and then a day or two later, I decided to take the case.\n\n03:13.300 --> 03:19.000\n This would have been back in January of 2019, I believe.\n\n03:19.000 --> 03:27.340\n So the sort of cases, I have a very small practice most of my time is teaching and writing,\n\n03:27.340 --> 03:34.280\n but I tend to take cases that most deem to be impossible.\n\n03:34.280 --> 03:39.480\n I take the challenging sorts of cases, and this fit the bill.\n\n03:39.480 --> 03:46.000\n It was quite challenging in the sense that everyone had prejudged the case.\n\n03:46.000 --> 03:52.640\n When I say everyone, I just mean the general sentiment in the public had the case prejudged,\n\n03:52.640 --> 04:02.520\n even though the specific allegations did not regard any of the people in the New Yorker.\n\n04:02.520 --> 04:12.280\n It's the New Yorker article that exposed everything that was going on, allegedly, with Harvey.\n\n04:12.280 --> 04:17.160\n So I decided to take the case, and I did.\n\n04:17.160 --> 04:22.360\n Is there a philosophy behind you taking on these very difficult cases?\n\n04:22.360 --> 04:23.360\n Is it a set of principles?\n\n04:23.360 --> 04:29.880\n Is it just your love of the law, or is there a set of principles why you take on the cases?\n\n04:29.880 --> 04:38.120\n Yeah, I'd like to take on hard cases, and I like to take on the cases that are with\n\n04:38.120 --> 04:43.640\n unpopular defendants, unpopular clients.\n\n04:43.640 --> 04:52.640\n With respect to the latter, that's where Harvey Weinstein fell, it's because we need lawyers\n\n04:52.640 --> 05:00.640\n and good lawyers to take the unpopular cases, because those sorts of cases determine what\n\n05:00.640 --> 05:04.160\n sort of criminal justice system we have.\n\n05:04.160 --> 05:09.520\n If we don't protect the rights and the liberties of those whom the society deems to be the\n\n05:09.520 --> 05:15.200\n least and the last, the unpopular client, then that's the camel's nose under the tent.\n\n05:15.200 --> 05:19.740\n If we let the camel's nose under the tent, the entire tent is going to collapse.\n\n05:19.740 --> 05:26.680\n That is to say, if we short circuit the rights of a client like Harvey Weinstein, then the\n\n05:26.680 --> 05:31.560\n next thing you know, someone will be at your door, knocking it down and violating your\n\n05:31.560 --> 05:32.560\n rights.\n\n05:32.560 --> 05:39.000\n There's a certain creep there with respect to the way in which the state will respect\n\n05:39.000 --> 05:43.920\n the civil rights and civil liberties of people, and these are the sorts of cases that test\n\n05:43.920 --> 05:44.920\n it.\n\n05:44.920 --> 05:52.160\n For example, there was a young man many, many years ago named Ernesto Miranda.\n\n05:52.160 --> 05:55.240\n By all accounts, he was not a likable guy.\n\n05:55.240 --> 06:03.800\n He was a three time knife thief and not a likable guy, but lawyers stepped up and took\n\n06:03.800 --> 06:05.060\n his case.\n\n06:05.060 --> 06:10.280\n Because of that, we now have the Miranda warnings, you have the right to remain silent.\n\n06:10.280 --> 06:15.460\n Those warnings that officers are forced to give to people.\n\n06:15.460 --> 06:21.400\n So it is through these cases that we express oftentimes the best values in our criminal\n\n06:21.400 --> 06:22.400\n justice system.\n\n06:22.400 --> 06:28.400\n So I proudly take on these sorts of cases in order to vindicate not only the individual\n\n06:28.400 --> 06:36.160\n rights of the person whom I'm representing, but the rights of citizens writ large, most\n\n06:36.160 --> 06:42.880\n of whom do not experience the criminal justice system, and it's partly because of lawyers\n\n06:42.880 --> 06:51.560\n who take on these sorts of cases and establish rules that protect us, average everyday ordinary\n\n06:51.560 --> 06:53.680\n concrete citizens.\n\n06:53.680 --> 06:59.640\n From a psychological perspective, just you as a human, is there fear, is there stress\n\n06:59.640 --> 07:00.640\n from all the pressure?\n\n07:00.640 --> 07:04.840\n Because if you're facing, I mean, the whole point, a difficult case, especially in the\n\n07:04.840 --> 07:10.600\n latter that you mentioned of the going against popular opinion, you have the eyes of millions\n\n07:10.600 --> 07:19.280\n potentially looking at you with anger as you try to defend this set of laws that this country's\n\n07:19.280 --> 07:20.280\n built on.\n\n07:20.280 --> 07:24.200\n No, it doesn't stress me out particularly.\n\n07:24.200 --> 07:26.360\n It sort of comes with the territory.\n\n07:26.360 --> 07:31.660\n I try not to get too excited in either direction.\n\n07:31.660 --> 07:40.660\n So a big part of my practice is wrongful convictions, and I've gotten over 6,000 people out of\n\n07:40.660 --> 07:46.920\n prison who've been wrongfully incarcerated, and a subset of those people have been convicted,\n\n07:46.920 --> 07:51.640\n and people who've been in jail 20, 30 years who have gotten out.\n\n07:51.640 --> 07:57.160\n And those are the sorts of cases where people praise you and that sort of thing.\n\n07:57.160 --> 08:04.980\n And so, look, I do the work that I do, I'm proud of the work that I do, and in that sense\n\n08:04.980 --> 08:11.760\n I'm sort of a part time Daoist, the expression reversal is the movement of the Dao.\n\n08:11.760 --> 08:17.000\n So I don't get too high, I don't get too low, I just try to do my work and represent\n\n08:17.000 --> 08:18.680\n people to the best of my ability.\n\n08:18.680 --> 08:23.060\n So one of the hardest cases of recent history would be the Harvey Weinstein in terms of\n\n08:23.060 --> 08:25.760\n popular opinion or unpopular opinion.\n\n08:25.760 --> 08:33.040\n So if you continue on that line, where does that story take you, of taking on this case?\n\n08:33.040 --> 08:40.120\n Yeah, so I took on the case and then there was a few students at the college.\n\n08:40.120 --> 08:44.660\n So let me back up, I had an administrative post at Harvard College, which is a separate\n\n08:44.660 --> 08:49.480\n entity from the Harvard Law School, Harvard College is the undergraduate portion of Harvard\n\n08:49.480 --> 08:56.380\n University and the law school is obviously the law school, and I initially was appointed\n\n08:56.380 --> 08:58.800\n as master of one of the houses.\n\n08:58.800 --> 09:04.820\n We did a name change five or six years into it and were called faculty deans.\n\n09:04.820 --> 09:09.500\n But the houses at Harvard are based on the college system of Oxford and Cambridge.\n\n09:09.500 --> 09:15.040\n So when students go to Harvard after their first year, they're assigned to a particular\n\n09:15.040 --> 09:19.040\n house or college and that's where they live and eat and so forth.\n\n09:19.040 --> 09:20.280\n And these are undergraduate students?\n\n09:20.280 --> 09:21.720\n These are undergraduate students.\n\n09:21.720 --> 09:28.120\n So I was responsible for one of the houses as its faculty dean.\n\n09:28.120 --> 09:34.480\n So it's an administrative appointment at the college and some students who clearly didn't\n\n09:34.480 --> 09:42.120\n like Harvey Weinstein began to protest about the representation.\n\n09:42.120 --> 09:52.040\n And from there, it just mushroomed into one of the most craven, cowardly acts by any university\n\n09:52.040 --> 09:53.320\n in modern history.\n\n09:53.320 --> 10:00.400\n It's just a complete and utter repudiation of academic freedom.\n\n10:00.400 --> 10:09.320\n And it is a decision that Harvard certainly will live to regret, frankly, it's an embarrassment.\n\n10:09.320 --> 10:16.040\n We expect students to do what students do and I encourage students to have their voices\n\n10:16.040 --> 10:17.280\n heard and to protest.\n\n10:17.280 --> 10:20.000\n I mean, that's what students do.\n\n10:20.000 --> 10:24.400\n What is vexing are the adults.\n\n10:24.400 --> 10:31.060\n The dean of the Faculty of Arts and Sciences, Claudine Gay, absolutely craven and cowardly.\n\n10:31.060 --> 10:37.200\n The dean of the college, same thing, Rakesh Khurana, craven and cowardly.\n\n10:37.200 --> 10:45.280\n They capitulated to the loudest voice in the room and ran around afraid of 19 year olds.\n\n10:45.280 --> 10:50.120\n Oh, 19 year olds are upset that I need to do something.\n\n10:50.120 --> 10:58.120\n And it appeared to me that they so desired the approval of students that they were afraid\n\n10:58.120 --> 11:01.600\n to make the tough decision and the right decision.\n\n11:01.600 --> 11:06.360\n It really could have been an important teaching moment at Harvard.\n\n11:06.360 --> 11:07.920\n Very important teaching moment.\n\n11:07.920 --> 11:13.240\n So they forced you to step down from that faculty dean position at the house.\n\n11:13.240 --> 11:17.200\n I would push back on the description a little bit.\n\n11:17.200 --> 11:23.820\n So I don't write the, you know, the references to the op ed I did in New York time.\n\n11:23.820 --> 11:27.760\n Harvard made a mistake by making me step down or something like that.\n\n11:27.760 --> 11:29.280\n So I don't write those things.\n\n11:29.280 --> 11:33.240\n I did not step down and refuse to step down.\n\n11:33.240 --> 11:37.440\n Harvard declined to renew my contract.\n\n11:37.440 --> 11:44.280\n And I made it clear that I was not going to resign as a matter of principle and forced\n\n11:44.280 --> 11:50.320\n them to do the cowardly act that they, in fact, did.\n\n11:50.320 --> 11:59.920\n And you know, the worst thing about this, they did the college, Dean Gay and Dean Khurana,\n\n11:59.920 --> 12:01.120\n commissioned this survey.\n\n12:01.120 --> 12:02.700\n They've never done this before.\n\n12:02.700 --> 12:06.880\n Survey from the students, you know, how do you feel at Winthrop House?\n\n12:06.880 --> 12:11.080\n And the funny thing about the survey is they never released the results.\n\n12:11.080 --> 12:13.460\n Why did they never release the results?\n\n12:13.460 --> 12:20.200\n They never released the results because I would bet my salary that the results came\n\n12:20.200 --> 12:21.880\n back positive for me.\n\n12:21.880 --> 12:26.400\n And it didn't fit their narrative because most of the students were fine.\n\n12:26.400 --> 12:27.400\n Most of the students were fine.\n\n12:27.400 --> 12:29.520\n It was the loudest voice in the room.\n\n12:29.520 --> 12:35.080\n So they never released it, and I challenged them to this day, release it, release it.\n\n12:35.080 --> 12:42.600\n But no, they wanted to create this narrative.\n\n12:42.600 --> 12:50.400\n And when the data didn't support the narrative, then they just got silent, oh, we're not going\n\n12:50.400 --> 12:51.400\n to release it.\n\n12:51.400 --> 12:52.480\n The students demanded it.\n\n12:52.480 --> 12:53.920\n I demanded it.\n\n12:53.920 --> 13:03.620\n And they wouldn't release it because I just know in my heart of hearts that it came back\n\n13:03.620 --> 13:08.640\n in my favor that most students at Winthrop House said they were fine.\n\n13:08.640 --> 13:13.520\n There was a group of students that weaponized the term unsafe.\n\n13:13.520 --> 13:19.820\n They said we felt unsafe, and they bantied this term about.\n\n13:19.820 --> 13:25.040\n But again, I'm confident that the majority of students at Winthrop House said they felt\n\n13:25.040 --> 13:29.200\n completely fine and felt safe and so forth.\n\n13:29.200 --> 13:36.400\n And the supermajority, I am confident, either said I feel great at Winthrop or I don't care\n\n13:36.400 --> 13:37.640\n one way or the other.\n\n13:37.640 --> 13:40.880\n And then there was some minority who had a different view.\n\n13:40.880 --> 13:49.640\n But lessons learned, it was a wonderful opportunity at Winthrop.\n\n13:49.640 --> 13:56.560\n I met some amazing students over my 10 years as master and then faculty dean, and I'm still\n\n13:56.560 --> 14:02.820\n in touch with a number of students, some of whom are now my students at the law school.\n\n14:02.820 --> 14:12.280\n So in the end, I thought it ended up being a great experience, the national media was\n\n14:12.280 --> 14:15.240\n just wonderful in this, just wonderful.\n\n14:15.240 --> 14:24.680\n People wrote such wonderful articles and accounts and wagged their finger appropriately at Harvard.\n\n14:24.680 --> 14:28.640\n Compare me to John Adams, which I don't think is an apt comparison, but it's always great\n\n14:28.640 --> 14:31.660\n to read something like that.\n\n14:31.660 --> 14:37.500\n But anyway, that was the Harvard versus Harvey situation.\n\n14:37.500 --> 14:42.520\n So that seems like a seminal mistake by Harvard, and Harvard is one of the great universities\n\n14:42.520 --> 14:44.120\n in the world.\n\n14:44.120 --> 14:50.480\n And sort of its successes and its mistakes are really important for the world as a beacon\n\n14:50.480 --> 14:53.480\n of how we make progress.\n\n14:53.480 --> 15:01.520\n So what lessons for the bigger academia that's under fire a lot these days, what bigger lessons\n\n15:01.520 --> 15:03.520\n do you take away?\n\n15:03.520 --> 15:06.520\n Like how do we make Harvard great?\n\n15:06.520 --> 15:12.600\n How do we make other universities, Yale, MIT great in the face of such mistakes?\n\n15:12.600 --> 15:24.080\n Well, I think that we have moved into a model where we have the consumerization of education.\n\n15:24.080 --> 15:35.160\n That is to say, we have feckless administrators who make policy based on what the students\n\n15:35.160 --> 15:37.280\n say.\n\n15:37.280 --> 15:44.340\n Now this comment is not intended to suggest that students have no voice in governance,\n\n15:44.340 --> 15:48.440\n but it is to suggest that the faculty are there for a reason.\n\n15:48.440 --> 15:53.980\n They are among the greatest minds on the planet Earth in their particular fields, at schools\n\n15:53.980 --> 15:59.840\n like Harvard and Yale, Stanford, the schools that you mentioned, MIT, quite literally the\n\n15:59.840 --> 16:04.160\n greatest minds on Earth, they are there for a reason.\n\n16:04.160 --> 16:11.460\n Things like curriculum and so forth are rightly in the province of faculty.\n\n16:11.460 --> 16:17.720\n And while you take input and critique and so forth, ultimately, the grownups in the\n\n16:17.720 --> 16:26.760\n room have to be sufficiently responsible to take charge and to direct the course of a\n\n16:26.760 --> 16:28.720\n student's education.\n\n16:28.720 --> 16:35.960\n And my situation is one example where it really could have been an excellent teaching moment\n\n16:35.960 --> 16:44.120\n about the value of the Sixth Amendment, about what it means to treat people who are in the\n\n16:44.120 --> 16:52.400\n crosshairs of the criminal justice system, but rather than having that conversation,\n\n16:52.400 --> 16:57.880\n it's just this consumerization model, well, there's a lot of noise out here, so we're\n\n16:57.880 --> 17:00.720\n going to react in this sort of way.\n\n17:00.720 --> 17:07.180\n Higher education as well, unfortunately, has been commodified in other sorts of ways that\n\n17:07.180 --> 17:17.960\n has reduced or impeded, hampered these schools commitments to free and robust and open dialogue.\n\n17:17.960 --> 17:24.160\n So to the degree that academic freedom doesn't sit squarely at the center of the academic\n\n17:24.160 --> 17:27.400\n mission, any school is going to be in trouble.\n\n17:27.400 --> 17:42.760\n And I really hope that we weather this current political moment where 19 year olds without\n\n17:42.760 --> 17:54.000\n degrees are running universities and get back to a system where faculty, where adults make\n\n17:54.000 --> 17:59.120\n decisions in the best interests of the university and the best interests of the student.\n\n17:59.120 --> 18:08.240\n Even to the degree though, some of those decisions may be unpopular, and that is going to require\n\n18:08.240 --> 18:21.200\n a certain courage and hopefully in time, and I'm confident that in time, administrators\n\n18:21.200 --> 18:25.120\n are going to begin to push back on these current trends.\n\n18:25.120 --> 18:29.400\n Harvard's been around for a long time, it's been around for a long time for a reason,\n\n18:29.400 --> 18:34.020\n and one of the reasons is that it understands itself not to be static.\n\n18:34.020 --> 18:49.760\n So I have every view that Harvard is going to adapt and get itself back on course and\n\n18:49.760 --> 18:53.200\n be around another 400 years, at least that's my hope.\n\n18:53.200 --> 18:58.560\n So I mean, what this kind of boils down to is just having difficult conversation, difficult\n\n18:58.560 --> 18:59.560\n debates.\n\n18:59.560 --> 19:04.840\n When you mentioned sort of 19 year olds, and it's funny, I've seen this even at MIT, it's\n\n19:04.840 --> 19:09.240\n not that they shouldn't have a voice.\n\n19:09.240 --> 19:13.900\n They do seem to, I guess you have to experience it and just observe it.\n\n19:13.900 --> 19:18.000\n They have a strangely disproportionate power.\n\n19:18.000 --> 19:23.260\n It's very interesting to basically, I mean, you say, yes, there's great faculty and so\n\n19:23.260 --> 19:30.840\n on, but it's not even just that the faculty is smart or wise or whatever, it's that they're\n\n19:30.840 --> 19:33.200\n just silenced.\n\n19:33.200 --> 19:40.040\n So the terminology that you mentioned is weaponized as sort of safe spaces or that certain conversations\n\n19:40.040 --> 19:43.440\n make people feel unsafe.\n\n19:43.440 --> 19:47.840\n What do you think about this kind of idea?\n\n19:47.840 --> 19:55.520\n Is there some things that are unsafe to talk about in the university setting?\n\n19:55.520 --> 19:58.520\n Is there lines to be drawn somewhere?\n\n19:58.520 --> 20:04.400\n And just like you said on the flip side with a slippery slope, is it too easy for the lines\n\n20:04.400 --> 20:05.920\n to be drawn everywhere?\n\n20:05.920 --> 20:08.460\n Yeah, that's a great question.\n\n20:08.460 --> 20:16.220\n So this idea of unsafe space, at least the vocabulary derives from some research, academic\n\n20:16.220 --> 20:21.880\n research about feeling psychologically unsafe.\n\n20:21.880 --> 20:32.520\n And so the notion here is that there are forms of psychological disquiet that impedes people\n\n20:32.520 --> 20:39.320\n from experiencing the educational environment to the greatest degree possible.\n\n20:39.320 --> 20:44.740\n And that's the argument.\n\n20:44.740 --> 20:53.820\n And assuming for a moment that people do have these feelings of disquiet at elite universities\n\n20:53.820 --> 20:59.880\n like MIT and like Harvard, that's probably the safest space people are going to be in\n\n20:59.880 --> 21:06.840\n for their lives because when they get out into the quote unquote real world, they won't\n\n21:06.840 --> 21:14.320\n have the sorts of nets that these schools provide, safety nets that these schools provide.\n\n21:14.320 --> 21:20.480\n So to the extent that research is descriptive of a psychological feeling, I think that the\n\n21:20.480 --> 21:24.480\n duty of the universities are to challenge people.\n\n21:24.480 --> 21:29.520\n Seems to me that it's a shame to go to a place like Harvard or a place like MIT, Yale, any\n\n21:29.520 --> 21:37.100\n of these great institutions and come out the same person that you were when you went in.\n\n21:37.100 --> 21:42.040\n That seems to be a horrible waste of four years and money and resources.\n\n21:42.040 --> 21:50.200\n Rather, we ought to challenge students, that they grow, challenge some of their most deeply\n\n21:50.200 --> 21:53.180\n held assumptions.\n\n21:53.180 --> 22:00.480\n They may continue to hold them, but the point of an education is to rigorously interrogate\n\n22:00.480 --> 22:08.400\n these fundamental assumptions that have guided you thus far and to do it fairly and civilly.\n\n22:08.400 --> 22:13.640\n So to the extent that there are lines that should be drawn, there's a long tradition\n\n22:13.640 --> 22:15.760\n in the university of civil discourse.\n\n22:15.760 --> 22:22.280\n So you should draw a line somewhere between civil discourse and uncivil discourse.\n\n22:22.280 --> 22:29.800\n The purpose of a university is to talk difficult conversations, tough issues, talk directly\n\n22:29.800 --> 22:33.700\n and frankly, but do it civilly.\n\n22:33.700 --> 22:42.280\n Also to yell and cuss at somebody and that sort of thing, well, do that on your own space,\n\n22:42.280 --> 22:47.880\n but observe the norms of civil discourse at the university.\n\n22:47.880 --> 22:57.880\n So look, I think that the presumption ought to be that the most difficult topics are appropriate\n\n22:57.880 --> 23:00.120\n to talk about at a university.\n\n23:00.120 --> 23:01.840\n That ought to be the presumption.\n\n23:01.840 --> 23:15.520\n Now should MIT, for example, give its imprimatur to someone who is espousing the flat earth\n\n23:15.520 --> 23:20.360\n theory, the earth is flat, right?\n\n23:20.360 --> 23:35.120\n If certain ideas are so contrary to the scientific and cultural thinking of the moment, yeah,\n\n23:35.120 --> 23:40.640\n there's space there to draw a line and say, yeah, we're not going to give you this platform\n\n23:40.640 --> 23:45.920\n to tell our students that the earth is flat.\n\n23:45.920 --> 23:54.440\n But a topic that's controversial, but contestatory, that's what universities are for.\n\n23:54.440 --> 23:58.920\n If you don't like the idea, present better ideas and articulate them.\n\n23:58.920 --> 24:04.560\n And I think there needs to be a mechanism outside of the space of ideas of humbling.\n\n24:04.560 --> 24:07.080\n I've done martial arts for a long time.\n\n24:07.080 --> 24:08.960\n I got my ass kicked a lot.\n\n24:08.960 --> 24:12.200\n I think that's really important.\n\n24:12.200 --> 24:18.520\n In the space of ideas, I mean, even just in engineering, just all the math classes, my\n\n24:18.520 --> 24:25.080\n memories of math, which I love, is kind of pain.\n\n24:25.080 --> 24:32.280\n It's basically coming face to face with the idea that I'm not special, that I'm much dumber\n\n24:32.280 --> 24:39.600\n than I thought I was, and that accomplishing anything in this world requires really hard\n\n24:39.600 --> 24:40.600\n work.\n\n24:40.600 --> 24:42.420\n It's really humbling.\n\n24:42.420 --> 24:47.640\n That puts you, because I remember when I was 18 and 19, and I thought I was going to be\n\n24:47.640 --> 24:54.240\n the smartest, the best fighter, the Nobel Prize winning, all those kinds of things.\n\n24:54.240 --> 24:58.760\n And then you come face to face with reality, and it hurts.\n\n24:58.760 --> 25:02.960\n And it feels like there needs to be efficient mechanisms from the best universities in the\n\n25:02.960 --> 25:06.520\n world without abusing you.\n\n25:06.520 --> 25:13.600\n It's a very difficult line to walk without mentally or physically abusing you, be able\n\n25:13.600 --> 25:15.700\n to humble you.\n\n25:15.700 --> 25:20.000\n And that's what I felt was missing in these very difficult, very important conversations\n\n25:20.000 --> 25:28.040\n is the 19 year olds, when they spoke up, the mechanism for humbling them with ideas was\n\n25:28.040 --> 25:29.040\n missing.\n\n25:29.040 --> 25:39.540\n It kind of got broken down because, as you say, I sensed fear.\n\n25:39.540 --> 25:41.560\n Everything was permeated with fear.\n\n25:41.560 --> 25:47.020\n And fear is paralyzing, fear is destructive, especially in a place that's supposed to be\n\n25:47.020 --> 25:50.560\n all about freedom of ideas.\n\n25:50.560 --> 25:56.400\n And I don't know if you have anything, any thoughts to say on this whole idea of cancel\n\n25:56.400 --> 26:03.640\n culture, where people, a lot of people use it as become political, so staying maybe\n\n26:03.640 --> 26:07.040\n outside of the world of politics.\n\n26:07.040 --> 26:12.940\n Is this, do you have thoughts about it, does it bother you that people are sort of put\n\n26:12.940 --> 26:19.320\n in this bin and labeled as something and then thereby you can ignore everything they say?\n\n26:19.320 --> 26:24.840\n I mean, Steven Pinker, there's a lot of Harvard folks that are fighting against these set\n\n26:24.840 --> 26:27.340\n of ideas, but do you have thoughts?\n\n26:27.340 --> 26:35.200\n I think that we as a culture are way, way, way too quick to cancel people.\n\n26:35.200 --> 26:47.240\n And it's become almost reflexive now, someone says something or makes an offhand comment,\n\n26:47.240 --> 26:54.120\n even a mistake, there's a move to simply cancel folks.\n\n26:54.120 --> 27:02.920\n So I think that this, quote unquote, cancel culture has really gotten out of control at\n\n27:02.920 --> 27:04.320\n this point.\n\n27:04.320 --> 27:09.080\n It's forcing people to be robotic in many ways.\n\n27:09.080 --> 27:10.080\n No offense to robots.\n\n27:10.080 --> 27:15.720\n I was going to say, now I know I'm venturing into your intellectual domain.\n\n27:15.720 --> 27:18.840\n For future robots watching this, no offense.\n\n27:18.840 --> 27:24.760\n And there are minutes discouraging a lot of good people from getting into public life\n\n27:24.760 --> 27:29.800\n in any sort of way, because who needs the stress of it?\n\n27:29.800 --> 27:36.140\n Well, in some sense, you're an inspiration that you're able to withstand the pressure\n\n27:36.140 --> 27:37.440\n of the masses.\n\n27:37.440 --> 27:44.600\n But it's a sad aspect of human nature that we kind of get into these crowds and we start\n\n27:44.600 --> 27:49.380\n chanting and it's fun for some reason, and then you forget yourself and then you sort\n\n27:49.380 --> 27:57.160\n of wake up the next day not having anticipated the consequences of all the chanting.\n\n27:57.160 --> 27:58.920\n And we would get ourselves in trouble in that.\n\n27:58.920 --> 28:06.120\n I mean, there's some responsibility on social networks and the mechanisms by which they\n\n28:06.120 --> 28:10.400\n make it more frictionless to do the chanting, to do the canceling, to do the outrage and\n\n28:10.400 --> 28:11.400\n all that kind of stuff.\n\n28:11.400 --> 28:14.840\n I actually, on the technology side, have a hope that that's fixable.\n\n28:14.840 --> 28:23.600\n But yeah, it does seem to be, you know, it almost like the internet showed to us that\n\n28:23.600 --> 28:28.560\n we have a lot of broken ways about which we communicate with each other and we're trying\n\n28:28.560 --> 28:29.560\n to figure that out.\n\n28:29.560 --> 28:31.880\n Same with the university.\n\n28:31.880 --> 28:37.560\n This mistake by Harvard showed that we need to reinvent what the university is.\n\n28:37.560 --> 28:44.560\n I mean, all of this is, it's almost like we're finding our baby deer legs and trying to strengthen\n\n28:44.560 --> 28:48.920\n the institutions that have been very successful for a long time.\n\n28:48.920 --> 28:54.920\n You know, the really interesting thing about Harvey Weinstein and you choosing these exceptionally\n\n28:54.920 --> 29:06.260\n difficult cases is also thinking about what it means to defend evil people, what it means\n\n29:06.260 --> 29:13.640\n to defend these, we could say unpopular, and you might push back against the word evil,\n\n29:13.640 --> 29:16.880\n but bad people in society.\n\n29:16.880 --> 29:20.120\n First of all, do you think there's such a thing as evil or do you think all people are\n\n29:20.120 --> 29:24.360\n good and it's just circumstances that create evil?\n\n29:24.360 --> 29:29.760\n And also, is there somebody too evil for the law to defend?\n\n29:29.760 --> 29:36.180\n So the first question, that's a deep philosophical question, whether the category of evil does\n\n29:36.180 --> 29:38.920\n any work for me.\n\n29:38.920 --> 29:39.920\n It does for me.\n\n29:39.920 --> 29:49.160\n I do think that, I do subscribe to that category that there is evil in the world as conventionally\n\n29:49.160 --> 29:51.560\n understood.\n\n29:51.560 --> 29:57.360\n So there are many who will say, yeah, that just doesn't do any work for me.\n\n29:57.360 --> 30:04.960\n But the category evil, in fact, does intellectual work for me and I understand it as something\n\n30:04.960 --> 30:08.400\n that exists.\n\n30:08.400 --> 30:11.600\n Is it genetic or is it the circumstance?\n\n30:11.600 --> 30:13.480\n What kind of work does it do for you intellectually?\n\n30:13.480 --> 30:21.600\n I think that it's highly contingent, that is to say that the conditions in which one\n\n30:21.600 --> 30:32.600\n grows up and so forth begins to create this category that we may think of as evil.\n\n30:32.600 --> 30:42.020\n Now there are studies and whatnot that show that certain brain abnormalities and so forth\n\n30:42.020 --> 30:45.580\n are more prevalent in, say, serial killer.\n\n30:45.580 --> 30:54.560\n So there may be a biological predisposition to certain forms of conduct, but I don't\n\n30:54.560 --> 31:05.480\n have the biological evidence to make a statement that someone is born evil and I'm not a determinist\n\n31:05.480 --> 31:11.500\n thinker in that way, so you come out the womb evil and you're destined to be that way.\n\n31:11.500 --> 31:21.280\n To the extent there may be biological determinants, they still require some nurture as well.\n\n31:21.280 --> 31:26.440\n But do you still put a responsibility on the individual?\n\n31:26.440 --> 31:27.720\n Of course, yeah.\n\n31:27.720 --> 31:36.820\n We all make choices and so some responsibility on the individual indeed.\n\n31:36.820 --> 31:45.360\n We live in a culture, unfortunately, where a lot of people have a constellation of bad\n\n31:45.360 --> 31:49.960\n choices in front of them and that makes me very sad.\n\n31:49.960 --> 31:56.360\n Some people grow up with predominantly bad choices in front of them and that's unfair\n\n31:56.360 --> 32:00.640\n and that's on all of us, but yes, I do think we make choices.\n\n32:00.640 --> 32:08.180\n Wow, that's so powerful, the constellation of bad choices.\n\n32:08.180 --> 32:17.520\n That's such a powerful way to think about equality, which is the set of trajectories\n\n32:17.520 --> 32:19.820\n before you that you could take.\n\n32:19.820 --> 32:27.600\n If you just roll the dice, life is a kind of optimization problem, sorry to take this\n\n32:27.600 --> 32:33.440\n into math, over a set of trajectories under imperfect information.\n\n32:33.440 --> 32:44.640\n So you're going to do a lot of stupid shit to put it in technical terms, but the fraction\n\n32:44.640 --> 32:49.880\n of the trajectories that take you into bad places or into good places is really important\n\n32:49.880 --> 32:51.960\n and that's ultimately what we're talking about.\n\n32:51.960 --> 32:57.520\n And evil might be just a little bit of a predisposition biologically, but the rest is just trajectories\n\n32:57.520 --> 32:58.520\n that you can take.\n\n32:58.520 --> 33:01.360\n I've been studying Hitler a lot recently.\n\n33:01.360 --> 33:06.040\n I've been reading probably way too much and it's interesting to think about all the possible\n\n33:06.040 --> 33:14.040\n trajectories that could have avoided this particular individual developing the hate\n\n33:14.040 --> 33:23.240\n that he did, the following that he did, the actual final, there's a few turns in him psychologically\n\n33:23.240 --> 33:33.280\n where he went from being a leader that just wants to conquer and to somebody who allowed\n\n33:33.280 --> 33:40.080\n his anger and emotion to take over, to where he started making mistakes in terms of militarily\n\n33:40.080 --> 33:46.360\n speaking, but also started doing evil things.\n\n33:46.360 --> 33:51.280\n And all the possible trajectories that could have avoided that are fascinating, including\n\n33:51.280 --> 34:00.360\n he wasn't that bad at painting, at drawing from the very beginning and his time in Vienna,\n\n34:00.360 --> 34:04.080\n there's all these possible things to think about and of course there's millions of others\n\n34:04.080 --> 34:08.320\n like him that never came to power and all those kinds of things.\n\n34:08.320 --> 34:12.640\n But that goes to the second question on the side of evil.\n\n34:12.640 --> 34:18.000\n Do you think, and Hitler's often brought up as like an example of somebody who is like\n\n34:18.000 --> 34:25.960\n the epitome of evil, do you think you would, if you got that same phone call after World\n\n34:25.960 --> 34:37.960\n War II and Hitler survived during the trial for war crimes, would you take the case defending\n\n34:37.960 --> 34:39.700\n Adolf Hitler?\n\n34:39.700 --> 34:46.000\n If you don't want to answer that one, is there a line to draw for evil for who not to defend?\n\n34:46.000 --> 34:51.760\n No, I think everyone, I'll do the second one first, everyone has a right to a defense\n\n34:51.760 --> 34:56.040\n if you're charged criminally in the United States of America.\n\n34:56.040 --> 35:03.320\n So no, I do not think that there's someone so evil that they do not deserve a defense.\n\n35:03.320 --> 35:05.440\n Process matters.\n\n35:05.440 --> 35:11.820\n Process helps us get to results more accurately than we would otherwise.\n\n35:11.820 --> 35:18.100\n So it is important and it's vitally important and indeed more important for someone deemed\n\n35:18.100 --> 35:23.760\n to be evil to receive the same quantum of process and the same substance of process\n\n35:23.760 --> 35:25.620\n that anyone else would.\n\n35:25.620 --> 35:31.480\n It's vitally important to the health of our criminal justice system for that to happen.\n\n35:31.480 --> 35:38.340\n So yes, everybody, Hitler included, were he charged in the United States for a crime that\n\n35:38.340 --> 35:44.700\n occurred in the United States, yes.\n\n35:44.700 --> 35:49.760\n Whether I would do it, if I were a public defender and assigned the case, yes, I started\n\n35:49.760 --> 35:51.680\n my career as a public defender.\n\n35:51.680 --> 35:56.040\n I represent anyone who was assigned to me.\n\n35:56.040 --> 35:59.320\n I think that is our duty.\n\n35:59.320 --> 36:10.000\n In private practice, I have choices and I likely, based on the hypo you gave me, and\n\n36:10.000 --> 36:15.400\n I would tweak it a bit because it would have to be a U.S. crime.\n\n36:15.400 --> 36:19.320\n But I get the broader point and don't want to bog down in technicalities.\n\n36:19.320 --> 36:30.120\n I'd likely pass right now as I see it, unless it was a case where nobody else would represent\n\n36:30.120 --> 36:40.800\n him, then I would think that I have some sort of duty and obligation to do it.\n\n36:40.800 --> 36:45.840\n But yes, everyone absolutely deserves a right to competent counsel.\n\n36:45.840 --> 36:52.840\n That is a beautiful ideal, it's difficult to think about it in the face of public pressure.\n\n36:52.840 --> 37:00.300\n It's just, I mean, it's kind of terrifying to watch the masses during this past year\n\n37:00.300 --> 37:08.240\n of 2020, to watch the power of the masses to make a decision before any of the data\n\n37:08.240 --> 37:17.600\n is out, if the data is ever out, any of the details, any of the processes, and there is\n\n37:17.600 --> 37:20.600\n an anger to the justice system.\n\n37:20.600 --> 37:25.280\n There's a lot of people that feel like even though the ideal you describe is a beautiful\n\n37:25.280 --> 37:30.380\n one, it does not always operate justly.\n\n37:30.380 --> 37:35.000\n It does not operate to the best of its ideals, it operates unfairly.\n\n37:35.000 --> 37:42.880\n When we go to the big picture of the criminal justice system, what do you, given the ideal,\n\n37:42.880 --> 37:48.840\n works about our criminal justice system and what is broken?\n\n37:48.840 --> 37:54.880\n Well there's a lot broken right now, and I usually focus on that.\n\n37:54.880 --> 37:59.080\n But in truth, a lot works about our criminal justice system.\n\n37:59.080 --> 38:07.920\n So there's an old joke, and it's funny, but it carries a lot of truth to it.\n\n38:07.920 --> 38:16.840\n And the joke is that in the United States, we have the worst criminal justice system\n\n38:16.840 --> 38:20.840\n in the world, except for every place else.\n\n38:20.840 --> 38:29.040\n And yes, we certainly have a number of problems, and a lot of problems based on race and class,\n\n38:29.040 --> 38:36.160\n and economics, station, but we have a process that privileges liberty.\n\n38:36.160 --> 38:40.420\n And that's a good feature of the criminal justice system.\n\n38:40.420 --> 38:41.640\n So here's how it works.\n\n38:41.640 --> 38:49.900\n The idea of the relationship between the individual and the state is such that in the United States,\n\n38:49.900 --> 38:57.920\n we privilege liberty over and above very many values, so much so that a statement by increased\n\n38:57.920 --> 39:04.640\n Mather not terribly far from where we're sitting right now has gained traction over\n\n39:04.640 --> 39:10.840\n all these years, and it's that better ten guilty go free than one innocent person convicted.\n\n39:10.840 --> 39:18.340\n That is an expression of the way in which we understand liberty to operate in our collective\n\n39:18.340 --> 39:19.420\n consciousness.\n\n39:19.420 --> 39:28.260\n We would rather a bunch of guilty people go free than to impact the liberty interests\n\n39:28.260 --> 39:30.900\n of any individual person.\n\n39:30.900 --> 39:36.840\n So that's a guiding principle in our criminal justice system, liberty.\n\n39:36.840 --> 39:42.880\n So we set a process that makes it difficult to convict people.\n\n39:42.880 --> 39:51.120\n We have rules of procedure that are cumbersome and that slow down the process and that exclude\n\n39:51.120 --> 39:58.240\n otherwise reliable evidence, and this is all because we place a value on liberty.\n\n39:58.240 --> 40:04.640\n And I think these are good things, and it says a lot about our criminal justice system.\n\n40:04.640 --> 40:11.640\n Some of the bad features have to do with the way in which this country sees color as a\n\n40:11.640 --> 40:18.600\n proxy for criminality and treats people of color in radically different ways in the criminal\n\n40:18.600 --> 40:27.300\n justice system, from arrests to charging decisions to sentencing.\n\n40:27.300 --> 40:33.920\n People of color are disproportionately impacted on all sorts of registers.\n\n40:33.920 --> 40:44.240\n One example, and it's a popular one, that although there appears to be no distinguishable\n\n40:44.240 --> 40:52.940\n difference between drug use by whites and blacks in the country, blacks, though only\n\n40:52.940 --> 41:00.960\n 12% of the population represent 40% of the drug charges in the country, there's some\n\n41:00.960 --> 41:09.800\n disequities along race and class in the criminal justice system that we really have to fix.\n\n41:09.800 --> 41:16.380\n And they've grown to more than bugs in the system and have become features, unfortunately,\n\n41:16.380 --> 41:17.380\n of our system.\n\n41:17.380 --> 41:23.160\n Oh, to make it more efficient, to make judgments, so the racism makes it more efficient.\n\n41:23.160 --> 41:33.520\n It efficiently moves people from society to the streets, and a lot of innocent people\n\n41:33.520 --> 41:35.000\n get caught up in that.\n\n41:35.000 --> 41:39.360\n Well, let me ask in terms of the innocents.\n\n41:39.360 --> 41:50.360\n So you've gotten a lot of people who are innocent, I guess, revealed their innocence, demonstrated\n\n41:50.360 --> 41:51.640\n their innocence.\n\n41:51.640 --> 41:53.240\n What's that process like?\n\n41:53.240 --> 41:55.440\n What's it like emotionally, psychologically?\n\n41:55.440 --> 42:04.860\n What's it like legally to fight the system through the process of revealing the innocence\n\n42:04.860 --> 42:05.860\n of a human being?\n\n42:05.860 --> 42:09.040\n Yeah, emotionally and psychologically, it can be taxing.\n\n42:09.040 --> 42:17.240\n I follow a model of what's called empathic representation, and that is I get to know\n\n42:17.240 --> 42:22.040\n my clients and their family, that I get to know their strivings, their aspirations, their\n\n42:22.040 --> 42:24.420\n fears, their sorrows.\n\n42:24.420 --> 42:32.080\n So that certainly sometimes can do psychic injury on one.\n\n42:32.080 --> 42:42.700\n If you get really invested and really sad or happy, it does become emotionally taxing.\n\n42:42.700 --> 42:48.840\n But the idea of someone sitting in jail for 20 years completely innocent of a crime, can\n\n42:48.840 --> 42:54.920\n you imagine sitting there every day for 20 years knowing that you factually did not do\n\n42:54.920 --> 42:59.820\n the thing that you were convicted of by a jury of your peers?\n\n42:59.820 --> 43:05.560\n It's got to be the most incredible thing in the world.\n\n43:05.560 --> 43:09.680\n But the people who do it and the people who make it and come out on the other side as\n\n43:09.680 --> 43:16.860\n productive citizens are folks who say they've come to an inner peace in their own minds\n\n43:16.860 --> 43:27.800\n and they say, these bars aren't going to define me, that my humanity is there and it's immutable.\n\n43:27.800 --> 43:30.680\n And they are not bitter, which is amazing.\n\n43:30.680 --> 43:33.600\n I tend to think that I'm not that good of a person.\n\n43:33.600 --> 43:39.480\n I would be bitter for every day of 20 years if I were in jail for something.\n\n43:39.480 --> 43:44.820\n But people tell me that they can't survive, that one cannot survive like that.\n\n43:44.820 --> 43:47.000\n And you have to come to terms with it.\n\n43:47.000 --> 43:57.600\n And the people whom I've exonerated, most of them come out and they just really just\n\n43:57.600 --> 44:02.480\n take on life with a vim and vigor without bitterness.\n\n44:02.480 --> 44:04.400\n And it's a beautiful thing to see.\n\n44:04.400 --> 44:10.800\n Do you think it's possible to eradicate racism from the judicial system?\n\n44:10.800 --> 44:11.800\n I do.\n\n44:11.800 --> 44:19.280\n I think that race insinuates itself in all aspects of our lives and the judicial system\n\n44:19.280 --> 44:21.300\n is not immune from that.\n\n44:21.300 --> 44:30.080\n So to the extent we begin to eradicate dangerous and deleterious race thinking from society\n\n44:30.080 --> 44:36.320\n generally, then it will be eradicated from the criminal justice system.\n\n44:36.320 --> 44:42.040\n I think we've got a lot of work to do and I think it'll be a while, but I think it's\n\n44:42.040 --> 44:43.040\n doable.\n\n44:43.040 --> 44:52.200\n I mean, you know, the country – so historians will look back 300 years from now and take\n\n44:52.200 --> 45:02.480\n note of the incredible journey of diasporic Africans in the U.S., an incredible journey\n\n45:02.480 --> 45:12.560\n from slavery to the heights of politics and business and judiciary and the academy and\n\n45:12.560 --> 45:17.620\n so forth in not a lot of time, in actually not a lot of time.\n\n45:17.620 --> 45:25.120\n And if we can have that sort of movement historically, let's think about what the next 175 years\n\n45:25.120 --> 45:26.120\n will look like.\n\n45:26.120 --> 45:31.640\n I'm not saying it's going to be short, but I'm saying that if we keep at it, keep\n\n45:31.640 --> 45:41.120\n getting to know each other a little better, keep enforcing laws that prohibit the sort\n\n45:41.120 --> 45:48.360\n of race based discrimination that people have experienced and provide as a society opportunities\n\n45:48.360 --> 45:55.200\n for people to thrive in this world, then I think we can see a better world and if we\n\n45:55.200 --> 45:57.720\n see a better world, we'll see a better judicial system.\n\n45:57.720 --> 46:01.960\n So I think it's kind of fascinating if you look throughout history and race is just part\n\n46:01.960 --> 46:11.800\n of that is we create the other and treat the other with disdain through the legal system,\n\n46:11.800 --> 46:13.800\n but just through human nature.\n\n46:13.800 --> 46:18.440\n I tend to believe, we mentioned offline that I work with robots.\n\n46:18.440 --> 46:22.000\n It sounds absurd to say, especially to you, especially because we're talking about racism\n\n46:22.000 --> 46:28.520\n and it's so prevalent today, I do believe that there will be almost like a civil rights\n\n46:28.520 --> 46:39.440\n movement for robots because I think there's a huge value to society of having artificial\n\n46:39.440 --> 46:49.200\n intelligence systems that interact with humans and are human like and the more they become\n\n46:49.200 --> 46:58.480\n human like, they will start to ask very fundamentally human questions about freedom, about suffering,\n\n46:58.480 --> 47:05.960\n about justice, and they will have to come face to face, like look in the mirror in asking\n\n47:05.960 --> 47:14.360\n the question, just because we're biologically based, just because we're sort of, well, just\n\n47:14.360 --> 47:20.120\n because we're human, does that mean we're the only ones that deserve the rights?\n\n47:20.120 --> 47:26.200\n Again, giving, forming another other group, which is robots, and I'm sure there could\n\n47:26.200 --> 47:32.400\n be along that path different versions of other that we form.\n\n47:32.400 --> 47:39.260\n So racism, race is certainly a big other that we've made, as you said, a lot of progress\n\n47:39.260 --> 47:44.000\n on throughout the history of this country, but it does feel like we always create, as\n\n47:44.000 --> 47:47.040\n we make progress, create new other groups.\n\n47:47.040 --> 47:52.460\n And of course the other group that perhaps is outside the legal system that people talk\n\n47:52.460 --> 48:00.140\n about is the essential, now I eat a lot of meat, but the torture of animals, the people\n\n48:00.140 --> 48:04.460\n talk about when we look back from a couple of centuries from now, look back at the kind\n\n48:04.460 --> 48:09.400\n of things we're doing to animals, we might regret that, we might see that in a very different\n\n48:09.400 --> 48:10.400\n light.\n\n48:10.400 --> 48:15.240\n And it's kind of interesting to see the future trajectory of what we wake up to about the\n\n48:15.240 --> 48:20.140\n injustice in our ways.\n\n48:20.140 --> 48:25.020\n But the robot one is the one I'm especially focused on, but at this moment in time it\n\n48:25.020 --> 48:29.640\n seems ridiculous, but I'm sure most civil rights movements throughout history seem ridiculous\n\n48:29.640 --> 48:30.640\n at first.\n\n48:30.640 --> 48:38.860\n Well, it's interesting, sort of outside of my intellectual bailiwick robots, as I understand\n\n48:38.860 --> 48:53.400\n the development of artificial intelligence, though the aspect that still is missing is\n\n48:53.400 --> 49:04.680\n this notion of consciousness, and that it's consciousness that is the thing that will\n\n49:04.680 --> 49:11.940\n move if it were to exist, and I'm not saying that it can or will, but if it were to exist\n\n49:11.940 --> 49:23.260\n would move robots from machines to something different, something that experienced the\n\n49:23.260 --> 49:29.600\n world in a way analogous to how we experience it.\n\n49:29.600 --> 49:37.100\n And also as I understand the science, there's, unlike what you see on television, that we're\n\n49:37.100 --> 49:46.620\n not there yet in terms of this notion of the machines having a consciousness.\n\n49:46.620 --> 49:49.820\n Or a great general intelligence, all those kinds of things.\n\n49:49.820 --> 49:50.820\n Yeah, yeah.\n\n49:50.820 --> 49:56.540\n A huge amount of progress has been made, and it's fascinating to watch, so I'm on both\n\n49:56.540 --> 50:02.180\n minds as a person who's building them, I'm realizing how sort of quote unquote dumb they\n\n50:02.180 --> 50:09.600\n are, but also looking at human history and how poor we are predicting the progress of\n\n50:09.600 --> 50:11.860\n innovation and technology.\n\n50:11.860 --> 50:17.780\n It's obvious that we have to be humble by our ability to predict, coupled with the fact\n\n50:17.780 --> 50:25.080\n that we keep, to use terminology carefully here, we keep discriminating against the intelligence\n\n50:25.080 --> 50:28.160\n of artificial systems.\n\n50:28.160 --> 50:33.880\n The smarter they get, the more ways we find to dismiss their intelligence.\n\n50:33.880 --> 50:38.900\n So this has just been going on throughout.\n\n50:38.900 --> 50:45.900\n It's almost as if we're threatened in the most primitive human way, animalistic way.\n\n50:45.900 --> 50:52.440\n We're threatened by the power of other creatures, and we want to lessen, dismiss them.\n\n50:52.440 --> 50:57.900\n So consciousness is a really important one, but the one I think about a lot in terms of\n\n50:57.900 --> 51:03.740\n consciousness, the very engineering question, is whether the display of consciousness is\n\n51:03.740 --> 51:06.880\n the same as the possession of consciousness.\n\n51:06.880 --> 51:15.240\n So if a robot tells you they are conscious, if a robot looks like they're suffering when\n\n51:15.240 --> 51:21.220\n you torture them, if a robot is afraid of death and says they're afraid of death and\n\n51:21.220 --> 51:31.280\n are legitimately afraid, in terms of just everything we as humans use to determine the\n\n51:31.280 --> 51:38.220\n ability of somebody to be their own entity, they're the one that loves, one that fears,\n\n51:38.220 --> 51:47.460\n one that hopes, one that can suffer, if a robot in the dumbest of ways is able to display\n\n51:47.460 --> 51:53.260\n that, it starts changing things very quickly.\n\n51:53.260 --> 51:58.540\n I'm not sure what it is, but it does seem that there's a huge component to consciousness\n\n51:58.540 --> 52:05.640\n that is a social creation, like we together create our consciousness, like we believe\n\n52:05.640 --> 52:09.300\n our common humanity together.\n\n52:09.300 --> 52:15.600\n Alone we wouldn't be aware of our humanity, and the law as it protects our freedoms seems\n\n52:15.600 --> 52:22.660\n to be a construct of the social construct, and when you add other creatures into it,\n\n52:22.660 --> 52:28.740\n it's not obvious to me that you have to build, there'll be a moment when you say, this thing\n\n52:28.740 --> 52:30.620\n is now conscious.\n\n52:30.620 --> 52:35.380\n I think there's going to be a lot of fake it until you make it, and there'll be a very\n\n52:35.380 --> 52:42.980\n gray area between fake and make that is going to force us to contend with what it means\n\n52:42.980 --> 52:48.900\n to be an entity that deserves rights, where all men are created equal.\n\n52:48.900 --> 52:55.140\n The men part might have to expand in ways that we are not yet anticipating.\n\n52:55.140 --> 52:56.140\n It's very interesting.\n\n52:56.140 --> 53:01.300\n I mean, my favorite, the fundamental thing I love about artificial intelligence is it\n\n53:01.300 --> 53:02.620\n gets smarter and smarter.\n\n53:02.620 --> 53:09.700\n It challenges to think of what is right, the questions of justice, questions of freedom.\n\n53:09.700 --> 53:21.700\n It basically challenges us to understand our own mind, to understand what, almost from\n\n53:21.700 --> 53:26.760\n an engineering first principles perspective, to understand what it is that makes us human,\n\n53:26.760 --> 53:31.340\n that is at the core of all the rights that we talk about and all the documents we write.\n\n53:31.340 --> 53:36.660\n So even if we don't give rights to artificial intelligence systems, we may be able to construct\n\n53:36.660 --> 53:40.220\n more fair legal systems to protect us humans.\n\n53:40.220 --> 53:49.380\n Well, I mean, interesting ontological question between the performance of consciousness and\n\n53:49.380 --> 53:58.420\n actual consciousness to the extent that actual consciousness is anything beyond some contingent\n\n53:58.420 --> 53:59.420\n reality.\n\n53:59.420 --> 54:04.940\n But you've posed a number of interesting philosophical questions, and then there's\n\n54:04.940 --> 54:13.580\n also, it strikes me that philosophers of religion would pose another set of questions as well\n\n54:13.580 --> 54:27.060\n when you deal with issues of structure versus soul, body versus soul, and it will be a complicated\n\n54:27.060 --> 54:33.860\n mix and I suspect I'll be dust by the time those questions get worked out.\n\n54:33.860 --> 54:37.060\n And so, yeah, the soul is a fun one.\n\n54:37.060 --> 54:41.940\n There's no soul, I'm not sure maybe you can correct me, but there's very few discussion\n\n54:41.940 --> 54:44.620\n of soul in our legal system, right?\n\n54:44.620 --> 54:47.740\n Right, correct, none.\n\n54:47.740 --> 54:53.060\n But there is a discussion about what constitutes a human being, and I mean, you gestured at\n\n54:53.060 --> 55:01.940\n the notion of the potential of the law widening the domain of a human being.\n\n55:01.940 --> 55:10.140\n So in that sense, right, you know, people are very angry because they can't get sort\n\n55:10.140 --> 55:17.980\n of pain and suffering damages if someone negligently kills a pet because a pet is not a human being.\n\n55:17.980 --> 55:25.380\n And people say, well, I love my pet, but the law sees a pet as chattel, as property like\n\n55:25.380 --> 55:27.940\n this water bottle.\n\n55:27.940 --> 55:37.420\n So the current legal definitions trade on a definition of humanity that may not be worked\n\n55:37.420 --> 55:45.400\n out in any sophisticated way, but certainly there's a broad and shared understanding\n\n55:45.400 --> 55:47.700\n of what it means.\n\n55:47.700 --> 55:55.260\n So it probably doesn't explicitly contain a definition of something like soul, but it's\n\n55:55.260 --> 56:02.100\n more robust than, you know, a carbon based organism, that there's something a little\n\n56:02.100 --> 56:07.060\n more distinct about what the law thinks a human being is.\n\n56:07.060 --> 56:12.740\n So if we can dive into, we've already been doing it, but if we can dive into more difficult\n\n56:12.740 --> 56:14.400\n territory.\n\n56:14.400 --> 56:20.740\n So 2020 had the tragic case of George Floyd.\n\n56:20.740 --> 56:27.820\n Can you reflect on the protests, on the racial tensions over the death of George Floyd?\n\n56:27.820 --> 56:29.700\n How do you make sense of it all?\n\n56:29.700 --> 56:32.540\n What do you take away from these events?\n\n56:32.540 --> 56:44.420\n The George Floyd moment occurred at an historical moment where people were in quarantine for\n\n56:44.420 --> 56:56.300\n COVID, and people have these cell phones to a degree greater than we've ever had them\n\n56:56.300 --> 56:57.300\n before.\n\n56:57.300 --> 57:03.580\n And this was sort of the straw that broke the camel's back after a number of these sorts\n\n57:03.580 --> 57:08.100\n of cell phone videos surfaced.\n\n57:08.100 --> 57:10.860\n People were fed up.\n\n57:10.860 --> 57:21.940\n There was unimpeachable evidence of a form of mistreatment, whether it constitutes murder\n\n57:21.940 --> 57:28.020\n or manslaughter, the trial is going on now, and jurors will figure that out, but there\n\n57:28.020 --> 57:36.500\n was widespread appreciation that a fellow human being was mistreated, that we were just\n\n57:36.500 --> 57:43.980\n talking about humanity, that there was not a sufficient recognition of this person's\n\n57:43.980 --> 57:44.980\n humanity.\n\n57:44.980 --> 57:46.700\n The common humanity of this person, yeah.\n\n57:46.700 --> 57:50.040\n The common humanity of this person, well said.\n\n57:50.040 --> 57:51.180\n And people were fed up.\n\n57:51.180 --> 57:59.780\n So we were already in this COVID space where we were exercising care for one another, and\n\n57:59.780 --> 58:04.740\n there was just an explosion, the likes of which this country hasn't seen since the civil\n\n58:04.740 --> 58:10.700\n rights protests of the 1950s and 1960s.\n\n58:10.700 --> 58:15.800\n And people simply said, enough, enough, enough, enough.\n\n58:15.800 --> 58:17.000\n This has to stop.\n\n58:17.000 --> 58:23.260\n We cannot treat fellow citizens in this way, and we can't do it with impunity.\n\n58:23.260 --> 58:28.380\n And the young people said, we're not going to stand for it anymore, and they took to\n\n58:28.380 --> 58:30.140\n the streets.\n\n58:30.140 --> 58:38.540\n But with millions of people protesting, there is nevertheless taking us back to the most\n\n58:38.540 --> 58:40.680\n difficult of trials.\n\n58:40.680 --> 58:45.700\n You have the trial, like you mentioned, that's going on now, of Derek Chauvin, of one of\n\n58:45.700 --> 58:49.580\n the police officers involved.\n\n58:49.580 --> 58:51.220\n What are your thoughts?\n\n58:51.220 --> 58:57.380\n What are your predictions on this trial where the law, the process of the law is trying\n\n58:57.380 --> 59:01.740\n to proceed in the face of so much racial tension?\n\n59:01.740 --> 59:04.420\n Yeah, it's going to be an interesting trial.\n\n59:04.420 --> 59:10.820\n I've been keeping an eye on it there in jury selection now, today, as we're talking.\n\n59:10.820 --> 59:14.020\n So a lot's going to depend on what sort of jury gets selected.\n\n59:14.020 --> 59:21.140\n Yeah, sorry to interrupt, but so one of the interesting qualities of this trial, maybe\n\n59:21.140 --> 59:26.060\n you can correct me if I'm wrong, but the cameras are allowed in the courtroom, at least during\n\n59:26.060 --> 59:28.340\n the jury selection.\n\n59:28.340 --> 59:31.780\n So you get to watch some of this stuff.\n\n59:31.780 --> 59:36.340\n And the other part is the jury selection, again, I'm very inexperienced, but it seems\n\n59:36.340 --> 59:43.900\n like selecting an, what is it, unbiased jury is really difficult for this trial.\n\n59:43.900 --> 59:54.180\n It almost like, I don't know, me as a listener, listening to people that are trying to talk\n\n59:54.180 --> 1:00:00.420\n their way into the jury kind of thing, trying to decide, is this person really unbiased?\n\n1:00:00.420 --> 1:00:06.460\n Are they just trying to hold on to their like deeply held emotions and trying to get onto\n\n1:00:06.460 --> 1:00:07.460\n the jury?\n\n1:00:07.460 --> 1:00:09.140\n I mean, it's an incredibly difficult process.\n\n1:00:09.140 --> 1:00:13.740\n I don't know if you can comment on a case so difficult, like the ones you've mentioned\n\n1:00:13.740 --> 1:00:20.580\n before, how do you select a jury that represents the people and doesn't, and carries the sort\n\n1:00:20.580 --> 1:00:22.100\n of the ideal of the law?\n\n1:00:22.100 --> 1:00:23.100\n Yeah.\n\n1:00:23.100 --> 1:00:24.100\n So a couple things.\n\n1:00:24.100 --> 1:00:28.900\n Yes, it is televised and it will be televised, as they say, gavel to gavel.\n\n1:00:28.900 --> 1:00:32.620\n So the entire trial, the whole thing is going to be televised.\n\n1:00:32.620 --> 1:00:39.580\n So people are getting a view of how laborious jury selection can be.\n\n1:00:39.580 --> 1:00:44.340\n I think as of yesterday, they had picked six jurors and it's taken a week and they have\n\n1:00:44.340 --> 1:00:46.460\n to get to 14.\n\n1:00:46.460 --> 1:00:52.660\n So they've got, you know, probably another week or more to do.\n\n1:00:52.660 --> 1:00:56.380\n I've been in jury trials where it took a month to choose a jury.\n\n1:00:56.380 --> 1:01:01.700\n So that's the most important part, you have to choose the right sort of jury.\n\n1:01:01.700 --> 1:01:06.740\n So unbiased in the criminal justice system has a particular meaning.\n\n1:01:06.740 --> 1:01:12.100\n It means that, let me tell you what it doesn't mean.\n\n1:01:12.100 --> 1:01:17.780\n It doesn't mean that a person is not aware of the case.\n\n1:01:17.780 --> 1:01:22.820\n It also does not mean that a person hasn't formed an opinion about the case.\n\n1:01:22.820 --> 1:01:26.380\n Those are two popular misconceptions.\n\n1:01:26.380 --> 1:01:31.580\n What it does mean is that notwithstanding whether an individual has formed an opinion,\n\n1:01:31.580 --> 1:01:37.580\n notwithstanding whether an individual knows about the case, that individual can set aside\n\n1:01:37.580 --> 1:01:43.140\n any prior opinions, can set aside any notions that they've developed about the case and\n\n1:01:43.140 --> 1:01:49.020\n listen to the evidence presented at trial in conjunction with the judge's instructions\n\n1:01:49.020 --> 1:01:53.380\n on how to understand and view that evidence.\n\n1:01:53.380 --> 1:01:58.780\n So if a person can do that, then they're considered unbiased.\n\n1:01:58.780 --> 1:02:07.540\n So as a longtime defense attorney, I would be hesitant in a big case like this to pick\n\n1:02:07.540 --> 1:02:11.940\n a juror who's never heard of the case or anything going around because I'm thinking, well, who\n\n1:02:11.940 --> 1:02:17.940\n is this person and what in the world do they do?\n\n1:02:17.940 --> 1:02:18.940\n Or are they lying to me?\n\n1:02:18.940 --> 1:02:23.060\n I mean, how can you not have heard about this case?\n\n1:02:23.060 --> 1:02:25.980\n So they may bring other problems.\n\n1:02:25.980 --> 1:02:30.900\n So I don't mind so much people who've heard about the case or folks who've formed initial\n\n1:02:30.900 --> 1:02:40.260\n opinions, but what you don't want is people who have tethered themselves to that opinion\n\n1:02:40.260 --> 1:02:46.500\n in a way that they can't be convinced otherwise.\n\n1:02:46.500 --> 1:02:52.100\n But you also have people who, as you suggested, who just lie because they want to get on the\n\n1:02:52.100 --> 1:02:54.460\n jury or lie because they want to get off the jury.\n\n1:02:54.460 --> 1:03:02.220\n So sometimes people come and say the most ridiculous, outrageous, offensive things because\n\n1:03:02.220 --> 1:03:05.020\n they know that they'll get excused for cause.\n\n1:03:05.020 --> 1:03:11.220\n And others who, you can tell, really badly want to get on the jury.\n\n1:03:11.220 --> 1:03:20.080\n So they pretend to be the most neutral, unbiased person in the world, what the law calls the\n\n1:03:20.080 --> 1:03:21.180\n reasonable person.\n\n1:03:21.180 --> 1:03:28.300\n We have in law the reasonable person standard, and I would tell my class the reasonable person\n\n1:03:28.300 --> 1:03:34.060\n in real life is the person that you would be least likely to want to have a drink with.\n\n1:03:34.060 --> 1:03:40.560\n They're the most boring, neutral, not interesting sort of person in the world.\n\n1:03:40.560 --> 1:03:48.180\n And so a lot of jurors engage in the performative act of presenting themselves as the most sort\n\n1:03:48.180 --> 1:03:52.820\n of even killed, rational, reasonable person because they really want to get on the jury.\n\n1:03:52.820 --> 1:03:57.940\n Yeah, there's an interesting question, I apologize, I haven't watched a lot because it is very\n\n1:03:57.940 --> 1:03:58.940\n long.\n\n1:03:58.940 --> 1:04:06.180\n You know, there's certain questions you ask in the jury selection.\n\n1:04:06.180 --> 1:04:15.220\n I remember I think one jumped out at me, which is something like, does the fact that this\n\n1:04:15.220 --> 1:04:21.140\n person is a police officer make you feel any kind of way about them?\n\n1:04:21.140 --> 1:04:27.220\n So trying to get at that, you know, I don't know what that is, I guess that's bias.\n\n1:04:27.220 --> 1:04:33.000\n And it's such a difficult question to ask, like I asked myself with that question, like\n\n1:04:33.000 --> 1:04:39.420\n how much, you know, we all kind of want to pretend that we're not racist, we don't judge,\n\n1:04:39.420 --> 1:04:44.560\n we don't have, we're like these, we're the reasonable human, but, you know, legitimately\n\n1:04:44.560 --> 1:04:53.140\n asking yourself like, what are the prejudgments you have in your mind?\n\n1:04:53.140 --> 1:04:55.740\n Is that even impossible for a human being?\n\n1:04:55.740 --> 1:04:59.540\n Like when you look at yourself in the mirror and think about it, is it possible to actually\n\n1:04:59.540 --> 1:05:00.540\n answer that?\n\n1:05:00.540 --> 1:05:01.540\n Yeah.\n\n1:05:01.540 --> 1:05:08.060\n Look, I do not believe that people can be completely unbiased.\n\n1:05:08.060 --> 1:05:15.820\n We all have baggage and bias and bring it wherever we go, including to court.\n\n1:05:15.820 --> 1:05:25.540\n What you want is to try to find a person who can at least recognize when a bias is working\n\n1:05:25.540 --> 1:05:29.180\n and actively try to do the right thing.\n\n1:05:29.180 --> 1:05:31.720\n That's the best we can ask.\n\n1:05:31.720 --> 1:05:36.940\n So if a juror says, yeah, you know, I grew up in a place where I tend to believe what\n\n1:05:36.940 --> 1:05:39.720\n police officers say, that's just how I grew up.\n\n1:05:39.720 --> 1:05:46.460\n But if the judge is telling me that I have to listen to every witness equally, then I'll\n\n1:05:46.460 --> 1:05:52.300\n do my best and I won't weigh that testimony any higher than I would any other testimony.\n\n1:05:52.300 --> 1:05:57.300\n If you have someone answer a question like that, that sounds more sincere to me, sounds\n\n1:05:57.300 --> 1:05:58.300\n more honest.\n\n1:05:58.300 --> 1:06:02.060\n And if you want a person, you want a person to try to do that.\n\n1:06:02.060 --> 1:06:07.500\n And then in closing arguments, as the lawyer, I'd say something like, ladies and gentlemen,\n\n1:06:07.500 --> 1:06:15.300\n we chose you to be on this jury because you swore that you would do your level best to\n\n1:06:15.300 --> 1:06:17.300\n be fair.\n\n1:06:17.300 --> 1:06:19.420\n That's why we chose you.\n\n1:06:19.420 --> 1:06:23.020\n And I'm confident that you're going to do that here.\n\n1:06:23.020 --> 1:06:30.060\n So when you heard that police officer's testimony, the judge told you, you can't give more credit\n\n1:06:30.060 --> 1:06:33.660\n to that testimony just because it's a police officer.\n\n1:06:33.660 --> 1:06:37.660\n And I trust that you're going to do that and that you're going to look at witness number\n\n1:06:37.660 --> 1:06:40.940\n three, you know, John Smith, you're going to look at John Smith.\n\n1:06:40.940 --> 1:06:47.740\n John Smith has a different recollection and you're duty bound, duty bound to look at that\n\n1:06:47.740 --> 1:06:52.940\n testimony and this person's credibility, you know, the same degree as that other witness,\n\n1:06:52.940 --> 1:06:53.940\n right?\n\n1:06:53.940 --> 1:06:58.540\n And now what you have is just a, he said, she said matter, and this is a criminal case\n\n1:06:58.540 --> 1:07:01.140\n that has to be reasonable doubt, right?\n\n1:07:01.140 --> 1:07:07.300\n So, you know, and really someone who's trying to do the right thing, it's helpful, but no,\n\n1:07:07.300 --> 1:07:11.620\n you're not going to just find 14 people with no biases.\n\n1:07:11.620 --> 1:07:12.620\n That's absurd.\n\n1:07:12.620 --> 1:07:17.100\n Well, that's fascinating that, especially the way you're inspiring the way you're speaking\n\n1:07:17.100 --> 1:07:20.220\n now is, I mean, I guess you're calling on the jury.\n\n1:07:20.220 --> 1:07:23.940\n That's kind of the whole system is you're calling on the jury, each individual on the\n\n1:07:23.940 --> 1:07:31.220\n jury to step up and really think, you know, to, to step up and be their most thoughtful\n\n1:07:31.220 --> 1:07:39.020\n selves, actually, most introspective, like you're trying to basically ask people to be\n\n1:07:39.020 --> 1:07:41.340\n their best selves.\n\n1:07:41.340 --> 1:07:45.100\n And that's, and they, I guess a lot of people step up to that.\n\n1:07:45.100 --> 1:07:52.820\n A lot of people do, I'm very, I'm very pro jury, juries, they, they get it right a lot\n\n1:07:52.820 --> 1:07:58.100\n of the time, most of the time, and they really work hard to do it.\n\n1:07:58.100 --> 1:08:02.660\n So what do you think happens?\n\n1:08:02.660 --> 1:08:11.660\n I mean, maybe, I'm not so much on the legal side of things, but on the social side, it's\n\n1:08:11.660 --> 1:08:17.780\n like with the O.J. Simpson trial, do you think it's possible that Derek Chauvin does not\n\n1:08:17.780 --> 1:08:23.020\n get convicted of the, what is it, second degree murder?\n\n1:08:23.020 --> 1:08:24.780\n How do you think about that?\n\n1:08:24.780 --> 1:08:30.180\n How do you think about the potential social impact of that, the, the riots, the protests,\n\n1:08:30.180 --> 1:08:37.220\n the, either, either direction, any words that are said, the tension here could be explosive,\n\n1:08:37.220 --> 1:08:38.220\n especially with the cameras.\n\n1:08:38.220 --> 1:08:39.220\n Yeah.\n\n1:08:39.220 --> 1:08:44.860\n You know, so yes, there's certainly a possibility that he, he'll be acquitted.\n\n1:08:44.860 --> 1:08:55.360\n For homicide charges, for the jury to convict, they have to make a determination as to Officer\n\n1:08:55.360 --> 1:09:04.060\n Chauvin's, former Officer Chauvin's state of mind, whether he intended to cause some\n\n1:09:04.060 --> 1:09:13.300\n harm, whether he was grossly reckless in causing harm, so much so that he disregarded a known\n\n1:09:13.300 --> 1:09:16.260\n risk of death or serious bodily injury.\n\n1:09:16.260 --> 1:09:23.620\n And as you may have read in the papers, yesterday the judge allowed a third degree murder charge\n\n1:09:23.620 --> 1:09:33.820\n in Kentucky, which is, it's the mindset, the state of mind there is not an intention,\n\n1:09:33.820 --> 1:09:37.220\n but it's depraved indifference.\n\n1:09:37.220 --> 1:09:42.340\n And what that means is that the jury doesn't have to find that he intended to do anything.\n\n1:09:42.340 --> 1:09:50.060\n Rather, they could find that he was just indifferent to a risk.\n\n1:09:50.060 --> 1:09:51.060\n As dark.\n\n1:09:51.060 --> 1:09:52.060\n Yeah.\n\n1:09:52.060 --> 1:09:53.060\n Yeah.\n\n1:09:53.060 --> 1:09:54.060\n I'm not sure what's worse.\n\n1:09:54.060 --> 1:10:00.340\n Well, that's, that's a good point, but, but it's a, it's another basis for the jury\n\n1:10:00.340 --> 1:10:01.340\n to convict.\n\n1:10:01.340 --> 1:10:04.680\n But look, you never know what happens when you go to a jury trial.\n\n1:10:04.680 --> 1:10:16.520\n So there could be an acquittal, and if there is, I imagine there would be massive protests.\n\n1:10:16.520 --> 1:10:23.780\n If he's convicted, I don't think that would happen, because I just don't see, at least\n\n1:10:23.780 --> 1:10:30.780\n nothing I've seen or read suggests that there's a big pro Chauvin camp out there ready to\n\n1:10:30.780 --> 1:10:31.780\n protest.\n\n1:10:31.780 --> 1:10:37.620\n Well, there could be a, is there also potential tensions that could arise from the sentencing?\n\n1:10:37.620 --> 1:10:41.620\n I don't know how that exactly works, sort of not enough years kind of thing.\n\n1:10:41.620 --> 1:10:42.620\n Yeah, it could be.\n\n1:10:42.620 --> 1:10:43.620\n All that kind of stuff.\n\n1:10:43.620 --> 1:10:44.620\n It could be.\n\n1:10:44.620 --> 1:10:45.620\n I mean, it's, a lot could happen.\n\n1:10:45.620 --> 1:10:49.660\n So it depends on what he's convicted of, you know, one count I think is like up to\n\n1:10:49.660 --> 1:10:52.820\n 10 years, another counts up to 40 years.\n\n1:10:52.820 --> 1:10:57.560\n So it depends what he's convicted of, and yes, it depends on how much of the, how much\n\n1:10:57.560 --> 1:11:01.980\n time the judge gives him if he is convicted.\n\n1:11:01.980 --> 1:11:07.560\n There's a lot of space for people to be very angry, and so we will see what happens.\n\n1:11:07.560 --> 1:11:15.620\n I just feel like with a judge and the lawyers, there's an opportunity to have really important\n\n1:11:15.620 --> 1:11:17.980\n long lasting speeches.\n\n1:11:17.980 --> 1:11:23.280\n I don't know if they think of it that way, especially with the cameras.\n\n1:11:23.280 --> 1:11:29.940\n It feels like they have the capacity to heal or to divide.\n\n1:11:29.940 --> 1:11:35.940\n Do you ever think about that as a lawyer, as a legal mind, that your words aren't just\n\n1:11:35.940 --> 1:11:42.820\n about the case, but about the, they'll reverberate through history potentially?\n\n1:11:42.820 --> 1:11:49.340\n That is, that is certainly a possible consequence of things you say.\n\n1:11:49.340 --> 1:11:55.500\n I don't think that most lawyers think about that in the context of the case.\n\n1:11:55.500 --> 1:11:58.180\n Your role is much more narrow.\n\n1:11:58.180 --> 1:12:04.700\n You're the partisan advocate, as a defense lawyer, partisan advocate for that client.\n\n1:12:04.700 --> 1:12:11.780\n As a prosecutor, you're a minister of justice attempting to prosecute that particular case.\n\n1:12:11.780 --> 1:12:19.280\n But the reality is you are absolutely correct that sometimes the things you say will have\n\n1:12:19.280 --> 1:12:20.800\n a shelf life.\n\n1:12:20.800 --> 1:12:25.900\n You mentioned O.J. Simpson before, if the glove doesn't fit, you must acquit.\n\n1:12:25.900 --> 1:12:30.980\n It's going to be just in our lexicon for probably a long time now.\n\n1:12:30.980 --> 1:12:36.700\n So it happens, but that's not, and shouldn't be foremost on your mind.\n\n1:12:36.700 --> 1:12:37.700\n Right.\n\n1:12:37.700 --> 1:12:41.420\n What do you make of the O.J. Simpson trial?\n\n1:12:41.420 --> 1:12:44.400\n Do you have thoughts about it?\n\n1:12:44.400 --> 1:12:48.520\n He's out and about on social media now, he's a public figure.\n\n1:12:48.520 --> 1:12:51.580\n Is there lessons to be drawn from that whole saga?\n\n1:12:51.580 --> 1:12:53.820\n Well, you know, that was an interesting case.\n\n1:12:53.820 --> 1:12:58.960\n I was a young public defender, I want to say, in my first year as a public defender when\n\n1:12:58.960 --> 1:13:00.420\n that verdict came out.\n\n1:13:00.420 --> 1:13:03.180\n So that case was important in so many ways.\n\n1:13:03.180 --> 1:13:10.900\n One, it was the first DNA case, major DNA case, and there were significant lessons learned\n\n1:13:10.900 --> 1:13:11.900\n from that.\n\n1:13:11.900 --> 1:13:19.800\n The second mistake that the prosecution made was that they didn't present the science\n\n1:13:19.800 --> 1:13:25.160\n in a way that a lay jury could understand it.\n\n1:13:25.160 --> 1:13:34.740\n And what Johnny Cochran did was he understood the science and was able to translate that\n\n1:13:34.740 --> 1:13:43.140\n into a vocabulary that he bet that that jury understood.\n\n1:13:43.140 --> 1:13:46.700\n So Cochran was dismissive of a lot of DNA.\n\n1:13:46.700 --> 1:13:55.460\n They say they found such and such amount of DNA, that's just like me wiping my finger\n\n1:13:55.460 --> 1:14:00.220\n against my nose and just that little bit of DNA.\n\n1:14:00.220 --> 1:14:06.220\n And that was effective because the prosecution hadn't done a good job of establishing that\n\n1:14:06.220 --> 1:14:12.100\n yes, it's microscopic, you don't need that much, yes, wiping your hand on your nose and\n\n1:14:12.100 --> 1:14:17.120\n touching something, you can transfer a lot of DNA and that gives you good information.\n\n1:14:17.120 --> 1:14:22.060\n But you know, it was the first time that the public generally, and that jury maybe since\n\n1:14:22.060 --> 1:14:27.820\n high school science had heard, you know, nucleotide, I mean, it was just all these terms getting\n\n1:14:27.820 --> 1:14:33.260\n thrown at them, but it was not weaved into a narrative.\n\n1:14:33.260 --> 1:14:40.580\n So Cochran taught us that no matter what type of case it is, no matter what science is involved,\n\n1:14:40.580 --> 1:14:42.620\n it's still about storytelling.\n\n1:14:42.620 --> 1:14:53.620\n It's still about a narrative and he was great at that narrative and was consistent with\n\n1:14:53.620 --> 1:14:56.540\n his narrative all the way out.\n\n1:14:56.540 --> 1:15:03.100\n Another lesson that was relearned is that, you know, you never ask a question to which\n\n1:15:03.100 --> 1:15:04.580\n you don't know the answer.\n\n1:15:04.580 --> 1:15:09.380\n That's like trial advocacy 101.\n\n1:15:09.380 --> 1:15:15.840\n And so when they gave O.J. Simpson the glove and it wouldn't fit, you know, you don't do\n\n1:15:15.840 --> 1:15:18.220\n things where you just don't know how it's going to turn out.\n\n1:15:18.220 --> 1:15:25.700\n It was way, way too risky and I think that's what acquitted him because the glove just\n\n1:15:25.700 --> 1:15:32.540\n wouldn't fit and he got to do this and ham in front of the camera and all of that and\n\n1:15:32.540 --> 1:15:33.540\n it was big.\n\n1:15:33.540 --> 1:15:37.540\n Do you think about, do you think about representation as a storytelling, like you, yourself and\n\n1:15:37.540 --> 1:15:38.540\n your role?\n\n1:15:38.540 --> 1:15:39.540\n Absolutely.\n\n1:15:39.540 --> 1:15:40.540\n Absolutely.\n\n1:15:40.540 --> 1:15:41.540\n We tell stories.\n\n1:15:41.540 --> 1:15:43.860\n It is fundamental.\n\n1:15:43.860 --> 1:15:51.180\n We, since time immemorial, we have told stories to help us make sense of the world around\n\n1:15:51.180 --> 1:15:52.180\n us.\n\n1:15:52.180 --> 1:16:03.220\n As a scientist, you tell a different type of story, but we as a public have told stories\n\n1:16:03.220 --> 1:16:09.700\n from time immemorial to help us make sense of the physical and the natural world and\n\n1:16:09.700 --> 1:16:15.300\n we are still a species that is moved by storytelling.\n\n1:16:15.300 --> 1:16:19.020\n So that's first and last in trial work.\n\n1:16:19.020 --> 1:16:22.420\n You have to tell a good story.\n\n1:16:22.420 --> 1:16:28.940\n And you know, the basic introductory books about trial work teach young students, young\n\n1:16:28.940 --> 1:16:35.940\n students and young lawyers to start an opening with this case is about, this case is about\n\n1:16:35.940 --> 1:16:38.960\n and then you fill in the blank and you know, that's your narrative.\n\n1:16:38.960 --> 1:16:41.580\n That's the narrative you're going to, you're going to tell.\n\n1:16:41.580 --> 1:16:47.560\n And of course you can do the ultra dramatic, the glove doesn't fit kind of the climax and\n\n1:16:47.560 --> 1:16:49.620\n all those kinds of things.\n\n1:16:49.620 --> 1:16:50.620\n Yes.\n\n1:16:50.620 --> 1:16:51.620\n But that's the best of narratives.\n\n1:16:51.620 --> 1:16:52.620\n Yes.\n\n1:16:52.620 --> 1:16:53.620\n The best of stories.\n\n1:16:53.620 --> 1:16:54.620\n Yes.\n\n1:16:54.620 --> 1:16:59.660\n Speaking of other really powerful stories that you were involved with is the Aaron Hernandez\n\n1:16:59.660 --> 1:17:03.540\n trial and the whole story, the whole legal case.\n\n1:17:03.540 --> 1:17:09.300\n Can you maybe overview the big picture story and legal case of Aaron Hernandez?\n\n1:17:09.300 --> 1:17:10.300\n Yeah.\n\n1:17:10.300 --> 1:17:20.420\n Aaron, whom I miss a lot, so he was charged with a double murder in the case that I tried.\n\n1:17:20.420 --> 1:17:26.780\n And this was a unique case and one of those impossible cases in part because Aaron had\n\n1:17:26.780 --> 1:17:31.020\n already been convicted of a murder.\n\n1:17:31.020 --> 1:17:36.420\n And so we had a client who was on trial for a double murder after having already been\n\n1:17:36.420 --> 1:17:40.060\n convicted of a separate murder.\n\n1:17:40.060 --> 1:17:48.480\n And we had a jury pool just about all of whom knew that he had been convicted of a murder\n\n1:17:48.480 --> 1:17:54.180\n because he was a very popular football player in Boston, which is a big football town with\n\n1:17:54.180 --> 1:17:55.940\n the Patriots.\n\n1:17:55.940 --> 1:18:02.800\n So everyone knew that he was a convicted murderer and here we are defending for in a double\n\n1:18:02.800 --> 1:18:04.980\n murder case.\n\n1:18:04.980 --> 1:18:07.820\n So that was the context.\n\n1:18:07.820 --> 1:18:15.680\n It was an odd case in the sense that this murder had gone unsolved for a couple of years\n\n1:18:15.680 --> 1:18:27.020\n and then a nightclub bouncer said something to a cop who was working at a club that Aaron\n\n1:18:27.020 --> 1:18:32.300\n Hernandez was somehow involved in that murder that happened in the theater district.\n\n1:18:32.300 --> 1:18:37.340\n That's the district where all the clubs are in Boston and where the homicide occurred.\n\n1:18:37.340 --> 1:18:46.740\n And once the police heard Aaron Hernandez's name, then they went all out in order to do\n\n1:18:46.740 --> 1:18:47.740\n this.\n\n1:18:47.740 --> 1:19:01.100\n They found a guy named Alexander Bradley, who was a very significant drug dealer in\n\n1:19:01.100 --> 1:19:09.260\n the sort of Connecticut area, very significant, very powerful.\n\n1:19:09.260 --> 1:19:17.620\n And he essentially, in exchange for a deal, pointed to Aaron and said, yeah, I was with\n\n1:19:17.620 --> 1:19:24.080\n Aaron and Aaron was the murderer.\n\n1:19:24.080 --> 1:19:25.860\n So that's how the case came to court.\n\n1:19:25.860 --> 1:19:26.860\n Okay.\n\n1:19:26.860 --> 1:19:28.380\n So that sets the context.\n\n1:19:28.380 --> 1:19:36.820\n What was your involvement in this case, like legally, intellectually, psychologically,\n\n1:19:36.820 --> 1:19:40.540\n when this particular second charge of murder?\n\n1:19:40.540 --> 1:19:49.940\n So a friend called me, Jose Baez, who is a defense attorney, and he comes to a class\n\n1:19:49.940 --> 1:19:57.040\n that I teach every year at Harvard, the trial advocacy workshop, as one of my teaching faculty\n\n1:19:57.040 --> 1:19:58.620\n members.\n\n1:19:58.620 --> 1:20:02.440\n It's a class where we teach students how to try cases.\n\n1:20:02.440 --> 1:20:12.600\n So Jose called me and said, hey, I got a call from Massachusetts, Aaron Hernandez.\n\n1:20:12.600 --> 1:20:15.720\n You want to go and talk to him with me?\n\n1:20:15.720 --> 1:20:16.720\n So I said, sure.\n\n1:20:16.720 --> 1:20:26.500\n So we went up to the prison and met Aaron and spoke with him for two or three hours\n\n1:20:26.500 --> 1:20:27.740\n that first time.\n\n1:20:27.740 --> 1:20:32.340\n And before we left, he said he wanted to retain us.\n\n1:20:32.340 --> 1:20:33.660\n He wanted to work with us.\n\n1:20:33.660 --> 1:20:34.980\n And that started the representation.\n\n1:20:34.980 --> 1:20:39.140\n What was he like in that time?\n\n1:20:39.140 --> 1:20:42.020\n What was he worn down by the whole process?\n\n1:20:42.020 --> 1:20:44.340\n Was there still a light in that?\n\n1:20:44.340 --> 1:20:45.340\n He was not.\n\n1:20:45.340 --> 1:20:49.700\n He had, I mean, more than just a light, he was luminous almost.\n\n1:20:49.700 --> 1:20:55.540\n He had a radiant million dollar smile whenever you walked in.\n\n1:20:55.540 --> 1:21:00.960\n My first impression I distinctly remember was, wow, this is what a professional athlete\n\n1:21:00.960 --> 1:21:01.960\n looks like.\n\n1:21:01.960 --> 1:21:09.180\n I mean, he walked in and he's just bigger and more fit than anyone anywhere.\n\n1:21:09.180 --> 1:21:10.780\n And it's like, wow.\n\n1:21:10.780 --> 1:21:13.940\n And when you saw him on television, he looked kind of little.\n\n1:21:13.940 --> 1:21:21.740\n And I remember thinking, well, what do those other guys look like in person?\n\n1:21:21.740 --> 1:21:32.820\n And he's extraordinarily polite, young, I was surprised by how young he was.\n\n1:21:32.820 --> 1:21:36.300\n Both in mind and body.\n\n1:21:36.300 --> 1:21:42.020\n Chronologically, I was thinking he was in his early 20s, I believe.\n\n1:21:42.020 --> 1:21:46.180\n But there seemed to be like an innocence to him in terms of just the way he saw the world.\n\n1:21:46.180 --> 1:21:47.740\n I think that's right.\n\n1:21:47.740 --> 1:21:50.820\n They picked that up from the documentary, just taking that in.\n\n1:21:50.820 --> 1:21:53.560\n I think that's right, yeah, yeah.\n\n1:21:53.560 --> 1:22:01.180\n So there is a Netflix documentary titled Killer Inside the Mind of Aaron Hernandez.\n\n1:22:01.180 --> 1:22:02.460\n What are your thoughts on this documentary?\n\n1:22:02.460 --> 1:22:04.980\n I don't know if you've gotten a chance to see it.\n\n1:22:04.980 --> 1:22:05.980\n I have not seen it.\n\n1:22:05.980 --> 1:22:07.180\n I did not participate in it.\n\n1:22:07.180 --> 1:22:13.500\n I know I was in it because there was news footage, but I did not participate in it.\n\n1:22:13.500 --> 1:22:22.340\n I had not talked to Aaron about press or anything before he died.\n\n1:22:22.340 --> 1:22:25.860\n My strong view is that the attorney client privilege survives death.\n\n1:22:25.860 --> 1:22:29.860\n And so I was not inclined to talk about anything that Aaron and I talked about.\n\n1:22:29.860 --> 1:22:34.260\n So I just didn't participate and have never watched it.\n\n1:22:34.260 --> 1:22:36.820\n Not even watch, huh?\n\n1:22:36.820 --> 1:22:42.300\n Does that apply to most of your work, do you try to stay away from the way the press perceives\n\n1:22:42.300 --> 1:22:43.300\n stuff?\n\n1:22:43.300 --> 1:22:46.540\n Well, during, yes, I try to stay away from it.\n\n1:22:46.540 --> 1:22:48.700\n I will view it afterwards.\n\n1:22:48.700 --> 1:22:53.660\n I just hadn't gotten around to watching Aaron, because it's kind of sad.\n\n1:22:53.660 --> 1:22:55.180\n So I just haven't watched it.\n\n1:22:55.180 --> 1:23:00.340\n But I definitely stay away from the press during trial.\n\n1:23:00.340 --> 1:23:06.700\n And there are some lawyers who watch it religiously to see what's going on, but I'm confident\n\n1:23:06.700 --> 1:23:15.820\n in my years of training and so forth that I can actively sense what's going on in the\n\n1:23:15.820 --> 1:23:26.820\n courtroom and that I really don't need advice from Joe476 at Gmail, some random guy on the\n\n1:23:26.820 --> 1:23:29.140\n internet telling me how to try cases.\n\n1:23:29.140 --> 1:23:33.340\n So to me, it's just confusing and I just keep it out of my mind.\n\n1:23:33.340 --> 1:23:38.220\n And even if you think you can ignore it, just reading it will have a little bit of an effect\n\n1:23:38.220 --> 1:23:39.220\n on your mind.\n\n1:23:39.220 --> 1:23:40.700\n I think that's right.\n\n1:23:40.700 --> 1:23:43.980\n Over time it might accumulate.\n\n1:23:43.980 --> 1:23:54.700\n So the documentary, but in general, it mentioned or kind of emphasized and talked about Aaron's\n\n1:23:54.700 --> 1:24:03.300\n sexuality or sort of they were discussing basically the idea that he was a homosexual.\n\n1:24:03.300 --> 1:24:10.500\n And some of the trauma, some of the suffering that he endured in his life had to do with\n\n1:24:10.500 --> 1:24:18.900\n sort of fear given the society of what his father would think of what others around him\n\n1:24:18.900 --> 1:24:23.060\n sort of, especially in sport culture and football and so on.\n\n1:24:23.060 --> 1:24:31.180\n So I don't know in your interaction with him was, do you think that maybe even leaning\n\n1:24:31.180 --> 1:24:38.820\n up to a suicide, do you think his struggle with coming to terms with the sexuality had\n\n1:24:38.820 --> 1:24:43.620\n a role to play in much of his difficulties?\n\n1:24:43.620 --> 1:24:50.940\n Well I'm not going to talk about my interactions with them and anything I derived from that.\n\n1:24:50.940 --> 1:25:04.500\n But what I will say is that a story broke on the radio at some point during the trial\n\n1:25:04.500 --> 1:25:11.460\n that Aaron had been in the same sex relationship with someone and some local sportscasters,\n\n1:25:11.460 --> 1:25:18.940\n local Boston sportscasters really mushroomed the story.\n\n1:25:18.940 --> 1:25:25.980\n So he and everyone was aware of it.\n\n1:25:25.980 --> 1:25:36.380\n You also may know from the court record that the prosecutors floated a specious theory\n\n1:25:36.380 --> 1:25:43.420\n for a minute but then backed off of it that Aaron was, that there was some sort of I guess\n\n1:25:43.420 --> 1:25:51.260\n gay rage at work with him and that might be a cause, a motive for the killing.\n\n1:25:51.260 --> 1:25:54.060\n And luckily they really backed off of that.\n\n1:25:54.060 --> 1:25:58.620\n That was quite an offensive claim in theory.\n\n1:25:58.620 --> 1:26:04.700\n So but to answer your question more directly, I mean I have no idea why he killed himself.\n\n1:26:04.700 --> 1:26:08.540\n It was a surprise and a shock.\n\n1:26:08.540 --> 1:26:13.060\n I was scheduled to go see him like a couple days after it happened.\n\n1:26:13.060 --> 1:26:22.780\n I mean he was anxious for Jose and I to come in and do the appeal from the murder which\n\n1:26:22.780 --> 1:26:23.840\n he was convicted for.\n\n1:26:23.840 --> 1:26:27.720\n He wanted us to take over that appeal.\n\n1:26:27.720 --> 1:26:29.500\n He was talking about going back to football.\n\n1:26:29.500 --> 1:26:34.420\n I mean he said, well you talk about this, earlier you talked about the sort of innocent\n\n1:26:34.420 --> 1:26:35.420\n aspect of him.\n\n1:26:35.420 --> 1:26:40.580\n He said, you know, well Ron, maybe not the Patriots but you know, I want to get back\n\n1:26:40.580 --> 1:26:47.580\n in the league and I was like, you know, Aaron, that's going to be tough, man.\n\n1:26:47.580 --> 1:26:56.420\n But he really believed it and then for a few days later that to happen, it was a real shock\n\n1:26:56.420 --> 1:26:57.420\n to me.\n\n1:26:57.420 --> 1:27:04.660\n Like when you look back at that, at his story, does it make you sad?\n\n1:27:04.660 --> 1:27:05.660\n Very.\n\n1:27:05.660 --> 1:27:06.660\n Very.\n\n1:27:06.660 --> 1:27:16.620\n I thought, so one, I believe he absolutely did not commit the crimes that we acquitted\n\n1:27:16.620 --> 1:27:17.620\n him on.\n\n1:27:17.620 --> 1:27:23.660\n I think that was the right answer for that.\n\n1:27:23.660 --> 1:27:29.980\n I don't know enough about Bradley, the first case, I'm sorry, to make an opinion on.\n\n1:27:29.980 --> 1:27:39.020\n But in our case, it was just, he had the misfortune of having a famous name and the police department\n\n1:27:39.020 --> 1:27:44.340\n just really got on him there.\n\n1:27:44.340 --> 1:27:52.300\n So yes, I miss him a lot, it was very, very sad and surprising.\n\n1:27:52.300 --> 1:27:57.220\n And I mean just on the human side, of course we don't know the full story, but just everything\n\n1:27:57.220 --> 1:28:04.180\n that led up to suicide, everything led up to an incredible professional football player,\n\n1:28:04.180 --> 1:28:06.180\n you know, that whole story.\n\n1:28:06.180 --> 1:28:10.760\n He was a remarkably talented athlete, remarkably talented athlete.\n\n1:28:10.760 --> 1:28:16.220\n And it has to do with all the possible trajectories, right, that we can take through life, as we\n\n1:28:16.220 --> 1:28:17.820\n were talking about before.\n\n1:28:17.820 --> 1:28:23.940\n And some of them lead to suicide, sadly enough.\n\n1:28:23.940 --> 1:28:34.060\n And it's always tragic when you have somebody with great potential result in the things\n\n1:28:34.060 --> 1:28:35.900\n that happen.\n\n1:28:35.900 --> 1:28:37.700\n People love it when I ask about books.\n\n1:28:37.700 --> 1:28:44.980\n I don't know whether technical, like legal or fiction, nonfiction books throughout your\n\n1:28:44.980 --> 1:28:50.380\n life have had an impact on you, if there's something you could recommend or something\n\n1:28:50.380 --> 1:28:57.860\n you could speak to about something that inspired ideas, insights about this complicated world\n\n1:28:57.860 --> 1:28:58.860\n of ours.\n\n1:28:58.860 --> 1:28:59.860\n Oh, wow.\n\n1:28:59.860 --> 1:29:05.540\n Yeah, so I'll give you a couple.\n\n1:29:05.540 --> 1:29:09.900\n So one is Contingency, Irony and Solidarity by Richard Warty.\n\n1:29:09.900 --> 1:29:18.820\n He's passed away now, but was a philosopher at some of our major institutions, Princeton,\n\n1:29:18.820 --> 1:29:23.300\n Stanford.\n\n1:29:23.300 --> 1:29:30.260\n Contingency, Irony and Solidarity, at least that's a book that really helped me work through\n\n1:29:30.260 --> 1:29:31.480\n a series of thoughts.\n\n1:29:31.480 --> 1:29:40.940\n So it stands for the proposition that our most deeply held beliefs are contingent, that\n\n1:29:40.940 --> 1:29:48.300\n there's nothing beyond history or prior to socialization that's definatory of the human\n\n1:29:48.300 --> 1:29:50.980\n being, that's Warty.\n\n1:29:50.980 --> 1:29:58.060\n And he says that our most deeply held beliefs are received wisdom and highly contingent\n\n1:29:58.060 --> 1:30:01.940\n along a number of registers.\n\n1:30:01.940 --> 1:30:10.060\n And he does that, but then goes on to say that he nonetheless can hold strongly held\n\n1:30:10.060 --> 1:30:15.140\n beliefs, recognizing their contingency, but still believes them to be true and accurate.\n\n1:30:15.140 --> 1:30:23.660\n He helps you to work through what could be an intellectual tension, other words, so you\n\n1:30:23.660 --> 1:30:30.100\n don't delve into, one doesn't delve into relativism, everything is okay, but he gives\n\n1:30:30.100 --> 1:30:38.100\n you a vocabulary to think about how to negotiate these realities.\n\n1:30:38.100 --> 1:30:40.100\n Do you share this tension?\n\n1:30:40.100 --> 1:30:41.820\n I mean, there is a real tension.\n\n1:30:41.820 --> 1:30:48.620\n It seems like even the law, the legal system is all just a construct of our human ideas,\n\n1:30:48.620 --> 1:30:57.820\n and yet it seems to be, almost feels fundamental to what a just society is.\n\n1:30:57.820 --> 1:31:06.800\n Yeah, I definitely share the tension and love his vocabulary and the way he's helped me\n\n1:31:06.800 --> 1:31:09.000\n resolve the tension.\n\n1:31:09.000 --> 1:31:15.300\n So right, I mean, yeah, so like, you know, infanticide, for example.\n\n1:31:15.300 --> 1:31:23.220\n Perhaps it's socially contingent, perhaps it's received wisdom, perhaps it's anthropological,\n\n1:31:23.220 --> 1:31:29.400\n you know, we need to propagate the species, and I still think it's wrong.\n\n1:31:29.400 --> 1:31:37.620\n And Warty has helped me develop a category to say that, no, I can't provide any, in\n\n1:31:37.620 --> 1:31:42.940\n Warty's words, noncircular theoretical backup for this proposition.\n\n1:31:42.940 --> 1:31:48.180\n At some point, it's going to run me into a circularity problem, but that's okay.\n\n1:31:48.180 --> 1:31:54.860\n I hold this nonetheless in full recognition of its contingency, but what it does is makes\n\n1:31:54.860 --> 1:32:02.540\n you humble, and when you're humble, that's good because, you know, this notion that ideas\n\n1:32:02.540 --> 1:32:10.580\n are always already in progress, never fully formed, I think is the sort of intellectual\n\n1:32:10.580 --> 1:32:12.620\n I strive to be.\n\n1:32:12.620 --> 1:32:20.980\n And if I have a sufficient degree of humility that I don't have the final answer, capital\n\n1:32:20.980 --> 1:32:26.660\n A, then that's going to help me to get to better answers, lowercase a.\n\n1:32:26.660 --> 1:32:33.520\n And Warty does that, and he talks about in the solidarity part of the book, he has this\n\n1:32:33.520 --> 1:32:42.660\n concept of imaginative, the imaginative ability to see other different people as we instead\n\n1:32:42.660 --> 1:32:43.900\n of they.\n\n1:32:43.900 --> 1:32:47.620\n And I just think it's a beautiful concept, but he talks about this imaginative ability\n\n1:32:47.620 --> 1:32:49.860\n and it's this active process.\n\n1:32:49.860 --> 1:32:58.980\n So I mean, so that's a book that's done a lot of work for me over the years.\n\n1:32:58.980 --> 1:33:06.820\n Souls of Black Folk by W. E. B. Du Bois was absolutely pivotal in my intellectual development.\n\n1:33:06.820 --> 1:33:18.180\n One of the premier set of essays in the Western literary tradition, and it's a deep and profound\n\n1:33:18.180 --> 1:33:28.420\n sociological, philosophical, and historical analysis of the predicament of blacks in America\n\n1:33:28.420 --> 1:33:36.060\n from one of our country's greatest polymaths.\n\n1:33:36.060 --> 1:33:40.780\n It's a beautiful text and I go to it yearly.\n\n1:33:40.780 --> 1:33:46.740\n So for somebody like me, so growing up in the Soviet Union, the struggle, the civil\n\n1:33:46.740 --> 1:33:53.380\n rights movement, the struggle of race, and all those kinds of things that is, you know,\n\n1:33:53.380 --> 1:33:57.340\n this universal, but it's also very much a journey of the United States.\n\n1:33:57.340 --> 1:34:00.820\n It was kind of a foreign thing that I stepped into.\n\n1:34:00.820 --> 1:34:06.780\n Is that something you would recommend somebody like me to read, or is there other things\n\n1:34:06.780 --> 1:34:11.140\n about race that are good to connect to?\n\n1:34:11.140 --> 1:34:17.140\n My flavor of suffering injustice, I'm a Jew as well, my flavor has to do with World War\n\n1:34:17.140 --> 1:34:20.820\n II and the studies of that, you know, all the injustices there.\n\n1:34:20.820 --> 1:34:27.340\n So I'm now stepping into a new set of injustices and trying to learn the landscape.\n\n1:34:27.340 --> 1:34:35.100\n I would say anyone is a better person for having read Du Bois.\n\n1:34:35.100 --> 1:34:42.860\n He's just a remarkable writer and thinker, and to the extent you're interested in learning\n\n1:34:42.860 --> 1:34:49.460\n another history, he does it in a way that is quite sophisticated.\n\n1:34:49.460 --> 1:34:54.980\n So it's interesting, I was going to give you three books.\n\n1:34:54.980 --> 1:35:00.900\n I noted the accent when I met you, but I didn't know exactly where you're from.\n\n1:35:00.900 --> 1:35:07.660\n But the other book I was going to say is Dostoevsky's Crime and Punishment, and I mean, I've always\n\n1:35:07.660 --> 1:35:14.340\n wanted to go to St. Pete's just to sort of see with my own eyes what the word pictures\n\n1:35:14.340 --> 1:35:18.740\n that Dostoevsky created in Crime and Punishment.\n\n1:35:18.740 --> 1:35:23.480\n And you know, I love others of his stuff too, The Brothers Care, Masov, and so forth.\n\n1:35:23.480 --> 1:35:30.980\n But Crime and Punishment I first read in high school as a junior or senior, and it is a\n\n1:35:30.980 --> 1:35:40.740\n deep and profound meditation on both the meaning and the measure of our lives.\n\n1:35:40.740 --> 1:35:53.940\n And Dostoevsky, obviously in conversation with other thinkers, really gets at the crux\n\n1:35:53.940 --> 1:36:01.500\n of a fundamental philosophical problem, what does it mean to be a human being?\n\n1:36:01.500 --> 1:36:07.340\n And for that, Crime and Punishment captured me as a teenager, and that's another text\n\n1:36:07.340 --> 1:36:10.860\n that I return to often.\n\n1:36:10.860 --> 1:36:17.060\n We've talked about young people a little bit at the beginning of our conversation.\n\n1:36:17.060 --> 1:36:23.340\n Is there advice that you could give to a young person today thinking about their career,\n\n1:36:23.340 --> 1:36:28.180\n thinking about their life, thinking about making their way in this world?\n\n1:36:28.180 --> 1:36:29.180\n Yeah, sure.\n\n1:36:29.180 --> 1:36:30.420\n I'll share some advice.\n\n1:36:30.420 --> 1:36:36.480\n It actually picks up on a question we talked about earlier in the academy and schools.\n\n1:36:36.480 --> 1:36:42.940\n But it's some advice that a professor gave to me when I got to Harvard.\n\n1:36:42.940 --> 1:36:48.560\n And it is this, that you have to be willing to come face to face with your intellectual\n\n1:36:48.560 --> 1:36:52.860\n limitations and keep going.\n\n1:36:52.860 --> 1:37:01.140\n And it's hard for people, I mean, you mentioned this earlier, to face really difficult tasks,\n\n1:37:01.140 --> 1:37:05.620\n and particularly in these sort of elite spaces where you've excelled all your life, and\n\n1:37:05.620 --> 1:37:09.300\n you come to MIT and you're like, wait a minute, I don't understand this.\n\n1:37:09.300 --> 1:37:10.500\n Wait, this is hard.\n\n1:37:10.500 --> 1:37:14.460\n I've never had something really hard before.\n\n1:37:14.460 --> 1:37:19.660\n And there are a couple options, and a lot of people will pull back and take the gentleman\n\n1:37:19.660 --> 1:37:28.060\n or gentlewoman's bee and just go on, or risk going out there, giving it your all, and still\n\n1:37:28.060 --> 1:37:29.940\n not quite getting it.\n\n1:37:29.940 --> 1:37:35.940\n And that's a risk, but it's a risk well worth it, because you're just going to be the better\n\n1:37:35.940 --> 1:37:38.580\n person, the better student for it.\n\n1:37:38.580 --> 1:37:45.820\n And even outside of the academy, I mean, come face to face with your fears and keep going\n\n1:37:45.820 --> 1:37:51.500\n and keep going in life, and you're going to be the better person, the better human being.\n\n1:37:51.500 --> 1:37:57.700\n Yeah, it does seem to be, I don't know what it is, but it does seem to be that fear is\n\n1:37:57.700 --> 1:38:05.380\n a good indicator of something you should probably face.\n\n1:38:05.380 --> 1:38:08.140\n Fear kind of shows the way a little bit.\n\n1:38:08.140 --> 1:38:09.140\n Not always.\n\n1:38:09.140 --> 1:38:16.260\n You might not want to go into the cage with a lion, but maybe you should.\n\n1:38:16.260 --> 1:38:17.260\n Maybe.\n\n1:38:17.260 --> 1:38:22.780\n Let me ask sort of a darker question, because we're talking about Dostoyevsky, we might\n\n1:38:22.780 --> 1:38:25.460\n as well.\n\n1:38:25.460 --> 1:38:36.380\n Do you, and connected to the freeing innocent people, do you think about mortality?\n\n1:38:36.380 --> 1:38:38.020\n Do you think about your own death?\n\n1:38:38.020 --> 1:38:40.340\n Are you afraid of death?\n\n1:38:40.340 --> 1:38:42.180\n I'm not afraid of death.\n\n1:38:42.180 --> 1:38:48.920\n I do think about it more now, because I'm now in my mid fifties, so I used to not think\n\n1:38:48.920 --> 1:38:57.460\n about it much at all, but the harsh reality is that I've got more time behind me now\n\n1:38:57.460 --> 1:39:01.220\n than I do in front of me, and it kind of happens all of a sudden, too.\n\n1:39:01.220 --> 1:39:08.860\n You realize, wait a minute, I'm actually on the back nine now, so yeah, my mind moves\n\n1:39:08.860 --> 1:39:10.140\n to it from time to time.\n\n1:39:10.140 --> 1:39:11.860\n I don't dwell on it.\n\n1:39:11.860 --> 1:39:14.160\n I'm not afraid of it.\n\n1:39:14.160 --> 1:39:21.660\n My own personal religious commitments, I'm Christian, and my religious commitments buoy\n\n1:39:21.660 --> 1:39:31.260\n me that death, and I believe this, death is not the end, so I'm not afraid of it.\n\n1:39:31.260 --> 1:39:35.780\n Now, this is not to say that I want to rush to the afterlife.\n\n1:39:35.780 --> 1:39:42.820\n I'm good right here for a long time, and I hope I've got 30, 35, 40 more years to\n\n1:39:42.820 --> 1:39:50.100\n go, but no, I don't fear death.\n\n1:39:50.100 --> 1:39:52.380\n We're finite creatures.\n\n1:39:52.380 --> 1:39:53.380\n We're all gonna die.\n\n1:39:53.380 --> 1:40:01.500\n Well, the mystery of it, you know, for somebody, at least for me, we human beings want to figure\n\n1:40:01.500 --> 1:40:04.300\n everything out.\n\n1:40:04.300 --> 1:40:08.220\n Whatever the afterlife is, there's still a mystery to it.\n\n1:40:08.220 --> 1:40:17.540\n That uncertainty can be terrifying if you ponder it, but maybe what you're saying is\n\n1:40:17.540 --> 1:40:21.340\n you haven't pondered it too deeply so far, and it's worked out pretty good.\n\n1:40:21.340 --> 1:40:24.500\n It's worked out, yeah, no complaints.\n\n1:40:24.500 --> 1:40:32.220\n So you said, again, the Sejewski kind of was exceptionally good at getting to the core\n\n1:40:32.220 --> 1:40:34.180\n of what it means to be human.\n\n1:40:34.180 --> 1:40:41.660\n Do you think about, like, the why of why we're here, the meaning of this whole existence?\n\n1:40:41.660 --> 1:40:50.140\n Yeah, no, I do, I think, and I actually think that's the purpose of an education.\n\n1:40:50.140 --> 1:40:51.860\n What does it mean to be a human being?\n\n1:40:51.860 --> 1:40:58.220\n And in one way or another, we set out to answer those questions, and we do it in a different\n\n1:40:58.220 --> 1:40:59.220\n way.\n\n1:40:59.220 --> 1:41:07.340\n I mean, some may look to philosophy to answer these questions.\n\n1:41:07.340 --> 1:41:17.020\n Why is it in one's personal interest to do good, to do justice?\n\n1:41:17.020 --> 1:41:22.900\n Some may look at it through the economist lens.\n\n1:41:22.900 --> 1:41:32.980\n Some may look at it through the microscope in the laboratory that the phenomenal world\n\n1:41:32.980 --> 1:41:36.580\n is the meaning of life.\n\n1:41:36.580 --> 1:41:44.500\n Others may say that that's one vocabulary, that's one description, but the poet describes\n\n1:41:44.500 --> 1:41:51.320\n a reality to the same degree as a physicist, but that's the purpose of an education.\n\n1:41:51.320 --> 1:41:53.860\n It's to sort of work through these issues.\n\n1:41:53.860 --> 1:41:59.340\n What does it mean to be a human being?\n\n1:41:59.340 --> 1:42:04.260\n And I think it's a fascinating journey, and I think it's a lifelong endeavor to figure\n\n1:42:04.260 --> 1:42:09.220\n out what is the thing, that nugget, that makes us human.\n\n1:42:09.220 --> 1:42:11.780\n Do you still see yourself as a student?\n\n1:42:11.780 --> 1:42:12.780\n Of course.\n\n1:42:12.780 --> 1:42:13.780\n Yes.\n\n1:42:13.780 --> 1:42:19.460\n I mean, that's the best part about going into university teaching.\n\n1:42:19.460 --> 1:42:20.880\n You're a lifelong student.\n\n1:42:20.880 --> 1:42:21.880\n I'm always learning.\n\n1:42:21.880 --> 1:42:27.380\n I learn from my students and with my students and my colleagues.\n\n1:42:27.380 --> 1:42:33.860\n You continue to read and learn and modify opinions, and I think it's just a wonderful\n\n1:42:33.860 --> 1:42:34.860\n thing.\n\n1:42:34.860 --> 1:42:45.260\n Well, Ron, I'm so glad that somebody like you is carrying the fire of what is the best\n\n1:42:45.260 --> 1:42:46.260\n of Harvard.\n\n1:42:46.260 --> 1:42:50.900\n It's a huge honor that you would spend so much time, waste so much of your valuable\n\n1:42:50.900 --> 1:42:51.900\n time with me.\n\n1:42:51.900 --> 1:42:52.900\n I really appreciate that conversation.\n\n1:42:52.900 --> 1:42:53.900\n Not a waste at all.\n\n1:42:53.900 --> 1:42:55.260\n I think a lot of people love it.\n\n1:42:55.260 --> 1:42:56.580\n Thank you so much for talking today.\n\n1:42:56.580 --> 1:42:58.380\n Thank you.\n\n1:42:58.380 --> 1:43:02.780\n Thanks for listening to this conversation with Ronald Sullivan, and thank you to Brooklyn\n\n1:43:02.780 --> 1:43:09.100\n and Sheetz, Wine Access Online Wine Store, Monk Pack Low Carb Snacks, and Blinkist app\n\n1:43:09.100 --> 1:43:10.900\n that summarizes books.\n\n1:43:10.900 --> 1:43:13.540\n Click their links to support this podcast.\n\n1:43:13.540 --> 1:43:18.480\n And now let me leave you with some words from Nelson Mandela, when a man is denied the right\n\n1:43:18.480 --> 1:43:25.620\n to live the life he believes in, he has no choice but to become an outlaw.\n\n1:43:25.620 --> 1:43:44.500\n Thank you for listening, and hope to see you next time.\n\n"
}