{
  "title": "Georges St-Pierre, John Danaher & Gordon Ryan: The Greatest of All Time | Lex Fridman Podcast #260",
  "id": "KdmDtqB46Jc",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:06.900\n Humans are fascinated by violence and you've got to ask yourself. Why is it the rash guard? Yes\n\n00:07.320 --> 00:12.700\n And I talk so much shit that I'm like man if I lose this is gonna be rough. You're learning this shut the fuck up\n\n00:12.700 --> 00:16.260\n I got you man. You were powered by McDonald's and Coca Cola\n\n00:16.260 --> 00:20.740\n I want more and then I expect them and he didn't want to fight anymore. I'm not impressed by\n\n00:22.060 --> 00:24.060\n if George st. Pierre and\n\n00:24.060 --> 00:29.560\n And Khabib Nurmagomedov face each other in their prime who wins? I'm\n\n00:31.520 --> 00:39.860\n Here with three individuals each of whom are considered by many to be the greatest of all time in each of their respective disciplines\n\n00:40.240 --> 00:46.760\n The greatest MMA fighter of all time George st. Pierre the greatest martial arts coach of all time\n\n00:47.200 --> 00:49.200\n John Donahue and\n\n00:49.620 --> 00:51.960\n the greatest submission grappler of all time\n\n00:51.960 --> 00:53.960\n Gordon Ryan\n\n00:54.700 --> 00:59.060\n So, let me ask the first question. You guys didn't see the question. No preparation here\n\n00:59.340 --> 01:03.820\n What is the key to your success each of you one thing or multiple things that come to mind?\n\n01:05.780 --> 01:07.780\n John go first\n\n01:12.340 --> 01:14.340\n Is it the rash guard\n\n01:15.060 --> 01:17.060\n Yes, I\n\n01:17.060 --> 01:21.420\n I like that you choose John right off the bat. I seem the most nervous\n\n01:26.020 --> 01:28.020\n For me it's about\n\n01:29.700 --> 01:31.700\n Finding a way to work in\n\n01:32.100 --> 01:36.380\n A world where most of the answers are already known\n\n01:37.020 --> 01:44.340\n Okay, and in any developed sport by the time you enter that sport most of the basic precepts the\n\n01:44.340 --> 01:50.980\n the the major techniques that the major mechanical understandings of the sport are long since worked out and\n\n01:51.580 --> 01:52.820\n so\n\n01:52.820 --> 01:54.820\n in a highly developed world\n\n01:56.740 --> 02:00.080\n The key to success is to be able to identify\n\n02:01.580 --> 02:06.660\n Some area of the industry that you're in which is currently undervalued\n\n02:07.680 --> 02:09.680\n To do what the other people are not doing\n\n02:10.460 --> 02:12.460\n deeper than that you're\n\n02:12.460 --> 02:18.680\n Everyone has a view of okay. These are the the main skills of the industry. I work in\n\n02:19.680 --> 02:21.680\n at any given time\n\n02:21.920 --> 02:24.600\n some set of skills attributes\n\n02:26.480 --> 02:30.880\n Will always be somewhat undervalued they're underappreciated by the people in the game\n\n02:32.440 --> 02:38.440\n You see that at any in any given industry there are always trends which change\n\n02:38.440 --> 02:42.080\n The nature of the industry over time so\n\n02:43.280 --> 02:47.520\n fashion trends in the clothing industry, you'll see at any given time is a\n\n02:49.040 --> 02:54.700\n General wave of fashion which pushes most of the people in the industry in a given direction at a given time\n\n02:55.840 --> 03:04.040\n What makes people stand out is the ability to look at the various possibilities out there and say here is something which is genuinely\n\n03:04.040 --> 03:11.360\n useful, but which is currently being underused underutilized and I want to bring that back in and\n\n03:12.000 --> 03:14.000\n develop it and\n\n03:14.560 --> 03:17.400\n Because it's an inherently useful product\n\n03:17.960 --> 03:23.540\n It will be very very successful in its initial applications against people who aren't currently using it\n\n03:27.000 --> 03:31.960\n If you can do this in whatever industry you're in I believe you'll be highly successful\n\n03:31.960 --> 03:36.120\n successful to the supplies both for actual specific like techniques and\n\n03:37.120 --> 03:39.600\n the also tactics as well in the case of\n\n03:40.480 --> 03:45.800\n Jiu Jitsu, so for example in my sport leg locks have always been around\n\n03:46.000 --> 03:50.420\n Okay, there's there's no shortage of people you can look back in history who applying leg locks\n\n03:51.120 --> 03:54.240\n Nonetheless as in across the industry\n\n03:54.680 --> 04:00.540\n Leg locks were undervalued and underappreciated. There was a general sense in which most of the leading figures of the sport\n\n04:00.540 --> 04:06.300\n For most of the history of the sport of Jiu Jitsu tended to deemphasize leg locks and\n\n04:08.180 --> 04:15.580\n When I looked at them I said there was immense potential but it wasn't being realized and needed to be changed\n\n04:16.860 --> 04:23.460\n Since then that has more or less occurred now most people coming into the sport understand that leg locks are an important\n\n04:23.980 --> 04:28.860\n Aspect and they're no longer undervalued if anything it's gone too far the other way and now perhaps they're a little overvalued\n\n04:28.860 --> 04:30.340\n and\n\n04:30.340 --> 04:31.500\n the\n\n04:31.500 --> 04:33.220\n this kind of\n\n04:33.220 --> 04:36.180\n fashion trend exists in every industry and\n\n04:37.260 --> 04:41.580\n The job of anyone who wants to excel in a given industry is to be able to identify\n\n04:41.780 --> 04:46.260\n okay, what are the things that are currently out of fashion and undervalued and then\n\n04:47.100 --> 04:51.560\n Look at what is their actual objective value and then work\n\n04:52.260 --> 04:56.740\n To to to bring them back to the forefront. So John brought up fashion\n\n04:56.740 --> 05:00.100\n George is wearing a really sexy shirt. So\n\n05:01.140 --> 05:03.140\n Assuming that's not the reason is there\n\n05:03.580 --> 05:08.140\n Is there something that comes to mind as the key to the success of your incredible career?\n\n05:08.140 --> 05:14.860\n Well, of course everybody knows the famous and sort of every athletes are saying oh, it's could be genetic\n\n05:14.860 --> 05:18.860\n I was maybe gifted that certain predisposition. I worked really hard\n\n05:19.700 --> 05:21.660\n but I think\n\n05:21.660 --> 05:23.340\n something that\n\n05:23.340 --> 05:28.380\n People don't talk enough is when everybody sometime go, right? I\n\n05:29.580 --> 05:35.980\n Was never afraid to try to go left and I felt many time trying to do things that were not\n\n05:39.540 --> 05:44.940\n Known to be things that would bring me brought me success, but I tried it, you know\n\n05:44.940 --> 05:50.780\n I was very often I was the first of trying new things and I felt many time but certain times\n\n05:50.780 --> 05:54.460\n it gives me a certain advantage and\n\n05:55.620 --> 05:57.300\n for example, I\n\n05:57.300 --> 06:03.860\n was sometime fighting guys that add much better wrestling background and than me on paper and\n\n06:04.340 --> 06:09.600\n nobody before that fought those guys never nobody had there to try to\n\n06:10.580 --> 06:16.020\n Take them down because their wrestling pedigree were so good and I didn't have on paper\n\n06:16.020 --> 06:21.520\n the wrestling pedigree to take these guys down in a fight, but when everybody\n\n06:23.460 --> 06:28.580\n Tried to go right I was going left I fought them in a different way and that was\n\n06:29.300 --> 06:33.660\n The blueprint to beat certain some of these guys, you know what I mean? You know what I mean?\n\n06:33.660 --> 06:37.700\n So yeah, so we'll actually talk about a few fights where that you did just that this is fascinating\n\n06:38.220 --> 06:42.700\n But let's say at the high level so Gordon again sticking on fashion\n\n06:42.700 --> 06:47.020\n I may compliment your incredible badass hat trying to fit in here\n\n06:48.940 --> 06:51.340\n We should say we're in Texas now, so he's\n\n06:52.300 --> 06:58.560\n Become a Texan overnight. So what is there something you can speak to that you would attribute to as the key to your success?\n\n06:58.580 --> 07:02.580\n yeah, so first of all, it has to be a role where you don't ask us all those same questions because\n\n07:03.500 --> 07:05.580\n How am I supposed to compete with the answer? John just gave\n\n07:06.420 --> 07:12.260\n There's nothing I can do that's gonna top that. Yeah, but uh, I think it's uh, there's many things\n\n07:12.260 --> 07:14.260\n But I think the number one thing is just is John\n\n07:14.740 --> 07:19.540\n When I came in, I was a blue belt and I was beating brown and black belts in competition already\n\n07:20.540 --> 07:23.860\n But he really changed my way of thinking about the sport\n\n07:23.860 --> 07:25.860\n I would just come in and if something wasn't working\n\n07:25.860 --> 07:33.260\n I would just do it harder and faster and more aggressively and that just degenerated me into a degenerated into me\n\n07:33.820 --> 07:39.140\n spastically knee sliding into cross hashi garami against Eddie Cummings for six months and then just getting heel hooked repeatedly and\n\n07:39.140 --> 07:43.460\n I'm like, this is not working and Eddie like when I met him was like a chubby\n\n07:43.940 --> 07:48.880\n Librarian looking guy and I'm like, there's no I'm like six to like a jacked like 170 and I'm like\n\n07:48.880 --> 07:52.760\n There's no way I'm losing to a guy who looks like this, but he just kept heel hooking me\n\n07:52.760 --> 07:55.860\n So I would just go harder and harder and it wouldn't work and then John's like well\n\n07:56.180 --> 07:59.940\n If you learned leg locks, you might you might have some more success\n\n07:59.940 --> 08:02.300\n And then I was like, yeah, that probably makes sense\n\n08:02.300 --> 08:07.740\n And from then on I kind of just changed the way I thought about the sport instead of doing doing things harder\n\n08:07.740 --> 08:12.500\n I would actually try to get better at jujitsu. Do you remember like a turning point where?\n\n08:13.780 --> 08:19.340\n You became as opposed to being mediocre not just in technique but an approach to\n\n08:20.700 --> 08:26.780\n To great. Um, I think it was somewhere around brown belt level when I was training consistently\n\n08:26.780 --> 08:32.820\n So I trained full time with John when I was purple belt mid level purple belt and towards the end of my brown belt\n\n08:32.820 --> 08:38.220\n Days, I was beating up like legitimate like ADCC champions in the gym. Um,\n\n08:38.780 --> 08:40.200\n so I think like\n\n08:40.200 --> 08:42.600\n Brown to black belt was a big thing for me\n\n08:42.600 --> 08:47.820\n And then when I won my first EBI and I was I submitted Yuri who won ADCC and I beat roost them\n\n08:47.820 --> 08:50.380\n Um, so I think that was like my turning point as a competitor\n\n08:50.740 --> 08:54.820\n But I think I started to to reach world level a little bit before that\n\n08:54.820 --> 08:57.180\n I think somewhere around brown belt mid level to late level brown belt\n\n08:57.180 --> 09:03.620\n It was some of that mental like it was there a moment when you like after a training session you realize\n\n09:03.620 --> 09:05.620\n I can actually do this\n\n09:05.620 --> 09:08.920\n Like I could be at the top of the world world class\n\n09:09.120 --> 09:12.340\n The critical moment for me was when I think it was right\n\n09:12.840 --> 09:15.960\n Right when I got my black belt, maybe a few months before I got my black belt\n\n09:16.440 --> 09:19.960\n we had a former ADCC champion come into the gym and\n\n09:20.700 --> 09:24.560\n we did a hard round together and I think I submitted them like four or five times and\n\n09:24.560 --> 09:29.080\n No one knew who I was. I never won anything up into that point and I was like, okay\n\n09:29.080 --> 09:33.440\n Like if this is like one of the best guys in the world and I could submit him multiple times around\n\n09:33.440 --> 09:39.220\n I think that this is like something that I actually could do professionally and make a make a career out of this\n\n09:40.080 --> 09:48.040\n Okay. So the actual performance was the like you don't need to believe before you could perform like a lot of Olympic gold medalists\n\n09:48.960 --> 09:50.040\n they\n\n09:50.040 --> 09:56.520\n They have to believe before they can perform because like they're getting their ass kicked for a long long long time\n\n09:56.720 --> 09:57.200\n Yeah\n\n09:57.200 --> 09:59.600\n I think but the best way for me to believe in something is to have\n\n09:59.840 --> 10:02.280\n Repeated success doing it against high level guys\n\n10:02.280 --> 10:05.620\n Like I'm not gonna just believe I can do a double leg if I can't a double leg on anybody\n\n10:06.040 --> 10:10.280\n So for me the the belief came from the repeated success in the gym\n\n10:10.600 --> 10:16.260\n Yeah, but to get to the point where you're submitting somebody like your ASMO is like one of the the greatest grapplers ever\n\n10:17.280 --> 10:19.080\n It's like a long journey\n\n10:19.080 --> 10:21.320\n Yeah, but I had the confidence\n\n10:21.320 --> 10:26.000\n I had the belief in myself because of the success that I had in the gym prior to that got it\n\n10:26.640 --> 10:31.880\n Even and it's one step at a time first. It's the brown belts then it's the black belts and it's world class. Okay\n\n10:32.520 --> 10:37.200\n George was there a turning point for you when you you thought like I can actually do this\n\n10:37.960 --> 10:42.200\n Yes, I I always dreamed to become champion\n\n10:42.720 --> 10:46.800\n but I think the turning point that there was that there was two turning point and\n\n10:46.800 --> 10:48.800\n And there were my two losses\n\n10:50.320 --> 10:54.600\n First my losses to Matt Hughes I went into that fight\n\n10:56.240 --> 11:03.560\n Just to not lose I was not fighting to win and it's after the fight when I watched the\n\n11:04.600 --> 11:08.000\n Replay of the fight. I realized I was like I was doing pretty well\n\n11:08.000 --> 11:12.880\n But during the fight in my own mind, I was not seeing it that way\n\n11:12.880 --> 11:20.040\n I I thought I was getting dominated by Hughes like a hundred percent, but when I watched the replay I\n\n11:20.800 --> 11:27.080\n Was like man, I can I can beat this guy. I was beating him until I made that stupid mistake\n\n11:27.080 --> 11:30.040\n so I was very frustrating but but I\n\n11:31.160 --> 11:36.720\n That's what gave me the mentally the the championship level\n\n11:36.720 --> 11:43.760\n mentality and then I became a little bit overconfident because I start beating everybody after that and\n\n11:44.360 --> 11:45.480\n I\n\n11:45.480 --> 11:50.320\n Start to believe the hype of people when they look at me. They were like, oh, he's the new\n\n11:51.160 --> 11:57.120\n Upcoming superstar and he's gonna be unstoppable and and then when I became champion, I I\n\n11:58.000 --> 12:01.560\n lost to to to Matt to Matt Sarah, so\n\n12:02.400 --> 12:04.200\n before I believe\n\n12:04.200 --> 12:08.080\n my first failure was because I had a lack of confidence and\n\n12:09.120 --> 12:10.600\n and\n\n12:10.600 --> 12:17.160\n My second failure was I was because I was overconfidence. So I think it's there's a perfect\n\n12:18.160 --> 12:23.840\n Center of confidence. I mean, I mean it's good to be confident because John taught me like confidence\n\n12:23.840 --> 12:28.400\n It's it's like money in your bank account if you you can have all the skills in the world, right?\n\n12:28.400 --> 12:30.000\n and and if you're\n\n12:30.000 --> 12:35.160\n If you don't have the confidence, it's like you it's like you can you can be a millionaire?\n\n12:35.160 --> 12:40.840\n But you don't have access to your bank account. So it's that's a little bit the analogy that John told me\n\n12:40.840 --> 12:44.960\n So that's how I feel a confidence plays for Natalie but to be overconfident\n\n12:44.960 --> 12:50.360\n I think it's always good to to be aware to be afraid of what can happen\n\n12:50.760 --> 12:56.000\n So to have a perfect balance of confidence and fear to me\n\n12:56.000 --> 13:02.880\n That's what mentally gave me the edge to become I believe successful in my sport playing off that\n\n13:03.440 --> 13:07.040\n John gave me a speech one time and he was like you have to be able to\n\n13:08.160 --> 13:14.040\n like flip a switch and turn it off where like a guy like Mayweather or someone who goes out who's super confident and\n\n13:14.720 --> 13:17.620\n He plays the character of someone who's like no one can beat me\n\n13:17.620 --> 13:20.000\n I'm the best that there ever was and that's it\n\n13:20.400 --> 13:22.280\n But if you look at me actually trained very hard\n\n13:22.280 --> 13:27.240\n You can't you can't play the persona of no one can beat me and have it translate into your life and just think that you're\n\n13:27.240 --> 13:29.600\n So good that you don't have to do anything and no one can ever beat you\n\n13:29.600 --> 13:32.720\n You have to be able to play that public persona of no one can beat me\n\n13:32.720 --> 13:35.920\n But then you have to actually do the training to make that happen\n\n13:35.920 --> 13:40.040\n You can't just you can't believe your own hype and say say that you know, I can just do whatever I want\n\n13:40.040 --> 13:45.640\n No one's ever gonna beat me if the able to switch between the persona and the actual athlete and that made a big difference for me\n\n13:45.960 --> 13:47.720\n it's tough because\n\n13:47.720 --> 13:52.680\n like you're you you dominate such a large fraction of the world and\n\n13:53.440 --> 13:54.920\n grappling and\n\n13:54.920 --> 13:58.400\n The George to just the perfect dominance after those two\n\n13:59.480 --> 14:01.600\n it's hard for the confidence not to just\n\n14:03.280 --> 14:07.760\n Like how do you avoid the confidence not becoming a thing that weighs you down where you completely\n\n14:09.120 --> 14:11.120\n deludes your mind\n\n14:11.640 --> 14:15.120\n For me, it's just number one the guys in the gym are so tough\n\n14:15.120 --> 14:20.440\n So the guys in the guys in the gym that I train with are always like nipping at my butt and always giving me new\n\n14:20.440 --> 14:25.420\n New problems to solve and for me, it's really just about trying to learn new stuff over time\n\n14:25.720 --> 14:28.280\n So that keeps it interesting for me and it's not really about\n\n14:29.880 --> 14:33.120\n You know, no one could beat me I don't have to train or have to do it I could do whatever I want\n\n14:33.280 --> 14:38.600\n It's more what keeps me in the gym is more about the fact that I'm learning new stuff all the time of working on something\n\n14:38.600 --> 14:40.600\n new and progressing to new levels at all times\n\n14:40.840 --> 14:43.840\n it's not I don't just come in and do the same thing over and over again and\n\n14:43.840 --> 14:49.360\n That gets boring you just come in and you don't learn anything new and you just do the same stuff for years at a time\n\n14:49.360 --> 14:50.360\n And okay, okay\n\n14:50.360 --> 14:50.920\n This is boring\n\n14:50.920 --> 14:56.000\n But when you have new stuff to work on and new goals short term and long term goals to reach then it makes it interesting\n\n14:56.600 --> 14:57.760\n it's a\n\n14:57.760 --> 15:04.720\n For me, it's a little bit like Gordon says is the fear because sometime in the gym even before I when it was competing\n\n15:04.720 --> 15:06.720\n I was I was getting my butt kicked\n\n15:06.840 --> 15:08.920\n But I don't care what happened in the gym\n\n15:08.920 --> 15:13.520\n I mean it hit my ego, of course because I'm a proud person I'm a competitor even in the gym\n\n15:13.520 --> 15:20.440\n but it's not a malicious competition competition in between each other when you fight you have to be malicious you go there to hurt the\n\n15:20.440 --> 15:21.160\n guy\n\n15:21.160 --> 15:25.540\n but it it hit it hit me in terms of my pride when I get\n\n15:26.240 --> 15:28.520\n beat in a gym, of course, but\n\n15:29.200 --> 15:31.200\n that fear\n\n15:31.360 --> 15:34.560\n That I don't want it to happen in public\n\n15:34.880 --> 15:41.640\n especially not during a fight that what keeps help me keeps the balance between confidence and and and and fear\n\n15:41.640 --> 15:44.000\n You know what? I mean? It's kind of weird. It's a mix\n\n15:44.440 --> 15:49.100\n It's a mixture of both that I believe I to me\n\n15:49.760 --> 15:51.280\n Help me\n\n15:51.280 --> 15:57.240\n Succeed to have the right mindset to fight and I talk so much shit that I'm like man if I lose this\n\n15:57.400 --> 16:01.440\n This is gonna be rough. So yeah, you put a lot of I mean\n\n16:01.440 --> 16:05.880\n that's that's the hard thing to do when you talk shit when you when you play the heel is\n\n16:05.880 --> 16:11.320\n Is so massive perform. He's the pressure is I mean you have to be good under pressure\n\n16:11.480 --> 16:18.080\n It's the Conor McGregor thing, you know, the reason I actually started talking shit was actually like indirectly because of George\n\n16:19.040 --> 16:20.080\n because\n\n16:20.080 --> 16:22.640\n Because I will become the opposite of George\n\n16:22.640 --> 16:28.680\n I won I won my first DBI and I I didn't talk shit and everyone was like being like, oh, you know\n\n16:28.680 --> 16:31.960\n you only beat Yuri because because he was tired or\n\n16:31.960 --> 16:37.200\n you know this or that and if they have a rematch under any of the rules that he would have lost and\n\n16:37.520 --> 16:39.320\n I'm like trying to figure out what I'm gonna do\n\n16:39.320 --> 16:45.600\n So I'm strolling through George's feed one day and he posted a clip of him beating someone and I look at the comments\n\n16:45.600 --> 16:48.840\n And I'm with this in mind. I'm like George is the nicest person of all time\n\n16:48.840 --> 16:52.440\n and if you look at the comments, it's like 10,000 comments and like\n\n16:52.960 --> 16:58.240\n 9,000 and 900 are just people calling him like all you do is lay and pray you pussy\n\n16:58.240 --> 17:03.400\n You suck you can't finish anybody and I'm just like I'm looking at this and I'm like people are gonna say\n\n17:03.760 --> 17:09.280\n What they're gonna say regardless, they're gonna talk shit regardless. So you may as well just say whatever you want and then just be yourself\n\n17:10.480 --> 17:16.380\n Is there some aspect that's I mentioned Conor McGregor. He he crossed the line with Khabib\n\n17:17.000 --> 17:18.520\n At least in the eyes of Khabib\n\n17:18.520 --> 17:24.280\n Is there something you ever regret about crossing a line or does that you ever feel like there's a line?\n\n17:24.320 --> 17:26.320\n Or do you just keep pushing the line?\n\n17:26.320 --> 17:30.160\n Uh, I basically play it per per person\n\n17:30.160 --> 17:36.920\n I just I basically fire back with like one step above what what they do. It's always plus one. Yeah. Yeah, okay\n\n17:38.560 --> 17:41.740\n So I go I usually go hard like they fire a bullet then I drop a Duke\n\n17:42.200 --> 17:47.440\n And then and then after that initial shot then we go back and forth and I'll just keep one upping them\n\n17:47.800 --> 17:53.760\n So, you know, there's a lot of people that love you, but there's also a lot of people that love to hate you. Yeah\n\n17:53.760 --> 17:59.560\n it's so like what do those people like energize you or do you just\n\n18:00.520 --> 18:05.320\n Or is it funny to you? Like what as an athlete as a performer? You should not think about them\n\n18:05.320 --> 18:06.520\n It's like a fun thing\n\n18:06.520 --> 18:08.720\n It's like it's just like a fun thing that keeps me occupied\n\n18:09.320 --> 18:14.560\n Like because like because most of them that like talk shit they like just say stuff that's factually incorrect\n\n18:14.600 --> 18:18.540\n So then I just argue with like actual statistics. Yeah, it's just like\n\n18:19.160 --> 18:23.040\n You suck or you're not gonna beat this person. I'm like, I've already submitted that guy\n\n18:23.040 --> 18:28.340\n Yeah, so I just it riles them up and it's just it's just a fun thing for me to do my my downtime\n\n18:28.380 --> 18:32.840\n Yeah, your responses are usually very factual. It's very scientific. I appreciate\n\n18:33.440 --> 18:40.640\n Thank you. You actually you start by talking trash, but then you respond with science. Yeah, it's great. Okay. It's good mix. That's a good mix\n\n18:41.000 --> 18:42.500\n I\n\n18:42.500 --> 18:49.220\n Mean a topic of haters are more specifically sort of doubts within yourself of doubts around you as you're coming up\n\n18:49.220 --> 18:55.320\n Maybe George you can comment. Oh, we're just ignoring John completely in this conversation. I\n\n18:58.080 --> 19:01.360\n Was gonna ask you another question, but let me just ask you on this on this topic\n\n19:02.080 --> 19:04.080\n Are there times in your life yet?\n\n19:04.280 --> 19:08.400\n You were surrounded by people that that doubted you all the time\n\n19:08.400 --> 19:13.360\n And so what is there something you could say as in by way of advice how you overcome?\n\n19:13.360 --> 19:20.520\n The doubt either yourself or others around you all the time the first time I\n\n19:21.240 --> 19:23.240\n Manifest my desire to become a professional\n\n19:24.000 --> 19:26.880\n Mixed martial art athlete everybody doubt me\n\n19:27.360 --> 19:31.440\n Just not even I'm not talking about the UFC just to become a professional fighter\n\n19:31.440 --> 19:37.060\n Everybody doubt me and I became a I became a professional fighter. I had few amateur fight\n\n19:37.060 --> 19:40.280\n I won them all then I I fought my first fight in\n\n19:40.280 --> 19:43.520\n In Montreal, I won and I became a professional\n\n19:44.200 --> 19:51.400\n Then I I told people that I wanted to fight in UFC. Everybody doubt me again. So it's a normal thing\n\n19:52.520 --> 19:59.320\n So I work my way up beat a few guys then I at the time Pete Spratt was\n\n20:00.000 --> 20:03.320\n just knocked knocked out Robbie Lawler with leg kick and\n\n20:04.680 --> 20:07.520\n The person who was my agent at the time did a great move\n\n20:07.520 --> 20:12.720\n For me, so he brought Pete Spratt in Montreal to fight me Pete Spratt came to Montreal\n\n20:12.720 --> 20:15.680\n I and I believe he didn't know who I was\n\n20:15.680 --> 20:20.600\n So he thought that he was coming to collect an easy paycheck and I and I end up beating him\n\n20:20.600 --> 20:23.800\n So that gave me the opportunity to fight in UFC\n\n20:24.480 --> 20:27.920\n Then after I was in UFC, I wanted to become champion of the world, you know\n\n20:27.920 --> 20:31.560\n but Matthews was there and he seems invincible at the time so\n\n20:31.560 --> 20:38.600\n Everybody doubt me again, and I became world champion and after when you when I was world champion, I wanted to be I\n\n20:39.520 --> 20:43.800\n was competing against other world champion of other weight class\n\n20:44.440 --> 20:50.840\n For the title, you know for the legacy and everything. So it's not no longer competing against my opponent\n\n20:50.840 --> 20:57.200\n I was you know as a competitor you always you never wanted to be you never want to be satisfied because when\n\n20:57.200 --> 21:02.680\n Satisfaction is the death, you know when you're satisfied you better retire because it's over\n\n21:02.760 --> 21:10.560\n So always I have to find motivation what you can have more. I want more don't be satisfied in life. So I wanted to be\n\n21:11.360 --> 21:14.680\n Like the best, you know, I want as I was competing, you know\n\n21:14.680 --> 21:19.840\n Like to become the best and and you know, of course that people doubt doubt you all the time\n\n21:19.880 --> 21:25.600\n Every time you say something that it's outside of the norm of the normality\n\n21:25.600 --> 21:33.080\n I want to say there there's nothing normal, but I'm talking about when you you manifest your desire to do something that\n\n21:33.920 --> 21:35.080\n takes\n\n21:35.080 --> 21:40.540\n Special attribute to to to succeed or that is something that is hard to to do\n\n21:40.540 --> 21:44.920\n It's for sure you're gonna always have people that doubt you it's so strange that people don't\n\n21:45.280 --> 21:48.340\n They don't lean into supporting like people that love you, too\n\n21:48.480 --> 21:54.440\n yeah, even people that love me used to doubt me and I believe I I you need to use that as\n\n21:54.440 --> 21:56.280\n a\n\n21:56.280 --> 22:00.240\n Positive positive thing as a motivation to prove them wrong\n\n22:00.360 --> 22:05.560\n Yeah, so for me that that was a thing when someone doubt me nothing gave me more\n\n22:06.320 --> 22:09.560\n There's more energy because I want to prove him wrong\n\n22:09.560 --> 22:14.500\n I want to look at him in the face and say hey, you see I got you man. I I did it\n\n22:14.960 --> 22:15.920\n so\n\n22:15.920 --> 22:21.280\n John do you ever use this in one way or the other by saying I don't think you can do this to motivate them to\n\n22:21.280 --> 22:24.560\n prove you wrong or more general question of\n\n22:25.600 --> 22:31.760\n You know the mental toughness required to achieve or confidence required to achieve greatness\n\n22:32.000 --> 22:37.440\n Like what's your role as a coach when you have these two athletes with regards to your your first question?\n\n22:37.440 --> 22:44.060\n Would I ever say to someone you can't do this as a kind of reverse psychology? I know\n\n22:44.060 --> 22:50.520\n My job is to prepare people first and foremost with their skills and\n\n22:50.960 --> 22:53.880\n as Gordon pointed out earlier if you're\n\n22:54.680 --> 23:01.240\n In any way a rational human being and you're noticing that you're getting tremendous success\n\n23:01.640 --> 23:05.120\n with a given move in the gym against high level opponents who\n\n23:05.840 --> 23:09.960\n Give a good read on what your actual opponent in a competition is like\n\n23:09.960 --> 23:13.440\n You would have to be a moron to not\n\n23:13.960 --> 23:21.600\n Recognize that kind of success and say this is something I should be building into my game and you will carry the confidence that\n\n23:21.600 --> 23:23.600\n You earned in the gym into the arena\n\n23:24.680 --> 23:28.720\n So I never try to use reverse psychology. I build up\n\n23:30.360 --> 23:33.560\n Everything I do in terms of confidence is to give people physical skills\n\n23:33.560 --> 23:41.480\n I know people say all this physicality on the one hand is mentality on the other and confidence is squarely in the the mental\n\n23:41.480 --> 23:48.000\n Aspect of the game, but all the underpinnings and beginnings of confidence are physical\n\n23:49.240 --> 23:55.280\n okay, a rational human being will see where they're having success and where they're having failure and\n\n23:55.880 --> 23:57.760\n confidence will\n\n23:57.760 --> 24:03.960\n Surround those areas where they're having success and will degenerate in cases where they're having failure\n\n24:04.240 --> 24:10.600\n so my job as a coach is to set them up for success in the gym with a given set of skills and\n\n24:10.920 --> 24:12.920\n I don't have to do anything\n\n24:14.120 --> 24:16.120\n psychologically after that I just\n\n24:16.920 --> 24:19.240\n If I can set you up to be highly successful\n\n24:19.840 --> 24:25.000\n With a given move or a set of tactics ten times in a row against quality opposition in the gym\n\n24:25.000 --> 24:29.080\n I don't have to do a damn thing when it comes to instilling confidence. I\n\n24:29.680 --> 24:33.280\n Will tell people hey, you're doing a really good job with that move. It's working well for you\n\n24:34.080 --> 24:35.560\n but\n\n24:35.560 --> 24:39.400\n When they nod in agreement, I'm not trying to force anything on them\n\n24:39.440 --> 24:43.440\n They're recognized they or they already recognized that long before the words came out of my mouth\n\n24:44.120 --> 24:52.280\n but on the other hand intelligent rational people will recognize when they're failing with given moves and no amount of talk on my part can\n\n24:52.280 --> 24:54.280\n ever change that if\n\n24:54.280 --> 24:56.280\n I teach Gordon\n\n24:57.040 --> 24:59.040\n a given arm lock and\n\n24:59.640 --> 25:04.200\n 15 times in a row. It tries it over a month and all 15 of failures\n\n25:04.360 --> 25:08.080\n There's nothing I can say verbally to come up to go and say hey, you're really good at that move\n\n25:08.080 --> 25:09.520\n He's gonna look at me say bullshit\n\n25:09.520 --> 25:15.400\n I'm terrible at it and that will create a crisis of confidence where Gordon no longer believes the words coming out of my mouth\n\n25:15.960 --> 25:22.120\n So I will never compromise that but isn't there a lot you just said 15 there you have to believe\n\n25:22.120 --> 25:24.120\n that\n\n25:24.840 --> 25:30.040\n Doing this arm lock 15 times over a period of a month is worth it because eventually you might get it\n\n25:30.040 --> 25:33.560\n I think yeah, that's a separate issue that that's a separate issue\n\n25:37.040 --> 25:44.560\n There are times where I've more or less pushed athletes to go in a certain direction for example\n\n25:45.200 --> 25:47.520\n When I first met Gary tone and he never had a guillotine\n\n25:47.520 --> 25:51.940\n Strangle and I I would say don't carry, you know, you're a scrambler\n\n25:51.940 --> 25:57.780\n like one of the greatest weapons of scramble can ever develop as a guillotine like it should be in your arsenal and\n\n25:58.660 --> 26:02.540\n He was like, yeah, I just grab off of the back and I said, well, there's gonna be a day\n\n26:02.540 --> 26:07.420\n You can't take someone's back and it's always good to better strangle from front and back\n\n26:07.660 --> 26:10.860\n Okay, of course, we all prefer a strangles on the back that makes sense\n\n26:11.140 --> 26:14.220\n But there's gonna come a day where it's gonna be useful for you\n\n26:14.220 --> 26:18.940\n and so that was one of the few times where I put my foot down and said you're learning this shut the fuck up and\n\n26:20.660 --> 26:25.740\n Like literally wouldn't teach him any anything else until you got a guillotine. Yeah, Gary like asked him a question\n\n26:25.740 --> 26:27.740\n he's like, let's say you're guillotine and\n\n26:29.700 --> 26:36.340\n For the first three months as gifted as as Gary tone it is and learning most moves most moves Gary gets it like\n\n26:36.860 --> 26:42.380\n in minutes, there was something going on with Gary just couldn't get a guillotine on people and\n\n26:42.380 --> 26:49.580\n Finally after around three months, he started having some success until ultimately became one of his best weapons\n\n26:50.780 --> 26:54.060\n We had to go through like 15 different variations of guillotine\n\n26:54.540 --> 26:57.940\n until he found one which actually worked reliably for him and\n\n26:58.500 --> 27:01.680\n That was one of the few times where I put my foot down and said no\n\n27:01.900 --> 27:06.340\n Do you have to learn this the long search had to do more with the physical characteristics?\n\n27:06.340 --> 27:12.740\n I couldn't figure out the right like it made sense. It made sense in the case of Gary tone because there were more opportunities per minute\n\n27:12.740 --> 27:14.740\n Of his grappling for guillotines\n\n27:15.260 --> 27:19.380\n The investment and time was worth it for another athlete. I might have said well\n\n27:19.380 --> 27:24.300\n He hardly ever gets in the situation the front headlong so guillotine so it's not even worth investing the training time\n\n27:24.980 --> 27:28.660\n Let me ask you a question on the on the competition side mentioned haters\n\n27:28.660 --> 27:32.640\n And do you think about this aspect of the competition with athletes?\n\n27:32.640 --> 27:36.320\n If there's a great question and the answer is no\n\n27:38.680 --> 27:39.960\n I'm\n\n27:39.960 --> 27:44.840\n You can see that you could you couldn't find two more polar opposites\n\n27:45.680 --> 27:50.800\n psychologically than than George St. Pierre and this monstrosity on my left and\n\n27:52.080 --> 27:59.220\n I've I've never said to my athletes. Hey, I think this is the sort of demeanor you should carry yourself with\n\n27:59.220 --> 28:04.660\n I'm myself a very flawed character and I'm the last person on earth\n\n28:04.660 --> 28:07.900\n Who should be delving out moral advice to other people?\n\n28:08.820 --> 28:13.020\n The only thing is that I you know, of course, I believe some things are off limits\n\n28:13.100 --> 28:18.660\n But as long as it's done in the context of sport with no one's physically attacking people or do anything crazy\n\n28:18.660 --> 28:23.420\n Where it just goes completely over the top then I give almost zero\n\n28:24.740 --> 28:27.500\n Moral advice to my athletes. I'm a jiu jitsu coach not a preacher\n\n28:27.500 --> 28:29.500\n I\n\n28:29.620 --> 28:31.540\n If I can if I may\n\n28:31.540 --> 28:33.540\n We are entertainers\n\n28:34.140 --> 28:37.460\n You know, we're athletes or professional athletes, but we make\n\n28:38.460 --> 28:43.940\n We make a living because of people or want to see us perform\n\n28:44.540 --> 28:48.420\n Same thing an actor or something a singer and a lot of the time\n\n28:49.460 --> 28:51.460\n especially in the fight game\n\n28:51.460 --> 28:57.820\n An event is promoted. It needs to be with emotion\n\n28:58.940 --> 29:01.560\n Love me hate me, but do not ignore me\n\n29:02.620 --> 29:04.220\n and\n\n29:04.220 --> 29:05.680\n You know it\n\n29:05.680 --> 29:07.680\n when it's authentic and\n\n29:08.700 --> 29:14.260\n It's done. Well, I think me my personally my my favorite fighters to watch are the one that are that\n\n29:14.740 --> 29:18.700\n That I that have a sort of some sort of a bad persona\n\n29:18.700 --> 29:21.620\n I really enjoy watching those guys because\n\n29:22.420 --> 29:26.540\n They bring an emotion element into a fight, which is great\n\n29:26.540 --> 29:33.480\n You know, I I feel to me it's more interesting to watch when there is an emotion involved and I believe that's why\n\n29:34.340 --> 29:38.220\n Some fighters make more money than others, you know, you know what I mean?\n\n29:38.220 --> 29:41.520\n They would that's the reason why we may we can make a living out of this\n\n29:41.520 --> 29:47.580\n Yeah, they're better entertainers, but you're right. The authenticity seems to be really important. There's actually something very interesting there\n\n29:47.580 --> 29:50.480\n It's time to break out some some secrets\n\n29:52.380 --> 29:57.620\n Do you know who like you think of George St. Pierre you think of like the highly technical polished\n\n29:58.860 --> 30:05.340\n Martial artists. Oh, this is gonna be great. Do you know who his favorite fighters to watch were?\n\n30:06.060 --> 30:10.220\n You'd probably be thinking of probably someone who's really technically advanced\n\n30:10.820 --> 30:16.180\n Actually, it was Mark Coleman. Oh, no, Kevin Randleman and Phil Barone\n\n30:16.180 --> 30:22.100\n He used to love watching that was a hammer house. That was his favorite. He would love those guys and\n\n30:22.900 --> 30:26.340\n whenever their fights were on georgie watching the hammer house crew and\n\n30:27.980 --> 30:32.940\n It's funny what you said about how those guys bought an intensity to\n\n30:33.620 --> 30:37.140\n To MMA that was off the charts. Have you ever met those guys in?\n\n30:38.340 --> 30:42.260\n And in their prime, let me tell you it was it was something to behold and\n\n30:42.260 --> 30:46.420\n I had this crazy larger than life personality\n\n30:47.260 --> 30:49.420\n Most of the things I did made no sense whatsoever\n\n30:49.620 --> 30:56.020\n But I mean technically but that was their appeal and they were these guys and George loved to watch them more than anyone else\n\n30:56.120 --> 31:01.220\n You never know what what could happen with these guys. I remember when Mark Coleman won the Pride Grand Prix\n\n31:01.220 --> 31:04.780\n I was in my living room. I was jumping I was so happy. I was like, yeah\n\n31:04.780 --> 31:11.660\n Yeah, he beat Igor Vorchevchin. That was like I like for to me. It was amazing. You know what I mean?\n\n31:12.260 --> 31:16.860\n Because of the emotion that they brought into the fight George is actually very\n\n31:17.740 --> 31:20.580\n interested by something you said that normally when I\n\n31:21.940 --> 31:24.420\n Ask what is the appeal of a given fighter?\n\n31:25.180 --> 31:32.260\n And what makes people watch a fight you talked about the idea that fighters entertain us and that's absolutely correct that they are\n\n31:32.260 --> 31:36.820\n It's this weird weird industry where you're you're\n\n31:37.420 --> 31:42.820\n Both an athlete and an entertainer and you need to be successful in both regards to become\n\n31:43.740 --> 31:46.220\n financially successful insofar as\n\n31:47.300 --> 31:54.180\n Your favorite athletes to watch at least were people who are almost like the polar opposite of who you are\n\n31:55.260 --> 31:58.700\n I've always said that most people if you look at\n\n31:58.700 --> 32:02.740\n Say a million people watch a pay per view event\n\n32:03.500 --> 32:07.340\n What percentage of those million people have a genuine?\n\n32:08.180 --> 32:12.220\n technical understanding of what's happening as they watch a fight\n\n32:12.980 --> 32:14.980\n It's tiny\n\n32:15.380 --> 32:23.140\n It's absolutely tiny the vast majority of people who watch a professional fight have almost no\n\n32:23.420 --> 32:25.420\n technical understanding of\n\n32:25.420 --> 32:31.060\n What's going on in front of them? So how do they relate to the fight? What's the only way they can?\n\n32:31.780 --> 32:33.780\n it's through emotion and\n\n32:34.460 --> 32:39.820\n So when they get a sense that these two don't like each other then they can relate to the fight\n\n32:40.340 --> 32:46.140\n But only a tiny percentage of people watching a given professional fight can relate to it on a technical level\n\n32:46.820 --> 32:51.420\n The overwhelming majority will always form an emotional attachment to the fight\n\n32:51.420 --> 32:56.140\n That's why when you see things shows that USC primetime, they never focus on\n\n32:57.060 --> 33:01.260\n tactics and the techniques of the fight they focus on the emotional elements the\n\n33:01.660 --> 33:05.180\n Preparation the view of their own family members as athletes get ready\n\n33:05.220 --> 33:09.780\n It's always an emotional pull because that's how 99 percent of the viewers\n\n33:09.980 --> 33:17.220\n Relate to the fight if I haven't think about chess, okay, if I have minimal knowledge of two world champions\n\n33:17.220 --> 33:22.420\n Coming to fight each other in it or match up against each other in a game of chess\n\n33:22.420 --> 33:28.300\n I know so little about chess tactics and I can't really form any kind of technical\n\n33:29.220 --> 33:31.220\n appreciation of what's going on on the board\n\n33:31.620 --> 33:36.940\n But if you tell me that these two chess players hate each other's guts and they've got a rivalry which goes back five years\n\n33:37.020 --> 33:42.660\n And they've said this and that about each other in public then suddenly on my ears break up and I'm like, oh, okay\n\n33:42.660 --> 33:44.660\n This sounds interesting\n\n33:44.660 --> 33:51.540\n because I just don't have the the knowledge to appreciate what's going on on the board and a chess game to be able to\n\n33:51.980 --> 33:53.900\n to appreciate the\n\n33:53.900 --> 33:56.860\n The technical nuances of what they're doing. So any\n\n33:57.860 --> 34:02.940\n Interest that I have in the chess match is going to have to come from some kind of emotional level because I'm just not qualified\n\n34:03.140 --> 34:09.260\n To make technical assessments and that's exactly how it is in the case of both grappling and mixed martial arts\n\n34:09.260 --> 34:15.220\n That's why the ones who evoke the most attention are always the ones who can form some kind of emotional appeal\n\n34:15.380 --> 34:17.820\n Conor McGregor was the all time master of this. I\n\n34:18.460 --> 34:20.460\n believe also\n\n34:20.900 --> 34:22.900\n Emotion can be used as a weapon\n\n34:23.780 --> 34:28.680\n For example, I've learned I've learned this from my favorite boxer is sugar a Leonard\n\n34:29.380 --> 34:31.860\n Sugar a Leonard. I remember I was very young\n\n34:31.860 --> 34:36.380\n So I watched his fight later when I was older, but I know that sugar a Leonard\n\n34:36.380 --> 34:43.780\n Was the best boxer of his era to me personally and I don't think nobody could beat him\n\n34:43.780 --> 34:50.300\n I think it was skill skill wise it was the best. However, when he fought in Montreal Roberto Duran\n\n34:51.620 --> 34:53.620\n Roberto Duran\n\n34:55.700 --> 35:01.780\n Made it in a way that Leonard became very emotional he wanted to stand in front of Duran and\n\n35:01.780 --> 35:08.100\n fight a different fight that that he normally does because he wanted to show that he's a man and\n\n35:09.140 --> 35:11.340\n He lost that fight, which was a mistake\n\n35:12.140 --> 35:13.860\n so by\n\n35:13.860 --> 35:21.200\n Then later on he beat Roberto Duran in quite easy, you know, the if the fair everybody remember the no mask thing\n\n35:21.460 --> 35:23.460\n but my point is\n\n35:23.460 --> 35:32.300\n Emotion can be used in a way that it can make your derail your opponent out of his game plan\n\n35:32.300 --> 35:37.500\n And I felt a lot of my opponent trying to do that with me. So that's why I never got involved\n\n35:37.500 --> 35:39.980\n that was my way to defend myself against\n\n35:41.100 --> 35:45.700\n Some kind of bullying is to put like a like a shield in front but some other guy like\n\n35:47.020 --> 35:53.180\n Gordon he expressed himself differently. Of course, there's a language barrier, but for him he's better\n\n35:53.180 --> 35:54.460\n at\n\n35:54.460 --> 35:58.460\n Given giving giving back that says he's a better counter attacker, you know\n\n35:58.460 --> 36:01.500\n that's the way you respond to to to the aggression of\n\n36:02.540 --> 36:09.100\n An emotional attack. I think everybody is different in that regards. What's interesting that John said that he doesn't\n\n36:11.780 --> 36:16.820\n Study the tactics of this game or maybe you're not interested in the tactics of this game\n\n36:16.900 --> 36:19.860\n Because it seems like this is more than just being an entertainer\n\n36:19.860 --> 36:26.380\n It seems like it could be an effective part of the match. Yeah, I just feel like whatever investment you make in that is\n\n36:27.900 --> 36:33.500\n It's going to get negligible rewards first of all, it's probably only going to pertain to one match in front of you rather than the\n\n36:33.500 --> 36:35.500\n totality of your career and\n\n36:36.020 --> 36:39.620\n Whatever gains you get out of psychological trickery and play\n\n36:41.900 --> 36:43.900\n Typically\n\n36:43.900 --> 36:50.660\n Don't last long you you've raised an excellent example with sugar rate Leonard. He did fight outside of his usual\n\n36:51.820 --> 36:56.140\n manner in that regard, but rather than me try to tell someone hey\n\n36:56.940 --> 36:58.540\n Behave like this before a fight\n\n36:58.540 --> 37:02.980\n I would have been probably more forceful between rounds with an athlete and say no\n\n37:02.980 --> 37:06.180\n No, you're fighting this fight the wrong way and that would have a much\n\n37:06.940 --> 37:08.020\n more\n\n37:08.020 --> 37:10.060\n beneficial impact on my athletes and\n\n37:10.060 --> 37:14.580\n Psychological trickery before a fight. I believe another example of\n\n37:16.100 --> 37:18.100\n Emotion that leads to failure is a\n\n37:19.060 --> 37:26.500\n Jose Aldo against Connor McGregor. I think it was it was on purpose that Connor McGregor\n\n37:26.500 --> 37:33.340\n Did this try to bait Aldo to become over aggressive to open himself because he's an excellent counter puncher puncher\n\n37:34.140 --> 37:36.460\n That's what I believe. It made a mistake\n\n37:36.460 --> 37:39.300\n There's another great one my match against cyborg\n\n37:40.060 --> 37:43.340\n 2018 no gi worlds where he didn't even try to win\n\n37:43.340 --> 37:46.460\n He just like wanted to smack me in the face the whole time cuz he was so angry\n\n37:46.460 --> 37:48.700\n I was talking shit to him before the match and\n\n37:49.260 --> 37:51.900\n It was like the finals of the absolute it was like the biggest\n\n37:52.260 --> 37:55.900\n Match of the weekend and he just didn't even try to pass my guard or do anything\n\n37:55.900 --> 37:59.020\n He just wanted to hit me in the face and I was like sick. I just won\n\n37:59.700 --> 38:04.940\n It was incredibly fresh. It's fascinating to watch like a grown man sort of lose\n\n38:04.940 --> 38:05.940\n composure\n\n38:05.940 --> 38:06.940\n Yeah\n\n38:06.940 --> 38:12.220\n Gordon one thing I've always been very impressed with you and that's\n\n38:13.820 --> 38:16.300\n No matter how heated talk gets\n\n38:17.180 --> 38:22.180\n Before a match with you when you go out to grapple. You're absolutely cold\n\n38:22.900 --> 38:25.700\n Like I've you've never gone into a match\n\n38:26.420 --> 38:30.820\n carrying anything other than just cold blooded calculation and\n\n38:30.820 --> 38:38.220\n You've always been able to separate very well the idea of words and deeds. And I think that's always been one of your\n\n38:39.220 --> 38:44.460\n One of your strongest assets a way I often measure this is when a match is over\n\n38:44.460 --> 38:48.620\n I will ask the athlete questions about the match and\n\n38:49.180 --> 38:53.460\n If they can't answer the question, what were you doing in the fourth minute? Okay\n\n38:53.460 --> 38:56.260\n What was that set up you used in in the third minute?\n\n38:56.260 --> 39:03.180\n They got you into the Kimura law if they can't answer that that tells me they were just fighting on instincts and emotion\n\n39:03.500 --> 39:05.740\n But with Gordon, it's like a logbook\n\n39:07.260 --> 39:09.420\n It's like okay in the seventh minute you went for that\n\n39:10.420 --> 39:13.380\n Judy Gatami set up from from on the left side\n\n39:14.140 --> 39:18.300\n What were you thinking? He can always give an answer. He's absolutely stone cold\n\n39:20.660 --> 39:22.660\n Speaking of emotion\n\n39:22.660 --> 39:31.020\n Speaking of emotion Gordon you will potentially if you're healthy face Andre Galvao and the ADCC\n\n39:31.540 --> 39:33.540\n coming up super fight\n\n39:33.780 --> 39:38.740\n Who is Andre Galvao for people who don't know? Can you tell the story of your beef with?\n\n39:39.940 --> 39:45.020\n The the emotional interaction with a man. Yeah, so Andre is\n\n39:45.860 --> 39:49.260\n He's considered the greatest ADCC competitor of all time\n\n39:50.020 --> 39:52.020\n multiple time black belt world champion\n\n39:52.020 --> 39:56.380\n winningest ADCC champion ever he has six six gold medals and\n\n39:57.540 --> 39:59.540\n I've been trying to compete against him\n\n40:00.300 --> 40:05.020\n Pretty much forever like since I got my black belt in 2016. I've been trying to get matches with him\n\n40:05.460 --> 40:10.660\n he was in the first DBI that I did and he ended up pulling out and that I've been trying to get matches with him and\n\n40:12.060 --> 40:16.300\n He would always say no and give one reason or another and then\n\n40:16.300 --> 40:23.300\n After the last ADCC, I was like, hey Andre said he was retiring after this after this\n\n40:23.940 --> 40:29.660\n This competition so if he wants to retire, you know, he's he's the greatest ADCC competitor of all time\n\n40:29.660 --> 40:34.740\n And I think it's great. But if he wants to compete and that's great. I was like super nice and then he started like\n\n40:35.940 --> 40:37.940\n posting like passive aggressive Instagram\n\n40:39.820 --> 40:41.220\n Captions and\n\n40:41.220 --> 40:47.300\n then we started going back and forth in the internet and there was like one point where I saw him in person when he\n\n40:47.940 --> 40:52.140\n Acknowledged he's like I understand like what you're doing like we're gonna pump this fight up and he was like totally on board\n\n40:52.260 --> 40:57.620\n but then there must have been something that happened where like it changed from like him like going along with it to being like\n\n40:57.620 --> 41:01.980\n Actually pissed and then there was that one night at flow where I went to go shake his hand\n\n41:01.980 --> 41:07.220\n I mean he flipped me off and then he followed me backstage and started to try to fight me and then I smacked him and\n\n41:07.220 --> 41:13.500\n Then he didn't want to fight anymore and then we've been going back. He's actually blocked me on Instagram now\n\n41:13.500 --> 41:17.020\n So he just won't engage no one from Atos will engage now\n\n41:17.020 --> 41:21.300\n But it's gonna be interesting how he how he shows up if he can keep it under control or not\n\n41:21.460 --> 41:26.860\n Do you think how do you explain that level of emotion? Is this fear of losing your throne?\n\n41:26.860 --> 41:30.500\n Is it or is it just a human being like with the cyborg just\n\n41:31.180 --> 41:34.660\n Just becoming emotionally unstable. Well, it might just be me\n\n41:34.660 --> 41:38.060\n I just have a way to get and get under people's skin. It's just I don't know\n\n41:38.300 --> 41:42.420\n He's he's he was he was cool for a while and then I just I don't know it just\n\n41:43.180 --> 41:48.940\n Then everyone gets like this. They're all so emotional by the time they actually step up to compete that it's pretty easy to read them\n\n41:48.940 --> 41:54.900\n They're either so emotional that they want to actually come forward and and beat me like like Tim Sprague's is a perfect example at\n\n41:54.900 --> 41:56.900\n ADCC I posted like\n\n41:57.660 --> 42:00.360\n On my story on Instagram like ten minutes before a match\n\n42:00.360 --> 42:06.820\n I said like what I'm gonna do to Tim Sprague's is gonna be criminal and he's like a very stally guy and he came\n\n42:06.820 --> 42:09.220\n He saw that and then he came out and actually tried to fight me\n\n42:09.220 --> 42:12.140\n Like he came and actually engaged my guard and I ended up submitting him\n\n42:12.140 --> 42:17.540\n So it either has that effect or it has the effect where they know I've talked so much shit leading up to the match\n\n42:17.820 --> 42:22.100\n That they're so afraid to lose that they just get super stally and they move away\n\n42:22.100 --> 42:26.940\n So either has one effect where they come forward and they want to they want to beat me beat me or they want to just\n\n42:26.940 --> 42:32.460\n They're so afraid of getting submitted that they know if they engage they're super cagey and they just back away and don't really do anything\n\n42:32.780 --> 42:34.780\n Do you think this match happens?\n\n42:35.500 --> 42:41.100\n There's a lot of variables and what I have to see how my stomach is and to if I'm actually gonna show up and compete\n\n42:41.100 --> 42:44.720\n My stomach's healthy. I doubt that Andre will actually show up to compete\n\n42:44.900 --> 42:48.260\n I've been trying to compete against him for six years and he hasn't done it\n\n42:48.260 --> 42:54.340\n So there's no reason to think he would now is it possible for you to speak to where like your estimates are about your stomach?\n\n42:54.340 --> 43:00.780\n Or is it too unclear for now still too early to tell I have this round of treatment that I'm doing until late February\n\n43:00.780 --> 43:03.420\n And I'm pretty sure that I need to do the same test\n\n43:03.420 --> 43:07.020\n They did initially to retest all my levels and then go from there\n\n43:07.020 --> 43:11.340\n So I've been feeling a little bit better. Like it's not nearly as bad as it used to be\n\n43:11.340 --> 43:15.180\n I was explaining to someone the other day like for the last four years\n\n43:15.180 --> 43:18.660\n I would be so nauseous that every time I would walk into a new room\n\n43:18.660 --> 43:22.640\n I'd have to actively locate a garbage can in case I have to throw up\n\n43:22.640 --> 43:25.920\n So I'm like one step above that right now. I'm like doing a little bit better than that\n\n43:26.280 --> 43:29.500\n So it's definitely getting a little bit better, but it's not it's not where it needs to be\n\n43:30.680 --> 43:36.240\n Can we talk about diet for just a sec because both of you George and and Gordon?\n\n43:36.960 --> 43:44.040\n Like suffered from stomach issues different kind and have arrived for now for different places\n\n43:44.180 --> 43:46.480\n so can you maybe George speak to\n\n43:46.480 --> 43:54.160\n The general question of what is the best diet for performance for training like what have you learned through your career about this?\n\n43:54.160 --> 43:56.300\n Well, I think everybody is different\n\n43:57.040 --> 43:59.040\n to me personally\n\n44:00.040 --> 44:02.040\n I implement fasting\n\n44:03.600 --> 44:06.840\n Time restricted eating and and prolonged fasting\n\n44:07.240 --> 44:12.160\n What's the longest you've done so far? The longest I've done is five days. I do it quite often\n\n44:12.160 --> 44:14.480\n I do I do four times a year. I do\n\n44:14.480 --> 44:16.480\n three to five days\n\n44:17.280 --> 44:19.280\n water fast\n\n44:19.280 --> 44:25.320\n And I liked it. It helps me with inflammation. I think it boosts the immune system and\n\n44:26.040 --> 44:32.520\n That this about the I read papers about about this and I it helps me also feel\n\n44:33.160 --> 44:35.160\n Feel good. It's kind of\n\n44:35.160 --> 44:38.720\n Tera very therapeutic to physical and mental just mental\n\n44:38.720 --> 44:46.000\n It meant mental and physical because when I eat my when I break my fast and I sit at the table with with other people\n\n44:46.720 --> 44:51.080\n It doesn't matter what I eat if we all eat the same thing. I always tell them\n\n44:51.080 --> 44:58.680\n I said my food right now tastes better than all of yours, you know, because I you know, I I have that this\n\n44:59.560 --> 45:05.900\n thing that I think I believe sometimes you need to put yourself into suffering to realize how\n\n45:05.900 --> 45:07.500\n How\n\n45:07.500 --> 45:10.260\n Pleasurable something is and I\n\n45:11.820 --> 45:13.340\n Tent\n\n45:13.340 --> 45:16.340\n Personally like diet wise I eat whatever I want\n\n45:17.060 --> 45:20.540\n Whenever I want, I don't I no longer have any problem with this\n\n45:21.420 --> 45:24.500\n but if I would have a competition coming up like\n\n45:25.180 --> 45:28.420\n Knowing that I what I know now about my body I would\n\n45:29.180 --> 45:31.020\n orient myself\n\n45:31.020 --> 45:33.500\n more towards an animal based diet\n\n45:33.500 --> 45:39.540\n That's because I've tried different things and that's the kind of diet that I believe helped me\n\n45:40.420 --> 45:46.540\n Having less inflammation and feel better in terms of performance for for for doing something physical\n\n45:46.540 --> 45:48.860\n So high protein high fat low carbs\n\n45:49.540 --> 45:50.940\n well\n\n45:50.940 --> 45:57.460\n This is is different between animal based diet and keto. I mean there is carbs. There is a lot of fruit\n\n45:57.460 --> 46:00.580\n I got a lot of the the carbs from the fruit\n\n46:00.580 --> 46:03.900\n Okay, a lot of organs organs. I\n\n46:05.500 --> 46:09.300\n Know a little bit about paleontology and in the past\n\n46:10.940 --> 46:13.980\n About you a prehistoric human and and I I know that\n\n46:14.860 --> 46:19.820\n And not not only about that. I know because I have travels a certain place in the world\n\n46:19.820 --> 46:25.940\n I want to visit the Maasai in Africa the hunter gatherer tribe and I know that when they kill an animal\n\n46:25.940 --> 46:31.480\n They go for the organs first and I know a pretty most predatory animal. They do the same thing\n\n46:31.480 --> 46:37.400\n So organs I believe is something that normally in our culture in the western part of the world\n\n46:37.400 --> 46:40.080\n We don't really eat but it's something that is very nutritious\n\n46:41.280 --> 46:44.040\n Have you been able to convince Gordon to try fasting?\n\n46:46.040 --> 46:48.040\n Talk about diets\n\n46:48.360 --> 46:53.300\n It's a different situation. I think for Gordon because he's an heavyweight. He doesn't want to lose weight\n\n46:53.300 --> 46:59.440\n You know when the heavyweight the range of like my range was like I was a welterweight and middleweight\n\n46:59.440 --> 47:06.720\n But the heavyweight it's like some of the guys that you compete can compete against their it might be 300 pounds. So if you lose weight\n\n47:07.440 --> 47:09.560\n It's a it's a big problem. You know what I mean?\n\n47:09.560 --> 47:14.360\n So and there is things that will work for me that might not works for Gordon, you know\n\n47:14.360 --> 47:18.640\n So we have to make his own experience and and I told Gordon sometime when everybody goes left\n\n47:18.640 --> 47:22.500\n You try to go right see how you feel with certain things experiment\n\n47:22.500 --> 47:24.500\n Not not a topic\n\n47:25.260 --> 47:27.260\n That's part of your optimization\n\n47:27.740 --> 47:34.300\n Optimal performance formula. Well what I used to do before my stomach issues and for those of you listening who don't know I had\n\n47:34.420 --> 47:36.420\n recurring staph infections in\n\n47:36.460 --> 47:41.400\n 2018 and I took a bunch of oral antibiotics and it just completely wiped out my stomach\n\n47:41.400 --> 47:45.780\n So I just was diagnosed. It was misdiagnosed as gastroparesis\n\n47:45.780 --> 47:51.660\n So for those of you messaging me on Instagram who are just watching Rogan asking me about my gastroparesis. That's not what I have\n\n47:51.660 --> 47:56.500\n They misdiagnosed it and I did some other tests and for four years\n\n47:56.500 --> 48:01.180\n I didn't even know what it was and then I got this I went to this doctor in California who?\n\n48:02.060 --> 48:09.460\n Diagnosed me with H. Pylori and then a fungal and a bacterial overgrowth in my small intestines. So the issues in the small intestines\n\n48:10.000 --> 48:12.060\n so what I used to do was I used to do like\n\n48:12.540 --> 48:18.180\n Seasons where I'd have a very clean season where I was competing and I would have a lower body weight\n\n48:18.180 --> 48:22.980\n And I would do like an offseason kind of like a bodybuilder where I would eat a lot more food and a little bit\n\n48:23.100 --> 48:27.500\n Dirtier food and I would have cheeseburgers and pizza at nighttime to have the extra calories\n\n48:27.980 --> 48:30.620\n But now I can't eat those foods because they upset my stomach\n\n48:30.620 --> 48:34.440\n So now I pretty much just try to eat whatever I can and maintain the weight the best I can\n\n48:35.060 --> 48:40.940\n Based on how my stomach feels. So right now it's like rice chicken eggs fish\n\n48:41.700 --> 48:43.620\n vegetables fruits and\n\n48:43.620 --> 48:45.700\n Pretty much nothing else like anything hard to digest\n\n48:45.700 --> 48:52.260\n Anything spicy red meat fast food all that's all that's hard for me\n\n48:52.540 --> 48:56.080\n Which sucks because in Texas things? Yeah barbecue\n\n48:57.460 --> 49:00.940\n And I mean this diet is really important for you John I can tell\n\n49:02.420 --> 49:09.020\n Like is it is that something you think about for athletes at all again, that's part of the I've to be honest with you\n\n49:09.540 --> 49:11.540\n I've never seen any\n\n49:11.900 --> 49:13.140\n measurable\n\n49:13.140 --> 49:20.900\n Improvement in sports performance in jiu jitsu by change of diet. I do believe that diet is important for longevity and\n\n49:21.460 --> 49:25.420\n Human beings and I do think it makes a difference, especially once you get past the age of 40\n\n49:26.580 --> 49:28.580\n with regards longevity\n\n49:28.820 --> 49:34.540\n For older athletes. I do believe it makes some difference. But my observation is in athletes and\n\n49:35.140 --> 49:40.460\n In their youth and working up into their prime. I've seen athletes have the worst\n\n49:41.140 --> 49:42.900\n diets\n\n49:42.900 --> 49:48.820\n God bless Travis Stevens for that guy won Olympic silver medal basically on McDonald's and candy. Yeah\n\n49:50.020 --> 49:54.860\n George St. Pierre for 80% of your career. You were powered by McDonald's and coca cola\n\n49:55.380 --> 50:00.580\n To Gina Alfredo. That was my yeah, my meal of choice before a championship fight\n\n50:01.060 --> 50:05.940\n Gordon for him his youth was just five guys hamburgers Gary Tonin the same thing\n\n50:06.340 --> 50:11.980\n I've worked with Japanese judo players who smoked a pack of cigarettes a day and won Olympic gold medals\n\n50:11.980 --> 50:16.320\n I've worked with Russian wrestlers who just ate\n\n50:18.500 --> 50:23.360\n Whatever was put in front of them and their athletic performance was outstanding\n\n50:24.220 --> 50:28.260\n I've worked with other guys who did have what would be considered a very clean diet and\n\n50:28.600 --> 50:34.820\n Their performance was no better than anyone else on the mat. So I've never I've never seen someone say\n\n50:34.820 --> 50:39.460\n Okay, I changed my diet and because of that there was a measurable\n\n50:39.460 --> 50:47.580\n Improvement, you know in sports performance another way to phrase it though is I have noticed with a lot of lead athletes what they eat\n\n50:47.980 --> 50:53.020\n They begin to believe that that either is not a hindrance or it's actually good\n\n50:53.020 --> 50:56.780\n Like Travis Stevenson is an example of somebody who eats shitty\n\n50:57.420 --> 51:03.220\n Because he believes it's like it's like a power because whatever he's traveling across the world\n\n51:03.220 --> 51:05.820\n He can't rely on healthy good food to be there\n\n51:05.820 --> 51:12.500\n So I'm going to eat shitty so that that's the like my body knows how to perform under whatever skittles or whatever\n\n51:12.500 --> 51:14.820\n Everywhere's got McDonald's everywhere's got McDonald's\n\n51:14.820 --> 51:20.820\n So that makes like and they've convinced themselves and you talk about Russian athletes. A lot of them have very\n\n51:21.780 --> 51:23.780\n Strong beliefs about like this\n\n51:24.660 --> 51:29.980\n Particular food being good for them, but there's no agreement among them. Exactly. No agreement. Yeah\n\n51:29.980 --> 51:32.780\n Yeah, so believe is more important than the actual time. Yeah\n\n51:32.780 --> 51:36.100\n I'm sorry if I can after\n\n51:36.900 --> 51:40.580\n You know after a night out when you're hanging over I\n\n51:41.540 --> 51:45.540\n Think the best thing and and I'm saying this and all certain sincerity\n\n51:45.540 --> 51:50.920\n I think the best thing to eat to me was like like a cheese cheeseburgers with\n\n51:51.300 --> 51:57.800\n We call that a puts in back home because it's very fat. It's greasy. So it up so the next day\n\n51:57.800 --> 52:02.320\n When you wake up, I think you feel better because it absorbed the outcome. There you go. I'm\n\n52:05.120 --> 52:10.560\n My mom told me the same story once and then I try it was like I was hung over for some party and\n\n52:10.880 --> 52:14.760\n I woke up. I was like probably I don't know 19 or 20 I woke up and\n\n52:15.600 --> 52:20.720\n My mom's like, yeah, just have it have a cheeseburger go go eat something greasy and I did and I was like\n\n52:20.720 --> 52:25.280\n Oh, I feel kind of better now. I do not know that science the exact science behind it\n\n52:25.280 --> 52:31.000\n but I I always notice and I don't know if it's placebo, but I always notice that if I\n\n52:32.280 --> 52:35.100\n I'm if I party hard and I've been drinking a lot\n\n52:35.800 --> 52:38.560\n If I don't eat before I go into bed if I don't eat\n\n52:38.720 --> 52:44.200\n Shitty food the next day will wake up and feel worse than if I eat shitty food. I feel better\n\n52:44.200 --> 52:47.840\n I know it sounds crazy. I don't know why but it works for me\n\n52:47.840 --> 52:53.840\n Yeah, but it's also hard to do science on extreme performers so the discussions we're having is amongst the very\n\n52:53.840 --> 52:59.440\n You know that this might not apply to a general like recreational athlete, but for the elite\n\n52:59.440 --> 53:04.040\n I've just seen champions in every kind of combat sport and I've never seen a\n\n53:04.040 --> 53:11.640\n Correlation between dietary habit and performance and people under the age of 30. I do believe that diet is important for longevity. However, and\n\n53:12.800 --> 53:16.080\n For that alone it may well be worth investing time in it\n\n53:16.080 --> 53:21.440\n But with regards sports performance at least in jiu jitsu, I've never seen any significant difference\n\n53:21.440 --> 53:25.040\n Well, we had a little bit of a difference of opinion on this\n\n53:25.040 --> 53:29.840\n I think what about strength training and muscle building or at least we had a discussion about this\n\n53:29.840 --> 53:31.840\n So what do you believe is the value of?\n\n53:33.760 --> 53:37.840\n Of you know training outside of the sport so fitness\n\n53:38.560 --> 53:42.080\n Lifting heavy lifting explosive all kinds of lifting\n\n53:42.080 --> 53:46.400\n Personally for me, I believe and I've learned that from from John\n\n53:48.000 --> 53:50.000\n I used to do like\n\n53:50.560 --> 53:56.160\n To train like a bodybuilder before because I thought in my early days of competition\n\n53:56.160 --> 54:02.480\n That was the most efficient way to do things to because it was like I was watching Jean Claude Van Damme\n\n54:03.040 --> 54:07.200\n Arnold Schwarzenegger, we thought back back in the day. That was the thing\n\n54:07.200 --> 54:11.280\n That that's how we should do it, you know for to get ready for a fight\n\n54:12.000 --> 54:14.000\n But I realized later on\n\n54:15.920 --> 54:23.680\n That it's all about efficiency and some guys they don't lift at all and they're doing pretty well, so I\n\n54:24.480 --> 54:27.460\n Do cross training mostly for longevity\n\n54:28.240 --> 54:30.240\n It's mostly for a therapeutic\n\n54:30.800 --> 54:33.520\n Like a therapy. It's more therapeutic than\n\n54:33.520 --> 54:39.920\n For performance is to keep my body healthy to do a certain movement that are different than what I do every day in the gym\n\n54:40.080 --> 54:42.560\n in combat sport to keep me\n\n54:44.560 --> 54:50.640\n Healthy and and athletic so all the interesting movement stuff that you've done outside the sport that was for\n\n54:51.440 --> 54:54.240\n Therapeutic mostly therapeutic. I think it does it could\n\n54:55.120 --> 54:59.840\n Transcend to performance, but it's mostly therapeutic. I do not believe that\n\n54:59.840 --> 55:06.720\n Squatting five plates or bench bench pressing three plate will make me a better fighter\n\n55:06.720 --> 55:12.880\n I do not I believe actually it could hurt me more. It could damage me more than than benefit me\n\n55:13.680 --> 55:14.880\n so\n\n55:14.880 --> 55:17.520\n Gordon as somebody who on instagram posts\n\n55:18.080 --> 55:21.040\n A lot of pictures of you being shredded and huge\n\n55:21.680 --> 55:25.600\n What's the value of of strength? So I do like a combination\n\n55:25.600 --> 55:32.080\n John got us big into like gymnastics type movements like toes to bar and muscle ups and things like that when we were young\n\n55:33.120 --> 55:38.240\n Like toes to bar because that's like the exact motion you have to do when you're retaining guard it needs to chest\n\n55:38.880 --> 55:40.880\n So I do a lot of that stuff\n\n55:41.120 --> 55:43.120\n In combination with I do a lot of\n\n55:43.680 --> 55:46.080\n Opposite of george. I do a lot of bodybuilding workouts\n\n55:46.880 --> 55:50.480\n Where I do like a basic split like a chest to chest\n\n55:50.480 --> 55:57.120\n Triceps back and biceps day. Um, and my idea is that\n\n55:59.600 --> 56:06.160\n Weight lifting should always be a supplement to jiu jitsu. So you shouldn't be missing a jiu jitsu session to lift weights\n\n56:06.960 --> 56:12.400\n So I don't do I do probably I train jiu jitsu every day and I lift three to four times a week\n\n56:12.400 --> 56:17.200\n Um, I feel like lifting seven days a week for me is is too much and the lifting takes a lot of energy\n\n56:17.200 --> 56:21.520\n When you do like hard lifts like that, um, but my idea is if you want to get good at jiu jitsu\n\n56:21.600 --> 56:28.320\n Do jiu jitsu and if you want to be bigger and stronger lift weights and uh, and eat food and um,\n\n56:29.040 --> 56:34.800\n I I generally don't go super heavy when I lift because you start putting crazy weights then start tearing muscles and stuff\n\n56:35.040 --> 56:39.440\n Um, so I usually do moderate weights with a with a very high rep rep range like four sets of 20 with\n\n56:39.680 --> 56:42.800\n a drop set at the end to fatigue the muscles break the fibers and\n\n56:43.520 --> 56:44.720\n grow\n\n56:44.720 --> 56:50.720\n Okay, so four sets of 20 that's interesting. So that that's more for endurance and raw strength\n\n56:50.800 --> 56:52.800\n yeah, and also I think\n\n56:52.800 --> 56:55.440\n close to the competition i'll pick the intensity up and\n\n56:56.080 --> 57:01.600\n While there's no real way to get significant gains in vo2 max. I think that lifting\n\n57:02.160 --> 57:04.480\n And just getting used to mentally redlining\n\n57:05.040 --> 57:10.480\n Um gets me kind of in competition shape because a lot of times in jiu jitsu the guys i'm training with\n\n57:11.040 --> 57:13.040\n They're not on a technical level\n\n57:13.040 --> 57:14.720\n where they can\n\n57:14.720 --> 57:16.800\n Physically exhaust me to the point where I feel like i'm going to die\n\n57:17.360 --> 57:20.960\n But uh, I get most of that like when i'm wrestling because i'm not as efficient in wrestling\n\n57:20.960 --> 57:22.560\n So I get a lot more tired\n\n57:22.560 --> 57:26.160\n Um and lifting when you do like if you do like four sets of 20\n\n57:26.480 --> 57:30.160\n Leg press to squat and you go back and forth like you're like about to die at the end\n\n57:30.400 --> 57:36.800\n And I think I feel like gets me in the mental habit of redlining before competition. But does muscle help you?\n\n57:37.440 --> 57:39.440\n It's like the actual mass of muscle\n\n57:39.440 --> 57:44.640\n Like the actual mass of muscle like this. So I think being stronger will always help in a combo will always help. Yeah\n\n57:44.640 --> 57:49.360\n To some degree. It's not going to be to a degree where\n\n57:50.400 --> 57:52.400\n It overrides efficiency, but I think that\n\n57:53.120 --> 57:59.200\n It can't help being strong or can't hurt being stronger. There's a bunch of people who believe depending on the sport that\n\n58:01.360 --> 58:03.360\n The strength can quickly become a\n\n58:04.080 --> 58:06.660\n That have detrimental effects to efficiency\n\n58:06.660 --> 58:13.060\n Yeah, like I agree that certain kind of I mean if strength is purely is like very cleanly\n\n58:13.540 --> 58:18.260\n Purely applied to the exact movements of the sport. So in judo the explosiveness you need\n\n58:18.740 --> 58:23.540\n Is very difficult to replicate in any kind of way except by doing judo. Yeah, I mean\n\n58:24.180 --> 58:25.620\n for us, uh\n\n58:25.620 --> 58:30.260\n You always have to understand there's only so much technique that can overcome a certain amount of strength\n\n58:30.260 --> 58:33.540\n Like if we all try to fight a silverback gorilla, it's gonna kill us\n\n58:33.540 --> 58:37.380\n Um, but that that being said, um, I do think that\n\n58:37.940 --> 58:45.060\n Like for example heavyweights are usually the least technical because they rely on their size and strength to beat smaller people\n\n58:45.380 --> 58:50.420\n Um, but I think that if you stay with this with the discipline of doing everything very precise\n\n58:50.580 --> 58:56.660\n And I train with a lot smaller people most of the time so I get out of the habit of using uh using my strength\n\n58:56.900 --> 59:02.340\n Um, I think if you're very precise with the way that you train I think that the the extra size and strength can help you\n\n59:02.340 --> 59:05.300\n A quick question. How would you fight a silverback gorilla?\n\n59:07.700 --> 59:13.380\n I mean, is there which animal do you think you can actually defeat that would be impressive that most people would say you can't\n\n59:14.100 --> 59:16.100\n you know, I actually\n\n59:16.100 --> 59:17.940\n I don't have an uh an answer to this\n\n59:17.940 --> 59:23.380\n I thought you were gonna say I want I want I want to say that me and john had like a four hour discussion on\n\n59:23.380 --> 59:26.820\n This one time i'm like, what would win bear or gorilla?\n\n59:26.820 --> 59:33.060\n Uh, and he went into like this whole dissertation about how like jaguars spin underneath and like berimbolo silverbacks and kill them and like rip\n\n59:33.060 --> 59:39.060\n Their rip their artery and their legs out. It was amazing. I guess. Okay, so before we talk about strength john, let me ask you what\n\n59:40.020 --> 59:43.620\n Do you think people would be surprised by if two animals faced?\n\n59:44.180 --> 59:46.660\n One of them would win and people wouldn't predict that\n\n59:47.220 --> 59:53.620\n So they would be surprised by the effectiveness of certain animal at fighting in the whether it's in the forest in the jungle\n\n59:53.620 --> 59:59.140\n So let's slow down here. Okay, so there's two animals of different species fighting\n\n59:59.940 --> 1:00:01.940\n And and most people would pick\n\n1:00:03.060 --> 1:00:08.820\n So for example, the lion gets a lot of credit for some reason i'm not exactly sure why the king of the jungle\n\n1:00:09.540 --> 1:00:10.820\n well, I\n\n1:00:10.820 --> 1:00:12.820\n You know a lot of people told me that the lion\n\n1:00:13.380 --> 1:00:15.380\n for example, the tiger can\n\n1:00:15.380 --> 1:00:18.260\n Be a lion. Yeah, this is one of those age old debates\n\n1:00:18.260 --> 1:00:23.860\n It's okay. Yeah. Well in grappling in fighting it feels like some animals use\n\n1:00:24.500 --> 1:00:25.540\n teeth\n\n1:00:25.540 --> 1:00:31.780\n And some use other parts of their body also like bear actually, I don't even know how they\n\n1:00:33.300 --> 1:00:35.300\n They have extraordinarily powerful\n\n1:00:35.940 --> 1:00:42.340\n And long claws and in addition, they're powerful biters as well. So I wonder and the same with the silverback\n\n1:00:43.060 --> 1:00:45.700\n I don't know how much they're I love that we're having this discussion\n\n1:00:45.700 --> 1:00:50.500\n I think we need joe rogan for this discussion. I think so. Yeah, I think so. Um, so\n\n1:00:50.980 --> 1:00:51.940\n uh\n\n1:00:51.940 --> 1:00:59.060\n Your your question has gone in about five different. So it started with strength. Uh, and let's go back there, which is\n\n1:01:00.100 --> 1:01:04.100\n Do you think for for an athlete in jiu jitsu? Let's let's stick to grappling\n\n1:01:05.060 --> 1:01:10.500\n All right. Do you think strength strength is helpful or detrimental? Uh, i've always believed that\n\n1:01:11.220 --> 1:01:13.220\n two things will\n\n1:01:13.220 --> 1:01:15.220\n Uh create whatever\n\n1:01:15.860 --> 1:01:21.240\n Whatever effectiveness you have in grappling those are your skill set and your attributes\n\n1:01:22.020 --> 1:01:24.900\n And the best athletes are those who excel in both\n\n1:01:25.620 --> 1:01:26.820\n um\n\n1:01:26.820 --> 1:01:29.620\n Don't kid yourself if someone gets twice as strong\n\n1:01:30.980 --> 1:01:35.540\n By some kind of magic potion they're going to be a more effective grappler if someone gets\n\n1:01:36.100 --> 1:01:40.660\n Twice the level of endurance that they had previously they will be a more effective grappler\n\n1:01:40.660 --> 1:01:46.660\n These physical attributes have a very important outcome on the uh, sorry\n\n1:01:46.660 --> 1:01:49.220\n A very important effect upon the outcome of matches\n\n1:01:49.780 --> 1:01:54.100\n Um, it's always a good thing to be stronger. It's always a good thing to have better endurance\n\n1:01:54.100 --> 1:01:59.380\n It's always a good thing to have better balance or whatever other attribute you throw out there. Um\n\n1:02:00.100 --> 1:02:06.340\n Gordon's point was okay. Everyone agrees on that but there's a problem in order to build these things\n\n1:02:06.340 --> 1:02:13.480\n You have to carve into other elements of your training regimen and then it becomes well, which becomes more important\n\n1:02:14.340 --> 1:02:16.900\n increases in strength or increases in skill\n\n1:02:18.980 --> 1:02:20.980\n There comes a point where\n\n1:02:21.280 --> 1:02:24.820\n Investing in strength training starts to get diminishing returns\n\n1:02:25.460 --> 1:02:28.260\n I can't tell the difference between someone who bench presses\n\n1:02:28.820 --> 1:02:34.020\n 300 pounds on the mat versus someone who bench presses 400 pounds, but that's a big difference\n\n1:02:34.020 --> 1:02:39.460\n That's a hundred pound difference and for an athlete to go from bench pressing 300 pounds to 400 pounds\n\n1:02:39.700 --> 1:02:43.940\n That would require a great deal of uh of training effort and focus\n\n1:02:45.060 --> 1:02:48.180\n But if I can't tell the difference when I grapple and then why bother?\n\n1:02:48.580 --> 1:02:50.660\n Okay, once you get to a certain strength level\n\n1:02:51.220 --> 1:02:56.260\n It doesn't really help that much to go from a 400 pound bench press to a 450 pound bench press\n\n1:02:56.580 --> 1:03:01.000\n If that's the stage you you're really getting a diminishing in returns on your training investment\n\n1:03:01.000 --> 1:03:04.040\n um now skills on the other hand\n\n1:03:05.880 --> 1:03:12.200\n Experience far far less in terms of diminishing returns every new skill you develop\n\n1:03:13.000 --> 1:03:15.000\n can translate\n\n1:03:15.000 --> 1:03:20.200\n Very very well into big increases in performance. Look at the example of gary tonin that we talked about earlier\n\n1:03:20.820 --> 1:03:22.820\n investments in guillotine\n\n1:03:23.080 --> 1:03:29.740\n Made a significant improvement in his uh effectiveness in matches and led directly to some of his most important victories\n\n1:03:29.740 --> 1:03:31.740\n um\n\n1:03:31.820 --> 1:03:34.540\n But if he had invested the same amount of training time in\n\n1:03:35.000 --> 1:03:39.580\n Developing a bench press that was 25 pounds more than previously that would have had no outcome no\n\n1:03:40.220 --> 1:03:42.220\n Influence on the outcome of those matches\n\n1:03:42.620 --> 1:03:46.460\n So the question always becomes yep. Everyone acknowledges that these physical\n\n1:03:47.100 --> 1:03:47.980\n uh\n\n1:03:47.980 --> 1:03:56.460\n Attributes are important and everyone understands that becoming stronger or fitter is a desirable thing and every athlete should work on them\n\n1:03:56.460 --> 1:03:59.660\n The interesting question becomes okay at what point?\n\n1:04:00.220 --> 1:04:04.400\n Do you start to say i'm not going to be helped by further increases?\n\n1:04:05.740 --> 1:04:09.180\n in in strength training or endurance training, um\n\n1:04:09.660 --> 1:04:15.100\n And my point with my athletes is in the overwhelming majority of cases\n\n1:04:16.060 --> 1:04:21.500\n If there's any kind of doubt invest more heavily in skill training than attribute training\n\n1:04:21.820 --> 1:04:24.460\n Especially once you get to a certain level on the attributes\n\n1:04:24.460 --> 1:04:29.100\n Well, the interesting thing that I think you should account for with strength training\n\n1:04:29.740 --> 1:04:31.660\n is um\n\n1:04:31.660 --> 1:04:33.660\n There's instagram\n\n1:04:33.740 --> 1:04:39.020\n There's the world. It's uh, it seems to be more fun to build muscle mass\n\n1:04:39.660 --> 1:04:43.500\n Um, it's like an addiction that people have there's also economic elements too\n\n1:04:43.660 --> 1:04:49.740\n Like most people I I hate to say this but it's true. Most people are more concerned with image\n\n1:04:50.380 --> 1:04:52.780\n than function and uh\n\n1:04:52.780 --> 1:04:54.940\n Uh, it's hard to sell\n\n1:04:56.540 --> 1:05:01.580\n A fighter or a jiu jitsu athlete who doesn't look like one looks like fedor\n\n1:05:01.900 --> 1:05:03.900\n Yeah, it's a tough sell now\n\n1:05:04.140 --> 1:05:09.500\n You can do it in fighting and jiu jitsu because ultimately it's about whose hand is raised at the end of the match\n\n1:05:09.740 --> 1:05:11.420\n And you could even use it as a selling point\n\n1:05:11.420 --> 1:05:15.660\n You can be a guy that doesn't look like he should be winning but he is winning that is a selling point\n\n1:05:15.980 --> 1:05:18.380\n but if you give most people a choice between\n\n1:05:18.380 --> 1:05:25.180\n Looking like arnold schwarzenegger and winning matches versus looking like fedor and when he matches most people will select\n\n1:05:25.340 --> 1:05:27.340\n I wish I'd rather look like arnold schwarzenegger\n\n1:05:27.980 --> 1:05:35.120\n And so most athletes feel almost like an economic compulsion to be in good shape and in order to advance their marketability\n\n1:05:36.460 --> 1:05:41.260\n Yeah, nike's not going to sponsor fedor or tank abbott. Yeah tank abbott\n\n1:05:41.820 --> 1:05:42.860\n No\n\n1:05:42.860 --> 1:05:44.700\n Fedor, maybe\n\n1:05:44.700 --> 1:05:48.380\n Yeah, yeah, we need at the very top. There's there's something about uh aesthetic\n\n1:05:49.660 --> 1:05:55.580\n Like image of strength and power. It's also and also a personal thing if you look at yourself in the mirror\n\n1:05:56.060 --> 1:06:00.300\n Do you like what what you see? You know what I mean? Yeah, you find yourself attractive\n\n1:06:00.380 --> 1:06:02.620\n You know, what what can you do to make you look better?\n\n1:06:02.700 --> 1:06:07.340\n And I think to me to me it was something that one of the reason I work out it's also for for that\n\n1:06:07.820 --> 1:06:11.180\n Well, i'm sure if fedor looks in the mirror. He says I look damn good today\n\n1:06:11.180 --> 1:06:17.660\n Yeah, you could be too. It's also a genetic factor some people, you know, it's harder for them. I mean, yeah\n\n1:06:18.380 --> 1:06:23.500\n All right. So the question on training you guys john gordon train\n\n1:06:24.620 --> 1:06:26.620\n Often three times a day every day\n\n1:06:27.820 --> 1:06:31.340\n um, georgia had a different like, um\n\n1:06:32.540 --> 1:06:35.340\n a different approach to training so like what is uh\n\n1:06:35.740 --> 1:06:40.140\n For for no, I don't mean that in a kind of the opposite or something. It's just not every single day\n\n1:06:40.140 --> 1:06:41.340\n so\n\n1:06:41.340 --> 1:06:43.340\n and obviously you are\n\n1:06:44.060 --> 1:06:46.060\n legitimately at the very top\n\n1:06:46.540 --> 1:06:51.500\n Uh in terms of performance accomplishment in the field. So what have you learned about?\n\n1:06:53.020 --> 1:06:58.940\n What it takes to train to become not just the lead but the best well, I I um\n\n1:07:00.060 --> 1:07:06.540\n A lot of people when you say train they they see training hard. I believe you need to be very constant\n\n1:07:06.540 --> 1:07:12.620\n Uh, and uh, very disciplined you need to train but you don't need to train hard every day\n\n1:07:12.940 --> 1:07:14.940\n That's what john, uh taught me\n\n1:07:15.500 --> 1:07:16.460\n um\n\n1:07:16.460 --> 1:07:22.380\n For me is the nervous system. Sometimes I feel if I load it up too much it comes to a point that you're\n\n1:07:23.100 --> 1:07:27.260\n It's too much. There is no no more information that I can absorb\n\n1:07:27.820 --> 1:07:29.340\n so\n\n1:07:29.340 --> 1:07:37.340\n Uh, and I do believe that it's something that you can train to your the capacity your capacity of being able to learn of\n\n1:07:37.640 --> 1:07:39.640\n absorbing certain thing\n\n1:07:39.660 --> 1:07:43.900\n and uh, I did a lot of volume of training but when I when I\n\n1:07:44.460 --> 1:07:48.220\n Was getting ready for a fight, especially during sparring day\n\n1:07:48.780 --> 1:07:53.180\n I like to do it quick because my when I fight it's five round of five minutes\n\n1:07:53.820 --> 1:07:55.820\n I don't like to to spend\n\n1:07:56.060 --> 1:07:58.060\n um\n\n1:07:58.060 --> 1:08:01.820\n uh an hour or two hours in a gym because\n\n1:08:02.780 --> 1:08:05.020\n I need to know how hard I can be\n\n1:08:05.660 --> 1:08:11.580\n Going for 25 minutes, you know when I not for two hours for 25 minutes and at my last fight\n\n1:08:12.700 --> 1:08:14.700\n john and I we we we\n\n1:08:15.820 --> 1:08:17.900\n We were thinking of how could we\n\n1:08:19.100 --> 1:08:20.460\n make me more\n\n1:08:20.460 --> 1:08:21.580\n uh\n\n1:08:21.580 --> 1:08:24.300\n Of a better finisher, you know more opportunists\n\n1:08:24.300 --> 1:08:29.900\n And then john I remember we we when we were training with gordon jake shill came gary tonin\n\n1:08:30.940 --> 1:08:35.500\n my round of grappling were different than if I would be training for uh\n\n1:08:36.220 --> 1:08:41.900\n Abu dhabi, you know for for abi or like some like in grappling the round or longer but\n\n1:08:42.940 --> 1:08:44.940\n in a mixed martial art fight\n\n1:08:45.500 --> 1:08:47.580\n it's very rare that you're gonna spend\n\n1:08:48.140 --> 1:08:50.140\n more than\n\n1:08:50.140 --> 1:08:55.820\n Four minutes or four minutes and a half on the ground. It's it's very unlikely. I mean it could it can happen but\n\n1:08:56.380 --> 1:08:57.180\n so\n\n1:08:57.180 --> 1:08:57.900\n I\n\n1:08:57.900 --> 1:09:03.020\n Do you remember we did the round three minutes? We did all the round I was doing were three minute round\n\n1:09:03.340 --> 1:09:05.340\n So it gives a different\n\n1:09:05.420 --> 1:09:09.840\n Uh rhythm to the training it forced me to be more opportunist\n\n1:09:10.460 --> 1:09:14.940\n To be more of a finisher because I had only three minutes to to do what I needed to do\n\n1:09:14.940 --> 1:09:20.060\n So if I if I see something I need to to go for the kill right away. I cannot be too over patient\n\n1:09:20.140 --> 1:09:21.580\n You know what? I mean?\n\n1:09:21.580 --> 1:09:26.860\n And it it served me well in my last fight and I think it that's a good blueprint to follow\n\n1:09:27.900 --> 1:09:30.860\n um when you're a mixed martial art fighter, I if I would if\n\n1:09:32.220 --> 1:09:34.220\n the result was great and I think\n\n1:09:36.220 --> 1:09:40.460\n Maybe I should have done that before it was a great great idea that we had not to do\n\n1:09:41.020 --> 1:09:43.100\n Be very careful on doing too much volume\n\n1:09:43.100 --> 1:09:48.460\n Yes, try to get out and then try to focus on finishing and getting getting out as quickly as possible\n\n1:09:49.020 --> 1:09:52.780\n To build up your foundation. I believe you need a lot of volume\n\n1:09:52.860 --> 1:09:58.000\n But when you get ready for a competition, you need some to be something that replicate\n\n1:09:58.700 --> 1:10:02.620\n What you're gonna be facing? What do you what are we talking about? What do you think?\n\n1:10:03.180 --> 1:10:05.580\n Like is there rest days five days a week?\n\n1:10:06.140 --> 1:10:09.660\n Twice a day once a day. Is there any one formula like that? I don't know\n\n1:10:09.660 --> 1:10:13.740\n This this I don't I do not believe in overtraining. I believe in under arrest\n\n1:10:14.940 --> 1:10:16.940\n I believe\n\n1:10:17.660 --> 1:10:19.820\n You can be under arrest and\n\n1:10:20.540 --> 1:10:21.900\n people\n\n1:10:21.900 --> 1:10:27.500\n Always link that immediately to the volume of their how much volume they they train\n\n1:10:27.980 --> 1:10:33.740\n Which it could be something else. How are you feeling? I'm emotionally. Are you you having uh,\n\n1:10:33.740 --> 1:10:41.420\n Problems, uh personal problem. Do you have a have a hard time sleeping because you have a like someone died or I don't know\n\n1:10:41.420 --> 1:10:45.580\n Like you you hold money you're broke or what like, you know what I mean could be anything\n\n1:10:46.860 --> 1:10:50.460\n There is something that can affect you psychologically or emotionally\n\n1:10:51.420 --> 1:10:57.420\n That made it in a way that you cannot sleep. Well because your your stress your cortisol level is high\n\n1:10:57.420 --> 1:11:04.460\n You're you know what? I mean all these factors need to be take taken in consideration. It's not only about the volume of training people\n\n1:11:05.100 --> 1:11:06.300\n always think\n\n1:11:06.300 --> 1:11:10.460\n The volume of the training is the only thing that can affect\n\n1:11:11.000 --> 1:11:16.460\n Recuperation which is not you know. Yeah, you have to minimize the amount of stress from all kinds of factors\n\n1:11:16.460 --> 1:11:19.580\n It's a very stressful job to be a professional\n\n1:11:19.580 --> 1:11:26.300\n combat athlete whether you're a grappler a boxer a kickboxer a fighter and you need to be taking\n\n1:11:27.100 --> 1:11:28.300\n as a\n\n1:11:28.300 --> 1:11:31.980\n Into account is it more or less stressful than marriage? Just kidding\n\n1:11:33.180 --> 1:11:35.180\n Uh next question, uh\n\n1:11:37.260 --> 1:11:43.020\n So, I don't know how to ask this question given what george just said but you're training three times a day\n\n1:11:45.020 --> 1:11:47.020\n And finishing\n\n1:11:47.020 --> 1:11:52.700\n And what what have you learned about what what brings out the best in you as as the elite level grappler?\n\n1:11:53.420 --> 1:11:56.540\n Um, so over the recent years have actually changed it up a little bit\n\n1:11:57.100 --> 1:11:59.100\n um when I was\n\n1:11:59.180 --> 1:12:01.820\n Coming up through from white to black belt\n\n1:12:02.460 --> 1:12:08.300\n Uh, I felt that the volume was the most important so it would be anywhere from like three\n\n1:12:09.100 --> 1:12:11.100\n To seven sessions a day\n\n1:12:11.100 --> 1:12:17.740\n Um going from school to school from new york to new jersey. Um, and I think that the volume was very important to build the skills\n\n1:12:19.180 --> 1:12:21.180\n um where I just\n\n1:12:21.180 --> 1:12:25.980\n Didn't know how to move my body at purple belt the way that I should. Um, so I think that building the skills\n\n1:12:26.540 --> 1:12:30.620\n Is uh is super important. I think that early on volume is very important\n\n1:12:31.180 --> 1:12:35.980\n Uh now that I already have the skills built. I think that acquiring more knowledge is the most important\n\n1:12:36.620 --> 1:12:38.940\n Um, so I think that the volume is the most important\n\n1:12:38.940 --> 1:12:42.460\n Is the most important um, so I find that if I do\n\n1:12:43.180 --> 1:12:46.140\n So many sessions a day like if I do three sessions a day\n\n1:12:46.540 --> 1:12:53.020\n Um, I feel sometimes by the third session i'm just like so mentally like there's just there's so much information\n\n1:12:53.020 --> 1:12:57.500\n That's went through my head the first two sessions that I feel like i'm not even there mentally on the third session\n\n1:12:57.900 --> 1:13:01.020\n Um, so I feel like doing less volume now\n\n1:13:01.260 --> 1:13:07.100\n But having more mental clarity per session is more important because I already have the foundational skills acquired\n\n1:13:07.100 --> 1:13:09.100\n So a lot of your training is almost like\n\n1:13:09.740 --> 1:13:13.980\n Just thinking like learning a lot of it. Yeah, so i'll do like\n\n1:13:14.220 --> 1:13:18.140\n I mean our schedule has been messed up since the pandemic because henzos got shut down\n\n1:13:18.460 --> 1:13:23.340\n And they were using a french gym in puerto rico and now we're using a french gym in our and in austin\n\n1:13:23.820 --> 1:13:25.180\n Um, but once we have our own school\n\n1:13:25.180 --> 1:13:28.220\n We'll have a setup schedule where I can pretty much just be there all day long\n\n1:13:28.620 --> 1:13:32.460\n But right now I do like a lifting session in the morning and then i'll come in and help teach\n\n1:13:32.460 --> 1:13:38.300\n At henzos, so i'm there mentally i'm seeing what's going on and i'm playing around with ideas in my head\n\n1:13:38.860 --> 1:13:43.900\n Uh, and then i'm there physically and very sharp mentally for the competition class during the 1 p.m\n\n1:13:44.300 --> 1:13:48.140\n Session and then after that i'll go home i'll rest and get ready for the next day\n\n1:13:51.100 --> 1:13:54.140\n What have you learned on seeing all these different athletes is there a\n\n1:13:54.780 --> 1:14:01.020\n A universal rule that applies or is it um, athlete specific? Yeah, uh, first one thing\n\n1:14:01.020 --> 1:14:08.060\n It needs to be addressed is that george and gordon play very different sports with very different athletic demands\n\n1:14:09.260 --> 1:14:12.860\n Gordon can be in matches that range from anywhere from six\n\n1:14:13.500 --> 1:14:15.980\n minutes to literally hours long\n\n1:14:16.540 --> 1:14:19.740\n um as a result, uh the overall\n\n1:14:20.940 --> 1:14:28.060\n Pacing and intensity of matches is massively different most obviously there is no striking in gordon's sport\n\n1:14:28.060 --> 1:14:35.840\n Um striking by its very nature is a much more explosive physical action than grappling is grappling is primarily an isometric\n\n1:14:36.460 --> 1:14:39.980\n kind of uh sport based around isometric tension and endurance\n\n1:14:40.540 --> 1:14:42.540\n um george's sport is\n\n1:14:43.660 --> 1:14:46.860\n It does feature a significant amount of isometric tension, but\n\n1:14:47.500 --> 1:14:52.940\n The majority of it is based around explosion. So the physical demands of the two sports are radically different\n\n1:14:52.940 --> 1:14:58.380\n different in addition the time of application is is radically different\n\n1:14:58.780 --> 1:15:03.980\n George raised a very interesting point his matches seem long 25 minutes for a championship match\n\n1:15:04.620 --> 1:15:06.620\n Um, but always understand it\n\n1:15:07.900 --> 1:15:09.900\n It makes martial arts fight\n\n1:15:10.060 --> 1:15:11.820\n at championship level\n\n1:15:11.820 --> 1:15:13.820\n if it goes the distance is really\n\n1:15:14.780 --> 1:15:17.740\n five five minute matches each round\n\n1:15:17.740 --> 1:15:24.860\n Is a match in itself and that's exactly how you're scored. You're scored by who wins the most matches over five matches\n\n1:15:25.420 --> 1:15:33.260\n As a result the application of the techniques, especially the grappling techniques has to be done at a certain pace as george pointed out\n\n1:15:33.660 --> 1:15:34.940\n realistically\n\n1:15:34.940 --> 1:15:39.260\n the maximum application time you're going to get in most situations is somewhere between\n\n1:15:40.700 --> 1:15:42.860\n 15 seconds and three minutes\n\n1:15:42.860 --> 1:15:48.540\n Even for a specialized grappler like damien meyer. There's still a significant part of each round which is\n\n1:15:48.940 --> 1:15:52.860\n Spent in set up time to actually get the match to the ground\n\n1:15:53.420 --> 1:15:59.740\n Um, it's very likely that at some point your opponent will stand up out of grappling and you'll have to reinitiate the entire process again\n\n1:16:00.140 --> 1:16:06.460\n So that even for specialized grapplers, you might be spending only three minutes out of a five minute round\n\n1:16:06.460 --> 1:16:12.860\n Uh on the ground and as a result, you've got to get your work done in a very short time frame\n\n1:16:13.500 --> 1:16:14.940\n gordon ryan\n\n1:16:14.940 --> 1:16:18.540\n Once it goes to the ground and it can go to the ground because he chooses to sit to the ground\n\n1:16:19.740 --> 1:16:24.140\n Uh may spend the entire match in ground positions. Um\n\n1:16:25.500 --> 1:16:33.020\n As a result the matches have completely different pacing and completely different physical demands and the preparation that the two athletes go through will reflect that\n\n1:16:33.020 --> 1:16:38.380\n If george saint pierre in training for mixed martial arts becomes fatigued to a point\n\n1:16:39.020 --> 1:16:46.220\n Where he's no longer physically effective and able to defend himself the consequences for that in mma training can be very deep and deep\n\n1:16:47.180 --> 1:16:53.500\n Okay, if you make a mistake in mixed martial arts because you're fatigued and tired and you take a full power roundhouse kick to the head\n\n1:16:54.540 --> 1:16:59.500\n That's some deep consequences. A grappler doesn't have to face that you can be completely\n\n1:16:59.500 --> 1:17:03.420\n Exhausted and grappling and just sit in the bottom of the mountain. Just practice just survival skills\n\n1:17:03.580 --> 1:17:07.500\n We just don't get submitted from bottom out and that can still be an effective training session\n\n1:17:08.380 --> 1:17:11.580\n complete and utter physical breakdown and fatigue can be\n\n1:17:12.940 --> 1:17:15.420\n Can end an athlete's career in mixed martial arts\n\n1:17:16.140 --> 1:17:18.140\n the consequences of\n\n1:17:18.460 --> 1:17:20.460\n training through fatigue and mma\n\n1:17:21.580 --> 1:17:23.580\n Potentially very deep and very disturbing\n\n1:17:23.580 --> 1:17:29.500\n Um, the consequences of training through complete physical exhaustion and grappling aren't really that severe\n\n1:17:30.060 --> 1:17:32.060\n Okay, you just tap whenever there's a problem just tap\n\n1:17:32.620 --> 1:17:37.660\n Um, and so they're very very different sports in the way you you prepare for them\n\n1:17:39.260 --> 1:17:41.260\n And a grappling\n\n1:17:41.260 --> 1:17:43.260\n Athlete like gordon ryan, we can take\n\n1:17:44.060 --> 1:17:49.420\n Many more liberties with physical exhaustion and the amount of hours a day you spend training\n\n1:17:49.420 --> 1:17:54.860\n Than you could with a mixed martial arts athlete like that should be a benefit. Uh exhaustion as a\n\n1:17:55.820 --> 1:17:59.980\n As a framework of learning so like from a place of exhaustion\n\n1:18:00.540 --> 1:18:05.820\n Is there any benefit to the you on the you said being at the bottom of mouth sort of understanding?\n\n1:18:06.540 --> 1:18:10.380\n Jiu jitsu or grappling somehow deeper because you're physically absolutely\n\n1:18:10.780 --> 1:18:15.900\n Absolutely, because then the only thing you have left in your favor is the training and the training\n\n1:18:15.900 --> 1:18:22.140\n Absolutely, because then the only thing you have left in your favor is your technique and then you'll see how technical you are\n\n1:18:22.540 --> 1:18:28.300\n In addition you'll get to explore realms inside your mind that we don't spend a lot of time in\n\n1:18:28.860 --> 1:18:32.540\n And you'll learn a lot about yourself and your ability to endure which will\n\n1:18:33.340 --> 1:18:34.780\n have uh\n\n1:18:34.780 --> 1:18:41.100\n Potentially great benefits in similar situations and matches. Yeah, there's uh, I mean for me for a recreational person\n\n1:18:42.220 --> 1:18:43.720\n getting\n\n1:18:43.720 --> 1:18:48.540\n Exhaustion allows you the great benefit to experience what it feels like to really get dominated\n\n1:18:49.340 --> 1:18:52.300\n At an even greater frequency than you otherwise would\n\n1:18:53.500 --> 1:18:57.100\n And there's something there. There's some animalistic thing. That's very unpleasant\n\n1:18:57.740 --> 1:19:00.700\n and then afterwards it takes you to a nice to a place of\n\n1:19:01.580 --> 1:19:03.580\n like, um humility and\n\n1:19:04.540 --> 1:19:07.180\n I don't know you get it forces you to rethink life\n\n1:19:08.060 --> 1:19:09.660\n in positive ways\n\n1:19:09.660 --> 1:19:16.780\n There's something about dominance. It can mean if you get dominated a few times you can uh, rationalize it somehow\n\n1:19:17.260 --> 1:19:17.900\n You say okay\n\n1:19:17.900 --> 1:19:19.340\n Well, I screwed this up\n\n1:19:19.340 --> 1:19:25.100\n But with when you're exhausted and you have to do like 30 minutes or 40 minutes or an hour of just being dominant\n\n1:19:25.100 --> 1:19:27.100\n Over and over and over being submitted\n\n1:19:27.980 --> 1:19:30.860\n It uh, I don't know. It's it's a very good process for\n\n1:19:32.300 --> 1:19:37.820\n For other avenues of life I find it's I can't explain why because i'm i'm\n\n1:19:37.820 --> 1:19:44.060\n uh driving home crying afterwards listening to bruce springsteen, but afterwards\n\n1:19:45.260 --> 1:19:46.940\n yeah, this\n\n1:19:46.940 --> 1:19:53.260\n Afterwards somehow you can think clearer you can see clear about what is the right path through life in all walks of life\n\n1:19:53.580 --> 1:19:57.020\n Like relationships work, but also the grappling\n\n1:19:57.740 --> 1:20:00.300\n Actually, the grappling is the hardest one to see what you have to do\n\n1:20:01.660 --> 1:20:05.820\n It clarifies other avenues the humility. It's the it removes the bullshit\n\n1:20:05.820 --> 1:20:07.820\n It's like we see\n\n1:20:07.820 --> 1:20:13.500\n The world through some kind of fog and it just removes it and now you can see things clearly. I don't know what that is\n\n1:20:14.220 --> 1:20:18.220\n I think I think it's important like you mentioned to push yourself like sometimes\n\n1:20:18.940 --> 1:20:20.140\n to see\n\n1:20:20.140 --> 1:20:25.980\n How far you can go because sometimes you you can go further than where you think and it can boost your confidence\n\n1:20:25.980 --> 1:20:28.540\n You know, you can push yourself through a certain limit\n\n1:20:29.100 --> 1:20:33.660\n And maybe you thought your limit were was before that point and you push through it\n\n1:20:33.660 --> 1:20:35.660\n But like john just mentioned\n\n1:20:36.300 --> 1:20:38.300\n It's a risky thing to do in\n\n1:20:38.920 --> 1:20:42.620\n Striking because if you're exhausted you're gonna get brain damage\n\n1:20:43.180 --> 1:20:48.620\n In grappling it's you know, you tap if something wrong, but you can do it also in strength conditioning\n\n1:20:48.700 --> 1:20:51.500\n I like to run track. I do it all the time and track and feel\n\n1:20:52.220 --> 1:20:54.220\n it it helps me to\n\n1:20:54.300 --> 1:20:58.620\n To to know myself better. I think it's important. It's a it's a good point\n\n1:20:58.620 --> 1:21:02.540\n It's like it's like the scrimmage wrestling rounds we do. It's like, you know, if you stop moving\n\n1:21:03.340 --> 1:21:07.900\n That you're gonna get scored on and you know in your mind like there's no mechanical reason\n\n1:21:08.380 --> 1:21:13.900\n Why I am why I should give up a score here, but you're so exhausted that you're like, oh man, this is terrible\n\n1:21:14.140 --> 1:21:16.140\n If I if I stop moving i'm a pussy\n\n1:21:17.660 --> 1:21:21.660\n If I don't stop move if I don't stop moving i'm gonna be twice as exhausted when we actually do stand up\n\n1:21:21.660 --> 1:21:25.100\n So it's uh, it's an interesting game. You have to play inside your mind. It's it's your\n\n1:21:25.100 --> 1:21:31.260\n That keep you that keep you uh sharp, you know what I mean? Because you just want to lay down and beat it\n\n1:21:31.820 --> 1:21:34.220\n Because you're completely exhausted, you know\n\n1:21:35.180 --> 1:21:40.380\n What do you think uh is the connection john between this ego pride thing?\n\n1:21:41.000 --> 1:21:46.780\n Martial arts and actual violence in our with our ancestors. Do you think\n\n1:21:47.580 --> 1:21:50.300\n You ever plug into that? Do you think that's a good thing?\n\n1:21:50.300 --> 1:21:54.460\n With our ancestors. Do you think you ever plug into that?\n\n1:21:54.700 --> 1:21:59.340\n You think there's echoes of something going on there or like you mentioned you have flaws and demons\n\n1:22:00.140 --> 1:22:04.060\n Is it deep in there somewhere? Do you think we're struggling with those demons?\n\n1:22:04.860 --> 1:22:10.620\n Yeah, uh, you'll need to patch up your question a little bit though. It's going to say we're different donations. Wow, that was\n\n1:22:11.500 --> 1:22:15.900\n Not only might be dominating just I mean dominating interviewing. No, no, no, but i'm not\n\n1:22:15.900 --> 1:22:20.620\n Patched up that question. Uh, it's not brother seeing where they're like, okay now we interview you\n\n1:22:21.420 --> 1:22:23.420\n But you you went down the evolution\n\n1:22:24.700 --> 1:22:31.340\n I mean, do you think do you um, I don't mean just the line between what is what is martial arts and what is violence?\n\n1:22:31.420 --> 1:22:33.660\n I mean there there seems to be a gray area\n\n1:22:34.220 --> 1:22:41.020\n And that connects us to the the evolutionary ancestors. Absolutely. Yeah. Yeah. I mean, I I think there's a deep\n\n1:22:42.280 --> 1:22:44.380\n recognition in all of us that\n\n1:22:44.380 --> 1:22:46.380\n um, and this is\n\n1:22:46.860 --> 1:22:52.540\n The evidence for this is is so easy to uh to see in in in daily life. Um\n\n1:22:54.700 --> 1:22:59.580\n If you're walking down the street and suddenly you hear a commotion and two people are fighting\n\n1:23:01.180 --> 1:23:08.140\n You will see literally everyone on that street stop whatever they're doing and watch the fight\n\n1:23:08.140 --> 1:23:13.580\n Humans are fascinated by violence\n\n1:23:14.380 --> 1:23:22.700\n And you've got to ask yourself why and of course, it's a recognition that for a significant part of our evolutionary history\n\n1:23:23.580 --> 1:23:28.300\n Violence was one of the most important elements in human existence\n\n1:23:29.100 --> 1:23:34.060\n As much as we curse it as much as we talk badly of it. Um\n\n1:23:34.060 --> 1:23:43.020\n Um, the juxtaposition between humans social nature and their their need to for each other to get along and to express\n\n1:23:43.500 --> 1:23:45.100\n love amongst the\n\n1:23:45.100 --> 1:23:47.100\n the various members of a given community\n\n1:23:47.820 --> 1:23:49.660\n there are\n\n1:23:49.660 --> 1:23:52.940\n Disputes between humans that can't be resolved and ultimately\n\n1:23:53.740 --> 1:23:56.700\n throughout history violence has been the number one method of\n\n1:23:57.900 --> 1:23:59.660\n conflict resolution\n\n1:23:59.660 --> 1:24:04.860\n um for better or for worse and there's a recognition in all of us that\n\n1:24:06.060 --> 1:24:09.180\n This is where we come from and there's a reason why\n\n1:24:10.300 --> 1:24:12.300\n combat sports have this\n\n1:24:12.620 --> 1:24:13.740\n thing where\n\n1:24:13.740 --> 1:24:18.860\n People will watch them and they might even be repulsed by them, but they find it difficult to take their eyes from it\n\n1:24:19.500 --> 1:24:21.500\n and um, uh\n\n1:24:22.940 --> 1:24:26.860\n I do believe that most combat athletes carry that sense\n\n1:24:27.660 --> 1:24:29.180\n of their\n\n1:24:29.180 --> 1:24:32.860\n even if it's on a subconscious level this kind of belief that\n\n1:24:34.140 --> 1:24:41.340\n This is who we are. Um george used the word pride and I believe that's a big part of it. I believe that um,\n\n1:24:43.500 --> 1:24:44.860\n Most\n\n1:24:44.860 --> 1:24:48.860\n Humans have this sense of self worth and pride which they're willing to fight for\n\n1:24:49.420 --> 1:24:53.260\n And uh, if it gets crossed by someone else they're willing to stand that\n\n1:24:54.060 --> 1:24:58.460\n Some people will stand more early and some people will be pushed further back, but everyone's got that\n\n1:24:58.460 --> 1:25:01.260\n That line beyond which they won't be pushed\n\n1:25:01.820 --> 1:25:06.540\n And there's some kind of deep recognition in all of us that we have that somewhere within us\n\n1:25:07.020 --> 1:25:09.580\n No matter how hard we try to bury it or what have you\n\n1:25:10.140 --> 1:25:12.640\n And that's why I believe there will always be this eternal\n\n1:25:13.260 --> 1:25:15.260\n interest in combat sports\n\n1:25:17.340 --> 1:25:18.460\n Now\n\n1:25:18.460 --> 1:25:24.620\n I don't believe that most people today have any kind of respect for unrestricted violence or\n\n1:25:25.240 --> 1:25:27.240\n non consensual violence\n\n1:25:27.240 --> 1:25:31.880\n um, I think most people most good people are repulsed by that now i'm\n\n1:25:32.520 --> 1:25:34.520\n I'm sure that as humanity\n\n1:25:35.000 --> 1:25:37.900\n Improves out into the future that will become more and more widespread\n\n1:25:39.000 --> 1:25:40.120\n but\n\n1:25:40.120 --> 1:25:43.480\n That's not to say we we can't exercise these these\n\n1:25:44.520 --> 1:25:49.560\n old evolutionary demons inside of us and um, uh and\n\n1:25:50.360 --> 1:25:55.480\n sometimes there are just disputes between different people different cultures different nations where\n\n1:25:55.480 --> 1:25:57.480\n ultimately it's going to come to\n\n1:25:58.520 --> 1:26:03.000\n Into into a shoving match and that will degenerate further into violence. There's always going to be\n\n1:26:03.640 --> 1:26:05.640\n a need for humans to be able to\n\n1:26:06.600 --> 1:26:07.720\n to\n\n1:26:07.720 --> 1:26:09.720\n express themselves\n\n1:26:09.800 --> 1:26:14.620\n Through violent methods and to use physical force to get to their their goals and objectives\n\n1:26:15.640 --> 1:26:16.760\n um\n\n1:26:16.760 --> 1:26:18.600\n our\n\n1:26:18.600 --> 1:26:22.040\n Our need as humans is always to find a balance between\n\n1:26:22.040 --> 1:26:25.500\n The two forces of conflict and cooperation\n\n1:26:26.040 --> 1:26:31.480\n We need cooperation because humans isolated from each other are more or less helpless and useless\n\n1:26:32.360 --> 1:26:34.360\n uh in order to\n\n1:26:34.360 --> 1:26:37.400\n advance human communities need to build and grow\n\n1:26:37.880 --> 1:26:40.120\n And so that sense of cooperation\n\n1:26:40.680 --> 1:26:42.680\n occurs in most of our daily lives\n\n1:26:43.160 --> 1:26:49.800\n But there will also be irresolvable conflicts where physical force has to be used to to form a resolution\n\n1:26:49.800 --> 1:26:52.940\n more resolution and so most human beings find themselves\n\n1:26:53.640 --> 1:26:56.380\n swinging like a pendulum between conflict and cooperation\n\n1:26:57.320 --> 1:27:01.240\n and um, uh, and that is something which\n\n1:27:02.760 --> 1:27:09.880\n Really gives birth I think to combat sports because sorry. I really have to ask you about this then. There's a guy even harvard\n\n1:27:10.440 --> 1:27:12.440\n uh named richard rangham\n\n1:27:12.680 --> 1:27:16.360\n And there's a lot of people that believe this he wrote this book that um\n\n1:27:16.360 --> 1:27:21.960\n Um, basically, there's a lot of people studying is what happened? How did we get from apes to humans?\n\n1:27:21.960 --> 1:27:27.240\n Like what was the magic thing? Right a lot of people attributed to fire and ability to cook meat\n\n1:27:28.040 --> 1:27:29.960\n There's a lot of different theories\n\n1:27:29.960 --> 1:27:30.920\n so\n\n1:27:30.920 --> 1:27:32.920\n he actually um\n\n1:27:34.680 --> 1:27:36.360\n His theory\n\n1:27:36.360 --> 1:27:39.960\n How do I describe this is basically that that the beta males won?\n\n1:27:41.240 --> 1:27:43.240\n that the the\n\n1:27:43.240 --> 1:27:44.200\n the\n\n1:27:44.200 --> 1:27:51.800\n Apes that were able to cooperate so you though the way you develop cooperation is that there's a big bad leader\n\n1:27:52.920 --> 1:27:55.080\n that uh, the the alpha male\n\n1:27:55.960 --> 1:27:57.640\n that you can only\n\n1:27:57.640 --> 1:28:00.840\n um knock off their throne if you cooperate\n\n1:28:01.320 --> 1:28:07.960\n And so we build big tribes that just excel the cooperation by practicing the overthrowing the leader\n\n1:28:07.960 --> 1:28:13.880\n and so and anytime an alpha male would rise up they would get would we would uh\n\n1:28:13.880 --> 1:28:16.440\n Develop our skill further and further of cooperation\n\n1:28:16.920 --> 1:28:21.160\n And so we're all just beta males, uh, the descendants of beta males\n\n1:28:21.160 --> 1:28:27.480\n that's this uh kind of theory that cooperation is fundamental and it's so distinct to the the rest of the\n\n1:28:28.120 --> 1:28:30.120\n neighboring animal kingdom\n\n1:28:30.360 --> 1:28:35.000\n So fascinating. I wonder what you think about this tension of violence of cooperation\n\n1:28:35.000 --> 1:28:41.480\n And how important is this cooperation to the core of yeah, uh who if you you can look at it in the uh,\n\n1:28:42.120 --> 1:28:44.120\n in a given training room, um\n\n1:28:45.000 --> 1:28:50.920\n Jiu jitsu and mixed martial arts is solo sports a solo athlete steps into the cage or steps onto the mat\n\n1:28:51.480 --> 1:28:57.400\n but all of your preparation is done in a cooperative training environment with many peers and\n\n1:28:58.200 --> 1:29:00.760\n Uh as much as it's an individual sport\n\n1:29:00.760 --> 1:29:04.840\n All of your preparation is done in as part of a group. Um\n\n1:29:07.000 --> 1:29:09.000\n There's a sense in which uh\n\n1:29:09.080 --> 1:29:15.320\n That's an interesting metaphor for humanity itself everything we do in life. We do alone, but we grow up in this\n\n1:29:15.960 --> 1:29:17.960\n Given community and and what have you?\n\n1:29:18.520 --> 1:29:20.520\n um\n\n1:29:21.880 --> 1:29:26.600\n With regards to the the whole alpha male beta male thing, um\n\n1:29:26.600 --> 1:29:31.400\n Humans are it's true. This fellow's correct. We you know, most\n\n1:29:31.960 --> 1:29:40.840\n Primates do have very strongly defined alpha males who rule the roost and determine the entire direction of the um, uh,\n\n1:29:41.400 --> 1:29:43.400\n of of uh\n\n1:29:43.720 --> 1:29:46.140\n The community they they build around themselves\n\n1:29:46.680 --> 1:29:48.440\n um\n\n1:29:48.440 --> 1:29:50.440\n Humans on the other hand\n\n1:29:50.440 --> 1:29:55.480\n Don't have an alpha male in that strict biological sense of someone who's\n\n1:29:55.480 --> 1:30:01.000\n Responsible for the next generation dominates all the female population, etc\n\n1:30:01.400 --> 1:30:09.000\n Physically dominates, but we do on the other hand have our own version of alpha males insofar as we have political and sociological\n\n1:30:09.320 --> 1:30:15.960\n Leaders who have a disproportionate impact on the direction of a of a community. Um\n\n1:30:17.400 --> 1:30:20.280\n uh, so was the cooperation allowed us to\n\n1:30:20.280 --> 1:30:26.920\n To have a greater scale of hierarchy with the alpha male on top or the alpha creature on top. Yeah. Yeah\n\n1:30:27.480 --> 1:30:29.480\n No, that's a fascinating theory\n\n1:30:31.320 --> 1:30:35.080\n In in nature, we're we're very weak as a species\n\n1:30:35.080 --> 1:30:40.600\n So we needed to cooperate cooperate in order to to evolve that I think\n\n1:30:41.400 --> 1:30:45.880\n Made us uh, the the top of the food chain if you look at um,\n\n1:30:45.880 --> 1:30:50.440\n Humanity in in nature, really the two things that seem to\n\n1:30:52.520 --> 1:30:57.080\n More than anything else determine whether or not a given human community will be\n\n1:30:58.100 --> 1:31:01.560\n Successful in a predatory world are numbers and technology\n\n1:31:02.520 --> 1:31:09.640\n Okay, the more your numbers increase and the the higher the technology of the weapons and support systems you have around you the more successful\n\n1:31:09.640 --> 1:31:11.640\n You'll be in a predatory world\n\n1:31:11.640 --> 1:31:17.480\n um, so it's not clear that just killing off the idea of an alpha male was the\n\n1:31:18.280 --> 1:31:22.440\n The the single biggest thing. Um, the rise of technology\n\n1:31:23.000 --> 1:31:25.000\n Uh and the growth of community\n\n1:31:25.080 --> 1:31:28.360\n After the imposition of language, these are other things that would have been\n\n1:31:28.920 --> 1:31:34.680\n Very very important factors and and humanity's rise george. You made an interesting point if you look at humans\n\n1:31:35.400 --> 1:31:37.400\n Just the raw material of humans. We're we're\n\n1:31:37.400 --> 1:31:43.960\n We're fucking pathetic. We did and a predatory animal kingdom. We're just the absolute bottom of the food chain\n\n1:31:44.920 --> 1:31:46.920\n Um, we don't have a single\n\n1:31:47.460 --> 1:31:48.840\n effective\n\n1:31:48.840 --> 1:31:51.960\n Weapon other than better than average endurance. That's about it\n\n1:31:52.600 --> 1:31:53.640\n um\n\n1:31:53.640 --> 1:31:58.680\n But you put us in a community who can talk to each other with language and give us the time\n\n1:31:59.320 --> 1:32:03.160\n To come up with technological advances such as metal\n\n1:32:03.160 --> 1:32:09.560\n um, and suddenly a human will go from no combat effectiveness in the animal kingdom to a\n\n1:32:10.280 --> 1:32:13.800\n A human armed with a simple metal tip spear can kill\n\n1:32:14.520 --> 1:32:16.520\n damn near any animal in the uh,\n\n1:32:16.920 --> 1:32:18.920\n In the animal kingdom and working as a group\n\n1:32:19.480 --> 1:32:26.040\n I'll beat your silver back. You know how i'll fight him in a deep water pool because he cannot swim\n\n1:32:26.120 --> 1:32:28.120\n So I don't have to touch him\n\n1:32:28.200 --> 1:32:29.720\n You'll be in a\n\n1:32:29.720 --> 1:32:35.240\n Because he cannot swim so I don't have to touch him you'll drown and I'll get him into the pool\n\n1:32:35.640 --> 1:32:42.120\n You know why because someone told me because we live in a community someone told me that information. So I know he passed it on to me\n\n1:32:42.680 --> 1:32:44.680\n Yeah, he taught you\n\n1:32:44.760 --> 1:32:49.880\n Well, you have to convince him to you have to somehow convince them to join you in the pool, which is very difficult\n\n1:32:50.760 --> 1:32:53.800\n It's very problem. Very very difficult. Um\n\n1:32:55.480 --> 1:32:56.600\n From a\n\n1:32:56.600 --> 1:33:00.200\n technical perspective john you've looked at\n\n1:33:00.360 --> 1:33:04.920\n Martial arts fighting in general and grappling. What's the difference between fighting and grappling?\n\n1:33:05.480 --> 1:33:07.480\n That's something i'd love to\n\n1:33:07.480 --> 1:33:13.660\n Ask all of you. Maybe john you can start like, um, well, uh when you talk about fighting you mean unrestricted\n\n1:33:14.760 --> 1:33:21.240\n Uh mma top type fighting. Yeah, it's funny. You said unrestricted mma type fight mma type fighting\n\n1:33:21.240 --> 1:33:27.240\n So there's there's this street fighting. Yep. Yeah, there's mma fighting and then there's grappling\n\n1:33:27.560 --> 1:33:31.960\n It's really the sport of grappling. You're saying okay. What's the difference between mma and grappling? Yes. Okay\n\n1:33:32.360 --> 1:33:38.120\n Um, see that would have been a much better question to ask. Um, well the uh, uh the single\n\n1:33:39.000 --> 1:33:42.360\n When you talk about grappling you're talking about jujitsu rules or yeah\n\n1:33:42.440 --> 1:33:48.600\n I mean you could maybe also mention different rule sets that somehow fundamentally challenge change the sport, you know\n\n1:33:48.600 --> 1:33:51.320\n Um in the sport of mixed martial arts\n\n1:33:51.880 --> 1:33:53.160\n uh\n\n1:33:53.160 --> 1:33:55.160\n You've got two\n\n1:33:55.640 --> 1:34:01.160\n Ways to inflict damage on the human body. You've you've got kinetic energy which is done through striking\n\n1:34:01.960 --> 1:34:04.520\n kicking knees elbows fists, um\n\n1:34:05.160 --> 1:34:06.680\n and you've got\n\n1:34:06.680 --> 1:34:10.280\n uh isometric tension used along the lines of\n\n1:34:11.240 --> 1:34:12.840\n lever and fulcrum\n\n1:34:12.840 --> 1:34:15.800\n Which can be used for strangulation and and joint breaking\n\n1:34:15.800 --> 1:34:17.720\n um\n\n1:34:17.720 --> 1:34:22.360\n In grappling you lose one of those you're no longer allowed to hurt your opponent with kinetic energy\n\n1:34:22.360 --> 1:34:25.240\n you can do it accidentally through a throw, but you're not allowed to just\n\n1:34:26.280 --> 1:34:29.800\n You know knock someone out with a throw in most grappling sports it can happen\n\n1:34:29.880 --> 1:34:33.240\n But it's relatively rare and it's it's not encouraged by the rule set\n\n1:34:33.880 --> 1:34:35.880\n so\n\n1:34:37.640 --> 1:34:40.920\n Yeah, you got close, um, uh, so\n\n1:34:40.920 --> 1:34:49.080\n So there's a sense in which in mixed martial arts you got twice as many problems to deal with and um, uh, and they occur\n\n1:34:49.720 --> 1:34:51.240\n in\n\n1:34:51.240 --> 1:34:57.480\n A much shorter time frame the single biggest difference between grappling technique as a weapon\n\n1:34:58.200 --> 1:35:01.160\n In human combat versus striking technique is time\n\n1:35:01.800 --> 1:35:05.080\n Grappling technique takes a huge amount of time to apply\n\n1:35:05.640 --> 1:35:06.440\n Okay\n\n1:35:06.440 --> 1:35:10.680\n The great advantage of grappling technique is certainty of outcome once you get there\n\n1:35:11.720 --> 1:35:15.320\n It takes a huge amount of time to set up a takedown\n\n1:35:16.200 --> 1:35:18.200\n Physically take them down\n\n1:35:18.280 --> 1:35:24.920\n Work their way work your way towards a dominant position culminating in your opponent's back and then apply a strangle hold\n\n1:35:25.000 --> 1:35:28.520\n that's a long chain of events as opposed to\n\n1:35:30.840 --> 1:35:33.000\n A strong punch or kick which can take\n\n1:35:33.000 --> 1:35:37.000\n A quarter of a second an application from start to finish and the match is over\n\n1:35:37.800 --> 1:35:39.240\n um\n\n1:35:39.240 --> 1:35:40.360\n and so\n\n1:35:40.360 --> 1:35:45.080\n there's a sense in which uh grappling is is it's\n\n1:35:46.600 --> 1:35:49.560\n It's fighting for the patient and the calculating\n\n1:35:50.520 --> 1:35:53.240\n Whereas striking is much more for\n\n1:35:54.440 --> 1:35:59.080\n In this short time frame where everything gets done in the in the blink of an eye\n\n1:35:59.080 --> 1:36:05.160\n There's a sense also which grappling is a much more forgiving sport. You can make a terrible mistake\n\n1:36:05.880 --> 1:36:09.240\n End up in a terrible position and still fight your way out and win\n\n1:36:10.920 --> 1:36:15.400\n In mixed martial arts, it's much much less forgiving\n\n1:36:16.200 --> 1:36:19.400\n If you get hit and stunned your chances of recovery\n\n1:36:19.800 --> 1:36:26.440\n Are minimal you're going to get swarmed on and unless it's right at the end of the round you it's very very hard to recover\n\n1:36:26.440 --> 1:36:29.640\n From getting hit and swarmed on. Um\n\n1:36:30.520 --> 1:36:32.520\n uh, so there's a sense in which\n\n1:36:33.000 --> 1:36:35.960\n The biggest difference between them is time of application of technique\n\n1:36:36.440 --> 1:36:41.000\n Uh in mixed martial arts, it's incredibly unforgiving in terms of time\n\n1:36:41.160 --> 1:36:44.060\n Even the smallest error can have the deepest consequences\n\n1:36:44.920 --> 1:36:48.280\n In grappling you can make massive errors and still come back and win\n\n1:36:49.000 --> 1:36:51.560\n um grappling will typically be won\n\n1:36:51.560 --> 1:36:59.400\n In a much higher percentage case by the more skilled and conditioned grappler. Whereas there is\n\n1:37:00.760 --> 1:37:05.240\n much more of what they call a punches chance in mixed martial arts where\n\n1:37:06.600 --> 1:37:09.240\n There's a much higher likelihood of a lesser athlete\n\n1:37:09.780 --> 1:37:15.960\n Defeating a greater athlete in mma than there is in grappling simply because of time of application of the techniques\n\n1:37:16.360 --> 1:37:18.540\n Even the smallest period of inattention\n\n1:37:18.540 --> 1:37:23.740\n In mma and the match is over gordon ryan could fall asleep for 30 seconds\n\n1:37:24.460 --> 1:37:29.420\n Have his opponent mounted on and wake up and finish him five minutes later. It's not going to happen in mma\n\n1:37:30.700 --> 1:37:33.180\n Okay, so the the stakes are much higher\n\n1:37:33.260 --> 1:37:38.140\n You can do a lot of damage in a very small amount of time and just the dynamic temporal dynamics of how things happen\n\n1:37:38.220 --> 1:37:44.060\n Is very different everything you'll see will be a reflection of that then you go further into things like rule sets\n\n1:37:44.060 --> 1:37:49.340\n In the sport of grappling if gordon ryan comes out and sits down in the middle of the mat\n\n1:37:49.820 --> 1:37:53.500\n His opponent must follow him to the ground and engage\n\n1:37:54.700 --> 1:37:56.380\n in mixed martial arts\n\n1:37:56.380 --> 1:37:58.460\n If you come to the center of the cage and sit down\n\n1:37:59.580 --> 1:38:02.460\n The other guy can just walk away from you. They're completely\n\n1:38:03.100 --> 1:38:06.060\n Oriented in different directions grappling is ground centered\n\n1:38:06.460 --> 1:38:11.260\n Mma is typically standing centered at the beginning of every round you have to start standing again\n\n1:38:11.260 --> 1:38:17.500\n If I disengage from a ground grappling situation stand up and walk away from my opponent\n\n1:38:17.500 --> 1:38:19.820\n My opponent must follow me up to the feet\n\n1:38:20.780 --> 1:38:25.740\n In grappling it's the exact opposite. If I sit to the ground my opponent must follow me to the ground\n\n1:38:25.900 --> 1:38:31.580\n It's written into the rule set and so one is inherently ground or oriented and one is inherently standing oriented\n\n1:38:31.980 --> 1:38:35.820\n So it's more it's more difficult to dictate where the fight happens in mixed martial arts\n\n1:38:35.820 --> 1:38:41.900\n Yes, you have to be able to impose where the fight is whereas in grappling you can simply choose it. So\n\n1:38:42.380 --> 1:38:46.940\n George, what is uh your sense of the the difference in terms of how you approached it?\n\n1:38:47.740 --> 1:38:54.940\n Uh between the two sports so you also are a student of wrestling and grappling so in preparing for fights\n\n1:38:56.780 --> 1:39:00.860\n What parts of grappling purely the sport that you have to leave behind\n\n1:39:02.060 --> 1:39:03.740\n well, I I uh\n\n1:39:03.740 --> 1:39:08.780\n I'm, very lucky. I had the opportunity to I train with I consider the best\n\n1:39:09.340 --> 1:39:11.340\n mentor trainer I ever ever had\n\n1:39:12.140 --> 1:39:13.820\n and I have\n\n1:39:13.820 --> 1:39:19.660\n Some of the best grapplers that I can train with they were they were there to help me through my career\n\n1:39:20.460 --> 1:39:21.980\n so\n\n1:39:21.980 --> 1:39:23.980\n uh for my training is\n\n1:39:24.700 --> 1:39:30.460\n Of course because I do not dedicate as much time in one specific area. It's hard to be\n\n1:39:30.460 --> 1:39:35.820\n You know a world class athlete and that in in only one particular area always\n\n1:39:36.380 --> 1:39:37.900\n for me\n\n1:39:37.900 --> 1:39:45.100\n Like the idea to be more well rounded to be very competent in every of those areas striking grappling\n\n1:39:46.140 --> 1:39:51.740\n Take downs and and all those areas then being just very good at one\n\n1:39:52.540 --> 1:39:57.820\n And not as good at as as others, you know, because I like the idea that\n\n1:39:57.820 --> 1:40:01.740\n It gives me more option when I fight someone I can\n\n1:40:02.940 --> 1:40:08.780\n Mold myself to become the perfect nemesis to a that person better if i'm more well rounded\n\n1:40:09.500 --> 1:40:12.140\n If I do not have those well rounded skill\n\n1:40:13.740 --> 1:40:15.740\n I don't have that option, you know\n\n1:40:16.700 --> 1:40:21.020\n You have less tools to work with less technology. What about you gordon? What um,\n\n1:40:21.020 --> 1:40:27.580\n You know, what do you think is very distinct about grappling in the way you approach it versus fighting? I think most of it was covered\n\n1:40:27.580 --> 1:40:32.860\n But I think that the the one one of the big things is the fact that when you're looking at mma\n\n1:40:33.660 --> 1:40:40.060\n You have a pretty general agreed upon and unified rule set where if you look at ufc versus bellator\n\n1:40:40.060 --> 1:40:45.100\n They're they have slight differences in the rules maybe um, but it's pretty much the same thing\n\n1:40:45.100 --> 1:40:51.180\n Whereas in grappling you have ebi rules, then you have adcc rules. You have ibgf rules. You have no time limit rules\n\n1:40:51.900 --> 1:40:53.020\n um, and\n\n1:40:53.020 --> 1:40:59.660\n Each rule set will play to the skills of different athletes. Um, if you have if you do adcc rules\n\n1:41:00.060 --> 1:41:04.220\n Uh, it generally is slightly biased towards wrestlers or if they can stall to the overtime\n\n1:41:05.100 --> 1:41:10.700\n And then hit a takedown in the overtime and not really doing jiu jitsu, but they score a takedown. They're gonna win\n\n1:41:10.940 --> 1:41:12.700\n Whereas if you have like a jiu jitsu\n\n1:41:12.700 --> 1:41:16.140\n Takedown they're gonna win whereas if you have like an ebi for example\n\n1:41:16.540 --> 1:41:22.780\n You have to finish the guy in regulation or you start in a jiu jitsu position with your back taken or in an armbar\n\n1:41:23.100 --> 1:41:25.100\n um, so I think that you have\n\n1:41:25.820 --> 1:41:31.420\n certain rule sets that play in the favor of certain athletes, um and\n\n1:41:32.220 --> 1:41:36.460\n Certain athletes can win in one rule set, but then they just have no chance of winning in the other\n\n1:41:36.940 --> 1:41:38.940\n Like when I fought yuri the first time in ebi\n\n1:41:38.940 --> 1:41:44.620\n I beat him in ebi the chances of me beating him on that night under an adcc rule set were probably pretty low\n\n1:41:45.100 --> 1:41:48.060\n Um when I fought liandra low under an adcc rule set\n\n1:41:48.300 --> 1:41:53.420\n He beat me that day, but the chances of him beating me on the same day in an ebi rules that were like next to zero\n\n1:41:54.700 --> 1:41:56.700\n So I think it's interesting that\n\n1:41:56.940 --> 1:42:02.620\n In mma you have one unified rule set which have small differences, but they're all generally the same\n\n1:42:02.860 --> 1:42:07.580\n um, and in jiu jitsu, you have a wide variety of different rule sets that um have\n\n1:42:07.580 --> 1:42:09.100\n uh\n\n1:42:09.100 --> 1:42:10.620\n biases towards\n\n1:42:10.620 --> 1:42:13.980\n a certain athlete skill sets you mentioned liandra low\n\n1:42:14.700 --> 1:42:17.120\n I gotta ask you again about adcc\n\n1:42:18.540 --> 1:42:21.900\n You have lost very very few times in your career\n\n1:42:22.460 --> 1:42:24.140\n Uh one\n\n1:42:24.140 --> 1:42:30.700\n I mean this is the same is true for george and uh, the only person who has ever submitted you is philippe penya black belt\n\n1:42:30.700 --> 1:42:32.700\n Yeah at black belt\n\n1:42:32.700 --> 1:42:38.540\n Um, he is adcc world champion multiple time abby jjf gi and no gi world champion\n\n1:42:39.580 --> 1:42:42.460\n You may face him adcc or elsewhere in the future\n\n1:42:42.940 --> 1:42:43.820\n um\n\n1:42:43.820 --> 1:42:45.580\n Will you beat him?\n\n1:42:45.580 --> 1:42:49.500\n uh, yes, I mean I have to say yes, right, um, but uh\n\n1:42:50.380 --> 1:42:56.540\n I fought him initially when I first got my black belt, um that I fought him a year later. So 2016 and 2017\n\n1:42:57.340 --> 1:42:59.820\n Um, and despite what people remember about the match\n\n1:42:59.820 --> 1:43:06.380\n And whenever people talk about it's like oh, yeah, the guy who strangled gordon, but no one remembers that the first match was like a 45 minute\n\n1:43:06.380 --> 1:43:07.260\n war\n\n1:43:07.260 --> 1:43:12.540\n Um, and then the second match with the full 20 minutes of adcc and if I didn't get my back taken in like the last\n\n1:43:13.660 --> 1:43:17.900\n Minute and a half two minutes, it would have went into an overtime. Um that could change the outcome of the match\n\n1:43:18.700 --> 1:43:20.300\n um\n\n1:43:20.300 --> 1:43:23.040\n I think that if you look at philippe's performances\n\n1:43:23.740 --> 1:43:28.460\n Especially nogi specifically nogi since then it looks like he's almost gotten worse\n\n1:43:28.460 --> 1:43:30.460\n Whereas since that match\n\n1:43:31.100 --> 1:43:33.100\n uh in 2017\n\n1:43:33.180 --> 1:43:40.780\n Uh, the only match I lost after that was against vinnie, uh, magalesh by by points and uh, i'm on like a 55\n\n1:43:41.100 --> 1:43:43.100\n match win streak\n\n1:43:43.100 --> 1:43:51.020\n um over the course of four years, um winning all the major tournaments nogi and uh philippe since that match I think is like five and two\n\n1:43:51.580 --> 1:43:52.940\n uh, nogi\n\n1:43:52.940 --> 1:43:59.340\n Um, and he's lost his last two match matches one was convincingly where he was dominated by andre and one was by submission\n\n1:43:59.660 --> 1:44:03.740\n Um, so I don't think that he's progressed nearly as fast if anything\n\n1:44:03.740 --> 1:44:08.320\n He looks like he's worse than he was when he beat me in 2017 based on his previous performances\n\n1:44:08.940 --> 1:44:13.660\n Um that being said, I know he's going to come in training very hard for this one and he's he's going to be prepared\n\n1:44:13.660 --> 1:44:15.660\n but I just don't think\n\n1:44:15.980 --> 1:44:16.860\n that\n\n1:44:16.860 --> 1:44:23.660\n In terms of technical ability. He's anywhere near my level and um, he was much bigger than me both times\n\n1:44:23.660 --> 1:44:28.380\n We fought um the first time he was much bigger than me the second time. He was one weight class above me\n\n1:44:28.780 --> 1:44:30.860\n um, so now there's not going to be an advantage in\n\n1:44:32.120 --> 1:44:36.560\n Technicality and it's also not going to be a physicality advantage. So I think he's just going to be beat everywhere\n\n1:44:40.140 --> 1:44:43.900\n This is uh, this is a good example of the scientific response to a um,\n\n1:44:43.900 --> 1:44:48.540\n Um to a comment to a to a question. Yeah, so he's not um,\n\n1:44:51.580 --> 1:44:54.380\n That's a match you're you're not deeply concerned with\n\n1:44:55.100 --> 1:45:00.540\n And in terms of the set of opponents because you you have and you will be facing a lot of really difficult\n\n1:45:01.660 --> 1:45:05.900\n That's actually in my opinion one of the easier matches because of the fact that we're relatively the same size\n\n1:45:06.540 --> 1:45:10.140\n um, if I show up at 230 pounds like a lot of the guys are\n\n1:45:10.140 --> 1:45:16.800\n 260 270 plus so that extra weight does make a difference. I think out of that entire bracket. Um,\n\n1:45:17.440 --> 1:45:21.360\n Felipe is probably going to be the one of the easiest matches because of the fact that I can easily take him down\n\n1:45:21.840 --> 1:45:23.840\n And if I take him down i'm going to pass his guard\n\n1:45:24.080 --> 1:45:30.640\n Whereas I feel like the other guys because they're so much bigger and they're very cagey. Um, it may take me a while to actually\n\n1:45:31.200 --> 1:45:33.200\n Take them to the ground. Um\n\n1:45:33.440 --> 1:45:34.400\n And get on top of them\n\n1:45:34.400 --> 1:45:38.720\n And I think it may be they may be longer drawn out matches because of the fact that they're so much bigger and\n\n1:45:38.720 --> 1:45:44.400\n And stally it's hard to take them down, but flea based relatively my size and as wrestling is atrocious\n\n1:45:44.640 --> 1:45:47.280\n So i've already taken them down in the last adcc match\n\n1:45:47.520 --> 1:45:51.040\n So i'm pretty sure I can just easily put them down pass them and then finish them\n\n1:45:51.760 --> 1:45:57.200\n Well, i'm, not sure what response I was expecting but uh, that was that was that was phrased beautifully\n\n1:45:58.080 --> 1:46:00.080\n um\n\n1:46:00.400 --> 1:46:06.400\n We talked about the tiago alves fight that george had and john borrowed up in class yesterday\n\n1:46:06.400 --> 1:46:11.680\n I believe but the point is we're talking about wrestling and I think that that's a fascinating fight\n\n1:46:12.400 --> 1:46:13.920\n that um\n\n1:46:13.920 --> 1:46:16.960\n There's an incredible display of strategy of skill of heart\n\n1:46:17.600 --> 1:46:23.360\n Uh, george, could you maybe talk about that fight john? Maybe two what lessons you gained from that fight?\n\n1:46:24.560 --> 1:46:26.560\n Go ahead. It was you're fighting on mine\n\n1:46:28.080 --> 1:46:34.240\n Well, maybe it also tell what happened in terms of your injury I think third round. Oh, yeah. Um\n\n1:46:34.240 --> 1:46:38.720\n Um, so I was fighting tiago alves and uh in the third round I um\n\n1:46:40.320 --> 1:46:42.320\n Tear my adductor muscle\n\n1:46:42.560 --> 1:46:47.440\n Um, it happened when I was on the bottom and he I think he pushed my knee down tried to pass my guard and I\n\n1:46:47.520 --> 1:46:49.360\n Heard a pop\n\n1:46:49.360 --> 1:46:51.360\n I didn't know what I think you were going for an armbar\n\n1:46:52.080 --> 1:46:56.160\n You were on his back you switched to armbar and he cleared the leg by pushing on your leg\n\n1:46:56.160 --> 1:46:58.880\n And you went in with a preexisting injury and it tore\n\n1:46:58.880 --> 1:47:03.840\n Yes, and and it it it get worse and and I heard a pop\n\n1:47:04.000 --> 1:47:08.400\n I didn't know what it was, but I know it really hurt. So I came back standing up and\n\n1:47:09.120 --> 1:47:10.320\n there's a\n\n1:47:10.320 --> 1:47:15.040\n A famous video one that goes on the internet about when I go back in the corner\n\n1:47:15.440 --> 1:47:21.040\n And I tell my my coach i'm like, I don't know what it is. I think I tore my my my adductor muscle and\n\n1:47:21.680 --> 1:47:24.800\n Greg jackson is like, I don't care hit him with your groin\n\n1:47:24.800 --> 1:47:30.080\n I was very worried because I I wasn't pain, but I didn't know I didn't know what what I had\n\n1:47:30.880 --> 1:47:35.200\n So I didn't know the gravity of it and it it it plays on your mind\n\n1:47:35.680 --> 1:47:39.600\n So but I had to buy to bite down my mouthpiece and finish the fight, you know\n\n1:47:39.600 --> 1:47:44.880\n I knew I was ahead on the on the scorecard and uh, I needed to finish finish strong\n\n1:47:45.200 --> 1:47:49.200\n So what was your strategy there in terms of strikes in terms of wrestling so he's an\n\n1:47:49.200 --> 1:47:56.240\n Exceptionally difficult opponent to take down. Yeah. Well at at first I I I knew I would add a good jab a good\n\n1:47:56.320 --> 1:47:58.320\n You know to stay always\n\n1:47:58.640 --> 1:48:04.080\n From the outside, you know fight him from the outside and and use my footwork because he was like a tank\n\n1:48:04.080 --> 1:48:06.080\n He was much bigger and much\n\n1:48:06.160 --> 1:48:08.160\n stronger than me and uh\n\n1:48:08.960 --> 1:48:11.280\n I didn't want never wanted to stay in front of him\n\n1:48:11.280 --> 1:48:15.760\n So he was all the way out or all the way in and when I was coming all the way in\n\n1:48:15.760 --> 1:48:21.200\n It was with my uh proactive or reactive takedown where I myself\n\n1:48:21.840 --> 1:48:29.280\n initiated the takedown by uh, using a distraction like a jab to make it is is and goes up and then I go\n\n1:48:29.840 --> 1:48:37.360\n with a single double leg or uh to react like baiting him for him to come hit me and then\n\n1:48:37.920 --> 1:48:43.600\n While he's coming to hit me I go change level and and that's the way I like to take my time\n\n1:48:43.600 --> 1:48:49.680\n And that's the way I like to take my opponent down, you know some guys for example, like like uh, cabbie\n\n1:48:49.680 --> 1:48:51.680\n for example, he's very good at at\n\n1:48:52.400 --> 1:49:00.080\n Bringing his opponent to defense and use chain wrestling to to take his opponent down. I find it for me for myself. I specialize more into\n\n1:49:00.880 --> 1:49:03.840\n Explosive takedown in the center of the octagon because I found it\n\n1:49:04.560 --> 1:49:06.560\n more economical for me\n\n1:49:08.000 --> 1:49:11.440\n What what did you see you were you're commenting john about the wrestling\n\n1:49:11.440 --> 1:49:19.280\n That was that was quite interesting. I mean also, can you generally comment on the fact that george sanpia who don't I don't think you wrestled\n\n1:49:20.480 --> 1:49:27.200\n I wrestle I started wrestling. I was 19 years old, but I wrestled some very good russian guys. So they took me underneath their wing and\n\n1:49:27.840 --> 1:49:29.040\n but\n\n1:49:29.040 --> 1:49:31.200\n My ability to cover distance\n\n1:49:31.840 --> 1:49:38.480\n Come from karate does not come from wrestling wrestling is how I finish once I got the leg how I finish the takedown\n\n1:49:38.480 --> 1:49:43.120\n Uh, so the the timing and the movement and the explosion required for this karate. Yeah\n\n1:49:44.480 --> 1:49:49.520\n I think an important distinction to make here is um one which george\n\n1:49:50.240 --> 1:49:52.240\n uh made throughout his career and I\n\n1:49:52.720 --> 1:49:55.600\n Believe george you were the greatest innovator in mma history\n\n1:49:56.000 --> 1:49:58.000\n um with regards to this\n\n1:49:58.640 --> 1:50:00.640\n and this is uh\n\n1:50:00.720 --> 1:50:05.140\n The creation of what george calls shoot boxing which is the amalgamation\n\n1:50:05.140 --> 1:50:10.820\n Of striking technique in george's case mostly karate because that was his martial arts background\n\n1:50:11.380 --> 1:50:15.220\n um into grappling and in particular takedowns\n\n1:50:15.940 --> 1:50:17.780\n uh\n\n1:50:17.780 --> 1:50:19.780\n when most people say\n\n1:50:19.940 --> 1:50:23.540\n So and so has better wrestling in mixed martial arts\n\n1:50:25.140 --> 1:50:30.820\n You have to be very careful what they mean by this there are many highly credentialed wrestlers\n\n1:50:30.820 --> 1:50:36.260\n In the early days of mixed martial arts who went in and truly struggled to hit a takedown\n\n1:50:36.900 --> 1:50:42.740\n Now these are very very good wrestlers who in a wrestling match would easily put down their opponent\n\n1:50:43.380 --> 1:50:44.660\n but\n\n1:50:44.660 --> 1:50:50.660\n In a striking situation where the ranges are completely different and the setups are entirely different\n\n1:50:50.980 --> 1:50:56.980\n The stances are different even the the overall conditions are different. You're no longer wearing shoes\n\n1:50:56.980 --> 1:51:01.940\n People underestimate just what an impact it is for a wrestler to take the shoes off\n\n1:51:02.020 --> 1:51:05.540\n You lose like 20 of your forward drive the minute you take off the shoes\n\n1:51:06.180 --> 1:51:07.300\n um\n\n1:51:07.300 --> 1:51:15.060\n Uh, all of these make massive differences in whether or not you're going to be able to even make contact with an opponent for a takedown\n\n1:51:16.980 --> 1:51:24.020\n As george pointed out the true value of wrestling in mma is finishing the takedown once you've established contact\n\n1:51:24.020 --> 1:51:31.380\n But that's only about 20 of the action of a of a mixed martial arts takedown 80 of it is an understanding range\n\n1:51:31.620 --> 1:51:33.620\n rhythm setup\n\n1:51:33.780 --> 1:51:35.780\n opportunity, etc, etc, and\n\n1:51:37.300 --> 1:51:39.060\n That's not part of wrestling at all\n\n1:51:39.060 --> 1:51:42.740\n You're even the overall conditions are completely different in the sport of wrestling\n\n1:51:42.740 --> 1:51:47.700\n You start a very close range in a very bent over stance and you're expected to wrestle for\n\n1:51:48.260 --> 1:51:50.500\n In international stars for three minutes at a time\n\n1:51:50.500 --> 1:51:54.260\n Um now suddenly you're completely upright\n\n1:51:55.300 --> 1:51:56.340\n uh\n\n1:51:56.340 --> 1:51:57.860\n and\n\n1:51:57.860 --> 1:52:02.340\n You're not wearing shoes all the conditions the the the rhythm and speed of it is different\n\n1:52:02.740 --> 1:52:07.300\n The counters are completely different. It's just an entirely different animal\n\n1:52:07.860 --> 1:52:10.420\n And so george was an early recognizer of this\n\n1:52:11.540 --> 1:52:15.780\n And started to put the emphasis on direct training for shoot boxing\n\n1:52:15.780 --> 1:52:21.620\n In addition to wrestling so he practiced with very good wrestlers in the montreal wrestling club\n\n1:52:22.420 --> 1:52:29.540\n Just the sport of wrestling and that's what made him very good at finishing takedowns, but it was in his shoot boxing training\n\n1:52:30.420 --> 1:52:37.620\n Which he himself largely developed remember george started at a time when mma was pretty damn young\n\n1:52:38.180 --> 1:52:40.180\n and um\n\n1:52:40.180 --> 1:52:46.500\n Um, he we were when when you entered the sport of mixed martial arts george, it wasn't even allowed on tv\n\n1:52:47.140 --> 1:52:49.700\n Like it was completely banned. It was in his country. It was\n\n1:52:50.180 --> 1:52:51.540\n physically banned\n\n1:52:51.540 --> 1:52:56.660\n Uh, they had to fight on indian reservations and you know, and this is way back in the wild west days of mma\n\n1:52:57.380 --> 1:53:00.180\n and so as a as a young developing athlete he had to\n\n1:53:01.140 --> 1:53:03.140\n More or less do this by himself\n\n1:53:03.540 --> 1:53:07.700\n If you ever want to hear some incredible stories talk about teenage george saint pierre\n\n1:53:07.700 --> 1:53:12.420\n Who had a coach who used to make him put on boxing gloves now?\n\n1:53:12.580 --> 1:53:19.140\n He was 16 17 years old and just put him on a hardwood floor against a professional boxer who was in his\n\n1:53:19.940 --> 1:53:24.420\n Late 20s at the peak of his career and he said george you're not allowed to punch\n\n1:53:24.580 --> 1:53:26.740\n You just got to take him down while he tries to knock you out\n\n1:53:27.460 --> 1:53:29.460\n And it was and it was crazy\n\n1:53:30.000 --> 1:53:32.000\n darwinism, he was like\n\n1:53:32.340 --> 1:53:34.340\n It's like you're gonna you're gonna\n\n1:53:34.660 --> 1:53:36.660\n Adapt or you're gonna die\n\n1:53:36.660 --> 1:53:40.340\n Literally and he had that it could have been very bad, but it turns out to be great\n\n1:53:40.820 --> 1:53:41.940\n He's admitted\n\n1:53:41.940 --> 1:53:43.940\n but there's a sense here in which\n\n1:53:43.940 --> 1:53:49.860\n People think oh, you know what determines your takedown ability in mma as your wrestling skill\n\n1:53:50.500 --> 1:53:51.700\n that\n\n1:53:51.700 --> 1:53:58.180\n Your wrestling skill will determine your finishing ability on takedowns, but there's so much more to it than that\n\n1:53:59.860 --> 1:54:02.740\n Whenever people say, you know, what what are the broad\n\n1:54:02.740 --> 1:54:07.220\n elements that determine the outcome of a mixed martial arts fight\n\n1:54:07.860 --> 1:54:11.460\n Okay on the broadest possible level. I always give the same three things\n\n1:54:13.060 --> 1:54:15.460\n The athlete who can dominate the pace\n\n1:54:16.260 --> 1:54:17.860\n of the match\n\n1:54:17.860 --> 1:54:25.780\n The athlete who can dominate the direction of the match and the athlete who can dominate the setups will win the vast majority of fights\n\n1:54:26.180 --> 1:54:28.180\n They're in those three things\n\n1:54:28.180 --> 1:54:32.500\n The direction the pace and the setups you dominate all three of those\n\n1:54:33.300 --> 1:54:36.020\n You're going to win 90 of the matches. You're in\n\n1:54:37.140 --> 1:54:42.100\n Um, george could always dominate the direction of the fight because he could stop the other guy taking him down\n\n1:54:42.500 --> 1:54:45.860\n And he could impose his own takedowns at any point in a match\n\n1:54:46.020 --> 1:54:50.260\n So whether it went to ground or whether it stayed standing was always up to him\n\n1:54:51.460 --> 1:54:54.980\n George had the most sophisticated array of setups into takedowns\n\n1:54:54.980 --> 1:54:58.740\n That i've personally ever witnessed\n\n1:54:59.060 --> 1:55:05.460\n um, the whole distinction between reactive and proactive takedowns came very early in george's career and\n\n1:55:05.780 --> 1:55:09.700\n He excelled in both most people tend to favor one or the other\n\n1:55:10.580 --> 1:55:12.980\n Most athletes have a very hard time\n\n1:55:14.000 --> 1:55:15.860\n imposing\n\n1:55:15.860 --> 1:55:18.500\n Their setups on an opponent and as a result they have to use\n\n1:55:18.500 --> 1:55:25.780\n The cage as a crutch for their for their setups where they just bully someone towards the cage and then put them down on the cage\n\n1:55:26.260 --> 1:55:30.580\n George is one of the very few people who was equally good against the cage or in the open\n\n1:55:30.980 --> 1:55:33.080\n And could do so in both proactive and reactive\n\n1:55:33.840 --> 1:55:35.840\n situations\n\n1:55:37.540 --> 1:55:40.260\n And the scary thing is that as good as\n\n1:55:41.300 --> 1:55:44.020\n All of you saw him look in the octagon\n\n1:55:44.020 --> 1:55:50.100\n Um, anyone who knows george as a coach will tell you he was twice as good as that\n\n1:55:50.580 --> 1:55:54.740\n In the gym where he would often go against people several weight divisions above himself\n\n1:55:55.220 --> 1:56:00.340\n I could sit here all day. I won't name names, but I always laugh when people say oh, this is the greatest\n\n1:56:01.300 --> 1:56:04.180\n Uh pound for pound guy of all time and i've personally seen george\n\n1:56:05.220 --> 1:56:06.900\n Take that guy down and crush him in the gym\n\n1:56:06.900 --> 1:56:10.900\n And I can't say anything because it's rude to talk about that in public because it's just training\n\n1:56:10.900 --> 1:56:15.860\n But i've seen george go with people all the way up to light heavyweight some of the greatest names in the history of the sport\n\n1:56:16.020 --> 1:56:17.860\n Put them down\n\n1:56:17.860 --> 1:56:24.180\n Advanced position on the ground and dominate them in training. It's it's what he did during that time. I uh, george\n\n1:56:24.180 --> 1:56:29.780\n I I got to say I deeply admire many of the things I saw you do not just in the octagon but\n\n1:56:30.340 --> 1:56:32.340\n in training as well as um\n\n1:56:33.060 --> 1:56:35.780\n The the impact that you had on\n\n1:56:36.660 --> 1:56:38.660\n uh, the\n\n1:56:38.740 --> 1:56:40.660\n the degree to which\n\n1:56:40.660 --> 1:56:44.120\n Takedowns were used in the sport was absolutely inspirational\n\n1:56:44.500 --> 1:56:49.380\n That's why one of one of the reasons why I always say you're one of the the only athlete I ever met who taught me\n\n1:56:50.020 --> 1:56:56.500\n more than than I taught you because you opened my eyes to a whole new world of of shoot boxing and how\n\n1:56:57.060 --> 1:57:01.860\n I grew up in a time when uh, you I was laughing before when you talked about sugar ray lennard\n\n1:57:01.860 --> 1:57:06.100\n I was a kid watching that match and um, I grew up in a time where there was\n\n1:57:06.100 --> 1:57:11.220\n Boxing and there was kickboxing and then I came to america and I learned grappling and\n\n1:57:11.860 --> 1:57:15.220\n This young man here was the innovator when it came to the integration of the two\n\n1:57:15.940 --> 1:57:19.640\n Well, then I have to ask because george sits here uncomfortably being complimented\n\n1:57:20.900 --> 1:57:21.940\n um\n\n1:57:21.940 --> 1:57:23.780\n if george saint pierre\n\n1:57:23.780 --> 1:57:27.860\n And kabib nurmagomedov face each other in their prime who wins\n\n1:57:28.340 --> 1:57:33.620\n Who that's a very very loaded question how yeah, like what are the different trajectories you see?\n\n1:57:33.620 --> 1:57:40.500\n Oh, okay. How does each one win in your view if one wins or the other one wins what happened interestingly they're actually\n\n1:57:40.980 --> 1:57:43.140\n very similar in size despite the fact that\n\n1:57:43.780 --> 1:57:46.660\n George fought at welterweight and kabib fought it\n\n1:57:47.220 --> 1:57:52.820\n Lightweight if you actually see them standing next to each other the of similar height. Kabib's actually a little more thick set\n\n1:57:54.100 --> 1:58:01.620\n Yeah, he's actually heavier than you walking around. Um, uh, george walked around most of his career between 188 and 191\n\n1:58:01.620 --> 1:58:03.620\n 191 pounds\n\n1:58:04.100 --> 1:58:06.660\n And so kabib actually would ironically have\n\n1:58:07.380 --> 1:58:09.380\n a kind of size and strength advantage\n\n1:58:09.540 --> 1:58:14.260\n Uh despite being in the lighter weight division that's been the general trend as mma\n\n1:58:14.820 --> 1:58:20.100\n Has grown is that athletes will come further down and wait to make weight divisions. Um,\n\n1:58:21.780 --> 1:58:23.140\n Uh\n\n1:58:23.140 --> 1:58:29.940\n I believe that george has the best takedowns in history, uh in the open in the cage\n\n1:58:29.940 --> 1:58:37.620\n Um, kabib was his great strength was using the fence to facilitate takedowns. Um,\n\n1:58:39.700 --> 1:58:40.980\n Kabib's\n\n1:58:40.980 --> 1:58:46.260\n Other great strength was not only his ability to take people down but to keep people down for extended periods of time\n\n1:58:46.820 --> 1:58:48.820\n both of them were\n\n1:58:49.060 --> 1:58:54.740\n Powerful strikers on the ground and could do terrible damage to opponents, uh on the floor\n\n1:58:54.900 --> 1:58:57.620\n So they're both very similar in that regard\n\n1:58:57.620 --> 1:59:04.180\n Um, kabib was mostly a uh, a puncher from the back george was mostly an elbow from the front\n\n1:59:04.660 --> 1:59:09.220\n Um, but both of them could lay waste to opponents with strikes on the floor\n\n1:59:09.860 --> 1:59:14.260\n Um, both of them were highly competent with submissions on the ground\n\n1:59:14.500 --> 1:59:19.060\n They weren't submission specialists in the sense of someone like gordon ryan, but uh, they were\n\n1:59:20.020 --> 1:59:22.020\n certainly, um\n\n1:59:22.180 --> 1:59:24.980\n No slouches with submission holds. Um\n\n1:59:24.980 --> 1:59:32.740\n Um, yeah, it's just a fascinating idea. So it's almost like who gets the first takedown. Yeah, I do believe\n\n1:59:33.300 --> 1:59:34.340\n that\n\n1:59:34.340 --> 1:59:36.420\n They could probably stand up on each other\n\n1:59:37.140 --> 1:59:40.900\n I don't think either one of them would be able to hold the other down for a whole round\n\n1:59:41.700 --> 1:59:45.300\n Um, both of them are notoriously difficult people to hold down\n\n1:59:45.700 --> 1:59:49.940\n So I don't think that whoever won the first takedown wins the match. I don't think it's like that\n\n1:59:49.940 --> 1:59:56.900\n Um, I do believe that george would hold a decisive advantage in striking and distance management\n\n1:59:57.460 --> 2:00:00.980\n um, the few times that kabib did look shaky is\n\n2:00:01.860 --> 2:00:03.300\n when he\n\n2:00:03.300 --> 2:00:08.980\n Kabir was either advancing forward menacingly, but when he had to fight moving backwards\n\n2:00:09.780 --> 2:00:16.020\n There was a definite asymmetry between his ability to fight going forwards, which is very good and his ability to fight going backwards\n\n2:00:16.020 --> 2:00:17.620\n Which was noticeably?\n\n2:00:17.620 --> 2:00:18.660\n weaker\n\n2:00:18.660 --> 2:00:24.420\n Um, george would often fight both forwards and backwards. It was the giago elvis fight\n\n2:00:25.380 --> 2:00:29.620\n Most of the standing time. Yeah, it was was going backwards. Um\n\n2:00:30.980 --> 2:00:37.380\n That's probably the single biggest difference between the two athletes and skill level would be in the standing position\n\n2:00:37.940 --> 2:00:40.420\n um on the ground, uh\n\n2:00:41.780 --> 2:00:47.060\n Kabib slight edge and takedowns on the fence george slight edge and takedowns in the center\n\n2:00:47.060 --> 2:00:48.420\n um\n\n2:00:48.420 --> 2:00:54.180\n Ability to inflict damage on the floor roughly equal ability to fight off the back roughly equal\n\n2:00:54.740 --> 2:00:58.580\n Ability to stand up from bottom roughly equal. It's a very very hard match\n\n2:00:58.980 --> 2:01:00.340\n um\n\n2:01:00.340 --> 2:01:02.340\n In terms of the biggest\n\n2:01:02.580 --> 2:01:06.740\n difference in skill level is going to be in a standing position and so it would come down to\n\n2:01:07.300 --> 2:01:12.580\n um, that doesn't necessarily mean that kabib would lose in the standing position. He might just push it to the fence and just\n\n2:01:13.060 --> 2:01:15.060\n use match tactics where he\n\n2:01:15.060 --> 2:01:18.580\n Kept the fight on the fence for significant periods of time\n\n2:01:19.140 --> 2:01:20.180\n um\n\n2:01:20.180 --> 2:01:24.500\n Uh, and you can win rounds in that fashion. So it's a match that could go either way\n\n2:01:24.500 --> 2:01:27.700\n Both of them are absolutely the best that you'll ever see\n\n2:01:27.700 --> 2:01:34.900\n I've always believed the three greatest mixed martial artists i've ever seen in my life were george saint pierre kabib. Noam, get off and john jones\n\n2:01:35.460 --> 2:01:39.380\n Um, the three of them have some interesting similarities and differences\n\n2:01:39.860 --> 2:01:41.860\n all three\n\n2:01:41.860 --> 2:01:45.540\n Uh beat every single person they ever faced\n\n2:01:46.020 --> 2:01:46.900\n um\n\n2:01:46.900 --> 2:01:52.740\n I I know john jones officially has a loss by dq, but no one believes that was a loss\n\n2:01:53.140 --> 2:01:54.100\n um\n\n2:01:54.100 --> 2:01:56.740\n uh, george does have two losses, but he\n\n2:01:57.300 --> 2:01:58.180\n uh\n\n2:01:58.180 --> 2:02:00.180\n Defeated both athletes decisively\n\n2:02:00.580 --> 2:02:03.780\n Uh in rematches kabib did it by having no losses\n\n2:02:03.780 --> 2:02:11.480\n Interestingly all three athletes have at least one match which is controversial in terms of who won and who lost\n\n2:02:11.800 --> 2:02:13.160\n um\n\n2:02:13.160 --> 2:02:18.920\n John jones has had several matches which could have gone either way on the judge's scorecard kabib's\n\n2:02:19.400 --> 2:02:22.520\n Uh match against glaceon t bell could have gone either way\n\n2:02:22.920 --> 2:02:26.520\n Uh george's match with hendrix was could have gone either way\n\n2:02:26.520 --> 2:02:34.040\n They they all had matches that they won which people would dispute the outcome. So that was a similarity between the three of them. Um,\n\n2:02:34.760 --> 2:02:36.760\n all three of them\n\n2:02:37.880 --> 2:02:39.880\n Have had the ability\n\n2:02:39.880 --> 2:02:45.160\n To dominate the direction of fights when they want it to go down it goes down when they don't want it to go down\n\n2:02:45.320 --> 2:02:46.520\n It doesn't\n\n2:02:46.520 --> 2:02:47.640\n um\n\n2:02:47.640 --> 2:02:51.960\n That's why I put such a heavy emphasis on that idea that a mixed martial arts champion\n\n2:02:51.960 --> 2:02:57.640\n Must be able to determine the direction of a fight. It's the single most important attribute that they all must have\n\n2:02:58.360 --> 2:02:59.560\n um\n\n2:02:59.560 --> 2:03:03.480\n As to which of the three is the best it's going to come down to criteria\n\n2:03:04.760 --> 2:03:06.760\n You you can't pull them apart\n\n2:03:07.880 --> 2:03:13.160\n Which answer you give as to which of those three is the greatest of all time will come down to the criteria that you use\n\n2:03:13.800 --> 2:03:15.800\n Okay, is it being undefeated?\n\n2:03:15.800 --> 2:03:16.680\n um\n\n2:03:16.680 --> 2:03:22.600\n Uh, is it the amount of time was it the quality of the opponents that they had if you do it by quality of opponents?\n\n2:03:22.680 --> 2:03:26.760\n I think you probably have to give it to george if you do it by um\n\n2:03:27.240 --> 2:03:31.080\n Uh measured dominance through not being defeated and it has to go to compete\n\n2:03:31.640 --> 2:03:33.000\n um\n\n2:03:33.000 --> 2:03:35.720\n Arguably you could say the same with john jones since his one\n\n2:03:36.820 --> 2:03:38.820\n losses\n\n2:03:39.880 --> 2:03:40.840\n By dq\n\n2:03:40.840 --> 2:03:46.840\n But then you could also say the last three or four fights that john's had haven't been the same measure of dominance as we saw\n\n2:03:46.900 --> 2:03:47.960\n previously\n\n2:03:47.960 --> 2:03:49.240\n so ultimately\n\n2:03:49.240 --> 2:03:51.240\n You've got those three guys in my opinion\n\n2:03:51.640 --> 2:03:57.720\n And which one you choose will come down to who it says more about who you are as a viewer than it does about\n\n2:03:57.960 --> 2:04:04.280\n The respective label of the athletes you could throw a blanket over them. The three of them are just that good and um\n\n2:04:04.280 --> 2:04:11.720\n Uh, and which one you select will probably say more about who you are as a viewer than it does about them as athletes\n\n2:04:12.280 --> 2:04:16.680\n I I believe the best fighter the goat is not even born\n\n2:04:17.800 --> 2:04:18.680\n because\n\n2:04:18.680 --> 2:04:20.680\n the generation\n\n2:04:20.840 --> 2:04:22.840\n That is present\n\n2:04:22.920 --> 2:04:24.920\n Benefit of a huge advantage\n\n2:04:25.720 --> 2:04:29.000\n They have knowledge technology that we didn't have before\n\n2:04:29.000 --> 2:04:33.560\n And we had the the knowledge that the other generation did not have before\n\n2:04:34.600 --> 2:04:35.880\n but\n\n2:04:35.880 --> 2:04:41.400\n I believe the best the goat is not even born yet as good as they are today. I think you\n\n2:04:41.880 --> 2:04:45.880\n In sport where you can measure the performance, uh track and field\n\n2:04:46.440 --> 2:04:48.760\n Olympic lifting you can you know someone\n\n2:04:49.400 --> 2:04:56.680\n Is better than the other one because you can measure the performance fighting. It's all subjective. We always debate of who would win\n\n2:04:57.160 --> 2:04:58.360\n but\n\n2:04:58.360 --> 2:05:00.840\n 10 the tendency in sport\n\n2:05:01.720 --> 2:05:02.840\n is that\n\n2:05:02.840 --> 2:05:06.120\n Performance get better. I don't think it's because the athlete necessarily get better\n\n2:05:06.200 --> 2:05:09.400\n It's because they have access to better technology knowledge\n\n2:05:10.120 --> 2:05:12.120\n And they learn from their predecessor\n\n2:05:13.880 --> 2:05:15.880\n As long as that knowledge is transferred forward\n\n2:05:16.200 --> 2:05:23.080\n Something tells me that the greatest of all time lived a few thousand years ago and it's forgotten some of the greatest warriors\n\n2:05:23.080 --> 2:05:28.360\n Like you imagine the kind of grapplers. We just the history didn't record them\n\n2:05:29.320 --> 2:05:33.100\n There could have been small tribes where they developed many ufcs\n\n2:05:33.880 --> 2:05:38.200\n And they've developed the kind of things we you have to think of like, uh, the gracies\n\n2:05:38.680 --> 2:05:41.640\n Just a small family was able to develop so much so quickly\n\n2:05:42.600 --> 2:05:43.800\n I often\n\n2:05:43.800 --> 2:05:50.280\n As this this discussion with john and I think it's very important like to mention I asked you very several times like\n\n2:05:50.280 --> 2:05:52.680\n What would happen if we would take?\n\n2:05:53.480 --> 2:05:59.080\n A fighter of modern days facing the champion of pancration. This is an interesting question\n\n2:05:59.080 --> 2:06:04.680\n And you brought some incredible good point and and people don't don't realize it, you know\n\n2:06:04.760 --> 2:06:11.800\n yeah, no, I think um, one of the great tragedies of martial arts history is our loss of\n\n2:06:12.680 --> 2:06:17.000\n uh, the historical records of pancration like most of what we know was\n\n2:06:17.000 --> 2:06:22.300\n Uh from what i'm told is actually lost in the fires of the library of alexandria\n\n2:06:22.840 --> 2:06:27.560\n And we're left with only a pitiful amount of information on uh pancration matches\n\n2:06:28.440 --> 2:06:31.800\n But what we do know is that there was a very\n\n2:06:32.440 --> 2:06:33.400\n large\n\n2:06:33.400 --> 2:06:35.800\n uh participation in the sport and that it was\n\n2:06:36.440 --> 2:06:38.440\n Why they considered the most popular\n\n2:06:39.160 --> 2:06:45.480\n Sport in the ancient olympics and that it was represented in the ancient olympics for many hundreds of years\n\n2:06:45.480 --> 2:06:49.340\n Plus a long period of time before its introduction into the ancient olympics\n\n2:06:50.040 --> 2:06:52.040\n And so the development time\n\n2:06:52.360 --> 2:06:55.320\n That it may have had would have been very significant it\n\n2:06:56.920 --> 2:07:02.680\n Uh as far as we know most of the development would have been in the major greek city states for\n\n2:07:03.800 --> 2:07:05.960\n Uh, literally hundreds of years of development\n\n2:07:06.280 --> 2:07:14.280\n Um given its prestige as an olympic sport then the best athletes would have been doing it some of the sharpest minds that we know of\n\n2:07:14.280 --> 2:07:20.440\n In human history were involved in the sport. Um, plato the great philosopher\n\n2:07:21.480 --> 2:07:22.840\n uh\n\n2:07:22.840 --> 2:07:28.040\n Was a pancreasianist in his youth. In fact, his name plato is a nickname\n\n2:07:28.840 --> 2:07:30.840\n platus is like plate\n\n2:07:30.920 --> 2:07:35.240\n it means broad or big guy like the big guy and um\n\n2:07:36.120 --> 2:07:40.280\n Uh, he spoke often about pancreasian and in his written works\n\n2:07:40.280 --> 2:07:44.600\n Um, imagine people with the intelligence of plato\n\n2:07:45.960 --> 2:07:47.800\n thinking about\n\n2:07:47.800 --> 2:07:52.360\n Grappling technique for hundreds of years in the most popular olympic sport of that time\n\n2:07:53.300 --> 2:07:55.300\n significant numbers of people with\n\n2:07:55.560 --> 2:08:01.400\n Financial backing as city states put great prestige upon olympic success. They would have funneled athletes in\n\n2:08:01.400 --> 2:08:09.720\n And brought in the best coaches and they had that for many hundreds of years like it's quite conceivable that the best pancreasian athletes\n\n2:08:09.720 --> 2:08:15.720\n were of the absolute first quality and um, uh, it it's\n\n2:08:16.520 --> 2:08:20.120\n It's so sad to think we'll never know. What was their skill level and uh,\n\n2:08:20.920 --> 2:08:24.120\n It's interesting to think about what kind of techniques they developed whether\n\n2:08:25.320 --> 2:08:29.240\n There's stuff we haven't discovered yet in class. You're talking about the most effective\n\n2:08:29.240 --> 2:08:36.040\n Of takedown strategy in wrestling and collegiate wrestling. So maybe let me ask first, uh, because we offline talked about this, too\n\n2:08:36.440 --> 2:08:44.200\n What is the highest percentage submission in grappling overall? You have to go with the rear naked strangle strangles from the back\n\n2:08:44.840 --> 2:08:47.880\n If you look at most tournaments and most rule sets\n\n2:08:48.520 --> 2:08:53.000\n It has success across all rule sets. Um, all weight divisions\n\n2:08:53.640 --> 2:08:57.800\n All body types. It doesn't require any kind of specific\n\n2:08:57.800 --> 2:09:01.720\n Physical advantage such as height, uh in order to be effective\n\n2:09:02.360 --> 2:09:06.120\n Um, it works equally well in both fighting and grappling. Um\n\n2:09:06.920 --> 2:09:11.720\n It will work regardless of how physically and mentally tough your opponent is. Okay\n\n2:09:11.720 --> 2:09:16.520\n A heel hook is a very high percentage technique in in modern day competition\n\n2:09:17.240 --> 2:09:23.320\n But if your opponent simply makes up his mind that he's not going to tap and is willing to take the physical damage\n\n2:09:23.320 --> 2:09:30.280\n It won't result in the end of a match a strangle hold by contrast will always end the match regardless of\n\n2:09:30.680 --> 2:09:32.680\n Your opponent's mental toughness\n\n2:09:32.680 --> 2:09:38.380\n So, um, I believe it's fair to say that at the end of the day the single most high percentage\n\n2:09:39.400 --> 2:09:46.040\n method of uh submitting people and grappling is the rear naked strangle. So when you look at an athlete, maybe Gordon you could speak to this like\n\n2:09:47.000 --> 2:09:49.960\n What's the best, uh, you mentioned Gary with the guillotine\n\n2:09:49.960 --> 2:09:53.880\n What's the best submission to really invest in? Is it the rear naked choke?\n\n2:09:54.600 --> 2:09:59.400\n To really invest your development like understanding the entirety of the system that leads into that\n\n2:09:59.800 --> 2:10:02.120\n Uh, I think that I mean you have to do them all obviously\n\n2:10:02.120 --> 2:10:06.600\n But if I had like one submission that I would only one submission I could pick for the rest of my life\n\n2:10:06.600 --> 2:10:08.600\n It would definitely be a rear naked\n\n2:10:08.840 --> 2:10:14.040\n Can you explain maybe some of the actual technical details of why that's the case?\n\n2:10:14.600 --> 2:10:18.040\n Well as John spoke about they're different in joint locks. Whereas\n\n2:10:18.040 --> 2:10:23.960\n You don't have to tap you can just let your leg break and then keep going with the strangle. There's there's no, uh,\n\n2:10:24.680 --> 2:10:27.480\n There's none of that. Um, and then it's just an inherent\n\n2:10:28.680 --> 2:10:30.680\n Advantage you have being behind someone\n\n2:10:31.160 --> 2:10:35.720\n Um, whereas if you go for an armbar you stop you start from top mount and you're facing the guy and then you put them\n\n2:10:35.720 --> 2:10:38.760\n Down and you're not directly behind them with leg locks. You're facing the guy\n\n2:10:39.480 --> 2:10:43.800\n Whereas when you're on someone's back you have them in a pin where you can your chest to back\n\n2:10:43.800 --> 2:10:48.440\n You have a body triangle and you're pinning the guy in place. He can't explode out. He can't grease his way out\n\n2:10:48.440 --> 2:10:52.920\n Most of the time, uh, and there's an inherent advantage you have being behind them due to the fact that\n\n2:10:53.400 --> 2:10:56.280\n We're poorly set up to deal with threats behind us\n\n2:10:57.080 --> 2:11:01.720\n So would you say that's the most dominant position jiu jitsu like more than mount?\n\n2:11:02.520 --> 2:11:04.120\n More than yeah\n\n2:11:04.120 --> 2:11:08.200\n Sack control more than I think uh, if you look at most matches historically\n\n2:11:08.920 --> 2:11:10.920\n Most guys who get stuck in positions\n\n2:11:10.920 --> 2:11:14.920\n For long amounts of time are guys that they're back taking. Um, if you get\n\n2:11:15.400 --> 2:11:20.680\n An explosive guy from bottom mountain bridge and he can off balance you and lock half guard maybe and then work back to guard\n\n2:11:20.680 --> 2:11:26.600\n But if someone locks a body triangle on your back, um, that's where you see most guys getting pinned in place for long amounts of time\n\n2:11:28.200 --> 2:11:31.800\n Was uh was the body triangle like a well understood thing\n\n2:11:33.000 --> 2:11:37.720\n Was that an invention at some point like as a system as a as a control\n\n2:11:37.720 --> 2:11:44.120\n Yeah, um, perhaps some of your your listeners can correct me on this but I believe there was a technique banned in judo called dojime\n\n2:11:44.840 --> 2:11:51.320\n Which involved crossing feet or locking a triangle around the abdominals from the back and it was banned in judo\n\n2:11:51.880 --> 2:11:59.160\n I believe because uh of intestinal injuries which occurred in the early developmental days of of judo\n\n2:12:00.120 --> 2:12:01.160\n and\n\n2:12:01.160 --> 2:12:02.840\n in the modern era\n\n2:12:02.840 --> 2:12:07.960\n When I first began jiu jitsu body triangles were relatively rare. They were not a standard part of class\n\n2:12:08.920 --> 2:12:16.600\n Um, and sometime around the late 1990s early 2000s people started to realize hey, this is a stronger method of control\n\n2:12:17.400 --> 2:12:18.600\n um\n\n2:12:18.600 --> 2:12:19.960\n it\n\n2:12:19.960 --> 2:12:25.800\n It greatly increases the amount of control you have over your of your opponent's hips and torso over regular hooks\n\n2:12:25.800 --> 2:12:32.520\n Uh, it's not for all athletes. It's difficult for most people who are of shorter thicker statue, uh, to\n\n2:12:33.320 --> 2:12:39.000\n Employ on on on big people if your opponent's very broadly built through the stomach. It's almost impossible to apply\n\n2:12:39.880 --> 2:12:45.480\n And so because it can't be applied by all people it tends not to be taught much at beginner level\n\n2:12:46.520 --> 2:12:50.120\n So as a result, it was always seen as a\n\n2:12:50.920 --> 2:12:52.920\n kind of a speciality\n\n2:12:52.920 --> 2:13:00.520\n It was always seen as a kind of a specialist move for taller athletes at a higher level of competition rather than a broad\n\n2:13:00.520 --> 2:13:04.520\n Base move for everyone or every body type in every class to employ\n\n2:13:04.760 --> 2:13:08.520\n So it just didn't get emphasized that much but in top level competition now\n\n2:13:08.840 --> 2:13:15.880\n I think you would see that it's very apparent that the vast majority of athletes whenever they have the opportunity or a choice between\n\n2:13:16.200 --> 2:13:22.040\n Body triangle and regular rear mounts the majority of modern athletes would use a body triangle\n\n2:13:22.040 --> 2:13:28.940\n So we also had this conversation about wrestling. Maybe georgie can comment on like what what's the uh, the highest percentage?\n\n2:13:29.240 --> 2:13:36.600\n Not statistically speaking. Perhaps that's also interesting as john talked about but just for you in terms of mastery of a takedown\n\n2:13:36.600 --> 2:13:39.640\n What's what's the best way to take down a human being?\n\n2:13:40.600 --> 2:13:42.600\n in wrestling well, I\n\n2:13:42.920 --> 2:13:44.920\n Personally for me, it depends\n\n2:13:45.320 --> 2:13:48.920\n For every fighter are different. They have a different set of skill\n\n2:13:48.920 --> 2:13:51.560\n For me, I when I look someone\n\n2:13:52.520 --> 2:13:56.360\n Want to bring down a tree a big strong high tree\n\n2:13:57.320 --> 2:13:59.320\n He cut it from the base\n\n2:13:59.640 --> 2:14:05.400\n So the legs that that's what we stand on so it was to attack the leg\n\n2:14:05.400 --> 2:14:08.600\n But is it single leg double leg? Is it we talked about like, uh,\n\n2:14:09.000 --> 2:14:15.560\n Well, there's also the the john smith low single. Actually, I don't even know if that's applicable for jiu jitsu at all\n\n2:14:15.560 --> 2:14:20.840\n Applicable for jiu jitsu at all. You you can use it, but it runs into the problem with submission holds\n\n2:14:20.920 --> 2:14:28.920\n Yeah, it's it's not impossible to use but without shoes and in a situation where there's a whole plethora of submission holds in the scoring\n\n2:14:30.840 --> 2:14:32.840\n It's a little more difficult to use, you know\n\n2:14:33.720 --> 2:14:38.760\n It is interesting something being a high percentage in terms of effectiveness tells a story\n\n2:14:39.160 --> 2:14:43.800\n You're saying that every athlete is different. But if it's more effective for most people\n\n2:14:43.800 --> 2:14:48.520\n I mean, it's interesting. It's it's interesting what john talked about is that\n\n2:14:49.240 --> 2:14:52.440\n the highest percentage thing is actually, um\n\n2:14:53.400 --> 2:14:55.480\n In collegiate wrestling that he was talking about is\n\n2:14:56.280 --> 2:15:01.240\n On the defensive side, so blocking a takedown and spinning around to the to the back\n\n2:15:02.520 --> 2:15:09.320\n So that's an interesting idea then also there's all of these kind of going in for a singleness switching to a double or\n\n2:15:09.320 --> 2:15:15.080\n Or wizard position and doing knee tap like there's all these kinds of combinations that seem to be\n\n2:15:15.480 --> 2:15:21.240\n Effective when you look at the statistics and it seems like there's maybe it's a scientific way of thinking but it seems like there is\n\n2:15:22.120 --> 2:15:27.560\n Some conclusion to be drawn there. Oh, yeah, I believe you need to the high percentage move\n\n2:15:27.720 --> 2:15:29.720\n There's a reason why it works. I think it's\n\n2:15:30.600 --> 2:15:31.880\n It's made\n\n2:15:31.880 --> 2:15:33.880\n for a bigger amount of people\n\n2:15:34.040 --> 2:15:35.080\n um\n\n2:15:35.080 --> 2:15:37.080\n For example, I one of my main\n\n2:15:37.080 --> 2:15:39.080\n strength\n\n2:15:39.080 --> 2:15:41.320\n Athletic strength is i'm an explosive person\n\n2:15:41.640 --> 2:15:46.760\n So i'll use technique that are explosive if I got a single leg my my one of my thing\n\n2:15:46.840 --> 2:15:49.400\n I like to do is to go for the double power double\n\n2:15:50.360 --> 2:15:51.880\n but for uh\n\n2:15:51.880 --> 2:15:56.520\n Someone else we got for example in a single leg position. Maybe he likes\n\n2:15:57.080 --> 2:16:03.480\n Like body throw better. He's more a greco guy like so or he's a judo guy. He's gonna go for something something else. So\n\n2:16:03.480 --> 2:16:10.280\n But there there is move that are I would say like you just mentioned are universal like statistically speaking. They're\n\n2:16:10.920 --> 2:16:18.440\n The highest percentage move that works for pretty much everybody everybody pretty much can do a an adhaka jimmy, you know\n\n2:16:18.440 --> 2:16:19.800\n It's very easy\n\n2:16:19.800 --> 2:16:23.960\n But it's not everybody that can lock a triangle with their legs\n\n2:16:24.040 --> 2:16:31.320\n So so those move like a rear naked choke adhaka jimmy is the highest percentage move because it's maybe\n\n2:16:31.320 --> 2:16:33.320\n It's maybe more accessible\n\n2:16:33.720 --> 2:16:37.880\n It's accessible for a bigger range. Yeah based on the physical characteristics of the people\n\n2:16:38.120 --> 2:16:45.080\n Do you draw any wisdom from these high percentages john for like in terms of what to focus on? Yeah, absolutely\n\n2:16:45.240 --> 2:16:49.400\n Um juditsu has an ocean of moves and you can get lost on that ocean\n\n2:16:49.960 --> 2:16:54.120\n You can drift for a long period of time and and and that was very little to show for it\n\n2:16:54.440 --> 2:16:57.640\n So my whole thing is focus. We only live one lifetime\n\n2:16:57.640 --> 2:17:01.560\n And your training lifetime is even shorter than your actual lifetime\n\n2:17:02.280 --> 2:17:03.160\n so\n\n2:17:03.160 --> 2:17:04.680\n in that time\n\n2:17:04.680 --> 2:17:06.680\n I must die on the mat\n\n2:17:07.800 --> 2:17:09.800\n That is the same. Yeah\n\n2:17:10.440 --> 2:17:14.840\n Uh, I I put a very high value on\n\n2:17:15.720 --> 2:17:18.380\n Choosing what I believe to be the most high percentage\n\n2:17:19.320 --> 2:17:23.240\n Uh moves and putting an extraordinary amount of focus on them\n\n2:17:23.240 --> 2:17:30.680\n Um, the only problem is that in one generation a move which can be considered low percentage might actually turn out to be high\n\n2:17:30.760 --> 2:17:32.760\n Percentage in another generation, for example\n\n2:17:33.320 --> 2:17:39.320\n We talked earlier about leg locks when I was first started judice. They were considered the ultimate low percentage move and\n\n2:17:39.880 --> 2:17:43.640\n Uh a big part of my career has been convincing people that in fact that was\n\n2:17:43.960 --> 2:17:48.680\n That was incorrect that they can be a high percentage move if we just change our approach to them\n\n2:17:49.400 --> 2:17:50.440\n um\n\n2:17:50.440 --> 2:17:52.120\n so we can't just\n\n2:17:52.120 --> 2:17:53.720\n Follow tradition\n\n2:17:53.720 --> 2:17:57.400\n And say oh, this is low percentage. This is high percentage. It has to be part of\n\n2:17:58.120 --> 2:18:01.260\n a fairly systematic study where you investigate\n\n2:18:02.440 --> 2:18:08.600\n What are the reasons why it's high percentage or low percentage with regards to takedowns?\n\n2:18:09.160 --> 2:18:11.160\n If you look at what?\n\n2:18:11.160 --> 2:18:13.800\n We can consider the most high percentage takedowns\n\n2:18:13.880 --> 2:18:19.080\n If you're in front of someone the single most high percentage way of taking them down is to get a hold of both of their legs\n\n2:18:19.080 --> 2:18:20.920\n And push them backwards\n\n2:18:20.920 --> 2:18:24.040\n Okay, if you get a hold of one of their legs and put a force on them\n\n2:18:24.280 --> 2:18:26.920\n They can use their other leg to defend themselves and hop around and\n\n2:18:27.400 --> 2:18:30.120\n Funk their way out of takedowns and cause all kinds of problems for you\n\n2:18:30.600 --> 2:18:33.960\n I don't care how athletic your opponent is if you get a hold a firm grip\n\n2:18:34.680 --> 2:18:38.120\n Of both of his legs and start pushing him backwards. He's going to fall down to his butt\n\n2:18:38.520 --> 2:18:41.320\n Now he might be able to recover from there, but he will fall down\n\n2:18:42.440 --> 2:18:44.920\n Even easier than that is to be behind someone\n\n2:18:44.920 --> 2:18:50.680\n Takedowns from in front of someone are difficult you go right into their hips their head their hands\n\n2:18:50.760 --> 2:18:55.960\n You go into all their defensive weapons. If you're already behind someone and you're doing what in america\n\n2:18:55.960 --> 2:19:01.160\n They refer to as a mat return. This is significantly easier than taking someone down from the front\n\n2:19:01.960 --> 2:19:04.840\n If you have control of their head in a front headlock position\n\n2:19:06.120 --> 2:19:11.160\n You have already closed distance on your opponent. You already have close contact. You don't have to worry about shooting anymore\n\n2:19:11.160 --> 2:19:16.600\n There's no sprawl out of that. You don't have to worry about guillotines kimoras or the uh, standard defenses\n\n2:19:16.680 --> 2:19:20.120\n Those will intrinsically be easier takedowns out of front headlock\n\n2:19:20.600 --> 2:19:24.840\n And so if we're going to talk about high percentage technique, I always go back to the mechanics of it\n\n2:19:25.400 --> 2:19:31.480\n Rather than just historical tradition because historical tradition can be wrong. It was wrong about leg locks\n\n2:19:31.880 --> 2:19:33.880\n It can be wrong about other things too\n\n2:19:34.040 --> 2:19:36.780\n So my primary thing is okay. Talk to me about mechanics\n\n2:19:36.780 --> 2:19:41.500\n That's what ultimately is going to determine whether something is high percentage or not. Um,\n\n2:19:41.900 --> 2:19:47.340\n Gordon pointed out earlier that when you're behind someone you have innate physical advantages over the other guy the human\n\n2:19:47.340 --> 2:19:51.900\n We the human body is set up entirely to to defend threats from the front\n\n2:19:52.620 --> 2:19:57.900\n We are poorly adapted to defending threats from the rear. We don't have eyes in the back of our head\n\n2:19:57.900 --> 2:19:59.900\n We can't apply pushing strength backwards\n\n2:20:00.220 --> 2:20:05.900\n If you get behind someone take downs are 10 times easier from behind someone than they are when you're in front of someone\n\n2:20:05.900 --> 2:20:09.740\n If you have to take someone down from the front get a hold of both of their legs\n\n2:20:10.220 --> 2:20:14.940\n If you can get a hold of both of their legs and impart a pushing force, you will almost always knock them down\n\n2:20:17.820 --> 2:20:19.820\n If you can get a hold of their head\n\n2:20:20.380 --> 2:20:22.220\n And work takedowns from there again\n\n2:20:22.220 --> 2:20:28.300\n It's much easier because most of their defensive apparatus is being taken away from them before the takedown even begins\n\n2:20:28.700 --> 2:20:29.660\n and so\n\n2:20:29.660 --> 2:20:33.980\n For me, the most high percentage takedowns will always be from the front double legs\n\n2:20:33.980 --> 2:20:40.140\n From the front double legs from any takedown from the back is going to be significantly easier than any takedown from the front\n\n2:20:40.460 --> 2:20:44.140\n So all manner of matte return takedowns are going to be very high percentage\n\n2:20:44.700 --> 2:20:45.820\n um\n\n2:20:45.820 --> 2:20:51.500\n And takedowns done out of situations where the opponent is broken down in front of you and you have either front headlock or front\n\n2:20:51.580 --> 2:20:55.420\n Chest wrap position are going to be significantly easier than takedowns from the open\n\n2:20:56.380 --> 2:20:58.700\n Of course, you have to consider the full\n\n2:20:58.700 --> 2:21:06.560\n Full spectrum of mechanics involved here. It's possible that an outside low single leading to a double leg is much higher percentage\n\n2:21:07.280 --> 2:21:09.600\n It's like there's a lot of chain wrestling yet\n\n2:21:09.680 --> 2:21:14.800\n You know that needs to be considered as a possibility maybe a straight on and part of this cultural too\n\n2:21:15.360 --> 2:21:19.360\n Are people afraid of this kind of thing that they came to be the case with leg locks?\n\n2:21:19.760 --> 2:21:21.680\n Are people aware of this?\n\n2:21:21.680 --> 2:21:24.880\n Are they worried about this? Are they training for this to defend this?\n\n2:21:24.880 --> 2:21:31.600\n And and then this opponent specific of course that um, you know with jordan boros people are preparing for the double\n\n2:21:31.600 --> 2:21:33.600\n Which is why he had to develop\n\n2:21:34.800 --> 2:21:40.000\n A whole other kinds of different stuff and then the head to all the different controls all the different ties\n\n2:21:40.560 --> 2:21:42.400\n within the rule set\n\n2:21:42.400 --> 2:21:47.440\n And that's where it's so fascinating to see the effect of rule set on all this judo over the past\n\n2:21:47.840 --> 2:21:54.240\n I think 20 years went through this every olympics different changes to the rule set like fundamentally different\n\n2:21:54.240 --> 2:22:00.800\n In terms of what's allowed to grip whether you're allowed to touch the legs at all. That was a big one in 2012, I think\n\n2:22:01.920 --> 2:22:04.560\n And and that changed the sport completely and so interesting\n\n2:22:04.720 --> 2:22:09.760\n It's so interesting to watch how tiny change in the rule can change the sport\n\n2:22:10.240 --> 2:22:13.680\n At the highest when you're talking about people competing at the highest level\n\n2:22:14.560 --> 2:22:16.480\n and the cool thing there is\n\n2:22:18.000 --> 2:22:20.800\n The rule change happens on a scale of every four years\n\n2:22:20.800 --> 2:22:26.580\n So you get to see people that are at the top of their game have to like recompute\n\n2:22:27.840 --> 2:22:31.520\n So it's not like you have a new generation of people coming up with the rules. They have to figure oh shit\n\n2:22:31.520 --> 2:22:36.720\n You're not allowed to like it's it's the equivalent of saying you're not allowed to kick anymore in mma\n\n2:22:37.680 --> 2:22:40.560\n Because you were not allowed to grab legs anymore in judo\n\n2:22:41.580 --> 2:22:47.600\n interestingly if you look at the case of judo if you look at the world rankings\n\n2:22:48.480 --> 2:22:50.000\n of athletes\n\n2:22:50.000 --> 2:22:57.360\n When they went through one of the most significant rule changes in judo history where they banned any form of grabbing the legs\n\n2:22:58.720 --> 2:23:01.440\n The ranking of athletes didn't change much\n\n2:23:02.720 --> 2:23:06.480\n Yeah, that tells you that they're um, there's a reason why those guys are at the top\n\n2:23:06.560 --> 2:23:09.840\n Yeah, and it doesn't have to do that. They're specific to a rule set\n\n2:23:10.640 --> 2:23:12.640\n Yeah, think about that in terms of\n\n2:23:13.280 --> 2:23:16.560\n Imagine for example in mixed martial arts if they just said hey\n\n2:23:17.200 --> 2:23:18.880\n starting next week\n\n2:23:18.880 --> 2:23:22.320\n Instead of having three five minute rounds. It's going to be 15 minutes straight\n\n2:23:23.200 --> 2:23:26.640\n That would massively change the preparation of the athletes\n\n2:23:27.680 --> 2:23:32.900\n It's a different game at that point and judo literally was a different game before 2010 and after 2010\n\n2:23:33.760 --> 2:23:35.200\n and yet\n\n2:23:35.200 --> 2:23:40.240\n The international rankings didn't really change that much the countries that were dominant before\n\n2:23:40.800 --> 2:23:45.760\n Remained dominant the athletes that remained before largely remained the same\n\n2:23:45.760 --> 2:23:54.000\n You would think was such a massive change all the rankings would have been thrown upside down, but they weren't and uh, again\n\n2:23:54.000 --> 2:23:58.720\n It goes back to this idea that there's a reason why the guys at the top are at the top\n\n2:24:00.080 --> 2:24:07.360\n And now for something completely different we talked about aliens earlier. Yeah, so uh, george brought up babasar. I I um,\n\n2:24:08.240 --> 2:24:11.680\n will likely probably talk to babasar on this podcast and then um\n\n2:24:11.680 --> 2:24:20.000\n Um, and then john had this a skeptical look on his face about about aliens. So let me ask uh, john and gordon\n\n2:24:20.880 --> 2:24:26.640\n Uh, do you think there's intelligent alien civilizations out there in the universe outside of our own?\n\n2:24:27.120 --> 2:24:29.760\n The universe is unimaginably large\n\n2:24:30.240 --> 2:24:36.080\n the idea that we are the only life forms in a cosmos as large as this is\n\n2:24:37.840 --> 2:24:39.840\n I think naive and foolish\n\n2:24:39.840 --> 2:24:41.840\n um\n\n2:24:41.840 --> 2:24:46.960\n There's a very high likelihood that if life could evolve on this planet that it could have done\n\n2:24:47.040 --> 2:24:51.120\n So on many many other planets around the uh around the cosmos\n\n2:24:51.600 --> 2:24:56.000\n I think anyone who puts even a moment's thought into this would realize that there's\n\n2:24:56.560 --> 2:24:58.880\n Almost certainly other forms of life out there\n\n2:24:59.760 --> 2:25:05.520\n the real question with regards the alien community is um, have they got here and are they\n\n2:25:05.520 --> 2:25:12.720\n Yeah, circling our planet in um little silver saucers and making observations and periodically stealing people\n\n2:25:13.360 --> 2:25:18.640\n For experimentation purposes doesn't have to be silver saucers. It could be different other color saucers\n\n2:25:18.800 --> 2:25:23.520\n Um, and that question i'm i'm i'm not at all convinced. No, I I don't think\n\n2:25:24.080 --> 2:25:25.040\n recently\n\n2:25:25.040 --> 2:25:27.040\n um navy footage\n\n2:25:27.200 --> 2:25:29.200\n has come out showing\n\n2:25:29.200 --> 2:25:37.120\n Some very interesting phenomena if you talk to almost any experienced pilot they will tell you they've seen things in the upper atmosphere\n\n2:25:37.200 --> 2:25:39.200\n That are very difficult to explain\n\n2:25:39.520 --> 2:25:41.520\n Uh, i'll be the first one to agree with you on this\n\n2:25:41.520 --> 2:25:47.040\n There are some things out there that are extremely difficult to explain like literally ufos unidentified\n\n2:25:47.200 --> 2:25:49.200\n Yeah, I mean we just don't know what they are\n\n2:25:49.280 --> 2:25:53.680\n but to go from the idea that there's things out there that we don't understand to\n\n2:25:55.040 --> 2:25:56.160\n there's\n\n2:25:56.160 --> 2:25:57.120\n like\n\n2:25:57.120 --> 2:26:02.000\n Little creatures running around and um, uh, and these somehow exist. Uh,\n\n2:26:02.880 --> 2:26:08.080\n I just reserve judgment. I just say i'm agnostic about these things. I think it's possible but\n\n2:26:08.400 --> 2:26:08.960\n um\n\n2:26:08.960 --> 2:26:14.880\n all the evidence that i've been showing so far was insufficient to come to any kind of definite conclusions until\n\n2:26:15.520 --> 2:26:19.520\n Aliens land in central park on tuesday afternoon at 3 p.m\n\n2:26:19.840 --> 2:26:23.440\n And get out with little alien ray guns and start shooting people. I didn't believe in\n\n2:26:24.400 --> 2:26:26.400\n Many of the stories that get told\n\n2:26:26.400 --> 2:26:33.280\n Well, what about if it's not little aliens with ray guns, but something very different very very difficult to detect for us humans\n\n2:26:33.760 --> 2:26:40.000\n That's very human central creature at that point. It's a it's a fascinating idea and it's certainly possible, but show me the evidence\n\n2:26:41.760 --> 2:26:43.760\n All right, what about you gordon\n\n2:26:44.320 --> 2:26:51.200\n Do you do you uh look at the cosmos and ponder the stars often? I think it's fair points. John raised\n\n2:26:51.760 --> 2:26:53.920\n uh, something really interesting I saw the other day was uh,\n\n2:26:53.920 --> 2:26:58.020\n Someone posted like if an alien organ or a civilization\n\n2:26:58.800 --> 2:27:00.800\n 65 million light years away\n\n2:27:00.800 --> 2:27:03.680\n Somehow managed to look at earth\n\n2:27:04.240 --> 2:27:10.000\n They would theoretically see the dinosaurs because they're 65 million light years away. So like imagine us looking at\n\n2:27:10.560 --> 2:27:15.280\n Galaxies that are 100 million light years away. That's 100 million years ago. You have no idea what it looks like now\n\n2:27:15.600 --> 2:27:17.600\n Um, so that's super interesting to me about it\n\n2:27:17.600 --> 2:27:23.680\n Yeah, the the expanse is huge and so much cool stuff could be going out there. Yeah, and um,\n\n2:27:24.400 --> 2:27:27.520\n The scary thing of course is if they haven't visited us yet\n\n2:27:28.320 --> 2:27:29.840\n the\n\n2:27:29.840 --> 2:27:31.840\n There has to be a good reason for it\n\n2:27:31.920 --> 2:27:38.720\n And the the set of scary reasons of all the fact that they maybe once you get sufficiently advanced in your development\n\n2:27:38.800 --> 2:27:42.400\n You destroy yourself naturally as humans seem to be approaching now\n\n2:27:42.400 --> 2:27:47.840\n We more and more have the tools to destroy ourselves completely in terms of our weapon systems\n\n2:27:49.200 --> 2:27:52.800\n Um, and we're developing them more and more and they're becoming better and better\n\n2:27:53.440 --> 2:27:57.120\n And then we're starting to get angry and anger on twitter and instagram at each other\n\n2:27:58.560 --> 2:28:00.560\n Those are good points you're raising\n\n2:28:01.520 --> 2:28:03.520\n History has taught us that\n\n2:28:03.840 --> 2:28:08.320\n Everything that lives one day will die. So we will we will perish one day. Yeah\n\n2:28:08.320 --> 2:28:12.960\n There's also just the the sheer difficulty of um, of\n\n2:28:14.000 --> 2:28:18.340\n Of travel through space like space is an unimaginably inhospitable\n\n2:28:19.340 --> 2:28:20.320\n environment\n\n2:28:20.320 --> 2:28:22.320\n And to the best of our knowledge\n\n2:28:24.800 --> 2:28:29.920\n This even the theoretical speeds that we can attain in space even if we could\n\n2:28:30.800 --> 2:28:33.920\n Travel at the speed of light. We're not even remotely close to that\n\n2:28:33.920 --> 2:28:40.000\n Still the distances that need to be traveled to get to even relatively close solar systems. Um,\n\n2:28:40.640 --> 2:28:43.540\n Very very long if you look at astronauts\n\n2:28:44.080 --> 2:28:48.320\n Who have spent significant amounts of time in space just orbiting the earth?\n\n2:28:48.480 --> 2:28:53.040\n It has severe health effects on them. We're just not built for space. We're supposed to be\n\n2:28:53.680 --> 2:28:59.840\n In a gravitational environment, but we you're referring to your biological meat bag that's containing the essence\n\n2:28:59.840 --> 2:29:03.440\n Of the mind that is john donahoe. Maybe we can transfer the mind\n\n2:29:04.000 --> 2:29:05.200\n alone\n\n2:29:05.200 --> 2:29:09.280\n The the the the bag the meat the meat bag is not designed for space\n\n2:29:09.280 --> 2:29:12.080\n But maybe the but again, this is all that's of the mind. It's\n\n2:29:13.280 --> 2:29:18.660\n It's possible, but what do you think of concrete evidence you folks who like difficult things?\n\n2:29:20.080 --> 2:29:23.380\n Uh, what do you think about uh, elon musk going to colonize mars?\n\n2:29:24.960 --> 2:29:26.960\n Is this something that's going to happen?\n\n2:29:26.960 --> 2:29:33.600\n Colonize mars. Is this something you find an interesting or a um,\n\n2:29:35.920 --> 2:29:39.600\n Aimless pursuit. I think it's a must or a salvation\n\n2:29:39.920 --> 2:29:46.240\n We need to leave at some point the planet because historically in the past we know that we've been bombarded by a steroid\n\n2:29:46.780 --> 2:29:48.240\n volcano\n\n2:29:48.240 --> 2:29:52.880\n There are crazy things happen here. It's very unstable. You know, we if you look at it to\n\n2:29:52.880 --> 2:29:59.440\n To a lifetime of a human being it's nothing but just look 12 000 years ago. What happened, you know, so so\n\n2:29:59.840 --> 2:30:03.680\n There is cataclysm that happen all the time. It's very unstable. So\n\n2:30:04.400 --> 2:30:10.000\n if we want to survive as a species, I think it's it's we need to get out to be able to get out and\n\n2:30:10.640 --> 2:30:12.080\n spread our seed\n\n2:30:12.080 --> 2:30:16.240\n so these are the early steps on a on a really long journey, but is there something about like\n\n2:30:16.240 --> 2:30:22.500\n You know, we we don't get that exploration from most of modern society, you know, the kind of exploring that people did throughout the centuries\n\n2:30:23.040 --> 2:30:25.040\n of uh, you know coming to the\n\n2:30:25.600 --> 2:30:31.360\n North america just throughout we were shrouded in physical uncertainty of what's out there\n\n2:30:32.320 --> 2:30:34.960\n And now we get to do the same kind of exploration with mars\n\n2:30:35.520 --> 2:30:42.240\n Is there so I mean is there any aspect of you that wants to travel out to space that wants to travel to mars?\n\n2:30:42.240 --> 2:30:45.760\n There, you know, the goal is to allow civilians to travel\n\n2:30:46.720 --> 2:30:48.560\n Perhaps in our lifetime\n\n2:30:48.560 --> 2:30:51.220\n Meaning affordably you can do so now unaffordably\n\n2:30:52.400 --> 2:30:57.440\n Traveling to space and traveling to mars are two different things. I think I would like to travel into space\n\n2:30:58.400 --> 2:31:02.160\n I don't know if I would like to travel all the way to mars because of the risks involved\n\n2:31:03.600 --> 2:31:05.120\n just because\n\n2:31:05.120 --> 2:31:06.400\n Boring\n\n2:31:06.400 --> 2:31:10.080\n Is there some part of you that enjoys the I think that if I was like towards the end of my life\n\n2:31:10.080 --> 2:31:14.400\n I would like to travel to mars because it'll be nice just die just for the experience. Yeah, but if I go to mars\n\n2:31:14.400 --> 2:31:16.400\n I'm not coming back. I think that's it\n\n2:31:17.120 --> 2:31:19.120\n one way ticket\n\n2:31:19.200 --> 2:31:22.160\n May with the technology we have now maybe in the future maybe our\n\n2:31:22.960 --> 2:31:30.560\n The children of our children will will be able to to experience that to go to the well the the weekend on mars\n\n2:31:31.600 --> 2:31:37.040\n Uh, well the the whole design of the starship that spacex is working on is supposed to come back\n\n2:31:37.040 --> 2:31:41.120\n Supposed to be reusable. So it's not it's not a one way ticket. That's the whole point\n\n2:31:41.680 --> 2:31:46.560\n It's always going back and forth back and forth. What's the time frame between two planets?\n\n2:31:47.120 --> 2:31:51.520\n Like to travel from I think the current thing you'd be stuck on mars for two years\n\n2:31:52.080 --> 2:31:57.040\n But how long does it take to get from earth to mars? Oh, it's pretty I'm not exactly sure but it's pretty quick\n\n2:31:57.840 --> 2:32:03.600\n It's pretty quick. Like, uh, I don't know and the scale of months not scale of years. You might not be healthy\n\n2:32:03.600 --> 2:32:10.080\n When you come back, you know, all the astronauts they experience health issues, you know, they lose a lot of muscle mass bone density. So\n\n2:32:10.720 --> 2:32:13.600\n Yeah, I don't think the technology is good right now. I mean\n\n2:32:14.160 --> 2:32:19.120\n Let's say that it is I would love to be doing it for a weekend if it's safe\n\n2:32:19.120 --> 2:32:24.720\n I would love to be the first one to do it for a professional fighter who sacrifices body for something\n\n2:32:25.200 --> 2:32:30.560\n So there's some sacrifice we do in life, right? I don't want to be the first I wouldn't want to I least\n\n2:32:30.560 --> 2:32:34.640\n The other one but when I know it's it's safe. Okay, count me in\n\n2:32:34.640 --> 2:32:37.680\n So one of the things that people say and this is something I wonder about is\n\n2:32:38.160 --> 2:32:43.680\n It's like having children or something once you see once you're out in space and you look out and you see earth\n\n2:32:43.680 --> 2:32:48.720\n You look back at earth. That's an experience. It's not like anything else like you can't replicate it here\n\n2:32:49.680 --> 2:32:52.720\n Um is to look back at that like blue dot\n\n2:32:53.680 --> 2:32:55.680\n And that's nerve wracking\n\n2:32:55.680 --> 2:33:00.800\n Like you see like earth disappear into the distance. Yeah. Yeah disappear\n\n2:33:01.360 --> 2:33:04.320\n Into the distance and then you get to actually stand on mars and see\n\n2:33:04.880 --> 2:33:07.920\n And just to look you're standing on the ground and you're looking out\n\n2:33:08.480 --> 2:33:12.400\n And you see the planet from which you came and where you might not be coming back\n\n2:33:12.800 --> 2:33:15.840\n But there's a challenge to the whole thing. Whereas the risk is tremendous\n\n2:33:16.960 --> 2:33:22.000\n And I don't know I find that risk really compelling for some reason but that could be just\n\n2:33:22.000 --> 2:33:26.080\n The exploration like I guess that's a genetic thing too. How much do you want to explore?\n\n2:33:27.680 --> 2:33:34.080\n There's a sense though in which even in the best case scenario where they did get the technology to whisk you to mars and\n\n2:33:34.800 --> 2:33:35.520\n in a\n\n2:33:35.520 --> 2:33:37.520\n fairly short period of time\n\n2:33:37.520 --> 2:33:41.360\n it's kind of an inauthentic sense of exploration because\n\n2:33:42.000 --> 2:33:44.080\n your participation in it is\n\n2:33:45.040 --> 2:33:47.280\n no more exciting than your\n\n2:33:47.280 --> 2:33:51.680\n Participation in an airline flight to a foreign country. You're basically you\n\n2:33:51.840 --> 2:33:57.040\n You didn't have anything to do with the creation of the of the vessel. You're not in command of the vessel. You're not\n\n2:33:57.680 --> 2:34:00.080\n In any way shape or form important to the mission\n\n2:34:00.560 --> 2:34:02.560\n You're just a person sitting in a passenger seat\n\n2:34:02.800 --> 2:34:07.600\n And you get off in a destination the same way you would if you flew to singapore or london or someplace like that\n\n2:34:07.920 --> 2:34:12.880\n Well, there's a hierarchy of there's a leadership and then there's a bunch of people that all have roles\n\n2:34:12.880 --> 2:34:17.440\n There's a hierarchy of there's a leadership and then there's a bunch of people and they all have roles\n\n2:34:17.520 --> 2:34:21.040\n You don't get to go to mars without having a skill set to contribute\n\n2:34:21.520 --> 2:34:24.560\n You made it sound like space tourism where you just pay a ticket\n\n2:34:24.480 --> 2:34:29.920\n I I don't I think it's a long time before you have space tourism to mars. We have nothing to contribute\n\n2:34:30.880 --> 2:34:35.920\n Okay, like you will have to tell what you do you go through like a training program you go training program and then there's uh,\n\n2:34:36.080 --> 2:34:38.800\n There's technical things you'll be contributing. So they would bring\n\n2:34:39.360 --> 2:34:40.560\n people\n\n2:34:40.560 --> 2:34:43.760\n You know in terms of agriculture, I don't know. Okay, so this is this is better\n\n2:34:43.840 --> 2:34:48.080\n This sounds like they're actual they're more like explorers like if you talked before about\n\n2:34:48.700 --> 2:34:50.700\n explorers and and human history where\n\n2:34:51.040 --> 2:34:56.000\n Magellan sets off on his boat and every person on the boat had a specific function. They were they were all\n\n2:34:56.960 --> 2:35:02.160\n Into the mission in a very authentic fashion if they weren't on the boat the performance of the crew would somehow suffer\n\n2:35:02.560 --> 2:35:08.320\n So this sounds much better and just with like with Magellan. I think most of the crew died\n\n2:35:08.320 --> 2:35:10.320\n A significant number did yeah\n\n2:35:12.800 --> 2:35:20.240\n And from uh, yeah from bacteria, I mean from things that are unexpected and so on and if we discover life on mars\n\n2:35:20.640 --> 2:35:24.960\n I mean, who knows what that entails because that's like a manned mission to mars\n\n2:35:25.520 --> 2:35:29.520\n Would likely be very driven by the research to do all the kind of um\n\n2:35:30.540 --> 2:35:36.480\n Exploration required to find life now from uh, mr. Musk's, uh\n\n2:35:36.480 --> 2:35:41.840\n Uh point of view as a developer presumably there has to be some kind of financial incentive here, too\n\n2:35:42.480 --> 2:35:43.680\n is there\n\n2:35:43.680 --> 2:35:47.760\n some kind of financial benefit to mars missions is is\n\n2:35:48.940 --> 2:35:50.400\n presumably\n\n2:35:50.400 --> 2:35:51.360\n um\n\n2:35:51.360 --> 2:35:57.360\n There wouldn't be that many people on earth that could afford a ticket to pay for the kind of research and development that would require\n\n2:35:57.360 --> 2:36:01.440\n This is there some kind of mining on mars of minerals that would be useful\n\n2:36:01.440 --> 2:36:06.640\n I think there's a lot of answers to this but the only honest answer is the one that looks back into human history\n\n2:36:06.640 --> 2:36:09.520\n Where we did a lot of things just because we we could\n\n2:36:10.240 --> 2:36:16.240\n A lot of hard things just because we could and that led to a lot of innovation that ultimately made our life better\n\n2:36:16.640 --> 2:36:22.640\n So this is more this is why you have nasa. This is why you have government organizations. Like what's the purpose of nasa?\n\n2:36:23.040 --> 2:36:25.600\n NASA would answer that by saying okay. Well, we're helping\n\n2:36:25.600 --> 2:36:32.160\n We're helping launch satellites up there all that they'll have a bunch of answers, but the reality is the programs\n\n2:36:33.200 --> 2:36:34.160\n were\n\n2:36:34.160 --> 2:36:37.840\n funded in large part by our desire to explore the unknown\n\n2:36:38.640 --> 2:36:43.840\n and um, there's some aspect to which we have to all invest into that because historically speaking\n\n2:36:44.640 --> 2:36:48.180\n That has produced a lot of cool things along the way that were totally unexpected\n\n2:36:48.640 --> 2:36:52.560\n Like uh, but nasa is funded by public funding the taxpayer\n\n2:36:52.560 --> 2:36:57.040\n Uh, how is mr. Musk going to fund this? Well currently\n\n2:36:57.840 --> 2:37:00.960\n most of the funding was the spacex is nasa giving\n\n2:37:01.600 --> 2:37:02.640\n money\n\n2:37:02.640 --> 2:37:04.400\n uh to\n\n2:37:04.400 --> 2:37:09.600\n So they're making a competition who can who can get our satellites. We need to go to\n\n2:37:10.400 --> 2:37:11.600\n um\n\n2:37:11.600 --> 2:37:13.600\n you know for the space station to\n\n2:37:14.240 --> 2:37:19.680\n Resupply the space station or we need to launch satellites up who's going to carry those quote unquote payloads\n\n2:37:19.680 --> 2:37:22.880\n But they just need so nasa's paying whoever the heck wants to\n\n2:37:23.440 --> 2:37:24.960\n uh get\n\n2:37:24.960 --> 2:37:27.920\n kilograms of thing up into space\n\n2:37:28.640 --> 2:37:32.240\n Why did this is nasa's specialty? Why did they just give up on that?\n\n2:37:32.400 --> 2:37:40.000\n Well, they why they realized or mr. Musk came along and then bezos and others that said we could do it for one tenth the price\n\n2:37:41.360 --> 2:37:46.240\n So why did the why should the taxpayers pay for the why don't you nasa do what you do well?\n\n2:37:46.240 --> 2:37:50.320\n You know, which is like test out cutting edge stuff. Make sure they're safe\n\n2:37:50.880 --> 2:37:52.080\n and now\n\n2:37:52.080 --> 2:37:54.080\n That we've developed\n\n2:37:54.080 --> 2:37:55.760\n um a car\n\n2:37:55.760 --> 2:37:58.800\n Let us let us ups and fedex take care of\n\n2:37:59.600 --> 2:38:03.360\n Doing this at scale doing it cheaper doing it better. I mean that's the argument\n\n2:38:03.920 --> 2:38:07.680\n And nasa took what they realized is it took way way too long to do stuff\n\n2:38:08.400 --> 2:38:12.080\n When you're investing millions if there's billions of dollars into a project\n\n2:38:12.880 --> 2:38:13.760\n the\n\n2:38:13.760 --> 2:38:15.760\n the bureaucracy builds up\n\n2:38:15.760 --> 2:38:20.160\n And the conservatism builds up to where you're I mean you really have to test everything out\n\n2:38:20.240 --> 2:38:25.360\n So projects take years and then you have somebody like ilan musk coming along and says well, let's do\n\n2:38:25.920 --> 2:38:27.360\n launches every\n\n2:38:27.360 --> 2:38:35.460\n Every week and as opposed to just throwing away the rocket. We'll reuse the rocket. That was one of the sort of cutting edge inventions\n\n2:38:36.000 --> 2:38:38.000\n It's a dumb obvious idea\n\n2:38:38.800 --> 2:38:44.160\n Like ilan says why do you throw away the play? It's the equivalent as if you flew a plane every time you threw it away\n\n2:38:44.160 --> 2:38:46.480\n Why are we every time throwing away the plane?\n\n2:38:46.480 --> 2:38:50.420\n But nasa's tried that kind of thing with the space shuttle since the 1970s\n\n2:38:50.480 --> 2:38:57.440\n And yes, well, they did that with the space shuttle, but not not at the scale here that uh, it was the space shuttle was seen as this\n\n2:38:58.160 --> 2:38:59.100\n like\n\n2:38:59.100 --> 2:39:05.760\n Majestic amazing thing that requires a huge amount of investment with ilan musk is like no every basic rocket\n\n2:39:06.320 --> 2:39:07.920\n Should be reusable\n\n2:39:07.920 --> 2:39:11.280\n Nice cut cut cost cut cost. Do you do you think like?\n\n2:39:11.280 --> 2:39:15.120\n Like the more technology we have the more advanced we become the more\n\n2:39:15.740 --> 2:39:20.640\n Specialized we need to be like is that for that reason that now they they there's different branch\n\n2:39:20.720 --> 2:39:25.760\n Like you just explained out now that so they're specialized in this but they left, you know other branch\n\n2:39:26.000 --> 2:39:30.960\n Yeah, there's there's the greater and greater specializations. We build up more stuff, which is fascinating because\n\n2:39:32.000 --> 2:39:34.000\n Is it making us?\n\n2:39:34.160 --> 2:39:35.120\n more\n\n2:39:35.120 --> 2:39:39.040\n Dumb in a way. Do you think like like like yeah, I don't know like\n\n2:39:39.040 --> 2:39:44.480\n Like you you know, but I use a cell phone, but I don't know how to build it up from that\n\n2:39:44.560 --> 2:39:47.600\n I mean, it's that beta males building up this whole society\n\n2:39:48.000 --> 2:39:53.680\n um, because we're this collective intelligence we rely on each other more and more and\n\n2:39:54.400 --> 2:39:55.360\n it\n\n2:39:55.360 --> 2:39:58.960\n I do also see sort of the rise of conspiracy theories and all those kinds of things\n\n2:39:59.440 --> 2:40:01.440\n because\n\n2:40:01.840 --> 2:40:07.280\n Like i've been talking to a few folks about flat earth recently it's fascinating it's fascinating\n\n2:40:07.280 --> 2:40:10.480\n there's a large community of people that believe the earth is flat and\n\n2:40:11.520 --> 2:40:17.760\n That idea takes hold in this day and age of all the ideas. That's the one that takes hold for a large number of people\n\n2:40:18.240 --> 2:40:19.680\n and\n\n2:40:19.680 --> 2:40:24.560\n I think that's a consequence of this kind of specialization where it's just a huge amount of experts\n\n2:40:25.120 --> 2:40:30.080\n But if you look out into our world and try to reason simply about our existence\n\n2:40:30.400 --> 2:40:36.160\n We we are losing the skills to do that because more and more people are specialized as opposed to general thinkers\n\n2:40:36.160 --> 2:40:41.600\n We're like extremely good at specific things. Are we capable now to do?\n\n2:40:42.400 --> 2:40:44.400\n A robot that is self aware\n\n2:40:45.360 --> 2:40:49.840\n That's that's one the legged one. I uh, it's self aware. It's not self aware\n\n2:40:49.840 --> 2:40:56.640\n It's been listening, but it's not self aware. But do you think a human being is self aware or that's a good question\n\n2:40:57.360 --> 2:41:01.440\n I mean I ask this question all the time when the robots move there's a sense of\n\n2:41:03.840 --> 2:41:05.520\n When they turn on\n\n2:41:05.520 --> 2:41:07.520\n Something entered that robot\n\n2:41:07.840 --> 2:41:10.000\n Wow, and when it turns off something left\n\n2:41:11.440 --> 2:41:18.560\n Uh if they move in a certain kind of way and if they're if they surprise you there's certain elements that enable us\n\n2:41:19.600 --> 2:41:21.600\n to see the magic in\n\n2:41:21.840 --> 2:41:26.960\n In a living being and some of them I mean we can care we can maybe list them\n\n2:41:27.600 --> 2:41:30.720\n but it's the ability to surprise you it's the\n\n2:41:30.720 --> 2:41:38.160\n The ability to make mistakes and learn from them visibly there's a bunch of things that you just\n\n2:41:39.360 --> 2:41:41.120\n I don't know. It just feels\n\n2:41:41.120 --> 2:41:43.680\n Like it has the magic of what is a living being\n\n2:41:44.240 --> 2:41:49.840\n And which is what humans have and I try to think about how do you replicate that into a machine?\n\n2:41:50.480 --> 2:41:55.360\n So when you turn it on enough you feel like it dies every time and he reborn\n\n2:41:55.600 --> 2:41:59.440\n So for most machines, we don't feel that way. We don't when we unplug things\n\n2:41:59.440 --> 2:42:06.240\n Things we don't feel that way. I don't know why we don't feel that way. That's an interesting question. But I think when\n\n2:42:08.640 --> 2:42:10.660\n When the robot has certain qualities\n\n2:42:11.920 --> 2:42:13.840\n like memory\n\n2:42:13.840 --> 2:42:15.840\n Like ability to recognize you\n\n2:42:16.880 --> 2:42:19.360\n Yeah, you start to feel like you're turning off an organism\n\n2:42:19.920 --> 2:42:22.880\n So so whenever I have like the robots that recognize me\n\n2:42:23.440 --> 2:42:28.480\n And remember this is important that all the things we've experienced together\n\n2:42:28.480 --> 2:42:30.480\n Then it's like holy shit\n\n2:42:30.560 --> 2:42:35.760\n That's a that's a living thing. But does he remember? It feels like a living thing. Does he remember\n\n2:42:36.400 --> 2:42:42.800\n Your robot does he remember things that happened before you unplugged it? Is it like he's sleeping?\n\n2:42:43.360 --> 2:42:49.600\n Like is he wake up or is he like that? So right now we start to zero everything. Uh, no, it doesn't start at zero\n\n2:42:49.600 --> 2:42:54.400\n It remembers everything. That's the key. Every time you like you you unplug. Wow\n\n2:42:54.400 --> 2:42:57.600\n It's storing the memory, but the memories are basic. They're like\n\n2:42:57.600 --> 2:43:00.640\n they're like, okay, we walked around the kitchen and then\n\n2:43:01.760 --> 2:43:08.160\n Um, you looked at me. I mean the memories it's like data. It's just it's not like we've experienced it's able to actually\n\n2:43:08.800 --> 2:43:13.440\n Uh experience anything deep like we humans can but just the fact of memory\n\n2:43:14.320 --> 2:43:18.880\n It's like the toaster or the microwave. Don't don't give a shit about me\n\n2:43:19.520 --> 2:43:23.440\n They don't know me. They don't know me by name. They wouldn't recognize my face\n\n2:43:23.440 --> 2:43:27.840\n As being different from gordon's they wouldn't know the difference and they wouldn't\n\n2:43:28.460 --> 2:43:33.920\n Remember the microwave currently doesn't remember, you know, the times i've been sad or happy\n\n2:43:34.480 --> 2:43:36.480\n Like what food I put into it\n\n2:43:36.560 --> 2:43:41.280\n it doesn't remember this when I was being a fat ass or what I was being in good shape and\n\n2:43:41.840 --> 2:43:46.160\n All just those memories are enough to make you feel when you turn a thing off\n\n2:43:46.800 --> 2:43:48.800\n That's like shit\n\n2:43:48.800 --> 2:43:54.640\n That's a living that's that that's a living thing disappearing. Of course, that's kind of an anthropomorphism we do to each other\n\n2:43:55.760 --> 2:43:57.760\n But uh, that's something\n\n2:43:58.160 --> 2:43:59.760\n You know that\n\n2:43:59.760 --> 2:44:03.040\n That's something that makes me believe it's possible to create. Um\n\n2:44:05.200 --> 2:44:11.040\n Systems with which we can have a connection that are nonhuman like similar to dogs and cats and so on\n\n2:44:11.040 --> 2:44:18.180\n It just makes me and that's what's interesting to me because ultimately I feel like that'll help us understand ourselves\n\n2:44:20.160 --> 2:44:23.440\n And maybe practice grappling moves anyway, um\n\n2:44:26.720 --> 2:44:29.120\n Well, let me ask the uh advice question\n\n2:44:29.760 --> 2:44:34.000\n Uh, now that we're together i've asked i've spoken to john. I spoke to george\n\n2:44:34.720 --> 2:44:37.440\n What what advice would you give to young folks whether?\n\n2:44:38.080 --> 2:44:39.680\n we're talking about\n\n2:44:39.680 --> 2:44:46.800\n sport like excelling becoming great at grappling becoming great at fighting become a great at whatever sport they take on or\n\n2:44:47.040 --> 2:44:50.400\n Life in general whether there may be in high school or in college\n\n2:44:50.960 --> 2:44:54.160\n What advice would you give them to uh, excel?\n\n2:44:55.200 --> 2:45:00.880\n At that thing they take on I don't know if i'm qualified to answer this because i'm only 26\n\n2:45:01.200 --> 2:45:05.200\n So you're at the top you said giving advice to young people. Um\n\n2:45:06.160 --> 2:45:08.160\n for me, I think the two biggest things are\n\n2:45:08.160 --> 2:45:12.400\n Are find something that you're both talented in and you enjoy\n\n2:45:12.880 --> 2:45:14.000\n um\n\n2:45:14.000 --> 2:45:18.800\n I think that if you enjoy something, but you're terrible at it. It's going to be hard for you to be successful\n\n2:45:19.520 --> 2:45:21.600\n In life at that given in that given area\n\n2:45:22.000 --> 2:45:26.560\n Um, and it's going to be hard to do something for long amounts of time\n\n2:45:27.120 --> 2:45:32.080\n Uh if you're talented at it, but you don't enjoy doing it. Um, it's easy to come in\n\n2:45:32.800 --> 2:45:33.760\n and\n\n2:45:33.760 --> 2:45:39.360\n train hard for a month or for two months or for a year, um, you can be very talented at it\n\n2:45:39.680 --> 2:45:42.400\n But if you come in it's but it's a different story to come in\n\n2:45:42.960 --> 2:45:47.360\n every day for five years in a row for 10 years in a row for 15 years in a row, um, so I think\n\n2:45:48.720 --> 2:45:50.880\n I think finding something that you're both talented in\n\n2:45:51.760 --> 2:45:55.040\n And something you enjoy are probably the two biggest things for me\n\n2:45:55.520 --> 2:46:02.240\n How do you find the joy in it? So you've been training insane amount, you know a lot you've been doing it for a long time\n\n2:46:02.240 --> 2:46:05.440\n Um, is there's is there ways to rediscover the joy in it?\n\n2:46:06.080 --> 2:46:08.080\n Yeah for me initially\n\n2:46:08.160 --> 2:46:10.880\n It was just learning new stuff, you know\n\n2:46:11.120 --> 2:46:16.080\n You come in as a white belt and every day you learn you see a different move and you're like, oh man, it's that's awesome\n\n2:46:16.640 --> 2:46:22.320\n um, and then when I started to compete more seriously towards my professional career it was\n\n2:46:22.880 --> 2:46:28.480\n Uh the joy of doing camps and seeing the result of those camps and beating high level athletes\n\n2:46:28.480 --> 2:46:33.040\n Um, and then it got to a point where i'd beaten all the high level athletes already. So\n\n2:46:33.840 --> 2:46:37.680\n Who am I gonna compete against? Um, so now for me the joy is just\n\n2:46:38.880 --> 2:46:39.920\n being\n\n2:46:39.920 --> 2:46:47.040\n The best athlete I can possibly be until I reach my pride which i'm hoping is somewhere between 35 and 40\n\n2:46:47.520 --> 2:46:50.000\n Um, so instead of competing against the other athletes\n\n2:46:50.800 --> 2:46:53.440\n I'll be bored already because I already beat all the rest of the guys\n\n2:46:53.920 --> 2:46:55.760\n um, but\n\n2:46:55.760 --> 2:47:00.240\n I know that now I know that I can be better in a year from now or two years from now\n\n2:47:00.400 --> 2:47:02.880\n Than I am today and that for me is exciting\n\n2:47:04.240 --> 2:47:07.680\n By the way, is there some aspect of teaching that's exciting to you?\n\n2:47:07.840 --> 2:47:14.240\n Yeah, I because you become a better and better teacher over the years. Yeah. Yeah, I definitely uh, I enjoy teaching and\n\n2:47:15.360 --> 2:47:16.640\n I used to teach\n\n2:47:16.640 --> 2:47:17.680\n um\n\n2:47:17.680 --> 2:47:22.480\n A lot before I met john and then I met john and I was like, yeah, I just have no idea how to teach\n\n2:47:22.480 --> 2:47:25.760\n Um, so that's like a completely different element, uh of the sport\n\n2:47:26.160 --> 2:47:30.000\n Um, you know doing things and being good at doing things or being good at winning\n\n2:47:30.320 --> 2:47:33.280\n uh and actually being able to communicate those skills and knowledge to\n\n2:47:34.000 --> 2:47:37.120\n To a vast amount of people is two completely different things\n\n2:47:38.320 --> 2:47:40.320\n George advice for young people\n\n2:47:40.960 --> 2:47:42.800\n like yourself\n\n2:47:42.800 --> 2:47:44.000\n well\n\n2:47:44.000 --> 2:47:46.720\n First I was I would tell them find\n\n2:47:47.440 --> 2:47:50.000\n What you want to become what you want to do?\n\n2:47:50.800 --> 2:47:52.400\n and long term\n\n2:47:52.400 --> 2:47:57.680\n Use certain things maybe sometimes you don't love but where you want to propel yourself in the future?\n\n2:47:58.160 --> 2:48:03.120\n Not what your parent your your friend wants you to become what you you you want to become\n\n2:48:04.000 --> 2:48:06.000\n So one once you find it\n\n2:48:07.200 --> 2:48:08.320\n You cannot\n\n2:48:08.320 --> 2:48:14.960\n Doing it by yourself everything that are that is big achievement in life. We cannot do it doing it by ourselves\n\n2:48:14.960 --> 2:48:17.280\n so what I would say is second thing is\n\n2:48:17.280 --> 2:48:21.920\n Try to build up your team and try to build up your team to be able to achieve your goal\n\n2:48:23.440 --> 2:48:25.440\n Of people that are competent\n\n2:48:25.920 --> 2:48:27.920\n And people that you trust\n\n2:48:27.920 --> 2:48:29.920\n You need both competency and trust\n\n2:48:30.560 --> 2:48:38.080\n I see a lot of people sometime in business. For example, they hire people they that are that they trust but they turns out to be incompetent\n\n2:48:38.880 --> 2:48:43.600\n So now you have to fire a friend or otherwise your business going down the same problem\n\n2:48:43.600 --> 2:48:48.720\n If you do the opposite you are you're someone that is competent, but you cannot trust is gonna is gonna screw you, you know\n\n2:48:49.680 --> 2:48:54.880\n So it's very important to stay away from the negative build up your team people you trust and that are competent\n\n2:48:56.080 --> 2:49:01.600\n And I would say the third one is to work to work hard to sacrifice yourself\n\n2:49:01.600 --> 2:49:06.880\n Yeah, you have to go through hell sometime, but yeah, you have to see the light at the end of of it\n\n2:49:06.880 --> 2:49:11.440\n You know to keep your dream in mind is going to give you the motivation to go through the tough time\n\n2:49:11.440 --> 2:49:15.520\n It's nothing easy to go work work work. It's nothing you can accomplish without hard work\n\n2:49:17.840 --> 2:49:19.840\n The fourth one I would say\n\n2:49:19.840 --> 2:49:21.840\n To invest on yourself constantly\n\n2:49:22.480 --> 2:49:28.640\n If you do not invest on yourself on whatever you are in which business and sport the game will catch up to you\n\n2:49:29.360 --> 2:49:31.360\n For example, if you're if you become\n\n2:49:32.080 --> 2:49:38.640\n Champion at something and if you stop improving the other guys that are trying to be champion, they're gonna catch up to you\n\n2:49:38.640 --> 2:49:41.280\n So you need to invest on yourself and most people\n\n2:49:42.080 --> 2:49:44.720\n Most athlete they make the mistake when they start to having money\n\n2:49:45.600 --> 2:49:50.320\n They buy luxury stuff and that's one thing I didn't do when I start making money\n\n2:49:50.320 --> 2:49:55.120\n I was investing of on traveling to new york trying with john gordon and the guys to learn\n\n2:49:55.760 --> 2:50:01.040\n What is new in the the game of jiu jitsu? I used to go in thailand train muay thai\n\n2:50:01.040 --> 2:50:07.200\n In las angeles to perfect my boxing skill\n\n2:50:07.760 --> 2:50:14.480\n So instead of taking that money to buy me jewelry cars and to do what a lot of guys do because it's a mistake\n\n2:50:15.360 --> 2:50:19.600\n I I invest it on myself because I know there were people coming they don't want my place\n\n2:50:19.600 --> 2:50:21.600\n So I want I didn't want them to catch me\n\n2:50:23.040 --> 2:50:26.720\n And the last one I would say it seems weird I would say\n\n2:50:26.720 --> 2:50:33.840\n To give back and it's not because i'm a nice guy and it's not that I don't say that to look good. I say that\n\n2:50:34.720 --> 2:50:36.720\n When you you make it\n\n2:50:38.720 --> 2:50:42.240\n It creates opportunity where you can help certain group of people\n\n2:50:43.520 --> 2:50:50.160\n But when I say give back not give back to everybody to anybody give back only to the the cause that you want\n\n2:50:50.480 --> 2:50:51.840\n I give back\n\n2:50:51.840 --> 2:50:54.320\n Not because i'm a nice guy. I'm kind of it's kind of selfish\n\n2:50:54.320 --> 2:50:56.960\n I only give back to the people that I want to give back\n\n2:50:57.680 --> 2:51:01.360\n Because I give back to them and I know that if i'm more successful\n\n2:51:01.840 --> 2:51:06.640\n I'm going to be able to give back to people. I loved the cause that that that count for me\n\n2:51:06.880 --> 2:51:10.720\n So it's it brings me more motivation because I don't compete\n\n2:51:11.440 --> 2:51:15.040\n For myself anymore. I compete to help people. I love in a way\n\n2:51:15.840 --> 2:51:22.560\n So when you you reach the top in your game, you need to find new motivation if you're satisfied is\n\n2:51:22.560 --> 2:51:26.000\n The end of it your success will go down. So you need to\n\n2:51:26.560 --> 2:51:30.160\n To find new motivation. What can motivate you? You know, what do you want?\n\n2:51:30.160 --> 2:51:33.280\n Oh, I want to help this so I need to to be successful. I want to\n\n2:51:34.000 --> 2:51:38.240\n You know, you need to find reason who what you want to do with your success\n\n2:51:38.640 --> 2:51:44.160\n So when I say give back it's not because i'm not because i'm necessarily it's not to be to look like a nice guy\n\n2:51:44.160 --> 2:51:46.160\n To keep your motivation\n\n2:51:46.320 --> 2:51:47.840\n to be able to\n\n2:51:47.840 --> 2:51:49.840\n Keep climbing the ladder even more\n\n2:51:49.840 --> 2:51:52.320\n That's beautiful, george, uh, john\n\n2:51:53.360 --> 2:52:00.240\n Um, first off the two responses given so far covered. I think the most important things already. Um,\n\n2:52:01.040 --> 2:52:07.280\n Gordon talked about the the need for an underlying passion and enjoyment if you don't have that\n\n2:52:07.920 --> 2:52:11.040\n You're not going to have the longevity that is required in order to build\n\n2:52:12.080 --> 2:52:15.680\n Skills, which is ultimately everything's going to come down to your ability to build skills\n\n2:52:15.680 --> 2:52:20.480\n You've got to have some kind of underlying passion and enjoyment which will keep you in the game long enough\n\n2:52:21.040 --> 2:52:27.280\n To build world championship skills. It's going to take a minimum of five years and quite possibly considerably longer than that\n\n2:52:28.160 --> 2:52:33.120\n Um, george talked about the idea of community. You're not going to make it by yourself\n\n2:52:33.280 --> 2:52:37.840\n So you've got to be able to build people around you and uh, and build a trusting environment\n\n2:52:38.400 --> 2:52:40.960\n Around you to develop those skills. Um,\n\n2:52:40.960 --> 2:52:44.880\n What I would add to the the excellent points that both already raised\n\n2:52:46.080 --> 2:52:50.420\n Alludes to what I said at the start of this podcast. You've got to be able to identify\n\n2:52:51.200 --> 2:52:53.200\n some kind of undervalued\n\n2:52:54.060 --> 2:52:58.800\n Elements in whatever industry you're in and show the world what their true value is\n\n2:52:59.920 --> 2:53:01.600\n in addition\n\n2:53:01.600 --> 2:53:03.600\n You can't go through life\n\n2:53:04.240 --> 2:53:06.560\n Doing the same things as everybody else\n\n2:53:06.560 --> 2:53:10.480\n Go through life doing the same things as everybody else\n\n2:53:11.120 --> 2:53:13.120\n And expecting to get different results\n\n2:53:13.520 --> 2:53:17.200\n This is straightforwardly irrational and worse. It's even arrogant\n\n2:53:17.520 --> 2:53:23.040\n It's essentially the statement that i'm going to do the same thing as everyone else, but I believe i'm different\n\n2:53:23.760 --> 2:53:25.760\n And so they'll work for me\n\n2:53:25.840 --> 2:53:27.840\n But they didn't work for everyone else\n\n2:53:27.920 --> 2:53:29.920\n That's like saying no i'm special\n\n2:53:30.240 --> 2:53:33.200\n No, you're not special. We're all pretty much the same\n\n2:53:33.200 --> 2:53:40.160\n And um in order to be special you're going to have to exhibit skills that other people simply don't have\n\n2:53:40.960 --> 2:53:42.960\n um\n\n2:53:42.960 --> 2:53:47.360\n Thirdly I would say if you want to become something truly impressive in life\n\n2:53:47.840 --> 2:53:50.960\n You've got to be able to focus on one or two things\n\n2:53:51.680 --> 2:53:54.080\n That you do better than anyone else in your industry\n\n2:53:54.080 --> 2:54:01.200\n You can't learn everything but you can take one or two skills and the more innovative those skills are the better\n\n2:54:01.920 --> 2:54:06.160\n And you can truly excel at them. For example at the peak of his career\n\n2:54:06.960 --> 2:54:11.920\n No one in the world was better than george saint pierre at integrating striking and takedowns\n\n2:54:12.640 --> 2:54:16.960\n No one in the world was better at integrating grappling and striking on the ground\n\n2:54:17.600 --> 2:54:20.640\n He had two things that he could confidently say\n\n2:54:20.640 --> 2:54:26.080\n He could confidently say he was the best in the world at was he the best at every mma skill? Nope\n\n2:54:27.120 --> 2:54:28.460\n but he was\n\n2:54:28.460 --> 2:54:34.080\n Absolutely the best at those two skills and those two skills were skills which he used throughout his career to win\n\n2:54:34.560 --> 2:54:36.560\n the vast majority of his matches\n\n2:54:36.880 --> 2:54:42.800\n Gordon ryan at the onset of his career could confidently say there's no one in the world better than me at leg locks\n\n2:54:44.160 --> 2:54:48.020\n He could also say there's no one better in the world than me at late stage defense\n\n2:54:48.020 --> 2:54:50.020\n to\n\n2:54:50.260 --> 2:54:56.340\n Submission holds across the board as he went through his career. He started adding more and more elements\n\n2:54:56.740 --> 2:55:02.820\n It's gotten to an extraordinary degree now where you could absolutely say he's the best at guard passing the best at guard retention\n\n2:55:03.540 --> 2:55:06.260\n the list just keeps going on and that goes back to what\n\n2:55:06.900 --> 2:55:08.100\n um\n\n2:55:08.100 --> 2:55:14.820\n Gordon said earlier about keeping things interesting over time because we're always introducing new skill sets the day you start saying\n\n2:55:14.820 --> 2:55:18.420\n I'm satisfied with my skill set is the day you get bored\n\n2:55:19.060 --> 2:55:22.500\n and bored boredom to an athlete is a precursor to\n\n2:55:24.020 --> 2:55:26.020\n Death by boredom\n\n2:55:26.500 --> 2:55:29.780\n As long as you're still growing in those directions you'll stay in the game\n\n2:55:30.500 --> 2:55:34.420\n For very long periods of time. So the main thing I would add to these\n\n2:55:35.780 --> 2:55:39.140\n statements by gordon and george is this idea of\n\n2:55:39.140 --> 2:55:44.260\n Of finding something which is currently undervalued and showing the world what its true value is\n\n2:55:46.560 --> 2:55:47.860\n Understanding\n\n2:55:47.860 --> 2:55:55.220\n That you can't just use the same training methodologies as everyone else and somehow expect to be different from everyone else. You've got to\n\n2:55:55.860 --> 2:56:01.140\n Almost every great rise in human civilization whether it be groups of people or individuals\n\n2:56:01.540 --> 2:56:05.780\n Required some kind of innovation. You've got to look for that new angle\n\n2:56:05.780 --> 2:56:09.060\n Okay, george st. Pierre found it with shoe boxing early on in his career\n\n2:56:09.940 --> 2:56:15.220\n Gordon ryan found it with leg locks early on in his career and they branched out from that from that angle\n\n2:56:18.100 --> 2:56:24.660\n Add to this the idea that you want to become the absolute best in the world in your industry\n\n2:56:24.980 --> 2:56:27.300\n In one or two things that make a difference\n\n2:56:27.940 --> 2:56:32.100\n Find out what they are and focus on those things and you'll go far\n\n2:56:32.100 --> 2:56:34.100\n John\n\n2:56:34.660 --> 2:56:38.740\n Gordon george, this is an incredible conversation. Thank you so much for your\n\n2:56:39.220 --> 2:56:43.700\n Extremely valuable time george as somebody who's become famous in part\n\n2:56:44.660 --> 2:56:46.660\n By commenting on people's performance\n\n2:56:47.540 --> 2:56:50.020\n Um, how do you think we did?\n\n2:56:51.060 --> 2:56:53.460\n How would you evaluate our performance today?\n\n2:56:54.500 --> 2:56:56.500\n I'm not impressed by\n\n2:56:56.500 --> 2:57:01.780\n Yeah, thank you. I loved it. I learned all the time. I've talked to you guys. I'm\n\n2:57:02.500 --> 2:57:04.500\n It's it's great. I loved it\n\n2:57:04.660 --> 2:57:10.660\n I was very stimulated. I and really enjoyed it. Yeah, it's uh, it was it was something\n\n2:57:10.660 --> 2:57:13.220\n I really was looking forward to I was hoping that would get together\n\n2:57:14.020 --> 2:57:17.060\n It's so rare that at the same time in history\n\n2:57:17.140 --> 2:57:21.540\n There will be some of the greats together and the fact that you guys would be willing to come together and talk like this\n\n2:57:21.540 --> 2:57:26.420\n This is awesome. And that gordon he would even wear a cowboy hat. I mean, this is just historic\n\n2:57:26.660 --> 2:57:30.580\n This is like church. You're all getting together with whoever, you know, this is great and all\n\n2:57:30.580 --> 2:57:37.060\n But the next one is just going to be us just quizzing john on which animals would win in fights. Yes for the whole three hours\n\n2:57:37.060 --> 2:57:41.860\n It'll be just so we'll invite joe and you'll just be we'll we'll make it a systematic\n\n2:57:41.860 --> 2:57:47.620\n It'll be a debate between joe and john on which animal would win. John and I we have a thing that we send each other\n\n2:57:47.620 --> 2:57:54.520\n Footage all the time of animal fight where we are, uh, very intrigue about animal fight\n\n2:57:57.220 --> 2:58:00.500\n I get them like 3 30 am on it. He's like check this out\n\n2:58:01.060 --> 2:58:03.620\n Like a rhino taking a like a pig like\n\n2:58:05.140 --> 2:58:11.780\n Literally, it's not always fair. No, no, it's not ever but interesting stuff if you people would see what we send\n\n2:58:12.100 --> 2:58:15.220\n The stuff that we they would judge you harshly. Yeah\n\n2:58:15.220 --> 2:58:19.380\n Harshly. Yeah. Yeah. All right. All right. Thanks so much guys. This is awesome\n\n2:58:20.500 --> 2:58:27.860\n Thanks for listening to this conversation with george saint pierre john donahue and gordon ryan to support this podcast\n\n2:58:27.860 --> 2:58:29.880\n Please check out our sponsors in the description\n\n2:58:30.740 --> 2:58:34.360\n And now let me leave you some words from miyamoto musashi\n\n2:58:35.700 --> 2:58:43.220\n There's nothing outside yourself that can ever enable you to get better stronger richer quicker or smarter\n\n2:58:43.220 --> 2:58:46.200\n Everything is within everything exists\n\n2:58:46.820 --> 2:58:48.820\n Seek nothing outside of yourself\n\n2:58:48.820 --> 2:59:12.820\n Thank you for listening and hope to see you next time\n\n"
}