{
  "title": "Alex Gladstein: Bitcoin, Authoritarianism, and Human Rights | Lex Fridman Podcast #231",
  "id": "kSbMU5CbFM0",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.040\n The following is a conversation with Alex Gladstein, Chief Strategy Officer at the Human\n\n00:05.040 --> 00:08.520\n Rights Foundation and the Oslo Freedom Forum.\n\n00:08.520 --> 00:13.960\n In recent times, Alex has focused on how cryptocurrency, and especially Bitcoin, can be a tool for\n\n00:13.960 --> 00:20.020\n empowering democracy and civil liberties in the world, most crucially, parts of the world\n\n00:20.020 --> 00:23.680\n that are living under authoritarian regimes.\n\n00:23.680 --> 00:28.520\n As a side note, let me say that I have been learning a lot about the ways in which money\n\n00:28.520 --> 00:33.580\n can be used to amass power, and in the same way, the decentralization of money can be\n\n00:33.580 --> 00:36.960\n used to resist the corrupting nature of this power.\n\n00:36.960 --> 00:42.840\n Alex and I do not agree on everything, but we strive for the same betterment of humanity.\n\n00:42.840 --> 00:48.120\n He is sensitive to the suffering in the world, and is dedicating his life to finding solutions\n\n00:48.120 --> 00:50.080\n that lessen that suffering.\n\n00:50.080 --> 00:55.500\n Whether Bitcoin is one such solution, I don't know, but I think it has a chance, and that\n\n00:55.500 --> 00:58.560\n means it is worth exploring deeply.\n\n00:58.560 --> 01:03.960\n I'm staying in this path of learning, patiently, and with as little ego as possible, I hope\n\n01:03.960 --> 01:07.360\n you come along with me on this journey as well.\n\n01:07.360 --> 01:13.060\n This is the Lex Friedman Podcast, to support it, please check out our sponsors in the description.\n\n01:13.060 --> 01:18.800\n We recorded this conversation a while ago, and I thought I lost the audio, and was really\n\n01:18.800 --> 01:24.640\n disappointed with myself for messing this thing up, but luckily, last week, I found\n\n01:24.640 --> 01:31.920\n it, and so, rescued from out of the abyss of nonexistence, here's my conversation with\n\n01:31.920 --> 01:34.840\n Alex Glastain.\n\n01:34.840 --> 01:40.040\n What are some universal human rights that you believe all people should have?\n\n01:40.040 --> 01:45.760\n So free speech, freedom of assembly, freedom of belief, freedom to participate in your\n\n01:45.760 --> 01:51.240\n government, the freedom to have privacy, the freedom to own things, property rights, these\n\n01:51.240 --> 01:55.840\n are all basic, fundamental, negative rights, what we call them.\n\n01:55.840 --> 01:59.240\n These are the basic, fundamental human freedoms.\n\n01:59.240 --> 02:02.640\n What does negative rights mean?\n\n02:02.640 --> 02:07.360\n Negative rights are liberties, and positive rights are entitlements.\n\n02:07.360 --> 02:12.680\n So after World War II, when the UN came together, it was largely a compromise between the communist\n\n02:12.680 --> 02:16.160\n Soviet Union and the, you know, free United States, right?\n\n02:16.160 --> 02:23.600\n So the US had, on its side of the UN Declaration of Human Rights, a bunch of liberties, essentially,\n\n02:23.600 --> 02:27.340\n things like free speech, freedom of association, freedom of assembly.\n\n02:27.340 --> 02:31.920\n The Soviets wanted entitlements, like the right to work, the right to have housing,\n\n02:31.920 --> 02:34.240\n the right to water, the right to a vacation.\n\n02:34.240 --> 02:38.480\n So if you actually read the UN Declaration for Human Rights, it's a negotiation between\n\n02:38.480 --> 02:40.480\n the Soviets and the Americans.\n\n02:40.480 --> 02:44.920\n Later, there was another document in the 70s released called the International Covenant\n\n02:44.920 --> 02:46.960\n on Civil and Political Rights.\n\n02:46.960 --> 02:52.080\n And this is what HRF uses as its sort of like lodestar, its founding document.\n\n02:52.080 --> 02:56.420\n And this is like, essentially, an international agreement on the negative rights.\n\n02:56.420 --> 03:00.320\n Those are the things we choose to focus on, because essentially, authoritarian regimes\n\n03:00.320 --> 03:06.100\n can commit fraud and claim they're giving the positive rights, the entitlements, without\n\n03:06.100 --> 03:08.360\n having any of the negative liberties.\n\n03:08.360 --> 03:12.880\n And they can do that because they don't have any like free speech or press freedom.\n\n03:12.880 --> 03:17.120\n When you take people's basic fundamental freedoms away, it's quite easy to make like a Potemkin\n\n03:17.120 --> 03:22.920\n village and pretend that there's the entitlements and that we have good health care and, you\n\n03:22.920 --> 03:28.480\n know, it's the same sort of thing that authoritarians have done for decades, Cuba and Venezuela\n\n03:28.480 --> 03:29.480\n and the Soviet Union.\n\n03:29.480 --> 03:30.480\n Peter Bell.\n\n03:30.480 --> 03:34.920\n Do you think it's possible for authoritarian regimes to manipulate, to kind of lie about\n\n03:34.920 --> 03:40.200\n the negative rights as well, by saying that the people have free speech, the people have\n\n03:40.200 --> 03:45.720\n the freedom for assembly and all those kinds of things, can't you still manipulate the\n\n03:45.720 --> 03:49.240\n idea that citizenry still has those rights?\n\n03:49.240 --> 03:56.320\n The opposition leader of Malaysia, Anwar Ibrahim, he once told me the funny joke that, you know,\n\n03:56.320 --> 04:00.560\n in my country, we have freedom of speech, we don't have freedom after speech.\n\n04:00.560 --> 04:04.280\n So yeah, they can absolutely manipulate whatever they want.\n\n04:04.280 --> 04:07.560\n But I've done research into socioeconomic data.\n\n04:07.560 --> 04:12.920\n And I guess what I'm telling you is that authoritarian regimes, which make up 53% of the world's\n\n04:12.920 --> 04:19.440\n population across 95 countries, about 4.3 billion people, those who live under those\n\n04:19.440 --> 04:26.720\n regimes are subject to massive fraud when it comes to things like literacy rates, life\n\n04:26.720 --> 04:31.840\n expectancy, any sort of socioeconomic data, economic growth.\n\n04:31.840 --> 04:34.760\n They can do this because there's no free press.\n\n04:34.760 --> 04:39.400\n So for us at the Human Rights Foundation, and for people like me, we believe that the\n\n04:39.400 --> 04:43.760\n negative rights, the liberties, the things that are in, for example, the Bill of Rights\n\n04:43.760 --> 04:48.020\n in the US Constitution, these things are the table and then we can build on top of that.\n\n04:48.020 --> 04:50.560\n We can build the rest of our societies on top of that.\n\n04:50.560 --> 04:54.960\n The freest countries in the world have both the negative liberties and the entitlements\n\n04:54.960 --> 04:59.760\n like Norway, for example, but there's a big difference between Norway and North Korea.\n\n04:59.760 --> 05:03.400\n In North Korea, they only claim to have the entitlements and they definitely don't have\n\n05:03.400 --> 05:05.040\n the liberties.\n\n05:05.040 --> 05:07.600\n Do you think there's one right that's more important than others?\n\n05:07.600 --> 05:13.040\n You kind of suggested the freedom of the press, maybe freedom of speech, that if you take\n\n05:13.040 --> 05:17.360\n that away, all the other ones kind of collapse along with like from a ripple effect.\n\n05:17.360 --> 05:23.680\n Is there something fundamental that you like to focus your attention on to defend, to protect,\n\n05:23.680 --> 05:24.960\n to make sure it's there?\n\n05:24.960 --> 05:27.680\n Yeah, I think free speech is probably the most fundamental.\n\n05:27.680 --> 05:32.400\n It's probably why the founders chose to make it into the First Amendment.\n\n05:32.400 --> 05:34.880\n A lot of things are downstream from there.\n\n05:34.880 --> 05:38.120\n Property rights are also very, very important.\n\n05:38.120 --> 05:44.200\n Obviously we've seen the toll of violent redistributionism, you know, in over the last hundred years,\n\n05:44.200 --> 05:52.840\n whether it was Lenin or Stalin or Mao or other regimes and everywhere from Ethiopia to colonialists\n\n05:52.840 --> 05:56.840\n everywhere to North Korea, it's not a pretty legacy.\n\n05:56.840 --> 06:00.620\n Is free speech clear to you as a concept?\n\n06:00.620 --> 06:05.040\n There's been quite a few debates, especially in the digital age, what it means to violate\n\n06:05.040 --> 06:06.480\n freedom of speech.\n\n06:06.480 --> 06:12.000\n There's been a lot of new, like novel mechanisms for people to communicate with each other,\n\n06:12.000 --> 06:14.400\n like especially on social networks.\n\n06:14.400 --> 06:20.760\n And it seems that unclear because a lot of times those are managed by private companies.\n\n06:20.760 --> 06:26.680\n It's unclear how much protection do the citizens have to have when they're communicating.\n\n06:26.680 --> 06:30.320\n A lot of people are being censored on these social platforms.\n\n06:30.320 --> 06:35.520\n Some people, even presidents get removed from those social platforms.\n\n06:35.520 --> 06:42.680\n Have you thought about the freedom of speech in the United States, but in the world?\n\n06:42.680 --> 06:50.520\n As it's implemented in the 21st century, given the internet and all those kinds of things?\n\n06:50.520 --> 07:02.080\n There is a Soviet dissident named Natan Sharansky who survived the regime and he wrote a book\n\n07:02.080 --> 07:06.320\n in which his thesis was essentially the way that you can define a free society is through\n\n07:06.320 --> 07:08.720\n something called the town square test.\n\n07:08.720 --> 07:14.360\n Can you go to a public space where you live and criticize your ruler loudly without fear\n\n07:14.360 --> 07:16.020\n of retribution?\n\n07:16.020 --> 07:18.240\n If you can do that, you have free speech.\n\n07:18.240 --> 07:20.600\n I think that's a pretty good litmus test.\n\n07:20.600 --> 07:21.940\n Most people in this world cannot do that.\n\n07:21.940 --> 07:27.540\n If you live in Havana, if you live in Moscow, if you live in Beijing, you cannot do that.\n\n07:27.540 --> 07:29.720\n And that's not a free society.\n\n07:29.720 --> 07:36.920\n In Austin, Texas, in Boston, Massachusetts, in London, in Santiago, Chile, in Tokyo, Japan,\n\n07:36.920 --> 07:38.960\n in many democracies, you can do that.\n\n07:38.960 --> 07:42.760\n And I think that that's a really helpful basic sort of litmus test.\n\n07:42.760 --> 07:46.080\n Does the content of the criticism matter?\n\n07:46.080 --> 07:54.240\n Can it be complete lies, meaning conspiracy theories that involve claiming that the leader\n\n07:54.240 --> 08:03.880\n is, let's say, a lizard slash pedophile slash, you know, I'm not saying that those are lies,\n\n08:03.880 --> 08:08.740\n look into it, but they're very unlikely phenomena.\n\n08:08.740 --> 08:10.680\n So like, does that matter?\n\n08:10.680 --> 08:15.920\n I think it ends poorly when the state tries to restrict speech.\n\n08:15.920 --> 08:18.480\n I think that's kind of how I would define censorship.\n\n08:18.480 --> 08:22.800\n I think censorship and deplatforming are two different things.\n\n08:22.800 --> 08:28.120\n Private companies, you know, they get to make up their own rules about what's allowed on\n\n08:28.120 --> 08:29.120\n their platforms.\n\n08:29.120 --> 08:34.400\n And I think that's very different from a government with guns and an army restricting the speech\n\n08:34.400 --> 08:37.120\n of its citizens with threats of violence.\n\n08:37.120 --> 08:39.160\n These things are different for me.\n\n08:39.160 --> 08:42.480\n That violence is a fundamental difference.\n\n08:42.480 --> 08:49.240\n I don't know, I've gotten the chance to have dinner with Alex Jones and I've talked to\n\n08:49.240 --> 08:56.040\n him a few times offline and it does, I understand why people are so off put by him, but it does\n\n08:56.040 --> 09:00.240\n bother me that he's universally removed from every platform.\n\n09:00.240 --> 09:09.560\n It feels like there's many more evil people, bad people compared to Alex Jones who still\n\n09:09.560 --> 09:12.760\n are given a voice on these platforms.\n\n09:12.760 --> 09:21.240\n And so I'm uncomfortable with the universality of the application of the censorship by these\n\n09:21.240 --> 09:22.240\n platforms.\n\n09:22.240 --> 09:23.960\n But on the flip side, you're right.\n\n09:23.960 --> 09:29.000\n There's not a violence, there's not tanks, there's not guns behind that censorship.\n\n09:29.000 --> 09:30.000\n Yeah.\n\n09:30.000 --> 09:35.720\n It's a bit of a generalization, but Alex Jones would be in prison or dead if he were in North\n\n09:35.720 --> 09:40.720\n Korea or in Cuba or in Russia or in China, that the authorities would not tolerate him\n\n09:40.720 --> 09:42.640\n to do what he did.\n\n09:42.640 --> 09:45.280\n And here he can kind of do what he wants.\n\n09:45.280 --> 09:52.200\n He's encountering some resistance in the marketplace of ideas, large organizations, corporations,\n\n09:52.200 --> 09:58.680\n and a lot of public sentiment in different parts of our country don't like him.\n\n09:58.680 --> 10:03.360\n They're doing their best to drown out his voice, but that's very different from a violent\n\n10:03.360 --> 10:05.400\n threat of censorship from the state.\n\n10:05.400 --> 10:06.600\n And that's what we study.\n\n10:06.600 --> 10:09.680\n That's what I study are these, you know, what is the state doing?\n\n10:09.680 --> 10:11.200\n That's kind of paramount for me.\n\n10:11.200 --> 10:12.200\n Yeah.\n\n10:12.200 --> 10:15.480\n And that's true because in the marketplace of ideas, there could be a company that springs\n\n10:15.480 --> 10:21.000\n up that gives Alex Jones a platform and the United States is not going to prevent those\n\n10:21.000 --> 10:22.760\n companies from functioning.\n\n10:22.760 --> 10:32.000\n Of course, there's from a technology perspective, there is AWS removing Parler from the platform\n\n10:32.000 --> 10:37.400\n and gets a little weird, you know, as you get closer and closer to the computer infrastructure,\n\n10:37.400 --> 10:42.400\n because then you get closer and closer to the state, actually, the more you get to the\n\n10:42.400 --> 10:47.360\n infrastructure that's usually managed by the state, the closer it gets to then the control\n\n10:47.360 --> 10:48.360\n of the state.\n\n10:48.360 --> 10:53.000\n I would argue AWS is pretty damn close to infrastructure that's kind of controlled\n\n10:53.000 --> 10:54.000\n by the state.\n\n10:54.000 --> 11:01.800\n If you especially look at other nations, China, Russia, there's, I don't know who runs the\n\n11:01.800 --> 11:06.080\n computer infrastructure for Russia and China, but I bet the state has complete oversight\n\n11:06.080 --> 11:07.080\n over that.\n\n11:07.080 --> 11:14.340\n And so that level of computer infrastructure, having control about which social networks\n\n11:14.340 --> 11:17.480\n can and cannot operate is very uncomfortable to me.\n\n11:17.480 --> 11:22.780\n But you're right, I think it's good to focus on the obvious violations of these principles\n\n11:22.780 --> 11:25.360\n as opposed to the gray areas.\n\n11:25.360 --> 11:28.440\n Of course, the gray areas are fascinating.\n\n11:28.440 --> 11:31.720\n You mentioned HRF, Human Rights Foundation.\n\n11:31.720 --> 11:32.960\n What is it?\n\n11:32.960 --> 11:33.960\n What is its mission?\n\n11:33.960 --> 11:39.800\n Yes, I've been working for HRF since 2007.\n\n11:39.800 --> 11:46.480\n We are a charity, a nonprofit, a 501c3 based in New York, and our mission is to promote\n\n11:46.480 --> 11:52.560\n and protect individual rights and freedoms in authoritarian societies around the world.\n\n11:52.560 --> 11:57.320\n So again, we define about 95 countries as authoritarian, meaning it's either a one party\n\n11:57.320 --> 12:03.080\n state or opposition politicians are outlawed or persecuted, there's no real free speech,\n\n12:03.080 --> 12:06.560\n there's no press freedom, there's no independent judiciary, there really aren't checks and\n\n12:06.560 --> 12:11.280\n balances and even trying to create like a human rights organization or like an environmental\n\n12:11.280 --> 12:14.160\n group would be illegal.\n\n12:14.160 --> 12:16.560\n And the majority of the world's population lives in that environment.\n\n12:16.560 --> 12:17.560\n That's very important.\n\n12:17.560 --> 12:18.560\n You said 53%.\n\n12:18.560 --> 12:20.720\n 53%, 4.3 billion people.\n\n12:20.720 --> 12:27.700\n And I saw you outlined a lot of different sources of suffering in the world.\n\n12:27.700 --> 12:33.440\n And then you sort of put people living under authoritarian governments as like more than\n\n12:33.440 --> 12:35.960\n all of them.\n\n12:35.960 --> 12:38.320\n I forget all the examples you provided, but then...\n\n12:38.320 --> 12:39.320\n Sure.\n\n12:39.320 --> 12:40.320\n I mean, it's...\n\n12:40.320 --> 12:41.920\n Yeah, maybe you can mention if you remember.\n\n12:41.920 --> 12:45.520\n The number of people who are refugees, the number of people who suffer from natural disasters,\n\n12:45.520 --> 12:49.200\n the number of people who live under abject poverty, the number of people who don't have\n\n12:49.200 --> 12:52.880\n access to clean drinking water, all of these are dwarfed by the number of people who live\n\n12:52.880 --> 12:54.960\n under authoritarianism.\n\n12:54.960 --> 12:59.680\n And yet it's not something that we talk about a lot because people are mercantilist and\n\n12:59.680 --> 13:04.920\n the powers that be are happy to sacrifice freedoms and privacy for money.\n\n13:04.920 --> 13:07.520\n We live in a profit seeking world.\n\n13:07.520 --> 13:11.880\n To get evidence of this, take a look at the list of sponsors of the upcoming Olympics\n\n13:11.880 --> 13:17.120\n in China where the CCP is currently committing genocide against the weaker population or\n\n13:17.120 --> 13:21.540\n look at the number of people and the famous investors who went to Saudi Arabia a couple\n\n13:21.540 --> 13:23.480\n months ago for the Davos in the desert.\n\n13:23.480 --> 13:27.880\n I mean, Ray Dalio was there, all kinds of people were there, or at least they were invited\n\n13:27.880 --> 13:29.960\n and they said they were gonna go.\n\n13:29.960 --> 13:35.780\n And this is a government that at the time was torturing a female activist who just wanted\n\n13:35.780 --> 13:36.780\n to drive a car.\n\n13:36.780 --> 13:42.620\n This is a government that had murdered Jamal Khashoggi in a brutal fashion just a couple\n\n13:42.620 --> 13:43.620\n years earlier.\n\n13:43.620 --> 13:49.640\n So, I mean, at the end of the day when it comes down to brass tacks, I mean, the powers\n\n13:49.640 --> 13:56.840\n that be, even the free countries are led by people who are very, very happy to sacrifice\n\n13:56.840 --> 14:00.520\n all these pretty words about human rights when it comes down to profits, unfortunately.\n\n14:00.520 --> 14:05.440\n So, do you think capitalism, that's maybe one of the flaws of capitalism is it turns\n\n14:05.440 --> 14:12.540\n a blind eye to injustices against human nature, against the human rights, like it turns a\n\n14:12.540 --> 14:14.480\n blind eye to authoritarian governments?\n\n14:14.480 --> 14:22.800\n Look, I think that at the end of the day, like free trade is actually really good.\n\n14:22.800 --> 14:27.320\n And you can just look at France and Germany as an example of how like a capitalist structure\n\n14:27.320 --> 14:28.320\n would develop.\n\n14:28.320 --> 14:31.400\n If you have two capitalist actors, they're very unlikely to fight each other.\n\n14:31.400 --> 14:33.480\n There's very unlikely to be violence, right?\n\n14:33.480 --> 14:38.600\n These are two countries which basically murdered some large percentage of each other's male\n\n14:38.600 --> 14:42.200\n population three times in a hundred years in three different wars, right?\n\n14:42.200 --> 14:47.760\n And now today, war is like unthinkable and a lot of that is because of increased collaboration,\n\n14:47.760 --> 14:48.760\n increased trade.\n\n14:48.760 --> 14:54.680\n So, when you have two capitalist actors, they act in a very productive way with each other.\n\n14:54.680 --> 14:59.360\n But as soon as you introduce an authoritarian actor, all bets are off.\n\n14:59.360 --> 15:05.880\n So, I think what you have is a conflict between capitalist actors and authoritarian actors.\n\n15:05.880 --> 15:13.480\n And at the end of the day, people need to, yes, have more than just capitalist intentions\n\n15:13.480 --> 15:18.800\n in the geopolitical level I'm talking about, they need to actually take a stand for principles.\n\n15:18.800 --> 15:25.400\n Otherwise, you have athletes and businesses and governments that are all too happy to\n\n15:25.400 --> 15:28.360\n do business with the Chinese Communist Party, for example, right now.\n\n15:28.360 --> 15:34.240\n I think that there is a little more than just kind of the pure profit, yes.\n\n15:34.240 --> 15:41.880\n You mentioned what are the signs that the state is an authoritarian state.\n\n15:41.880 --> 15:46.120\n How do you know if you're living in an authoritarian state or when you study another nation and\n\n15:46.120 --> 15:51.840\n analyze the behavior of another nation, how do you know that's an authoritarian state?\n\n15:51.840 --> 15:54.640\n Is it as simple as them having a dictator?\n\n15:54.640 --> 15:58.260\n Is it as simple as them as declaring that they don't have a democracy or is there something\n\n15:58.260 --> 15:59.260\n more subtle?\n\n15:59.260 --> 16:01.400\n There's a couple of good litmus tests.\n\n16:01.400 --> 16:04.480\n One is actually, can you have a gay pride parade?\n\n16:04.480 --> 16:10.040\n It actually lines up perfectly, it doesn't matter what religion the dictatorship is.\n\n16:10.040 --> 16:14.520\n They don't like minorities and they love to scapegoat, whether it's gays or religious\n\n16:14.520 --> 16:16.020\n minorities, etc.\n\n16:16.020 --> 16:17.280\n So it lines up pretty well.\n\n16:17.280 --> 16:18.280\n That's really interesting.\n\n16:18.280 --> 16:22.140\n If you cannot have a gay pride parade in your country, because you're fearful that you're\n\n16:22.140 --> 16:27.280\n going to get the crap kicked out of you, probably live in an authoritarian regime.\n\n16:27.280 --> 16:31.520\n I'm sure that's not just about some kind of homophobia.\n\n16:31.520 --> 16:32.520\n Why is that?\n\n16:32.520 --> 16:33.520\n That's really interesting.\n\n16:33.520 --> 16:34.520\n Because that's right.\n\n16:34.520 --> 16:35.520\n I'm going through...\n\n16:35.520 --> 16:37.400\n Fascism scapegoats minorities.\n\n16:37.400 --> 16:40.760\n There's an other, you create an other group and then you...\n\n16:40.760 --> 16:46.760\n Yeah, I mean Uganda is a great example of this, but so is Saudi Arabia, so is China.\n\n16:46.760 --> 16:48.240\n I mean, so is Cuba.\n\n16:48.240 --> 16:53.760\n I mean, these are all regimes which demonize the LGBT communities.\n\n16:53.760 --> 17:00.240\n It's interesting because maybe you can correct me, but from my very distant outside of perspective,\n\n17:00.240 --> 17:10.400\n the sort of the way that certain authoritarian governments speak about gay people is it's\n\n17:10.400 --> 17:13.840\n almost like, what is it?\n\n17:13.840 --> 17:19.200\n We don't have gay people in our country kind of idea as opposed to scapegoating, which\n\n17:19.200 --> 17:21.120\n is like...\n\n17:21.120 --> 17:23.760\n Total denial is the most powerful form of demonization.\n\n17:23.760 --> 17:26.960\n I mean, this is what the Iranian dictatorship does.\n\n17:26.960 --> 17:31.660\n A few years ago when Ahmadinejad, who was then sort of the de facto leader, he came\n\n17:31.660 --> 17:35.440\n to Columbia University and he tried to give a speech, which you can look up and he tried\n\n17:35.440 --> 17:37.800\n to claim that there were no gays in Iran.\n\n17:37.800 --> 17:42.280\n And that's the most powerful form of demonization is trying to just wipe out your utter existence.\n\n17:42.280 --> 17:46.120\n There's other good litmus tests too.\n\n17:46.120 --> 17:49.520\n For example, you can think about comedy.\n\n17:49.520 --> 17:53.280\n Can you make money making fun of your government on television?\n\n17:53.280 --> 17:55.440\n If you cannot, you live in a dictatorship most likely.\n\n17:55.440 --> 18:00.000\n I mean, it's shocking to people that I work with who live in dictatorships when I tell\n\n18:00.000 --> 18:05.760\n them that not only are comedians able to safely make fun of our government, but they get paid\n\n18:05.760 --> 18:07.360\n very well to do so.\n\n18:07.360 --> 18:09.280\n That's a hallmark of our free society.\n\n18:09.280 --> 18:11.800\n That's another good litmus test.\n\n18:11.800 --> 18:14.560\n Hear that Tim Dylan, you should go to North Korea, check it out.\n\n18:14.560 --> 18:15.560\n Yeah.\n\n18:15.560 --> 18:17.040\n And look, there are tons of flaws with democracies.\n\n18:17.040 --> 18:19.000\n This is a really good test by the way.\n\n18:19.000 --> 18:21.280\n The United States is a deeply flawed country in many ways.\n\n18:21.280 --> 18:24.120\n Our prison system is a disaster.\n\n18:24.120 --> 18:26.960\n There's a horrible war on drugs.\n\n18:26.960 --> 18:31.960\n We committed a grievous crime in my opinion by invading Iraq.\n\n18:31.960 --> 18:38.640\n We did a lot of problematic things, but our core architecture is still an open society.\n\n18:38.640 --> 18:44.440\n The people who criticize the US the most usually live within it.\n\n18:44.440 --> 18:49.080\n And if they were to move to a different country and try to use that criticism against their\n\n18:49.080 --> 18:51.640\n new rulers, they wouldn't fare so well.\n\n18:51.640 --> 18:57.080\n So whether it's Chomsky or whomever, if they were to go to Cuba and live in Cuba and try\n\n18:57.080 --> 19:01.240\n to criticize Cuba like they do America, it wouldn't last very long.\n\n19:01.240 --> 19:06.160\n So I think what's important to distinguish between open societies and closed ones or\n\n19:06.160 --> 19:10.880\n like free societies and authoritarian regimes, it doesn't mean that your government's going\n\n19:10.880 --> 19:12.760\n to be good all the time.\n\n19:12.760 --> 19:17.440\n What it means is that the citizens have a way to push for reform, have a way to hold\n\n19:17.440 --> 19:18.440\n the rulers accountable.\n\n19:18.440 --> 19:23.160\n So even if you don't like what the US government does, whether it was under Biden or Trump\n\n19:23.160 --> 19:27.080\n or Obama or Bush, we can rotate them through voting.\n\n19:27.080 --> 19:30.900\n And we have an independent Supreme Court that rotates over time.\n\n19:30.900 --> 19:34.840\n And we have people that we can elect directly to serve our interests.\n\n19:34.840 --> 19:39.280\n And then there's like a free press and there's lobbyists and all kinds of people that jostle\n\n19:39.280 --> 19:40.280\n for power.\n\n19:40.280 --> 19:42.320\n So there's a separation of powers.\n\n19:42.320 --> 19:48.120\n And I like to think about a free society really as like at the bottom of the foundation of\n\n19:48.120 --> 19:50.680\n the pyramid really would be free speech.\n\n19:50.680 --> 19:55.680\n And then you would have civil society, like for example, human rights organizations, environmental\n\n19:55.680 --> 19:59.840\n groups, stamp collectors, athletes, any groups that come together beyond the government's\n\n19:59.840 --> 20:00.840\n sort of strict instruction.\n\n20:00.840 --> 20:05.320\n And then on top of that, at the third level, you have separation of powers, again, what\n\n20:05.320 --> 20:06.840\n I'm describing.\n\n20:06.840 --> 20:10.360\n So authoritarian regimes don't really have any of these layers to them.\n\n20:10.360 --> 20:14.480\n And then at the top, then you put elections, but the elections are meaningless if you don't\n\n20:14.480 --> 20:16.120\n have the foundation below.\n\n20:16.120 --> 20:17.640\n Every dictator gets elected.\n\n20:17.640 --> 20:19.280\n Kim Jong Un gets elected.\n\n20:19.280 --> 20:21.400\n He's the only person on the ballot.\n\n20:21.400 --> 20:25.300\n Every dictator from Hitler to Chavez, they all got elected.\n\n20:25.300 --> 20:27.620\n Elections on their own mean literally nothing.\n\n20:27.620 --> 20:31.320\n You have to have these other layers beneath to actually be an open and free society.\n\n20:31.320 --> 20:35.640\n I think it's very important for people to understand.\n\n20:35.640 --> 20:39.600\n Although Hitler in an interesting way, at a certain point just said, I'm going to be\n\n20:39.600 --> 20:42.280\n a ruler forever, which is interesting.\n\n20:42.280 --> 20:47.480\n There's an important switch that happens when you, as opposed to having a facade of elections,\n\n20:47.480 --> 20:50.920\n you just put that aside and saying basically like, we're not even doing this.\n\n20:50.920 --> 20:51.920\n Yeah.\n\n20:51.920 --> 20:55.160\n There's like a ladder that you climb the election and you pull the ladder up and then no one\n\n20:55.160 --> 20:56.160\n else can climb up.\n\n20:56.160 --> 20:59.760\n This sadly happened in Egypt and it was quite predictable.\n\n20:59.760 --> 21:06.200\n After Mubarak was ousted after the Arab Spring, Morsi came in and it looked like the Muslim\n\n21:06.200 --> 21:09.680\n Brotherhood was not really going to be very democratic.\n\n21:09.680 --> 21:12.600\n But it didn't really matter because then the military came back and now we have Sisi who's\n\n21:12.600 --> 21:14.280\n even worse than Mubarak.\n\n21:14.280 --> 21:19.200\n So a lot of times in these regimes, unfortunately, it's very difficult for people to build that\n\n21:19.200 --> 21:22.220\n democratic society afterwards.\n\n21:22.220 --> 21:25.960\n Some people have told me that when you live in a totalitarian or authoritarian regime,\n\n21:25.960 --> 21:27.560\n it's kind of like a political desert.\n\n21:27.560 --> 21:28.720\n What grows in the desert?\n\n21:28.720 --> 21:30.400\n Scorpions and cacti, right?\n\n21:30.400 --> 21:35.280\n So basically people with very extreme views because you as an authoritarian ruler, your\n\n21:35.280 --> 21:38.520\n best method for control is to get rid of the moderates.\n\n21:38.520 --> 21:39.640\n You have to crush the moderates.\n\n21:39.640 --> 21:40.640\n That's very important.\n\n21:40.640 --> 21:43.900\n You want to have the only opposition to you be extremists.\n\n21:43.900 --> 21:47.160\n That way when you go and have negotiations with the United States, you can kind of hold\n\n21:47.160 --> 21:51.360\n up the terrorists or whomever, the extremists and say, it's either us or them, right?\n\n21:51.360 --> 21:54.100\n And then the realists who run the US government are going to choose you.\n\n21:54.100 --> 21:57.880\n And that's why, one of the reasons why the US government has supported so many dictators\n\n21:57.880 --> 22:00.720\n around the world over the last few decades.\n\n22:00.720 --> 22:06.560\n Do you think authoritarian systems emerge naturally, like that's the natural state of\n\n22:06.560 --> 22:07.560\n things.\n\n22:07.560 --> 22:13.320\n If you incorporate what human nature is, is there always going to be corrupt people the\n\n22:13.320 --> 22:14.320\n rise to the top?\n\n22:14.320 --> 22:22.000\n And we almost have to construct systems that protect us against ourselves kind of thing.\n\n22:22.000 --> 22:30.800\n Another way to ask that is what kind of systems protect us from our own human nature?\n\n22:30.800 --> 22:34.640\n We started with authoritarianism or autocracy, right?\n\n22:34.640 --> 22:41.480\n Ruled by one or a small group oligarchy, and all humans lived under this structure for,\n\n22:41.480 --> 22:45.120\n you know, the virtual, you know, bulk of all human existence.\n\n22:45.120 --> 22:49.080\n Only until pretty recently did we start having actual democracy.\n\n22:49.080 --> 22:54.440\n The idea that we should be ruled by rules, not by rulers, very powerful.\n\n22:54.440 --> 22:57.200\n Invented in many places across the world.\n\n22:57.200 --> 23:01.100\n Western Africa had this idea and so did the ancient Greeks.\n\n23:01.100 --> 23:02.840\n And they started to implement it.\n\n23:02.840 --> 23:06.600\n Although as most know, we didn't have full democracy for a long, long time because it\n\n23:06.600 --> 23:11.500\n was only property owners or only men, only people of a certain race.\n\n23:11.500 --> 23:17.200\n But this idea that we can like rotate our rulers and that we could be ruled by rules\n\n23:17.200 --> 23:23.560\n is extremely powerful and it really like for me, the ideas behind this, I think unlocked\n\n23:23.560 --> 23:27.040\n a lot of the industrial revolution, these small personal freedoms that were allowed\n\n23:27.040 --> 23:28.920\n in some countries, but not others.\n\n23:28.920 --> 23:33.320\n And they unlocked a lot of the scientific innovation over the last few hundred years.\n\n23:33.320 --> 23:36.920\n And to me, there's like a really straight line between like scientific inquiry, free\n\n23:36.920 --> 23:42.920\n speech, freedoms, and then more prosperity and more effectiveness as a civilization.\n\n23:42.920 --> 23:48.520\n So I think that democracy, you know, ruled by the people is definitely an upgrade from\n\n23:48.520 --> 23:55.640\n autocracy or oligarchy, you know, which would be ruled by one or ruled by a small group.\n\n23:55.640 --> 24:01.280\n And I think that the democratic revolution has been an incredible thing for our world.\n\n24:01.280 --> 24:04.280\n And it's, you know, you can do half class full, half class empty.\n\n24:04.280 --> 24:07.680\n The half class full is that almost half the world lives under democracy.\n\n24:07.680 --> 24:10.920\n Like that's an incredible achievement.\n\n24:10.920 --> 24:11.920\n But just under half.\n\n24:11.920 --> 24:12.920\n Yeah.\n\n24:12.920 --> 24:13.920\n Just under half.\n\n24:13.920 --> 24:14.920\n So.\n\n24:14.920 --> 24:16.600\n But that's billions of people.\n\n24:16.600 --> 24:18.200\n It's billions of people.\n\n24:18.200 --> 24:22.360\n And if you look at the progress of things, it's getting better and better and better.\n\n24:22.360 --> 24:24.320\n I mean, if you, you know.\n\n24:24.320 --> 24:25.320\n Yeah.\n\n24:25.320 --> 24:28.800\n We're a little bit of a stalemate here.\n\n24:28.800 --> 24:34.920\n Democracy's really blossomed between World War II and the year 2000, especially in the\n\n24:34.920 --> 24:41.160\n eighties and nineties, you had an incredible wave of fall, you know, where many, many authoritarian\n\n24:41.160 --> 24:43.960\n regimes fell and were replaced by democracies.\n\n24:43.960 --> 24:52.440\n I think around 2015, the acceleration kind of came to a standstill a little bit.\n\n24:52.440 --> 24:56.920\n There's some good news in some countries and there's bad news in others.\n\n24:56.920 --> 25:02.760\n Like in the last 10 years, you've had, for example, the Philippines has gone backwards.\n\n25:02.760 --> 25:04.560\n Thailand has gone backwards.\n\n25:04.560 --> 25:05.960\n Bangladesh has gone backwards.\n\n25:05.960 --> 25:07.480\n Turkey has gone backwards.\n\n25:07.480 --> 25:09.120\n That's like a half billion people right there.\n\n25:09.120 --> 25:16.360\n So you've had some positives, like, you know, there was positive movement forward in Armenia,\n\n25:16.360 --> 25:21.280\n Malaysia, some other countries, but we're kind of at a stalemate right now.\n\n25:21.280 --> 25:28.460\n And what most people fear about where we are right now, who I respect, is what is the digital\n\n25:28.460 --> 25:34.520\n transformation of the world due to this like progress of democracy or of open societies.\n\n25:34.520 --> 25:36.520\n And that's what concerns me the most.\n\n25:36.520 --> 25:37.520\n Oh, interesting.\n\n25:37.520 --> 25:42.840\n So I've, and we'll talk about one of the most fascinating technologies, which is Bitcoin,\n\n25:42.840 --> 25:43.840\n how it can help.\n\n25:43.840 --> 25:51.280\n But I have a sense that technology, like most technological innovations will give power\n\n25:51.280 --> 25:59.160\n to the individuals, will fight authoritarian governments as opposed to give more power\n\n25:59.160 --> 26:00.160\n to authoritarian governments.\n\n26:00.160 --> 26:07.240\n But your sense is there's ways to give for technology to be utilized as a tool for the\n\n26:07.240 --> 26:08.840\n abuse of the citizenry.\n\n26:08.840 --> 26:10.480\n I've seen both.\n\n26:10.480 --> 26:15.880\n In my work at Ahrefs, I started by helping to put together backpacks with foreign information\n\n26:15.880 --> 26:18.620\n that we sent to the Cuban underground library movement.\n\n26:18.620 --> 26:23.240\n So in Cuba, you know, to own a book at the time, you had to have the government's permission.\n\n26:23.240 --> 26:25.160\n There's very little internet penetration.\n\n26:25.160 --> 26:26.160\n Okay.\n\n26:26.160 --> 26:30.600\n So we would send in movies, you know, V for Vendetta, dubbed into Spanish, and people\n\n26:30.600 --> 26:35.400\n would sit inside their homes and they'd watch it and they would answer questions with each\n\n26:35.400 --> 26:36.400\n other.\n\n26:36.400 --> 26:37.400\n It was awful.\n\n26:37.400 --> 26:39.800\n And then after that, I worked with people inside North Korea.\n\n26:39.800 --> 26:40.800\n We would send in flash drives.\n\n26:40.800 --> 26:42.800\n We have this program called Flash Drives for Freedom.\n\n26:42.800 --> 26:48.560\n We've sent over 100,000 flash drives in our work into North Korea, a country of about\n\n26:48.560 --> 26:49.560\n 25 million people.\n\n26:49.560 --> 26:50.560\n That's a lot.\n\n26:50.560 --> 26:51.560\n It's a big, big difference.\n\n26:51.560 --> 26:55.200\n That's, you know, many, many millions of hours of films, books, movies, etc.\n\n26:55.200 --> 27:00.360\n So I've seen the power that technology can have where, you know, in the 60s and 70s,\n\n27:00.360 --> 27:03.920\n you know, to get to break an information blockade, you had to like send in crates of books into\n\n27:03.920 --> 27:05.440\n a communist country.\n\n27:05.440 --> 27:10.200\n So now all of a sudden, you can send the entire contents of what was once the Library of Alexandria\n\n27:10.200 --> 27:13.200\n on something the size of your thumbnail, like that's remarkable.\n\n27:13.200 --> 27:17.240\n So obviously, I've seen the positives of technology and we'll certainly get into Bitcoin.\n\n27:17.240 --> 27:22.520\n But I'm, you know, very concerned about essentially big data analysis, like what people call AI\n\n27:22.520 --> 27:26.680\n or general, you know, specific kinds of AI, like very concerning.\n\n27:26.680 --> 27:27.680\n I think these are very authoritarian.\n\n27:27.680 --> 27:33.960\n I mean, it's very hard to make a case that AI is going to be good for human rights.\n\n27:33.960 --> 27:35.960\n Very difficult, in my opinion.\n\n27:35.960 --> 27:37.160\n It may be good for health.\n\n27:37.160 --> 27:40.460\n It may be good for our efforts to protect the planet.\n\n27:40.460 --> 27:43.020\n It may be good for a lot of scientific things.\n\n27:43.020 --> 27:45.360\n I find it very hard to believe it'll be good for civil liberties.\n\n27:45.360 --> 27:46.840\n Oh, that's fun.\n\n27:46.840 --> 27:48.840\n This is fun because I disagree.\n\n27:48.840 --> 27:51.560\n Give me your examples.\n\n27:51.560 --> 27:52.800\n I'm serious.\n\n27:52.800 --> 27:55.440\n What AI applications will improve civil liberties?\n\n27:55.440 --> 28:00.760\n I thought you meant examples of stuff that's already out there, because I can give you\n\n28:00.760 --> 28:05.480\n examples that, for example, the kind of things I would like to work on, but also the kind\n\n28:05.480 --> 28:14.240\n of things I'm hoping to see, which is AI could be used by centralized powers, by governments,\n\n28:14.240 --> 28:22.040\n by big organizations like Facebook and Twitter and so on to collect data about people.\n\n28:22.040 --> 28:23.040\n Right.\n\n28:23.040 --> 28:24.040\n Right.\n\n28:24.040 --> 28:31.520\n I believe there's a huge hunger among people to have control over their own data.\n\n28:31.520 --> 28:37.260\n So instead you can have AI that's distributed or people have complete ownership of their\n\n28:37.260 --> 28:39.320\n little AI systems.\n\n28:39.320 --> 28:45.120\n So like the kind of stuff that I would like to build or like to see it to be built is\n\n28:45.120 --> 28:52.320\n you could think of it as personal assistance or AI that's owned by you and you get to give\n\n28:52.320 --> 28:53.440\n it out.\n\n28:53.440 --> 28:55.680\n You have complete control over all of your data.\n\n28:55.680 --> 29:01.740\n You have complete control over everything that's learnable about your day to day experiences\n\n29:01.740 --> 29:08.240\n that could be useful in the market of goods and ideas and all those kinds of things.\n\n29:08.240 --> 29:14.760\n So it has to do with, so I know you talk about the surveillance, which is very interesting.\n\n29:14.760 --> 29:17.680\n It's who gets to have control of the data.\n\n29:17.680 --> 29:26.560\n And I think, I believe there's a lot of hunger in among regular people to have control over\n\n29:26.560 --> 29:32.840\n their data such that if you want to create a business, you have a lot of money to be\n\n29:32.840 --> 29:38.520\n made from a capitalist perspective by providing products that let people control their data\n\n29:38.520 --> 29:41.040\n where you have no control.\n\n29:41.040 --> 29:45.980\n Sounds like to me you're describing encryption or at least the ability to encrypt, the ability\n\n29:45.980 --> 29:50.000\n to use digital keys to secure your property.\n\n29:50.000 --> 29:56.600\n And that to me is a very powerful force for individual rights, very powerful.\n\n29:56.600 --> 30:00.260\n And it's what animates Bitcoin ultimately, which we'll get into.\n\n30:00.260 --> 30:07.320\n But for me, at least the way I look at it today in 2021, the threat from big data analysis\n\n30:07.320 --> 30:09.800\n used by governments and authoritarian regimes is terrifying.\n\n30:09.800 --> 30:14.360\n I mean, to actually see what the Chinese Communist Party is doing where they have hundreds of\n\n30:14.360 --> 30:19.640\n millions of cameras overseeing society, cameras that can tell who's a Uyghur and who's a\n\n30:19.640 --> 30:24.440\n Ham, that to me is terrifying and everything is sorted instantly.\n\n30:24.440 --> 30:30.840\n There are supercomputers that are built in Urumqi, in Xinjiang for this explicit purpose.\n\n30:30.840 --> 30:35.720\n And it allows the government to quickly sort and basically commit genocide a lot faster\n\n30:35.720 --> 30:37.120\n and it's really scary.\n\n30:37.120 --> 30:42.680\n So I do agree and I've seen personally how powerful technology can be as a force for\n\n30:42.680 --> 30:47.960\n freedom, but I'm very, very worried about big data analysis in the hands of governments.\n\n30:47.960 --> 30:53.200\n See, that's funny because I tend to see governments as ultimately incompetent in the space of\n\n30:53.200 --> 30:56.080\n technology to where there will always be lagging behind.\n\n30:56.080 --> 31:01.960\n So you look at what the Chinese surveillance systems are doing, I believe once it starts\n\n31:01.960 --> 31:09.200\n getting bad enough that technologies would be created to resist that.\n\n31:09.200 --> 31:14.880\n So to mess with it from the hacker community, but also from the individual community.\n\n31:14.880 --> 31:20.640\n So surveillance is actually very difficult from a centralized perspective to collect\n\n31:20.640 --> 31:24.880\n data about you, to detect everything you are because you can spoof a lot of that information.\n\n31:24.880 --> 31:29.920\n So I believe you can put power in the hands of the citizens to sort of feed the government\n\n31:29.920 --> 31:38.040\n fake data to confuse it at a mass scale to where it'll make their surveillance less effective.\n\n31:38.040 --> 31:39.440\n That could be very sort of hopeful.\n\n31:39.440 --> 31:40.440\n Yeah.\n\n31:40.440 --> 31:44.880\n I mean, the practical application in Xinjiang, which is a territory the size of Alaska, where\n\n31:44.880 --> 31:48.960\n a large percentage of the population has been put into prison camps.\n\n31:48.960 --> 31:53.540\n The current issue of the New Yorker has an absolutely harrowing essay that tells the\n\n31:53.540 --> 32:00.000\n story of one such woman who in, I believe, 2017 got sucked into one of these camps and\n\n32:00.000 --> 32:04.040\n it took her a year or more to get out.\n\n32:04.040 --> 32:09.640\n And she's talking about how in each home in Xinjiang, each home has a QR code on it that\n\n32:09.640 --> 32:13.440\n the police can scan and get like a quick instant download of who lives there.\n\n32:13.440 --> 32:17.840\n Each car has, you know, like a scannable code.\n\n32:17.840 --> 32:22.840\n Every single person has their DNA taken and the DNA is being sifted through and analyzed\n\n32:22.840 --> 32:24.240\n by algorithms.\n\n32:24.240 --> 32:28.880\n So this is like the Chinese government's laboratory for how can we use technology to oppress.\n\n32:28.880 --> 32:31.400\n It's like sort of like digital Leninism.\n\n32:31.400 --> 32:36.600\n And that to me is one of the biggest risks in our world today and it's not talked about\n\n32:36.600 --> 32:37.600\n enough.\n\n32:37.600 --> 32:38.600\n That's interesting.\n\n32:38.600 --> 32:42.760\n So technology is basically enables the automation of oppression.\n\n32:42.760 --> 32:43.760\n Absolutely.\n\n32:43.760 --> 32:44.760\n So like...\n\n32:44.760 --> 32:51.800\n But to define technology, big data analysis and, you know, maybe specific AI, etc. does,\n\n32:51.800 --> 32:53.880\n but encryption allows us to fight back.\n\n32:53.880 --> 32:56.240\n It's very important people understand we have tools to fight back.\n\n32:56.240 --> 33:02.280\n The, you know, big brother can only grow if it can feed on your data.\n\n33:02.280 --> 33:04.720\n If it can't get your data, it can't grow.\n\n33:04.720 --> 33:10.280\n So you have to willingly give up stuff to the cloud for this monster to grow.\n\n33:10.280 --> 33:15.220\n We can like make the monster hungry and shrink it if we give it less data.\n\n33:15.220 --> 33:18.260\n And I think that's where I would agree with you in terms of like wanting to empower people\n\n33:18.260 --> 33:22.880\n to be able to do stuff on their own terms in a sovereign way.\n\n33:22.880 --> 33:26.800\n And yeah, maybe you're kind of thinking like the personal assistant who helps out Tony\n\n33:26.800 --> 33:28.800\n Stark or something like that.\n\n33:28.800 --> 33:32.160\n And that's, yeah, as long as there's no back doors and that's a sovereign thing that you've\n\n33:32.160 --> 33:36.100\n popped up and created and you have the keys to, absolutely.\n\n33:36.100 --> 33:42.480\n But practically speaking, if we're talking about the world today as is, we need to be\n\n33:42.480 --> 33:46.840\n concerned about the way that authoritarian regimes are using big data analysis and they're\n\n33:46.840 --> 33:50.080\n going to buy this software and this equipment from the Chinese government, they're already\n\n33:50.080 --> 33:51.240\n doing it.\n\n33:51.240 --> 33:54.520\n State level surveillance has already been purchased by governments everywhere from Latin\n\n33:54.520 --> 33:57.640\n America to Sub Saharan Africa to the heart of Europe.\n\n33:57.640 --> 34:03.640\n There's been huge scandals in Britain over their purchase of Chinese surveillance technology.\n\n34:03.640 --> 34:08.360\n Part of the Chinese government's Belt and Road campaign, which is basically to build\n\n34:08.360 --> 34:13.560\n the infrastructure of this century and to be in control of it, part of that idea is\n\n34:13.560 --> 34:19.760\n to ship out and install surveillance technology both at the telecom level and at the surveillance\n\n34:19.760 --> 34:24.080\n level across dozens of countries around the world and have that back door.\n\n34:24.080 --> 34:28.480\n There's this national security law in China, which states that companies that are Chinese,\n\n34:28.480 --> 34:32.120\n which are abroad, are mandated to send data back to Beijing.\n\n34:32.120 --> 34:35.480\n So they are building this huge global surveillance state.\n\n34:35.480 --> 34:39.680\n And again, not talked about enough, you should go Google and research the Belt and Road.\n\n34:39.680 --> 34:42.440\n I think it's very important that we confront this.\n\n34:42.440 --> 34:48.240\n Yeah, I'm really glad you're talking about it because it's probably important to understand.\n\n34:48.240 --> 34:56.520\n I'm also hopeful that as people get educated about how much their data, when collected,\n\n34:56.520 --> 35:00.520\n unencrypted, but in general, can be used to harm them.\n\n35:00.520 --> 35:02.840\n I mean, it's almost like an education.\n\n35:02.840 --> 35:10.360\n I feel like if you know, it's a double edged sword because I feel like people become fearful\n\n35:10.360 --> 35:14.680\n too easily and that actually has a very negative effect on the quality of life.\n\n35:14.680 --> 35:18.560\n In some sense, you want to have tools that allow you to live freely as opposed to live\n\n35:18.560 --> 35:19.560\n in fear.\n\n35:19.560 --> 35:22.560\n If you live in fear, it's not a good way to live.\n\n35:22.560 --> 35:23.560\n So it's a balance.\n\n35:23.560 --> 35:26.000\n It's a free society versus a fear society.\n\n35:26.000 --> 35:27.000\n Yeah, fear society.\n\n35:27.000 --> 35:30.560\n And look, people are, it's all about the trade offs you make in your daily life.\n\n35:30.560 --> 35:35.760\n Like living more privately with more freedom is less convenient.\n\n35:35.760 --> 35:41.120\n You trade freedom and privacy for convenience and comfort and speed.\n\n35:41.120 --> 35:42.120\n Absolutely.\n\n35:42.120 --> 35:45.700\n And the engineering decision and everything that you do.\n\n35:45.700 --> 35:53.840\n In the West, in advanced democracies, we have not necessarily personally seen the results\n\n35:53.840 --> 35:57.640\n of that trade off because we live in these free societies that have these checks and\n\n35:57.640 --> 35:59.240\n balances and freedoms.\n\n35:59.240 --> 36:02.840\n But as soon as you step into an authoritarian state and you make those trade offs, your\n\n36:02.840 --> 36:06.280\n life immediately becomes more restrictive.\n\n36:06.280 --> 36:12.560\n And what people are worried about is that even in advanced economies, market democracies,\n\n36:12.560 --> 36:20.220\n etc., people are worried that they might not survive the great social digital transformation.\n\n36:20.220 --> 36:22.640\n You know, look at what the NSA is capable of doing.\n\n36:22.640 --> 36:29.060\n I mean, for now, it's not that big of a problem because we still have free speech.\n\n36:29.060 --> 36:31.800\n But it's deeply concerning what Snowden revealed.\n\n36:31.800 --> 36:37.520\n And it's a nice reminder that we need to be focused on privacy and encryption and on helping\n\n36:37.520 --> 36:41.440\n users become more sovereign regardless of where you live.\n\n36:41.440 --> 36:43.840\n It's kind of like a crutch to live in a free society.\n\n36:43.840 --> 36:47.680\n Like, you know, it's almost like a free lunch in a way.\n\n36:47.680 --> 36:50.960\n You're not going to be sent to a prison camp because of the color of your skin or your\n\n36:50.960 --> 36:54.140\n beliefs or what you say about the government.\n\n36:54.140 --> 36:55.280\n And you're very lucky.\n\n36:55.280 --> 37:00.600\n Again, most people do live in a society where you can be persecuted for those things.\n\n37:00.600 --> 37:05.680\n And I feel like, especially in America, we forget that we're distanced from that really\n\n37:05.680 --> 37:08.080\n strong reality, you know.\n\n37:08.080 --> 37:13.040\n On the topic of Snowden and the NSA, what should we be thinking about?\n\n37:13.040 --> 37:17.420\n Because that feels like already an outdated set of conversations because of the information\n\n37:17.420 --> 37:19.440\n we've gotten from the past.\n\n37:19.440 --> 37:22.880\n It feels like everything's gotten quiet now in terms of how much we actually know about\n\n37:22.880 --> 37:23.880\n the...\n\n37:23.880 --> 37:24.880\n No, it's hugely important.\n\n37:24.880 --> 37:30.180\n I think the two lessons from Snowden are, A, the Patriot Act and the War on Terror and\n\n37:30.180 --> 37:36.000\n mass surveillance are not necessary for our democracy and for our freedoms.\n\n37:36.000 --> 37:37.240\n This was a false choice.\n\n37:37.240 --> 37:40.640\n We never had to sacrifice them to be safer.\n\n37:40.640 --> 37:41.640\n And we've seen that.\n\n37:41.640 --> 37:44.920\n The government has spent hundreds and hundreds of millions of dollars on these like surveillance\n\n37:44.920 --> 37:49.780\n programs that you can read about have amounted to very little, except for tremendous bureaucratic\n\n37:49.780 --> 37:54.280\n waste and, you know, erosion of our freedoms.\n\n37:54.280 --> 37:57.400\n But at the same time, we need to practice more privacy.\n\n37:57.400 --> 38:02.920\n And the dramatic increase in the usage of Signal, for example, has been really, really\n\n38:02.920 --> 38:04.240\n great to see.\n\n38:04.240 --> 38:08.400\n It's fantastic that tens of millions of people are downloading Signal and using it.\n\n38:08.400 --> 38:13.600\n You should try to be onboarding more and more of your conversations onto Signal, for example,\n\n38:13.600 --> 38:16.480\n where governments can't see what you're saying.\n\n38:16.480 --> 38:18.000\n Maybe they can see the metadata.\n\n38:18.000 --> 38:22.200\n Maybe they can see that you sent your phone number, sent a message to someone else's phone\n\n38:22.200 --> 38:25.120\n number at this time, but they can't see what's inside.\n\n38:25.120 --> 38:27.680\n So using encryption in your life is very, very important.\n\n38:27.680 --> 38:29.040\n That's a good starting point.\n\n38:29.040 --> 38:32.480\n I would say that's kind of step A.\n\n38:32.480 --> 38:40.280\n The ideas of democracy, the ideas of the balance of power, all the ideas that we were talking\n\n38:40.280 --> 38:44.120\n about, the constructs, were inventions.\n\n38:44.120 --> 38:50.640\n I wonder if there's other inventions that will allow us to sort of not engage, not give\n\n38:50.640 --> 38:56.120\n governments or any centralized institutions so much power.\n\n38:56.120 --> 38:59.920\n Why do citizens have to use Signal?\n\n38:59.920 --> 39:00.920\n Because it's an effort.\n\n39:00.920 --> 39:03.920\n You have to understand exactly why.\n\n39:03.920 --> 39:06.520\n So that's a nice little solution for a particular set of problems.\n\n39:06.520 --> 39:11.640\n But there's a million other ways that data, I'm sure, is being collected constantly.\n\n39:11.640 --> 39:18.840\n If we don't create a system that prevents the establishment of these centralized powers,\n\n39:18.840 --> 39:20.720\n then we'll always have this problem.\n\n39:20.720 --> 39:23.760\n Yeah, I think we can keep it simple for the purposes of this conversation.\n\n39:23.760 --> 39:26.020\n You have politics, information, and money.\n\n39:26.020 --> 39:28.880\n Those are the three things I would encourage us to focus on.\n\n39:28.880 --> 39:31.400\n In politics, yes, someone invented democracy.\n\n39:31.400 --> 39:36.560\n I mean, whether it was the Greeks, the West Africans, or many others around the world\n\n39:36.560 --> 39:42.840\n around the same time invented this idea that we should be ruled by rules and not by rulers.\n\n39:42.840 --> 39:45.920\n And that has evolved dramatically.\n\n39:45.920 --> 39:47.320\n And then you have information.\n\n39:47.320 --> 39:50.160\n Information also used to be highly centralized, right?\n\n39:50.160 --> 39:54.840\n Think about how rich you had to be to gain access to a library before the printing press,\n\n39:54.840 --> 40:00.060\n or how much money you had to have, or how close to the king or the feudal lord you had\n\n40:00.060 --> 40:02.680\n to be to be able to have that ability.\n\n40:02.680 --> 40:08.040\n But now, the majority of the world, billions of people have access to all information in\n\n40:08.040 --> 40:11.600\n their pocket, and they can set up an account on social media and get their word out.\n\n40:11.600 --> 40:17.240\n So not only politics, but information has been dramatically decentralized.\n\n40:17.240 --> 40:22.760\n And I would say that encrypted messaging is kind of a corollary to that second innovation\n\n40:22.760 --> 40:28.240\n in as much as now people are like more effortlessly, like Signal is a lot easier to use than PGP,\n\n40:28.240 --> 40:29.720\n for example.\n\n40:29.720 --> 40:36.100\n They're more easily able to practice privacy when it comes to having private messages globally.\n\n40:36.100 --> 40:38.440\n These are all good things and we need to keep pushing.\n\n40:38.440 --> 40:42.680\n And I think money is like, honestly, maybe the most important piece.\n\n40:42.680 --> 40:45.360\n And that's why I spent so much time thinking about Bitcoin.\n\n40:45.360 --> 40:52.280\n Okay, so politics, information, money, yes, let's talk about money.\n\n40:52.280 --> 40:53.280\n What is money?\n\n40:53.280 --> 40:58.480\n Why is it important to think about in the context of human rights?\n\n40:58.480 --> 41:06.600\n I have witnessed money be peripheralized, it has taken a backseat in the human rights\n\n41:06.600 --> 41:07.600\n conversation.\n\n41:07.600 --> 41:12.360\n The idea of currency, who makes the money, who makes the rules, who issues it, who sets\n\n41:12.360 --> 41:17.200\n the interest rates, all these things, it is not on the menu of human rights activists.\n\n41:17.200 --> 41:20.520\n If you just do like a systematic study of like the human rights discourse over the last\n\n41:20.520 --> 41:23.560\n several decades, money is not there.\n\n41:23.560 --> 41:25.160\n It's also not really taught in schools.\n\n41:25.160 --> 41:28.400\n Like children don't really learn about money, where does it come from?\n\n41:28.400 --> 41:33.760\n It's kind of hidden from a lot of our discourse.\n\n41:33.760 --> 41:37.840\n Only really when I got into Bitcoin did I started learning more about money.\n\n41:37.840 --> 41:42.640\n I spent 10 years at the Human Rights Foundation and we did all kinds of programs around the\n\n41:42.640 --> 41:43.640\n world.\n\n41:43.640 --> 41:47.980\n We convened Oslo Freedom Forums in different places and I got to meet hundreds of dissidents.\n\n41:47.980 --> 41:51.960\n And very rarely did they ever speak about currency or bank accounts or moving money\n\n41:51.960 --> 41:53.800\n from one place to another.\n\n41:53.800 --> 41:58.280\n But when I started asking them, they always had amazing stories about money, always.\n\n41:58.280 --> 42:03.220\n I mean, my friend, Ivan Mawire, who started the This Flag movement in Zimbabwe, which\n\n42:03.220 --> 42:07.620\n ended up toppling Robert Mugabe, when I asked him to come to San Francisco to give a talk\n\n42:07.620 --> 42:10.400\n about hyperinflation, which he lived through.\n\n42:10.400 --> 42:13.360\n He said, no one's ever asked me to do that before, but I'll come.\n\n42:13.360 --> 42:15.620\n And he came, this was about three years ago.\n\n42:15.620 --> 42:18.400\n And the first thing he did when he got on the stage is he opened up a shirt and he brought\n\n42:18.400 --> 42:21.880\n out a necklace that had the 1980 Zimbabwean dollar on it.\n\n42:21.880 --> 42:26.520\n And he said, we in the activist community wear this as a symbol of where our country\n\n42:26.520 --> 42:30.540\n used to be because the Zimbabwean dollar used to be worth two British pounds.\n\n42:30.540 --> 42:35.660\n And then of course, over the next two and a half decades of economic mismanagement and\n\n42:35.660 --> 42:38.620\n corruption by Mugabe, it got inflated out of existence, right?\n\n42:38.620 --> 42:41.920\n You've seen those like a hundred trillion dollars in Zimbabwean notes.\n\n42:41.920 --> 42:47.000\n So he had to live through that, which was terrible and crushing, but he is an expert\n\n42:47.000 --> 42:48.000\n on money.\n\n42:48.000 --> 42:51.880\n If you actually talk to human rights activists about money, they know a lot about money.\n\n42:51.880 --> 42:54.320\n They're just not usually asked to talk about it.\n\n42:54.320 --> 43:02.320\n So for me, when I study money or look at money, it's really about control, who's creating\n\n43:02.320 --> 43:06.580\n it, and how much does the population know about the creation of that money.\n\n43:06.580 --> 43:09.440\n And when it comes to Bitcoin, it's really the people's money.\n\n43:09.440 --> 43:12.600\n Like there is no shadowy force in charge of it.\n\n43:12.600 --> 43:14.060\n We all know the rules.\n\n43:14.060 --> 43:17.560\n We all know how it's going to get minted and how it's going to get printed.\n\n43:17.560 --> 43:20.500\n And you know, that information is out there for everybody to see.\n\n43:20.500 --> 43:25.300\n And there's no like special group of rules for one group of people or another group.\n\n43:25.300 --> 43:30.200\n You know, a billionaire and a refugee are the same in the eyes of the protocol.\n\n43:30.200 --> 43:33.220\n This is a rather revolutionary concept.\n\n43:33.220 --> 43:38.160\n And in the same way that democracy allowed us to decentralize politics and have checks\n\n43:38.160 --> 43:39.160\n and balances.\n\n43:39.160 --> 43:42.900\n And in the same way that the internet is this culmination of technologies that allowed us\n\n43:42.900 --> 43:48.960\n to decentralize information, access to and control over it, Bitcoin, you know, decentralizes\n\n43:48.960 --> 43:49.960\n money.\n\n43:49.960 --> 43:54.980\n I mean, no longer, again, is there one group of people who can just change it arbitrarily.\n\n43:54.980 --> 43:57.020\n We're all in the same playing field.\n\n43:57.020 --> 44:01.120\n And I think that that is a tremendous innovation.\n\n44:01.120 --> 44:06.220\n You know, from one perspective, money and inflation, hyperinflation is a kind of symptom\n\n44:06.220 --> 44:12.020\n of corruption, as opposed to the core of the corruption.\n\n44:12.020 --> 44:18.480\n And at the flip side, in terms of resisting the corruption, resisting the abuse of human\n\n44:18.480 --> 44:28.940\n rights, it's interesting to think that fighting inflation or fighting the mismanagement of\n\n44:28.940 --> 44:38.380\n the money supply is a way to fight back authoritarianism or to fight authoritarianism.\n\n44:38.380 --> 44:44.020\n And that's an interesting concept that I think was introduced to me by just plugging myself\n\n44:44.020 --> 44:49.220\n intellectually into the Bitcoin community, but also just cryptocurrency in general, is\n\n44:49.220 --> 44:54.840\n to like, it's not that money is a symptom.\n\n44:54.840 --> 44:58.780\n You know, money is a tool to fight back, too.\n\n44:58.780 --> 45:00.260\n Absolutely.\n\n45:00.260 --> 45:10.380\n So in what way can Bitcoin be used to fight authoritarianism, not just in the United States,\n\n45:10.380 --> 45:15.420\n but all of those 53% that you're referring to, how can Bitcoin help?\n\n45:15.420 --> 45:20.300\n So we talked about authoritarianism, and we talked about the surveillance state.\n\n45:20.300 --> 45:26.060\n To me, Bitcoin has two kind of key mechanisms through which it can help us.\n\n45:26.060 --> 45:29.260\n Number one, it's a sovereign savings account.\n\n45:29.260 --> 45:33.800\n It's debasement proof, meaning the government cannot print more whenever they want.\n\n45:33.800 --> 45:38.620\n This is very, very different from fiat currency, which by its very name, its very nature can\n\n45:38.620 --> 45:42.100\n be issued on sort of demand, right, by the rulers.\n\n45:42.100 --> 45:47.580\n And while I live in a country where the rulers do a reasonable job managing the money, most\n\n45:47.580 --> 45:48.860\n people aren't so lucky.\n\n45:48.860 --> 45:53.560\n So only 13% of humans in the world live in a country that's a liberal democracy with\n\n45:53.560 --> 45:58.400\n property rights and has what we call a reserve currency, meaning a currency so stable and\n\n45:58.400 --> 46:02.180\n desirable that other countries save in it at the central bank level, right?\n\n46:02.180 --> 46:08.700\n You basically have the U.S., the U.K., Australia, Switzerland, the Euro, and Canada.\n\n46:08.700 --> 46:10.740\n I mean, those are like reserve currencies.\n\n46:10.740 --> 46:14.680\n And these are liberal democracies where people have reasonable guarantees over property rights.\n\n46:14.680 --> 46:19.520\n Everybody else either lives under like a weaker currency or an authoritarian regime.\n\n46:19.520 --> 46:22.800\n That's 87% of the world's population, almost 7 billion people.\n\n46:22.800 --> 46:27.580\n So for them, a sovereign savings account that's permissionless, meaning you don't have to\n\n46:27.580 --> 46:30.360\n have ID to use it, is a big, big deal.\n\n46:30.360 --> 46:34.300\n And a lot of people talk about Zimbabwe or Venezuela as some like isolated cases.\n\n46:34.300 --> 46:38.700\n Oh, well, you know, hyperinflation only happens in those two countries.\n\n46:38.700 --> 46:45.420\n I actually did some research into this and there's about one point, over, you know, close\n\n46:45.420 --> 46:49.260\n to 1.3 billion people who live under double or triple digit inflation.\n\n46:49.260 --> 46:51.340\n This is not an isolated instance.\n\n46:51.340 --> 46:57.740\n We're talking huge countries, Nigeria, 200 million people, 15% inflation, Turkey, 15%\n\n46:57.740 --> 47:02.860\n inflation for 100 million people, Argentina, 40% inflation for a country of 45 million\n\n47:02.860 --> 47:03.860\n people.\n\n47:03.860 --> 47:08.420\n So you can go down the list, there's about 35 countries where like people's earnings,\n\n47:08.420 --> 47:13.100\n their wages are literally disappearing in front of their eyes over a matter of weeks\n\n47:13.100 --> 47:17.380\n or months against things like the dollar or gold or real estate, right?\n\n47:17.380 --> 47:19.540\n So this is a huge issue.\n\n47:19.540 --> 47:21.220\n It absolutely is a human rights issue for me.\n\n47:21.220 --> 47:25.220\n I mean, when it comes to your time and energy, having control over that or having it stolen\n\n47:25.220 --> 47:27.980\n from you, I think this is pretty clear.\n\n47:27.980 --> 47:34.100\n And Bitcoin is like an immediate, low cost, easily accessible solution for people.\n\n47:34.100 --> 47:39.140\n And I've learned this not from my own assumptions, but by talking to people, by interviewing\n\n47:39.140 --> 47:47.300\n dozens of people, whether it's in Sudan, which currently has triple digit inflation, or people\n\n47:47.300 --> 47:51.620\n who've escaped from Syria, who have used Bitcoin to get their wealth out of the country, and\n\n47:51.620 --> 47:55.900\n then also to make payments back to people inside, or Venezuela or elsewhere.\n\n47:55.900 --> 47:58.260\n It's very, very powerful.\n\n47:58.260 --> 48:03.220\n I think some very small percentage of people who have used, have owned Bitcoin was something\n\n48:03.220 --> 48:04.220\n like 1%, right?\n\n48:04.220 --> 48:07.140\n Of the world, whatever that number is, it's small.\n\n48:07.140 --> 48:12.020\n Call it 2% for the purposes of our, about a little under 200 million people.\n\n48:12.020 --> 48:13.020\n Wow.\n\n48:13.020 --> 48:14.020\n Yeah.\n\n48:14.020 --> 48:15.140\n At most, right now.\n\n48:15.140 --> 48:18.060\n So if we look at Zimbabwe, Sudan, if we look at...\n\n48:18.060 --> 48:19.980\n Small percentages of people.\n\n48:19.980 --> 48:22.060\n Do you think the technology is mature enough?\n\n48:22.060 --> 48:25.860\n Because it's not just about the idea, it's also about the implementation of it.\n\n48:25.860 --> 48:32.900\n Like Bitcoin, for the most part, requires access to the internet.\n\n48:32.900 --> 48:33.900\n Yeah.\n\n48:33.900 --> 48:41.860\n And what do you think about accessibility of this technology now as a method of activism\n\n48:41.860 --> 48:43.420\n in the worst parts of the world?\n\n48:43.420 --> 48:47.820\n We often think like all the conversations we've had about Bitcoin is essentially middle\n\n48:47.820 --> 48:51.220\n class, like wealthy people relative to the rest of the world.\n\n48:51.220 --> 48:56.060\n They're kind of talking sort of investment and high concept ideas.\n\n48:56.060 --> 48:59.820\n Then there's also the people in the world who are suffering, who are living through\n\n48:59.820 --> 49:00.820\n hyperinflation.\n\n49:00.820 --> 49:03.940\n They may not have a computer or access to the internet.\n\n49:03.940 --> 49:05.820\n How do you think Bitcoin can help there?\n\n49:05.820 --> 49:06.820\n Yeah.\n\n49:06.820 --> 49:11.140\n So again, we have one clear use case, which is a sovereign savings account that you can\n\n49:11.140 --> 49:12.140\n control, right?\n\n49:12.140 --> 49:15.260\n The other use case is an unstoppable payments network.\n\n49:15.260 --> 49:19.540\n This is very important for people who live behind, for example, sanctions, like the US\n\n49:19.540 --> 49:24.400\n like basically weaponizes the dollar and like sanctions different countries.\n\n49:24.400 --> 49:28.420\n And instead of sanctioning like a handful of rulers, for example, which I would support,\n\n49:28.420 --> 49:31.020\n this is like a Magnitsky or smart sanctions.\n\n49:31.020 --> 49:33.180\n Sometimes we'll just say, we're just going to shut off this whole country.\n\n49:33.180 --> 49:34.180\n So the people suffer.\n\n49:34.180 --> 49:36.200\n Cuba or Iran are good examples.\n\n49:36.200 --> 49:37.700\n Average people suffer, right?\n\n49:37.700 --> 49:42.900\n So people in those two countries I just mentioned, Cuba, Iran, or even Palestine, which is also\n\n49:42.900 --> 49:45.540\n sort of like blockaded by the Israelis.\n\n49:45.540 --> 49:49.660\n So you have Cuba, Iran, Palestine are three good examples where people inside all three\n\n49:49.660 --> 49:54.060\n of those countries now are using Bitcoin to do commerce, do their business, send money\n\n49:54.060 --> 49:55.060\n back and forth.\n\n49:55.060 --> 49:56.740\n So sanctions resistant.\n\n49:56.740 --> 49:57.740\n Sanctions resistant.\n\n49:57.740 --> 50:01.140\n It does not get stopped by sanctions, right?\n\n50:01.140 --> 50:03.940\n And also it's, again, remittances are extortionate.\n\n50:03.940 --> 50:09.600\n I mean, the average remittance, you know, costs has a high fee, takes several days.\n\n50:09.600 --> 50:13.340\n If your family is in Ghana or something like that, or Nigeria, and you live in the United\n\n50:13.340 --> 50:16.380\n States, it can take time to use Western Union.\n\n50:16.380 --> 50:20.980\n Sometimes it gets paused, it gets lost, there's issues, you have to deal with customer service.\n\n50:20.980 --> 50:21.980\n Screw that.\n\n50:21.980 --> 50:26.200\n I mean, you know, if the person has a cell phone, which increasingly is the case, I mean,\n\n50:26.200 --> 50:31.460\n by the end of next year, more than five or six billion people depending on different\n\n50:31.460 --> 50:35.740\n estimates will have smartphones basically by the end of 2022.\n\n50:35.740 --> 50:40.140\n We're talking like the vast majority of humans will have access to smartphones.\n\n50:40.140 --> 50:42.500\n They can all have sovereign Bitcoin wallets.\n\n50:42.500 --> 50:47.300\n And there's even ways to access Bitcoin without the internet.\n\n50:47.300 --> 50:48.860\n But I mean, we can get into that.\n\n50:48.860 --> 50:50.580\n There's like hardware wallets and so on.\n\n50:50.580 --> 50:55.460\n What do you mean by sovereign Bitcoin wallet?\n\n50:55.460 --> 51:00.360\n You know, most users today are using Bitcoin in a custodial manner.\n\n51:00.360 --> 51:06.700\n So this is kind of like having a bank account where you have a deposit account at a bank,\n\n51:06.700 --> 51:07.700\n right?\n\n51:07.700 --> 51:08.700\n So you have a claim, right?\n\n51:08.700 --> 51:12.260\n You go to the bank and they have some of your money and you take it out, right?\n\n51:12.260 --> 51:13.360\n With an ATM.\n\n51:13.360 --> 51:20.220\n So what I would call noncustodial Bitcoin use would be similar to withdrawing cash from\n\n51:20.220 --> 51:21.220\n an ATM.\n\n51:21.220 --> 51:22.220\n You have it.\n\n51:22.220 --> 51:23.220\n It's a bearer instrument.\n\n51:23.220 --> 51:24.220\n OK, so when I...\n\n51:24.220 --> 51:25.220\n Bearer instrument.\n\n51:25.220 --> 51:26.220\n That's what it's called.\n\n51:26.220 --> 51:27.220\n It's a bearer instrument.\n\n51:27.220 --> 51:28.220\n I know.\n\n51:28.220 --> 51:29.220\n I apologize.\n\n51:29.220 --> 51:30.220\n I'm outside this community.\n\n51:30.220 --> 51:36.380\n I'm in a bar of gold or a banknote or Bitcoin that you control, meaning you have the seed\n\n51:36.380 --> 51:37.380\n phrase, right?\n\n51:37.380 --> 51:42.000\n Which for the listeners essentially is 12 to 24 English words that you write down on\n\n51:42.000 --> 51:43.000\n a piece of paper.\n\n51:43.000 --> 51:46.340\n That's your like password to get into your Bitcoin account.\n\n51:46.340 --> 51:49.520\n And that gives you that bearer instrument quality, right?\n\n51:49.520 --> 51:55.500\n But unfortunately, most users still use Bitcoin in a custodial way, meaning they buy it on\n\n51:55.500 --> 51:58.460\n Coinbase or Square or something like that.\n\n51:58.460 --> 52:04.020\n You would put into the custodial into the custodial category like a bank.\n\n52:04.020 --> 52:07.660\n And look, the good news is you can withdraw to your own control.\n\n52:07.660 --> 52:11.420\n And in the Bitcoin community, we try to teach this idea that it's not your keys, not your\n\n52:11.420 --> 52:15.100\n coins in the same way that if you deposit your money at the bank, you might not get\n\n52:15.100 --> 52:16.100\n it back.\n\n52:16.100 --> 52:19.740\n I mean, it's low likelihood, but it's very possible.\n\n52:19.740 --> 52:20.740\n Same thing in Bitcoin.\n\n52:20.740 --> 52:24.380\n Like if you want to get the full experience, you want to actually custody your own Bitcoin.\n\n52:24.380 --> 52:28.660\n You want to put it whether it's on an open source software wallet, like the blue wallet\n\n52:28.660 --> 52:33.660\n is a good one for people to check out or a hardware wallet like cold card, for example.\n\n52:33.660 --> 52:35.640\n There's different ways to do this.\n\n52:35.640 --> 52:39.620\n But essentially, like around the world, people are innovating.\n\n52:39.620 --> 52:41.940\n Like don't think so low of your fellow man.\n\n52:41.940 --> 52:42.940\n You know what I mean?\n\n52:42.940 --> 52:44.700\n Like people are able to figure this out.\n\n52:44.700 --> 52:47.780\n You know, I get a lot of flak from people saying, oh, Bitcoin is so hard to use.\n\n52:47.780 --> 52:50.860\n I read this article in the New York Times saying this guy in Silicon Valley lost all\n\n52:50.860 --> 52:51.960\n of his Bitcoin.\n\n52:51.960 --> 52:54.220\n That's because he was a moron and didn't care about it.\n\n52:54.220 --> 52:58.260\n This guy lost all this Bitcoin because it wasn't worth much 10 years ago and he, you\n\n52:58.260 --> 52:59.540\n know, he forgot the password.\n\n52:59.540 --> 53:03.380\n But if you're like receiving your remittance from a family member, you're going to lose\n\n53:03.380 --> 53:04.380\n the password.\n\n53:04.380 --> 53:05.380\n Right.\n\n53:05.380 --> 53:09.100\n And you trust in the basic intelligence of people to figure this out and to innovate\n\n53:09.100 --> 53:10.740\n and so on and figure out.\n\n53:10.740 --> 53:12.740\n We're watching it, man.\n\n53:12.740 --> 53:13.740\n Yeah.\n\n53:13.740 --> 53:18.540\n You know, I'm, it's kind of funny that, but people in the United States are not very savvy\n\n53:18.540 --> 53:20.020\n with money.\n\n53:20.020 --> 53:24.740\n It's exactly the way you're describing is like when you have very little money, you're\n\n53:24.740 --> 53:27.060\n going to be savvy with money.\n\n53:27.060 --> 53:32.260\n You're going to understand exactly the mechanisms that work, that are resistant to the corruption\n\n53:32.260 --> 53:33.260\n that's around you.\n\n53:33.260 --> 53:40.100\n I mean, I remember sort of growing up in the Soviet Union, the general bureaucracy and\n\n53:40.100 --> 53:44.060\n the corruption of everything around you, you figure out ways around that.\n\n53:44.060 --> 53:49.340\n You figure out ways how to function within that kind of system to survive under inflation,\n\n53:49.340 --> 53:54.420\n under hyperinflation, under all like basically being unable to trust any kind of, even the\n\n53:54.420 --> 53:56.200\n police force and all those kinds of things.\n\n53:56.200 --> 54:01.340\n You figure it out and that same way, perhaps Bitcoin could be all the different ways to\n\n54:01.340 --> 54:05.540\n store and gain Bitcoin.\n\n54:05.540 --> 54:09.340\n These mechanisms could be something that's figured out in the third world as opposed\n\n54:09.340 --> 54:10.340\n to in the United States.\n\n54:10.340 --> 54:14.580\n Oh, I mean, I would say the capital of Bitcoin could easily be Lagos and not San Francisco\n\n54:14.580 --> 54:17.140\n in terms of users, in terms of people using it.\n\n54:17.140 --> 54:22.100\n And again, the two use cases as a savings account and as an unstoppable payment rail.\n\n54:22.100 --> 54:24.740\n These are the two ones that you should really think about, this is how people are using\n\n54:24.740 --> 54:25.740\n it today.\n\n54:25.740 --> 54:31.540\n Now, when it comes to, could it possibly be adopted by like a sufficient majority of the\n\n54:31.540 --> 54:32.540\n population?\n\n54:32.540 --> 54:33.540\n I say, yes.\n\n54:33.540 --> 54:36.460\n And it's very similar to the way the mobile phone spread.\n\n54:36.460 --> 54:40.820\n At the beginning, the cell phone was only for rich people, it was only for the elite,\n\n54:40.820 --> 54:44.740\n it was huge, it didn't work very well, the interface sucked, it was clunky.\n\n54:44.740 --> 54:49.060\n Over time, it got smaller and smaller and cheaper and cheaper and easier to use and\n\n54:49.060 --> 54:50.060\n easier to use.\n\n54:50.060 --> 54:52.060\n And today, everyone benefits.\n\n54:52.060 --> 54:55.940\n So you're going to watch a similar technology upgrade process with Bitcoin.\n\n54:55.940 --> 54:59.460\n Already in the last 10 years, Bitcoin has gotten so much easier to use.\n\n54:59.460 --> 55:02.580\n I mean, there are now mobile wallets that are so slick.\n\n55:02.580 --> 55:06.520\n There's one called Moon M U U N wallet from a team in Argentina.\n\n55:06.520 --> 55:11.220\n And these guys created it because they saw their own currency devalued like three times\n\n55:11.220 --> 55:12.820\n in the last 20 years.\n\n55:12.820 --> 55:15.860\n And they've had a hell of a time trying to get their money back and forth in different\n\n55:15.860 --> 55:16.860\n countries.\n\n55:16.860 --> 55:18.540\n So they were like, let's make this easy for people.\n\n55:18.540 --> 55:22.420\n Again, you know, this is the people's money.\n\n55:22.420 --> 55:25.980\n This is something that cannot be controlled by governments or corporations.\n\n55:25.980 --> 55:27.940\n And that makes it very powerful.\n\n55:27.940 --> 55:32.020\n And I think it's actually quite exciting to be here in the adoption phase.\n\n55:32.020 --> 55:33.020\n In the early days.\n\n55:33.020 --> 55:34.660\n Yeah, man, this is the early days.\n\n55:34.660 --> 55:40.100\n And you also mentioned that Bitcoin is the mechanism of a peaceful revolution.\n\n55:40.100 --> 55:45.180\n So it's a way to resist authoritarianism in a peaceful way.\n\n55:45.180 --> 55:54.140\n It's ultimately, you know, you mentioned sort of politics, information, and money.\n\n55:54.140 --> 55:57.780\n It seems like in the space of money, this is one of the peaceful mechanisms.\n\n55:57.780 --> 55:59.780\n It's a way to opt out.\n\n55:59.780 --> 56:03.780\n You can opt out peacefully from the system.\n\n56:03.780 --> 56:06.420\n And yeah, it's beautiful, it's beautiful.\n\n56:06.420 --> 56:12.460\n So Bitcoin is currently by far the most popular sort of dominant cryptocurrency.\n\n56:12.460 --> 56:17.660\n That said, and I look forward to your letters, Bitcoin maximalists.\n\n56:17.660 --> 56:23.340\n That said, you know, Internet Explorer was the most popular browser for quite a long\n\n56:23.340 --> 56:24.340\n time.\n\n56:24.340 --> 56:31.100\n And then other browsers came along that out competed it like Chrome, Firefox, People's\n\n56:31.100 --> 56:32.100\n Checkout Brave.\n\n56:32.100 --> 56:33.980\n It's a great browser.\n\n56:33.980 --> 56:36.500\n I think it's my favorite browser at this point.\n\n56:36.500 --> 56:38.060\n Anyway, so why Bitcoin?\n\n56:38.060 --> 56:39.860\n Why not another cryptocurrency?\n\n56:39.860 --> 56:46.460\n If you look in the next 10, 20, 50, 100 years, do you think it's possible for another cryptocurrency\n\n56:46.460 --> 56:53.480\n like Ethereum or something that it's not even here yet to overtake Bitcoin as a mechanism?\n\n56:53.480 --> 56:57.020\n When you say overtake, what do you mean?\n\n56:57.020 --> 56:58.020\n What do you mean overtake?\n\n56:58.020 --> 56:59.020\n You mean number of users?\n\n56:59.020 --> 57:01.500\n Do you mean a price per coin?\n\n57:01.500 --> 57:05.980\n Yeah, the number of users, because we're talking about 1%, 2%.\n\n57:05.980 --> 57:16.340\n And if we are serious about this being in the space of money as a way to give individuals\n\n57:16.340 --> 57:22.700\n power, fight the centralized powers that use the money system and so on, how do we get\n\n57:22.700 --> 57:29.060\n from 2% to 50%, right, to 60%, to 80%?\n\n57:29.060 --> 57:35.900\n At that jump, is it obvious to you, not obvious, but do you think Bitcoin is the way to get\n\n57:35.900 --> 57:42.620\n from 2% to 50% or are there going to be other cryptocurrencies that may emerge that get\n\n57:42.620 --> 57:43.620\n us to 50%?\n\n57:43.620 --> 57:44.620\n No.\n\n57:44.620 --> 57:45.620\n I mean, Bitcoin is the innovation.\n\n57:45.620 --> 57:48.700\n The innovation is in having the decentralized mint.\n\n57:48.700 --> 57:51.380\n No one can change the monetary policy.\n\n57:51.380 --> 57:53.260\n Everything else is downstream from there.\n\n57:53.260 --> 57:55.620\n In Bitcoin, the mean would be 21 million.\n\n57:55.620 --> 57:58.020\n There's never going to be any more than 21 million.\n\n57:58.020 --> 58:02.460\n Every other cryptocurrency either has an inflationary policy, meaning there's going to continue\n\n58:02.460 --> 58:06.920\n to be more and more of it over time, or its monetary policy can be changed by a small\n\n58:06.920 --> 58:08.160\n group of people.\n\n58:08.160 --> 58:12.020\n This is vividly on display in Ethereum, which is like the second largest and second most\n\n58:12.020 --> 58:14.020\n robust cryptocurrency, right?\n\n58:14.020 --> 58:18.580\n I've talked to senior Ethereum engineers over the last couple of weeks trying to figure\n\n58:18.580 --> 58:22.020\n out what is the monetary policy of Ethereum?\n\n58:22.020 --> 58:23.220\n No one can tell me.\n\n58:23.220 --> 58:28.340\n No one knows how much ETH is going to be minted in 2022 and 2023 after they shift to proof\n\n58:28.340 --> 58:29.900\n of stake.\n\n58:29.900 --> 58:33.300\n I've seen estimates that range from 100,000 to 2 million.\n\n58:33.300 --> 58:35.940\n So at the end of the day, you're going to be trusting a small group of people to make\n\n58:35.940 --> 58:37.180\n those decisions.\n\n58:37.180 --> 58:39.340\n That is what we are escaping with Bitcoin.\n\n58:39.340 --> 58:43.740\n So all these other cryptocurrencies, they might have their use cases, virtually all\n\n58:43.740 --> 58:44.740\n of them are not.\n\n58:44.740 --> 58:48.400\n It's very important for people to know that if you take like the 4,500 cryptocurrencies\n\n58:48.400 --> 58:52.980\n on CoinMarketCap, almost all of them are scams straight up.\n\n58:52.980 --> 58:57.540\n Even the ones that have like noble intentions, I just don't think are going to add that much\n\n58:57.540 --> 58:59.540\n value ultimately.\n\n58:59.540 --> 59:04.660\n I think Bitcoin to me is the innovation and you know, that's because it has a monetary\n\n59:04.660 --> 59:08.460\n policy and an issuance schedule that cannot be changed.\n\n59:08.460 --> 59:09.660\n And that's what gets me so excited about it.\n\n59:09.660 --> 59:12.220\n I mean, that's why it's such an important tool for human rights.\n\n59:12.220 --> 59:17.380\n Yeah, it's interesting because when you grow from 2%, when you grow in the number of people\n\n59:17.380 --> 59:25.300\n using it at the scale, they're using it, it's going to need to be resistant to governments\n\n59:25.300 --> 59:27.660\n and institutions messing with it.\n\n59:27.660 --> 59:33.940\n So it's interesting to see what kind of cryptocurrency would be resistant to that.\n\n59:33.940 --> 59:35.980\n Obviously Dogecoin is going to win.\n\n59:35.980 --> 59:36.980\n Let's be honest.\n\n59:36.980 --> 59:43.700\n Well, I mean, look, the number two cryptocurrency in the world, probably by like how useful\n\n59:43.700 --> 59:49.100\n it is to people is Tether, which is totally centralized, has blacklists.\n\n59:49.100 --> 59:54.300\n So I'm not saying there won't be like new digital assets that are lumped into this category\n\n59:54.300 --> 59:59.380\n that have usage, but they're not, they're not, it's not the same innovation as Bitcoin.\n\n59:59.380 --> 1:00:03.540\n It's just sort of building on this idea of like a Euro dollar, maybe like a dollar that\n\n1:00:03.540 --> 1:00:06.900\n is minted outside of the control of the US Federal Reserve, right?\n\n1:00:06.900 --> 1:00:08.180\n It would be a Euro dollar.\n\n1:00:08.180 --> 1:00:11.940\n So stable coins are kind of like Euro dollars just minted by private actors in a way, right?\n\n1:00:11.940 --> 1:00:13.300\n But they're still tied to the dollar.\n\n1:00:13.300 --> 1:00:14.780\n They're pegged to the dollar.\n\n1:00:14.780 --> 1:00:16.740\n They're not escaping the system.\n\n1:00:16.740 --> 1:00:18.580\n Escaping the system is Bitcoin.\n\n1:00:18.580 --> 1:00:20.780\n We aren't reliant on the dollar.\n\n1:00:20.780 --> 1:00:26.820\n We have our own, you know, full store value, medium of exchange, unit of account eventually.\n\n1:00:26.820 --> 1:00:30.640\n And you know, the Bitcoin world will be denominated in different terms.\n\n1:00:30.640 --> 1:00:32.660\n And I think everyone, everything else will be tied to it.\n\n1:00:32.660 --> 1:00:33.820\n I really do.\n\n1:00:33.820 --> 1:00:38.820\n It does feel currently like Bitcoin is like, like pirates or something like that.\n\n1:00:38.820 --> 1:00:43.180\n And there's still like the central banks that are like the main navies of the, of the different\n\n1:00:43.180 --> 1:00:44.180\n nations.\n\n1:00:44.180 --> 1:00:45.180\n Yeah.\n\n1:00:45.180 --> 1:00:46.480\n It's just this, if you talk about scale.\n\n1:00:46.480 --> 1:00:51.680\n So there's going to be a moment if Bitcoin continues to grow in its impact, when governments\n\n1:00:51.680 --> 1:00:56.760\n are going to seriously contend with, you know, what do we do with this?\n\n1:00:56.760 --> 1:00:58.520\n Do you think about those moments?\n\n1:00:58.520 --> 1:01:04.800\n Is Bitcoin, is the cryptocurrency world in general going to be able to withstand the\n\n1:01:04.800 --> 1:01:11.260\n serious legal pushback from countries, from nations, especially authoritarian nations?\n\n1:01:11.260 --> 1:01:12.260\n Yeah.\n\n1:01:12.260 --> 1:01:13.260\n It's been interesting.\n\n1:01:13.260 --> 1:01:15.820\n It's been 12 years, okay?\n\n1:01:15.820 --> 1:01:20.420\n More than 12 years since Satoshi Nakamoto created Bitcoin and they haven't been able\n\n1:01:20.420 --> 1:01:21.420\n to stop it.\n\n1:01:21.420 --> 1:01:22.420\n They have tried.\n\n1:01:22.420 --> 1:01:23.580\n They have tried a lot.\n\n1:01:23.580 --> 1:01:27.460\n I wrote a long essay for Quillette on this, like, like why haven't governments been able\n\n1:01:27.460 --> 1:01:28.980\n to stop Bitcoin?\n\n1:01:28.980 --> 1:01:33.260\n And my thesis is essentially that there's been like this mix of different kinds of technical,\n\n1:01:33.260 --> 1:01:39.620\n social and economic and political incentives and disincentives that make it very difficult.\n\n1:01:39.620 --> 1:01:44.380\n And I think to me, the best way to think about it is that Bitcoin is like a Trojan horse.\n\n1:01:44.380 --> 1:01:48.720\n So just to actually tell that story just a little bit, because I think it's important\n\n1:01:48.720 --> 1:01:53.940\n to understand the classical mythology tale, I find this very interesting.\n\n1:01:53.940 --> 1:01:54.940\n Of the actual Trojan horse?\n\n1:01:54.940 --> 1:01:55.940\n Of the actual Trojan horse.\n\n1:01:55.940 --> 1:01:56.940\n Yeah.\n\n1:01:56.940 --> 1:01:58.980\n Which was told in the Aeneid actually by Virgil, right?\n\n1:01:58.980 --> 1:02:02.940\n And the idea was the Greeks had been like trying to take the city of Troy for like a\n\n1:02:02.940 --> 1:02:06.580\n decade at these like impregnable walls and they couldn't do it.\n\n1:02:06.580 --> 1:02:10.140\n And Ulysses and the rest of the Greek army were like, we don't know what to do.\n\n1:02:10.140 --> 1:02:15.340\n So Minerva, the god of strategy and war, you know, kind of like they get this idea from\n\n1:02:15.340 --> 1:02:20.340\n her, I guess, to actually try to use subterfuge and trickery to take over the city.\n\n1:02:20.340 --> 1:02:23.420\n So the idea is to, and this was sort of hatched by Ulysses, right?\n\n1:02:23.420 --> 1:02:27.500\n To put this horse together that would kind of be like a gift.\n\n1:02:27.500 --> 1:02:31.540\n So the idea was the Greeks just like pretended to leave, right?\n\n1:02:31.540 --> 1:02:32.540\n They deserted.\n\n1:02:32.540 --> 1:02:36.060\n They left behind one soldier and this horse and the Trojans looked at it and they were\n\n1:02:36.060 --> 1:02:37.700\n like, what's going on here?\n\n1:02:37.700 --> 1:02:40.820\n And they brought in the soldier and the soldier's like, look, they left.\n\n1:02:40.820 --> 1:02:43.660\n They're so sorry for all of the desecration and blood spill.\n\n1:02:43.660 --> 1:02:44.740\n This is their gift to you.\n\n1:02:44.740 --> 1:02:49.100\n It's, you know, honoring Minerva, you know, it's like this like, you know, trophy for\n\n1:02:49.100 --> 1:02:50.380\n you guys.\n\n1:02:50.380 --> 1:02:55.780\n And there were actually people inside Troy, Cassandra, a prophet, as well as Laocoon,\n\n1:02:55.780 --> 1:02:58.220\n who was like a priest who said, no, no, no, this is obviously a trick.\n\n1:02:58.220 --> 1:03:00.000\n This is obviously a trick.\n\n1:03:00.000 --> 1:03:03.620\n But they were like dispatched and ignored because the horse was like, it was just like\n\n1:03:03.620 --> 1:03:04.620\n so bad ass.\n\n1:03:04.620 --> 1:03:07.540\n So the Trojans were like, I'm bringing it in the city.\n\n1:03:07.540 --> 1:03:09.000\n So they brought it in themselves.\n\n1:03:09.000 --> 1:03:10.000\n No blood spilled at all.\n\n1:03:10.000 --> 1:03:11.000\n Right.\n\n1:03:11.000 --> 1:03:13.540\n In the middle of the night, of course, what you realize is the horse was packed with Greek\n\n1:03:13.540 --> 1:03:16.920\n soldiers and they come out and they let the army in, which was like hiding behind an island.\n\n1:03:16.920 --> 1:03:23.100\n So this idea that like something could be so attractive that you really can't say no,\n\n1:03:23.100 --> 1:03:26.220\n even if you know what's inside of it, is at play in Bitcoin.\n\n1:03:26.220 --> 1:03:29.500\n So like in Bitcoin has this number go up technology, right?\n\n1:03:29.500 --> 1:03:33.840\n It is what we call it in sort of shorthand NGO, NGU, right?\n\n1:03:33.840 --> 1:03:38.060\n But what people don't realize is that NGU is like the Trojan horse.\n\n1:03:38.060 --> 1:03:41.260\n Inside the Trojan horse is FGU, Freedom Go Up technology.\n\n1:03:41.260 --> 1:03:47.780\n So dictators and rogue regimes and corporations are going to buy, mine, tax, accumulate this\n\n1:03:47.780 --> 1:03:51.620\n thing because it's the best performing financial asset in the world.\n\n1:03:51.620 --> 1:03:56.220\n What they don't realize or they're going to have to ignore is that they're also aiding\n\n1:03:56.220 --> 1:04:00.760\n and abetting this freedom technology, which allows individuals to be sovereign and eventually\n\n1:04:00.760 --> 1:04:02.140\n erodes their power.\n\n1:04:02.140 --> 1:04:05.980\n There's no question that rogue regimes and bad actors have already used and will continue\n\n1:04:05.980 --> 1:04:06.980\n to use Bitcoin.\n\n1:04:06.980 --> 1:04:11.500\n The thing is when you think about a North Korea or a Venezuela and that government instructs\n\n1:04:11.500 --> 1:04:16.780\n some of its bureaucrats and cronies and officials to start stealing Bitcoin or accumulating\n\n1:04:16.780 --> 1:04:21.500\n it or whatever for short term gain to get around sanctions and use it to buy dollars\n\n1:04:21.500 --> 1:04:22.540\n or something like that, right?\n\n1:04:22.540 --> 1:04:23.700\n Which they can't get normally.\n\n1:04:23.700 --> 1:04:24.700\n Well, guess what?\n\n1:04:24.700 --> 1:04:28.420\n All those people who the regime has instructed to like figure this thing out and use it,\n\n1:04:28.420 --> 1:04:31.480\n they're all going to realize, oh my God, this is money the government doesn't control.\n\n1:04:31.480 --> 1:04:32.860\n And it's going to spread like a virus.\n\n1:04:32.860 --> 1:04:33.860\n Okay?\n\n1:04:33.860 --> 1:04:36.820\n So this is like the idea of the Trojan horse allegory, why I think it's so important and\n\n1:04:36.820 --> 1:04:38.460\n powerful with Bitcoin.\n\n1:04:38.460 --> 1:04:43.440\n All the people talking about Bitcoin today on TV, they don't care about freedom and privacy.\n\n1:04:43.440 --> 1:04:44.820\n They just care about number go up.\n\n1:04:44.820 --> 1:04:47.300\n But what they don't realize is what's concealed within.\n\n1:04:47.300 --> 1:04:50.120\n And that's very, very powerful to me.\n\n1:04:50.120 --> 1:04:54.420\n So the people talking about Bitcoin on TV are maybe investor types.\n\n1:04:54.420 --> 1:04:58.220\n Yeah, professional investors, corporations and soon governments.\n\n1:04:58.220 --> 1:05:04.620\n I mean, you just had today this morning on CNBC, the leader of the Republican leader\n\n1:05:04.620 --> 1:05:08.740\n of the House of Representatives, a congressman saying, like, we need to be pro Bitcoin as\n\n1:05:08.740 --> 1:05:09.740\n a country.\n\n1:05:09.740 --> 1:05:13.020\n And the other day, Peter Thiel had a very interesting comment where he was basically\n\n1:05:13.020 --> 1:05:16.020\n like, let's not fall behind China in this race.\n\n1:05:16.020 --> 1:05:22.540\n So you have influential people in our government, like sort of posturing for this, like, you\n\n1:05:22.540 --> 1:05:25.140\n know, Bitcoin race that's going to happen in the next 10 years.\n\n1:05:25.140 --> 1:05:26.580\n You're going to see this.\n\n1:05:26.580 --> 1:05:28.860\n You're going to compete to stack Bitcoin.\n\n1:05:28.860 --> 1:05:29.860\n Absolutely.\n\n1:05:29.860 --> 1:05:34.980\n So you believe the the thing that's shiny and sexy, like the Trojan horse, the number\n\n1:05:34.980 --> 1:05:35.980\n go up.\n\n1:05:35.980 --> 1:05:38.460\n It's too hard to ignore.\n\n1:05:38.460 --> 1:05:44.960\n And for it to do to define that a little further as meaning it does seem like the more people\n\n1:05:44.960 --> 1:05:48.240\n get excited and start using Bitcoin, the more its value grows.\n\n1:05:48.240 --> 1:05:49.820\n So it's just a good feedback loop.\n\n1:05:49.820 --> 1:05:51.300\n Yeah, it's a feedback loop.\n\n1:05:51.300 --> 1:05:56.780\n And then the reason you're excited about it, especially is that F.G.\n\n1:05:56.780 --> 1:05:57.780\n Freedom go up.\n\n1:05:57.780 --> 1:06:03.740\n Freedom go up, which is it ultimately gives power to the individuals to so decentralize\n\n1:06:03.740 --> 1:06:04.740\n the entire system.\n\n1:06:04.740 --> 1:06:08.540\n Yeah, I mean, like when Tesla stacks Bitcoin, they're just doing that as self interest.\n\n1:06:08.540 --> 1:06:10.420\n They think it's going to be a good inflation hedge.\n\n1:06:10.420 --> 1:06:11.420\n Fine.\n\n1:06:11.420 --> 1:06:14.660\n But what they maybe don't care about, don't realize or they don't need to care.\n\n1:06:14.660 --> 1:06:19.580\n I mean, Bitcoin's power is it like co ops people into promoting a freedom tool, even\n\n1:06:19.580 --> 1:06:22.820\n if they don't care about or even if they hate freedom, doesn't matter.\n\n1:06:22.820 --> 1:06:27.060\n So when Tesla stacks Bitcoin and the price goes up and more interest goes up and more\n\n1:06:27.060 --> 1:06:31.620\n people around the world are like, wow, Bitcoin, then more people get involved again.\n\n1:06:31.620 --> 1:06:36.500\n More adoption, more price, more developers, better user interface, more privacy tools,\n\n1:06:36.500 --> 1:06:38.140\n more mining, more network security.\n\n1:06:38.140 --> 1:06:42.620\n It's just this like positive feedback loop that continues to grow and it will grow intensely\n\n1:06:42.620 --> 1:06:45.380\n in the next decade as we go through the adoption cycle.\n\n1:06:45.380 --> 1:06:48.740\n And the reason why I'm so excited about this is the human rights world, again, to get back\n\n1:06:48.740 --> 1:06:54.540\n to our previous conversation, is very hard to find people who have, you know, the empathy\n\n1:06:54.540 --> 1:06:58.580\n or the altruism to actually make a difference abroad in places like China or Saudi Arabia\n\n1:06:58.580 --> 1:07:00.120\n or North Korea.\n\n1:07:00.120 --> 1:07:04.780\n People are very quick to just like, they'll just quickly toss off the pretty words that\n\n1:07:04.780 --> 1:07:07.780\n they care about human rights as soon as profits come into play.\n\n1:07:07.780 --> 1:07:09.940\n So there's no alignment of incentives, right?\n\n1:07:09.940 --> 1:07:13.140\n The reason why Bitcoin is so powerful is that it aligns the incentives.\n\n1:07:13.140 --> 1:07:16.020\n All of a sudden, they can be as greedy as they want.\n\n1:07:16.020 --> 1:07:18.500\n They are being forced to promote a freedom tool.\n\n1:07:18.500 --> 1:07:21.680\n This I've never seen before and it makes me, it gives me a lot of like excitement.\n\n1:07:21.680 --> 1:07:25.940\n It's very refreshing because we've been laboring in the human rights space, you have to like\n\n1:07:25.940 --> 1:07:29.620\n raise money and it's all like nonprofit work and you're like begging for people to make\n\n1:07:29.620 --> 1:07:31.200\n a difference for you.\n\n1:07:31.200 --> 1:07:36.060\n Here you have this like incredible asset which people will accumulate out of self preservation,\n\n1:07:36.060 --> 1:07:40.580\n self interest and greed, and yet it will strengthen the power of the individual.\n\n1:07:40.580 --> 1:07:42.620\n That is what we need to fight, big brother.\n\n1:07:42.620 --> 1:07:46.820\n That's what we need to fight, like what I'm scared is happening in China, like this growing\n\n1:07:46.820 --> 1:07:50.540\n authoritarian state which is powered by big data analysis.\n\n1:07:50.540 --> 1:07:56.580\n This is our way to fight back and it runs on this like really interesting engine again\n\n1:07:56.580 --> 1:08:00.780\n that like takes advantage of our base nature as humans and I know that it sounds terrible\n\n1:08:00.780 --> 1:08:07.200\n for me to say this, but I mean, ultimately we are self interested and it is hard to get\n\n1:08:07.200 --> 1:08:10.400\n people to care about others living a thousand miles away.\n\n1:08:10.400 --> 1:08:14.320\n We are kind of localized in our empathy.\n\n1:08:14.320 --> 1:08:19.300\n Being as someone who works to help people who live in like a hundred different countries,\n\n1:08:19.300 --> 1:08:23.260\n it's very difficult to get Americans to care about what's happening in Belarus or in Kashmir.\n\n1:08:23.260 --> 1:08:24.260\n It just is.\n\n1:08:24.260 --> 1:08:25.260\n But guess what?\n\n1:08:25.260 --> 1:08:29.580\n They're going to definitely care about Bitcoin because they want to see their net worth go\n\n1:08:29.580 --> 1:08:31.980\n up, they want to do better for their family, et cetera.\n\n1:08:31.980 --> 1:08:36.060\n They're going to get into this thing and it's really going to like make that powerful tool\n\n1:08:36.060 --> 1:08:37.940\n for everyone else who's using it.\n\n1:08:37.940 --> 1:08:41.820\n So this interplay dynamic is fascinating to me.\n\n1:08:41.820 --> 1:08:50.980\n Yeah, I have to, I'm somebody who doesn't like the corrupting effects of greed, but\n\n1:08:50.980 --> 1:08:52.460\n it is also human nature.\n\n1:08:52.460 --> 1:08:55.860\n Yeah, I don't like it either, but we have to be realists.\n\n1:08:55.860 --> 1:09:00.620\n You have to acknowledge it and then maybe use it for your advantage.\n\n1:09:00.620 --> 1:09:02.160\n And it's not just Bitcoin itself.\n\n1:09:02.160 --> 1:09:06.060\n Like exchanges today are adopting something called lightning network, which is a way to\n\n1:09:06.060 --> 1:09:08.020\n scale Bitcoin on a second layer.\n\n1:09:08.020 --> 1:09:11.460\n Much like we had gold bars, which we scaled with paper money and then we had visa credit\n\n1:09:11.460 --> 1:09:16.620\n cards, which were a way of scaling the paper notes, Bitcoin scales through lightning network.\n\n1:09:16.620 --> 1:09:20.580\n It's a private instant globally final settlement network.\n\n1:09:20.580 --> 1:09:22.500\n It's something you all should check out.\n\n1:09:22.500 --> 1:09:24.440\n It's very, very interesting.\n\n1:09:24.440 --> 1:09:27.860\n The exchanges aren't adopting lightning for its privacy benefits.\n\n1:09:27.860 --> 1:09:31.860\n Like lightning operates off the chain, meaning surveillance companies can't see, they can't\n\n1:09:31.860 --> 1:09:35.540\n do chain analysis on lightning because it's on an onion routed second layer kind of that\n\n1:09:35.540 --> 1:09:38.660\n works kind of like the Tor project.\n\n1:09:38.660 --> 1:09:41.020\n The exchanges don't care about privacy.\n\n1:09:41.020 --> 1:09:43.300\n They're doing it because it reduces fees.\n\n1:09:43.300 --> 1:09:45.100\n Lightning is cheaper and faster.\n\n1:09:45.100 --> 1:09:48.380\n So again, we have this really interesting alignment of incentives where like the freedom\n\n1:09:48.380 --> 1:09:52.260\n tech is being promoted by people who don't, I don't, it doesn't matter what their incentives\n\n1:09:52.260 --> 1:09:53.260\n are.\n\n1:09:53.260 --> 1:09:55.440\n I could care less if they were altruistic or not.\n\n1:09:55.440 --> 1:09:58.780\n And I think this is, and you're going to maybe see this even in the future.\n\n1:09:58.780 --> 1:10:01.820\n There's more things coming in Bitcoin down the pike.\n\n1:10:01.820 --> 1:10:04.320\n Lightning was enabled by an upgrade called Segwit, right?\n\n1:10:04.320 --> 1:10:08.380\n Which took place a few years ago, which was the culmination of the block size conflict.\n\n1:10:08.380 --> 1:10:12.700\n There's another thing coming up called cross input signature aggregation, which may, if\n\n1:10:12.700 --> 1:10:18.520\n it takes effect in the next few years, it may compel exchanges to collaboratively spend\n\n1:10:18.520 --> 1:10:23.260\n all their Bitcoin together in a way that really protects our privacy and fights surveillance.\n\n1:10:23.260 --> 1:10:25.200\n But they're not going to do it for moral reasons.\n\n1:10:25.200 --> 1:10:27.420\n They're going to do it because it's going to save them money and improve their bottom\n\n1:10:27.420 --> 1:10:28.420\n line.\n\n1:10:28.420 --> 1:10:31.860\n Can you speak to that kind of collaborative so that you can have multiple parties in a\n\n1:10:31.860 --> 1:10:33.660\n single transaction kind of thing?\n\n1:10:33.660 --> 1:10:34.660\n Yeah.\n\n1:10:34.660 --> 1:10:35.660\n Like you could do that today.\n\n1:10:35.660 --> 1:10:36.660\n Absolutely.\n\n1:10:36.660 --> 1:10:38.220\n It's called the CoinJoin, for example.\n\n1:10:38.220 --> 1:10:40.100\n But right now it's more expensive to CoinJoin in Bitcoin.\n\n1:10:40.100 --> 1:10:42.420\n You have to pay a premium for your privacy.\n\n1:10:42.420 --> 1:10:45.900\n This would flip that on its head and would basically say, if you have one transaction,\n\n1:10:45.900 --> 1:10:48.500\n hey, pile them all in, have as many parties as you want.\n\n1:10:48.500 --> 1:10:52.140\n The more parties you get in, the cheaper it's going to be per party.\n\n1:10:52.140 --> 1:10:55.140\n And that's not possible in Bitcoin today, but it might be in the future.\n\n1:10:55.140 --> 1:11:00.540\n But again, the beauty in Bitcoin are these ways that it just aligns human incentives\n\n1:11:00.540 --> 1:11:08.420\n and it aligns our most base desires and needs and realities with freedom and privacy.\n\n1:11:08.420 --> 1:11:09.780\n That I've never seen before.\n\n1:11:09.780 --> 1:11:12.220\n And that's why I think it's so interesting.\n\n1:11:12.220 --> 1:11:21.460\n So somebody like Eric Weinstein actually spoke to this, the idea of blockchain in general.\n\n1:11:21.460 --> 1:11:27.660\n From a 10,000 foot view, the blockchain is a centralized place to keep the record of\n\n1:11:27.660 --> 1:11:34.380\n everything that ever happened and does that concern you from a privacy perspective, from\n\n1:11:34.380 --> 1:11:41.500\n a control perspective, even though it's managed, especially given the low frequency of transaction\n\n1:11:41.500 --> 1:11:48.700\n for Bitcoin, you can have a lot of small computers across the globe contain the entirety set\n\n1:11:48.700 --> 1:11:52.380\n of transactions, all of those kinds of features.\n\n1:11:52.380 --> 1:11:57.900\n Does that concern you that there's one place where everything is made public in terms of\n\n1:11:57.900 --> 1:11:59.660\n everything that ever happened?\n\n1:11:59.660 --> 1:12:00.660\n No.\n\n1:12:00.660 --> 1:12:02.380\n And I'll give you two reasons.\n\n1:12:02.380 --> 1:12:07.180\n Number one, the Bitcoin blockchain is ultimately a settlement layer.\n\n1:12:07.180 --> 1:12:10.520\n It's kind of like something like Fedwire in the United States.\n\n1:12:10.520 --> 1:12:14.100\n It's a way for like institutions to settle with each other.\n\n1:12:14.100 --> 1:12:17.220\n That's what I think it's going to be like in 20, 30 years from now.\n\n1:12:17.220 --> 1:12:20.800\n The average person is never going to touch the Bitcoin blockchain probably.\n\n1:12:20.800 --> 1:12:24.980\n They're going to use things like lightning or unfortunately, they may use Bitcoin banks,\n\n1:12:24.980 --> 1:12:29.500\n but they'll either use custodians or they'll use second layer noncustodial solutions to\n\n1:12:29.500 --> 1:12:30.500\n interact.\n\n1:12:30.500 --> 1:12:32.280\n The main chain is going to get very expensive.\n\n1:12:32.280 --> 1:12:35.940\n It's going to be hundreds and hundreds and hundreds of dollars or even more if the dollar\n\n1:12:35.940 --> 1:12:39.940\n starts to weaken to make a transaction on the main chain.\n\n1:12:39.940 --> 1:12:44.580\n And that will be reserved for like very large transactions or transactions that need final\n\n1:12:44.580 --> 1:12:48.100\n final settlement, et cetera, et cetera.\n\n1:12:48.100 --> 1:12:53.300\n And I think that that's fine and that's okay.\n\n1:12:53.300 --> 1:12:59.940\n And it's very important that that ledger, that settlement layer be kept by thousands\n\n1:12:59.940 --> 1:13:01.380\n of people around the world.\n\n1:13:01.380 --> 1:13:03.220\n The Bitcoin blockchain is not centralized.\n\n1:13:03.220 --> 1:13:04.220\n It is decentralized.\n\n1:13:04.220 --> 1:13:06.820\n It is run by people like me who run a node at home.\n\n1:13:06.820 --> 1:13:08.140\n I run a personal server.\n\n1:13:08.140 --> 1:13:10.740\n I run the Bitcoin blockchain, no one else.\n\n1:13:10.740 --> 1:13:11.740\n You run it.\n\n1:13:11.740 --> 1:13:12.740\n That person runs it.\n\n1:13:12.740 --> 1:13:13.740\n There's no one in charge.\n\n1:13:13.740 --> 1:13:14.740\n Well, you have a full node?\n\n1:13:14.740 --> 1:13:15.740\n Yeah.\n\n1:13:15.740 --> 1:13:16.740\n I run a full node.\n\n1:13:16.740 --> 1:13:17.740\n It's great.\n\n1:13:17.740 --> 1:13:18.740\n That's great, man.\n\n1:13:18.740 --> 1:13:22.260\n You run it and that way you can be sovereign over all of your usage, right?\n\n1:13:22.260 --> 1:13:26.100\n And you can run it on a Raspberry Pi with less than 150 bucks of equipment.\n\n1:13:26.100 --> 1:13:30.600\n And that's so important because again, there is no Amazon web service vulnerability here.\n\n1:13:30.600 --> 1:13:31.600\n That is a problem.\n\n1:13:31.600 --> 1:13:32.600\n And I agree with you.\n\n1:13:32.600 --> 1:13:33.600\n We're trending in a bad direction.\n\n1:13:33.600 --> 1:13:37.700\n We're like, the government could just turn off a big important website or a news source.\n\n1:13:37.700 --> 1:13:41.260\n Well, they can't turn off Bitcoin because it doesn't live on AWS, it lives with us.\n\n1:13:41.260 --> 1:13:42.260\n We are Bitcoin.\n\n1:13:42.260 --> 1:13:45.300\n And I think that that's very, very powerful.\n\n1:13:45.300 --> 1:13:51.180\n And then you can have something like a lightning network where you can escape some of the constraints\n\n1:13:51.180 --> 1:13:56.340\n of the blockchain, depending on your needs of the privacy and all those kinds of things.\n\n1:13:56.340 --> 1:13:59.200\n Everything's an engineering trade off, but yeah, you can trade off some of the assurances\n\n1:13:59.200 --> 1:14:03.760\n of the base layer to go into lightning, for example, and there you can get more speed\n\n1:14:03.760 --> 1:14:04.760\n and more privacy.\n\n1:14:04.760 --> 1:14:09.740\n And the things that Bitcoin lacks, speed and privacy, for example, you can get on these\n\n1:14:09.740 --> 1:14:10.740\n second layers.\n\n1:14:10.740 --> 1:14:14.620\n So there's all kinds of cool engineering things that people are coming up with.\n\n1:14:14.620 --> 1:14:19.260\n But I also want to say anyone who says the blockchain, like that's a red flag for that\n\n1:14:19.260 --> 1:14:21.260\n person doesn't really know what they're talking about.\n\n1:14:21.260 --> 1:14:25.440\n Like Satoshi didn't use the blockchain in the white paper.\n\n1:14:25.440 --> 1:14:30.360\n Blockchain was a marketing term that people came up with later to try and do this thing\n\n1:14:30.360 --> 1:14:35.940\n that was kind of like it peaked in 2015 and it continues to be an issue today of it's\n\n1:14:35.940 --> 1:14:37.780\n blockchain not Bitcoin.\n\n1:14:37.780 --> 1:14:43.100\n And that was like a very corporate kind of social attack on Bitcoin to say we could take\n\n1:14:43.100 --> 1:14:47.500\n this ledger part of this radical thing that's for criminals and all these bad people, but\n\n1:14:47.500 --> 1:14:51.060\n we could take one part of it out and we could bring it over here and we could make it safe\n\n1:14:51.060 --> 1:14:52.980\n for everybody.\n\n1:14:52.980 --> 1:14:57.020\n The real McCoy's Bitcoin, I mean, Satoshi referred to it as the time chain.\n\n1:14:57.020 --> 1:15:00.820\n I mean, really what they're talking about is just these blocks that are connected chronologically\n\n1:15:00.820 --> 1:15:01.820\n of transactions.\n\n1:15:01.820 --> 1:15:03.620\n It's really not that exciting.\n\n1:15:03.620 --> 1:15:08.260\n The exciting part of Bitcoin is the proof of work where the transaction processing is\n\n1:15:08.260 --> 1:15:13.980\n done by mining and by energy and by real world expenditures instead of like, you know, some\n\n1:15:13.980 --> 1:15:15.860\n central ledger.\n\n1:15:15.860 --> 1:15:21.180\n And you know, when you remove the blockchain from Bitcoin, it's not very, to me, it's just\n\n1:15:21.180 --> 1:15:22.180\n not that interesting.\n\n1:15:22.180 --> 1:15:26.900\n I don't know, to me, blockchain or time chain, whatever, as it philosophically is a pretty\n\n1:15:26.900 --> 1:15:27.900\n beautiful idea.\n\n1:15:27.900 --> 1:15:33.780\n I mean, it's pretty simple, but it's nevertheless as beautiful from a big database person.\n\n1:15:33.780 --> 1:15:39.620\n It's an interesting way to store information that, especially that's totally publicly accessible.\n\n1:15:39.620 --> 1:15:47.420\n It's I know that to Bitcoin proof of work is the fundamental idea, but to cryptocurrency\n\n1:15:47.420 --> 1:15:51.100\n and digital money in general and to money, the blockchain is a really interesting idea\n\n1:15:51.100 --> 1:15:52.100\n to me.\n\n1:15:52.100 --> 1:15:55.500\n The way I think about it is it's kind of, you know, physics.\n\n1:15:55.500 --> 1:16:00.620\n And I like that there's a place that you can rely on that's very difficult to mess with.\n\n1:16:00.620 --> 1:16:04.020\n What it's not though, like it's outside of maybe Ethereum.\n\n1:16:04.020 --> 1:16:06.220\n Every other blockchain is easy to mess with.\n\n1:16:06.220 --> 1:16:10.140\n So you're saying that proof of work is what makes it hard to mess with.\n\n1:16:10.140 --> 1:16:11.140\n Absolutely.\n\n1:16:11.140 --> 1:16:12.140\n Proof of work is the key.\n\n1:16:12.140 --> 1:16:13.140\n Right.\n\n1:16:13.140 --> 1:16:14.140\n And Ethereum is about to leave proof of work.\n\n1:16:14.140 --> 1:16:19.180\n So it's about to go to proof of stake, which is literally the existing system where a small\n\n1:16:19.180 --> 1:16:21.140\n group of people get to decide the monetary policy.\n\n1:16:21.140 --> 1:16:22.140\n Yeah.\n\n1:16:22.140 --> 1:16:25.780\n Reputation has a lot of value there and that you could be, it could be manipulated.\n\n1:16:25.780 --> 1:16:29.080\n I may sound brutal, but I'm coming at it from a political science perspective.\n\n1:16:29.080 --> 1:16:31.900\n For me, it's all about freedom versus dictatorship.\n\n1:16:31.900 --> 1:16:37.140\n And that's why I find it so compelling that regardless of how much power or might or how\n\n1:16:37.140 --> 1:16:41.020\n many armies you have, you can't change the rules of Bitcoin.\n\n1:16:41.020 --> 1:16:45.620\n If you're wrong about Bitcoin, what would that look like?\n\n1:16:45.620 --> 1:16:52.620\n What kind of thing that in 10, 20 years that you, you're not wrong.\n\n1:16:52.620 --> 1:16:53.620\n Right.\n\n1:16:53.620 --> 1:16:54.780\n It doesn't pan out.\n\n1:16:54.780 --> 1:16:58.900\n It doesn't pan out, but other things that actually make you feel good about all the\n\n1:16:58.900 --> 1:17:03.160\n hard work you've done do pan out, something you haven't expected.\n\n1:17:03.160 --> 1:17:04.340\n What might that be?\n\n1:17:04.340 --> 1:17:08.560\n Well, as we've talked about, my career started in human rights and in promoting individual\n\n1:17:08.560 --> 1:17:10.860\n freedom and fighting authoritarianism.\n\n1:17:10.860 --> 1:17:15.160\n That fight will continue on no matter what happens with Bitcoin.\n\n1:17:15.160 --> 1:17:20.380\n I think it would be a massive failure and a tragedy if this project like didn't work.\n\n1:17:20.380 --> 1:17:21.380\n The Bitcoin project.\n\n1:17:21.380 --> 1:17:22.380\n Yes.\n\n1:17:22.380 --> 1:17:24.760\n If the Bitcoin project didn't work, we would, it would, honestly, it's one of the only\n\n1:17:24.760 --> 1:17:29.260\n things that gives me hope because it is an effective way to push back against the creeping\n\n1:17:29.260 --> 1:17:31.600\n centralized control.\n\n1:17:31.600 --> 1:17:35.180\n If for whatever reason, and I can't really see, one of the reasons I'm so into it is\n\n1:17:35.180 --> 1:17:37.300\n I can't really see how it's not going to work.\n\n1:17:37.300 --> 1:17:41.380\n Again, I think the Trojan horse allegory is too powerful.\n\n1:17:41.380 --> 1:17:45.120\n These big centralized actors are going to be too greedy and they're going to want some\n\n1:17:45.120 --> 1:17:46.120\n as opposed to banning it.\n\n1:17:46.120 --> 1:17:47.860\n It's way easier for them to buy it than to ban it.\n\n1:17:47.860 --> 1:17:49.380\n I think that's just what's going to happen.\n\n1:17:49.380 --> 1:17:52.900\n But if, but if whatever, for whatever reason it failed, I would have very little hope left\n\n1:17:52.900 --> 1:17:57.380\n because really, I mean, the Chinese model of like centralizing all of your data and\n\n1:17:57.380 --> 1:18:03.900\n controlling it, I mean, ultimately is, is a very, very powerful sort of like arch force.\n\n1:18:03.900 --> 1:18:09.220\n And I would be concerned that that would be all of our, of our sort of destiny.\n\n1:18:09.220 --> 1:18:12.860\n I do have to sort of push back at a style of communication and you, you're not doing\n\n1:18:12.860 --> 1:18:13.860\n it today.\n\n1:18:13.860 --> 1:18:17.500\n You're doing, you're being exceptionally eloquent and arguing these ideas.\n\n1:18:17.500 --> 1:18:23.900\n But me, especially just from studying history and being very skeptical from growing up in\n\n1:18:23.900 --> 1:18:31.860\n the Soviet Union, I'm very skeptical and cautious when I see a community of people being very\n\n1:18:31.860 --> 1:18:34.900\n sure of an idea.\n\n1:18:34.900 --> 1:18:36.660\n Doesn't matter what that idea is.\n\n1:18:36.660 --> 1:18:40.180\n And there's a huge amount of certainty around Bitcoin.\n\n1:18:40.180 --> 1:18:43.740\n Part of it is an important feature because you, it's number go up.\n\n1:18:43.740 --> 1:18:45.740\n So far.\n\n1:18:45.740 --> 1:18:53.580\n Number go up is a really important part of the mechanism to make sure that it, it grows\n\n1:18:53.580 --> 1:18:57.980\n in impact, network effects, because I mean, it's really important to get excited about\n\n1:18:57.980 --> 1:19:01.420\n idea for take hold, that's the way human nature works and so on.\n\n1:19:01.420 --> 1:19:10.660\n But I also get, even something that you mentioned that, you know, others may not, you know,\n\n1:19:10.660 --> 1:19:15.820\n if you mentioned blockchain, you're sensitive to the attacks that have been, that have been\n\n1:19:15.820 --> 1:19:18.620\n mounted or the word blockchain have been used.\n\n1:19:18.620 --> 1:19:19.620\n People have been fooled.\n\n1:19:19.620 --> 1:19:23.940\n I mean, like people in the humanitarian sector have been fooled into thinking that some centralized\n\n1:19:23.940 --> 1:19:27.540\n blockchain project is going to help some refugee all collapsed.\n\n1:19:27.540 --> 1:19:31.700\n There's a huge, it makes me sad that there's a huge number of scams.\n\n1:19:31.700 --> 1:19:35.580\n Like you know what makes me really sad and just a tiny little tangent.\n\n1:19:35.580 --> 1:19:39.220\n There's been recently, I guess with the growing platform or something, there's been a bunch\n\n1:19:39.220 --> 1:19:42.060\n of fake Lex Friedman accounts.\n\n1:19:42.060 --> 1:19:43.060\n Yeah.\n\n1:19:43.060 --> 1:19:49.420\n And have a million, but not only do they do stupid stuff, but they've been messaging people\n\n1:19:49.420 --> 1:19:57.820\n like on LinkedIn and people write to me and they're saying like, I think it gets people.\n\n1:19:57.820 --> 1:19:59.220\n I think they click on stuff.\n\n1:19:59.220 --> 1:20:01.100\n I think they were not sure.\n\n1:20:01.100 --> 1:20:10.340\n And it makes me think like, people are gullible or not gullible, but like, they're just like\n\n1:20:10.340 --> 1:20:12.860\n I am, which is they're like hopeful about the world.\n\n1:20:12.860 --> 1:20:16.340\n They're optimistic about the world, naive about the evil that's out there.\n\n1:20:16.340 --> 1:20:17.740\n This is what goes wrong with Bitcoin.\n\n1:20:17.740 --> 1:20:19.780\n And I've seen it.\n\n1:20:19.780 --> 1:20:22.980\n People fall for these like, I mean, like in these different countries, I'm trying to like\n\n1:20:22.980 --> 1:20:27.620\n talk to different people about Bitcoin and like the amount of like MLM schemes, pyramid\n\n1:20:27.620 --> 1:20:31.300\n schemes, Ponzi schemes, there are just so many of them.\n\n1:20:31.300 --> 1:20:32.420\n And there's plenty here too.\n\n1:20:32.420 --> 1:20:37.220\n But like in Zimbabwe, I was talking to this guy who is a reporter who studies the effects\n\n1:20:37.220 --> 1:20:40.100\n like the foreign currency exchange markets.\n\n1:20:40.100 --> 1:20:43.060\n He's just saying one of the main reasons people don't want to get into Bitcoin is because\n\n1:20:43.060 --> 1:20:45.700\n they've been scammed so hard by all these other things.\n\n1:20:45.700 --> 1:20:49.240\n So I would say that that's one way it could go wrong is that like people just continue\n\n1:20:49.240 --> 1:20:54.500\n to be like afraid of it because of things that are like that in the past.\n\n1:20:54.500 --> 1:20:59.700\n So that not, it's not just the volatility, it's just the, you know, yeah, having like\n\n1:20:59.700 --> 1:21:02.980\n If you think it's a pyramid scheme, you're not going to want to get involved.\n\n1:21:02.980 --> 1:21:09.240\n And in some sense, if I were to speak to the Bitcoin Maximus community is to maybe ease\n\n1:21:09.240 --> 1:21:14.060\n up on the certainty because that gives me the signal that it's a scam, to be honest.\n\n1:21:14.060 --> 1:21:23.060\n So whenever somebody, whenever there's a lot of people being cultishly excited about something,\n\n1:21:23.060 --> 1:21:24.700\n I start being very skeptical.\n\n1:21:24.700 --> 1:21:29.260\n It's like, you know, I used to like Green Day before they became really popular.\n\n1:21:29.260 --> 1:21:32.540\n And then the moment they became really popular, I'm like, I don't know, he started wearing\n\n1:21:32.540 --> 1:21:35.220\n mascara and I was like, I don't like him anymore.\n\n1:21:35.220 --> 1:21:41.940\n So I'm very skeptical about evangelists of an idea because I think Bitcoin on its own\n\n1:21:41.940 --> 1:21:44.220\n is just a powerful idea that stands.\n\n1:21:44.220 --> 1:21:49.120\n But I also understand that in a world of a lot of competing ideas where there's a lot\n\n1:21:49.120 --> 1:21:54.780\n of scams and a lot of money to be made through those scams that you have to be, that you\n\n1:21:54.780 --> 1:21:59.500\n have to be innovative in the kind of mechanisms you use to break through the scam, the ocean\n\n1:21:59.500 --> 1:22:00.500\n of scams.\n\n1:22:00.500 --> 1:22:05.380\n I took this personality test and I'm a 99 skepticism.\n\n1:22:05.380 --> 1:22:12.140\n So I was first, sadly, cause I was first introduced to Bitcoin in 2013 and I was like, ah, whatever.\n\n1:22:12.140 --> 1:22:16.220\n And it took me four years to actually get into it, to go down the rabbit hole.\n\n1:22:16.220 --> 1:22:20.900\n I didn't really start to grasp it and start getting excited about it until 2017.\n\n1:22:20.900 --> 1:22:25.020\n So I was regrettably very, very skeptical for a long time.\n\n1:22:25.020 --> 1:22:26.740\n And I just thought it was like, whatever.\n\n1:22:26.740 --> 1:22:28.340\n So I appreciate that.\n\n1:22:28.340 --> 1:22:30.340\n And you should be skeptical.\n\n1:22:30.340 --> 1:22:34.260\n But ultimately you got to believe in things like I believe in democracy, I believe it's\n\n1:22:34.260 --> 1:22:35.260\n good for people.\n\n1:22:35.260 --> 1:22:36.620\n I believe it's better than tyranny.\n\n1:22:36.620 --> 1:22:37.620\n I believe in the internet.\n\n1:22:37.620 --> 1:22:41.300\n I know that we've had issues with centralization of the internet, but I still believe it's\n\n1:22:41.300 --> 1:22:44.620\n better to be connected than to have bridges between us.\n\n1:22:44.620 --> 1:22:45.860\n And I believe in Bitcoin.\n\n1:22:45.860 --> 1:22:52.020\n And to me, it's like a very similar progressive force that we're encountering.\n\n1:22:52.020 --> 1:22:57.620\n But yeah, be skeptical, nothing will befall you.\n\n1:22:57.620 --> 1:22:59.860\n That's bad if you're like cautious and skeptical.\n\n1:22:59.860 --> 1:23:03.020\n That's like a good mentality to have.\n\n1:23:03.020 --> 1:23:09.060\n One thing we haven't talked about all the violations of the human rights that authoritarian\n\n1:23:09.060 --> 1:23:12.240\n regimes do.\n\n1:23:12.240 --> 1:23:20.020\n There's a, not a positive, but there is a, you mentioned that nationalism is a drug.\n\n1:23:20.020 --> 1:23:26.100\n There's something beautiful about loving your country, having pride in your country, loving\n\n1:23:26.100 --> 1:23:30.340\n the, there's a feeling of belonging.\n\n1:23:30.340 --> 1:23:33.940\n It could be country, it could be tribe, it could be family.\n\n1:23:33.940 --> 1:23:35.180\n That's really powerful.\n\n1:23:35.180 --> 1:23:37.560\n And that speaks to human nature as well.\n\n1:23:37.560 --> 1:23:40.660\n And that can sometimes overpower everything else.\n\n1:23:40.660 --> 1:23:47.500\n Patriotism, and you know, sometimes it can be seen when you study history, when you look\n\n1:23:47.500 --> 1:23:55.380\n at Stalinist, the Soviet Union, or you can even look at Hitler and Nazi Germany, we tend\n\n1:23:55.380 --> 1:23:58.620\n to paint patriotism in a negative light.\n\n1:23:58.620 --> 1:24:02.060\n And then maybe when we look at the United States, but even here in the United States,\n\n1:24:02.060 --> 1:24:08.420\n people often paint patriotism in a bad light, you know, every time I say I love America,\n\n1:24:08.420 --> 1:24:12.320\n also as an immigrant, I love this country.\n\n1:24:12.320 --> 1:24:19.340\n It's funny how that's taken as a political statement that, you know, people, I guess\n\n1:24:19.340 --> 1:24:23.140\n on the right has been, have been more active in saying that they love the country and people\n\n1:24:23.140 --> 1:24:30.580\n on the left have not sort of, it's almost become a weird slogan as opposed to a statement\n\n1:24:30.580 --> 1:24:31.980\n of just love.\n\n1:24:31.980 --> 1:24:36.740\n And I understand that patriotism can be a slippery slope into letting your government,\n\n1:24:36.740 --> 1:24:41.780\n I mean, it's exactly what you're saying, the value of freedom of speech is you hold your\n\n1:24:41.780 --> 1:24:44.660\n government to account for all the ways they mess up.\n\n1:24:44.660 --> 1:24:47.300\n I mean, look, you have patriotism and then you have jingoism, right?\n\n1:24:47.300 --> 1:24:49.940\n It's very important that we stay on the patriotic side.\n\n1:24:49.940 --> 1:24:54.180\n Like as an American, I'm very patriotic in terms of, I love the values that this country\n\n1:24:54.180 --> 1:24:56.260\n was founded on if you read the Bill of Rights.\n\n1:24:56.260 --> 1:25:00.620\n And I love the fact that it was just flexible enough that we were able to change it to grant,\n\n1:25:00.620 --> 1:25:03.180\n or at least to try to grant all people the same rights.\n\n1:25:03.180 --> 1:25:05.180\n It was not the original plan of the founders, right?\n\n1:25:05.180 --> 1:25:06.580\n It had to be changed.\n\n1:25:06.580 --> 1:25:15.220\n But since then we've remained, those laws have remained and they're very good.\n\n1:25:15.220 --> 1:25:16.340\n And I'm very proud of that.\n\n1:25:16.340 --> 1:25:20.620\n What I'm not proud of is the jingoistic part of our country where we invade other countries\n\n1:25:20.620 --> 1:25:21.620\n and bomb other countries.\n\n1:25:21.620 --> 1:25:23.340\n I'm not proud of our prison system.\n\n1:25:23.340 --> 1:25:25.260\n I think it's a huge stain on our nation.\n\n1:25:25.260 --> 1:25:26.640\n I'm not proud of a lot of things.\n\n1:25:26.640 --> 1:25:31.060\n So I think you can be patriotic, but you can be critical of your country.\n\n1:25:31.060 --> 1:25:35.740\n And that's important, I feel like the jingoistic thing is the thing that we need to watch out\n\n1:25:35.740 --> 1:25:37.800\n for.\n\n1:25:37.800 --> 1:25:40.380\n That's just my own personal take.\n\n1:25:40.380 --> 1:25:44.540\n Out of all the projects that the Human Rights Foundation works on, what's the most important\n\n1:25:44.540 --> 1:25:45.540\n one to you right now?\n\n1:25:45.540 --> 1:25:47.460\n Like what that's been occupying your mind?\n\n1:25:47.460 --> 1:25:51.940\n Yeah, I just read again this New Yorker piece that just came out that you should read.\n\n1:25:51.940 --> 1:25:54.420\n It's called Ghost Walls.\n\n1:25:54.420 --> 1:25:59.260\n And it's the story of how the Chinese Communist Party is committing genocide right now, just\n\n1:25:59.260 --> 1:26:04.260\n like other regimes did and the Turks did to the Armenians and the Nazis did to the Jews.\n\n1:26:04.260 --> 1:26:06.060\n And it's happening again right now.\n\n1:26:06.060 --> 1:26:08.900\n We said never again, and you know, that's just not true.\n\n1:26:08.900 --> 1:26:09.900\n We're letting it happen.\n\n1:26:09.900 --> 1:26:16.140\n And again, with the business stuff, like Airbnb is like a sponsor of the Olympics, like what?\n\n1:26:16.140 --> 1:26:20.740\n At the individual level, at a business level, how does somebody like me, who's just one\n\n1:26:20.740 --> 1:26:29.540\n little ant, how does somebody like Elon Musk, who is in charge of 10,000 ants, fight it?\n\n1:26:29.540 --> 1:26:31.880\n How do we push back?\n\n1:26:31.880 --> 1:26:36.100\n A great blueprint is the fight against the South African apartheid.\n\n1:26:36.100 --> 1:26:41.580\n So we did a few events down in Johannesburg, and I've had the pleasure of being able to\n\n1:26:41.580 --> 1:26:43.940\n go to the apartheid museum several times.\n\n1:26:43.940 --> 1:26:46.160\n And it really does a good job of chronicling how they were able to do it.\n\n1:26:46.160 --> 1:26:50.860\n It took a while, there's no doubt, but the way it was done was good.\n\n1:26:50.860 --> 1:26:54.160\n Peaceful action from abroad was very important.\n\n1:26:54.160 --> 1:26:55.780\n So there was like the Sullivan principles.\n\n1:26:55.780 --> 1:27:03.980\n So like you can peacefully protest as a company, particular regimes, and it's very effective.\n\n1:27:03.980 --> 1:27:08.280\n And not just corporations, but like the Olympics is a great example.\n\n1:27:08.280 --> 1:27:10.780\n Like Chinese government should not be able to host the Olympics.\n\n1:27:10.780 --> 1:27:14.340\n The IOC should say no, not until you close down those prison camps.\n\n1:27:14.340 --> 1:27:16.700\n This is a perfect, peaceful way to push back.\n\n1:27:16.700 --> 1:27:17.900\n No one gets hurt.\n\n1:27:17.900 --> 1:27:21.300\n Same thing when we had the Korean Olympics a few years ago, North Korea should not have\n\n1:27:21.300 --> 1:27:24.780\n been allowed any sort of symbolistic kind of hosting rights there.\n\n1:27:24.780 --> 1:27:29.020\n They have prison camps, gulags that we can see from outer space very clearly.\n\n1:27:29.020 --> 1:27:32.480\n And their regime is the cruelest one on the planet probably.\n\n1:27:32.480 --> 1:27:37.560\n Why were they able to sit and cheer and get to sort of cohost the Olympics?\n\n1:27:37.560 --> 1:27:38.560\n This is spineless.\n\n1:27:38.560 --> 1:27:44.380\n Like the IOC, the Olympics, and major corporations should stand up, especially in the cultural\n\n1:27:44.380 --> 1:27:49.300\n sector where you don't lose anything, or you shouldn't have to lose anything.\n\n1:27:49.300 --> 1:27:55.260\n So I think if we look at the way that we forced the apartheid regime out, this international\n\n1:27:55.260 --> 1:27:59.940\n solidarity of musicians, athletes, performers, celebrities is very, very powerful.\n\n1:27:59.940 --> 1:28:02.720\n Unfortunately, today's celebrities are doing the opposite.\n\n1:28:02.720 --> 1:28:08.060\n We just had this press release go out yesterday about ACON, and he's off whitewashing the\n\n1:28:08.060 --> 1:28:13.820\n crimes of the dictator of Uganda and trying to build a future city there with him.\n\n1:28:13.820 --> 1:28:19.140\n If this was the 1980s, ACON would be raising his fist and saying, we need to fight the\n\n1:28:19.140 --> 1:28:20.260\n apartheid regime.\n\n1:28:20.260 --> 1:28:21.940\n How do we get back to that?\n\n1:28:21.940 --> 1:28:22.940\n We need to think about that.\n\n1:28:22.940 --> 1:28:27.860\n We have to figure out how to harness celebrities, influencers, and companies and get them to\n\n1:28:27.860 --> 1:28:29.740\n actually stand up for something for once.\n\n1:28:29.740 --> 1:28:31.540\n I mean, that's something we've lost.\n\n1:28:31.540 --> 1:28:37.600\n We've really had a spine against that, and we've lost it.\n\n1:28:37.600 --> 1:28:38.600\n And you lose things.\n\n1:28:38.600 --> 1:28:39.600\n You lose them forever.\n\n1:28:39.600 --> 1:28:40.600\n Look at Tibet.\n\n1:28:40.600 --> 1:28:42.380\n Tibet was a big cause for people in the 90s.\n\n1:28:42.380 --> 1:28:47.620\n You used to go to colleges and kids would have the Tibetan flags all over the dorm rooms.\n\n1:28:47.620 --> 1:28:51.380\n Go ahead, we'd have Tibet on the stage, and everybody wanted to, you know, free Tibet\n\n1:28:51.380 --> 1:28:52.380\n was a big thing.\n\n1:28:52.380 --> 1:28:53.380\n Well, guess what?\n\n1:28:53.380 --> 1:28:55.300\n Like, we lost it for some reason.\n\n1:28:55.300 --> 1:28:58.580\n It's not a thing anymore, and Tibet has been totally colonized, you know?\n\n1:28:58.580 --> 1:29:05.020\n So I think it's important that we find a way to unlock an interest in the celebrity classes\n\n1:29:05.020 --> 1:29:08.300\n among athletes, singers, presidents.\n\n1:29:08.300 --> 1:29:10.620\n You know, we need to find a way to punish these people.\n\n1:29:10.620 --> 1:29:16.100\n Yeah, it's surprising because we've become more and more connected so we can communicate\n\n1:29:16.100 --> 1:29:22.540\n more effectively at a large scale, and yet we seem to be worse and worse at real activism.\n\n1:29:22.540 --> 1:29:27.300\n It seems like the outrage that's overtaken the communication channels has been very US\n\n1:29:27.300 --> 1:29:34.220\n focused and often more about outrage and less about productive activism.\n\n1:29:34.220 --> 1:29:35.220\n I'm very jaded.\n\n1:29:35.220 --> 1:29:38.940\n I mean, it's very difficult to do these things at scale effectively.\n\n1:29:38.940 --> 1:29:43.420\n I do not believe we will be successful in boycotting the Chinese Olympics.\n\n1:29:43.420 --> 1:29:44.420\n We weren't in 2008.\n\n1:29:44.420 --> 1:29:47.740\n I don't think, and they're much more evil now, and I don't think we're going to be able\n\n1:29:47.740 --> 1:29:49.460\n to do it this time.\n\n1:29:49.460 --> 1:29:53.780\n And again, to go back to the Bitcoin piece, that's why I'm like very interested in this\n\n1:29:53.780 --> 1:29:55.980\n thing because it doesn't require my altruism.\n\n1:29:55.980 --> 1:30:00.780\n It doesn't require some famous singer or some corporation to sacrifice anything.\n\n1:30:00.780 --> 1:30:04.920\n They're literally just going to follow their own profits, seeking self interested motives,\n\n1:30:04.920 --> 1:30:08.860\n and they're going to end up making a stronger human rights tool for other people.\n\n1:30:08.860 --> 1:30:09.860\n Freedom go up.\n\n1:30:09.860 --> 1:30:10.860\n FGU, man.\n\n1:30:10.860 --> 1:30:17.060\n Do you think we're, it's kind of a dark question, but do you think we're headed towards a war\n\n1:30:17.060 --> 1:30:20.540\n with China, the United States versus China?\n\n1:30:20.540 --> 1:30:21.980\n I hope not.\n\n1:30:21.980 --> 1:30:22.980\n I hope not.\n\n1:30:22.980 --> 1:30:25.420\n In the cyberspace and potentially even a hot war.\n\n1:30:25.420 --> 1:30:30.220\n I think there's too many people with too much money to be lost to go to a hot war on both\n\n1:30:30.220 --> 1:30:34.060\n sides, but eventually we're just going to, someone's going to have to stand up.\n\n1:30:34.060 --> 1:30:38.100\n I mean, the subjugation of Hong Kong and the genocide of the Uyghurs and the colonization\n\n1:30:38.100 --> 1:30:39.100\n of Tibet.\n\n1:30:39.100 --> 1:30:40.740\n I mean, Taiwan is the next big thing.\n\n1:30:40.740 --> 1:30:46.180\n I mean, Xi Jinping has made it very clear, you know, Xinjiang, Tibet, Hong Kong, Taiwan.\n\n1:30:46.180 --> 1:30:50.980\n So we're going to have to stand up for Taiwan for different reasons, both for moral reasons,\n\n1:30:50.980 --> 1:30:52.500\n but also for semiconductor reasons.\n\n1:30:52.500 --> 1:30:57.020\n We need TSMC to be on our side, not have China take over TSMC.\n\n1:30:57.020 --> 1:31:01.260\n So there's different reasons why we're going to have to protect Taiwan.\n\n1:31:01.260 --> 1:31:02.780\n And you just hope it's not a hot war.\n\n1:31:02.780 --> 1:31:07.900\n I mean, at this point, well, but also from inside the governments of China and Russia\n\n1:31:07.900 --> 1:31:13.700\n as well, but China I guess is the powerhouse here, is how do these governments get reformed?\n\n1:31:13.700 --> 1:31:18.980\n Is there a hope for them to become democracies, like true democracies, representative democracies\n\n1:31:18.980 --> 1:31:26.980\n and sort of reform them to be ethical players on the world stage?\n\n1:31:26.980 --> 1:31:28.940\n No empire lasts forever.\n\n1:31:28.940 --> 1:31:31.140\n And it's impossible to predict when these regimes fall.\n\n1:31:31.140 --> 1:31:34.620\n I mean, no one thought the Soviet Union was going to fall when it fell.\n\n1:31:34.620 --> 1:31:39.620\n Like that, like if you study like the news and the scholarship of the era, no one knew\n\n1:31:39.620 --> 1:31:43.820\n that the Tunisian government was going to fall after Mohammed Bouazizi lit himself on\n\n1:31:43.820 --> 1:31:44.820\n fire.\n\n1:31:44.820 --> 1:31:49.660\n No one predicted that that would become what we now know as the Arab Spring, right?\n\n1:31:49.660 --> 1:31:52.140\n These things are impossible to predict.\n\n1:31:52.140 --> 1:31:54.020\n And one day the Chinese regime will fall.\n\n1:31:54.020 --> 1:31:56.660\n I just, we don't know when.\n\n1:31:56.660 --> 1:31:57.660\n Yes.\n\n1:31:57.660 --> 1:32:02.660\n You know, but, and there's quite a few folks who talk about the fall of the American empire.\n\n1:32:02.660 --> 1:32:06.420\n And it also concerns me that we don't know when that might fall.\n\n1:32:06.420 --> 1:32:12.940\n You assume me as a very excited, naive American, I'm very excited by this project that I think\n\n1:32:12.940 --> 1:32:22.780\n is the beacon of hope in the world still, but that's probably how you feel before it's\n\n1:32:22.780 --> 1:32:23.780\n the end.\n\n1:32:23.780 --> 1:32:28.620\n Yeah, the party, you want to leave the party before it starts to deteriorate.\n\n1:32:28.620 --> 1:32:33.100\n I think America could continue to have like a major, major leadership role for a long,\n\n1:32:33.100 --> 1:32:34.460\n long time.\n\n1:32:34.460 --> 1:32:38.440\n I think certain things we do will become maybe no longer possible in terms of the way we\n\n1:32:38.440 --> 1:32:43.580\n intimidate people on the world stage and especially the way we use our currency as a weapon.\n\n1:32:43.580 --> 1:32:48.840\n I think that that's going to decline over time as we become more of a multipolar world.\n\n1:32:48.840 --> 1:32:53.180\n But I do still believe in America and the values that were founded on despite all the\n\n1:32:53.180 --> 1:32:54.180\n warts.\n\n1:32:54.180 --> 1:32:59.300\n I believe in us and I would prefer us absolutely to be the most prominent of the multipolar\n\n1:32:59.300 --> 1:33:02.300\n world vis a vis a regime like Russia or China.\n\n1:33:02.300 --> 1:33:03.300\n Absolutely.\n\n1:33:03.300 --> 1:33:04.300\n There's no question.\n\n1:33:04.300 --> 1:33:08.420\n So we've been talking about states and nations, but can we just briefly talk about Facebook\n\n1:33:08.420 --> 1:33:11.580\n and Twitter and companies that have a huge impact on the world as well.\n\n1:33:11.580 --> 1:33:16.460\n And actually one of the things that make America a great nation is it is the place from which\n\n1:33:16.460 --> 1:33:18.980\n these great companies have sprung up.\n\n1:33:18.980 --> 1:33:24.220\n Is there, from a human rights perspective, is there something that bothers you about\n\n1:33:24.220 --> 1:33:27.300\n Facebook about these large companies?\n\n1:33:27.300 --> 1:33:29.360\n Is there something we need to fix?\n\n1:33:29.360 --> 1:33:38.220\n Something we need to be upset about, fight back on, reform, do some sort of real activism\n\n1:33:38.220 --> 1:33:39.420\n about?\n\n1:33:39.420 --> 1:33:43.740\n I'm very concerned about social media platforms and companies.\n\n1:33:43.740 --> 1:33:46.140\n It almost feels like we're losing the golden age of the internet.\n\n1:33:46.140 --> 1:33:51.500\n You know, we could like go online and interact with each other and share and not be worried\n\n1:33:51.500 --> 1:33:52.500\n about censorship.\n\n1:33:52.500 --> 1:33:57.180\n It feels like that was a golden age, like in the late nineties, the two thousands, and\n\n1:33:57.180 --> 1:33:59.900\n now everything is becoming very politicized.\n\n1:33:59.900 --> 1:34:02.180\n And I'm not sure that there's a solution.\n\n1:34:02.180 --> 1:34:05.340\n Like I don't think there's a button we can press to fix it.\n\n1:34:05.340 --> 1:34:12.780\n I'm kind of afraid that this is sort of just what happens when societies digitize.\n\n1:34:12.780 --> 1:34:23.100\n Like I think that certain opinions just become demonized in the room and then the social\n\n1:34:23.100 --> 1:34:25.700\n room that we have on the internet.\n\n1:34:25.700 --> 1:34:28.460\n And I don't know if there's a magical solution there.\n\n1:34:28.460 --> 1:34:35.180\n I do know that there's technological solutions that will allow us to continue to communicate\n\n1:34:35.180 --> 1:34:40.060\n and for creators to reach their audiences without censorship.\n\n1:34:40.060 --> 1:34:41.120\n And that's very exciting.\n\n1:34:41.120 --> 1:34:48.220\n Like right now you could be deplatformed from your, you know, from like whether it's Patreon\n\n1:34:48.220 --> 1:34:52.300\n or YouTube or whatever, and your bank account can be closed down, right?\n\n1:34:52.300 --> 1:34:57.220\n There are emerging ways that Adam Curry, like the Podfather and a bunch of other people\n\n1:34:57.220 --> 1:35:02.100\n are experimenting with, where you can essentially have your audio podcast across a whole bunch\n\n1:35:02.100 --> 1:35:04.980\n of different, you know, platforms.\n\n1:35:04.980 --> 1:35:10.420\n So you know, it's censorship resistant, and then your audience can pay you over lightning\n\n1:35:10.420 --> 1:35:11.620\n in streaming money.\n\n1:35:11.620 --> 1:35:13.580\n Like they can stream you money as they listen.\n\n1:35:13.580 --> 1:35:16.080\n So you're removing the whole advertising piece.\n\n1:35:16.080 --> 1:35:18.400\n You don't need to do advertising anymore.\n\n1:35:18.400 --> 1:35:25.020\n You have this direct relationship with your audience.\n\n1:35:25.020 --> 1:35:28.980\n And this is possible with something like lightning where you can do streaming money that's censorship\n\n1:35:28.980 --> 1:35:30.740\n resistant.\n\n1:35:30.740 --> 1:35:34.540\n And a lot of the people who are building a lightning network, for example, Elizabeth\n\n1:35:34.540 --> 1:35:41.220\n Stark who, you know, started Lightning Labs and has done within her company that people\n\n1:35:41.220 --> 1:35:45.420\n that work with her have built a huge part of the lightning infrastructure, you know,\n\n1:35:45.420 --> 1:35:51.020\n what animates her is this idea of like, again, artists and creators being able to have that\n\n1:35:51.020 --> 1:35:57.460\n direct ability to reach out and have that peer to peer relationship with their audience.\n\n1:35:57.460 --> 1:35:59.080\n And I'm excited for that.\n\n1:35:59.080 --> 1:36:05.900\n And I do think that's coming, but I am very worried that the golden age of like centralized\n\n1:36:05.900 --> 1:36:08.780\n social media platforms is kind of behind us.\n\n1:36:08.780 --> 1:36:10.100\n And I'm not sure how to fix that.\n\n1:36:10.100 --> 1:36:11.980\n I don't know if that's like a fixable problem.\n\n1:36:11.980 --> 1:36:12.980\n Interesting.\n\n1:36:12.980 --> 1:36:15.580\n I have a hope that it's a fixable problem.\n\n1:36:15.580 --> 1:36:19.660\n I think it's fixable because there's demand for it to be fixed.\n\n1:36:19.660 --> 1:36:20.860\n That's the way I think about it.\n\n1:36:20.860 --> 1:36:22.540\n Well, is Twitter that bad right now?\n\n1:36:22.540 --> 1:36:25.720\n Like, I mean, it's fixable in as much as you can do a verification.\n\n1:36:25.720 --> 1:36:30.220\n So you can give a blue check to someone and then that person is like more credible and\n\n1:36:30.220 --> 1:36:33.200\n they go to the top of the comments and there's like tweaks you can do.\n\n1:36:33.200 --> 1:36:37.180\n You can continue to improve it, but it's not going to fix the fact that like Twitter can\n\n1:36:37.180 --> 1:36:39.620\n decide to kick off the president.\n\n1:36:39.620 --> 1:36:42.700\n And like a lot of people are going to be upset by that, you know, like there's ways you can\n\n1:36:42.700 --> 1:36:46.880\n improve the UX over time and they continue to do so.\n\n1:36:46.880 --> 1:36:50.660\n Like Clubhouse is a lot of fun, great phenomenon.\n\n1:36:50.660 --> 1:36:52.040\n So is Twitter spaces.\n\n1:36:52.040 --> 1:36:57.780\n So they continue to iterate, but the censorship deplatforming piece, I'm not sure it's fixable\n\n1:36:57.780 --> 1:37:03.440\n because if you, I mean, you watch the US government haul these people, haul Zuckerberg and Dorsey\n\n1:37:03.440 --> 1:37:07.060\n and whatever in front of Congress, they want more censorship.\n\n1:37:07.060 --> 1:37:11.460\n I mean, our elected leaders want more censorship, right?\n\n1:37:11.460 --> 1:37:16.260\n See, I just believe censorship is a really harsh word.\n\n1:37:16.260 --> 1:37:21.100\n I believe it's possible to create technologies where it's not Twitter doing the censorship,\n\n1:37:21.100 --> 1:37:26.900\n but it's individuals doing their own selection of what they want and don't want to see.\n\n1:37:26.900 --> 1:37:31.500\n So for example, if you get sick and tired of Donald Trump and whatever he says, or you\n\n1:37:31.500 --> 1:37:35.580\n love Donald Trump, you get to select yourself.\n\n1:37:35.580 --> 1:37:39.760\n Like you get to have more control over what you consume.\n\n1:37:39.760 --> 1:37:46.500\n Twitter tries to do that a little bit, but they obviously fail where ideas infiltrate\n\n1:37:46.500 --> 1:37:54.260\n our view that misinformation spreads really fast and conspiracy theories spread really\n\n1:37:54.260 --> 1:38:00.720\n fast to where the immune system that Twitter has created to try to censor conspiracy theories\n\n1:38:00.720 --> 1:38:08.020\n and misinformation is over firing and you're now censoring too many people.\n\n1:38:08.020 --> 1:38:11.940\n So it's exactly the same intuition as you said before.\n\n1:38:11.940 --> 1:38:17.500\n If the state is doing it, in this case, Twitter is kind of the state that's not going to work\n\n1:38:17.500 --> 1:38:18.660\n out well.\n\n1:38:18.660 --> 1:38:24.300\n But if you give power to the individuals to do this sort of the, not even censorship,\n\n1:38:24.300 --> 1:38:33.420\n but incentivization and deaccentivization of great thoughtful content and terrible low\n\n1:38:33.420 --> 1:38:39.540\n effort content, then I feel like that's going to create a system where there's going to\n\n1:38:39.540 --> 1:38:45.820\n be a much more open discourse of ideas, dangerous ideas, difficult ideas, controversial ideas,\n\n1:38:45.820 --> 1:38:50.860\n and people in a decentralized way will be able to use their own intelligence to select\n\n1:38:50.860 --> 1:38:53.780\n content to share content, spread content.\n\n1:38:53.780 --> 1:38:55.580\n Let's keep it simple.\n\n1:38:55.580 --> 1:38:58.660\n Let's look at one example, Twitter and Jack Dorsey.\n\n1:38:58.660 --> 1:39:03.980\n And I think it's quite clear that what he believes is the solution is as you're kind\n\n1:39:03.980 --> 1:39:12.020\n of hinting at a more kind of like regionalized system, which is not have one we call federated\n\n1:39:12.020 --> 1:39:13.020\n system, right?\n\n1:39:13.020 --> 1:39:15.680\n Which does not just have like one company in charge of everything, but there's an open\n\n1:39:15.680 --> 1:39:18.860\n protocol and then there's like different instances, right?\n\n1:39:18.860 --> 1:39:24.220\n So Twitter may, you know, Jack's dream for Twitter is that Twitter is this open protocol\n\n1:39:24.220 --> 1:39:27.340\n that the Russian government can use and the Chinese government can use and the Iranian\n\n1:39:27.340 --> 1:39:30.540\n government can use and the American government can use and then Twitter as a company is going\n\n1:39:30.540 --> 1:39:31.660\n to use too.\n\n1:39:31.660 --> 1:39:35.860\n And you as the customer decide which implementation you want to join and there's going to be different\n\n1:39:35.860 --> 1:39:43.600\n censorship on each instance or each federation, but the protocol itself would be like untouchable.\n\n1:39:43.600 --> 1:39:46.060\n This is kind of like the idea behind the internet, right?\n\n1:39:46.060 --> 1:39:50.900\n There's like different parts of the internet that are censored, but like at the very bottom\n\n1:39:50.900 --> 1:39:56.820\n of the very bottom of the backbone of it, it's like this globally connected relatively\n\n1:39:56.820 --> 1:39:58.940\n unstoppable thing, right?\n\n1:39:58.940 --> 1:40:02.420\n So I think that's a pretty good vision and Twitter is working towards that with the blue\n\n1:40:02.420 --> 1:40:03.420\n sky initiative.\n\n1:40:03.420 --> 1:40:04.420\n We'll see.\n\n1:40:04.420 --> 1:40:08.980\n I'm a little skeptical that it like works out because I've used Mastodon, for example.\n\n1:40:08.980 --> 1:40:13.260\n Mastodon is an example of a federated social media.\n\n1:40:13.260 --> 1:40:15.340\n Now it's ruled by a benevolent.\n\n1:40:15.340 --> 1:40:17.860\n Each instance is ruled by a benevolent dictator.\n\n1:40:17.860 --> 1:40:20.580\n It's just like I happen to like this one, so I know.\n\n1:40:20.580 --> 1:40:26.540\n So rather than trust one dictator, Twitter, you could choose which dictator you want to\n\n1:40:26.540 --> 1:40:31.020\n trust and that's kind of the federated model and maybe we head that way, but you lose things.\n\n1:40:31.020 --> 1:40:36.280\n When it's federated, you lose the UX, you lose the slickness and the feel and all the\n\n1:40:36.280 --> 1:40:38.860\n millions of dollars they spend on developers.\n\n1:40:38.860 --> 1:40:43.340\n Like Mastodon is like not anywhere close to as nice to use as Twitter.\n\n1:40:43.340 --> 1:40:46.820\n So I feel like it's, again, it's this trade off that we make with everything where it's\n\n1:40:46.820 --> 1:40:50.600\n convenience, comfort, speed versus privacy and freedom, right?\n\n1:40:50.600 --> 1:40:52.340\n It's very hard to have something that gives you both.\n\n1:40:52.340 --> 1:40:53.340\n I don't know.\n\n1:40:53.340 --> 1:40:55.340\n I think, I think, uh, yeah, it is a trade off.\n\n1:40:55.340 --> 1:40:57.500\n Have you used one of these things that I feel like is good?\n\n1:40:57.500 --> 1:41:01.940\n The federated, they're not, they're not, they're not, but the federated, I don't think it's,\n\n1:41:01.940 --> 1:41:06.820\n it's a good, I think, uh, it requires genius, it requires skill, it requires great design\n\n1:41:06.820 --> 1:41:14.420\n to come up with a way to, you know, there's a Pareto front here, there's a right way to\n\n1:41:14.420 --> 1:41:16.000\n hit that trade off.\n\n1:41:16.000 --> 1:41:24.540\n And I honestly think there's the UX, the experience should be centralized, should be designed\n\n1:41:24.540 --> 1:41:31.900\n by the company, but the data and like a lot of stuff that could be used to violate your\n\n1:41:31.900 --> 1:41:34.540\n basic rights should be owned by the individual.\n\n1:41:34.540 --> 1:41:40.760\n And I think there's a way to decouple those, like create an incredible experience to where\n\n1:41:40.760 --> 1:41:46.740\n you go there and you enjoy the market where you can share your data and have complete\n\n1:41:46.740 --> 1:41:53.840\n control over it and always have, I mean, there's a lot of basic UX ideas, like just as an example,\n\n1:41:53.840 --> 1:42:00.340\n I think there should always be in everything you design, a one button that's always there\n\n1:42:00.340 --> 1:42:06.500\n that says, forget I ever existed, delete everything you know about me.\n\n1:42:06.500 --> 1:42:11.700\n And maybe it's, maybe it's one button that you click and it asks, are you sure?\n\n1:42:11.700 --> 1:42:13.500\n And you have to be able to say yes.\n\n1:42:13.500 --> 1:42:17.980\n Like that's a feature that's fundamental to a good social network, I believe.\n\n1:42:17.980 --> 1:42:23.460\n Like currently social networks, first of all, most of them don't allow you to do that.\n\n1:42:23.460 --> 1:42:27.320\n They don't make it transparent how much data they had, who they shared it with.\n\n1:42:27.320 --> 1:42:30.380\n And they also make it exceptionally difficult to delete accounts.\n\n1:42:30.380 --> 1:42:37.060\n So like that's a very basic starting point, but that having that button means that you\n\n1:42:37.060 --> 1:42:39.980\n have control, but that's step one of the control.\n\n1:42:39.980 --> 1:42:45.900\n There's a transparency of knowing exactly when, what data is being shared about you,\n\n1:42:45.900 --> 1:42:50.300\n how much data is already being recorded about you, all that is transparency.\n\n1:42:50.300 --> 1:42:54.300\n And I believe in the, I believe that's a really good business model, because when there's\n\n1:42:54.300 --> 1:42:59.500\n transparency and control, people would be willing to give over a lot more data as long\n\n1:42:59.500 --> 1:43:03.700\n as they know what they're given over, as long as they know what they can delete.\n\n1:43:03.700 --> 1:43:04.700\n Yeah.\n\n1:43:04.700 --> 1:43:10.180\n I guess maybe you're more optimistic about people caring about, I feel like not so few\n\n1:43:10.180 --> 1:43:12.420\n people actually care about their privacy and freedom.\n\n1:43:12.420 --> 1:43:17.600\n I've just watched everybody give it up, you know, but we'll see, I guess just to book\n\n1:43:17.600 --> 1:43:21.740\n in that I think we're at this moment where obviously the centralized platforms are just\n\n1:43:21.740 --> 1:43:27.300\n so much easier and better to use and to strike it out and, you know, adventure out and use\n\n1:43:27.300 --> 1:43:32.420\n a like a federated instance or something even like Keybase, which is kind of like a cool\n\n1:43:32.420 --> 1:43:35.420\n encrypted way to like have group chats.\n\n1:43:35.420 --> 1:43:39.620\n It just requires like a lot of your time and a lot of people don't have that time.\n\n1:43:39.620 --> 1:43:44.380\n But I will say one thing, like I do think there is this future where we do go into more\n\n1:43:44.380 --> 1:43:51.940\n of this like, it's called a tribal model or like tribes, which is this social environment\n\n1:43:51.940 --> 1:43:57.520\n being built on top of lightning by an app called Sphinx.\n\n1:43:57.520 --> 1:44:00.780\n And the idea is like kind of like it's like a decentralized Slack, like you have your\n\n1:44:00.780 --> 1:44:04.460\n Slack instance, which has like a bunch of people in the community and you have different\n\n1:44:04.460 --> 1:44:07.620\n ways to message each other and it's all encrypted.\n\n1:44:07.620 --> 1:44:11.260\n And then it has like plugins for like things like Jitsi instead of Zoom.\n\n1:44:11.260 --> 1:44:14.700\n So like an open source encrypted video messenger.\n\n1:44:14.700 --> 1:44:20.900\n It has ways to like plug in the content you want to get from like different platforms\n\n1:44:20.900 --> 1:44:23.320\n that you follow, like podcasts, things like that.\n\n1:44:23.320 --> 1:44:27.300\n And again, it allows you to pay those people directly in a censorship resistant private\n\n1:44:27.300 --> 1:44:28.300\n way.\n\n1:44:28.300 --> 1:44:29.580\n So it's really nice to connect to the lightning network.\n\n1:44:29.580 --> 1:44:30.580\n Yeah.\n\n1:44:30.580 --> 1:44:33.820\n So it's all sort of built on lightning, but the idea you can think about it as like you're\n\n1:44:33.820 --> 1:44:38.620\n slowly starting to build up the idea of a WeChat, but with freedom principles.\n\n1:44:38.620 --> 1:44:41.540\n Because right now, WeChat's like the king of convenience and comfort, but of course\n\n1:44:41.540 --> 1:44:45.260\n it's feeding all that data to the big brother and the surveillance state.\n\n1:44:45.260 --> 1:44:49.140\n And then we have like our own versions over here in America that are not quite as convenient\n\n1:44:49.140 --> 1:44:53.460\n or amazing, but like we give up slightly less privacy and freedom.\n\n1:44:53.460 --> 1:44:55.960\n But this thing has a lot of promising features to it.\n\n1:44:55.960 --> 1:44:56.960\n It's worth checking out.\n\n1:44:56.960 --> 1:44:58.140\n It's very like early days.\n\n1:44:58.140 --> 1:45:03.420\n Like it feels like, I mean, I was pretty young, but it feels like the nineties in the internet.\n\n1:45:03.420 --> 1:45:07.780\n Like it has that feeling where you, yeah, you know it's rough around the edges, but\n\n1:45:07.780 --> 1:45:09.260\n you can feel the magic.\n\n1:45:09.260 --> 1:45:10.260\n It's pretty cool.\n\n1:45:10.260 --> 1:45:12.940\n I'm very much like with Steve Jobs on this.\n\n1:45:12.940 --> 1:45:17.540\n I think the founding principles are exceptionally important, but at the end of the day, the\n\n1:45:17.540 --> 1:45:22.780\n design of how sleek it is, how easy it is to use.\n\n1:45:22.780 --> 1:45:26.980\n And that's not just like pretty icing on the cake.\n\n1:45:26.980 --> 1:45:33.060\n That is the icing is the cake because like how easy it is to use, how natural it is.\n\n1:45:33.060 --> 1:45:34.380\n It's the Trojan horse thing.\n\n1:45:34.380 --> 1:45:39.960\n Like you don't get, it has to be pretty and shiny and it has to have, it has to fundamentally\n\n1:45:39.960 --> 1:45:44.140\n connect to the basics of human nature, which is what is pleasant to use, what feels good\n\n1:45:44.140 --> 1:45:45.680\n to use.\n\n1:45:45.680 --> 1:45:49.980\n You have to, you know, to trick people into eating the broccoli, you have to put like\n\n1:45:49.980 --> 1:45:51.540\n a delicious whatever on it.\n\n1:45:51.540 --> 1:45:53.820\n Well, again, PGP is a kind of a pain to use, right?\n\n1:45:53.820 --> 1:45:54.820\n For if you want privacy.\n\n1:45:54.820 --> 1:45:55.820\n Yeah.\n\n1:45:55.820 --> 1:45:56.820\n So Signal is an upgrade.\n\n1:45:56.820 --> 1:45:57.820\n Signal is way better.\n\n1:45:57.820 --> 1:46:01.860\n I mean, and it's way better than it was five years ago and it's, it's not quite as good\n\n1:46:01.860 --> 1:46:07.740\n as like not quite as seamless, right, as like a WhatsApp yet, but it's almost there.\n\n1:46:07.740 --> 1:46:12.420\n And they were able to do it and you're going to see that with, with Bitcoin wallets as\n\n1:46:12.420 --> 1:46:13.420\n well.\n\n1:46:13.420 --> 1:46:14.420\n I mean, they're, they're almost there.\n\n1:46:14.420 --> 1:46:18.740\n They're like, if you use like a moon wallet is like, I mean, it's so cool looking and\n\n1:46:18.740 --> 1:46:22.860\n it's so seamless and they've spent so many hours thinking about your experience.\n\n1:46:22.860 --> 1:46:23.940\n We are getting there.\n\n1:46:23.940 --> 1:46:25.980\n Whereas 10 years ago, it was like impossible to use.\n\n1:46:25.980 --> 1:46:32.140\n One of the things that Signal doesn't have, and I believe these kinds of applications\n\n1:46:32.140 --> 1:46:39.540\n need to have is like a, I hate the term, but killer app, which is like a dumb, but very\n\n1:46:39.540 --> 1:46:42.660\n viral and popular reason to switch it.\n\n1:46:42.660 --> 1:46:50.020\n I didn't see exactly, I mean, I've been using Signal, but I haven't seen a you know, a big\n\n1:46:50.020 --> 1:46:51.020\n reason to, to switch.\n\n1:46:51.020 --> 1:46:52.020\n Well, you're on it, man.\n\n1:46:52.020 --> 1:46:53.020\n To switch.\n\n1:46:53.020 --> 1:46:54.020\n I mean, the reason.\n\n1:46:54.020 --> 1:46:56.660\n But I haven't switched everything to it, you know what I mean?\n\n1:46:56.660 --> 1:46:57.660\n Like a.\n\n1:46:57.660 --> 1:46:58.660\n Yeah.\n\n1:46:58.660 --> 1:47:04.580\n The exodus to Signal was in, in January, they had a huge user surge for two main reasons.\n\n1:47:04.580 --> 1:47:09.460\n One hilariously enough, of course, was Elon tweeted, like you should use Signal, right?\n\n1:47:09.460 --> 1:47:10.780\n Which is not insignificant.\n\n1:47:10.780 --> 1:47:14.860\n And then the other one was that like WhatsApp changed kind of some of its terms of service\n\n1:47:14.860 --> 1:47:19.700\n and like, you know, announced to all of its users in this little pop up that it was going\n\n1:47:19.700 --> 1:47:21.840\n to be sort of like changing the way it handled your data.\n\n1:47:21.840 --> 1:47:23.220\n That spooked a lot of people.\n\n1:47:23.220 --> 1:47:28.700\n So these two things really combined and tens of millions of people in the following weeks\n\n1:47:28.700 --> 1:47:30.780\n between January and February joined Signal.\n\n1:47:30.780 --> 1:47:35.880\n It's like it really has had its day in the sun and they are like frantically trying to\n\n1:47:35.880 --> 1:47:36.880\n keep up with it.\n\n1:47:36.880 --> 1:47:42.460\n Like, and it's really nice to see that, that, that this encrypted messaging service, which,\n\n1:47:42.460 --> 1:47:48.580\n which prioritizes your privacy in a way that, you know, you know, the government again may\n\n1:47:48.580 --> 1:47:51.800\n know like the metadata, but doesn't know exactly what you're saying unless they can get your\n\n1:47:51.800 --> 1:47:52.800\n hands on your phone.\n\n1:47:52.800 --> 1:47:54.260\n I think that's very, very powerful.\n\n1:47:54.260 --> 1:47:55.800\n So it can be done.\n\n1:47:55.800 --> 1:47:57.500\n I don't want to be too jaded here.\n\n1:47:57.500 --> 1:47:58.500\n I think it can be done.\n\n1:47:58.500 --> 1:47:59.500\n Yeah, I think so.\n\n1:47:59.500 --> 1:48:03.980\n I think we can fight back and I think we can make, continue to make these digital communications\n\n1:48:03.980 --> 1:48:08.940\n tools and platforms in a way that, that, that really benefits us.\n\n1:48:08.940 --> 1:48:09.940\n Yeah.\n\n1:48:09.940 --> 1:48:14.060\n I'm not, I'm not sure, but I'm hopeful as well.\n\n1:48:14.060 --> 1:48:17.900\n I'm hopeful that if you look at the trend of technologies, they ultimately are ones\n\n1:48:17.900 --> 1:48:23.580\n that respect privacy, respect security and basic human rights.\n\n1:48:23.580 --> 1:48:25.940\n I mean, that's at least the hope.\n\n1:48:25.940 --> 1:48:28.540\n So Gary Kasparov, I'm Russian.\n\n1:48:28.540 --> 1:48:31.000\n He means a lot to me on a personal level.\n\n1:48:31.000 --> 1:48:35.580\n He is the chairman of a human rights foundation.\n\n1:48:35.580 --> 1:48:37.200\n What does Gary have to do with anything?\n\n1:48:37.200 --> 1:48:39.260\n What's your relationship like with him?\n\n1:48:39.260 --> 1:48:41.560\n Do you like chess?\n\n1:48:41.560 --> 1:48:45.140\n What are his specific focuses and ideas around the HRF?\n\n1:48:45.140 --> 1:48:46.900\n Can you just speak to it in general?\n\n1:48:46.900 --> 1:48:52.740\n Yeah, so our chairman at the human rights foundation was Václav Havel, who of course\n\n1:48:52.740 --> 1:48:59.380\n was like the famous Czech democracy activist who, you know, helped lead the Velvet Revolution\n\n1:48:59.380 --> 1:49:05.800\n and then ended up becoming the first democratically elected leader of the Czech Republic after\n\n1:49:05.800 --> 1:49:08.020\n the Soviet Union fell.\n\n1:49:08.020 --> 1:49:14.660\n He passed away in 2011 and it was very difficult to find a replacement because who can fill\n\n1:49:14.660 --> 1:49:16.580\n Havel's shoes, you know?\n\n1:49:16.580 --> 1:49:19.160\n But if one could, it would be Gary, right?\n\n1:49:19.160 --> 1:49:23.860\n So we like really tried to get Gary to join and thankfully he agreed and we've had an\n\n1:49:23.860 --> 1:49:26.140\n amazing relationship with Gary over the years.\n\n1:49:26.140 --> 1:49:28.860\n I mean, he's been relentless in his pursuit of freedom.\n\n1:49:28.860 --> 1:49:32.980\n I mean, he could have retired and taken his career in a different direction and he could\n\n1:49:32.980 --> 1:49:37.100\n be hanging out with Putin and have a pleasure yacht and all kinds of stuff, but he decided\n\n1:49:37.100 --> 1:49:39.220\n to risk it.\n\n1:49:39.220 --> 1:49:43.860\n And if you actually study like the times when he was running for president in Russia, Amash\n\n1:49:43.860 --> 1:49:48.380\n Gessen followed him around in The Man Without a Face, it's a great, great book about Putin.\n\n1:49:48.380 --> 1:49:53.820\n There's a fabulous chapter where she's following around Gary when he's campaigning and I mean,\n\n1:49:53.820 --> 1:49:54.820\n he risked a lot.\n\n1:49:54.820 --> 1:49:58.860\n I mean, he can't go back to Russia anymore, he gave up his country, he's given up a huge\n\n1:49:58.860 --> 1:50:03.880\n amount to be able to speak his mind and to have this dream, this beautiful vision of\n\n1:50:03.880 --> 1:50:06.380\n a free and democratic Russia, he really believes in it.\n\n1:50:06.380 --> 1:50:11.460\n It's been a great experience, I work very closely with Gary, we talk a lot, we do different\n\n1:50:11.460 --> 1:50:13.380\n things around the world together.\n\n1:50:13.380 --> 1:50:18.140\n He's come out to a lot of events in different cities around the world.\n\n1:50:18.140 --> 1:50:22.020\n And he's been a very active chairman, this isn't some figurehead, he's very involved\n\n1:50:22.020 --> 1:50:23.420\n and it's really, really great.\n\n1:50:23.420 --> 1:50:29.000\n I mean, everything he's involved with is, as one journalist who attends our events says,\n\n1:50:29.000 --> 1:50:33.460\n when he walks in the room, the average IQ of the room goes up pretty significantly.\n\n1:50:33.460 --> 1:50:37.820\n I'm not a big chess person, unfortunately, so I have not been able to connect with him\n\n1:50:37.820 --> 1:50:40.580\n on that, but I think he probably would prefer it that way.\n\n1:50:40.580 --> 1:50:43.480\n All he gets is people who want to talk to him about chess.\n\n1:50:43.480 --> 1:50:51.060\n So here we can talk about human rights strategy and how to improve our fight against dictators.\n\n1:50:51.060 --> 1:50:57.540\n But he really has that moral clarity that I really appreciate.\n\n1:50:57.540 --> 1:51:02.660\n Yeah, he has a lot of fascinating ideas about artificial intelligence as well.\n\n1:51:02.660 --> 1:51:11.540\n Please open my eyes a little bit to the state of Russia today, because I've read most books\n\n1:51:11.540 --> 1:51:18.180\n on Putin in the English language, in sort of trying to understand things.\n\n1:51:18.180 --> 1:51:23.640\n And I try to look at it from a historical perspective, almost like we're living a hundred\n\n1:51:23.640 --> 1:51:30.100\n years from now, and I look at Putin as an important figure in the history of human civilization\n\n1:51:30.100 --> 1:51:33.020\n and study it in that way.\n\n1:51:33.020 --> 1:51:36.780\n I think the way Gary looks at it, he probably doesn't appreciate me looking at the way I\n\n1:51:36.780 --> 1:51:47.300\n do, but the way he looks at it is we can still change the direction of Russia, and we individual\n\n1:51:47.300 --> 1:51:53.700\n human beings and we communities and we nations can take actions, have policies that can change\n\n1:51:53.700 --> 1:51:55.260\n the direction of Russia.\n\n1:51:55.260 --> 1:52:01.460\n To me, I take a sort of going to the library, passive view of studying fascinating aspects\n\n1:52:01.460 --> 1:52:02.460\n of Russia.\n\n1:52:02.460 --> 1:52:08.240\n To me, Russia means like most of my family suffered through the Soviet Union, and I see\n\n1:52:08.240 --> 1:52:14.720\n beauty in suffering, the poetry, the music, the stories, and just there's so much love\n\n1:52:14.720 --> 1:52:18.820\n that emerged from the pain that I just enjoy the music of that.\n\n1:52:18.820 --> 1:52:27.380\n But to Gary and to many activists that I speak to, to them, they love not just the Russia\n\n1:52:27.380 --> 1:52:28.980\n of the past.\n\n1:52:28.980 --> 1:52:33.740\n They have a vision and a hope for Russia of the future.\n\n1:52:33.740 --> 1:52:37.980\n And they criticize me a little bit for being a little bit too scholarly about the past\n\n1:52:37.980 --> 1:52:40.920\n and ignoring the future, and there's something to that.\n\n1:52:40.920 --> 1:52:45.620\n So he opens my eyes to look to the future of Russia.\n\n1:52:45.620 --> 1:52:51.060\n Gary and a handful of other Russian activists that we work closely with, including Vladimir\n\n1:52:51.060 --> 1:52:55.820\n Karamurza, who again, I mean, it's just incredibly heroic, the man has survived two poisonings\n\n1:52:55.820 --> 1:52:57.540\n by Putin.\n\n1:52:57.540 --> 1:53:02.660\n They like to say that, you know, Russians will bring democracy to Russia on their own\n\n1:53:02.660 --> 1:53:03.660\n terms.\n\n1:53:03.660 --> 1:53:04.660\n They don't need our help.\n\n1:53:04.660 --> 1:53:07.100\n This is what Vladimir especially says.\n\n1:53:07.100 --> 1:53:10.100\n But what he does say is that we should stop propping up Putin.\n\n1:53:10.100 --> 1:53:13.740\n Like that's kind of his, stop kind of legitimizing him.\n\n1:53:13.740 --> 1:53:15.240\n That's kind of his argument.\n\n1:53:15.240 --> 1:53:17.540\n Is like, we don't need your foreign interference.\n\n1:53:17.540 --> 1:53:18.540\n We don't need your ideas.\n\n1:53:18.540 --> 1:53:19.780\n We don't, you know, we don't need your help.\n\n1:53:19.780 --> 1:53:24.480\n We can do it on our own, but please stop like propping up our, you know, illegitimate ruler.\n\n1:53:24.480 --> 1:53:29.700\n That's kind of like his point of view, which I think is interesting and fair.\n\n1:53:29.700 --> 1:53:30.700\n Yeah.\n\n1:53:30.700 --> 1:53:38.300\n Let me just say on one unrelated comment, some people criticize me and others like Joe\n\n1:53:38.300 --> 1:53:44.020\n Rogan for giving people a platform.\n\n1:53:44.020 --> 1:53:50.940\n I think in some cases that's applicable, but I think in most cases, knowledge is power\n\n1:53:50.940 --> 1:53:54.020\n and there's no such thing as giving a platform.\n\n1:53:54.020 --> 1:53:58.960\n The conversation just shines a light as long as you shine the light well.\n\n1:53:58.960 --> 1:54:05.780\n And as long as in shining the light and having the conversation, you reveal something fundamental\n\n1:54:05.780 --> 1:54:10.940\n about the state of things, about the people, whether that's Putin or some of the other\n\n1:54:10.940 --> 1:54:16.140\n controversial figures that have come up in a possible future conversation.\n\n1:54:16.140 --> 1:54:20.020\n So I don't like this kind of platforming idea.\n\n1:54:20.020 --> 1:54:22.300\n I think conversations save us.\n\n1:54:22.300 --> 1:54:23.300\n They don't destroy us.\n\n1:54:23.300 --> 1:54:24.300\n Yeah.\n\n1:54:24.300 --> 1:54:26.500\n I mean, that's, that's journalism though.\n\n1:54:26.500 --> 1:54:31.440\n I mean, that's very different from, you know, advocacy or strategic thinking about what\n\n1:54:31.440 --> 1:54:32.700\n to do with Russia.\n\n1:54:32.700 --> 1:54:33.700\n Absolutely.\n\n1:54:33.700 --> 1:54:34.700\n Yeah.\n\n1:54:34.700 --> 1:54:37.460\n We should interview everybody and everybody should know exactly what they're thinking.\n\n1:54:37.460 --> 1:54:38.460\n Yeah.\n\n1:54:38.460 --> 1:54:43.180\n I think, you know, journalism to me has become a dirty word because, because it's done so\n\n1:54:43.180 --> 1:54:51.700\n poorly by so many people that, you know, I listened to sometimes certain programs, like,\n\n1:54:51.700 --> 1:54:57.820\n I don't know, like, uh, meet the press and the Fox Sunday program, just certain things\n\n1:54:57.820 --> 1:55:02.980\n just to tune in and see what different news medias are paying attention to.\n\n1:55:02.980 --> 1:55:07.860\n And the kind of interviews they do, you know, is like five minutes at most, but usually\n\n1:55:07.860 --> 1:55:13.820\n it's like one minute it's these quick clip things and it's very gotcha and they're looking\n\n1:55:13.820 --> 1:55:17.660\n for ways to sort of grab almost a misstatement.\n\n1:55:17.660 --> 1:55:19.960\n They want to catch you off guard.\n\n1:55:19.960 --> 1:55:25.980\n They want to ask the quote, like, like the harsh question, but without any of the, like\n\n1:55:25.980 --> 1:55:30.380\n the dance of conversation that reveals the truth, you know, you can't just get to the\n\n1:55:30.380 --> 1:55:33.760\n truth by asking it.\n\n1:55:33.760 --> 1:55:36.860\n You have to sneak up on it.\n\n1:55:36.860 --> 1:55:38.940\n And I think that's an art form.\n\n1:55:38.940 --> 1:55:42.180\n And I think that art form involves long form conversation.\n\n1:55:42.180 --> 1:55:46.860\n Like I'm a huge believer in just, I guess that's, what's called, I don't know, in depth\n\n1:55:46.860 --> 1:55:52.760\n journal or whatever, like where you spend months or years on a story in that same way.\n\n1:55:52.760 --> 1:55:57.460\n I think of long form conversation is like you spend many hours and you spend months\n\n1:55:57.460 --> 1:56:02.900\n and years preparing for those many hours, but like, it's not this like short form trying\n\n1:56:02.900 --> 1:56:07.420\n to, trying to get the most controversial little tidbit of a story out.\n\n1:56:07.420 --> 1:56:13.020\n And unfortunately the funding mechanisms behind journalism are such that they are incentivized\n\n1:56:13.020 --> 1:56:18.620\n clickbait journalism versus like in depth long form digging for the truth.\n\n1:56:18.620 --> 1:56:23.300\n I have a conflicted relationship with journalism because to me, press freedom is so core and\n\n1:56:23.300 --> 1:56:27.460\n independent journalists around the world are so brave, especially in countries like Russia\n\n1:56:27.460 --> 1:56:29.180\n or China, et cetera.\n\n1:56:29.180 --> 1:56:34.980\n And really good journalism is still something I absolutely, I love and I enjoy.\n\n1:56:34.980 --> 1:56:38.460\n Like this, especially like to say again, this New Yorker piece on what's happening to the\n\n1:56:38.460 --> 1:56:40.860\n Uyghurs is incredibly well reported.\n\n1:56:40.860 --> 1:56:47.220\n However, on the other hand, you have this sort of clickbaity journalism that's all about\n\n1:56:47.220 --> 1:56:49.860\n sensationalism and that gets used as a tool.\n\n1:56:49.860 --> 1:56:55.700\n I mean, whether it be against things like privacy or Bitcoin or whatever, you have like\n\n1:56:55.700 --> 1:57:00.700\n people who sensationalize and it gets used in the service of the surveillance state,\n\n1:57:00.700 --> 1:57:02.340\n the war on terror or whatever.\n\n1:57:02.340 --> 1:57:08.380\n You know, it's difficult, but you know, I think journalism is essential to a free society.\n\n1:57:08.380 --> 1:57:13.380\n But it can sometimes be, it can wear my patience thin sometimes.\n\n1:57:13.380 --> 1:57:17.260\n Like it's been, to be honest, it's been a huge burden on me personally, if I were to\n\n1:57:17.260 --> 1:57:20.300\n just turn this into a therapy session for a brief moment.\n\n1:57:20.300 --> 1:57:25.340\n When I look at people, when I interact with people, I'd like to see the best in them.\n\n1:57:25.340 --> 1:57:32.940\n And the burden that weighs heavy on me is sometimes people I talk to may not be good\n\n1:57:32.940 --> 1:57:33.940\n people.\n\n1:57:33.940 --> 1:57:41.420\n And I don't, I'd love to, I believe everybody has good in them and I try to focus on that.\n\n1:57:41.420 --> 1:57:47.540\n The burden that weighs on me is sometimes that there may be conversations where that's\n\n1:57:47.540 --> 1:57:53.620\n irresponsible, where I have to also call people out.\n\n1:57:53.620 --> 1:57:58.580\n I have to do enough of the hard lifting and the hard work of knowing exactly what are\n\n1:57:58.580 --> 1:58:02.020\n the bad things that that person has done.\n\n1:58:02.020 --> 1:58:05.380\n And I also have the responsibility to call them out on it.\n\n1:58:05.380 --> 1:58:08.100\n And that's for me personally, just an unpleasant feeling.\n\n1:58:08.100 --> 1:58:13.220\n That's where speaking to journalism, like I think journalists are too much focused on\n\n1:58:13.220 --> 1:58:21.820\n the bad things a person has done and not enough on the digging into the full complexity of\n\n1:58:21.820 --> 1:58:25.380\n the human being behind all the things that have been done.\n\n1:58:25.380 --> 1:58:32.580\n But at the same time, you know, I can't have a conversation with Hitler and not ask about\n\n1:58:32.580 --> 1:58:33.580\n the prison camps.\n\n1:58:33.580 --> 1:58:34.580\n Yeah.\n\n1:58:34.580 --> 1:58:35.580\n Yeah.\n\n1:58:35.580 --> 1:58:36.580\n Yeah.\n\n1:58:36.580 --> 1:58:37.580\n No.\n\n1:58:37.580 --> 1:58:39.900\n So from the human rights perspective, one of our programs is we like, we try to go after\n\n1:58:39.900 --> 1:58:42.040\n people who do like PR for dictators.\n\n1:58:42.040 --> 1:58:47.320\n So like, like then a lot of people do like PR firms in Washington get hired by all these\n\n1:58:47.320 --> 1:58:51.740\n dictators and make a lot of money to make them look good.\n\n1:58:51.740 --> 1:58:54.780\n It's called whitewashing or putting lipstick on a pig or whatever you want to do.\n\n1:58:54.780 --> 1:58:58.220\n Astroturfing is like the fake, make like fake social media accounts to make it seem like\n\n1:58:58.220 --> 1:58:59.980\n you're popular.\n\n1:58:59.980 --> 1:59:01.420\n But whitewashing is a huge issue.\n\n1:59:01.420 --> 1:59:07.500\n So I think it's completely fair to interview like dictators and stuff like that.\n\n1:59:07.500 --> 1:59:10.100\n Amanpour does a pretty good job.\n\n1:59:10.100 --> 1:59:11.100\n She's really good.\n\n1:59:11.100 --> 1:59:13.940\n She makes sure that there's no messing around.\n\n1:59:13.940 --> 1:59:18.420\n I mean, her interviews of Museveni recently, the Ugandan dictator was very good.\n\n1:59:18.420 --> 1:59:22.820\n I mean, she's basically like, well, like, well, why are you rigging another election?\n\n1:59:22.820 --> 1:59:27.300\n Please tell us, you know, and she's fearless and she's good and that can be a helpful thing\n\n1:59:27.300 --> 1:59:30.100\n to have on YouTube as a resource.\n\n1:59:30.100 --> 1:59:35.700\n But it's, it's, it's quite clear when, when it descends into a PR session and you just\n\n1:59:35.700 --> 1:59:37.540\n have to be like very careful about it.\n\n1:59:37.540 --> 1:59:43.420\n Like Asma al Assad, the wife of the butcher in Syria, you know, was like profiled by Vogue\n\n1:59:43.420 --> 1:59:49.100\n and it was this whole rose in the desert things, a bunch of nonsense, terrible, terrible, terrible,\n\n1:59:49.100 --> 1:59:50.500\n total propaganda.\n\n1:59:50.500 --> 1:59:57.800\n But a like honest interview where you, you know, you're asking about all the tough questions.\n\n1:59:57.800 --> 1:59:58.800\n Very important.\n\n1:59:58.800 --> 2:00:01.140\n You know, so I think, I think it's just a matter of like content.\n\n2:00:01.140 --> 2:00:03.980\n Is this, is there a good resource to study whitewashing?\n\n2:00:03.980 --> 2:00:07.340\n Like to know what manipulative PR looks like?\n\n2:00:07.340 --> 2:00:11.740\n I think you just, you should know if you've researched the topic, you should know it inside\n\n2:00:11.740 --> 2:00:15.700\n you because it would be, is there anything you're afraid to ask?\n\n2:00:15.700 --> 2:00:16.700\n That would be it.\n\n2:00:16.700 --> 2:00:17.700\n Make sure you're asking all the questions.\n\n2:00:17.700 --> 2:00:21.100\n As long as you're asking all the questions that you have, you're good.\n\n2:00:21.100 --> 2:00:25.420\n But if there's something you're afraid to ask, then, then maybe you're self censoring,\n\n2:00:25.420 --> 2:00:26.420\n right?\n\n2:00:26.420 --> 2:00:27.420\n That's a good way.\n\n2:00:27.420 --> 2:00:32.340\n It's, it takes us back to that, like what is it that litmus test about is your country\n\n2:00:32.340 --> 2:00:36.060\n a lot to have a gay pride parade?\n\n2:00:36.060 --> 2:00:39.980\n So there's like obvious things that might be on your mind that you just want to ask\n\n2:00:39.980 --> 2:00:41.980\n and you shouldn't, you shouldn't run from them.\n\n2:00:41.980 --> 2:00:46.380\n As long as you feel like you're a free person when you're interviewing, I think you're good.\n\n2:00:46.380 --> 2:00:48.820\n That's beautifully put.\n\n2:00:48.820 --> 2:00:56.340\n Are there books, technical fiction, philosophical that had an impact on your life that you recommend\n\n2:00:56.340 --> 2:00:59.900\n or even resources like blogs, films?\n\n2:00:59.900 --> 2:01:04.200\n I have four books I'll briefly mention.\n\n2:01:04.200 --> 2:01:05.780\n Number one is The Fear.\n\n2:01:05.780 --> 2:01:07.800\n The Fear had a deep impact on me.\n\n2:01:07.800 --> 2:01:09.600\n The Fear was written by Peter Godwin.\n\n2:01:09.600 --> 2:01:14.140\n It's about the systematic dismantling of Zimbabwe under Robert Mugabe.\n\n2:01:14.140 --> 2:01:17.420\n Peter is Zimbabwean and it is a riveting book.\n\n2:01:17.420 --> 2:01:21.020\n I think everyone should read it because it helps you understand what it's like to go\n\n2:01:21.020 --> 2:01:24.980\n through not just authoritarianism, but also hyperinflation.\n\n2:01:24.980 --> 2:01:28.700\n And I mean, really, you know, at the end of the day, what The Fear describes is how Mugabe\n\n2:01:28.700 --> 2:01:34.980\n took this country in the 1980s and he actually brought it back in time to the 1920s in terms\n\n2:01:34.980 --> 2:01:38.580\n of infrastructure, literacy rates, health rates, all these things.\n\n2:01:38.580 --> 2:01:40.660\n He stole so much from the people.\n\n2:01:40.660 --> 2:01:44.740\n And it's a heartbreaking book, but it's a very important book.\n\n2:01:44.740 --> 2:01:49.340\n And it's a way to do excellent, excellent journalism.\n\n2:01:49.340 --> 2:01:50.820\n So The Fear is a good one.\n\n2:01:50.820 --> 2:01:52.660\n And it's a personal story?\n\n2:01:52.660 --> 2:01:53.660\n Absolutely.\n\n2:01:53.660 --> 2:01:54.660\n Yeah.\n\n2:01:54.660 --> 2:01:57.780\n Because he was, it's part of his whole family story and he's in there.\n\n2:01:57.780 --> 2:02:00.520\n He's interviewing people personally.\n\n2:02:00.520 --> 2:02:02.340\n So I would say that one.\n\n2:02:02.340 --> 2:02:06.820\n Is it also connected, sorry to interrupt, is it, from the inflation perspective, is\n\n2:02:06.820 --> 2:02:10.060\n it a good study of hyperinflation and the effects?\n\n2:02:10.060 --> 2:02:16.900\n Does Bitcoin at all come as a discussion of money?\n\n2:02:16.900 --> 2:02:21.420\n Does that come into the, or is it purely the experience of inflation is almost a symptom\n\n2:02:21.420 --> 2:02:22.420\n of an authoritarian government?\n\n2:02:22.420 --> 2:02:23.420\n A little bit, a little bit.\n\n2:02:23.420 --> 2:02:24.420\n I would say it's not deep.\n\n2:02:24.420 --> 2:02:29.200\n I have another book on that, which I'll recommend in a second, but I would just say that it's\n\n2:02:29.200 --> 2:02:37.420\n a very powerfully written book about how society can basically deteriorate and how you can\n\n2:02:37.420 --> 2:02:39.460\n lose everything.\n\n2:02:39.460 --> 2:02:44.140\n The second book is, I just mentioned it, but The Man Without a Face by Masha Gessen.\n\n2:02:44.140 --> 2:02:46.340\n Incredible book about modern Russia and Putin.\n\n2:02:46.340 --> 2:02:47.780\n Just a masterpiece.\n\n2:02:47.780 --> 2:02:48.780\n So that one is.\n\n2:02:48.780 --> 2:02:50.940\n Could be one of your favorite books about Putin and Russia.\n\n2:02:50.940 --> 2:02:51.940\n That one's the best.\n\n2:02:51.940 --> 2:02:53.460\n I mean, she's just so fearless.\n\n2:02:53.460 --> 2:02:54.460\n Incredible.\n\n2:02:54.460 --> 2:02:56.820\n She interviews Putin in the book at the end.\n\n2:02:56.820 --> 2:02:57.820\n It's really good.\n\n2:02:57.820 --> 2:03:04.900\n The third one is a fiction book called The Mandibles written by Lionel Shriver.\n\n2:03:04.900 --> 2:03:05.900\n This one's good.\n\n2:03:05.900 --> 2:03:06.900\n It's a good gift book.\n\n2:03:06.900 --> 2:03:07.900\n It's funny.\n\n2:03:07.900 --> 2:03:08.900\n It's dark.\n\n2:03:08.900 --> 2:03:12.980\n It's witty, but it's about the United States losing its status as the reserve currency\n\n2:03:12.980 --> 2:03:15.040\n and going into hyperinflation.\n\n2:03:15.040 --> 2:03:19.260\n And what's interesting is that the characters in the book map where we are today.\n\n2:03:19.260 --> 2:03:22.660\n The book itself is about the late, I think it's the late 2020s.\n\n2:03:22.660 --> 2:03:27.460\n And we have a populist president who decides to announce that the United States is like\n\n2:03:27.460 --> 2:03:29.020\n basically going to default on its debts.\n\n2:03:29.020 --> 2:03:33.100\n And the rest of the world comes up with like a new currency and everybody switches to that\n\n2:03:33.100 --> 2:03:36.460\n one and the dollar like overnight becomes worthless.\n\n2:03:36.460 --> 2:03:39.480\n And all these like economists are saying, no, it's fine.\n\n2:03:39.480 --> 2:03:41.780\n Like inflation won't be a problem.\n\n2:03:41.780 --> 2:03:45.140\n And there's this one character who's an economist who's like an economist.\n\n2:03:45.140 --> 2:03:49.300\n And he's basically he gets to the point where he's living as a refugee in Prospect Park\n\n2:03:49.300 --> 2:03:51.940\n in Brooklyn and he's still saying everything's fine.\n\n2:03:51.940 --> 2:03:57.100\n You know, so it's like it's dry, it's witty, but it's also about the surveillance state.\n\n2:03:57.100 --> 2:03:59.460\n It's about centralization of power.\n\n2:03:59.460 --> 2:04:00.460\n It's really good.\n\n2:04:00.460 --> 2:04:03.820\n So The Mandibles, I would highly recommend.\n\n2:04:03.820 --> 2:04:04.820\n So those three books.\n\n2:04:04.820 --> 2:04:08.340\n And then on the topic of Bitcoin, because we talked about it a lot, I would just say\n\n2:04:08.340 --> 2:04:14.820\n that my portal into Bitcoin was The Internet of Money by Andreas Antonopoulos and I did\n\n2:04:14.820 --> 2:04:16.980\n it by audio book.\n\n2:04:16.980 --> 2:04:21.260\n And I just think this is an important one for people to start with because he goes through\n\n2:04:21.260 --> 2:04:27.260\n all the main concepts, whether it be proof of work or how the network functions.\n\n2:04:27.260 --> 2:04:31.580\n But he does it in a way that's extremely engaging and really fascinating.\n\n2:04:31.580 --> 2:04:34.820\n And it really just kind of like sparked my curiosity.\n\n2:04:34.820 --> 2:04:38.300\n Is it discussing the technical sides or also the philosophical?\n\n2:04:38.300 --> 2:04:41.340\n Because a lot of people mentioned sort of the Bitcoin standard is the philosophical\n\n2:04:41.340 --> 2:04:43.700\n entry into the whole Bitcoin world.\n\n2:04:43.700 --> 2:04:45.300\n Very different from the Bitcoin standard.\n\n2:04:45.300 --> 2:04:47.720\n It's more for like the average person.\n\n2:04:47.720 --> 2:04:49.260\n It's not a history book.\n\n2:04:49.260 --> 2:04:52.620\n It's a collection of his talks that he gave over like two or three years.\n\n2:04:52.620 --> 2:04:54.160\n It's not very technical.\n\n2:04:54.160 --> 2:04:55.160\n It's very approachable.\n\n2:04:55.160 --> 2:05:00.480\n And some of it might be dated now because it's like 2015, 2016.\n\n2:05:00.480 --> 2:05:05.500\n But I mean, it's great to hear a shout out for Andreas because he seems to be one of\n\n2:05:05.500 --> 2:05:09.580\n the seminal figures to sort of make Bitcoin ideas accessible.\n\n2:05:09.580 --> 2:05:10.580\n Andreas is the goat.\n\n2:05:10.580 --> 2:05:11.580\n Andreas is the goat.\n\n2:05:11.580 --> 2:05:17.700\n I know a lot of people will have issues with some of his like more recent work, but Andreas\n\n2:05:17.700 --> 2:05:18.700\n is the goat.\n\n2:05:18.700 --> 2:05:19.700\n Yeah.\n\n2:05:19.700 --> 2:05:20.700\n He's the reason I'm in Bitcoin.\n\n2:05:20.700 --> 2:05:21.700\n I mean, he's the reason I'm in Bitcoin.\n\n2:05:21.700 --> 2:05:22.700\n Yeah.\n\n2:05:22.700 --> 2:05:23.700\n That's fascinating.\n\n2:05:23.700 --> 2:05:30.780\n And it's funny to watch the Bitcoin maximalist immune system also attacking him.\n\n2:05:30.780 --> 2:05:33.700\n And this whole feedback mechanism is working together.\n\n2:05:33.700 --> 2:05:34.700\n It's fascinating.\n\n2:05:34.700 --> 2:05:37.940\n Well, I probably consider myself a maximalist, but I really like Andreas.\n\n2:05:37.940 --> 2:05:40.420\n So I think there's room for nuance.\n\n2:05:40.420 --> 2:05:42.100\n There's room for nuance in this world.\n\n2:05:42.100 --> 2:05:43.940\n I'm glad to hear that.\n\n2:05:43.940 --> 2:05:51.180\n If people are fascinated by your work, what is the way to get more of Alex?\n\n2:05:51.180 --> 2:05:55.740\n So two years ago, I came together with seven other people from around the world and we\n\n2:05:55.740 --> 2:05:57.540\n wrote a book in a book sprint.\n\n2:05:57.540 --> 2:05:58.540\n We lived in a house for four days.\n\n2:05:58.540 --> 2:05:59.540\n We wrote a book together.\n\n2:05:59.540 --> 2:06:00.540\n It was really cool.\n\n2:06:00.540 --> 2:06:03.180\n It was like a design sprint, but we did it in book format.\n\n2:06:03.180 --> 2:06:09.940\n And my coauthors are from Nigeria, Venezuela, the Philippines, from former Soviet Union,\n\n2:06:09.940 --> 2:06:10.980\n from all over.\n\n2:06:10.980 --> 2:06:14.660\n And it's called The Little Bitcoin Book, and I'm still proud of it.\n\n2:06:14.660 --> 2:06:15.660\n It's a hundred pages.\n\n2:06:15.660 --> 2:06:18.700\n It's something you give to somebody who knows nothing about the topic.\n\n2:06:18.700 --> 2:06:20.180\n And it's not a technical book.\n\n2:06:20.180 --> 2:06:24.060\n It's about the sort of social political aspect of it.\n\n2:06:24.060 --> 2:06:29.260\n Like why is it important for you, for your finances, for your freedom, for your future?\n\n2:06:29.260 --> 2:06:32.460\n And we've translated it into like a lot of languages by now.\n\n2:06:32.460 --> 2:06:37.900\n I think English, Spanish and Portuguese are for sale and littlebitcoinbook.com, you know,\n\n2:06:37.900 --> 2:06:38.900\n you go buy it.\n\n2:06:38.900 --> 2:06:46.660\n We've made it as a free PDF in Mandarin, Hindi, Punjab, Korean, Uyghur, which I was really\n\n2:06:46.660 --> 2:06:49.540\n excited about, Arabic, Farsi.\n\n2:06:49.540 --> 2:06:50.980\n And I mean, it spreads, man.\n\n2:06:50.980 --> 2:06:51.980\n It's been really, really cool.\n\n2:06:51.980 --> 2:06:54.500\n So I'm proud of that.\n\n2:06:54.500 --> 2:07:00.040\n I also made a video that did very well for Reason magazine called Why is Bitcoin Protecting\n\n2:07:00.040 --> 2:07:01.740\n Human Rights Around the World?\n\n2:07:01.740 --> 2:07:02.740\n It's five minutes.\n\n2:07:02.740 --> 2:07:08.140\n And it just, I feel like I tried to boil everything that I want to tell you into this five minute\n\n2:07:08.140 --> 2:07:09.140\n video.\n\n2:07:09.140 --> 2:07:10.140\n So there's that.\n\n2:07:10.140 --> 2:07:11.540\n I would recommend that.\n\n2:07:11.540 --> 2:07:17.820\n And then if you're interested in the why have governments not stopped it, which I think\n\n2:07:17.820 --> 2:07:24.020\n is really intriguing, I wrote this long essay in Quillette in February called, you know,\n\n2:07:24.020 --> 2:07:26.300\n why haven't governments banned Bitcoin?\n\n2:07:26.300 --> 2:07:28.540\n And maybe that'll be a helpful guide to some folks.\n\n2:07:28.540 --> 2:07:32.940\n Is this speaking to the Trojan horse idea that there's something enticing about it?\n\n2:07:32.940 --> 2:07:34.800\n Yeah, at the end, it does get into that.\n\n2:07:34.800 --> 2:07:39.100\n But it really also just kind of goes through technically, why is it hard to do a 51% attack?\n\n2:07:39.100 --> 2:07:43.100\n Like if a government wanted to, could it really get all that equipment?\n\n2:07:43.100 --> 2:07:45.940\n There's a semiconductor shortage, like it can't.\n\n2:07:45.940 --> 2:07:49.380\n There's like certain things that stop governments from doing it.\n\n2:07:49.380 --> 2:07:55.720\n And same thing with like this idea of a 6102, which would be based on the idea of the executive\n\n2:07:55.720 --> 2:08:01.140\n order 6102, which is from 1933 when FDR made holding gold illegal in the United States.\n\n2:08:01.140 --> 2:08:04.460\n The idea is that like banks would go around now with governments and try to like steal\n\n2:08:04.460 --> 2:08:05.460\n everybody's Bitcoin.\n\n2:08:05.460 --> 2:08:11.540\n Well, in Bitcoin we have like a practice called proof of keys day every January 3rd, you know,\n\n2:08:11.540 --> 2:08:15.140\n which is coinciding with the launch of the Bitcoin blockchain, where we all like withdraw\n\n2:08:15.140 --> 2:08:17.820\n our keys from exchanges and we'd be sovereign users.\n\n2:08:17.820 --> 2:08:21.380\n What we are doing is we are preparing for a 6102 attack, which will one day probably\n\n2:08:21.380 --> 2:08:22.380\n come, right?\n\n2:08:22.380 --> 2:08:27.180\n So the essay just goes through all of the like possible attacks and it runs through\n\n2:08:27.180 --> 2:08:30.540\n like the ones that happened, like the Chinese and Indian governments, the two largest governments\n\n2:08:30.540 --> 2:08:35.060\n in the world, both tried to attack Bitcoin by banning their citizens from exchanging\n\n2:08:35.060 --> 2:08:36.460\n fiat for Bitcoin.\n\n2:08:36.460 --> 2:08:37.460\n It didn't work.\n\n2:08:37.460 --> 2:08:38.560\n Interest instead exploded.\n\n2:08:38.560 --> 2:08:45.140\n It's like the Barbra Streisand effect where, you know, by making something public and saying\n\n2:08:45.140 --> 2:08:51.080\n you shouldn't do X, it actually increases attention about X a lot more, right?\n\n2:08:51.080 --> 2:08:54.720\n So I think there's a lot of interesting game theory there that people would enjoy.\n\n2:08:54.720 --> 2:09:00.780\n Do you think, are you seriously concerned about this kind of thing where the idea is\n\n2:09:00.780 --> 2:09:06.140\n a sovereignty and that Bitcoin espouses would actually one day be tested?\n\n2:09:06.140 --> 2:09:12.460\n Do you have like a legitimate concern because you said like one day very well might.\n\n2:09:12.460 --> 2:09:15.340\n Do you think it might go down?\n\n2:09:15.340 --> 2:09:21.260\n First of all, Bitcoin has been attacked again, many times and we talk about the, you spoke\n\n2:09:21.260 --> 2:09:26.740\n about this with Nick Carter on your show, the sort of protocol wars or conflict or whatever,\n\n2:09:26.740 --> 2:09:27.740\n right?\n\n2:09:27.740 --> 2:09:30.780\n And Bitcoin almost died a whole bunch of times during that and ended up surviving.\n\n2:09:30.780 --> 2:09:31.780\n Oh wow.\n\n2:09:31.780 --> 2:09:32.940\n I didn't, I didn't know how bad the blocks at that point was.\n\n2:09:32.940 --> 2:09:34.660\n Oh it got really bad.\n\n2:09:34.660 --> 2:09:40.380\n It was, it was a sort of a very existential threat and Bitcoin survived and that's why\n\n2:09:40.380 --> 2:09:47.540\n I'm so intrigued by it is that it basically survived an attack in an environment several\n\n2:09:47.540 --> 2:09:51.240\n years ago when Bitcoin was much more vulnerable than it is today.\n\n2:09:51.240 --> 2:09:55.860\n It survived an attack by a conglomeration of Chinese billionaires, Silicon Valley corporations\n\n2:09:55.860 --> 2:10:00.540\n and a ton of people who owned the majority of the hash rate and all this infrastructure.\n\n2:10:00.540 --> 2:10:05.220\n They had 83% of all the hash rate and they couldn't get what they wanted and that was\n\n2:10:05.220 --> 2:10:06.220\n so intriguing to me.\n\n2:10:06.220 --> 2:10:08.500\n Like why didn't it, why didn't it get killed?\n\n2:10:08.500 --> 2:10:13.140\n So as Nick said, I think you should read The Block Size War, which is a book on that you\n\n2:10:13.140 --> 2:10:15.380\n can get on Amazon by Jonathan Beer.\n\n2:10:15.380 --> 2:10:21.620\n Really good, kind of like really important to understand the, the, the, the scaling conflict\n\n2:10:21.620 --> 2:10:24.620\n and the visions over the different visions of what Bitcoin should be.\n\n2:10:24.620 --> 2:10:27.940\n And you know, again, people like me believe it should be a freedom tool, not like a payments\n\n2:10:27.940 --> 2:10:30.060\n technology for retail.\n\n2:10:30.060 --> 2:10:33.580\n And I'm just, I'm glad it worked out the way it did because it almost didn't.\n\n2:10:33.580 --> 2:10:38.440\n Do you think a human's civilization will destroy itself?\n\n2:10:38.440 --> 2:10:46.660\n So if we think about all the threats facing human civilization, nuclear war, natural or\n\n2:10:46.660 --> 2:10:52.000\n engineer pandemics, you know, we talk about human rights violations.\n\n2:10:52.000 --> 2:11:00.220\n We talk about authoritarian governments taking control of the money supply, but do you have\n\n2:11:00.220 --> 2:11:04.180\n grander concerns for the future of human civilization?\n\n2:11:04.180 --> 2:11:07.100\n Do you have hope for us becoming a multi planetary species?\n\n2:11:07.100 --> 2:11:11.640\n Yeah, I mean, I, I guess longterm we'd want to decentralize, right?\n\n2:11:11.640 --> 2:11:16.620\n We don't want a single point of failure in the earth is a single point of failure.\n\n2:11:16.620 --> 2:11:21.200\n But no, I mean, you look at all this kind of like space fiction and I mean, who would\n\n2:11:21.200 --> 2:11:22.500\n want to live on Mars, man?\n\n2:11:22.500 --> 2:11:23.500\n It's like a fricking desert.\n\n2:11:23.500 --> 2:11:24.860\n I mean, the earth is so beautiful.\n\n2:11:24.860 --> 2:11:26.580\n I hope we can save it.\n\n2:11:26.580 --> 2:11:31.020\n You know, it's just so gorgeous when you look at the earth compared to any other like exoplanet\n\n2:11:31.020 --> 2:11:36.140\n or whatever you look at it, I mean, the earth is so spectacular and wondrous and singular.\n\n2:11:36.140 --> 2:11:39.740\n I think we got to do everything we can to save it here.\n\n2:11:39.740 --> 2:11:40.740\n That's funny.\n\n2:11:40.740 --> 2:11:46.600\n I mean, I'm sure a lot of people would have said that about Europe before the explorers\n\n2:11:46.600 --> 2:11:52.020\n ventured out Columbus and the rest out into the unknown.\n\n2:11:52.020 --> 2:11:54.620\n The thing about human nature is that we are explorers too.\n\n2:11:54.620 --> 2:11:55.620\n We are.\n\n2:11:55.620 --> 2:12:02.020\n Some small fraction of us are insane enough to explore in the most dangerous grounds and\n\n2:12:02.020 --> 2:12:06.280\n I'm pretty sure there's quite a few people that would love to take the first step on\n\n2:12:06.280 --> 2:12:11.980\n Mars, the first few steps on Mars in the harshest of environments, even when the odds of survival\n\n2:12:11.980 --> 2:12:14.180\n extremely low.\n\n2:12:14.180 --> 2:12:19.420\n And I'm thankful for those people because I sit back and drink my vodka back here on\n\n2:12:19.420 --> 2:12:26.020\n earth and enjoy good friendships because I think ultimately that step to Mars is going\n\n2:12:26.020 --> 2:12:34.220\n to be a first step into exploring and colonizing the rest of the galaxy.\n\n2:12:34.220 --> 2:12:42.740\n Mars might be a harsh environment, but maybe space is not like other planets, other exoplanets,\n\n2:12:42.740 --> 2:12:48.380\n but also forget planets, just creating colonies that flow about in space.\n\n2:12:48.380 --> 2:12:51.780\n There's exciting technologies that are yet to be discovered, yet to be engineered and\n\n2:12:51.780 --> 2:12:56.820\n built that I think require that first painful step.\n\n2:12:56.820 --> 2:13:00.620\n The journey of a thousand miles starts with one step and I think Mars is that first step.\n\n2:13:00.620 --> 2:13:06.780\n Yeah, no, I was born the day before the Challenger blew up and it was always so tragic for me\n\n2:13:06.780 --> 2:13:11.700\n to look back on that because that really altered our arc in terms of space exploration.\n\n2:13:11.700 --> 2:13:12.700\n That had not happened.\n\n2:13:12.700 --> 2:13:17.580\n We'd be on a very different arc and I do respect and admire people pushing for exploration,\n\n2:13:17.580 --> 2:13:24.540\n but at the same time, I just want to recognize that we know how unique Earth is and I do\n\n2:13:24.540 --> 2:13:30.060\n think we got to do everything we can to protect it.\n\n2:13:30.060 --> 2:13:33.140\n But I think you've already answered the question if we're going to destroy ourselves.\n\n2:13:33.140 --> 2:13:35.860\n Oh, yeah, I guess.\n\n2:13:35.860 --> 2:13:36.860\n Are you hopeful?\n\n2:13:36.860 --> 2:13:38.140\n Okay, fine.\n\n2:13:38.140 --> 2:13:45.340\n If we do not decentralize properly out into different physical spaces, probably, I guess,\n\n2:13:45.340 --> 2:13:46.340\n yeah.\n\n2:13:46.340 --> 2:13:53.220\n I mean, do you have concerns that are immediately facing you, so not in terms of the injustices\n\n2:13:53.220 --> 2:13:55.020\n on the world, but nuclear war?\n\n2:13:55.020 --> 2:13:58.980\n Yeah, look, I'm a lot more concerned about what's happening right now.\n\n2:13:58.980 --> 2:14:01.860\n Like, what is destroying ourselves?\n\n2:14:01.860 --> 2:14:07.700\n If you were to go and see what's happening in Xinjiang or North Korea right now or Eritrea,\n\n2:14:07.700 --> 2:14:10.420\n that is destroying ourselves and it's already happened.\n\n2:14:10.420 --> 2:14:15.220\n So I guess the end, that's why I said, yes, I mean, if you don't decentralize and power\n\n2:14:15.220 --> 2:14:20.900\n is completely under one person, life is destroyed as we know it.\n\n2:14:20.900 --> 2:14:27.460\n And you don't have to go into science fiction to know what a totalitarian hellscape dystopia\n\n2:14:27.460 --> 2:14:28.460\n is.\n\n2:14:28.460 --> 2:14:33.660\n There's several that exist already and let's try to help those people at the same time\n\n2:14:33.660 --> 2:14:37.900\n as we're trying to push out into space would be my counter, I guess.\n\n2:14:37.900 --> 2:14:39.520\n Yeah, I agree with you.\n\n2:14:39.520 --> 2:14:43.220\n In my mind, destruction and suffering are next door neighbors.\n\n2:14:43.220 --> 2:14:46.300\n So we don't need to destroy all of human civilization.\n\n2:14:46.300 --> 2:14:53.060\n If much, a large fraction of it lives in conditions that we would equate to suffering, that's\n\n2:14:53.060 --> 2:14:55.980\n not a good world.\n\n2:14:55.980 --> 2:15:01.460\n Is there advice that you would give to young people today about life, about career, about\n\n2:15:01.460 --> 2:15:10.100\n how they can help a world where 53% are living under authoritarian governments, but in general,\n\n2:15:10.100 --> 2:15:15.020\n a world that's full of injustice, but also full of opportunity?\n\n2:15:15.020 --> 2:15:19.980\n Just thinking about my own upbringing, I went to a public school here and we never learned\n\n2:15:19.980 --> 2:15:21.540\n about money.\n\n2:15:21.540 --> 2:15:24.940\n It was never part of our curriculum.\n\n2:15:24.940 --> 2:15:27.780\n Even personal finances was not part of our curriculum.\n\n2:15:27.780 --> 2:15:31.940\n You could take like an optional course to learn about like business or something.\n\n2:15:31.940 --> 2:15:38.020\n And I think that that would be really valuable as a young person or as a teenager to start\n\n2:15:38.020 --> 2:15:43.300\n incorporating into your children's lives is like a curiosity about what is money, I think\n\n2:15:43.300 --> 2:15:47.500\n would be very healthy, regardless of what path that takes them down.\n\n2:15:47.500 --> 2:15:51.000\n Because we don't think about it enough, either from an administrative sort of personal finance\n\n2:15:51.000 --> 2:15:57.500\n thing about like responsibility, or more fundamentally, like, what is it and who creates it?\n\n2:15:57.500 --> 2:15:58.960\n Where did it come from?\n\n2:15:58.960 --> 2:16:00.260\n Both of those things are very important.\n\n2:16:00.260 --> 2:16:04.540\n So my advice to a young person would be to get to the point where you feel like you can\n\n2:16:04.540 --> 2:16:07.620\n answer the question, what is money?\n\n2:16:07.620 --> 2:16:13.140\n So you ultimately see money as a kind of power and freedom and a mechanism of suffering.\n\n2:16:13.140 --> 2:16:15.420\n It is so core to everything.\n\n2:16:15.420 --> 2:16:20.940\n The United States, whether you want to call it the Pax Americana, the Empire, the hyperpower,\n\n2:16:20.940 --> 2:16:24.340\n whatever you want to call this moment in time where the US is dominant around the world,\n\n2:16:24.340 --> 2:16:30.580\n it is because of the fact that we have this petrodollar system, where we are able to force\n\n2:16:30.580 --> 2:16:36.240\n the Saudis and other oil producing nations to sell their oil in dollars.\n\n2:16:36.240 --> 2:16:40.440\n That is really inescapable, inseparable from our power.\n\n2:16:40.440 --> 2:16:42.340\n And that's very rarely talked about.\n\n2:16:42.340 --> 2:16:44.160\n And it's very important to understand.\n\n2:16:44.160 --> 2:16:47.980\n So yeah, if young people could start thinking about that stuff, it'd be good.\n\n2:16:47.980 --> 2:16:52.660\n I remember being, it sounds silly to say, but I remember being really uncomfortable\n\n2:16:52.660 --> 2:16:58.380\n that I was dependent on my parents at a young age for like financial.\n\n2:16:58.380 --> 2:17:01.580\n You need to be 18 to have a bank account or whatever.\n\n2:17:01.580 --> 2:17:05.520\n One of the people that we supported at Ahrefs through our, we do software development funding\n\n2:17:05.520 --> 2:17:08.060\n for people in Bitcoin, open source projects.\n\n2:17:08.060 --> 2:17:11.940\n And one of the guys we funded is this very young, smart sort of prodigy.\n\n2:17:11.940 --> 2:17:12.940\n He's like 17.\n\n2:17:12.940 --> 2:17:16.300\n But one of the reasons he got into Bitcoin was because he wanted to have control of his\n\n2:17:16.300 --> 2:17:17.300\n money when he was like 14.\n\n2:17:17.300 --> 2:17:22.960\n I mean, if you think in history, people who invented all kinds of incredible contributions\n\n2:17:22.960 --> 2:17:27.540\n to science or math, I mean, a lot of them did it before they were 15.\n\n2:17:27.540 --> 2:17:31.680\n So think about that maturity that is capable and possible in many people.\n\n2:17:31.680 --> 2:17:36.940\n Like I've participated in some of the years ago, some of the sort of selection processes\n\n2:17:36.940 --> 2:17:39.060\n for like the Teal fellowship, which is like really amazing.\n\n2:17:39.060 --> 2:17:42.700\n Like these people who are 14, 15, 16, who don't need to go to college, they're already\n\n2:17:42.700 --> 2:17:46.460\n like so smart, they can figure it out, but they wouldn't be allowed to have a bank account.\n\n2:17:46.460 --> 2:17:48.580\n So hey, that's kind of cool.\n\n2:17:48.580 --> 2:17:52.460\n Like now you have a permissionless money, you can open up yourself without permission\n\n2:17:52.460 --> 2:17:53.460\n from your parents.\n\n2:17:53.460 --> 2:17:54.460\n That's kind of cool.\n\n2:17:54.460 --> 2:17:55.460\n Yeah.\n\n2:17:55.460 --> 2:17:56.460\n That's fascinating to me.\n\n2:17:56.460 --> 2:18:06.340\n I feel like I would have loved my parents more if I had freedom to fully realize myself,\n\n2:18:06.340 --> 2:18:11.660\n because I felt like I was a little bit trapped by, I don't know, it's not explicit, right?\n\n2:18:11.660 --> 2:18:17.420\n It's a little bit, it's like a subtle push that you're somehow dependent on them.\n\n2:18:17.420 --> 2:18:23.260\n I mean, part of that is like, I think it actually very much has to do not talking about money.\n\n2:18:23.260 --> 2:18:26.660\n Like what does it take to operate as an individual entity in this world?\n\n2:18:26.660 --> 2:18:31.580\n Like knowing that when you're 10 years old, knowing that when you're very young, so that\n\n2:18:31.580 --> 2:18:39.100\n you've, then you see the, how amazing it is to have the support of your parents until\n\n2:18:39.100 --> 2:18:40.100\n you're 18.\n\n2:18:40.100 --> 2:18:47.700\n Like have that freedom, have the freedom to appreciate the value your parents bring.\n\n2:18:47.700 --> 2:18:55.780\n And at the same time, the freedom to leave in some capacity to carve your own path.\n\n2:18:55.780 --> 2:19:00.940\n I mean, like just all of that, I think for weirdos like me, especially because I was\n\n2:19:00.940 --> 2:19:06.620\n a very nontraditional path that I think it would be very empowering and certainly would\n\n2:19:06.620 --> 2:19:08.060\n be empowering in the third world.\n\n2:19:08.060 --> 2:19:09.060\n Not just weirdos like you.\n\n2:19:09.060 --> 2:19:10.060\n Yeah.\n\n2:19:10.060 --> 2:19:13.700\n I was going to mention one of the people I got who taught me about Bitcoin, her name\n\n2:19:13.700 --> 2:19:14.700\n is Roya Mapoob.\n\n2:19:14.700 --> 2:19:20.700\n She's an Afghan technology CEO, and in 2013 she started paying her employees in Bitcoin\n\n2:19:20.700 --> 2:19:24.840\n because they were not allowed to open bank accounts, the women that worked for her.\n\n2:19:24.840 --> 2:19:29.900\n She started the country's first female, like all female software company.\n\n2:19:29.900 --> 2:19:33.260\n And if they brought cash home, their like husbands or uncles or brothers would steal\n\n2:19:33.260 --> 2:19:34.260\n it from them.\n\n2:19:34.260 --> 2:19:37.000\n There's like a power patriarchal dominance thing going on.\n\n2:19:37.000 --> 2:19:41.680\n But they had phones and she was able to pay them in Bitcoin and no one knew, and it gave\n\n2:19:41.680 --> 2:19:42.820\n them that power.\n\n2:19:42.820 --> 2:19:47.340\n And that's always stuck in my mind as a very interesting effect of this kind of thing of\n\n2:19:47.340 --> 2:19:50.420\n permissionless money, like that it can be an empowerment tool.\n\n2:19:50.420 --> 2:19:51.420\n So absolutely.\n\n2:19:51.420 --> 2:20:00.600\n So in your own personal life, where did the deep concern for the suffering in the world\n\n2:20:00.600 --> 2:20:02.500\n come from?\n\n2:20:02.500 --> 2:20:04.740\n Where was that born?\n\n2:20:04.740 --> 2:20:09.940\n I was going to be an engineer actually, and then in 2003 we invaded Iraq and I got very\n\n2:20:09.940 --> 2:20:16.320\n interested in why we did that as a nation and I switched my focus of study to like international\n\n2:20:16.320 --> 2:20:21.700\n relations and that's how I kind of went down the kind of political science democracy rabbit\n\n2:20:21.700 --> 2:20:24.900\n hole and ended up getting a job at the human rights foundation.\n\n2:20:24.900 --> 2:20:28.620\n So that I'm a very much a child of like 9 11 and the Iraq war.\n\n2:20:28.620 --> 2:20:32.540\n Those are the two really formative events for me personally.\n\n2:20:32.540 --> 2:20:33.780\n Can you break that apart a little bit?\n\n2:20:33.780 --> 2:20:44.100\n Like what illusion about this world was broken apart by the invasion of Iraq?\n\n2:20:44.100 --> 2:20:48.860\n Well I think first of all, 9 11 just shifted the world dynamics completely from a focus\n\n2:20:48.860 --> 2:20:56.620\n on big power politics between the US, Russia and China to this new threat of Islamic terror.\n\n2:20:56.620 --> 2:21:01.000\n And a lot of it we learned later, a lot of the things we did, we were manufactured, choreographed,\n\n2:21:01.000 --> 2:21:03.380\n like there were no WMDs in Iraq.\n\n2:21:03.380 --> 2:21:08.400\n Like the reason our rulers said we needed to invade and destroy this country was a lie.\n\n2:21:08.400 --> 2:21:10.860\n And that I think has really been forgotten.\n\n2:21:10.860 --> 2:21:15.100\n Like I think a lot of like the Zoomers like today don't really know a lot about that time\n\n2:21:15.100 --> 2:21:16.100\n period.\n\n2:21:16.100 --> 2:21:17.100\n I mean it's pretty crazy.\n\n2:21:17.100 --> 2:21:23.220\n Unanimously, I mean Democrat, Republican, like Joe Biden, Hillary Clinton, like and\n\n2:21:23.220 --> 2:21:30.100\n the Republicans, everybody wanted to invade this country and it's a confusing time.\n\n2:21:30.100 --> 2:21:34.020\n There's a really good book by Ian McEwen called Saturday, a fiction book that takes place\n\n2:21:34.020 --> 2:21:39.200\n during I think 2003 and it's one day in the life of the doctor in London.\n\n2:21:39.200 --> 2:21:44.260\n It's really good though to revisit this time because he has two characters, he has characters\n\n2:21:44.260 --> 2:21:47.900\n in the book, one of whom is very pro war and one of them is very against war.\n\n2:21:47.900 --> 2:21:51.300\n Basically he, the father himself is pro war and his son is against it and they have all\n\n2:21:51.300 --> 2:21:52.300\n these debates.\n\n2:21:52.300 --> 2:21:56.860\n And it's nice to go back to revisit but that time was, it's really crazy and it really\n\n2:21:56.860 --> 2:22:02.060\n showed you that like the media could be captured into like helping promote this idea of like\n\n2:22:02.060 --> 2:22:03.840\n invading another country.\n\n2:22:03.840 --> 2:22:08.100\n So I was very curious about why we did it and like who was pulling the strings and what\n\n2:22:08.100 --> 2:22:10.060\n are the reasons that we went.\n\n2:22:10.060 --> 2:22:13.660\n And what's really interesting is that like I took all these courses on and interviewed\n\n2:22:13.660 --> 2:22:18.420\n all these decision makers, whether they were like neocons or whatever, different people\n\n2:22:18.420 --> 2:22:19.420\n who were involved.\n\n2:22:19.420 --> 2:22:24.300\n And the whole like dollar reserve currency thing like really never came up until like\n\n2:22:24.300 --> 2:22:27.320\n I learned about it more recently because of Bitcoin.\n\n2:22:27.320 --> 2:22:30.940\n And today when I look back, it seems kind of obvious that the reason we invaded Iraq\n\n2:22:30.940 --> 2:22:35.060\n was because Saddam Hussein wanted to sell oil in euros.\n\n2:22:35.060 --> 2:22:39.300\n It seems really obvious when you go back and look at the chronology of it and we were like,\n\n2:22:39.300 --> 2:22:43.520\n no, we actually don't want you to sell dollars in euros because that would threaten the dollar.\n\n2:22:43.520 --> 2:22:45.820\n So we're going to invade you and then you're not going to do it and then no one else is\n\n2:22:45.820 --> 2:22:50.060\n going to like sell dollars in euros, just oil in euros, right?\n\n2:22:50.060 --> 2:22:55.060\n I guess you could say the same thing about Qaddafi, but we as a nation have very much\n\n2:22:55.060 --> 2:22:57.660\n protected our reserve currency, let's put it that way.\n\n2:22:57.660 --> 2:23:01.700\n Yeah, actually one of the things that Bitcoin community has motivated me to do is to look\n\n2:23:01.700 --> 2:23:07.460\n back to the histories that I have studied myself from just even the two world wars,\n\n2:23:07.460 --> 2:23:13.220\n the history of the 20th century from a perspective of the monetary system of money.\n\n2:23:13.220 --> 2:23:14.660\n And it's interesting.\n\n2:23:14.660 --> 2:23:17.580\n It's interesting to look at human history in the context of money.\n\n2:23:17.580 --> 2:23:21.940\n Can't we be patriotic and be pro America, but like not want the petrodollar?\n\n2:23:21.940 --> 2:23:24.100\n Like I should be proud of my country.\n\n2:23:24.100 --> 2:23:26.180\n Why do we need to be propping up the Saudis?\n\n2:23:26.180 --> 2:23:30.020\n Why do we need to be, you know, threatening to invade other countries if they sell their\n\n2:23:30.020 --> 2:23:31.620\n oil for a different currency?\n\n2:23:31.620 --> 2:23:36.100\n I think we can be just as powerful as we are today, if not more powerful in a Bitcoin world.\n\n2:23:36.100 --> 2:23:39.340\n If you think about the infrastructure Americans are building, all the innovations we're building,\n\n2:23:39.340 --> 2:23:43.140\n all the wealth we have, I think we'll be fine, better than fine.\n\n2:23:43.140 --> 2:23:46.100\n And we won't have these horrible negative externalities.\n\n2:23:46.100 --> 2:23:49.740\n It's really an optimistic vision for the future.\n\n2:23:49.740 --> 2:23:56.580\n I thought we learned the lesson of 9 11 and the invasion of Iraq and Afghanistan.\n\n2:23:56.580 --> 2:24:01.020\n But we're leaving and you know, Biden announced we're leaving Afghanistan this year, 20 years\n\n2:24:01.020 --> 2:24:02.020\n for what?\n\n2:24:02.020 --> 2:24:03.500\n The Taliban are going to take over.\n\n2:24:03.500 --> 2:24:08.380\n Well, I mean, that's at least a good, the longest war, right?\n\n2:24:08.380 --> 2:24:09.640\n The forever wars.\n\n2:24:09.640 --> 2:24:17.300\n I feel like the past 20 years or whatever it is, 18 years, 19 years, we've been very\n\n2:24:17.300 --> 2:24:24.900\n skeptical about invading other countries, about, we've been skeptical about military\n\n2:24:24.900 --> 2:24:27.460\n intervention in other nations.\n\n2:24:27.460 --> 2:24:33.420\n Well, our leaders certainly haven't, we have like seven active wars right now, and neither\n\n2:24:33.420 --> 2:24:37.900\n the Russians and the Chinese, everybody's starting to invade everybody else.\n\n2:24:37.900 --> 2:24:42.940\n I mean, so yes, but I meant to a degree that I was worried about like conflicts with, hot\n\n2:24:42.940 --> 2:24:47.900\n conflicts with Iran, with North Korea, those kinds of things.\n\n2:24:47.900 --> 2:24:54.660\n That there was not as much war mongering as I was afraid about.\n\n2:24:54.660 --> 2:24:56.020\n But yes, you're absolutely right.\n\n2:24:56.020 --> 2:25:01.200\n We're still, there's a big presence by the United States and other nations and across\n\n2:25:01.200 --> 2:25:03.140\n the world that's military.\n\n2:25:03.140 --> 2:25:11.660\n The military industrial complex is a thing that has huge detrimental ripple effects throughout\n\n2:25:11.660 --> 2:25:13.220\n the entirety of our governments.\n\n2:25:13.220 --> 2:25:14.220\n Yeah.\n\n2:25:14.220 --> 2:25:20.800\n So the big question is how do we prevent the rise of this like authoritarian surveillance\n\n2:25:20.800 --> 2:25:26.060\n state in China while at the same time kind of diffusing the military industrial complex\n\n2:25:26.060 --> 2:25:27.340\n on our side?\n\n2:25:27.340 --> 2:25:29.820\n That to me is like the biggest challenge of our time.\n\n2:25:29.820 --> 2:25:32.140\n I don't have the answer, but we should keep digging.\n\n2:25:32.140 --> 2:25:33.140\n Yeah.\n\n2:25:33.140 --> 2:25:36.900\n I believe there's technological innovations.\n\n2:25:36.900 --> 2:25:40.740\n You're suggesting that perhaps one of the technological innovations like is Bitcoin.\n\n2:25:40.740 --> 2:25:42.020\n It's a big part of it.\n\n2:25:42.020 --> 2:25:43.020\n Yeah.\n\n2:25:43.020 --> 2:25:47.300\n On the money side, I think the information side, there's innovations that are open, that's\n\n2:25:47.300 --> 2:25:48.460\n possible.\n\n2:25:48.460 --> 2:25:50.900\n And the political side, I'm the most skeptical about.\n\n2:25:50.900 --> 2:25:58.020\n I just feel like there's, without hot wars that we don't seem to make any kind of progress.\n\n2:25:58.020 --> 2:26:04.980\n Cities just grow, corruption and greed grow and human nature does not do well in the political\n\n2:26:04.980 --> 2:26:05.980\n arena.\n\n2:26:05.980 --> 2:26:11.420\n So I hope technology can outpace the darker sides of human nature.\n\n2:26:11.420 --> 2:26:17.620\n So you're busy fighting the demons, the darkness that's out there, but looking in the mirror,\n\n2:26:17.620 --> 2:26:19.100\n you're a finite being.\n\n2:26:19.100 --> 2:26:24.380\n Unfortunately this ride ends for you pretty soon.\n\n2:26:24.380 --> 2:26:32.340\n Do you ever ask yourself about the meaning at all of why the hell us descendants of apes\n\n2:26:32.340 --> 2:26:39.140\n are even on this thing, striving so hard to make a better world for ourselves?\n\n2:26:39.140 --> 2:26:41.700\n I don't often zoom out that much.\n\n2:26:41.700 --> 2:26:43.820\n I feel like my day job is pretty interesting.\n\n2:26:43.820 --> 2:26:49.740\n It keeps me very engaged with all the stuff we've been talking about.\n\n2:26:49.740 --> 2:26:58.860\n As far as the meaning of life though, it seems quite clear that we do have the possibility\n\n2:26:58.860 --> 2:27:06.380\n as a species to create these beautiful communities and constructs and to share an exploration\n\n2:27:06.380 --> 2:27:14.260\n of the world together that is often marred by cold realities that we've discussed.\n\n2:27:14.260 --> 2:27:22.740\n But I do feel like in a way that the meaning of life is that pursuit, of course biologically\n\n2:27:22.740 --> 2:27:31.780\n is to spread our species, but also to pursue knowledge and science and innovation and freedom\n\n2:27:31.780 --> 2:27:33.380\n most importantly.\n\n2:27:33.380 --> 2:27:37.820\n I think freedom has to guide us or else we end up with prison camps.\n\n2:27:37.820 --> 2:27:40.900\n If we don't let freedom guide us, we end up with the prison camps.\n\n2:27:40.900 --> 2:27:45.940\n So we need to have scientific innovation and adventurism and colonization of the stars,\n\n2:27:45.940 --> 2:27:48.460\n but without the slavery and without the prison camps.\n\n2:27:48.460 --> 2:27:49.700\n I think that's so key.\n\n2:27:49.700 --> 2:27:55.500\n There's something about the creation of beauty that seems fundamental to human nature and\n\n2:27:55.500 --> 2:28:04.660\n what seems beautiful is these communities that don't have suffering, they don't have\n\n2:28:04.660 --> 2:28:05.660\n injustice.\n\n2:28:05.660 --> 2:28:09.500\n And we have some kind of inner sense of what is injustice.\n\n2:28:09.500 --> 2:28:14.500\n I don't know, like some of the human rights that you've mentioned earlier, they're just\n\n2:28:14.500 --> 2:28:21.500\n philosophical constructs, but they're also seem to be somehow deeply in us too.\n\n2:28:21.500 --> 2:28:24.380\n We have a sense of what is right and what is wrong.\n\n2:28:24.380 --> 2:28:28.140\n It's not just a kind of illusion that we've all agreed on.\n\n2:28:28.140 --> 2:28:31.620\n Yeah, arbitrary power, torture, executions.\n\n2:28:31.620 --> 2:28:32.620\n We know these things are wrong.\n\n2:28:32.620 --> 2:28:34.540\n I mean, we know they're wrong.\n\n2:28:34.540 --> 2:28:38.220\n We don't have to read a book to know that.\n\n2:28:38.220 --> 2:28:40.780\n But you do need to...\n\n2:28:40.780 --> 2:28:41.780\n People can get brainwashed.\n\n2:28:41.780 --> 2:28:46.060\n I mean, you talk to people who've grown up in North Korea, they don't know any better.\n\n2:28:46.060 --> 2:28:48.740\n They don't know what's going on in the outside world.\n\n2:28:48.740 --> 2:28:51.260\n So they've never experienced anything differently.\n\n2:28:51.260 --> 2:28:56.260\n So that's why, look, technology can play a big role here in terms of the meaning of it\n\n2:28:56.260 --> 2:28:57.260\n all.\n\n2:28:57.260 --> 2:29:01.260\n It can really help emancipate, liberate people, at least so that they can make their own choices\n\n2:29:01.260 --> 2:29:04.340\n about what to do, at least so that we're on a level playing field.\n\n2:29:04.340 --> 2:29:10.860\n So technologies like the internet and Bitcoin, they can at least give you the option to do\n\n2:29:10.860 --> 2:29:14.020\n things your own way on your own terms.\n\n2:29:14.020 --> 2:29:17.060\n And then from there, we'll see.\n\n2:29:17.060 --> 2:29:22.940\n I think it's important that we have design choices where we can have a little more say\n\n2:29:22.940 --> 2:29:26.380\n and not everything be preprogrammed for us.\n\n2:29:26.380 --> 2:29:28.500\n That would be very disappointing.\n\n2:29:28.500 --> 2:29:34.400\n So I mean, the open web and encryption in Bitcoin, these are things that help prevent\n\n2:29:34.400 --> 2:29:40.220\n social engineering and that promote more freedom and more possibilities, honestly, and more\n\n2:29:40.220 --> 2:29:43.660\n entrepreneurship and more creativity and more scientific inquiry.\n\n2:29:43.660 --> 2:29:47.820\n I mean, think about the people who tried to shut down scientific inquiry 500, 600 years\n\n2:29:47.820 --> 2:29:54.220\n ago or whatever that were trying to say the earth was the center of everything and they\n\n2:29:54.220 --> 2:29:55.220\n were wrong.\n\n2:29:55.220 --> 2:29:59.580\n And then all these conservative religious types throughout history have always said\n\n2:29:59.580 --> 2:30:05.060\n that there's no value in science and there's no value in technology and they've been wrong\n\n2:30:05.060 --> 2:30:06.060\n the whole time.\n\n2:30:06.060 --> 2:30:07.940\n So let's continue pushing here.\n\n2:30:07.940 --> 2:30:09.900\n Let's continue pushing.\n\n2:30:09.900 --> 2:30:15.300\n It's kind of scary to me sometimes, humbling, beautiful, but also scary to think of.\n\n2:30:15.300 --> 2:30:20.500\n You mentioned North Korea, people are kind of living in ignorance.\n\n2:30:20.500 --> 2:30:24.620\n It's scary to me to think about how much ignorance there is in the world today, like how little\n\n2:30:24.620 --> 2:30:30.260\n I know personally, or us as a human civilization knows there's yet to be discovered to that\n\n2:30:30.260 --> 2:30:31.260\n very...\n\n2:30:31.260 --> 2:30:32.780\n Well, there's a difference between laziness and ignorance, right?\n\n2:30:32.780 --> 2:30:38.140\n So I would be lazy if I didn't take advantage of the internet, right?\n\n2:30:38.140 --> 2:30:40.140\n Someone in North Korea doesn't have the option.\n\n2:30:40.140 --> 2:30:41.140\n They don't have the option.\n\n2:30:41.140 --> 2:30:43.040\n There's literally no way for them to access the internet.\n\n2:30:43.040 --> 2:30:49.220\n So there's kind of like social laziness that philosophers have warned about forever that\n\n2:30:49.220 --> 2:30:55.620\n we basically become sheep, okay, and then there's actual like brainwashing and censorship that's\n\n2:30:55.620 --> 2:31:01.780\n possible like by closing off your population and keeping them off like the internet, right?\n\n2:31:01.780 --> 2:31:03.580\n So I think these are two very different concepts.\n\n2:31:03.580 --> 2:31:04.580\n Absolutely.\n\n2:31:04.580 --> 2:31:10.460\n But I also mean just like not even laziness, but cognitive limitations and just historical\n\n2:31:10.460 --> 2:31:17.820\n scientific limitations like, you know, we're a very young species, like all of the exciting\n\n2:31:17.820 --> 2:31:22.340\n stuff we've been talking about have happened on the scale of decades, maybe centuries.\n\n2:31:22.340 --> 2:31:26.740\n We're very young and all the cool stuff we've come up with and it's just humbling to think\n\n2:31:26.740 --> 2:31:32.060\n about how little we know, but you're right that, you know, ultimately having the freedom\n\n2:31:32.060 --> 2:31:38.200\n to keep exploring, keep venturing out, even if we later discover that a lot of the stuff\n\n2:31:38.200 --> 2:31:44.000\n we've been doing now is ethically horrible.\n\n2:31:44.000 --> 2:31:48.300\n If you think about animals or I think about robots a lot, the kind of things we might\n\n2:31:48.300 --> 2:31:55.920\n be doing to other consciousnesses that are here on earth might be, we might see as atrocities\n\n2:31:55.920 --> 2:32:00.300\n later on, but ultimately you have to have the freedom to explore those kinds of ideas\n\n2:32:00.300 --> 2:32:04.660\n and without that freedom, you don't even get the chance to be lazy.\n\n2:32:04.660 --> 2:32:05.660\n Yeah.\n\n2:32:05.660 --> 2:32:08.760\n I mean, look, don't be a sheep.\n\n2:32:08.760 --> 2:32:09.760\n It's easy to be a sheep.\n\n2:32:09.760 --> 2:32:10.760\n No offense to sheep.\n\n2:32:10.760 --> 2:32:12.060\n And there's some practical things, man.\n\n2:32:12.060 --> 2:32:18.220\n Get on signal, start encrypting your messages, take control over your privacy.\n\n2:32:18.220 --> 2:32:20.740\n The media doesn't want you to, but check out Bitcoin.\n\n2:32:20.740 --> 2:32:22.140\n You can be your own bank.\n\n2:32:22.140 --> 2:32:25.200\n You can transact with people around the world and no one can stop you.\n\n2:32:25.200 --> 2:32:32.180\n This can put a stop to a lot of arbitrary power and a lot of human rights violations.\n\n2:32:32.180 --> 2:32:38.580\n Don't use WeChat, question more, research what's happening in Xinjiang, I mean, learn\n\n2:32:38.580 --> 2:32:43.420\n about what's happening in the genocide in that country and let's think about how we\n\n2:32:43.420 --> 2:32:48.380\n can build our societies so that we never have that kind of power concentration ever again.\n\n2:32:48.380 --> 2:32:49.820\n Each of us can make a difference.\n\n2:32:49.820 --> 2:32:51.900\n Alex, it's a huge honor to talk to you.\n\n2:32:51.900 --> 2:32:53.140\n I've been a fan of your work.\n\n2:32:53.140 --> 2:32:57.940\n A lot of people spoke really highly of you as one of the beacons of hope for our human\n\n2:32:57.940 --> 2:32:58.940\n civilization.\n\n2:32:58.940 --> 2:33:01.500\n So I'm really glad we got a chance to talk.\n\n2:33:01.500 --> 2:33:03.020\n Thank you for wasting all this time with me today.\n\n2:33:03.020 --> 2:33:04.020\n It's been an honor.\n\n2:33:04.020 --> 2:33:05.020\n Thanks man.\n\n2:33:05.020 --> 2:33:06.260\n A lot of fun.\n\n2:33:06.260 --> 2:33:09.260\n Thanks for listening to this conversation with Alex Glastine.\n\n2:33:09.260 --> 2:33:13.300\n To support this podcast, please check out our sponsors in the description.\n\n2:33:13.300 --> 2:33:18.380\n And now, let me leave you with some words from Alice Walker.\n\n2:33:18.380 --> 2:33:24.900\n The most common way people give up their power is by thinking they don't have any.\n\n2:33:24.900 --> 2:33:36.540\n Thank you for listening and hope to see you next time.\n\n"
}