{
  "title": "Michael Saylor: Bitcoin, Inflation, and the Future of Money | Lex Fridman Podcast #276",
  "id": "mC43pZkpTec",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.560\n remember George Washington? You know how he died? Well meaning physicians bled him to death,\n\n00:04.560 --> 00:09.840\n and this was the most important patient in the country, maybe in the history of the country,\n\n00:10.800 --> 00:17.200\n and we bled him to death trying to help him. So when you're actually inflating the money supply\n\n00:17.200 --> 00:24.160\n at 7% but you're calling it 2% because you want to help the economy, you're literally bleeding\n\n00:24.160 --> 00:31.040\n the free market to death. But the sad fact is George Washington went along with it because he\n\n00:31.040 --> 00:38.000\n thought that they were going to do him good, and the majority of the society, most companies,\n\n00:38.720 --> 00:46.400\n most conventional thinkers, you know, the working class, they go along with this because they think\n\n00:46.400 --> 00:50.880\n that someone has their best interest of mind, and the people that are bleeding them to death\n\n00:50.880 --> 00:56.400\n believe, they believe that prescription because their mental models are just so defective.\n\n00:58.800 --> 01:03.280\n The following is a conversation with Michael Saylor, one of the most prominent and brilliant\n\n01:03.280 --> 01:10.080\n Bitcoin proponents in the world. He is the CEO of MicroStrategy, founder of Saylor Academy,\n\n01:10.080 --> 01:16.640\n graduate of MIT, and Michael is one of the most fascinating and rigorous thinkers I've ever gotten\n\n01:16.640 --> 01:21.840\n a chance to explore ideas with. He can effortlessly zoom out to the big perspectives of human\n\n01:21.840 --> 01:28.640\n civilization and human history, and zoom back in to the technical details of blockchains, markets,\n\n01:28.640 --> 01:34.240\n governments, and financial systems. This is the Lex Friedman podcast. To support it,\n\n01:34.240 --> 01:40.560\n please check out our sponsors in the description. And now, dear friends, here's Michael Saylor.\n\n01:40.560 --> 01:49.120\n Here's Michael Saylor. Let's start with a big question of truth and wisdom. When advanced humans\n\n01:49.120 --> 01:54.320\n or aliens or AI systems, let's say five to ten centuries from now, look back at Earth\n\n01:55.280 --> 02:01.360\n on this early 21st century, how much do you think they would say we understood about\n\n02:02.320 --> 02:07.200\n money and economics, or even about engineering, science, life, death, meaning, intelligence,\n\n02:07.200 --> 02:11.440\n consciousness, all the big interesting questions?\n\n02:12.160 --> 02:15.680\n I think they would probably give us a\n\n02:17.840 --> 02:22.960\n B minus on engineering, on all the engineering things, the hard sciences.\n\n02:22.960 --> 02:23.840\n A passing grade.\n\n02:24.720 --> 02:30.160\n Like, we're doing okay. We're working our way through rockets and jets and electric cars and\n\n02:30.160 --> 02:39.360\n an electricity transport systems and nuclear power and space flight and the like. And if you look at\n\n02:39.360 --> 02:47.840\n the walls that grace the great court at MIT, it's full of all the great thinkers and they're all\n\n02:47.840 --> 02:57.920\n pretty admirable. If you could be with Newton or Gauss or Madame Curie or Einstein, you would\n\n02:57.920 --> 03:08.000\n respect them. I would say they'd give us like a D minus on economics, like an F plus or a D minus.\n\n03:08.000 --> 03:11.520\n You have an optimistic vision. First of all, optimistic vision of engineering,\n\n03:12.080 --> 03:17.120\n because everybody you've listed, not everybody, but most people you've listed is just over the\n\n03:17.120 --> 03:23.040\n past couple of centuries. And maybe it stretches a little farther back, but mostly all the cool\n\n03:23.040 --> 03:25.680\n stuff we've done in engineering is the past couple of centuries.\n\n03:25.680 --> 03:34.480\n I mean, Archimedes had his virtues. I studied the history of science at MIT and I also studied\n\n03:34.480 --> 03:40.720\n aerospace engineering. And so I clearly have a bias in favor of science. And if I look at the\n\n03:40.720 --> 03:47.760\n past 10,000 years and I consider all of the philosophy and the politics and their impact\n\n03:47.760 --> 03:53.360\n on the human condition, I think it's a wash for every politician that came up with a good idea,\n\n03:53.360 --> 03:59.920\n another politician came up with a bad idea. And it's not clear to me that most of the\n\n03:59.920 --> 04:06.880\n political and philosophical contributions to the human race and the human conditions\n\n04:06.880 --> 04:13.680\n have advanced so much. I mean, we're still taking guidance and admiring Aristotle and\n\n04:13.680 --> 04:22.320\n Plato and Seneca and the like. And on the other hand, if you think about what has made the human\n\n04:22.320 --> 04:33.520\n condition better, fire, water, harnessing of wind energy, try to row across an ocean, right?\n\n04:33.520 --> 04:34.080\n Not easy.\n\n04:34.080 --> 04:39.680\n And for people who are just listening or watching, there's a beautiful sexy ship from\n\n04:40.320 --> 04:42.080\n 16th, 17th century.\n\n04:42.080 --> 04:48.960\n This is a 19th century handmade model of a 17th century sailing ship, which is of the type that\n\n04:48.960 --> 04:56.720\n the Dutch East India's company used to sail the world and trade. So that was made, the original\n\n04:56.720 --> 05:04.320\n was made sometime in the 1600s. And then this model is made in the 19th century by individuals.\n\n05:04.320 --> 05:08.240\n So both the model and the ship itself is engineering at its best. And just imagine,\n\n05:08.240 --> 05:12.000\n just like rockets flying out to space, how much hope this filled people with,\n\n05:12.000 --> 05:19.520\n exploring the unknown, going into the mystery, both the entrepreneurs and the business people\n\n05:19.520 --> 05:24.320\n and the engineers and just humans. What's out there? What's out there to be discovered?\n\n05:24.320 --> 05:29.440\n Yeah, the metaphor of human beings leaving shore or sailing across the horizon,\n\n05:29.440 --> 05:33.520\n risking their lives in pursuit of a better life is an incredibly powerful one.\n\n05:33.520 --> 05:41.200\n In 1900, I suppose the average life expectancy is 50. During the Revolutionary War,\n\n05:42.000 --> 05:47.680\n while our founding fathers were fighting to establish life, liberty, pursuit of happiness,\n\n05:47.680 --> 05:54.240\n the Constitution, average life expectancy is like 32, somewhere between 32 and 36.\n\n05:54.880 --> 06:01.120\n So all the sound and the fury doesn't make you live past 32, but what does, right? Antibiotics.\n\n06:01.120 --> 06:09.120\n Conquest of infectious diseases. If we understand the science of infectious disease, sterilizing\n\n06:09.760 --> 06:15.680\n a knife and harnessing antibiotics gets you from 50 to 70. And that happened fast, right? That\n\n06:15.680 --> 06:24.720\n happens from 1900 to 1950 or something like that. And I think if you look at the human condition,\n\n06:24.720 --> 06:30.080\n you ever get on one of those rowing machines where they actually keep track of your watts output when\n\n06:30.080 --> 06:39.920\n you're on that? Yeah. It's like 200 is a lot. Okay, 200 is a lot. So a kilowatt hour is like all\n\n06:39.920 --> 06:48.160\n the energy that a human, a trained athlete can deliver in a day. And probably not 1% of the\n\n06:48.160 --> 06:54.160\n people in the world could deliver a kilowatt hour in a day. And the commercial value of a kilowatt\n\n06:54.160 --> 07:03.760\n hour, the retail value is 11 cents today. And the wholesale value is 2 cents. And so you have to look\n\n07:03.760 --> 07:12.320\n at the contribution of politicians and philosophers and economists to the human condition. And it's\n\n07:12.320 --> 07:17.680\n like at best a wash one way or the other. And then if you look at the contribution of John D.\n\n07:17.680 --> 07:25.840\n Rockefeller when he delivered you a barrel of oil and the energy in oil, liquid energy, or the\n\n07:25.840 --> 07:34.880\n contribution of Tesla as we deliver electricity. And what's the impact on the human condition if I\n\n07:34.880 --> 07:43.360\n have electric power, if I have chemical power, if I have wind energy, if I can actually set up a\n\n07:43.360 --> 07:51.120\n reservoir, create a dam, spend a turbine, and generate energy from a hydraulic source?\n\n07:52.160 --> 08:00.400\n That's extraordinary, right? And so our ability to cross the ocean, our ability to grow food,\n\n08:00.400 --> 08:09.360\n our ability to live, it's technology that gets the human race from a brutal life where life\n\n08:09.360 --> 08:14.400\n expectancy is 30 to a world where life expectancy is 80.\n\n08:14.400 --> 08:20.480\n You gave a D minus to the economists. So are they too like the politicians a wash\n\n08:20.960 --> 08:26.960\n in terms of there's good ideas and bad ideas and that tiny delta between good and bad?\n\n08:26.960 --> 08:31.440\n Is how you squeak past the F plus onto the D minus territory?\n\n08:31.440 --> 08:34.720\n I think most economic ideas are bad ideas.\n\n08:34.720 --> 08:35.280\n Most.\n\n08:35.280 --> 08:43.840\n You know, like take us back to MIT and you want to solve a fluid dynamics problem. Like design\n\n08:43.840 --> 08:50.240\n the shape of the hull of that ship, or you want to design an airfoil, a wing, or if you want to\n\n08:50.240 --> 08:59.120\n design an engine or a nozzle in a rocket ship, you wouldn't do it with simple arithmetic.\n\n08:59.760 --> 09:04.160\n You wouldn't do it with a scaler. There's not a single number, right? It's vector math.\n\n09:04.160 --> 09:10.480\n You know, computational fluid dynamics is n dimensional, higher level math,\n\n09:10.480 --> 09:15.920\n you know, complicated stuff. So when an economist says the inflation rate is\n\n09:15.920 --> 09:22.800\n 2%, that's a scaler. And when an economist says it's not a problem to print more money,\n\n09:22.800 --> 09:28.720\n because the velocity of the money is very low, monetary velocity is low, that's another scaler.\n\n09:29.680 --> 09:37.600\n Okay, so the truth of the matter is inflation is not a scaler. Inflation is an n dimensional vector.\n\n09:38.480 --> 09:40.800\n Money velocity is not a scaler.\n\n09:40.800 --> 09:49.920\n The saying, what's the velocity of money? Oh, it's slow or it's fast. It ignores the question of\n\n09:49.920 --> 09:56.400\n what medium is the money moving through. And the same way that, you know, what's the speed of sound?\n\n09:57.360 --> 10:05.360\n Okay, well, what is sound, right? Sound, you know, sound is a compression wave. It's energy\n\n10:05.360 --> 10:11.120\n moving through a medium, but the speed is different. So for example, the speed of sound through air is\n\n10:11.120 --> 10:16.000\n different than the speed of sound through water. And sound moves faster through water,\n\n10:16.000 --> 10:21.040\n it moves faster through a solid, and it moves faster to a stiffer solid. So there isn't one.\n\n10:21.840 --> 10:26.640\n What is the fundamental problem with the way economists reduce the world down to a model?\n\n10:26.640 --> 10:30.560\n Is it too simple? Or is it just even the first generation?\n\n10:30.560 --> 10:37.840\n I think that the fundamental problem is, if you see the world as a scaler, you simply pick\n\n10:38.400 --> 10:46.320\n the one number which is, which supports whatever you want to do, and you ignore the universe of\n\n10:46.320 --> 10:53.440\n other consequences from your behavior. In general, I don't know if you've heard of the\n\n10:53.440 --> 11:01.120\n Eric Weisen has been talking about this with gauge theory. So different kinds of approaches\n\n11:01.120 --> 11:08.800\n from the physics world, from the mathematical world to extend past this scaler view of economics.\n\n11:08.800 --> 11:15.840\n So gauge theory is one way that comes from physics. Do you find that a way of exploring economics\n\n11:15.840 --> 11:19.440\n interesting? So outside of cryptocurrency, outside of the actual technology,\n\n11:19.440 --> 11:24.000\n and so on, just analysis of how economics works. Do you find that interesting?\n\n11:26.000 --> 11:31.360\n Yeah, I think that if we're going to want to really make any scientific progress in economics,\n\n11:31.360 --> 11:38.000\n we have to apply much, much more computationally intensive and richer forms of mathematics.\n\n11:38.560 --> 11:40.720\n So simulation, perhaps, or?\n\n11:40.720 --> 11:45.760\n Yeah, you know, when I was at MIT, I studied system dynamics at MIT.\n\n11:45.760 --> 11:50.800\n You know, when I was at MIT, I studied system dynamics. You know, they taught it at the Sloan\n\n11:50.800 --> 11:58.720\n School. It was developed by Jay Forrester, who was an extraordinary computer scientist.\n\n11:59.280 --> 12:08.400\n And when we created models of economic behavior, they were all multi dimensional nonlinear models.\n\n12:08.400 --> 12:14.320\n So if you want to describe how anything works in the real world, you have to start with the concept\n\n12:14.320 --> 12:22.160\n of feedback. If I double the price of something, demand will fall, and attempts to create supply\n\n12:22.160 --> 12:28.720\n will increase, and there will be a delay before the capacity increases. There'll be an instant\n\n12:28.720 --> 12:34.400\n demand change, and there'll be rippling effects throughout every other segment of the economy,\n\n12:34.400 --> 12:40.720\n downstream and upstream of such a thing. So it's kind of common sense. But most economics,\n\n12:40.720 --> 12:45.280\n most classical economics, it's always, you know, taught with linear models,\n\n12:46.080 --> 12:51.840\n you know, fairly simplistic linear models. And oftentimes, even I'm really shocked today\n\n12:52.720 --> 13:00.000\n that the entire mainstream dialogue of economics has been captured by scale or arithmetic.\n\n13:00.640 --> 13:06.880\n For example, if you read, you know, read any article in New York Times or the Wall Street\n\n13:06.880 --> 13:12.720\n Journal, right, they just refer to there's an inflation number or the CPI or the inflation\n\n13:12.720 --> 13:20.560\n rate is X. And if you look at all the historic studies of the impact of inflation, generally,\n\n13:20.560 --> 13:27.840\n they're all based upon the idea that inflation equals CPI, and then they try to extrapolate from\n\n13:27.840 --> 13:35.760\n that and you just get nowhere with it. So at the very least, we should be considering inflation\n\n13:35.760 --> 13:42.080\n and other economics concept as a nonlinear dynamical system. So nonlinearity, and also\n\n13:42.080 --> 13:46.960\n just embracing the full complexity of just how the variables interact, maybe through simulation,\n\n13:46.960 --> 13:49.920\n maybe some have some interesting models around that.\n\n13:49.920 --> 13:55.680\n Wouldn't it be refreshing if somebody for once published a table of the change in price of every\n\n13:55.680 --> 14:00.400\n product, every service, and every asset in every place over time?\n\n14:00.400 --> 14:06.160\n LR You said table, some of that also is the task of visualization, how to extract from\n\n14:06.160 --> 14:14.160\n this complex set of numbers, patterns that somehow indicate something fundamental about\n\n14:14.160 --> 14:19.760\n what's happening. So like, summarization of data is still important, perhaps summarization,\n\n14:19.760 --> 14:27.040\n not down to a single scale of value. But looking at that whole sea of numbers, you have to find\n\n14:27.040 --> 14:33.680\n patterns, like what is inflation in a particular sector? What is maybe change over time, maybe\n\n14:33.680 --> 14:38.640\n different geographical regions, you know, things of that nature. I think that's kind of,\n\n14:38.640 --> 14:43.120\n I don't know even what that task is. You know, that's what you could look at machine learning,\n\n14:43.120 --> 14:49.360\n you can look at AI with that perspective, which is like, how do you represent what's happening\n\n14:49.360 --> 14:54.400\n efficiently, as efficiently as possible? That's never going to be a single number, but it might\n\n14:54.400 --> 14:58.720\n be a compressed model that captures something, something beautiful, something fundamental\n\n14:58.720 --> 14:59.760\n about what's happening.\n\n15:00.320 --> 15:09.840\n It's an opportunity, for sure, right? You know, if we take, for example, during the\n\n15:09.840 --> 15:18.720\n pandemic, the response of the political apparatus was to lower interest rates to zero, and to\n\n15:18.720 --> 15:25.200\n start buying assets, in essence, printing money. And the defense was, there's no inflation.\n\n15:26.720 --> 15:33.120\n But of course, you had one part of the economy where it was locked down, so it was illegal\n\n15:33.120 --> 15:41.120\n to buy anything. It was either illegal or it was impractical. So it would be impossible\n\n15:41.120 --> 15:45.920\n for demand to manifest, so of course, there is no inflation. On the other hand, there\n\n15:45.920 --> 15:53.840\n was instantaneous immediate inflation in another part of the economy. For example, you lower\n\n15:53.840 --> 15:59.520\n the interest rates to zero. At one point, we saw the swap rate on a 30 year note go\n\n15:59.520 --> 16:07.040\n to 72 basis points. Okay, that means that the value of a long dated bond immediately\n\n16:07.040 --> 15:49.440\n inflates. So the bond market had hyperinflation within minutes of these\n\n15:49.440 --> 15:55.680\n financial decisions. The asset market had hyperinflation within minutes of these\n\n15:59.520 --> 16:00.560\n financial decisions.\n\n16:01.360 --> 16:13.240\n So here again, it's about how we insights whether the market will\n\n16:13.240 --> 16:17.840\n react to the hyperinflation within minutes of these financial decisions.\n\n16:17.840 --> 16:24.000\n asset market had hyperinflation. We had what you call a K shape recovery, what we affectionately\n\n16:24.000 --> 16:29.920\n call a K shape recovery. Main Street shut down, Wall Street recovered all within six weeks.\n\n16:30.800 --> 16:38.640\n The inflation was in the assets, like in the stocks, in the bonds. If you look today, you see\n\n16:38.640 --> 16:48.320\n that a typical house, according to the Case Shiller Index today, is up 19.2% year over year. So if\n\n16:48.320 --> 16:56.720\n you're a first time home buyer, the inflation rate is 19%. The formal CPI announced a 7.9%.\n\n16:58.880 --> 17:05.840\n You can pretty much create any inflation rate you want by constructing a market basket,\n\n17:05.840 --> 17:12.240\n a weighted basket of products or services or assets that yield you the answer. I think that\n\n17:13.680 --> 17:21.840\n the fundamental failing of economists is, first of all, they don't really have a term for asset\n\n17:21.840 --> 17:29.200\n inflation. What's an asset? What's asset hyperinflation? You mentioned bond market swap\n\n17:29.200 --> 17:35.920\n rate and asset is where the majority of the hyperinflation happen. What's inflation? What's\n\n17:35.920 --> 17:40.720\n hyperinflation? What's an asset? What's an asset market? I'm going to ask so many dumb questions.\n\n17:40.720 --> 17:48.400\n In the conventional economic world, you would treat inflation as the rate of increase in\n\n17:48.400 --> 17:54.000\n price of a market basket of consumer products defined by a government agency.\n\n17:54.000 --> 18:00.240\n LW. So they have like traditional things that a regular consumer would be buying.\n\n18:01.040 --> 18:06.160\n The government selects like toilet paper, food, toaster,\n\n18:06.960 --> 18:11.120\n refrigerator, electronics, all that kind of stuff. And it's like a representative\n\n18:12.320 --> 18:19.280\n basket of goods that lead to a content existence on this earth for a regular consumer.\n\n18:19.280 --> 18:25.200\n CM. They define a synthetic metric, right? I mean, I'm going to say you should have a thousand\n\n18:25.200 --> 18:32.480\n square foot apartment and you should have a used car and you should eat three hamburgers a week.\n\n18:33.040 --> 18:40.560\n Now, 10 years go by and the apartment costs more, I could adjust the market basket by a,\n\n18:40.560 --> 18:45.200\n they call them hedonic adjustments. I could decide that it used to be in 1970 you needed\n\n18:45.200 --> 18:50.720\n a thousand square feet, but in the year 2020, you only need 700 square feet because we've\n\n18:51.280 --> 18:56.880\n miniaturized televisions and we've got more efficient electric appliances and because\n\n18:56.880 --> 19:02.000\n things have collapsed out of the iPhone, you just don't need as much space. So now I, you know,\n\n19:02.000 --> 19:07.360\n it may be that the apartment costs 50% more, but after the hedonic adjustment, there is no inflation\n\n19:07.360 --> 19:11.520\n because I just downgraded the expectation of what a normal person should have.\n\n19:11.520 --> 19:16.400\n TG. So the synthetic nature of the metric allows for manipulation by people in power?\n\n19:16.400 --> 19:24.720\n CM. Pretty much. I guess my criticism of economists is rather than embracing inflation\n\n19:25.840 --> 19:31.600\n based upon its fundamental idea, which is the rate at which the price of things go up, right?\n\n19:31.600 --> 19:40.560\n They've been captured by mainstream conventional thinking to immediately equate inflation to the\n\n19:40.560 --> 19:47.840\n government issued CPI or government issued PCE or government issued PPI measure, which was never the\n\n19:47.840 --> 19:55.040\n rate at which things go up. It's simply the rate at which a synthetic basket of products and\n\n19:55.040 --> 20:00.480\n services the government wishes to track go up. Now, the problem with that is that the\n\n20:00.480 --> 20:08.640\n problem with that is two big things. One thing is the government gets to create the market basket,\n\n20:08.640 --> 20:16.960\n and so they keep changing what's in the basket over time. So I mean, if I said three years ago,\n\n20:16.960 --> 20:22.000\n you should go see 10 concerts a year and the concert tickets now cost $200 each. Now it's\n\n20:22.000 --> 20:28.640\n $2,000 a year to go see concerts. Now I'm in charge of calculating inflation. So I redefine,\n\n20:28.640 --> 20:33.440\n you know, your entertainment quota for the year to be eight Netflix streaming concerts,\n\n20:33.440 --> 20:37.680\n and now they don't cost $2,000. They cost nothing, and there is no inflation,\n\n20:37.680 --> 20:44.240\n but you don't get your concerts, right? So the problem starts with continually changing\n\n20:44.240 --> 20:49.840\n the definition of the market basket. But in my opinion, that's not the biggest problem.\n\n20:49.840 --> 21:00.000\n The more egregious problem is the fundamental idea that assets aren't products or services.\n\n21:00.720 --> 21:03.600\n Assets can't be inflated. What's an asset?\n\n21:03.600 --> 21:15.280\n A house, a share of Apple stock, a bond, a Bitcoin is an asset, or a Picasso painting.\n\n21:15.280 --> 21:22.400\n LW. Not a consumable good. Not an Apple that you can eat.\n\n21:22.400 --> 21:30.160\n RL. Right. If I throw away an asset, then I'm not on the hook to track the inflation rate for it.\n\n21:30.160 --> 21:35.520\n So what happens if I change the policy such that, let's take the classic example,\n\n21:35.520 --> 21:40.960\n a million dollar bond at a 5% interest rate gives you $50,000 a year in risk free income.\n\n21:40.960 --> 21:47.760\n You might retire on $50,000 a year in a low cost jurisdiction. So the cost of social security\n\n21:47.760 --> 21:55.040\n or early retirement is $1 million when the interest rate is 5%. During the crisis of March\n\n21:55.040 --> 22:01.760\n of 2020, the interest rate went on a 10 year bond went to 50 basis points. So now the cost\n\n22:01.760 --> 22:08.160\n of that bond is $10 million. The cost of social security went from a million dollars to $10 million.\n\n22:08.160 --> 22:14.000\n So if you wanted to work your entire life, save money, and then retire risk free and live happily\n\n22:14.000 --> 22:19.360\n ever after on a $50,000 salary, live in on a beach in Mexico, wherever you wanted to go,\n\n22:20.320 --> 22:25.600\n you had hyperinflation. The cost of your aspiration increased by a factor of 10\n\n22:26.560 --> 22:32.320\n over the course of some amount of time. In fact, in that case, that was over the course of about 12\n\n22:32.320 --> 22:41.680\n years. As the inflation rate ground down, the asset traded up. But the conventional view is,\n\n22:41.680 --> 22:48.800\n oh, that's not a problem, because it's good that the bond is highly priced because we own the bond.\n\n22:49.840 --> 22:57.200\n Or what's the problem with the inflation rate in housing being 19%? It's an awful problem for a\n\n22:57.200 --> 23:02.720\n 22 year old that's starting their first job, that's saving money to buy a house. But it would\n\n23:02.720 --> 23:09.440\n be characterized as a benefit to society by a conventional economist who would say, well, housing\n\n23:09.440 --> 23:14.400\n asset values are higher because of interest rate fluctuation, and now the economy has got more\n\n23:14.400 --> 23:24.240\n wealth. And so that's viewed as a benefit. So what's being missed here, like the suffering\n\n23:24.240 --> 23:32.880\n of the average person, or the struggle, the suffering, the pain of the average person,\n\n23:34.080 --> 23:37.760\n like metrics that captured that within the economic system? Is that when you're talking\n\n23:37.760 --> 23:43.680\n about different... One way to say it is a conventional view of inflation as CPI\n\n23:43.680 --> 23:55.200\n understates the human misery that's inflicted upon the working class and on mainstream companies by\n\n23:56.720 --> 24:01.920\n the political class. And so it's a massive shift of wealth from the working class to the property\n\n24:01.920 --> 24:09.280\n class. It's a massive shift of power from the free market to the centrally governed or the\n\n24:09.280 --> 24:17.680\n controlled market. It's a massive shift of power from the people to the government. And maybe one\n\n24:17.680 --> 24:23.840\n more illustrative point here, Alexis, is what do you think the inflation rate's been for the past\n\n24:23.840 --> 24:30.000\n 100 years? Oh, you're talking about the scalar again? If you took a survey of everybody on the\n\n24:30.000 --> 24:35.680\n street and you asked them, what do they think inflation was? What is it? You remember when\n\n24:35.680 --> 24:43.920\n Jerome Powell said our target's 2%, but we're not there. If you go around the corner, I have posted\n\n24:43.920 --> 24:55.120\n the deed to this house sold in 1930. Okay. And the number on that deed is $100,000, 1930. And if you\n\n24:55.120 --> 25:05.520\n go on Zillow and you get the Z estimate. Is it higher than that? $30,500,000. So that's 92\n\n25:05.520 --> 25:17.520\n years, 1930 or 2022. And in 92 years, we've had 305x increase in price of the house. Now,\n\n25:17.520 --> 25:23.040\n if you actually back calculate, you come to a conclusion that the inflation rate was approximately\n\n25:23.040 --> 25:33.200\n 6.5% a year every year for 92 years. Okay. And there's nobody, nobody in government,\n\n25:33.200 --> 25:39.840\n no conventional economists that would ever admit to an inflation rate of 7% a year in the US dollar\n\n25:39.840 --> 25:48.400\n over the last century. Now, if you dig deeper, I mean, one guy that's done a great job working on\n\n25:48.400 --> 25:54.320\n this is Seyfettin Amos who wrote the book, The Bitcoin Standard. And he notes that on average,\n\n25:54.320 --> 26:00.560\n it looks like the inflation rate and the money supply is about 7% a year all the way up to the\n\n26:00.560 --> 26:07.680\n year 2020. If you look at the S&P index, which is a market basket of scarce desirable stocks,\n\n26:09.120 --> 26:17.200\n it returned about 10%. If you talk to 10% a year for 100 years, the money supply is expanding at\n\n26:17.200 --> 26:24.400\n 7% 100 years. If you actually talk to economists or you look at the economy and you ask the question,\n\n26:24.400 --> 26:32.000\n how fast does the economy grow in its entirety year over year? Generally about 2% to 3%. Like\n\n26:32.000 --> 26:39.040\n the sum total impact of all this technology and human ingenuity might get you a 2.5, 3% improvement\n\n26:39.040 --> 26:45.600\n a year. As measured by GDP. Are you okay with that? I'm not sure. I'm not sure I'd go that far yet,\n\n26:45.600 --> 26:53.520\n but I would just say that if you had the human race doing stuff and if you asked the question,\n\n26:53.520 --> 26:59.200\n how much more efficiently will we do this stuff next year than this year? Or what's the value of\n\n26:59.200 --> 27:05.280\n all of our innovations and inventions and investments in the past 12 months? You'd be\n\n27:05.280 --> 27:12.960\n hard pressed to say we get 2% better. Typical investor thinks they're 10% better every year.\n\n27:13.600 --> 27:19.200\n So if you look at what's going on, really, when you're holding a million dollars of stocks and\n\n27:19.200 --> 27:25.680\n you're getting a 10% gain a year, you really get a 7% expansion of the money supply. You're getting\n\n27:25.680 --> 27:34.080\n a 2% or 3% gain under best circumstances. And another way to say that is if the money supply\n\n27:34.080 --> 27:40.400\n stopped expanding at 7% a year, the S&P yield might be 3% and not 10%. It probably should be.\n\n27:42.640 --> 27:47.280\n Now, that gets you to start to ask a bunch of other fundamental questions. Like\n\n27:47.280 --> 27:54.240\n if I borrow a billion dollars and pay 3% interest and the money supply expands at 7% to 10% a year,\n\n27:54.240 --> 28:02.160\n and I ended up making a 10% return on a billion dollar investment paying 3% interest, is that fair?\n\n28:03.200 --> 28:10.160\n And who suffered so that I could do that? Because in an environment where you're just\n\n28:10.160 --> 28:15.760\n inflating the money supply and you're holding the assets constant, it stands the reason that\n\n28:15.760 --> 28:21.680\n the price of all the assets is going to appreciate somewhat proportional to the money supply.\n\n28:22.400 --> 28:27.360\n And the difference in asset appreciations is going to be a function of the scarce desirable\n\n28:27.360 --> 28:33.440\n quality of the assets, and to what extent can I make more of them, and to what extent are they\n\n28:33.440 --> 28:41.440\n truly limited in supply? Yeah, so we'll get to a lot of the words you said there. The scarcity,\n\n28:41.440 --> 28:48.560\n the scarcity, and so connected to how limited they are and the value of those\n\n28:49.120 --> 28:55.200\n assets. But you also said, so the expansion of the money supply, which is put another way,\n\n28:55.200 --> 28:59.920\n is printing money. And so is that always bad, the expansion of the money supply?\n\n29:01.440 --> 29:07.840\n Just to put some terms on the table so we understand them. You nonchalantly say it's\n\n29:07.840 --> 29:12.800\n always on average expanding every year, the money supply is expanding every year by 7%.\n\n29:13.600 --> 29:20.000\n That's a bad thing? That's universally a bad thing? It's awful. I guess to be precise,\n\n29:21.200 --> 29:31.360\n it's the currency. I would say money is monetary energy or economic energy. And the economic\n\n29:31.360 --> 29:37.120\n energy has to find its way into a medium. So if you want to move it rapidly as a medium of exchange,\n\n29:37.120 --> 29:42.800\n it has to find its way into currency. But the money can also flow into property, like a house\n\n29:42.800 --> 29:50.400\n or gold. If the money flows into property, it'll probably hold its value much better if the money\n\n29:50.400 --> 29:59.040\n flows into currency. If you had put $100,000 in this house, you would have 305x return over 92\n\n29:59.040 --> 30:04.320\n years. But if you had put the money, $100,000, in a safe deposit box and buried it in the basement,\n\n30:04.320 --> 30:14.560\n you would have lost 99.7% of your wealth over the same time period. So the expansion of the currency\n\n30:16.000 --> 30:22.880\n creates a massive inefficiency in the society, what I'll call an adiabatic lapse. What we're\n\n30:22.880 --> 30:30.240\n doing is we're bleeding the civilization to death. What's the adiabatic, what's that word?\n\n30:30.240 --> 30:38.880\n Adiabatic lapse. Right. In aerospace engineering, you want to solve any problem, they start with\n\n30:38.880 --> 30:46.000\n the phrase, assume an adiabatic system. And what that means is a closed system. So I've got a\n\n30:46.000 --> 30:52.320\n container and in that container, no air leaves and no air enters, no energy exits or enters.\n\n30:52.320 --> 30:56.320\n So it's a closed system. So you got the closed system lapse.\n\n30:56.320 --> 31:01.920\n There's a leak in the ship.\n\n31:01.920 --> 31:06.640\n I'm going to use a physical metaphor for you because you're the jujitsu, right? Like you've\n\n31:06.640 --> 31:13.520\n got 10 pints of blood in your body. And so before your next workout, I'm going to take one pint from\n\n31:13.520 --> 31:22.240\n you. Now you're going to go exercise, but you've lost 10% of your blood. You're not going to perform\n\n31:22.240 --> 31:28.160\n as well. It takes about one month for your body to replace the red blood platelets. So what if I\n\n31:28.160 --> 31:34.480\n tell you every month you got to show up and I'm going to bleed you? Yeah. Okay. So if I'm draining\n\n31:34.480 --> 31:41.600\n the energy, I'm draining the blood from your body, you can't perform. If you, adiabatic lapse is when\n\n31:41.600 --> 31:47.280\n you go up in altitude, every thousand feet, you lose three degrees. You go at 50,000 feet, you're\n\n31:47.280 --> 31:54.720\n 150 degrees colder than sea level. That's why you look at your instruments and instead of 80 degrees,\n\n31:54.720 --> 32:00.720\n you're minus 70 degrees. Why is the temperature falling? Temperature is falling because it's not\n\n32:00.720 --> 32:13.040\n a closed system, it's an open system. As the air expands, the density falls, the energy per cubic\n\n32:13.040 --> 32:18.080\n whatever falls and therefore the temperature falls. The heat's falling out of the solution.\n\n32:18.800 --> 32:24.720\n So when you're inflating, let's say you're inflating the currency supply by 6%,\n\n32:25.520 --> 32:34.400\n you're sucking 6% of the energy out of the fluid that the economy is using to function.\n\n32:34.400 --> 32:39.680\n So the currency, this kind of ocean of currency, that's a nice way for the economy to function.\n\n32:39.680 --> 32:44.720\n It's the most kind of, it's being inefficient when you expand the money supply, but it's\n\n32:47.600 --> 32:53.040\n the liquid. I'm trying to find the right kind of adjective here. It's how you do transactions at\n\n32:53.040 --> 33:00.240\n a scale of billions. Currency is the asset we use to move monetary energy around and you could use\n\n33:00.240 --> 33:06.160\n the dollar or you could use the peso or you could use the bolivar. Selling houses and buying houses\n\n33:06.160 --> 33:14.560\n is much more inefficient or like you can't transact between billions of people with houses.\n\n33:14.560 --> 33:20.720\n Yeah. Properties don't make such good mediums of exchange. They make better stores of value\n\n33:20.720 --> 33:28.720\n and they have utility value if it's a ship or a house or a plane or a bushel of corn, right?\n\n33:29.280 --> 33:33.200\n Can I zoom out just for, can we zoom out? Keep zooming out until we reach\n\n33:33.200 --> 33:38.960\n the origin of human civilization. But on the way, ask, you gave economists a D minus.\n\n33:39.600 --> 33:42.080\n I'm not even going to ask you what you give to governments.\n\n33:44.080 --> 33:51.440\n Do you think their failure, economists and government failure is malevolence or incompetence?\n\n33:52.880 --> 34:00.400\n I think policymakers are well intentioned, but generally all government policy is inflationary\n\n34:00.400 --> 34:04.720\n and all government, it's inflammatory and inflationary. So what I mean by that is\n\n34:05.920 --> 34:13.840\n when you have a policy pursuing supply chain independence, if you have an energy policy,\n\n34:13.840 --> 34:20.880\n if you have a labor policy, if you have a trade policy, if you have any kind of foreign policy,\n\n34:20.880 --> 34:26.960\n a domestic policy, a manufacturing policy, every one of these, a medical policy,\n\n34:26.960 --> 34:35.600\n every one of these policies interferes with the free market and generally prevents some rational\n\n34:35.600 --> 34:42.320\n actor from doing it in a cheaper, more efficient way. So when you layer them on top of each other,\n\n34:42.320 --> 34:46.960\n they all have to be paid for. If you want to shut down the entire economy for a year,\n\n34:46.960 --> 34:50.880\n you have to pay for it, right? If you want to fight a war, you have to pay for it,\n\n34:50.880 --> 34:56.880\n pay for it, right? If you don't want to use oil or natural gas, you have to pay for it.\n\n34:56.880 --> 35:02.080\n If you don't want to manufacture semiconductors in China and you want to manufacture them in the\n\n35:02.080 --> 35:08.000\n US, you got to pay for it. If I rebuild the entire supply chain in Pennsylvania and I hire a bunch of\n\n35:08.000 --> 35:16.640\n employees and then I unionize the employees, then not only am I idle the factory in the Far East,\n\n35:16.640 --> 35:23.360\n it goes to 50% capacity. So whatever it sells, it has to raise the price on. And then I drive up\n\n35:23.360 --> 35:28.800\n the cost of labor for every other manufacturer in the US because I'm competing against them,\n\n35:29.600 --> 35:34.240\n right? I'm changing that condition. So everything gets less efficient, everything gets more\n\n35:34.240 --> 35:41.200\n expensive. And of course, the government couldn't really pay for its policies and its wars with\n\n35:41.200 --> 35:46.320\n taxes. We didn't pay for World War I with tax. We didn't pay for World War II with tax. We didn't\n\n35:46.320 --> 35:52.240\n pay for Vietnam with tax. In fact, when you trace this, what you realize is the government never\n\n35:52.240 --> 35:57.680\n pays for all of its policies with tax. Because it's too painful to ask to raise the taxes to\n\n35:57.680 --> 36:04.400\n truly transparently pay for the things you're doing with taxes, with taxpayer money because\n\n36:04.400 --> 36:10.560\n they feel the pain. That's one interpretation or it's just too transparent. If people understood\n\n36:10.560 --> 36:18.960\n the true cost of war, they wouldn't want to go to war. If you were told that you would lose 95%\n\n36:18.960 --> 36:28.160\n of your assets and 90% of everything you ever will be taken from you, you might reprioritize\n\n36:28.160 --> 36:32.560\n your thought about a given policy and you might not vote for that politician. But you're still\n\n36:32.560 --> 36:38.640\n saying incompetence, not malevolence. So fundamentally, government creates a bureaucracy\n\n36:38.640 --> 36:48.400\n of incompetence is kind of how you look at it. I think a lack of humility. If people had more\n\n36:48.400 --> 36:55.280\n humility, then they would realize. Humility about how little they know, how little they understand\n\n36:55.280 --> 36:59.200\n about the function of complex systems. There's a phrase from Quint Eastwood's movie, Unforgiven,\n\n36:59.200 --> 37:06.560\n where he says a man's got to know his limitations. I think that a lot of people overestimate\n\n37:06.560 --> 37:17.600\n what they can accomplish and experience. Experience in life causes you to reevaluate that.\n\n37:17.600 --> 37:24.480\n So I mean, I've done a lot of things in my life and generally, my mistakes were always my good\n\n37:24.480 --> 37:33.200\n ideas that I enthusiastically pursued to the detriment of my great ideas that required 150%\n\n37:33.200 --> 37:40.720\n of my attention to prosper. So I think people pursue too many good ideas. They all sound good,\n\n37:41.600 --> 37:47.680\n but there's just a limit to what you can accomplish. And everybody underestimates the\n\n37:47.680 --> 37:58.000\n challenges of implementing an idea. And they always overestimate the benefits of the pursuit\n\n37:58.000 --> 38:04.400\n of that. And so I think it's an overconfidence that causes an overexuberance in pursuit of\n\n38:04.400 --> 38:13.200\n policies. And as the ambition of the government expands, so must the currency supply. Well,\n\n38:13.200 --> 38:19.040\n I could say the money supply, but let's say the currency supply. You can triple the number of\n\n38:19.040 --> 38:25.440\n pesos in the economy, but it doesn't triple the amount of manufacturing capacity in the set\n\n38:25.440 --> 38:31.200\n economy. And it doesn't triple the amount of assets in the economy, it just triples the pesos. So\n\n38:31.760 --> 38:39.440\n as you increase the currency supply, then the price of all those scarce desirable things\n\n38:39.440 --> 38:47.920\n will tend to go up rapidly. And the confidence of all of the institutions, the corporations,\n\n38:47.920 --> 38:52.640\n and the individual actors and trading partners will collapse.\n\n38:52.640 --> 38:59.920\n TK If we take a tangent on a tangent, and we will return soon to the big human civilization\n\n38:59.920 --> 39:08.560\n question. So if government naturally wants to buy stuff it can't afford,\n\n39:10.080 --> 39:19.920\n what's the best form of government? Anarchism, libertarianism. So there's not even armies,\n\n39:19.920 --> 39:28.400\n there's no borders, that's anarchism. The smallest possible, the best government would\n\n39:28.400 --> 39:33.040\n be the least and the debate will be over that. TK When you think about this stuff,\n\n39:33.600 --> 39:39.520\n do you think about, okay, government is the way it is, I as a person that can generate great ideas,\n\n39:39.520 --> 39:44.080\n how do I operate in this world? Or do you also think about the big picture if we start a new\n\n39:44.080 --> 39:49.600\n TK civilization somewhere on Mars, do you think about what's the ultimate form of government?\n\n39:50.240 --> 39:52.560\n What's at least a promising thing to try?\n\n39:58.320 --> 40:05.440\n TK You know, I have laser eyes on my profile on Twitter, Lex.\n\n40:05.440 --> 40:06.640\n TK What does that mean?\n\n40:06.640 --> 40:12.880\n TK And the significance of laser eyes is to focus on the thing that can make a difference.\n\n40:12.880 --> 40:14.240\n TK Yes.\n\n40:14.240 --> 40:17.360\n TK And if I look at the civilization,\n\n40:19.120 --> 40:27.840\n I would say half the problems in the civilization are due to the fact that our understanding of\n\n40:27.840 --> 40:34.480\n economics and money is defective, half, 50%. I don't know, it's worth $500 trillion worth of\n\n40:34.480 --> 40:43.920\n problems. Like money represents all the economic energy in the civilization and it kind of equates\n\n40:43.920 --> 40:49.440\n to all the products, all the services and all the assets that we have and we're ever gonna have.\n\n40:49.440 --> 40:58.320\n So that's half. The other half of the problems in the civilization are medical and military and\n\n40:58.320 --> 41:09.040\n political and philosophical and natural. And I think that there are a lot of different solutions\n\n41:09.600 --> 41:18.880\n to all those problems and they are all honorable professions and they all merit a lifetime of\n\n41:18.880 --> 41:26.480\n consideration for the specialists in all those areas. I think that what I could offer it's\n\n41:26.480 --> 41:34.640\n constructive is inflation is completely misunderstood. It's a much bigger problem\n\n41:34.640 --> 41:39.360\n than we understand it to be. We need to introduce engineering and science\n\n41:39.360 --> 41:45.920\n techniques into economics if we wanna further the human condition. All government policy is\n\n41:45.920 --> 41:54.560\n inflationary. And another pernicious myth is inflation is always and everywhere a monetary\n\n41:54.560 --> 42:00.400\n phenomenon. A famous quote by Milton Friedman, I believe, it's like, it's a monetary phenomenon\n\n42:00.400 --> 42:05.840\n that is inflation comes from expanding the currency supply. It's a nice phrase and it's\n\n42:05.840 --> 42:12.160\n oftentimes quoted by people that are anti inflation. But again, it just signifies a lack\n\n42:12.160 --> 42:19.440\n of appreciation of what the issue is. Inflation is, if I had a currency which was completely\n\n42:19.440 --> 42:25.360\n noninflationary, if I never printed another dollar, and if I eliminated fractional reserve\n\n42:25.360 --> 42:31.360\n banking from the face of the earth, we'd still have inflation. And we have inflation as long\n\n42:31.360 --> 42:40.240\n as we have government that is capable of pursuing any kind of policies that are in themselves\n\n42:40.240 --> 42:46.320\n inflationary and generally they all are. So in general, inflationary is the big\n\n42:46.320 --> 42:52.160\n the big characteristic of human nature that governments collection of groups that have\n\n42:52.160 --> 42:59.920\n power over others and allocate other people's resources will try to intentionally or not hide\n\n42:59.920 --> 43:06.800\n the costs of those allocations, like in some tricky ways, whatever the options ever available.\n\n43:07.760 --> 43:14.640\n You know, hiding the cost is like, is like the tertiary thing, like, the primary goal\n\n43:14.640 --> 43:19.600\n is the government will attempt to do good. Right. And that's the fundamental, that's\n\n43:19.600 --> 43:24.160\n the primary problem. They will attempt to do good and they will and they will do it.\n\n43:24.160 --> 43:30.080\n They will do good imperfectly and they will create oftentimes as much damage,\n\n43:30.960 --> 43:35.280\n more damage than the good they do. Most government policy will be iatrogenic. It will,\n\n43:35.280 --> 43:39.840\n it will create more harm than good in the pursuit of it. But it is what it is.\n\n43:39.840 --> 43:47.200\n The secondary, the secondary issue is they will unintentionally pay for it\n\n43:47.200 --> 43:54.880\n by expanding the currency supply without realizing that they're, they're actually\n\n43:54.880 --> 44:01.680\n paying for it in in a suboptimal fashion. They'll collapse their own currencies while they attempt\n\n44:01.680 --> 44:08.320\n to do good. The tertiary issue is they will mismeasure how badly they're collapsing the\n\n44:08.320 --> 44:14.320\n currency. So for example, if you go to the Bureau of Labor Statistics, you know, and look at the\n\n44:14.320 --> 44:19.920\n numbers printed by the Fed, they'll say, oh, it looks like the dollar's lost 95% of its purchasing\n\n44:19.920 --> 44:26.400\n power over 100 years. Okay, they sort of fess up that there's a problem, but they make it 95%\n\n44:26.400 --> 44:34.560\n loss over 100 years. What they don't do is realize it's a 99.7% loss over 80 years. So they will\n\n44:34.560 --> 44:43.360\n mismeasure just the horrific extent of the monetary policy in pursuit of the foreign\n\n44:43.360 --> 44:52.320\n policy and the domestic policy, which they overestimate their budget and their means to\n\n44:52.320 --> 45:00.400\n accomplish their ends, and they underestimate the cost. And they're oblivious to the horrific\n\n45:00.400 --> 45:06.640\n damage that they do to the civilization because the mental models that they use that are\n\n45:06.640 --> 45:13.760\n conventionally taught are wrong, right? The mental model that, like, it's okay, we can print all this\n\n45:13.760 --> 45:21.040\n money because the velocity of the money is low, right? Because money velocity is a scalar and\n\n45:21.040 --> 45:25.920\n inflation is the scalar, and we don't see 2% inflation yet, and the money velocity is low,\n\n45:25.920 --> 45:32.080\n and so it's okay if we print trillions of dollars. Well, the money velocity was immediate,\n\n45:33.120 --> 45:41.360\n right? The velocity of money through the crypto economy is 10,000 times faster than the velocity\n\n45:41.360 --> 45:47.440\n of money through the consumer economy, right? I think Nick pointed out when you spoke to him,\n\n45:47.440 --> 45:52.480\n he said it takes two months for a credit card transaction to settle, right? So you want to\n\n45:52.480 --> 45:57.680\n spend a million dollars in the consumer economy, you can move it six times a year.\n\n45:58.320 --> 46:04.160\n You put a million dollars into gold, gold will sit in a vault for a decade, okay? So the velocity\n\n46:04.160 --> 46:10.240\n of money through gold is 0.1. You put the money in the stock market and you can trade it once a\n\n46:10.240 --> 46:15.520\n week, the settlement is T plus 2, maybe you get to 2 to 1 leverage. You might get to a money\n\n46:15.520 --> 46:21.920\n velocity of 100 a year in the stock market. You put your money into the crypto economy,\n\n46:21.920 --> 46:27.840\n and these people are settling every four hours. And you know, if you're offshore,\n\n46:27.840 --> 46:34.400\n they're trading with 20x leverage. So if you settle every day and you trade the 20x leverage,\n\n46:34.400 --> 46:44.160\n you just went to 7,000. So the velocity of the money varies. I think the politicians,\n\n46:44.160 --> 46:49.440\n they don't really understand inflation and they don't understand economics, but you can't blame\n\n46:49.440 --> 46:55.760\n them because the economists don't understand economics. Because if they did, they would be\n\n46:55.760 --> 47:04.160\n creating multivariate computer simulations where they actually put in the price of every piece of\n\n47:04.160 --> 47:09.600\n housing in every city in the world, the full array of foods, and the full array of products,\n\n47:09.600 --> 47:16.320\n and the full array of assets. And then on a monthly basis, they would publish all those\n\n47:16.320 --> 47:24.000\n results. And that's a high bandwidth requirement. And I think that people don't really want to\n\n47:24.000 --> 47:32.480\n embrace it. And also, the most pernicious thing, there's that phrase, you know, you can't tell\n\n47:32.480 --> 47:38.640\n people what to think, but you can tell them what to think about. The most pernicious thing is I get\n\n47:38.640 --> 47:47.760\n you to misunderstand the phenomena so that even when it's happening to you, you don't appreciate\n\n47:47.760 --> 47:53.200\n that it's a bad thing and you think it's a good thing. So if housing prices are going up 20% year\n\n47:53.200 --> 47:57.920\n over year, and I say, this is great for the American public because most of them are homeowners,\n\n47:58.480 --> 48:08.000\n then I have misrepresented a phenomena. Inflation is 20%, not 7%. And then I have misrepresented it\n\n48:08.000 --> 48:15.200\n as being a positive rather than a negative. And people will stare at it and you could even show\n\n48:15.200 --> 48:20.800\n them their house on fire and they would perceive it as being great because it's warming them up\n\n48:20.800 --> 48:25.520\n and they're going to save on their heat costs. It does seem that the cruder the model,\n\n48:25.520 --> 48:31.840\n whether it's economics, whether it's psychology, the easier it is to weave whatever the heck\n\n48:31.840 --> 48:41.360\n narrative you want and not in a malicious way, but just like it's some kind of emergent phenomena,\n\n48:41.360 --> 48:46.160\n this narrative thing that we tell ourselves. So you can tell any kind of story about inflation.\n\n48:46.160 --> 48:51.040\n Inflation is good, inflation is bad. The cruder the model, the easier it is to tell a narrative\n\n48:51.040 --> 48:58.880\n about it. So if you take an engineering approach, I feel like it becomes more and more difficult\n\n48:58.880 --> 49:04.480\n to run away from sort of a true deep understanding of the dynamics of the system.\n\n49:05.920 --> 49:10.800\n I mean, honestly, if you went to 100 people on the street and you asked them to define inflation,\n\n49:10.800 --> 49:18.560\n how many would say it's a vector tracking the change in price of every product service\n\n49:18.560 --> 49:25.760\n asset in the world over time? Not many. Now, if you went to them and you said,\n\n49:25.760 --> 49:30.800\n do you think 2% inflation a year is good or bad? The majority would probably say,\n\n49:30.800 --> 49:36.640\n well, I hear it's good. The majority of economists would say 2% inflation a year is good.\n\n49:37.920 --> 49:48.240\n And of course, look at the ship next to us. What if I told you that the ship leaked 2% of its\n\n49:48.240 --> 49:54.000\n volume every something, right? The ship is rotting 2% a year. That means the useful life of the ship\n\n49:54.000 --> 50:00.640\n is 50 years. Now, ironically, that's true. Like a wooden ship had a 50 year to 100 year life,\n\n50:00.640 --> 50:04.720\n 100 would be long, 50 years, not unlikely. So when we built ships out of wood,\n\n50:05.520 --> 50:12.480\n they had a useful life of about 50 years and then they sunk, they rotted. There's nothing good about\n\n50:12.480 --> 50:20.400\n it, right? You build a ship out of steel and it's zero as opposed to 2% degradation. And how much\n\n50:20.400 --> 50:29.760\n better is 0% versus 2%? Well, 2% means you have a useful life of, you know, it's half life of 35\n\n50:29.760 --> 50:35.680\n years. 2% is a half life of 35 years. That's basically the half life of money and gold.\n\n50:35.680 --> 50:42.400\n If I store your life force in gold, under perfect circumstances, you have a useful life of 35 years.\n\n50:42.400 --> 50:52.160\n 0% is a useful life of forever. So 0% is immortal. 2% is 35 years average life expectancy.\n\n50:53.200 --> 50:58.880\n So the idea that you would think the life expectancy of the currency and the civilization\n\n50:58.880 --> 51:05.840\n should be 35 years instead of forever is kind of a silly notion. But the tragic notion is it was,\n\n51:05.840 --> 51:13.360\n you know, seven into 70 or 10 years. The money has had a half life of 10 years except for the fact\n\n51:13.360 --> 51:21.920\n that in weak societies in Argentina or the like, the half life of the money is three to four years\n\n51:21.920 --> 51:30.080\n in Venezuela, one year. So the United States dollar and the United States economic system\n\n51:30.080 --> 51:36.000\n was the most successful economic system in the last hundred years in the world. We won every war.\n\n51:36.000 --> 51:43.280\n We were the world superpower. Our currency lost 99.7% of its value. And that means, horrifically,\n\n51:43.280 --> 51:51.840\n every other currency lost everything. In essence, the other ones were 99.9% except for most that\n\n51:51.840 --> 51:59.680\n were 100% because they all completely failed. And, you know, you've got a mainstream economic\n\n51:59.680 --> 52:09.680\n community, you know, that thinks that inflation is a number and 2% is desirable. It's kind of like,\n\n52:11.360 --> 52:18.000\n you know, remember George Washington? You know how he died? Well meaning physicians bled him to\n\n52:18.000 --> 52:26.160\n death. Okay, the last thing in the world you would want to do to a sick person is bleed them,\n\n52:26.160 --> 52:32.320\n right? In the modern world, I think we understand that oxygen is carried by the blood cells and,\n\n52:32.320 --> 52:42.800\n you know, there's that phrase, right? A triage phrase, what's the first thing you do in an\n\n52:42.800 --> 52:49.120\n injury? Stop the bleeding. Single first thing, right? You show up after any accident, I look at\n\n52:49.120 --> 52:54.160\n you, stop the bleeding because you're going to be dead in a matter of minutes if you bleed out.\n\n52:54.960 --> 53:01.920\n So it strikes me as being ironic that orthodox conventional wisdom was bleed the patient to\n\n53:01.920 --> 53:07.600\n death. And this was the most important patient in the country, maybe in the history of the country,\n\n53:07.600 --> 53:14.320\n and we bled him to death trying to help him. So when you're actually inflating the money supply\n\n53:14.320 --> 53:21.360\n at 7% but you're calling it 2% because you want to help the economy, you're literally bleeding\n\n53:22.160 --> 53:28.800\n the free market to death. But the sad fact is George Washington went along with it because he\n\n53:28.800 --> 53:35.840\n thought that they were going to do him good. And the majority of the people who were in the\n\n53:35.840 --> 53:45.040\n majority of the society, most companies, most conventional thinkers, you know, the working class,\n\n53:45.040 --> 53:50.560\n they go along with this because they think that someone has their best interest of mind and the\n\n53:50.560 --> 53:57.440\n people that are bleeding them to death believe that prescription because their mental models\n\n53:57.440 --> 54:06.960\n are just so defective. And then an understanding of energy and engineering and the economics that\n\n54:06.960 --> 54:13.680\n are at play is crippled by these mental models. But that's both the bug in the future of human\n\n54:13.680 --> 54:22.320\n civilization that ideas take hold, they unite us, we believe in them, and we make a lot of cool stuff\n\n54:22.320 --> 54:31.200\n happen by, as an average, sort of just the fact of the matter, a lot of people believe the same\n\n54:31.200 --> 54:36.240\n thing, they get together and they get some shit done because they believe that thing. And then\n\n54:36.240 --> 54:43.200\n some ideas can be really bad and really destructive, but on average the ideas seem to be progressing\n\n54:43.840 --> 54:49.840\n in a direction of good. Let me just step back. What the hell are we doing here, us humans on\n\n54:49.840 --> 54:56.480\n this earth? How do you think of humans? How special are humans? How did human civilization\n\n54:57.040 --> 55:01.760\n originate on this earth? And what is this human project that we're all taking on?\n\n55:03.040 --> 55:08.480\n You mentioned fire and water and apparently bleeding you to death is not a good idea.\n\n55:08.480 --> 55:13.120\n I always thought you can get the demons out in that way, but that was a recent\n\n55:13.120 --> 55:23.440\n invention. So what's this thing we're doing here? I think what distinguishes human beings from\n\n55:23.440 --> 55:31.680\n all the other creatures on the earth is our ability to engineer. We're engineers, right?\n\n55:31.680 --> 55:37.280\n To solve problems or just build incredible cool things?\n\n55:37.280 --> 55:43.200\n Engineering, harnessing energy and technique to make the world a better place than you found it.\n\n55:45.200 --> 55:52.000\n Right? From the point that we actually started to play with fire, right? That was a big leap forward.\n\n55:53.520 --> 56:01.440\n Harnessing the power of kinetic energy and missiles, another step forward. Every city\n\n56:01.440 --> 56:10.800\n built on water. Why water? Well, water is bringing energy, right? If you actually put a turbine\n\n56:11.360 --> 56:17.840\n on a river or you capture a change in elevation of water, you've literally harnessed gravitational\n\n56:17.840 --> 56:26.080\n energy. But water is also bringing you food. It's also giving you a cheap form of getting\n\n56:26.080 --> 56:31.680\n rid of your waste. It's also giving you free transportation. You want to move one ton blocks\n\n56:31.680 --> 56:38.080\n around. You want to move them in water. So I think, I mean, the human story is really the\n\n56:38.080 --> 56:48.240\n story of engineering a better world. And the rise in the human condition is determined by those\n\n56:49.120 --> 56:53.280\n groups of people, those civilizations that were best at harnessing energy.\n\n56:53.280 --> 57:01.600\n Right? If you look at the Greek civilization, they built it around ports and seaports and\n\n57:02.320 --> 57:07.840\n water and created a trading network. The Romans were really good at harnessing all sorts of\n\n57:08.880 --> 57:14.000\n engineering. I mean, the aqueducts are a great example. If you go to any big city,\n\n57:14.720 --> 57:19.760\n you travel through cities in the Med, you find that the carrying capacity of the city or the\n\n57:19.760 --> 57:25.120\n island is 5,000 people without running water. And then if you can find a way to bring water to it,\n\n57:25.120 --> 57:31.840\n it increases by a factor of 10. And so human flourishing is really only possible through\n\n57:31.840 --> 57:41.360\n that channeling of energy, right? That eventually takes the form of air power, right? I mean,\n\n57:42.720 --> 57:49.120\n that ship, I mean, look at the intricacy of those sails. I mean, it's just the model is intricate.\n\n57:49.120 --> 57:53.680\n Now think about all of the experimentation that took place to figure out how many sails to put\n\n57:53.680 --> 57:58.640\n on that ship and how to rig them and how to repair them and how to operate them.\n\n57:59.840 --> 58:05.520\n There's thousands of lives spent thinking through all the tiny little details,\n\n58:06.640 --> 58:12.000\n all to increase the efficiency of this, the effectiveness, the efficiency of this ship\n\n58:12.560 --> 58:17.120\n as it sails to water. And we should also note there's a bunch of cannons on the side.\n\n58:17.120 --> 58:23.520\n So obviously another form of engineering, right? Energy harnessing with explosives\n\n58:23.520 --> 58:28.720\n to achieve what end? That's another discussion. Exactly. Suppose we're trying to get off the\n\n58:28.720 --> 58:33.680\n planet, right? I mean, well, there's a selection mechanism going on. So natural selection,\n\n58:33.680 --> 58:39.280\n this, whatever, however evolution works, it seems that one of the interesting inventions on earth\n\n58:39.280 --> 58:43.760\n was the predator prey dynamic that you want to be the bigger fish.\n\n58:43.760 --> 58:48.720\n That violence seems to serve a useful purpose. If you look at earth as a whole,\n\n58:48.720 --> 58:55.200\n we as humans now like to think of violence is really a bad thing. It seems to be one of the\n\n58:55.920 --> 59:01.760\n amazing things about humans is we're ultimately tend towards cooperation. We want to, we like peace.\n\n59:03.440 --> 59:08.160\n If you just look at history, we want things to be nice and calm and\n\n59:08.160 --> 59:16.080\n calm. But just wars break out every once in a while and lead to immense suffering\n\n59:16.080 --> 59:23.120\n and destruction and so on. And they have a kind of like resetting the palette\n\n59:25.040 --> 59:32.800\n effect. It's one that's full of just immeasurable human suffering, but it's like a way to start over.\n\n59:32.800 --> 59:39.440\n We're quite the apex predator on the planet. And I Googled something the other day,\n\n59:40.000 --> 59:45.920\n you know, what's the most common form of mammal life on earth?\n\n59:46.640 --> 59:48.640\n By number of organisms?\n\n59:48.640 --> 59:49.120\n Count.\n\n59:49.120 --> 59:49.760\n By count.\n\n59:49.760 --> 59:54.480\n And the answer that came back was human beings. I was shocked. I couldn't believe it, right? It says\n\n59:55.520 --> 59:59.280\n apparently if we're just looking at mammals, the answer was human beings are the most common,\n\n59:59.280 --> 1:00:04.320\n which was very interesting to me. I almost didn't believe it, but I was trying to,\n\n1:00:04.320 --> 1:00:08.800\n you know, eight billion or so human beings. There's no other mammal that's got more than\n\n1:00:08.800 --> 1:00:13.760\n eight billion. If you walk through downtown Edinburgh and Scotland and you look up on this\n\n1:00:13.760 --> 1:00:21.120\n hill and this castle up on the hill, you know, and you talk to people and the story is, oh yeah,\n\n1:00:21.120 --> 1:00:26.480\n well that was a British castle, before it's a Scottish castle, before it was a Pict castle,\n\n1:00:26.480 --> 1:00:31.680\n before it was a Roman castle, before it was, you know, some other Celtic castle.\n\n1:00:32.720 --> 1:00:37.360\n Then they found 13 prehistoric castles buried one under the other under the other.\n\n1:00:38.240 --> 1:00:44.560\n And you get to the conclusion that 100,000 years ago, somebody showed up and grabbed the high\n\n1:00:44.560 --> 1:00:51.280\n point, the apex of the city, and they built a stronghold there, and they flourished,\n\n1:00:51.280 --> 1:00:55.040\n and their family flourished, and their tribe flourished until someone came along and knocked\n\n1:00:55.040 --> 1:01:02.400\n them off the hill. And it's been a nonstop, never ending fight by the the aggressive,\n\n1:01:02.400 --> 1:01:08.560\n most powerful entity, family, organization, municipality, tribe, whatever.\n\n1:01:08.560 --> 1:01:09.760\n All for the hill.\n\n1:01:09.760 --> 1:01:16.000\n For that one hill, going back since time immemorial. And, you know,\n\n1:01:16.960 --> 1:01:23.600\n you scratch your head and you think, it seems like it's like just this never ending.\n\n1:01:23.600 --> 1:01:30.240\n But doesn't that lead, if you just, all kinds of metrics, that seems to improve the quality\n\n1:01:30.240 --> 1:01:36.800\n of our cannons and ships as a result. Like, it seems that war, just like your laser eyes,\n\n1:01:36.800 --> 1:01:39.440\n focuses the mind on the engineering tasks.\n\n1:01:39.440 --> 1:01:47.440\n It is that. And it does remind you that the winner is always the most powerful.\n\n1:01:48.640 --> 1:01:53.120\n And we throw that phrase out, but no one thinks about what that phrase means.\n\n1:01:53.120 --> 1:01:58.240\n Like, who's the most powerful, or the, you know, or the most powerful side one,\n\n1:01:58.240 --> 1:02:04.560\n but they don't think about it. And they think about power, energy delivered in a period of\n\n1:02:04.560 --> 1:02:10.720\n time. And then you think a guy with a spear is more powerful than someone with their fist,\n\n1:02:10.720 --> 1:02:14.400\n and someone with a bow and arrow is more powerful than the person with the spear.\n\n1:02:14.400 --> 1:02:19.040\n And then you realize that somebody with bronze is more powerful than without,\n\n1:02:19.040 --> 1:02:23.920\n and steel is more powerful than bronze. And if you look at the Romans, you know,\n\n1:02:23.920 --> 1:02:28.880\n they persevered, you know, with artillery, and they could stand off from 800 meters and\n\n1:02:28.880 --> 1:02:35.520\n blast you to smithereens. You know, you study the history of the Balearic slingers, right?\n\n1:02:35.520 --> 1:02:40.960\n And, you know, you think we invented bullets, but they invented bullets to put in slings\n\n1:02:40.960 --> 1:02:46.320\n thousands of years ago. They could have stood off 500 meters and put a hole in your head,\n\n1:02:46.320 --> 1:02:58.240\n right? And so there was never a time when humanity wasn't vying to come up with an asymmetric form\n\n1:02:58.240 --> 1:03:01.920\n of projecting their own power via technology.\n\n1:03:01.920 --> 1:03:10.480\n And absolute power is when a leader is able to control a large amount of humans, they're\n\n1:03:10.480 --> 1:03:17.200\n they're facing the same direction, working in the same direction to leverage energy.\n\n1:03:17.200 --> 1:03:19.360\n The most organized society wins.\n\n1:03:20.080 --> 1:03:20.800\n Yeah.\n\n1:03:20.800 --> 1:03:26.160\n When the Romans were dominating everybody, they were the most organized civilization\n\n1:03:26.720 --> 1:03:33.680\n in Europe. And as long as they stayed organized, they dominated, and at some point they overexpanded\n\n1:03:33.680 --> 1:03:39.600\n and got disorganized and they collapsed. And I guess you could say that, you know,\n\n1:03:39.600 --> 1:03:45.680\n the struggle of human condition, it catalyzes the development of new technologies one after\n\n1:03:45.680 --> 1:03:53.600\n the other. It penalizes anybody that rejects ocean power, right, gets penalized. You reject\n\n1:03:53.600 --> 1:03:59.200\n artillery, you get penalized. You reject atomic power, you get penalized. If you reject digital\n\n1:03:59.200 --> 1:04:07.600\n power, cyber power, you get penalized. And the underlying control of the property keeps\n\n1:04:07.600 --> 1:04:14.560\n shifting hands from, you know, one institution or one government to another based upon how\n\n1:04:14.560 --> 1:04:20.400\n rationally they're able to channel that energy and how well organized or coordinated they are.\n\n1:04:20.400 --> 1:04:24.320\n Well, that's a really interesting thing about both the human mind and governments,\n\n1:04:24.880 --> 1:04:28.960\n that they, once they get a few good, and companies, once they get a few good ideas,\n\n1:04:28.960 --> 1:04:35.520\n they seem to stick with them. They reject new ideas. It's almost, whether that's emergent or\n\n1:04:35.520 --> 1:04:42.160\n or however that evolved, it seems to have a really interesting effect because when you're young,\n\n1:04:43.120 --> 1:04:50.720\n you fight for the new ideas. You push them through. Then a few of us humans find success.\n\n1:04:50.720 --> 1:04:58.640\n Then we get complacent. We take over the world using that new idea. And then the new young person\n\n1:04:58.640 --> 1:05:06.320\n with the better new idea challenges you. And you, as opposed to pivoting, you stick with the old\n\n1:05:06.320 --> 1:05:11.280\n and lose because of it. And that's how empires collapse. And it's just both at the individual\n\n1:05:11.280 --> 1:05:15.760\n level that happens when two academics fighting about ideas or something like that, and at the\n\n1:05:16.960 --> 1:05:23.520\n at the human civilization level, governments, they hold on to the ideas of old. It's fascinating.\n\n1:05:23.520 --> 1:05:29.280\n Jay Famiglietti An ever persistent theme in the history of science is the paradigm shift. And\n\n1:05:29.280 --> 1:05:36.720\n the paradigms shift when the old guard dies and a new generation arrives, or the paradigm shifts\n\n1:05:36.720 --> 1:05:44.240\n when there's a war and everyone that disagrees with the idea of aviation finds bombs dropping\n\n1:05:44.240 --> 1:05:49.440\n on their head, or everyone that disagrees with whatever your technology is has a rude awakening.\n\n1:05:49.440 --> 1:05:56.160\n And if they totally disagree, their society collapses, and they're replaced by that new thing.\n\n1:05:56.160 --> 1:05:58.560\n Trey Lockerbie A lot of the engineering you talked\n\n1:05:58.560 --> 1:06:05.680\n about had to do with ships and cannons and leveraging water. What about this whole digital\n\n1:06:05.680 --> 1:06:13.840\n thing that's happening, been happening over the past century? Is that still engineering in your\n\n1:06:13.840 --> 1:06:17.600\n mind? You're starting to operate in these bits of information?\n\n1:06:17.600 --> 1:06:20.640\n Jay Famiglietti I think there's two big ideas.\n\n1:06:21.520 --> 1:06:27.440\n The first wave of ideas were digital information. And that was the internet way been running since\n\n1:06:28.240 --> 1:06:36.240\n 1990 or so for 30 years. And the second wave is digital energy. So if I look at digital information,\n\n1:06:37.920 --> 1:06:44.560\n this idea that we want to digitally transform a book, I'm going to dematerialize every book\n\n1:06:44.560 --> 1:06:52.400\n in this room into bits. And then I'm going to deliver a copy of the entire library to a billion\n\n1:06:52.400 --> 1:07:00.720\n people. And I'm going to do it for pretty much de minimis electricity. If I can dematerialize music,\n\n1:07:01.520 --> 1:07:13.920\n books, education, entertainment, maps, that is an incredibly exothermic transaction. It\n\n1:07:13.920 --> 1:07:19.280\n gives... It's a crystallization when we collapse into a lower energy state as a civilization and\n\n1:07:19.280 --> 1:07:25.200\n we give off massive amounts of energy. If you look at what Carnegie did, the richest man in the world\n\n1:07:25.200 --> 1:07:30.720\n created libraries everywhere at the time, and he gave away his entire fortune. And now we can give\n\n1:07:30.720 --> 1:07:36.960\n a better library to every six year old for nothing. And so what's the value of giving a\n\n1:07:36.960 --> 1:07:44.480\n million books to eight billion people? That's the explosion in prosperity that comes from\n\n1:07:44.480 --> 1:07:52.400\n digital transformation. And when we do it with maps, I transform the map, I put it into a car,\n\n1:07:52.400 --> 1:07:58.080\n you get in the car and the car drives you where you want to go with the map. And how much better\n\n1:07:58.080 --> 1:08:06.320\n is that than a Rand McNally Atlas right here? It's like a million times better. So the first wave of\n\n1:08:06.320 --> 1:08:13.760\n digital transformation was the dematerialization of all of these informational things which are\n\n1:08:13.760 --> 1:08:20.000\n non conservative. I could take Beethoven's Fifth Symphony, played for by the best orchestra in\n\n1:08:20.000 --> 1:08:25.680\n Germany, and I could give it to a billion people and they could play it a thousand times each\n\n1:08:26.560 --> 1:08:33.680\n at less than the cost of the one performance. So I deliver culture and education and erudition and\n\n1:08:33.680 --> 1:08:40.560\n intelligence and insight to the entire civilization over digital rails. And the consequences of the\n\n1:08:40.560 --> 1:08:47.200\n human race are first order, generally good, right? The world is a better place, it drives growth,\n\n1:08:47.200 --> 1:08:52.560\n and you create these trillion dollar entities like Apple and Amazon and Facebook and Google\n\n1:08:52.560 --> 1:08:57.680\n and Microsoft, right? That is the first wave. The second wave...\n\n1:08:57.680 --> 1:09:06.880\n I'm sorry to interrupt, but that first wave, it feels like the impact that's positive,\n\n1:09:07.680 --> 1:09:12.240\n you said the first order impact is generally positive. It feels like it's positive in a way\n\n1:09:12.240 --> 1:09:20.320\n that nothing else in history has been positive. And then we may not actually truly be able to\n\n1:09:20.320 --> 1:09:28.960\n understand the orders and magnitude of increase in productivity and just progress of human\n\n1:09:28.960 --> 1:09:36.080\n civilization until we look back centuries from now. It just feels, or maybe, just looking at\n\n1:09:36.080 --> 1:09:46.160\n the impact of Wikipedia, giving access to basic wisdom or basic knowledge and then perhaps wisdom\n\n1:09:46.160 --> 1:09:51.920\n to billions of people. If you can just linger on that for a second, what's your sense of the\n\n1:09:51.920 --> 1:10:01.120\n impact of that? You know, I would say if you're a technologist philosopher,\n\n1:10:03.600 --> 1:10:09.920\n the impact of a technology is so much greater on the civilization and the human condition\n\n1:10:09.920 --> 1:10:15.920\n than a non technology that is almost not worth your trouble to bother trying to fix things that\n\n1:10:15.920 --> 1:10:23.680\n conventional way. So let's take example. I have a foundation, the Saylor Academy, and the Saylor\n\n1:10:23.680 --> 1:10:30.240\n Academy gives away free education, free college education to anybody on earth that wants it.\n\n1:10:30.880 --> 1:10:36.080\n And we've had more than a million students. And if you go and you take the physics class,\n\n1:10:36.720 --> 1:10:40.560\n the lectures were by the same physics lecturer that taught me physics at MIT.\n\n1:10:40.560 --> 1:10:48.240\n Except when I was at MIT, the cost of the first four weeks of MIT would have drained my family's\n\n1:10:48.240 --> 1:10:54.160\n life, collective life savings for the first last hundred years. Like a hundred years worth of my\n\n1:10:54.160 --> 1:10:58.480\n father, my grandfather, my great grandfather, they saved every penny they had after a hundred\n\n1:10:58.480 --> 1:11:04.160\n years. They could have paid for one week or two weeks of MIT. That's how fiendishly expensive and\n\n1:11:04.160 --> 1:11:11.360\n inefficient it was. So I went on scholarship. I was lucky to have a scholarship. But on the other\n\n1:11:11.360 --> 1:11:18.240\n hand, I sat in the back of the 801 lecture hall and I was like right up in the rafters.\n\n1:11:18.240 --> 1:11:22.720\n It's an awful experience on these like uncomfortable wooden benches and you can\n\n1:11:22.720 --> 1:11:29.360\n barely see the blackboard. And you got to be there synchronously. And the stuff we upload,\n\n1:11:29.360 --> 1:11:34.560\n you can start it and stop it and watch it on your iPad or watch it on your computer\n\n1:11:34.560 --> 1:11:38.640\n and rewind it multiple times and sit in a comfortable chair and you can do it from\n\n1:11:38.640 --> 1:11:44.960\n anywhere on earth and it's absolutely free. So I think about this and I think you want to improve\n\n1:11:44.960 --> 1:11:52.880\n the human condition. You need people with postgraduate level education. You need PhDs.\n\n1:11:52.880 --> 1:11:58.000\n And I know this sounds kind of elitist, but you want to cure cancer and you want to go to the\n\n1:11:58.000 --> 1:12:06.080\n stars, fusion drive. We need new propulsion, right? We need extraordinary breakthroughs\n\n1:12:06.800 --> 1:12:14.640\n in every area of basic science, you know, be it biology or propulsion or material science or\n\n1:12:14.640 --> 1:12:19.280\n computer science. You're not doing that with an undergraduate degree. You're certainly not doing\n\n1:12:19.280 --> 1:12:26.000\n it with a high school education. But the cost of a PhD is like a million bucks. There's like 10\n\n1:12:26.000 --> 1:12:31.680\n million PhDs in the world if you check it out. There's 8 billion people in the world. How many\n\n1:12:31.680 --> 1:12:38.720\n people could get a PhD or would want to? Maybe not 8 billion, but a billion, 500 million. Let's just\n\n1:12:38.720 --> 1:12:46.480\n say 500 million to a billion. How do you go from 10 million to a billion highly educated people,\n\n1:12:46.480 --> 1:12:52.800\n all of them specializing in, and I don't have to tell you how many different fields of human\n\n1:12:52.800 --> 1:12:58.080\n endeavor there are. I mean, your life is interviewing these experts and there's so many,\n\n1:12:59.280 --> 1:13:07.680\n right? You know, it's amazing. So how do I give a multimillion dollar education to a billion people?\n\n1:13:07.680 --> 1:13:14.720\n And there's two choices. You can either endow a scholarship, in which case you pay $75,000 a year.\n\n1:13:14.720 --> 1:13:23.520\n Okay. $75,000. Let's pay a million dollars a person. I can do it that way. And you're never,\n\n1:13:24.320 --> 1:13:30.160\n even if you had a trillion dollars, if you had $10 trillion to throw at the problem,\n\n1:13:30.160 --> 1:13:36.640\n and we've just thrown $10 trillion at certain problems, you don't solve the problem, right?\n\n1:13:36.640 --> 1:13:40.880\n If I put $10 trillion on the table and I said educate everybody, give them all a PhD,\n\n1:13:40.880 --> 1:13:46.320\n you still wouldn't solve the problem. Harvard University can't educate 18,000 people\n\n1:13:47.200 --> 1:13:53.440\n simultaneously, or 87,000, or 800,000, or 8 million. So you have to dematerialize the\n\n1:13:53.440 --> 1:13:58.880\n professor and dematerialize the experience. So you put it all as streaming on demand,\n\n1:13:58.880 --> 1:14:05.600\n computer generated education, and you create simulations where you need to create simulations,\n\n1:14:05.600 --> 1:14:15.360\n and you upload it. It's like the human condition is being held back by 500,000 well meaning\n\n1:14:16.720 --> 1:14:23.440\n average algebra teachers. I love them. I mean, please don't take offense if you're an algebra\n\n1:14:23.440 --> 1:14:30.400\n teacher, but instead of 500,000 algebra teachers going through the same motion over and over again,\n\n1:14:30.400 --> 1:14:37.440\n what you need is like one, or five, or 10 really good algebra teachers, and they need to do it a\n\n1:14:37.440 --> 1:14:45.920\n billion times a day, or a billion times a year for free. And if we do that, there's no reason\n\n1:14:45.920 --> 1:14:53.120\n why you can't give infinite education, certainly in science, technology, engineering, and math,\n\n1:14:53.120 --> 1:15:01.280\n right? Infinite education to everybody with no constraint. And I think the same is true,\n\n1:15:01.280 --> 1:15:06.880\n right? With just about every other thing. If you want to bring joy to the world,\n\n1:15:06.880 --> 1:15:12.160\n you need digital music. If you want to bring enlightenment to the world, you need digital\n\n1:15:12.160 --> 1:15:19.360\n education. If you want to bring anything of consequence in the world, you got to digitally\n\n1:15:19.360 --> 1:15:25.920\n transform it. And then you got to manufacture it something like a hundred times more efficiently\n\n1:15:25.920 --> 1:15:35.040\n as a start, but a million times more efficiently is probably, you know, that's hopeful. Maybe you\n\n1:15:35.040 --> 1:15:40.240\n have a chance. And if you look at all of these space endeavors and everything we're thinking\n\n1:15:40.240 --> 1:15:45.120\n about getting to Mars, getting off the planet, getting to other worlds, number one thing you\n\n1:15:45.120 --> 1:15:50.160\n got to do is you got to make a fundamental breakthrough in an engine. People dreamed\n\n1:15:50.160 --> 1:15:55.040\n about flying for thousands of years, but until the internal combustion engine,\n\n1:15:56.000 --> 1:16:02.320\n you didn't have enough, you know, enough energy, enough power in a light enough package\n\n1:16:03.200 --> 1:16:09.680\n in order to solve the problem. And the human race has all sorts of those fundamental\n\n1:16:09.680 --> 1:16:19.040\n all engines and materials and techniques that we need to master. And each one of them is a lifetime\n\n1:16:19.040 --> 1:16:26.880\n of experimentation of someone capable of making a seminal contribution to the body of human\n\n1:16:26.880 --> 1:16:30.240\n knowledge. There are certain problems like education that could be solved through this\n\n1:16:30.800 --> 1:16:37.520\n process of dematerialization. And by the way, to give props to the 500k algebra teachers,\n\n1:16:37.520 --> 1:16:43.440\n when I look at YouTube, for example, one possible approach is each one of those 500,000 teachers\n\n1:16:43.440 --> 1:16:48.800\n probably had days and moments of brilliance. And if they had the ability to contribute to\n\n1:16:49.280 --> 1:16:56.080\n in the natural selection process, like the market of education, where the best ones rise up, that's\n\n1:16:56.080 --> 1:17:03.200\n a really interesting way, which is like the best day of your life, the best lesson you've ever\n\n1:17:03.200 --> 1:17:13.360\n the best lesson you've ever taught could be found and sort of broadcast to billions of people.\n\n1:17:14.560 --> 1:17:20.880\n So all of those kinds of ideas can be made real in the digital world. Now traveling across planets,\n\n1:17:21.520 --> 1:17:27.680\n you still can't solve that problem with dematerialization. What you could solve\n\n1:17:27.680 --> 1:17:34.480\n potentially is dematerializing the human brain where you can transfer, like you don't need to\n\n1:17:34.480 --> 1:17:40.400\n have astronauts on the ship, you can have a floppy disk carrying a human brain.\n\n1:17:41.040 --> 1:17:47.600\n Touching on those points, you'd love for the 500,000 algebra teachers to become 500,000 math\n\n1:17:47.600 --> 1:17:53.600\n specialists, and maybe they clump into 50,000 specialties as teams, and they all pursue 50,000\n\n1:17:53.600 --> 1:17:59.760\n new problems, and they put their algebra teaching on autopilot. That's the same as when I give you\n\n1:17:59.760 --> 1:18:08.800\n 11 cents worth of electricity and you don't have to row a boat eight hours a day before you can\n\n1:18:08.800 --> 1:18:15.440\n eat. It would be a lot better that you would pay for your food in the first eight seconds of your\n\n1:18:15.440 --> 1:18:23.920\n day and then you could start thinking about other things, right? With regard to technology, one\n\n1:18:23.920 --> 1:18:30.800\n thing that I learned studying technology when you look at S curves is until you start the S curve,\n\n1:18:31.840 --> 1:18:39.040\n you don't know whether you're a hundred years from viability, a thousand years from viability,\n\n1:18:39.040 --> 1:18:47.200\n or a few months from viability. Isn't that fun? That's so fun. The early part of the S curve is\n\n1:18:47.200 --> 1:18:55.040\n so fun because you don't know. In 1900, you could have got any number of learned academics to give\n\n1:18:55.040 --> 1:19:01.200\n you 10,000 reasons why humans will never fly, right? And in 1903, the Wright brothers flew,\n\n1:19:01.200 --> 1:19:09.600\n and by 1969, we're walking on the moon. So the advance that we made in that field was extraordinary,\n\n1:19:09.600 --> 1:19:14.320\n but for the hundred years and 200 years before, they were just back and forth and nobody was\n\n1:19:14.320 --> 1:19:23.440\n close. And that's the happy part. The happy part is we went from flying 20 miles an hour or whatever\n\n1:19:23.440 --> 1:19:33.360\n to flying 25,000 miles an hour in 66 years. The unhappy part is I studied aeronautical\n\n1:19:33.360 --> 1:19:41.280\n engineering at MIT in the 80s. And in the 80s, we had Gulfstream aircraft, we had Boeing 737s,\n\n1:19:41.280 --> 1:19:48.160\n we had the Space Shuttle. And you fast forward 40 years and we pretty much had the same exact\n\n1:19:48.160 --> 1:19:59.440\n aircraft. The efficiency of the engines was 20, 30% more. We slammed into a brick wall around\n\n1:19:59.440 --> 1:20:10.320\n 69 to 75. In fact, the Global Express, the Gulfstream, these were all engineered in the 70s,\n\n1:20:10.320 --> 1:20:19.200\n some in the 60s. The fuselage silhouette of a Gulfstream of a G5 was the same shape as a G4,\n\n1:20:19.200 --> 1:20:24.480\n is the same shape as a G3, is the same shape as a G2. And that's because they were afraid to change\n\n1:20:24.480 --> 1:20:28.560\n the shape for 40 years because they worked it out in a wind tunnel, they knew it worked.\n\n1:20:29.280 --> 1:20:36.240\n And when they finally decided to change the shape, it was like a $10 billion exercise with modern\n\n1:20:36.240 --> 1:20:44.880\n supercomputers and computational fluid dynamics. Why was it so hard? What is that wall made of\n\n1:20:44.880 --> 1:20:49.440\n that you slammed into? The right question is, so why does a guy that went to MIT that got an\n\n1:20:49.440 --> 1:20:54.800\n aeronautical engineering degree spend his career in software? Why is it that I never a day in my\n\n1:20:54.800 --> 1:21:00.720\n life, with the exception of some Air Force Reserve work, I never got paid to be an aeronautical\n\n1:21:00.720 --> 1:21:04.800\n engineer and I worked in software engineering my entire career. Maybe software engineering\n\n1:21:04.800 --> 1:21:11.520\n is the new aeronautical engineering in some way. Maybe you hit fundamental walls uncertain\n\n1:21:12.160 --> 1:21:16.560\n until you have to return to it centuries later. Or no.\n\n1:21:16.560 --> 1:21:21.200\n STUART The National Gallery of Art was endowed by a very rich man,\n\n1:21:22.240 --> 1:21:29.360\n Andrew Mellon. And you know how he made his money? Aluminum. Okay? And so,\n\n1:21:29.360 --> 1:21:36.240\n and you know what kind of airplanes you can create without aluminum? Nothing. Nothing, right?\n\n1:21:36.240 --> 1:21:38.320\n LARRY So it's a materials problem.\n\n1:21:38.320 --> 1:21:46.000\n STUART Okay, so 1900, we made massive advances in metallurgy, right? I mean, that was US steel,\n\n1:21:46.000 --> 1:21:52.640\n that was iron to steel, aluminum, massive fortunes were created because this was a massive technical\n\n1:21:52.640 --> 1:21:58.080\n advance. And then we also had the internal combustion engine and, you know, the story of Ford\n\n1:21:58.080 --> 1:22:04.720\n and General Motors and Daimler Chrysler and the like is informed by that. So you have no jet\n\n1:22:04.720 --> 1:22:10.320\n engines, no rocket motors, no internal combustion engines, you have no aviation. But even if you had\n\n1:22:10.320 --> 1:22:15.760\n those engines, if you were trying to build those things with steel, no chance. You had to have\n\n1:22:15.760 --> 1:22:23.120\n aluminum. So there's like two pretty basic technologies. And once you have those two\n\n1:22:23.120 --> 1:22:32.480\n technologies, stuff happens very fast. So tell me the last big advance in like jet engines,\n\n1:22:33.200 --> 1:22:39.520\n there hasn't been one. Like the last big advance in rocket engines, hasn't been one. The big\n\n1:22:39.520 --> 1:22:45.760\n advances in spaceship design from what I can see are in the control systems, the gyros and the\n\n1:22:45.760 --> 1:22:53.360\n ability to land, right, in a stable fashion. That's pretty amazing, landing a rocket. Also in the,\n\n1:22:54.480 --> 1:23:03.120\n at least according to Elon and so on, the manufacture of the more efficient and less\n\n1:23:03.120 --> 1:23:07.760\n expensive manufacture of rockets. So like it's a production, whatever that you call that\n\n1:23:07.760 --> 1:23:13.360\n discipline of at scale manufacture, at scale production, so factory work. But it's not 10X.\n\n1:23:13.360 --> 1:23:16.320\n I mean, maybe it's 10X over a period of a few decades.\n\n1:23:16.320 --> 1:23:23.600\n When we figure out how to operate a spaceship, you know, on the water in your water bottle for\n\n1:23:23.600 --> 1:23:29.040\n a year, right? Now, then you've got to break through. So the bottom line is propulsion,\n\n1:23:29.840 --> 1:23:36.720\n propellant, propulsion technology, propellants and the materials technology, they were critical\n\n1:23:36.720 --> 1:23:42.960\n to getting on that aviation S curve. And then we slammed into a wall. And then we had to\n\n1:23:42.960 --> 1:23:51.520\n switch to a new S curve in the 70s. And the Boeing 747, the Global Express, the Gulf Stream,\n\n1:23:51.520 --> 1:23:56.400\n these things were, the Space Shuttle, they were all pretty much reflective of that. And then we\n\n1:23:56.400 --> 1:24:02.000\n kind of, then we stopped. And at that point, you have to switch to a new S curve. So the next\n\n1:24:02.800 --> 1:24:08.640\n equivalent to the internal combustion engine was the CPU. And the next aluminum equipment was\n\n1:24:08.640 --> 1:24:14.800\n the S curve. And then we actually started developing CPUs. The transistor gave way to CPUs.\n\n1:24:14.800 --> 1:24:21.920\n And if you look at the power, right, the bandwidth that we had on computers and Moore's law, right?\n\n1:24:22.480 --> 1:24:31.040\n What if the efficiency of jet engines had doubled every three years, right, in the last 40 years,\n\n1:24:31.040 --> 1:24:38.240\n where we'd be right now, right? So I think that if you're a business person, if you're looking for\n\n1:24:38.240 --> 1:24:45.040\n a real application of your mind, then you have to find that S curve. And ideally,\n\n1:24:46.800 --> 1:24:53.200\n you have to find it in the first five, six, 10 years. But people always miss this. Let's take\n\n1:24:53.200 --> 1:25:02.080\n Google Glass, right? Google Glass was an idea in 2013. The year is 2022. And people were quite sure\n\n1:25:02.080 --> 1:25:06.960\n this was going to be a big thing. And it could have been at the beginning of the S curve.\n\n1:25:06.960 --> 1:25:12.720\n But fundamentally, we didn't really have an effective mechanism. I mean, people getting\n\n1:25:12.720 --> 1:25:17.680\n vertigo and they're, you know. But you didn't know that at the beginning of the S curve, right? I mean,\n\n1:25:17.680 --> 1:25:23.520\n maybe some people had a deep intuition about the fundamentals of augmented reality. But you don't\n\n1:25:23.520 --> 1:25:29.280\n know that. You don't have those, you're looking through the fog. You don't know. So the point is,\n\n1:25:29.280 --> 1:25:37.520\n we're year zero in 2013. And we're still year zero in 2022 on that augmented reality. And when\n\n1:25:37.520 --> 1:25:43.920\n somebody puts out a set of glasses that you can wear comfortably without getting vertigo,\n\n1:25:44.720 --> 1:25:51.600\n right? Without any disorientation that managed to have the stability and the bandwidth necessary to\n\n1:25:51.600 --> 1:25:58.800\n sync with the real world, you'll be in year one. And from that point, you'll have a 70 year or\n\n1:25:58.800 --> 1:26:05.520\n some interesting future until you slam into a limit to growth. And then it'll slow down.\n\n1:26:06.320 --> 1:26:13.120\n And this is the story of a lot of things, right? I mean, John D. Rockefeller got in the oil business\n\n1:26:13.120 --> 1:26:24.240\n in the 1860s. And the oil business, as we understood it, became fairly mature by the 1920s,\n\n1:26:24.240 --> 1:26:29.760\n the 30s. And then it actually stayed that way until we got to fracking, which was like seven\n\n1:26:29.760 --> 1:26:34.960\n years later, and then it burst forward. So... The interesting story about Moore's law, though,\n\n1:26:34.960 --> 1:26:41.920\n is that you get this constant burst of S curves on top of S curves on top of S curve. It's like\n\n1:26:41.920 --> 1:26:48.480\n the moment you start slowing down, or almost ahead of you slowing down, you come up with another\n\n1:26:48.480 --> 1:26:52.560\n innovation, another innovation. So Moore's law doesn't seem to happen in every\n\n1:26:52.560 --> 1:26:58.880\n technological advancement. It seems like you only get a couple of S curves and then you're done\n\n1:26:58.880 --> 1:27:04.560\n for a bit. So I wonder what the pressures there are that resulted in such success over several\n\n1:27:04.560 --> 1:27:12.560\n decades and still going. Humility dictates that nobody knows when the S curve kicks off,\n\n1:27:12.560 --> 1:27:20.000\n and you could be 20 years early or 100 years early. Leonardo da Vinci, you know,\n\n1:27:20.000 --> 1:27:25.520\n they were... Michelangelo, they were designing flying machines hundreds and hundreds of years ago.\n\n1:27:25.520 --> 1:27:30.560\n So humility says you're not quite sure when you really hit that commercial viability,\n\n1:27:30.560 --> 1:27:36.800\n and it also dictates you don't know when it ends. Like, when will the party stop? When will\n\n1:27:36.800 --> 1:27:41.760\n Moore's law stop and we'll get to the point where they're exponentially diminishing returns on\n\n1:27:42.320 --> 1:27:48.560\n silicon performance? And when you... Just like we got exponentially diminishing returns on jet\n\n1:27:48.560 --> 1:27:55.920\n engines, you know, and it just takes an exponential increase in effort to make it 10% better.\n\n1:27:56.480 --> 1:28:02.000\n But while you're in the middle of it, then you know you can do things. So the reason that the\n\n1:28:02.000 --> 1:28:09.920\n digital revolution is so important is because the underlying platforms, the bandwidth of and the\n\n1:28:09.920 --> 1:28:17.280\n performance of the components, and I say the components are the radio protocols, mobile\n\n1:28:17.280 --> 1:28:26.880\n protocols, the batteries, the CPUs, and the displays, right? Those four components are\n\n1:28:26.880 --> 1:28:31.440\n pretty critical. They're all critical in the creation of an iPhone. I wrote about it in the\n\n1:28:31.440 --> 1:28:38.880\n book, The Mobile Wave, and they catalyzed this entire mobile revolution. Because they have\n\n1:28:38.880 --> 1:28:46.320\n advanced and continue to advance, they created the very fertile environment for all these digital\n\n1:28:46.320 --> 1:28:56.080\n transformations. And the digital transformations themselves, right? They call for creativity in\n\n1:28:56.080 --> 1:29:03.120\n their own, right? Like, I think the interesting thing about... Let's take digital maps, right? When\n\n1:29:03.120 --> 1:29:11.200\n you conceptualize something as a dematerialized map, right? It becomes a map because I can put it\n\n1:29:11.200 --> 1:29:18.400\n on a display, like an iPad, or I can put it in a car, like a Tesla. But if you really want to\n\n1:29:18.400 --> 1:29:23.440\n figure it out, you can't think like an engineer. You need to think like a fantasy writer. Like,\n\n1:29:23.440 --> 1:29:28.560\n this is where it's useful if you studied... If you read... Played Dungeons and Dragons, and you read\n\n1:29:28.560 --> 1:29:36.080\n Lord of the Rings, and you studied all the fantasy literature. Because when I dematerialize the map,\n\n1:29:36.080 --> 1:29:43.040\n first I put 10 million pages of satellite imagery into the map, right? That's a simple physical\n\n1:29:43.040 --> 1:29:50.320\n transform. But then I start to put telemetry into the map, and I keep track of the traffic\n\n1:29:50.320 --> 1:29:54.560\n rates on the roads. And I tell you whether you'll be in a traffic jam if you drive that way, and I\n\n1:29:54.560 --> 1:29:58.960\n tell you which way to drive. And then I start to get feedback on where you're going, and I tell\n\n1:29:58.960 --> 1:30:05.040\n you the restaurants closed, and people don't like it anyway. And then I put an AI on the map, and\n\n1:30:05.040 --> 1:30:12.720\n then I put an AI on top of it, and I have it drive your car for you. And eventually, the implication\n\n1:30:12.720 --> 1:30:17.680\n of digital transformation of maps is, I get in a self driving car, and I say, take me someplace\n\n1:30:17.680 --> 1:30:27.360\n cool where I can eat. And how did you get to that last step, right? It wasn't simple engineering.\n\n1:30:27.360 --> 1:30:33.280\n There's a bit of fantasy in there, a bit of magic. Design, art, whatever the heck you call it.\n\n1:30:33.280 --> 1:30:39.600\n It's whatever, yeah, fantasy injects magic into the engineering process. Imagination\n\n1:30:41.760 --> 1:30:50.480\n precedes great revolutions in engineering. It's like imagining a world of what you can do with\n\n1:30:50.480 --> 1:30:54.400\n the display. How will the interaction be? That's where Google Glass actually came in, augmented\n\n1:30:54.400 --> 1:30:59.840\n reality, virtual reality. People were playing in the space of sci fi, imagination.\n\n1:30:59.840 --> 1:31:03.840\n They called a moonshot. They tried. It didn't work, but to their credit, they stopped trying,\n\n1:31:03.840 --> 1:31:10.000\n right? And then there's new people. They keep dreaming. Dreamers all around us. I love those\n\n1:31:10.000 --> 1:31:16.800\n dreamers, and most of them fail and suffer because of it. But some of them win Nobel prizes or become\n\n1:31:16.800 --> 1:31:24.480\n billionaires. Well, what I would say is, if half the civilization dropped what they were doing\n\n1:31:24.480 --> 1:31:32.320\n tomorrow and eagerly started working on launching a rocket to Alpha Centauri,\n\n1:31:34.000 --> 1:31:41.360\n it might not be the best use of our resources because it's kind of like if half of Athens\n\n1:31:41.360 --> 1:31:47.200\n in the year 500 BC eagerly started working on flying machines. If you went back and you said,\n\n1:31:47.200 --> 1:31:52.000\n what advice would you give them? You would say, you know, it's not going to work till you get to\n\n1:31:52.000 --> 1:31:56.800\n aluminum. And you're not going to get to aluminum until you work out the steel and certain other\n\n1:31:56.800 --> 1:32:01.280\n things. And you're not going to get to that until you work out the calculus of variations and some\n\n1:32:01.280 --> 1:32:05.920\n metallurgy. And there's a dude, Newton, that won't come along for quite a while, and he's going to\n\n1:32:05.920 --> 1:32:11.520\n give you the calculus to do it. And until then, it's hopeless. So you might be better off to work\n\n1:32:11.520 --> 1:32:18.640\n on the aqueduct or to focus upon sails or something. So if I look at this today, I say,\n\n1:32:18.640 --> 1:32:25.280\n there's massive, profound civilization advances to be made through digital transformation of\n\n1:32:25.280 --> 1:32:31.040\n information. And you can see them like that. This is the story of today. This is not the story of\n\n1:32:31.040 --> 1:32:36.400\n today, right? It's 10 years old, what we've been seeing. We're living through different manifestations\n\n1:32:36.400 --> 1:32:42.960\n of that story today, too, though. Like social media, the effects of that is very interesting\n\n1:32:42.960 --> 1:32:49.760\n because ideas spread even, you talk about velocity of money, the velocity of ideas keeps increasing.\n\n1:32:49.760 --> 1:33:00.560\n So like Wikipedia is a passive store. It's a store of knowledge. Twitter is like a water hose\n\n1:33:00.560 --> 1:33:04.240\n or something. It's like spraying you with knowledge, whether you want it or not. It's like\n\n1:33:04.240 --> 1:33:10.800\n social media is just like this explosion of ideas. And then we pick them up, and then we\n\n1:33:10.800 --> 1:33:16.400\n pick them up. And then we try to understand ourselves because the drama of it also plays\n\n1:33:16.400 --> 1:33:22.800\n with our human psyche. So sometimes there's more ability for misinformation, for propaganda to take\n\n1:33:22.800 --> 1:33:27.760\n hold. So we get to learn about ourselves. We get to learn about the technology that can decelerate\n\n1:33:27.760 --> 1:33:32.320\n the propaganda, for example, all that kind of stuff. But like the reality is we're living,\n\n1:33:32.320 --> 1:33:38.880\n I feel like we're living through a singularity in the digital information space. And we're not,\n\n1:33:38.880 --> 1:33:43.120\n we don't have a great understanding of exactly how it's transforming our lives.\n\n1:33:43.760 --> 1:33:52.480\n This is where money is useful as a metaphor for significance, because if money is the economic\n\n1:33:52.480 --> 1:34:00.080\n energy of the civilization, then something that's extraordinarily lucrative that's going to generate\n\n1:34:00.080 --> 1:34:05.440\n a monetary or a wealth increase is a way to increase the net energy in the civilization.\n\n1:34:05.440 --> 1:34:10.080\n And ultimately, if we had 10 times as much of everything, we'd have a lot more\n\n1:34:11.520 --> 1:34:16.560\n free resources to pursue all of our advanced scientific and mathematical and theoretical\n\n1:34:16.560 --> 1:34:20.880\n endeavors. So let's take Twitter. Twitter is something that could be 10 times more\n\n1:34:20.880 --> 1:34:26.000\n valuable than it is. Twitter could be made 10 times better.\n\n1:34:27.040 --> 1:34:29.680\n No, by the way, I should say that people should follow you on Twitter. Your Twitter\n\n1:34:29.680 --> 1:34:33.920\n account is awesome. Thank you. It could be made 10 times better. Yeah.\n\n1:34:33.920 --> 1:34:40.640\n Yeah. Twitter can be made 10 times better. If we take YouTube or take education,\n\n1:34:42.320 --> 1:34:48.160\n we could generate a billion PhDs. And the question is, do you need any profound\n\n1:34:48.800 --> 1:34:52.800\n breakthrough in materials or technology to do that? And the answer is not really.\n\n1:34:53.840 --> 1:35:00.160\n So if you want to, you could make Apple, Amazon, Facebook, Google, Twitter, all these things\n\n1:35:00.160 --> 1:35:08.080\n better. The United States government, if they took 1% of the money they spend on the Department\n\n1:35:08.080 --> 1:35:15.920\n of Education and they simply poured it into digital education and they gave degrees to\n\n1:35:15.920 --> 1:35:22.400\n people that actually met those requirements, they could provide 100x as much education for\n\n1:35:22.400 --> 1:35:28.720\n one one hundredth of the cost and they could do it with no new technology. That's a marketing\n\n1:35:28.720 --> 1:35:35.920\n and political challenge. So I don't think every objective is equally practical.\n\n1:35:36.640 --> 1:35:44.080\n And I think the benefit of being an engineer or thinking about practical achievements is\n\n1:35:45.200 --> 1:35:52.400\n when the government pursues an impractical objective or when anybody, an entrepreneur,\n\n1:35:53.120 --> 1:35:55.760\n not so bad with entrepreneur because they don't have that much money to waste,\n\n1:35:55.760 --> 1:36:00.480\n when a government pursues an impractical objective, they squander trillions and trillions\n\n1:36:00.480 --> 1:36:07.920\n of dollars and achieve nothing. Whereas if they pursue a practical objective or if they simply\n\n1:36:07.920 --> 1:36:15.040\n get out of the way and do nothing and they allow the free market to pursue the practical objectives,\n\n1:36:15.040 --> 1:36:19.040\n then I think you can have a profound impact on the human civilization.\n\n1:36:19.040 --> 1:36:31.440\n And if I look at the world we're in today, I think that there are multi trillion, 10, 20,\n\n1:36:31.440 --> 1:36:38.560\n 50 trillion dollars worth of opportunities in the digital information realm yet to be obtained.\n\n1:36:40.800 --> 1:36:47.520\n But there's hundreds of trillions of dollars of opportunities in the digital energy realm\n\n1:36:47.520 --> 1:36:54.640\n that not only are they not obtained, the majority of people don't even know what digital energy is.\n\n1:36:54.640 --> 1:37:00.960\n Most of them would reject the concept. They're not looking for it. They're not expecting to find it.\n\n1:37:00.960 --> 1:37:06.800\n It's inconceivable because it is a paradigm shift. But in fact, it's completely practical.\n\n1:37:07.280 --> 1:37:13.840\n Right under our nose, it's staring at us and it could make the entire civilization\n\n1:37:13.840 --> 1:37:18.880\n work dramatically better in every respect.\n\n1:37:18.880 --> 1:37:26.400\n So you mentioned in the digital world, digital information is one, digital energy is two,\n\n1:37:26.960 --> 1:37:34.240\n and the possible impact on the world and the set of opportunities available in the digital energy\n\n1:37:34.240 --> 1:37:39.680\n space is much greater. So how do you think about digital energy? What is it?\n\n1:37:39.680 --> 1:37:44.960\n So I'll start with Tesla. He had a very famous quote. He said, if you want to understand the\n\n1:37:44.960 --> 1:37:52.960\n universe, think in terms of energy, vibration, and frequency. And it gets you thinking about\n\n1:37:52.960 --> 1:37:58.320\n what is the universe? And of course, the universe is just all energy. And then what is matter?\n\n1:37:58.880 --> 1:38:06.880\n Matter is low frequency energy. And what are we? You know, we're vibrating, you know, ashes to ashes,\n\n1:38:06.880 --> 1:38:16.000\n dust to dust. I can turn a tree into light. I can turn light back into a tree. If I consider\n\n1:38:16.000 --> 1:38:20.640\n the entire universe, and it's very important because we don't really think this way. Let's\n\n1:38:20.640 --> 1:38:29.120\n take the New York disco model. If I walk into a nightclub and there's loud music blaring in\n\n1:38:29.120 --> 1:38:37.520\n New York City, what's really going on there, right? If you blast out 15, 14 billion years ago,\n\n1:38:37.520 --> 1:38:43.200\n the universe is formed. Okay, that's a low frequency thing. The universe formed a billion\n\n1:38:43.200 --> 1:38:50.240\n years ago, the sun, maybe the earth, or form. The continents are 400 million years old. The schist\n\n1:38:50.240 --> 1:38:55.520\n that New York City is on is some hundreds of millions of years. But the Hudson River is only\n\n1:38:55.520 --> 1:39:02.960\n 20,000 years. There's a building that's probably 50 years old. There's a company operating that\n\n1:39:02.960 --> 1:39:09.680\n disco or that club, which is five to 10 years old. There's a person, a customer walking in there\n\n1:39:09.680 --> 1:39:17.760\n for an experience for a few hours. There's music that's oscillating at some kilohertz. And then\n\n1:39:17.760 --> 1:39:26.400\n there's light. And you have all forms of energy, all frequencies, all layered, all moving through\n\n1:39:26.400 --> 1:39:33.520\n different medium. And how you perceive the world is the question of at what frequency do you want\n\n1:39:33.520 --> 1:39:44.480\n to perceive the world. And I think that once you start to think that way, you're catalyzed to think\n\n1:39:44.480 --> 1:39:53.120\n about what would digital energy look like? And why would I want it? And what is it? So\n\n1:39:54.560 --> 1:40:00.160\n why don't we just start right there? What is it? The most famous manifestation of digital energy\n\n1:40:00.160 --> 1:40:06.560\n is Bitcoin. Bitcoin is a crypto asset. It's a crypto asset that has monetary value.\n\n1:40:06.560 --> 1:40:17.200\n Can we just link on that? Bitcoin is a digital asset that has monetary value.\n\n1:40:18.480 --> 1:40:23.920\n What is a digital asset? What is monetary? Why use those terms versus the words of\n\n1:40:23.920 --> 1:40:29.760\n money and currency? Is there something interesting in that disambiguation of different terms?\n\n1:40:29.760 --> 1:40:39.760\n I'd call it a crypto asset network. The goal is to create a billion dollar block of pure energy\n\n1:40:39.760 --> 1:40:47.840\n in cyberspace. One that I could then move with no friction at the speed of light.\n\n1:40:49.440 --> 1:40:56.320\n It's the equivalent to putting a million pounds in orbit. How do I actually launch\n\n1:40:56.320 --> 1:41:02.160\n something into orbit? How do I launch something into cyberspace such that it moves friction free?\n\n1:41:02.160 --> 1:41:10.160\n And the solution is a decentralized proof of work network. Satoshi's solution was,\n\n1:41:10.880 --> 1:41:17.280\n I'm going to establish a protocol running on a distributed set of computers that will maintain\n\n1:41:17.280 --> 1:41:24.800\n a constant supply of never more than 21 million Bitcoin subdividable by 100 million Satoshis each.\n\n1:41:24.800 --> 1:41:41.120\n Transferable via transferring private keys. Now, the innovation is to create that in an ethical,\n\n1:41:42.320 --> 1:41:49.280\n durable fashion. The ethical innovation is I want it to be property and not a security.\n\n1:41:49.280 --> 1:41:58.400\n A bushel of corn, an acre of land, a stack of lumber and a bar of gold and a Bitcoin are all\n\n1:41:58.400 --> 1:42:04.240\n property. And that means they're all commonly occurring elements in the world. You could call\n\n1:42:04.240 --> 1:42:08.240\n them commodities, but commodity is a little bit misleading and I'll tell you why in a second.\n\n1:42:08.880 --> 1:42:15.040\n But they're all distinguished by the fact that no one entity or person or government controls them.\n\n1:42:15.040 --> 1:42:22.560\n If you have a barrel of oil and you're in Ukraine versus Russia versus Saudi Arabia versus the U.S.,\n\n1:42:23.600 --> 1:42:32.560\n you have a barrel of oil. And it doesn't matter what the premier in Japan or the mayor of Miami\n\n1:42:32.560 --> 1:42:39.200\n Beach thinks about your barrel of oil. They cannot wave their hand and make it not a barrel of oil\n\n1:42:39.200 --> 1:42:47.680\n or a cord of wood, right? And so property is just a naturally occurring element in the universe,\n\n1:42:48.400 --> 1:42:55.760\n right? Why use the word ethical? Sorry to, I may interrupt occasionally. Why ethical assigned\n\n1:42:55.760 --> 1:43:03.440\n to property? Because if it's a security, a security would be an example of a share of a stock\n\n1:43:03.440 --> 1:43:11.920\n or a crypto token controlled by a small team. And in the event that something is a security because\n\n1:43:12.720 --> 1:43:19.280\n some small group or some identifiable group can control its nature, character, or supply,\n\n1:43:20.880 --> 1:43:28.560\n then it really only becomes ethical to promote it or sell it pursuant to fair disclosures.\n\n1:43:28.560 --> 1:43:36.400\n So I give you maybe practical example. I'm the mayor of Chicago. I give a speech. My speech,\n\n1:43:36.400 --> 1:43:42.160\n I say, I think everybody in Chicago should own their own farm and have chicken, a chicken in the\n\n1:43:42.160 --> 1:43:50.240\n backyard and their own horse and an automobile. That's ethical. I give the same speech and I say,\n\n1:43:50.240 --> 1:43:56.960\n I think everybody in Chicago should buy Twitter stock, sell their house, or sell their house,\n\n1:43:56.960 --> 1:44:04.080\n or sell their cash and buy Twitter stock. Is that ethical? Not really. But at that point,\n\n1:44:04.080 --> 1:44:08.240\n you've entered into a conflict of interest because what you're doing is you're promoting\n\n1:44:09.120 --> 1:44:15.120\n an asset which is substantially controlled by a small group of people, the board of directors or\n\n1:44:15.120 --> 1:44:20.960\n the CEO of the company. So how would you feel if the president of the United States said,\n\n1:44:20.960 --> 1:44:27.920\n I really think Americans should all buy Apple stock, especially if you work to Google.\n\n1:44:27.920 --> 1:44:34.960\n But you worked anywhere. You'd be like, why isn't he saying buy mine? Right? A security is a\n\n1:44:34.960 --> 1:44:42.720\n proprietary asset in some way, shape, or form. And the whole nature of securities law, it starts from\n\n1:44:42.720 --> 1:44:53.760\n this ancient idea, thou shalt not lie, cheat, or steal. Okay? So if I'm going to sell you securities\n\n1:44:53.760 --> 1:44:59.840\n or I'm going to promote securities as a public figure or as an influencer or anybody else,\n\n1:45:01.280 --> 1:45:08.400\n if I create my own yo yo coin or Mikey coin, and then there's a million of them, and I tell you\n\n1:45:08.400 --> 1:45:13.120\n that I think that it's a really good thing, and Mikey coin will go up forever, right? And everybody\n\n1:45:13.120 --> 1:45:19.680\n buys Mikey coin, and then I give 10 million to you and don't tell the public, right? I've cheated\n\n1:45:19.680 --> 1:45:26.080\n them. Maybe if I have Mikey coin, and I think there's only 2 million Mikey coin, and I swear\n\n1:45:26.080 --> 1:45:31.440\n to you, there's only 2 million, and then I get married, and I have three kids, and my third kid\n\n1:45:31.440 --> 1:45:37.200\n is in the hospital, and my kid's going to die, and I have this ethical reason to print 500,000\n\n1:45:37.200 --> 1:45:41.920\n more Mikey coin or else people are going to die, and everybody tells me it's fine. You know,\n\n1:45:41.920 --> 1:45:50.720\n I've still abused, you know, the investor, right? It's an ethical challenge. If you look at ethics\n\n1:45:50.720 --> 1:45:58.960\n laws everywhere in the world, they all boil down to having a clause which says that if you're a\n\n1:45:58.960 --> 1:46:05.120\n public figure, you can't endorse a security. You can't endorse something that would cause you to\n\n1:46:05.120 --> 1:46:10.960\n have a conflict of interest. So if you're a mayor, a governor, a country, a public figure, an\n\n1:46:10.960 --> 1:46:19.040\n influencer, and you want to promote or promulgate or support something using any public influence\n\n1:46:19.040 --> 1:46:27.360\n or funds or resources you may have, it needs to be property. It can't be security. So it goes\n\n1:46:27.360 --> 1:46:33.760\n beyond that, right? I mean, like would the Chinese want to support an American company, right? As\n\n1:46:33.760 --> 1:46:40.880\n soon as you look at what's in the best interest of the human race, the civilization, you realize\n\n1:46:40.880 --> 1:46:50.240\n that if you want an ethical path forward, it needs to be based on common property, which is fair.\n\n1:46:50.720 --> 1:46:56.800\n And the way you get to a common property is through an open permissionless protocol. If it's\n\n1:46:56.800 --> 1:47:01.120\n not open, right, if it's proprietary, and I know what the code says, and you don't know what the\n\n1:47:01.120 --> 1:47:10.800\n code says, that makes it a security. If it's permissioned, if you're not allowed on my network,\n\n1:47:10.800 --> 1:47:16.560\n or if you can be censored or booted off my network, that also makes it a security.\n\n1:47:19.440 --> 1:47:25.920\n So when I talk about property, I mean, the challenge here is how do I create something\n\n1:47:25.920 --> 1:47:35.520\n that's equivalent to a barrel of oil in cyberspace? And that means it has to be a nonsovereign bearer\n\n1:47:35.520 --> 1:47:45.440\n instrument, open, permissionless, not censorable, right? If I could do that, then I could deliver\n\n1:47:45.440 --> 1:47:54.240\n you 10,000 dematerialized barrels of oil, and you would take settlement of them, and you would know\n\n1:47:54.240 --> 1:48:00.240\n that you have possession of that property, irregardless of the opinion of any politician\n\n1:48:00.240 --> 1:48:08.240\n or any company or anybody else in the world. That's a really critical characteristic. And\n\n1:48:08.240 --> 1:48:14.480\n it actually is, it's probably one of the fundamental things that makes Bitcoin special.\n\n1:48:14.480 --> 1:48:19.120\n Bitcoin isn't just a crypto asset network. It's easy to create a crypto asset network.\n\n1:48:19.120 --> 1:48:29.120\n It's very hard to create an ethical crypto asset network, because you have to create one\n\n1:48:29.760 --> 1:48:37.440\n without any government or corporation or investor exercising in due influence to make it successful.\n\n1:48:37.440 --> 1:48:47.680\n So open, permissionless, noncensorable. So basically no way for you without explicitly\n\n1:48:47.680 --> 1:48:54.240\n saying so, outsourcing control to somebody else. So it's a kind of, you have full control.\n\n1:48:54.960 --> 1:49:01.360\n Even with a barrel of oil, what's the difference between a barrel of oil and a Bitcoin to you?\n\n1:49:03.360 --> 1:49:09.600\n Because you kind of mentioned that both are property. You mentioned Russia and China and\n\n1:49:09.600 --> 1:49:14.960\n so on. Is it the ability of the government to confiscate? In the end, governments can\n\n1:49:14.960 --> 1:49:21.280\n probably confiscate no matter what the asset is, but you want to lessen the effort involved.\n\n1:49:21.280 --> 1:49:27.680\n A barrel of oil is a bucket of physical property, liquid property, and Bitcoin is a digital property.\n\n1:49:27.680 --> 1:49:31.360\n But it's easier to confiscate a barrel of oil.\n\n1:49:32.320 --> 1:49:38.640\n It's easier to confiscate things in the real world than things in cyberspace. Much easier.\n\n1:49:38.640 --> 1:49:43.120\n So that's not universally true. Some things in the digital space are actually easier to\n\n1:49:43.120 --> 1:49:50.000\n confiscate because just the nature of how things move easily with information, right?\n\n1:49:50.000 --> 1:49:55.520\n So I think in the Bitcoin world, what we would say is that Bitcoin is the most difficult\n\n1:49:56.160 --> 1:50:02.640\n property that the human race possesses or has yet invented to confiscate. And that's\n\n1:50:02.640 --> 1:50:06.560\n by virtue of the fact that you could take possession of it via your private keys.\n\n1:50:06.560 --> 1:50:13.200\n So if you got your 12 seed phrases in your head, then that would be the highest form of property,\n\n1:50:13.200 --> 1:50:18.960\n right? Because I literally have to crack your head open and read your mind to take it.\n\n1:50:18.960 --> 1:50:25.360\n It doesn't mean I couldn't extract it from you under duress, but it means that it's harder than\n\n1:50:25.360 --> 1:50:30.960\n every other thing you might own. In fact, it's exponentially harder. If you consider every other\n\n1:50:30.960 --> 1:50:38.800\n thing you might own, a car, a house, a share of stock, gold, diamonds, property rights,\n\n1:50:38.800 --> 1:50:44.320\n intellectual property rights, movie rights, music rights, anything imaginable, they would all be\n\n1:50:44.320 --> 1:50:51.520\n easier by orders and orders of magnitude to seize. So digital property in the form of a\n\n1:50:53.360 --> 1:50:57.120\n set of private keys is by far the apex property of the human race.\n\n1:50:57.120 --> 1:51:02.960\n In terms of ethics, I want to make one more point. I might say to you, Lex, I think Bitcoin is the\n\n1:51:02.960 --> 1:51:08.320\n best, most secure, most durable crypto asset network in the world. It's going to go up forever,\n\n1:51:08.320 --> 1:51:12.880\n and there's nothing better in the world. I might be right. I might be wrong.\n\n1:51:14.480 --> 1:51:21.040\n But the point is, because it's property, it's ethical for me to say that if I were to turn\n\n1:51:21.040 --> 1:51:27.520\n around and say, you know, Lex, I think the same about microstrategy stock, MSTR. That's a security.\n\n1:51:27.520 --> 1:51:36.320\n Okay? If I'm wrong about that, I have civil liability or other liability because I could go\n\n1:51:36.320 --> 1:51:40.800\n to a board meeting tomorrow and I could actually propose we issue a million more shares of\n\n1:51:40.800 --> 1:51:48.560\n microstrategy stock, whereas the thing that makes Bitcoin ethical for me to even promote is the\n\n1:51:48.560 --> 1:51:56.240\n knowledge that I can't change it. If I knew that I could make it 42 million instead of 21 million\n\n1:51:56.240 --> 1:52:04.320\n and I had the button back here, right, then I have a different degree of ethical responsibility.\n\n1:52:04.320 --> 1:52:08.480\n Now, I could tell you your life will be better if you buy Bitcoin, and it might not. You might go\n\n1:52:08.480 --> 1:52:12.960\n buy Bitcoin, you might lose the keys and be bankrupt and your life ends and your life is not\n\n1:52:12.960 --> 1:52:19.840\n better because you bought Bitcoin, right? But it wouldn't be my ethical liability any more than if\n\n1:52:19.840 --> 1:52:26.480\n I were to say, Lex, I think you ought to get a farm. I think you should be a farmer. I think a\n\n1:52:26.480 --> 1:52:31.680\n chicken in every pot, you should get a horse. I think you'd be better. I mean, these are all\n\n1:52:32.480 --> 1:52:40.000\n opinions expressed about property, which may or may not be right, that you may or may not agree with,\n\n1:52:40.000 --> 1:52:47.120\n but in a legal sense, if we read the law, if we understand securities law, and I would say,\n\n1:52:47.120 --> 1:52:52.400\n you know, most people in the crypto industry, you know, they didn't take companies public,\n\n1:52:52.400 --> 1:52:55.920\n and so they're not really focused on the securities law. They don't even know the securities law.\n\n1:52:57.120 --> 1:53:03.040\n If you focus on the securities law, that would say you just can't legally sell this stuff to\n\n1:53:03.040 --> 1:53:10.640\n the general public or promote it without a full set of continuing disclosures signed off on by\n\n1:53:10.640 --> 1:53:18.640\n a regulator. So there's a fairly bright line there with regard to securities. But when you get to the\n\n1:53:19.600 --> 1:53:29.360\n secondary issue, it's how do you actually build a world based on digital property if public figures\n\n1:53:29.360 --> 1:53:36.880\n can't embrace it or endorse it? You see, so you're not going to build a better world based upon\n\n1:53:38.000 --> 1:53:44.000\n Twitter stock, if that's your idea of property, because Twitter stock is a security and Twitter\n\n1:53:44.000 --> 1:53:50.240\n stock is never going to be a non sovereign bearer instrument in Russia, right, or in China, right?\n\n1:53:50.240 --> 1:53:55.680\n It's not even legal in China, right? So it's not a global permissionless open thing. It will never\n\n1:53:55.680 --> 1:54:02.320\n be trusted by the rest of the world. And legally, it's impractical. But, you know, would you really\n\n1:54:02.320 --> 1:54:06.880\n want to put $100 trillion worth of economic value on Twitter stock if there's a board of directors\n\n1:54:06.880 --> 1:54:12.720\n and a CEO that could just get up and like take half of it tomorrow? The answer is no. So if you\n\n1:54:12.720 --> 1:54:20.000\n want to build a better world based on digital energy, you need to start with constructing a\n\n1:54:20.000 --> 1:54:28.480\n digital property. And I'm using property here and open permissionless in a legal sense. Okay,\n\n1:54:28.480 --> 1:54:37.280\n but I would also go to the next step and say property is low frequency money. So if you if I\n\n1:54:37.280 --> 1:54:44.640\n give you a million dollars, and you want to hold it for a decade, you might go buy a house with it.\n\n1:54:44.640 --> 1:54:51.120\n Right. And the house is low frequency money, you converted the the million dollars of economic\n\n1:54:51.120 --> 1:54:57.040\n energy into a structure called a house. Maybe an after a decade, you might convert it back into\n\n1:54:57.040 --> 1:55:03.040\n energy, you might sell the house for currency. And it'll be more worth more or less depending\n\n1:55:03.040 --> 1:55:10.080\n upon the monetary climate. The frequency means what here? How quickly it changes state? How\n\n1:55:10.080 --> 1:55:21.200\n quickly does something vibrate? So if I transfer $10 from me to you for a drink, and then you turn\n\n1:55:21.200 --> 1:55:26.720\n around, you buy another right, we're vibrating on a frequency of every few hours, right? The energy\n\n1:55:26.720 --> 1:55:32.960\n is changing hands. But it's not likely that you sell and buy houses every few hours. Right? The\n\n1:55:32.960 --> 1:55:39.920\n frequency of a transaction in real estate is every 10 years, every five years, it's a much lower\n\n1:55:39.920 --> 1:55:49.600\n frequency transaction. And so when you think about what's going on here, you have extremely low\n\n1:55:49.600 --> 1:55:58.160\n frequency things, which we'll call property, then you have mid frequency things, I'm going to call\n\n1:55:58.160 --> 1:56:05.840\n them money or currency. And then you have high frequency, that's energy. And that's why I use\n\n1:56:05.840 --> 1:56:11.440\n the illustration of you got the building, you got the light, and you got the sound, and they're all\n\n1:56:11.440 --> 1:56:22.160\n just energy moving at different frequencies. Now, Bitcoin is magical. And it is truly the innovation.\n\n1:56:22.160 --> 1:56:28.240\n It's like a singularity, because it represents the first time in the history of human race\n\n1:56:28.240 --> 1:56:36.160\n that we managed to create a digital property, properly understood. It's easy to create something\n\n1:56:37.040 --> 1:56:45.120\n digital, right? Every coupon and every scan on Fortnite and Roblox and Apple TV credits and all\n\n1:56:45.120 --> 1:56:51.040\n these things, they're all digital something, but they're securities. And that's why I use the\n\n1:56:51.040 --> 1:56:56.480\n word something, but they're securities, right? Shares of stock are securities. Whenever anybody\n\n1:56:56.480 --> 1:57:01.360\n transfers, when you transfer money on PayPal or Apple Pay, you're transferring in essence a\n\n1:57:01.360 --> 1:57:11.280\n security or an IOU. And so transferring a bearer instrument with final settlement in the internet\n\n1:57:11.280 --> 1:57:18.880\n domain or in cyberspace, that's a critical thing. And anybody in the crypto world can do that.\n\n1:57:18.880 --> 1:57:24.320\n All the crypto is going to do that. But what they can't do, what 99% of them fail to do,\n\n1:57:24.320 --> 1:57:29.280\n is be property. They're securities, correct? Well, there's a line there I'd like to explore\n\n1:57:29.280 --> 1:57:36.000\n a little further. For example, what about when you, like Coinbase or something like that,\n\n1:57:36.000 --> 1:57:43.760\n when there's an exchange that you buy Bitcoin in, you start to move away from this kind of,\n\n1:57:43.760 --> 1:57:51.600\n some of the aspects that you said makes up a property, which is this\n\n1:57:53.840 --> 1:58:01.520\n noncensorable and permissionless and open. So in order to achieve the convenience,\n\n1:58:01.520 --> 1:58:10.960\n the effectiveness of the transfer of energy, you have to leverage some of these places that remove\n\n1:58:10.960 --> 1:58:16.240\n the aspects of property. So maybe you can comment on that. Let me give you a good model for that.\n\n1:58:16.960 --> 1:58:23.920\n If you think about the layer one of Bitcoin, the layer one is the property settlement layer,\n\n1:58:23.920 --> 1:58:29.760\n and we're going to do 350,000 transactions or less a day, 100 million transactions a year is\n\n1:58:29.760 --> 1:58:36.480\n the bandwidth on the layer one. And it would be an ideal layer one to move a billion dollars from\n\n1:58:36.480 --> 1:58:43.200\n point A to point B with the massive security. The role of the layer one is two things.\n\n1:58:44.080 --> 1:58:51.520\n One thing is I want to move a large sum of money through space with security. I can move\n\n1:58:52.560 --> 1:59:00.720\n any amount of Bitcoin in a matter of minutes for dollars on layer one. The second important\n\n1:59:00.720 --> 1:59:06.960\n feature of the layer one is I need the money to last forever. I need the money indestructible,\n\n1:59:06.960 --> 1:59:13.440\n immortal. So the bigger trick is not to move a billion dollars from here to Tokyo. The big trick\n\n1:59:13.440 --> 1:59:22.320\n is to move a billion dollars from here to the year 2140. And that's what we want to solve with\n\n1:59:22.320 --> 1:59:27.520\n layer one. And the best real metaphor in New York City would be the granite or the schist.\n\n1:59:27.520 --> 1:59:34.800\n What you want is a city block of bedrock. And how long has it been there? Like millions of years\n\n1:59:34.800 --> 1:59:40.640\n it's been there. And how fast do you want it to move? You don't. In fact, the single thing that's\n\n1:59:40.640 --> 1:59:47.600\n most important is that it not deflect. If it deflects a foot in 100 years, it's too much.\n\n1:59:47.600 --> 1:59:53.440\n If it deflects an inch in 100 years, you might not want that. So the layer one of Bitcoin is\n\n1:59:53.440 --> 1:59:58.640\n a foundation upon which you put weight. How much weight can you put on it? You put a trillion,\n\n1:59:58.640 --> 2:00:06.320\n 10 trillion, 100 trillion, a quadrillion? How much weight's on the bedrock in Manhattan, right?\n\n2:00:06.320 --> 2:00:14.560\n Think about 100 story buildings. So the real key there is the foundational asset needs to be there\n\n2:00:14.560 --> 2:00:20.880\n at all. So the fact that you can create a hundred trillion dollar layer one that would stand for\n\n2:00:20.880 --> 2:00:27.680\n 100 years, that is the revolutionary breakthrough first time. And the fact that it's ethical,\n\n2:00:27.680 --> 2:00:33.520\n right? It's ethical and it's common property, global, permissionless. Extremely unlikely that\n\n2:00:33.520 --> 2:00:40.000\n would happen. People tried 50 times before and they all failed. They tried 15,000 times after,\n\n2:00:40.000 --> 2:00:47.200\n and they've all generally failed. 98% have failed and a couple have been less successful. But\n\n2:00:47.200 --> 2:00:52.240\n for the most part, that's an extraordinary thing. Now,\n\n2:00:52.240 --> 2:00:58.880\n just really quickly pause just to define some terms. If people don't know, layer one is that\n\n2:00:58.880 --> 2:01:06.560\n Michael's referring to is in general what people know of as the Bitcoin technology originally\n\n2:01:06.560 --> 2:01:11.840\n defined, which is the blockchain. There's a consensus mechanism of proof of work,\n\n2:01:11.840 --> 2:01:20.000\n low number of transactions, but you can move a very large amount of money. The reason he's\n\n2:01:20.000 --> 2:01:25.120\n using the term layer one is now that there's a lot of ideas of layer two technologies built on top\n\n2:01:25.120 --> 2:01:30.400\n of this bedrock that allow you to move a much larger number of transactions,\n\n2:01:33.600 --> 2:01:38.800\n sort of higher frequency. I don't know what terminology you want to use, but basically be\n\n2:01:38.800 --> 2:01:45.840\n able to use now something that is based on Bitcoin to then buy stuff, be a consumer,\n\n2:01:45.840 --> 2:01:51.040\n to transfer money, to use it as currency, just to define some terms.\n\n2:01:51.040 --> 2:02:02.960\n Yeah, so the layer one is the foundation for the entire cyber economy, and we don't want it to move\n\n2:02:02.960 --> 2:02:13.280\n fast. What we want is immortality, immortal, incorruptible, indestructible, right? That's\n\n2:02:13.280 --> 2:02:18.640\n what you want, integrity from the layer one. Now there's layer two and layer three, and layer\n\n2:02:18.640 --> 2:02:27.840\n two I would define as an open, permissionless, noncustodial protocol that uses the underlying\n\n2:02:27.840 --> 2:02:35.520\n layer one token as its gas fee. So what's custodial mean and how does the different markets,\n\n2:02:35.520 --> 2:02:41.680\n like is lightning network? So lightning network would be an example of a layer two, noncustodial.\n\n2:02:41.680 --> 2:02:48.080\n So the lightning network will sit on top of layer one, it'll sit on top of Bitcoin,\n\n2:02:48.640 --> 2:02:54.480\n and it solves the, what you want to do is solve the problem of it's well and fine, I don't want\n\n2:02:54.480 --> 2:03:01.120\n to move a billion dollars every day, what I want to move is five dollars a billion times a day.\n\n2:03:02.000 --> 2:03:07.520\n So if I want to move five dollars a billion times a day, I don't really need to put the entire\n\n2:03:07.520 --> 2:03:15.120\n trillion dollars of assets at risk every time I move five dollars. All I really need to do is put\n\n2:03:15.680 --> 2:03:19.840\n a hundred thousand dollars in a channel or a million dollars in a channel, and then I do\n\n2:03:19.840 --> 2:03:25.120\n ten million transactions where I have a million dollars at risk. And of course it's kind of\n\n2:03:25.120 --> 2:03:32.480\n simple, if I put, if I lower my security requirement by a factor of a million,\n\n2:03:33.040 --> 2:03:37.920\n I could probably move the stuff a million times faster, right? And that's how lightning works.\n\n2:03:38.480 --> 2:03:46.160\n It's noncustodial because there's no corporation or custodian or counterparty you're trusting,\n\n2:03:46.160 --> 2:03:53.840\n right? There's the risk of moving through the channel. But lightning is an example of how I go\n\n2:03:53.840 --> 2:04:00.640\n from 350,000 transactions a day to 350 million transactions a day. So on that layer too, you\n\n2:04:00.640 --> 2:04:07.280\n could move the Bitcoin in seconds for fractions of pennies. Now that's not the end all be all,\n\n2:04:07.280 --> 2:04:12.240\n because the truth is there are a lot of open protocols. Lightning probably won't be the only\n\n2:04:12.240 --> 2:04:18.080\n one. You know, there's an open market competition of other permissionless open source protocols to\n\n2:04:18.080 --> 2:04:28.160\n do this work. And in theory, any other crypto network that was deemed to be property, deemed to\n\n2:04:28.160 --> 2:04:34.400\n be non a security, you could also think of as potentially a layer two to Bitcoin, right? There's\n\n2:04:34.400 --> 2:04:38.640\n a debate about are there any and what are they, and we can leave that for a little bit of a\n\n2:04:38.640 --> 2:04:43.360\n debate about are there any and what are they, and we can leave that for a later time.\n\n2:04:43.360 --> 2:04:49.200\n But why do you think of them as layer two, as opposed to contending for layer one?\n\n2:04:50.400 --> 2:04:55.920\n Yeah, actually, if they're using their own token, then they are a layer one. If you create an open\n\n2:04:55.920 --> 2:05:05.040\n protocol that uses the Bitcoin token as the fee, then it becomes a layer two, right? Bitcoin itself,\n\n2:05:05.040 --> 2:05:10.320\n right, incentivizes his own transactions with its own token, and that's what makes it layer one.\n\n2:05:11.840 --> 2:05:13.840\n Okay, what's layer three, then?\n\n2:05:13.840 --> 2:05:20.160\n Layer three is a custodial layer. So if you want to move Bitcoin in milliseconds for free,\n\n2:05:21.360 --> 2:05:27.840\n you move it through Binance or Coinbase or Cash App. So this is a very straightforward thing. I\n\n2:05:27.840 --> 2:05:32.640\n mean, it seems pretty obvious when you think about it that there are going to be hundreds of thousands\n\n2:05:32.640 --> 2:05:39.600\n of layer threes. There may be dozens of layer twos. I mean, Lightning is a one, but it's not the only\n\n2:05:39.600 --> 2:05:48.720\n one. Anybody can invent something, right? And we can have this debate about custodial, noncustodial.\n\n2:05:50.720 --> 2:05:56.240\n Don't you think there's a monopolization possibilities at layer three?\n\n2:05:56.240 --> 2:06:03.200\n So, you know, Coin, you mentioned Binance, Coinbase. What if they start to dominate,\n\n2:06:03.200 --> 2:06:09.120\n and basically everybody's using them, practically speaking, and then it becomes too costly to\n\n2:06:09.840 --> 2:06:18.160\n memorize the private key in your brain? I mean, or like the cold storage of layer one technology.\n\n2:06:18.160 --> 2:06:23.920\n The idealists fear the layer threes because they think, and especially they detest,\n\n2:06:23.920 --> 2:06:28.960\n they would detest it. There's almost like a layer four, by the way, if you want to.\n\n2:06:28.960 --> 2:06:34.640\n A layer four would be, I've got Bitcoin on an application, but I can't withdraw it.\n\n2:06:35.600 --> 2:06:39.760\n So I've got an application that's backed by Bitcoin, but the Bitcoin is sealed.\n\n2:06:40.560 --> 2:06:44.240\n It's a proprietary example. And I'll give you an example of that. That would be like\n\n2:06:44.240 --> 2:06:53.520\n Grayscale. If I own a share of GBTC, and so I own a security, actually, you know, you could own MSTR.\n\n2:06:54.240 --> 2:06:59.600\n If you own a security or you own a product that has Bitcoin embedded in it, you get the benefits\n\n2:06:59.600 --> 2:07:04.240\n of Bitcoin, but you don't have the ability to withdraw the asset.\n\n2:07:04.240 --> 2:07:09.040\n To get out of the security market at layer four? Am I understanding this correctly?\n\n2:07:09.040 --> 2:07:15.120\n I don't know if I would say, I don't, not all securities are layer four, but anything that's\n\n2:07:15.120 --> 2:07:21.680\n a proprietary product based upon what with Bitcoin embedded in it, where you can't withdraw the\n\n2:07:21.680 --> 2:07:29.120\n Bitcoin is another application of Bitcoin. So if you think about different ways you can use this,\n\n2:07:29.840 --> 2:07:34.960\n you can either stay completely on the layer one and use the base chain for your transactions,\n\n2:07:34.960 --> 2:07:41.040\n or you can limit yourself to layer one and layer two lightning. And the purist would say we stay\n\n2:07:41.040 --> 2:07:46.400\n there, get your Bitcoin off the exchange. But you could also go to the layer three.\n\n2:07:46.400 --> 2:07:51.840\n When Cash App supported Bitcoin, they made it very easy to buy it, and then they gave you the\n\n2:07:51.840 --> 2:07:56.800\n ability to withdraw. When PayPal or I think Robinhood let you buy it, they wouldn't let\n\n2:07:56.800 --> 2:08:01.200\n you withdraw it, and there was a big community uproar, and people wanted to withdraw.\n\n2:08:01.200 --> 2:08:06.000\n They want these layer threes to make it possible to withdraw the Bitcoin so you can take it to\n\n2:08:06.000 --> 2:08:11.840\n your own private wallet and get it off the exchange. I think the answer to the question\n\n2:08:11.840 --> 2:08:18.880\n of, well, is corruption possible? Corruption is possible in all human institutions and all\n\n2:08:18.880 --> 2:08:25.200\n governments everywhere. The difference between digital property and physical property is when\n\n2:08:25.200 --> 2:08:31.520\n you own a building in Los Angeles and the city politics turn against you, you can't move the\n\n2:08:31.520 --> 2:08:39.760\n building. And when you own a share of a security that's like a U.S. traded security and you wish\n\n2:08:39.760 --> 2:08:47.440\n to move to some other country, you can't take the security with you either. And when you own\n\n2:08:47.440 --> 2:08:51.680\n a bunch of gold and you try to get through the airport, they might not let you take it.\n\n2:08:51.680 --> 2:08:59.200\n So Bitcoin is advantageous versus all those because you actually do have the option to\n\n2:08:59.200 --> 2:09:06.240\n withdraw your asset from the exchange. And if you had Bitcoin with Fidelity and you had shares of\n\n2:09:06.240 --> 2:09:12.800\n stock with Fidelity, and if you had bonds and sovereign debt with Fidelity, and if you own some\n\n2:09:12.800 --> 2:09:18.960\n mutual funds and some other random limited partnerships with Fidelity, none of those things\n\n2:09:18.960 --> 2:09:25.040\n can be removed from the custodian. But the Bitcoin, you can take off the exchange, you can remove\n\n2:09:25.040 --> 2:09:36.080\n from the custodian. So there's a deterrent that's an anti corrupting element. And the phrase is an\n\n2:09:36.080 --> 2:09:43.440\n armed society is a polite society, right? Because you have the optionality to withdraw all your\n\n2:09:43.440 --> 2:09:50.320\n assets from the crypto exchange, you can enforce fairness. And at the point where you disagree\n\n2:09:50.320 --> 2:09:56.720\n with their policies, you can within an hour, move your assets to another counterparty or take\n\n2:09:56.720 --> 2:10:02.960\n personal custody of those assets. And you don't have that option to withdraw all your assets.\n\n2:10:02.960 --> 2:10:08.480\n And you don't have that option with most other forms of property. Maybe you don't have as much\n\n2:10:08.480 --> 2:10:14.640\n optionality with any other form of property on Earth. And so what makes digital property distinct\n\n2:10:15.600 --> 2:10:22.800\n is the fact that it has the most optionality for custody. Now coming back to this digital energy\n\n2:10:22.800 --> 2:10:30.960\n issue, the real key point is the energy moves in milliseconds for free on layer threes. It moves in\n\n2:10:30.960 --> 2:10:39.600\n seconds or less than seconds on layer twos, it moves in minutes on the layer one. And I don't\n\n2:10:39.600 --> 2:10:44.880\n think it makes any sense to even think about trying to solve all three problems on the layer one\n\n2:10:44.880 --> 2:10:51.600\n because it's impossible to achieve the security and the incorruptibility and immortality if you\n\n2:10:51.600 --> 2:10:58.480\n try to build that much speed and that functionality and performance. In fact, if you come back to the\n\n2:10:58.480 --> 2:11:04.640\n New York model, you really wanted a block of granite, a building and a company. That's what\n\n2:11:04.640 --> 2:11:10.400\n makes the economy, right? If I said to you, you're going to build a building, but you can only have\n\n2:11:10.400 --> 2:11:16.240\n one company in it for the life of the building, it would be very fragile, like very brittle. What\n\n2:11:16.240 --> 2:11:21.680\n company a hundred years ago is still relevant today? You want all three layers because they\n\n2:11:21.680 --> 2:11:29.360\n all oscillate at different frequencies. And there's a tendency to think, well, it's got to be\n\n2:11:29.360 --> 2:11:35.760\n this L1 or that L1, not really. And sometimes people think, well, I don't really want any L3.\n\n2:11:36.560 --> 2:11:44.240\n But companies, it's not an even or, companies are better than crypto asset networks at certain\n\n2:11:44.240 --> 2:11:49.280\n things. If you want complexity, you want to implement complexity, or you want to implement\n\n2:11:49.280 --> 2:12:00.880\n compliance or customer service, right? Companies do these things well, right? You couldn't\n\n2:12:00.880 --> 2:12:07.680\n decentralize Apple or Netflix or even YouTube. The performance wouldn't be there and the subtlety\n\n2:12:07.680 --> 2:12:14.640\n wouldn't be there. And you can't really legally decentralize certain forms of banking and insurance\n\n2:12:14.640 --> 2:12:19.440\n because they will become illegal in the political jurisdiction they're in. So, unless you're a\n\n2:12:19.440 --> 2:12:27.440\n crypto anarchist and you believe in no companies and no nation states, right? Which is just not\n\n2:12:27.440 --> 2:12:33.680\n very practical, not anytime soon. Once you allow that nation states will continue and companies\n\n2:12:33.680 --> 2:12:43.120\n have a role, then the layered architecture follows and the free market determines who wins.\n\n2:12:43.120 --> 2:12:50.320\n For example, there are layer threes that let you acquire Bitcoin and withdraw Bitcoin.\n\n2:12:51.760 --> 2:12:58.640\n There are other applications that let you acquire but not withdraw it. And they don't get the same\n\n2:12:58.640 --> 2:13:04.560\n market share, but they might give you some other advantage. There are certain layer threes like\n\n2:13:04.560 --> 2:13:10.800\n Jack Dorsey's Cash App, where they just incorporated lightning, an implementation of it.\n\n2:13:10.800 --> 2:13:21.120\n So, that makes it more, that makes it advantageous versus an application that doesn't incorporate\n\n2:13:21.120 --> 2:13:28.640\n lightning. If you think about the big picture, the big picture is 8 billion people with mobile phones\n\n2:13:28.640 --> 2:13:38.080\n served by 100 million companies doing billions of transactions an hour. And the companies are\n\n2:13:38.080 --> 2:13:45.200\n settling with each other on the base layer in blocks of 80 million at a time. And then the\n\n2:13:45.200 --> 2:13:54.480\n companies are trading with the consumers, right, in proprietary layers, like layer three. And then\n\n2:13:55.040 --> 2:14:00.800\n on occasion, people are shuffling assets across custodians with lightning layer two,\n\n2:14:00.800 --> 2:14:06.080\n because you don't want to pay $5 to move $50. You want to pay a 20th of a penny.\n\n2:14:06.080 --> 2:14:15.440\n You want to pay a 20th of a penny to move $50. And so, all of these things create efficiency\n\n2:14:15.440 --> 2:14:21.600\n in the economy. And, Lex, if you want to consider how much efficiency, if you gave me a billion\n\n2:14:21.600 --> 2:14:28.080\n dollars in 20 years, I couldn't find a way to trade with another company or a counterparty in Nigeria.\n\n2:14:28.080 --> 2:14:37.040\n Like, no amount of money. Give me $10 billion. I couldn't do it because you get shut down at\n\n2:14:37.040 --> 2:14:43.520\n the banking level. You can't link up a bank in Nigeria with a bank in the US. You get shut down\n\n2:14:43.520 --> 2:14:47.360\n at this credit card level because they don't have the credit card, so they won't clear.\n\n2:14:47.360 --> 2:14:57.600\n You would get shut down at the compliance FCPA level because, you know, you wouldn't be able to\n\n2:14:57.600 --> 2:15:02.000\n implement a system that interfaced with somebody else's system if it's not in the right political\n\n2:15:02.000 --> 2:15:08.080\n jurisdiction. On the other hand, three entrepreneurs in Nigeria on the weekend could\n\n2:15:08.080 --> 2:15:14.320\n create a website that would trade in this lightning economy using open protocols without asking\n\n2:15:14.320 --> 2:15:19.600\n anybody's permission. So, you're talking about something that's, like, a million times cheaper,\n\n2:15:20.160 --> 2:15:26.880\n less friction, and faster to do it if you want to get money to move.\n\n2:15:27.520 --> 2:15:31.040\n What do you think that looks like so that now there's a war going on in Ukraine,\n\n2:15:31.680 --> 2:15:40.560\n there's other wars, Yemen, going out throughout the world in this most difficult of states that\n\n2:15:40.560 --> 2:15:47.600\n a nation can be in, which is a war, a civil war, or war with other nations? What's the role of\n\n2:15:47.600 --> 2:15:55.680\n Bitcoin in this context? I mean, Bitcoin's a universal trust protocol, right? A universal\n\n2:15:55.680 --> 2:16:02.880\n energy protocol, if you will. English is one, okay? What I see is a bunch of fragmentation\n\n2:16:02.880 --> 2:16:08.240\n of applications. For example, you know, the Russian payment app is not going to work in\n\n2:16:08.240 --> 2:16:14.000\n Ukraine. The Ukraine payment app is not going to work in Russia. You know, US payment apps won't\n\n2:16:14.000 --> 2:16:20.720\n work either of those places, as far as I know. So, you know, and in Argentina, their payment\n\n2:16:20.720 --> 2:16:29.200\n app may not work in certain parts of Africa. So, what you have is different local economies\n\n2:16:29.200 --> 2:16:35.280\n where people spin up their own applications compliant with their own local laws, or,\n\n2:16:35.280 --> 2:16:41.280\n you know, in war zones, not compliant, but just spinning up, you know?\n\n2:16:41.280 --> 2:16:47.600\n So, how do you build something that's not compliant? What is the revolutionary act here\n\n2:16:47.600 --> 2:16:52.560\n when you don't agree with the government or what you want to free yourself from the constitution?\n\n2:16:52.560 --> 2:17:01.200\n So, here's the thing. When a nation is really at war, especially if it's an authoritarian regime,\n\n2:17:01.200 --> 2:17:06.160\n it's going to try to control the pop, like lock everything down, the spread of information.\n\n2:17:06.160 --> 2:17:09.920\n How do you break through that? Do you do the thing that you mentioned, which is you have to build\n\n2:17:09.920 --> 2:17:17.200\n another app, essentially, that allows the flow of money outside the legal constraints placed on you\n\n2:17:17.200 --> 2:17:22.000\n by the government? So, basically, break the law? Is that possible?\n\n2:17:22.000 --> 2:17:25.600\n Metaphorically speaking, if you want to break out of the constraints of your culture,\n\n2:17:25.600 --> 2:17:30.960\n you learn to speak English. For example, it's not illegal to speak English, or even if it is,\n\n2:17:30.960 --> 2:17:36.160\n right? It doesn't matter, but English works everywhere in the world if you can speak it,\n\n2:17:36.160 --> 2:17:43.760\n and then you can tap into a global commerce and intelligence network. So, Bitcoin is a language,\n\n2:17:43.760 --> 2:17:49.440\n so you learn to speak Bitcoin, or you learn to speak Lightning, and then you tap into that network\n\n2:17:49.440 --> 2:17:54.480\n in, you know, whatever manner you can. But the problem is it's still very difficult\n\n2:17:54.480 --> 2:18:01.840\n to move Bitcoin around in Russia and Ukraine now, during the war. And there was a sense to me that\n\n2:18:02.800 --> 2:18:08.880\n the cryptocurrency in general could be the savior for helping people. There's millions of refugees\n\n2:18:08.880 --> 2:18:17.360\n that are moving all around. It's very difficult to move money around in that space to help people.\n\n2:18:17.920 --> 2:18:23.200\n I think we're very early. Like, we're very embryonic here. If you look at the...\n\n2:18:23.200 --> 2:18:28.240\n Who's we, sorry? We as a human civilization, or we operating in the cryptocurrency space?\n\n2:18:28.240 --> 2:18:35.440\n I think the entire crypto economy is very embryonic, and the human race's adoption of it\n\n2:18:35.440 --> 2:18:42.320\n is embryonic. We're like one, two percent down that adoption curve. If you take Lightning,\n\n2:18:42.320 --> 2:18:47.440\n for example, you know, the first real commercial applications of Lightning are just in the last\n\n2:18:47.440 --> 2:18:53.760\n 12 months. So we're like year one. We might be approaching year two of commercial Lightning\n\n2:18:53.760 --> 2:18:59.920\n adoption. And if you look at Lightning adoption, Lightning's not built into Coinbase, it's not\n\n2:18:59.920 --> 2:19:07.600\n built into Binance, it's not built into FTX. Cash App just implemented the first implementation,\n\n2:19:07.600 --> 2:19:12.960\n but not all the features are built into it. There's a few dozen, a dozen Lightning wallets\n\n2:19:12.960 --> 2:19:19.600\n circulating out there. So I think that, you know, we're probably going to be 36 months of\n\n2:19:19.600 --> 2:19:29.200\n software development. At the point that every Android phone and every iPhone has a Bitcoin\n\n2:19:29.200 --> 2:19:36.400\n wallet or a crypto wallet in it of sorts, that's a big deal. If Apple embraced Lightning,\n\n2:19:36.400 --> 2:19:44.720\n that's a big deal. So the adoption is the thing, like in a war zone adoption, the people who\n\n2:19:44.720 --> 2:19:51.040\n struggle the most in war are people who weren't doing that great before the war started. They\n\n2:19:51.040 --> 2:19:55.600\n don't have the technological sophistication. The hackers and all those kinds of people will find\n\n2:19:55.600 --> 2:20:01.840\n a way. It's just regular people who are just struggling to make day by day living. And so\n\n2:20:01.840 --> 2:20:09.840\n if the adoption permeates the entire culture, then you can start to move money around in the\n\n2:20:09.840 --> 2:20:18.160\n digital space. If you can psychoanalyze Jack Dorsey for a second. So he's one of the early\n\n2:20:18.160 --> 2:20:24.400\n adopters, or he's one of the people pushing the early adoption, this layer three, so inside Cash\n\n2:20:24.400 --> 2:20:32.320\n App. What do you make of the man of this decision as a business owner, as somebody playing in the\n\n2:20:32.320 --> 2:20:40.640\n space? Like what, why did he do it? And what does that mean for others at this scale that might be\n\n2:20:40.640 --> 2:20:45.280\n doing the same? So incorporating Lightning networking, incorporating Bitcoin into their\n\n2:20:45.280 --> 2:20:51.120\n products. I think he's been pretty clear about this. He feels that Bitcoin is an instrument of\n\n2:20:51.120 --> 2:20:56.800\n economic empowerment for billions of people that are unbanked and have no property rights\n\n2:20:58.000 --> 2:21:05.200\n in the world. If you want to give an incorruptible bank\n\n2:21:07.600 --> 2:21:14.480\n to eight billion people on the planet, that's the same as asking the question,\n\n2:21:14.480 --> 2:21:22.800\n how do you give a full education through PhD to eight billion people on the planet? And the answer\n\n2:21:22.800 --> 2:21:31.120\n is a digital version of the 20th century thing running on a mobile phone. And Bitcoin is a bank\n\n2:21:31.120 --> 2:21:34.800\n in cyberspace. It's run by incorruptible software and it's for everybody on earth.\n\n2:21:35.600 --> 2:21:39.360\n So I think when Jack looks at it, he's very sensitive to the plight of everybody in Africa.\n\n2:21:39.360 --> 2:21:43.280\n If you look at Africans, you're going to give them banks, you're not going to put a bank branch on\n\n2:21:43.280 --> 2:21:47.840\n every corner. That's an obscene waste of energy. You're not going to run copper wires across the\n\n2:21:47.840 --> 2:21:56.640\n continent. That's an obscene waste of energy. You're not going to give them gold. So how are\n\n2:21:56.640 --> 2:22:03.840\n you going to provide people with a decent life? The metaphor I think is relevant here,\n\n2:22:03.840 --> 2:22:09.520\n the biological metaphor, Lex, is a type one diabetic. If you're a type one diabetic,\n\n2:22:09.520 --> 2:22:15.040\n you can't form fat. And if you can't form fat, then you can't store excess energy. So\n\n2:22:15.840 --> 2:22:20.640\n that means that, I mean, fat is the ultimate organic battery. And if you've got 30 pounds of it,\n\n2:22:20.640 --> 2:22:27.040\n you can go 60 days without eating. But if you can't generate insulin, you can't form fat cells.\n\n2:22:27.040 --> 2:22:32.160\n And if you can't form fat cells and store energy, then you can eat yourself to death.\n\n2:22:32.160 --> 2:22:37.840\n I mean, you will eat and you will die. You'll starve to death. So the lack of property rights\n\n2:22:38.560 --> 2:22:44.800\n is like being a type one diabetic. And so if you look at most people everywhere in the world,\n\n2:22:46.800 --> 2:22:52.640\n they don't have property rights, they don't have effective bank, and their currency is broken.\n\n2:22:53.680 --> 2:22:57.360\n Like what are the two things that in theory would serve as the equivalent of a\n\n2:22:57.360 --> 2:23:03.360\n organic battery or an economic battery to civilization? It would be, I have a currency\n\n2:23:03.360 --> 2:23:12.080\n which holds its value and I can store it in a bank. So a risk free currency derivative.\n\n2:23:13.920 --> 2:23:18.800\n I pay you your money, you take your life savings, you put it in a bank, you save up for your\n\n2:23:18.800 --> 2:23:22.240\n retirement, you'll have happily ever after. That's the American dream.\n\n2:23:22.240 --> 2:23:28.320\n Right? That's the idyllic situation. The real situation is there are no banks,\n\n2:23:28.320 --> 2:23:34.960\n you can't get a bank account. So I give you your pay in currency, and then I double the supply and\n\n2:23:34.960 --> 2:23:40.800\n I give it to my cousin, or I give it to whatever cause I want, or I use it to buy weapons. And then\n\n2:23:40.800 --> 2:23:47.040\n you find a loaf of bread cost triple next month is what it costs. And your life savings is worthless.\n\n2:23:47.040 --> 2:23:53.280\n And so in that environment, everybody's ripped back to Stone Age barter. And the problem with\n\n2:23:53.280 --> 2:23:58.080\n that even Stone Age barter is you're going to carry your life savings on your back. And what\n\n2:23:58.080 --> 2:24:01.600\n happens when the guy with a machine gun points it at your head and just takes your life savings.\n\n2:24:01.600 --> 2:24:10.080\n So I think from Jack's point of view, he thinks that life is, this is maybe too strong, but these\n\n2:24:10.080 --> 2:24:14.560\n are my words, life is hopeless. It's hopeless. It's hopeless. It's hopeless. It's hopeless.\n\n2:24:14.560 --> 2:24:24.240\n It's hopeless for a lot of people. And Bitcoin is hope. Right? Because it gives everyone\n\n2:24:26.800 --> 2:24:34.160\n an engineered monetary asset that's a bearer instrument. And it gives them a bank on their\n\n2:24:34.160 --> 2:24:41.600\n mobile phone. And they don't have to trust their government or another counterparty\n\n2:24:41.600 --> 2:24:50.400\n with their life force. So there's a secondary thing I think he's interested in, which is the\n\n2:24:50.400 --> 2:24:57.680\n first thing is the human rights issue. And the second thing would be the friction to trade cross\n\n2:24:57.680 --> 2:25:07.680\n borders is so great. Right? Like, you know, you like AI. So I'll give you a beautiful notion.\n\n2:25:07.680 --> 2:25:14.560\n Maybe one day there'll be an artificially intelligent creature in cyberspace that is\n\n2:25:14.560 --> 2:25:25.680\n self sufficient and rich. Like that, we would have sovereignty. Can a robot own money or property?\n\n2:25:26.320 --> 2:25:32.240\n How about kind of Tesla car? Can I actually put enough money in a car for it to drive itself and\n\n2:25:32.240 --> 2:25:38.400\n maintain itself forever? Or can I create an artificially intelligent creature in cyberspace\n\n2:25:38.400 --> 2:25:43.840\n that is endowed such that it would live a thousand years and continue to do its job?\n\n2:25:44.640 --> 2:25:50.400\n Right? You know, we have a word for that in the real world is institution, Harvard, Cambridge,\n\n2:25:50.400 --> 2:25:55.040\n Stanford, right? There are institutions with endowments that go on in perpetuity.\n\n2:25:55.040 --> 2:26:05.760\n But what if I wanted to perpetuate a software program? And with something like digital property\n\n2:26:05.760 --> 2:26:15.440\n with Bitcoin and lightning, you could do it. And on the other hand, with banks and credit cards,\n\n2:26:15.440 --> 2:26:23.760\n you couldn't, right? You couldn't ever. So, so you can create things that are beautiful and lasting.\n\n2:26:25.200 --> 2:26:31.920\n And what's the difference in speed? Well, so I can either trade with everybody in the world\n\n2:26:32.880 --> 2:26:41.200\n at the speed of light, friction free in 24 hours writing a Python script, or I can spend $100 billion\n\n2:26:41.200 --> 2:26:48.560\n to trade with a few million people in the world after it takes them six months of application.\n\n2:26:48.560 --> 2:26:56.080\n The impedance is like a 10 million to one difference, right? And the metaphors are\n\n2:26:56.080 --> 2:27:02.880\n literally like launching something in orbit versus almost orbit or vacuum sealing something.\n\n2:27:03.440 --> 2:27:07.120\n Does it last forever and does it orbit forever or does it go away?\n\n2:27:07.120 --> 2:27:12.720\n Does it last forever and does it orbit forever or does it go up and come down and burn up?\n\n2:27:13.760 --> 2:27:21.280\n Right. And I think Jack is interested in, you know, putting freedom in orbit. All right.\n\n2:27:21.280 --> 2:27:22.960\n Putting freedom.\n\n2:27:22.960 --> 2:27:26.400\n Putting freedom in orbit. And he said it many times. He said,\n\n2:27:26.400 --> 2:27:34.640\n this is the internet needs a native currency. Right. And no political construct or security\n\n2:27:34.640 --> 2:27:40.080\n can be a native currency. You need a property and you need a property that can be moved a million\n\n2:27:40.080 --> 2:27:46.800\n times a second. Can you oscillate it at 10 kilohertz or a hundred kilohertz? And the answer\n\n2:27:46.800 --> 2:27:54.880\n is only if it's a pure digital construct, permissionless and open. And so I think\n\n2:27:54.880 --> 2:28:00.400\n that he's enthusiastic as the technologist and he's enthusiastic as the humanitarian.\n\n2:28:00.400 --> 2:28:05.520\n And what he's doing is support both those areas. He's supporting the Bitcoin and the lightning\n\n2:28:05.520 --> 2:28:09.920\n protocol by building them into his products, but he's also building the applications,\n\n2:28:10.800 --> 2:28:17.280\n which you need at the cash app level in order to commercialize and deliver the functionality\n\n2:28:17.280 --> 2:28:20.640\n and the compliance necessary and they're related.\n\n2:28:21.760 --> 2:28:28.240\n And I should also say he's just a fascinating person. I, for a random reason that\n\n2:28:28.240 --> 2:28:35.040\n I couldn't even explain. If I tried, I met him a few days ago and gave him a great big hug in the\n\n2:28:35.040 --> 2:28:40.400\n middle of nowhere. There was no explanation. He just appeared. That's a fascinating human,\n\n2:28:40.400 --> 2:28:46.400\n his relationship with art, with the world, with human suffering, with technology is fascinating.\n\n2:28:47.760 --> 2:28:53.440\n I don't know what his path looks like, but it's interesting that people like that exist.\n\n2:28:53.440 --> 2:28:59.360\n And in part, I'm saddened that he no longer is involved with Twitter directly as a CEO,\n\n2:29:00.080 --> 2:29:07.200\n because I was hoping something inside Twitter would also integrate some of these ideas of what\n\n2:29:07.200 --> 2:29:13.600\n you're calling digital energy to see how social networks, something I'm really interested in and\n\n2:29:13.600 --> 2:29:18.320\n passionate about could be transformed. Let me ask you just for educational purposes,\n\n2:29:18.320 --> 2:29:24.080\n what's the, can you please explain to me what web three and the beef between Jack and Mark\n\n2:29:24.080 --> 2:29:30.560\n Andreessen is exactly? Did you see what happened? Sorry to have you analyze Twitter like it's\n\n2:29:30.560 --> 2:29:36.480\n Shakespeare, but can you please explain to me why, why there was any, any drama over this topic?\n\n2:29:37.440 --> 2:29:43.840\n First of all, web three is a term that's used to refer to, you know,\n\n2:29:43.840 --> 2:29:49.280\n the part of the economy that's token financed. So if I'm launching an application and my idea\n\n2:29:49.280 --> 2:29:55.600\n is to create a token along with the application and issue the token to the community so as to\n\n2:29:55.600 --> 2:30:03.280\n finance the application and build support for it, I think that that's the most common\n\n2:30:03.280 --> 2:30:08.000\n interpretation of web three. There are other interpretations too. So I'm just going to refer\n\n2:30:08.000 --> 2:30:15.120\n to that one. And I think the beef in a nutshell, not articulated, but I'll articulate it is whether\n\n2:30:15.120 --> 2:30:21.520\n or not you should focus all your energy creating applications on top of an ethical digital property\n\n2:30:21.520 --> 2:30:32.320\n like Bitcoin, or whether you should attempt to create a competitor to it, which generally would\n\n2:30:32.320 --> 2:30:38.000\n be deemed as a security by the Bitcoin community. So I'm going to put on my Bitcoin hat here. Yeah.\n\n2:30:38.000 --> 2:30:42.720\n Right. All the tokens that are, if it's driven by a venture capitalist, well, it's a security.\n\n2:30:42.720 --> 2:30:49.200\n If there's a CEO and a CTO, it's a security. All these projects, they're companies. Foundations\n\n2:30:49.200 --> 2:30:55.600\n are companies, right? If you call them a project or a foundation, it doesn't make it not a security.\n\n2:30:55.600 --> 2:31:02.400\n They're all, in essence, collections of individuals that are issuing equity in the form of a token.\n\n2:31:03.360 --> 2:31:15.600\n And if there's a pre mine, an IPO, an ICO, a foundation, or any kind of protocol where there's\n\n2:31:15.600 --> 2:31:21.840\n a group of engineers that have influence over it, then that's a security.\n\n2:31:21.840 --> 2:31:32.080\n If there's a group of engineers that have influence over it, then to a securities lawyer, or to most\n\n2:31:32.080 --> 2:31:35.920\n Bitcoiners and definitely to anybody that's steeped in securities law, you're looking to say,\n\n2:31:35.920 --> 2:31:43.440\n well, that passes the Howey test. It looks like a security. It should be sold to the public pursuant\n\n2:31:43.440 --> 2:31:52.240\n to disclosures and regulations. And you're just ducking the IPO process, right? And so now we get\n\n2:31:52.240 --> 2:31:59.840\n back to the ethical issue. The ethical issue is if you're trading it as a commodity and representing\n\n2:31:59.840 --> 2:32:05.920\n it as a commodity, while truthfully it's a security, then it's a violation of ethics rules,\n\n2:32:05.920 --> 2:32:10.640\n and it's probably illegal. Well, you keep leaning on this. Let me push back on that part. Maybe you\n\n2:32:10.640 --> 2:32:17.440\n hit me, but you keep leaning on this line of securities law as if it would all do respect to\n\n2:32:17.440 --> 2:32:25.520\n lawyers, as if that line somehow defines what is and isn't ethical. I think there's a lot of\n\n2:32:25.520 --> 2:32:32.640\n correlation as you've discussed, but I'd like to leave the line aside. If the law calls something\n\n2:32:32.640 --> 2:32:39.520\n as a security, it doesn't mean in my eyes that it is unethical. I mean, there could be some\n\n2:32:39.520 --> 2:32:44.480\n technicalities and lawyers and people play games with this kind of stuff all the time. But I take\n\n2:32:44.480 --> 2:32:49.520\n your bigger point that if there's a CEO, if there's a project lead, that's fundamentally,\n\n2:32:49.520 --> 2:32:54.560\n well, that to you is fundamentally different than the structure of Bitcoin.\n\n2:32:54.560 --> 2:32:59.200\n It's not that creating securities is unethical. I created security. I took a company public,\n\n2:32:59.840 --> 2:33:04.320\n right? That's not the unethical part. It's completely ethical to create securities.\n\n2:33:04.320 --> 2:33:09.520\n A block is a security. All companies are securities. The unethical part is to\n\n2:33:09.520 --> 2:33:15.760\n represent it as property when it's a security and to promote it or trade it as such.\n\n2:33:16.480 --> 2:33:25.760\n This whole promotion, that's also a technical thing because what counts and not as promotion\n\n2:33:25.760 --> 2:33:31.280\n is a legal thing and you get in trouble for all these things, but that's the game that lawyers\n\n2:33:31.280 --> 2:33:39.120\n play. There's an ethical thing here, which is what's right to promote and not. To me, propaganda is\n\n2:33:39.120 --> 2:33:46.960\n unethical, but it's usually not illegal. If you roll the clock back 20 years,\n\n2:33:48.320 --> 2:33:52.560\n all the boiler room pump and dump schemes were all about someone pitching a penny stock,\n\n2:33:53.200 --> 2:34:00.480\n selling Swampland in Florida. And if you roll the clock back forward 20 years and I create my own\n\n2:34:00.480 --> 2:34:06.880\n company and I represent it as the same thing and I don't make the disclosures, you're just one step\n\n2:34:06.880 --> 2:34:13.840\n removed from the boiler room scheme and that's what's distasteful about it. There are ways to\n\n2:34:13.840 --> 2:34:20.960\n sell securities to the public, but there are expectations. Maybe we could forget about whether\n\n2:34:20.960 --> 2:34:27.200\n the security laws are ethical or not. I will leave that alone. We'll just start with the biblical\n\n2:34:27.200 --> 2:34:33.920\n definition of ethics. Don't lie, cheat, or steal. So if I'm going to sell something to you, I need\n\n2:34:33.920 --> 2:34:42.400\n to fully disclose what I'm selling to you, right? And that's a matter of great debate right now.\n\n2:34:42.400 --> 2:34:47.840\n And so I think that that's part of the debate. But the other part of the debate is\n\n2:34:47.840 --> 2:34:56.560\n whether or not we need more than one token. We need at least one, right? We need at least one\n\n2:34:56.560 --> 2:35:05.440\n digital property because zero means there is no digital economy. And by the way, the conventional\n\n2:35:05.440 --> 2:35:10.240\n view of maximalists is they think there's only one and everything else isn't. That's not the point\n\n2:35:10.240 --> 2:35:16.080\n I'm going to make. I would say we know that there is at least one digital property.\n\n2:35:16.080 --> 2:35:26.080\n And that is Bitcoin. If you can create a truly decentralized, noncustodial, bearer instrument\n\n2:35:26.880 --> 2:35:34.720\n that is not under the control of any organization that is fairly distributed, then you might create\n\n2:35:34.720 --> 2:35:42.080\n another or multiple. And there may be others out there. But I think that\n\n2:35:42.080 --> 2:35:48.960\n the frustration of a lot of people in the Bitcoin community, and I share this with Jack, is we could\n\n2:35:48.960 --> 2:35:55.680\n create $100 trillion of value in the real world simply by building applications on top of Bitcoin\n\n2:35:56.320 --> 2:36:06.080\n as a foundation. And so continually trying to reinvent the wheel and create competitive things\n\n2:36:06.080 --> 2:36:16.800\n is a massive waste of time and it's diversion of human creativity. It's like we have an ethical good\n\n2:36:16.800 --> 2:36:23.680\n thing. And now we're going to try to create a third or a fourth one. Why?\n\n2:36:23.680 --> 2:36:28.800\n Well, let's talk about it. So first of all, I'm with you. But let me ask you this interesting\n\n2:36:28.800 --> 2:36:32.320\n question because we talked about properties and securities, and we talked about how you\n\n2:36:32.320 --> 2:36:43.120\n have a popular Twitter account. It's hilarious and insightful. You do promote Bitcoin, in a sense.\n\n2:36:43.120 --> 2:36:48.160\n I don't know if you would say that. But do you think there's a conflict of interest in anyone\n\n2:36:48.160 --> 2:36:54.320\n who owns Bitcoin promoting Bitcoin? Is it the same as you promoting the first Bitcoin?\n\n2:36:54.320 --> 2:37:07.120\n I would say no, there's an interest. I think that you can promote a property or an idea to the extent\n\n2:37:07.120 --> 2:37:15.120\n that you don't control it. I think that the point at which you start to have a conflict of interest\n\n2:37:15.120 --> 2:37:22.080\n is that you don't control it. I think that the point at which you start to have a conflict of\n\n2:37:22.080 --> 2:37:28.160\n interest is when you're promoting a proprietary product or a proprietary security. A security,\n\n2:37:28.160 --> 2:37:34.320\n in general, is a proprietary asset. So for example, if you look at my Twitter, you will find\n\n2:37:34.320 --> 2:37:39.200\n that I make lots of statements about Bitcoin. You won't ever see me making a statement that,\n\n2:37:39.200 --> 2:37:47.120\n say, MicroStrategy stock will go up forever. I'm not promoting a security MSTR because at the end\n\n2:37:47.120 --> 2:37:54.000\n of the day, MSTR is a security. It is proprietary. I have proprietary interest in it. I have\n\n2:37:54.480 --> 2:37:59.600\n a disproportionate amount of control and influence on the direction.\n\n2:37:59.600 --> 2:38:03.920\n The control is the problem. The control is the problem. Because you have interest in both.\n\n2:38:04.640 --> 2:38:12.880\n If Bitcoin is as successful as we're talking about, you very possibly can become the richest\n\n2:38:12.880 --> 2:38:19.680\n human on earth, given how much you own in Bitcoin, right? The wealthiest, not the richest. I don't\n\n2:38:19.680 --> 2:38:20.800\n know what those words mean.\n\n2:38:20.800 --> 2:38:22.960\n I would benefit economically.\n\n2:38:22.960 --> 2:38:24.720\n You would benefit economically.\n\n2:38:24.720 --> 2:38:25.360\n That's true.\n\n2:38:25.360 --> 2:38:35.280\n So the reason that's not conflict of interest is because the word property, that Bitcoin is an idea\n\n2:38:35.280 --> 2:38:37.600\n and Bitcoin is open.\n\n2:38:37.600 --> 2:38:45.920\n It's because I don't own it. I don't control it. In essence, the ethical line here is,\n\n2:38:45.920 --> 2:38:49.840\n could I print myself 10 million more Bitcoin or not, right?\n\n2:38:51.120 --> 2:38:57.520\n Or can anyone, right? It's not just you. Can anyone? Because can you promote somebody else's?\n\n2:38:57.520 --> 2:39:04.640\n Yes, I guess you can. Like, can you promote Apple when you have no stake?\n\n2:39:04.640 --> 2:39:11.280\n You could have a Twitter account where you promote oil or you promote camping or you promote\n\n2:39:11.280 --> 2:39:16.800\n family values or promote, you know, a carnivore diet or promote the Iron Man, right?\n\n2:39:17.520 --> 2:39:23.280\n You're not going to get wealthier if you promote camping because you can't own a stake. I mean,\n\n2:39:24.880 --> 2:39:30.480\n you own a lot of Bitcoin. What is that? Don't you own the stake in the idea?\n\n2:39:30.480 --> 2:39:33.520\n Yeah, I would grant you that.\n\n2:39:34.720 --> 2:39:40.400\n But the lack of control is the fundamental ethical line that you just, you don't have,\n\n2:39:41.040 --> 2:39:45.360\n all you are is you're a fan of the idea. You believe in the idea and the power of the idea.\n\n2:39:47.760 --> 2:39:49.600\n You can't take that idea away from others.\n\n2:39:50.240 --> 2:39:54.800\n Let's come back to, let me give you some maybe easier examples. If you were the head of the\n\n2:39:54.800 --> 2:40:05.920\n Marine Corps, right? And someone came to you and said, I created MarineCoin. And the twist on\n\n2:40:05.920 --> 2:40:12.560\n MarineCoin is I want you to tell every Marine that they'll get an extra MarineCoin when they\n\n2:40:13.280 --> 2:40:19.360\n get their next stripe. And then I'm going to let you buy MarineCoin now. And then after you buy\n\n2:40:19.360 --> 2:40:29.120\n MarineCoin, I want you to promote it to them, right? At some point, if you start to have a\n\n2:40:29.120 --> 2:40:34.240\n disproportional influence on it, or if you're in a conversation with people with disproportionate\n\n2:40:34.240 --> 2:40:38.880\n influence becomes conflict of interest, and it would make you profoundly uncomfortable, I think,\n\n2:40:39.680 --> 2:40:44.320\n if the head of the Marine Corps started promoting anything that looked like a security.\n\n2:40:44.320 --> 2:40:50.480\n Now, if the head of the Marine Corps started promoting canoeing, you might think he's kind\n\n2:40:50.480 --> 2:40:58.240\n of wacky, like maybe, like that's kind of a waste of time and distraction. So, but to the extent\n\n2:40:58.240 --> 2:41:05.520\n that canoeing is not a security, not a problem, unless you, you know, ultimately, the issue of\n\n2:41:05.520 --> 2:41:11.280\n decentralization is really a critical one. So not having a head. So is it something,\n\n2:41:11.280 --> 2:41:18.960\n can Bitcoin be replicated? So the, all the things that you're saying that make it a property,\n\n2:41:18.960 --> 2:41:20.960\n can that be replicated? Have any other...\n\n2:41:20.960 --> 2:41:24.480\n I think it's possible to create other crypto properties.\n\n2:41:24.480 --> 2:41:32.080\n Does it, does the having a head, like of a project, a thing that limits its ability to be a\n\n2:41:32.080 --> 2:41:38.480\n property, if you try to replicate a project? Is that the fundamental flaw?\n\n2:41:38.480 --> 2:41:45.360\n No, I, look, I think the real fundamental issue is you just never want it to change.\n\n2:41:46.480 --> 2:41:54.000\n Like, like, if you really want something decentralized, you want a genetic template\n\n2:41:54.000 --> 2:42:00.480\n that substantially is not going to change for a thousand years. So I think Satoshi said it at one\n\n2:42:00.480 --> 2:42:06.160\n point, he said the nature of the software is such that by version 0.1, its genetic code was set.\n\n2:42:06.160 --> 2:42:11.280\n If, if there was any development team that's continually changing it, you know, on a routine\n\n2:42:11.280 --> 2:42:18.240\n basis, it becomes harder and harder to maintain its decentralization because now, now there's the\n\n2:42:18.240 --> 2:42:28.400\n issue of who's influencing the changes. So what you really want is, is a very, very simple idea,\n\n2:42:28.400 --> 2:42:33.680\n right? The simplest idea, I'm just going to keep track of who owns 21 million parts of energy.\n\n2:42:33.680 --> 2:42:40.160\n And when someone proposes big functional upgrades, you almost don't, you don't really want that\n\n2:42:40.160 --> 2:42:44.560\n development to go on the base layer. You want that development to go on the layer threes, because\n\n2:42:46.000 --> 2:42:50.640\n now, cache app has a proprietary set of functionality and it's a security.\n\n2:42:51.440 --> 2:42:56.400\n And if you're going to promote the use of this thing, you're not going to, you're not going to\n\n2:42:56.400 --> 2:43:04.080\n promote the layer three security because that's a, an edge to a given entity and you're trusting\n\n2:43:04.080 --> 2:43:09.440\n the counterparty, you're going to promote the layer one or at most the layer two.\n\n2:43:09.440 --> 2:43:18.640\n Okay. So one of the fascinating things about Bitcoin, and sorry to romanticize certain notions,\n\n2:43:18.640 --> 2:43:24.640\n but Satoshi Nakamoto, that the founder is anonymous. Maybe you can speak a little bit\n\n2:43:24.640 --> 2:43:31.680\n about that. Maybe you can speak to whether that's useful, but also I just like the psychology of\n\n2:43:31.680 --> 2:43:36.080\n that to imagine that there's a human being that was able to create something special and walk away.\n\n2:43:37.040 --> 2:43:39.600\n So first are you Satoshi Nakamoto?\n\n2:43:40.240 --> 2:43:49.200\n I'm certain I'm not. No, actually I, you know, I think the providence is really important. And\n\n2:43:49.200 --> 2:43:55.200\n if I were to look at the highlighted points, I think having a founder that was anonymous\n\n2:43:55.200 --> 2:44:00.320\n or should anonymous is important. I think the founder disappearing is also important. I think\n\n2:44:00.320 --> 2:44:07.600\n that the fact that the Satoshi coins never moved is also important. I think the lack of an initial\n\n2:44:07.600 --> 2:44:14.720\n coin offering is also important. I think the lack of a corporate sponsor is important. I think the\n\n2:44:14.720 --> 2:44:22.880\n fact that it traded for 15 months with no commercial value was also important. I think that\n\n2:44:24.720 --> 2:44:31.840\n the simplicity of the protocol is very important. I think that the outcome of the block size wars\n\n2:44:31.840 --> 2:44:40.800\n is very important. And all of those things add up to common property. They're all indicia,\n\n2:44:40.800 --> 2:44:47.360\n indicators of a digital property as opposed to security. If there was a Satoshi sitting around,\n\n2:44:47.360 --> 2:44:53.360\n sitting on top of $50 billion worth of Bitcoin, I don't think it would\n\n2:44:55.200 --> 2:45:02.080\n cripple Bitcoin as property, but I think it would undermine its digital property.\n\n2:45:02.080 --> 2:45:07.040\n And if I wanted to undermine a crypto asset network, I would do the opposite of all those\n\n2:45:07.040 --> 2:45:14.560\n things. I would launch one myself, I would sell 25% or 50% of the general public, I would keep some\n\n2:45:14.560 --> 2:45:19.040\n of the initial, I would pre mine some stuff or early mine it, you know, and I would keep an\n\n2:45:19.040 --> 2:45:27.680\n influence on it. Those are all the opposite of what you would do in order to create common property.\n\n2:45:28.400 --> 2:45:36.160\n And so I see the entire story as Satoshi giving a gift of digital property to the human race\n\n2:45:36.160 --> 2:45:37.440\n and disappearing.\n\n2:45:37.440 --> 2:45:41.040\n Do you think it was one person? Do you have ideas of who it could be?\n\n2:45:41.040 --> 2:45:43.680\n I don't care to speculate.\n\n2:45:44.960 --> 2:45:46.240\n But do you think it was one person?\n\n2:45:47.040 --> 2:45:51.920\n It was one person, maybe in conjunction with a bunch of others. I mean, it might have been a\n\n2:45:51.920 --> 2:45:55.520\n group of people that were working together, but certainly there's a Satoshi.\n\n2:45:55.520 --> 2:46:01.520\n I mean, it's just so fascinating to me that one person could be so brave and thoughtful. Or do you\n\n2:46:01.520 --> 2:46:06.640\n think a lot of his accent, like the block size wars, the decision to make a block a certain size,\n\n2:46:07.600 --> 2:46:12.880\n all the things you mentioned led up to the characteristics that make Bitcoin property.\n\n2:46:14.080 --> 2:46:19.680\n Do you think that's an accident? Or it was deeply thought through? Like how does this is almost like\n\n2:46:19.680 --> 2:46:21.040\n a history of science question.\n\n2:46:21.040 --> 2:46:26.160\n They tried 40 of them, right? I mean, I think there's a there's a history of attempting to\n\n2:46:26.160 --> 2:46:30.960\n create something like this. And it was tried many, many times and, and they failed for different\n\n2:46:30.960 --> 2:46:36.960\n reasons. And I think that it's like Prometheus tried to start a fire 47 times and maybe the 48th\n\n2:46:36.960 --> 2:46:44.720\n time it sparked. And that's how I see this. This is the first one that sparked. And it sets a\n\n2:46:44.720 --> 2:46:51.760\n roadmap for us. And I think if you're looking for any one word that characterizes it, it's fair.\n\n2:46:51.760 --> 2:46:59.840\n The whole point of the network is it's a fair launch, a fair distribution. Like, yeah, I have\n\n2:46:59.840 --> 2:47:08.560\n Bitcoin, but I bought it. In fact, I, you know, at this point, we've paid $4 billion of you real\n\n2:47:08.560 --> 2:47:16.240\n cash to buy it. If I was sitting on the same position, and I had it for free, then there's\n\n2:47:16.240 --> 2:47:21.520\n always this question of, did I, you know, or I bought it for a nickel, a coin or a penny, a coin.\n\n2:47:21.520 --> 2:47:28.160\n The question is, was it fair? And that's a very hard question to answer, right? Did you acquire\n\n2:47:28.160 --> 2:47:34.880\n the Bitcoin that you own fairly? And if you roll the clock back, you know, you could have bought it\n\n2:47:34.880 --> 2:47:40.880\n for a nickel or a dime, but that was when it was a million times more likely to fail, right? When\n\n2:47:40.880 --> 2:47:47.920\n the risk was greater, the cost was lower. And then over time, the risk became lower and the cost\n\n2:47:47.920 --> 2:47:55.920\n became greater. And the real critical thing was to allow the marketplace, absent any powerful\n\n2:47:55.920 --> 2:48:01.440\n interested actor, right? It's almost like if Satoshi had held a million coins and then stayed\n\n2:48:01.440 --> 2:48:07.040\n engaged for 10 more years, tweaking things in the background, there'd still be that question.\n\n2:48:08.080 --> 2:48:14.960\n But what we've got is really a beautiful thing. We've got a chain reaction in cyberspace or an\n\n2:48:14.960 --> 2:48:26.880\n ideology spreading virally in the world that has seasoned in a fair ethical fashion. Sometimes it's\n\n2:48:26.880 --> 2:48:32.240\n a very violent, brutal fashion with all the volatility, right? And there's been a lot of,\n\n2:48:32.240 --> 2:48:34.960\n you know, a lot of sound and fury along the way.\n\n2:48:34.960 --> 2:48:41.360\n How do you psychoanalyze? How do you deal from a financial, from a human perspective with the\n\n2:48:41.360 --> 2:48:46.880\n volatility? You mentioned you could have gotten it for a nickel and the risk was great. Where's the\n\n2:48:46.880 --> 2:48:48.720\n risk today? What's your sense?\n\n2:48:48.720 --> 2:48:54.640\n You know, we're 13 years into this entire activity. I think the risk has never been lower.\n\n2:48:56.240 --> 2:49:03.600\n If you look at all the risks, right, the risks in the early years are, is the engineering protocol\n\n2:49:03.600 --> 2:49:12.560\n proper? Like one megabyte block size, 10 minute clock frequency cryptography is first, will it be\n\n2:49:12.560 --> 2:49:19.360\n hacked or will it crash? 730,000 blocks and it hasn't crashed. Will it be hacked? Hasn't been\n\n2:49:19.360 --> 2:49:23.600\n hacked. But you know, it's a Lindy thing, right? You wait 13 years to see if it'll be hacked.\n\n2:49:23.600 --> 2:49:28.960\n But on the other hand, with a billion dollars, it's not as interesting a target as it is with\n\n2:49:28.960 --> 2:49:35.600\n a hundred billion. And when it gets to be worth a trillion, then it's a bigger target. So the\n\n2:49:35.600 --> 2:49:43.840\n risk has been bleeding off over time as the network monetized. I think the second question is,\n\n2:49:43.840 --> 2:49:49.440\n will it be banned? You couldn't know. It literally could have been banned at any time, many times\n\n2:49:49.440 --> 2:49:54.880\n early on. In fact, in 2013, I tweeted on that subject. I thought it would be banned. I made a\n\n2:49:54.880 --> 2:50:03.760\n very infamous tweet. I thought it was going to be banned. In 2014, the IRS designated it as\n\n2:50:03.760 --> 2:50:09.680\n property and gave it property tax treatment, okay? So they could have given it a tax treatment where\n\n2:50:09.680 --> 2:50:15.360\n you had to pay tax on the unrealized capital gains every year and it probably would have\n\n2:50:15.360 --> 2:50:25.040\n crushed it to death, right? So it could have been in any number of places banned by a government.\n\n2:50:25.040 --> 2:50:29.920\n But in fact, it was legitimized as property. And then the question is, would it be hacked\n\n2:50:29.920 --> 2:50:34.640\n or would it be copied? Well, it'd be something better than that. And it was copied 15,000 times.\n\n2:50:34.640 --> 2:50:41.040\n And you know the story of all those. And they either diverged to be something totally different\n\n2:50:41.040 --> 2:50:48.000\n and not comparable or someone trying to copy a non sovereign bearer instrument store of value\n\n2:50:48.000 --> 2:50:56.240\n found that their networks crashed to be 1% of what Bitcoin is. So now we're sitting at a point where\n\n2:50:56.240 --> 2:51:01.760\n all those risks are out of the way. I would say that year one of institutional adoption\n\n2:51:02.560 --> 2:51:08.800\n is it started August 2020. That's when MicroStrategy bought $250 million worth of\n\n2:51:08.800 --> 2:51:13.760\n Bitcoin and we put that on the wire. We were the first publicly traded company to actually buy\n\n2:51:15.120 --> 2:51:18.720\n Bitcoin. I don't think you could have found a $5 million purchase from a public company\n\n2:51:18.720 --> 2:51:25.200\n before we did that. So that was kind of like a gun going off. And then in the next 12 months,\n\n2:51:26.400 --> 2:51:32.720\n Tesla bought Bitcoin, Square bought Bitcoin. And I'd say now we're in year two of institutional\n\n2:51:32.720 --> 2:51:38.640\n adoption. And there are about 24, should be 24 publicly traded Bitcoin miners by the end of this\n\n2:51:38.640 --> 2:51:48.800\n quarter. So you're looking at 36 publicly traded companies. And you've got 50, at least in the\n\n2:51:48.800 --> 2:51:55.600\n range of $50 billion of Bitcoin on the balance sheet of publicly traded companies and hundreds\n\n2:51:55.600 --> 2:52:03.600\n of billions of dollars of market cap of Bitcoin exposed companies. So I would say the asset,\n\n2:52:04.720 --> 2:52:14.000\n decade one was entrepreneurial, experimental. Decade two is a rotation from entrepreneurs\n\n2:52:14.000 --> 2:52:19.280\n institutions and is becoming institutionalized. So maybe decade one, you go from zero to a trillion\n\n2:52:19.280 --> 2:52:22.080\n and a decade two, you go from one trillion to a hundred trillion.\n\n2:52:22.080 --> 2:52:25.600\n Trey Lockerbie What about governments, government adoption,\n\n2:52:25.600 --> 2:52:31.440\n institutional adoption? Are governments important in this? Maybe making it some governments\n\n2:52:32.160 --> 2:52:39.120\n incorporating it into as a currency into their banks, all that kind of stuff. Is that important?\n\n2:52:39.120 --> 2:52:41.680\n And if it is, when will it happen?\n\n2:52:41.680 --> 2:52:45.360\n John Ligato It's not essential for the success of the asset\n\n2:52:45.360 --> 2:52:52.560\n class, but I think it's inevitable in various degrees over time. But the most likely thing\n\n2:52:52.560 --> 2:53:02.800\n to happen next is large acquisitions by institutional investors of Bitcoin as a digital\n\n2:53:02.800 --> 2:53:08.000\n gold, where they're just swapping out gold for digital gold and thinking of it like that.\n\n2:53:08.560 --> 2:53:12.160\n And the government entities most likely to be involved with that would be sovereign wealth\n\n2:53:12.160 --> 2:53:18.160\n funds. If you look at all the sovereign wealth funds that are holding big tech stock, equities,\n\n2:53:18.160 --> 2:53:24.800\n the Swiss, the Norwegians, the Middle Easterners, if you can hold big tech, then holding digital\n\n2:53:24.800 --> 2:53:32.240\n gold would be not far removed from that. That's a noncontroversial adoption.\n\n2:53:33.440 --> 2:53:40.320\n I think there are opportunities for governments that are much more profound. If a government\n\n2:53:40.320 --> 2:53:48.880\n started to adopt Bitcoin as a treasury reserve asset, that's much bigger than just an asset\n\n2:53:48.880 --> 2:53:56.640\n investment. That's 100x bigger. And you could imagine that's like a trillion dollar opportunity.\n\n2:53:56.640 --> 2:54:01.040\n Like any government that wanted to adopt it as a treasury reserve asset would probably\n\n2:54:01.040 --> 2:54:08.560\n generate trillions of dollars, a trillion or more of value. And then the thing that people\n\n2:54:08.560 --> 2:54:14.640\n think about is, well, will oil ever be priced in Bitcoin or any other export commodity?\n\n2:54:15.680 --> 2:54:21.840\n I think there's like $1.8 trillion or more of export commodities in the world. And right now,\n\n2:54:21.840 --> 2:54:27.520\n they're all priced in dollars. I think that this is a colorful thing, but not really that relevant.\n\n2:54:27.520 --> 2:54:33.360\n Like you could sell all that stuff in dollars. The relevant decision that any institution makes,\n\n2:54:33.360 --> 2:54:38.720\n whether they're a nonprofit, a university, a corporation, or a government, is what's your\n\n2:54:38.720 --> 2:54:44.960\n treasury reserve asset? And if your treasury reserve asset is the peso, and if the peso is\n\n2:54:45.760 --> 2:54:56.160\n losing 20% or 30% of its value a year, then your balance sheet is collapsing within five years.\n\n2:54:56.160 --> 2:55:03.120\n And if the treasury reserve asset is dollars and currency derivatives and US treasuries,\n\n2:55:04.080 --> 2:55:12.000\n then you're getting your seven. Right now, it's probably 15% or more monetary inflation. We're\n\n2:55:12.000 --> 2:55:16.640\n running double the historic average. You could argue triple, somewhere between double and triple,\n\n2:55:16.640 --> 2:55:23.360\n depending upon what your metric is. So do I think it'll happen? I think that they're conservative,\n\n2:55:23.360 --> 2:55:30.560\n but they have to be shocked. And I think there is a shock. The late Russian sanctions are a big\n\n2:55:30.560 --> 2:55:36.560\n shock. When the West sees $300 billion worth of Russian gold and currency derivatives, I think\n\n2:55:37.440 --> 2:55:45.520\n you got the famous quote by Putin that we have to rethink our treasury strategies. And that pushes\n\n2:55:45.520 --> 2:55:50.880\n everybody toward a commodity strategy. What commodities do I want to hold? I think that's\n\n2:55:50.880 --> 2:55:54.720\n got a lot of people thinking. I think it's got the Chinese thinking. Everybody wants to be the\n\n2:55:54.720 --> 2:56:03.280\n reserve currency, right? So if I buy $50 billion worth of dollars every year, then I buy $500\n\n2:56:03.280 --> 2:56:15.280\n billion over a decade, and I probably pay $250 billion of inflation cost on the backs of my\n\n2:56:15.280 --> 2:56:22.320\n on the backs of my citizens in a decade. So inflation could be one of the sources of shock.\n\n2:56:23.040 --> 2:56:29.840\n And you wonder if there is a switch to Bitcoin, whether it will be a bang or a whimper. Like,\n\n2:56:29.840 --> 2:56:37.040\n what is the nature of the shock or the transition? I think that the year 2022 is pretty catalytic\n\n2:56:38.000 --> 2:56:43.840\n for digital assets in general and for Bitcoin in particular. The Canadian trucker crisis,\n\n2:56:43.840 --> 2:56:50.480\n I think, educated hundreds of millions of people and made them start questioning their property\n\n2:56:50.480 --> 2:56:59.760\n rights and their banks. I think the Ukraine war was a second shock. But I think that the Russian\n\n2:56:59.760 --> 2:57:08.160\n sanctions was a third shock. Yeah, I think all three of them. And I think hyperinflation in the\n\n2:57:08.160 --> 2:57:12.720\n rest of the world is a fourth shock. And then persistent inflation in the US is a fifth shock.\n\n2:57:12.720 --> 2:57:19.840\n So I think it's a perfect storm. And if you put all these events together, what do they signify?\n\n2:57:19.840 --> 2:57:27.120\n They signify the rational conclusion for any person thinking about this is, I'm not sure if I\n\n2:57:27.120 --> 2:57:32.720\n can trust my property. I don't know if I have property rights. I don't know if I can trust the\n\n2:57:32.720 --> 2:57:40.880\n bank. And if I'm politically at odds with the leader of my own country, I'm going to lose my\n\n2:57:40.880 --> 2:57:47.040\n property. And if I'm politically at odds with the owner of another country, I'm still going to lose\n\n2:57:47.040 --> 2:57:53.840\n my property. And when push comes to shove, the banks will freeze my assets and seize them.\n\n2:57:54.640 --> 2:58:05.280\n And I think that that is playing out in front of everybody in the world, such that your logical\n\n2:58:05.280 --> 2:58:13.520\n response would be, I'm going to convert my weak currency to a strong currency. Like I'll convert\n\n2:58:13.520 --> 2:58:20.160\n my peso and lira to the dollar. I'm going to convert my weak property to strong property.\n\n2:58:20.640 --> 2:58:29.040\n I'm going to sell my building downtown Moscow. And I'd rather own a building in New York City. I'd\n\n2:58:29.040 --> 2:58:36.560\n rather own in a powerful nation than be stuck with a building in Nigeria or a building in Argentina\n\n2:58:36.560 --> 2:58:41.520\n or whatever. So I'm going to sell my weak properties to buy strong properties. I'm going to\n\n2:58:41.520 --> 2:58:47.440\n convert my physical assets to digital assets. I'd rather own a digital building than own a physical\n\n2:58:47.440 --> 2:58:53.440\n building. Because if I had a billion dollar building in Moscow, who can I rent that to?\n\n2:58:53.440 --> 2:58:58.240\n But if I have a billion dollar digital building, I can rent it to anybody in any city in the world,\n\n2:58:59.040 --> 2:59:05.040\n anybody with money. And the maintenance cost is almost nothing. And I can hold it for 100 years.\n\n2:59:05.040 --> 2:59:11.280\n So it's an indestructible building. And then finally, I want to move from having my assets\n\n2:59:11.280 --> 2:59:19.360\n in a bank with a counterparty to self custody assets. And this is not just Ukraine, but this is\n\n2:59:19.360 --> 2:59:26.480\n like the story in Turkey, Lebanon, Syria, Afghanistan, Iraq, South America. You don't\n\n2:59:26.480 --> 2:59:32.320\n really want to be sitting with $10 million in a bank in Istanbul, the bank's going to freeze your\n\n2:59:32.320 --> 2:59:39.440\n money converted to lira, devalue the lira and then feed it back to you over 17 years, right?\n\n2:59:39.440 --> 2:59:42.720\n So self custody assets will be layer one Bitcoin.\n\n2:59:42.720 --> 2:59:49.120\n Self custody assets, it's like, if I if I got my own hardware wallet, and I've either got\n\n2:59:50.800 --> 2:59:56.560\n your highest form of self custody would be Bitcoin on your own hardware wallet or Bitcoin\n\n2:59:56.560 --> 3:00:01.600\n and your own self custody. And the other the other thing people think about is how do I get crypto\n\n3:00:01.600 --> 3:00:08.560\n dollars like tether, like some stable coin? Yeah, like I'd rather if you had a choice, would you\n\n3:00:08.560 --> 3:00:15.200\n rather have your money in a bank in a warzone in dollars or have your money in a stable coin on\n\n3:00:15.200 --> 3:00:22.400\n your mobile phone in dollars? Right? I mean, you take the latter risk rather than the former\n\n3:00:22.400 --> 3:00:27.200\n warzone. Definitely. Yeah. And you can see that happening. Like we've gone from 5 billion in\n\n3:00:27.200 --> 3:00:34.480\n stable coins to 200 billion. Yeah. In the last 24 months. Yeah. So I do think there's massive demand\n\n3:00:34.480 --> 3:00:42.800\n for crypto dollars in the form of a US dollar asset. And there's and everybody in the world\n\n3:00:42.800 --> 3:00:48.960\n would say, Yeah, I want that. Well, unless you're just an extreme patriot, but most people in the\n\n3:00:48.960 --> 3:00:53.520\n world would say I want that. And then a lesser group of people would say, I think I want to be\n\n3:00:53.520 --> 3:01:00.000\n able to carry my property in the palm of my hand. So I have self custody of it. So the\n\n3:01:00.000 --> 3:01:05.120\n Bitcoin price has gone through quite a roller coaster. What do you think is the high point\n\n3:01:05.120 --> 3:01:12.800\n is going to hit? I think it'll go forever. Right? I mean, I think the Bitcoin is going to,\n\n3:01:12.800 --> 3:01:18.560\n it's going to climb in a serpentine fashion, it's going to advance and come back and it's going to\n\n3:01:18.560 --> 3:01:25.360\n keep, it's going to keep climbing. I think that the volatility attracts all the capital\n\n3:01:25.360 --> 3:01:31.040\n into the marketplace. And so the volatility makes it the most interesting thing in the financial\n\n3:01:31.040 --> 3:01:38.240\n universe. It also generates massive yield and massive returns for traders. And that attracts\n\n3:01:38.240 --> 3:01:46.800\n capital. Like we're talking about the difference between 5% return and 500% return. So the fast\n\n3:01:46.800 --> 3:01:53.120\n money is attracted by the volatility. The volatility has been decreasing year by year by\n\n3:01:53.120 --> 3:02:00.080\n year. I think that it's stabilizing. I don't think we'll see as much volatility in the future as we\n\n3:02:00.080 --> 3:02:10.480\n have in the past. I think that if we look at Bitcoin and model it as digital gold, the market\n\n3:02:10.480 --> 3:02:18.880\n cap goes to between 10 and 20 trillion. But gold is, remember, gold is defective property. Gold is\n\n3:02:18.880 --> 3:02:23.760\n dead money. You have a billion dollars of gold that sits in a vault for a decade. It's very hard\n\n3:02:23.760 --> 3:02:28.960\n to mortgage the gold. It's also very hard to rent the gold. You can't loan the gold. No one's going\n\n3:02:28.960 --> 3:02:35.120\n to create a business with your gold. So gold doesn't generate much of a yield. So for that\n\n3:02:35.120 --> 3:02:42.560\n reason, most people wouldn't store a billion dollars for a decade in gold. They would buy a\n\n3:02:42.560 --> 3:02:48.960\n billion dollars of commercial real estate property. And the reason why is because I can rent it and\n\n3:02:48.960 --> 3:02:54.320\n generate a yield on it that's in excess of the maintenance cost. So if you consider digital\n\n3:02:54.320 --> 3:03:04.000\n property, that's 100 to 200 trillion dollar addressable market. So I would think it goes from\n\n3:03:04.000 --> 3:03:08.160\n 10 trillion to 100 trillion as people start to think of it as digital property.\n\n3:03:08.160 --> 3:03:11.680\n What does that mean in terms of price per coin?\n\n3:03:11.680 --> 3:03:20.800\n At 500,000, that's a 10 trillion dollar asset. At 5 million, that's a 100 trillion dollar asset.\n\n3:03:20.800 --> 3:03:23.520\n So I think it crosses a million. It can go even higher.\n\n3:03:24.240 --> 3:03:27.680\n Yeah, I think it keeps going up forever. I mean, there's no reason it couldn't go to 10 million\n\n3:03:27.680 --> 3:03:34.080\n a coin, right? Because digital property isn't the highest form, right? Gold was that low frequency\n\n3:03:34.080 --> 3:03:43.600\n money. Property is a mid frequency money. But when I start to program it faster, it starts to\n\n3:03:43.600 --> 3:03:52.000\n look like digital energy. And then it doesn't just replace property, then you're starting to replace\n\n3:03:52.000 --> 3:03:59.120\n bonds. It's 100 trillion in bonds, there's 50 to 100 trillion in other currency derivatives.\n\n3:04:00.960 --> 3:04:09.840\n And these are all conventional use cases, right? I think that there's 350 trillion to 500 trillion\n\n3:04:09.840 --> 3:04:16.960\n dollars worth of currency derivatives in the world. And when I say that, I mean things that\n\n3:04:16.960 --> 3:04:23.040\n are valued based upon fiat cash flows, any commercial real estate, any bond, any sovereign\n\n3:04:23.040 --> 3:04:30.640\n debt, any currency itself, any derivatives to those things, they're all derivatives,\n\n3:04:30.640 --> 3:04:35.840\n and they're all defective. And they're all defective because of this persistent 7% to 14%\n\n3:04:37.760 --> 3:04:41.760\n lapse, which we call inflation or monetary expansion.\n\n3:04:41.760 --> 3:04:48.000\n Can we switch subjects to talk about the energy side of it, like the innovative piece?\n\n3:04:48.000 --> 3:04:48.320\n Yeah.\n\n3:04:48.320 --> 3:04:53.920\n Let's just start with this idea that I've got a hotel worth a billion dollars with a thousand\n\n3:04:53.920 --> 3:04:56.880\n rooms. When it becomes a dematerialized hotel.\n\n3:04:57.920 --> 3:05:00.880\n I love that word so much, by the way, dematerialized hotel.\n\n3:05:00.880 --> 3:05:04.320\n We're crossing the fountain blow here. Imagine the fountain blow is dematerialized.\n\n3:05:05.200 --> 3:05:09.920\n The problem with a physical hotel is it got to hire real people moving subject to the speed of\n\n3:05:09.920 --> 3:05:15.360\n sound and physics laws and Newton's laws, and I can rent it to people in Miami Beach.\n\n3:05:16.320 --> 3:05:21.680\n But if it was a digital hotel, I could rent the room to people in Paris, London, and New York\n\n3:05:21.680 --> 3:05:28.240\n every night, and I can run it with robots. And as soon as I do that, I can rent it by the room hour,\n\n3:05:28.240 --> 3:05:33.840\n and I can rent it by the room minute. And so I start to chop my hotel up into\n\n3:05:33.840 --> 3:05:40.160\n a hundred thousand room hours that I sell to the highest bidder anywhere in the world.\n\n3:05:40.800 --> 3:05:46.880\n And you can see all of a sudden the yield, the rent, and the income of the property\n\n3:05:47.920 --> 3:05:54.080\n is dramatically increased. I can also see the maintenance cost of the property falls.\n\n3:05:54.640 --> 3:05:59.920\n I get on Moore's Law, and I'm operating in cyberspace. So I got rid of Newton's\n\n3:05:59.920 --> 3:06:06.960\n laws. I got rid of all the friction and all those problems. I tapped into the benefits of cyberspace.\n\n3:06:07.680 --> 3:06:14.880\n I created a global property. I started monetizing at different frequencies. And of course, now I can\n\n3:06:14.880 --> 3:06:21.200\n mortgage it to anybody in the world. You're not going to be able to get a mortgage on a Turkish\n\n3:06:21.200 --> 3:06:28.320\n building from someone in South Africa. You have to find someone that's local to the culture you're in.\n\n3:06:28.320 --> 3:06:34.960\n So when you start to move from analog property to digital property, it's not just a little bit\n\n3:06:34.960 --> 3:06:41.520\n better. It's a lot better. And what I just described, Lex, is like the DeFi vision, right?\n\n3:06:41.520 --> 3:06:48.800\n It's the beauty of DeFi, flash loans, money moving at high velocity. At some point,\n\n3:06:48.800 --> 3:06:57.040\n if the hotel is dematerialized, then what's the difference between renting a hotel room\n\n3:06:57.040 --> 3:07:02.320\n and loaning a block of stock, right? I'm just finding the highest best use of the thing.\n\n3:07:03.120 --> 3:07:10.240\n It feels like the magic really emerges, though, when you build a market of layer two and layer\n\n3:07:10.240 --> 3:07:16.560\n three technologies on top of that. It's like, maybe you can correct me if I'm wrong, but for\n\n3:07:16.560 --> 3:07:22.960\n all these hotels and all these kinds of ideas, it's always touching humans at some point. And\n\n3:07:25.280 --> 3:07:31.120\n consumers or humans, business owners, and so on. So you have to create interface, you have to create\n\n3:07:31.120 --> 3:07:38.000\n services that make all that super efficient, super fun to use, pleasant, effective, all those kinds\n\n3:07:38.000 --> 3:07:42.480\n of things. So you have to build a whole economy on top of that. Yeah, and I happen to think that won't\n\n3:07:42.480 --> 3:07:48.000\n be done by the crypto industry at all. I think that'll be done by centralized applications.\n\n3:07:48.800 --> 3:07:54.720\n I think it'll be the citadels of the world, the high speed traders of the world, the New Yorkers.\n\n3:07:55.520 --> 3:08:03.920\n I think it'll be Binance, FTX, and Coinbase as a layer three exchange that will give you the yield\n\n3:08:03.920 --> 3:08:10.000\n and will give you the loan and the best terms. Because ultimately, you have to jump these\n\n3:08:10.000 --> 3:08:16.720\n compliance hoops. It comes like BlockFi can give you yield, but they have to do it in a compliant\n\n3:08:16.720 --> 3:08:23.280\n way with the United States jurisdiction. So ultimately, those applications to use that digital\n\n3:08:23.280 --> 3:08:29.920\n property and either generate a loan, give you a loan on it or give you yield on it are going to\n\n3:08:29.920 --> 3:08:37.520\n come from companies. But the difference, the fundamental difference is it could be companies\n\n3:08:37.520 --> 3:08:43.120\n anywhere in the world. So if a company in Singapore comes up with a better offering,\n\n3:08:44.640 --> 3:08:50.560\n right, then the capital is going to start to flow to Singapore. I can't send 10 city blocks of\n\n3:08:50.560 --> 3:08:58.640\n LA to Singapore to rent during a festival, but I can send 10 blocks of Bitcoin to Singapore.\n\n3:08:59.280 --> 3:09:05.360\n So you've got a truly global market that's functioning in this asset. And is there second\n\n3:09:05.360 --> 3:09:10.560\n order asset? For example, maybe you're an American citizen and you own 10 Bitcoin and someone in\n\n3:09:10.560 --> 3:09:16.720\n Singapore will generate 27% yield in the Bitcoin. But legally, you can't send the money to them or\n\n3:09:16.720 --> 3:09:22.000\n the Bitcoin to them. It doesn't matter because the fact that that exists means that someone in Hong\n\n3:09:22.000 --> 3:09:28.880\n Kong will borrow the 10 Bitcoin from somebody in New York, and then they will put on the trade\n\n3:09:28.880 --> 3:09:33.680\n in Singapore. And that will create a demand for Bitcoin, which will drive up the market.\n\n3:09:33.680 --> 3:09:38.320\n A demand for Bitcoin, which will drive up the price of Bitcoin, which will result in an effective\n\n3:09:38.960 --> 3:09:43.040\n tax free yield for the person in the US that's not even in the jurisdiction.\n\n3:09:43.760 --> 3:09:49.280\n So there's nothing that's going on in Singapore to drive up the price of your land in LA.\n\n3:09:50.160 --> 3:09:54.720\n But there is something going on everywhere in the world to drive up the price of\n\n3:09:54.720 --> 3:10:02.000\n property and cyberspace if there's only one digital Manhattan. And so there's a dynamic\n\n3:10:02.000 --> 3:10:07.760\n there which is profound because it's global. But now let's go to the next extreme. I'm still\n\n3:10:07.760 --> 3:10:15.440\n giving you a fairly conventional idea, which is let's just loan the money fast on a global network\n\n3:10:15.440 --> 3:10:23.280\n and let's just rent the hotel room fast in cyberspace. But let's move to maybe a more\n\n3:10:23.280 --> 3:10:29.360\n innovative idea. The first generation of internet brought a lot of productivity, but there's also\n\n3:10:29.360 --> 3:10:36.480\n just a lot of flaws in it. For example, Twitter is full of garbage. Instagram DMs are full of\n\n3:10:36.480 --> 3:10:42.880\n garbage. Your Twitter DMs are full of garbage. YouTube is full of scams. Every 15 minutes,\n\n3:10:42.880 --> 3:10:49.840\n there's a Michael Saylor Bitcoin giveaway spun up on YouTube. My Office 365 inbox is full of garbage,\n\n3:10:50.720 --> 3:10:57.520\n millions of spam messages. I'm running four different email filters. My company spends\n\n3:10:57.520 --> 3:11:01.120\n million dollars a year to fight denial of service attacks and all sorts of other\n\n3:11:01.840 --> 3:11:07.920\n security things. There are denial of service attacks everywhere against everybody in cyberspace\n\n3:11:07.920 --> 3:11:14.000\n all the time. It's extreme. And we're all beset with hostility. You've been a victim of it in\n\n3:11:14.000 --> 3:11:20.560\n Twitter. You go on Twitter and people post stuff they would never say to your face. And then if you\n\n3:11:20.560 --> 3:11:26.000\n look, you find out that the account was created like three days ago and it's not even a real\n\n3:11:26.000 --> 3:11:33.040\n person. So, you know, we're beset with phishing attacks and scams and spam bots and garbage.\n\n3:11:33.600 --> 3:11:38.880\n And why? And the answer is because the first generation of internet was digital information\n\n3:11:38.880 --> 3:11:45.120\n and there's no energy. There's no conservation of energy in cyberspace. The thing that makes\n\n3:11:45.120 --> 3:11:53.200\n the universe work is conservation of energy. Like if I went to a hotel room, I'd have to post a\n\n3:11:53.200 --> 3:12:00.160\n credit card. And then if I smashed the place up, there'd be economic consequences. Maybe there'd\n\n3:12:00.160 --> 3:12:06.160\n be criminal consequences. There might be reputational consequences. You know, a lamp\n\n3:12:06.160 --> 3:12:12.800\n might fall on me. But in the worst case, I can only smash up one hotel room. Now, imagine I could\n\n3:12:12.800 --> 3:12:18.560\n actually write a Python script to send myself to every hotel room in the world every minute,\n\n3:12:18.560 --> 3:12:26.560\n not post a credit card and smash them all up anonymously. The thing that makes the universe\n\n3:12:26.560 --> 3:12:34.480\n work is friction, speed of sound, speed of light, and the fact that it's ultimately it's conservative.\n\n3:12:34.480 --> 3:12:39.760\n You're either energy or your matter, but once you've used the energy, it's gone and you can't\n\n3:12:39.760 --> 3:12:47.600\n do infinite everything. That's missing in cyberspace right now. And if you look at all of\n\n3:12:47.600 --> 3:12:55.360\n the moral hazards and all of the product defects that we have in all of these products, most of\n\n3:12:55.360 --> 3:13:04.720\n them, 99% of them could be cured if we introduced conservation of energy into cyberspace. And\n\n3:13:04.720 --> 3:13:10.320\n that's what you can do with high speed digital property, high speed Bitcoin. And by high speed,\n\n3:13:10.320 --> 3:13:18.320\n I mean, not 20 transactions a day, I mean, 20,000 transactions a day. So how do you do that? Well,\n\n3:13:20.320 --> 3:13:28.320\n I let everybody on Twitter post 1000 or 10,000 Satoshis via lightning wallet, a lightning badge,\n\n3:13:28.320 --> 3:13:35.200\n give me an orange check. If you put up 20 bucks once in your life, you could give 300 million\n\n3:13:35.200 --> 3:13:42.560\n people an orange check. Right now, you don't have a blue check, Lex. You're a famous person. I don't\n\n3:13:42.560 --> 3:13:48.320\n know why you don't have a blue check. Have you ever applied for a blue check? No. There are 360,000\n\n3:13:48.320 --> 3:13:55.360\n people on Twitter with a blue check. There are 300 million people on Twitter. So the conventional\n\n3:13:55.360 --> 3:14:03.920\n way to verify accounts is elitist archaic. Yeah, how does it work? How do you get a blue check?\n\n3:14:03.920 --> 3:14:11.200\n You go to apply and wait six months and you have to post like three articles in the public\n\n3:14:11.200 --> 3:14:17.520\n mainstream media that illustrates you're a person of interest. Generally, they would grant them to\n\n3:14:17.520 --> 3:14:25.760\n CEOs of public companies. The whole idea is to verify that you are who you say you are.\n\n3:14:26.320 --> 3:14:31.760\n But the question is, why isn't everybody verified? And there's a couple of threads on that. One is\n\n3:14:31.760 --> 3:14:37.920\n some people don't want to be doxxed. They want to be anonymous. But there are even anonymous people\n\n3:14:37.920 --> 3:14:45.440\n that should be verified. Because otherwise, you're subjecting their entire following to\n\n3:14:45.440 --> 3:14:52.720\n phishing attacks and scams and hostility. But the other... What's the orange verification? So\n\n3:14:53.600 --> 3:14:58.000\n this idea, can you actually elaborate a little bit more if you put up 20 bucks? Yeah, I think\n\n3:14:58.000 --> 3:15:01.840\n everybody on Twitter ought to be able to get an orange check if they could come up with like $10.\n\n3:15:02.640 --> 3:15:09.520\n And what is the power of that orange check? What does that verify exactly? You basically post a\n\n3:15:09.520 --> 3:15:16.400\n security deposit for your safe passes through cyberspace. So the way it would work is if you've\n\n3:15:16.400 --> 3:15:23.440\n got $10 once in your life, you can basically show that you're credit worthy. And that's your pledge\n\n3:15:23.440 --> 3:15:31.120\n to me that you're going to act responsibly. So you put the 10 or the $20 into the lightning wallet,\n\n3:15:31.120 --> 3:15:36.720\n you get an orange check. Then Twitter just gives you a setting where I can say the only people that\n\n3:15:36.720 --> 3:15:40.480\n could DM me are orange checks. The only people that can post on my tweets are orange checks.\n\n3:15:41.120 --> 3:15:47.600\n So instead of locking out the public and just letting your followers comment, you lock out\n\n3:15:47.600 --> 3:15:52.960\n all the unverified. And that means people that don't want to post $10 security deposit can't\n\n3:15:52.960 --> 3:16:00.240\n comment. Once you've done those two things, then you're in position to monetize malice,\n\n3:16:01.520 --> 3:16:06.080\n monetize motion or malice for that matter. But let's just say for the sake of argument,\n\n3:16:06.080 --> 3:16:15.680\n you post something and 9,700 bots spin up and pitch their whatever scam. Right now,\n\n3:16:15.680 --> 3:16:21.280\n you sit and you go report, report, report, report, report, report. And if you spend an hour,\n\n3:16:21.280 --> 3:16:26.640\n you get through half of them, you waste an hour of your life. They just spin up another 97\n\n3:16:26.640 --> 3:16:30.880\n gazillion because they've got a Python script spinning it up, so it's hopeless. But on the\n\n3:16:30.880 --> 3:16:36.880\n other hand, if you report them, and they really are a bot, Twitter's got a method to actually\n\n3:16:37.920 --> 3:16:42.320\n delete the account. They know that they're bots. The problem is not they don't know how to delete\n\n3:16:42.320 --> 3:16:45.520\n the account. The problem is there are no consequences when they delete the account.\n\n3:16:45.520 --> 3:16:52.240\n So if there are consequences, Twitter could give, they could just seize the $10 or seize the $20\n\n3:16:52.240 --> 3:16:58.560\n because it's a bot. It's a malicious criminal act or whatever. It is a violation of the platform\n\n3:16:58.560 --> 3:17:05.040\n rules. You end up seizing $10,000, give half the money to the reporter and half the money to the\n\n3:17:05.040 --> 3:17:10.880\n Twitter platform. And... It's a really powerful idea, but that's tying it, that's adding friction\n\n3:17:10.880 --> 3:17:15.920\n akin to the kind of friction you have in the physical world. You're tying, you have consequences,\n\n3:17:15.920 --> 3:17:17.280\n you have real consequences.\n\n3:17:17.280 --> 3:17:19.280\n It's putting conservation of energy.\n\n3:17:19.280 --> 3:17:20.240\n Conservation of energy.\n\n3:17:20.240 --> 3:17:25.280\n There's no friction, there's no nothing on this earth. Right? I mean, you can't walk across the\n\n3:17:25.280 --> 3:17:33.280\n room without friction. Right? So friction is not bad, right? Unnecessary friction\n\n3:17:33.280 --> 3:17:39.680\n is bad. So in this particular case, you're introducing conservation of energy. And in essence,\n\n3:17:39.680 --> 3:17:46.320\n you're introducing the concept of consequence or truth into cyberspace. And that means if you do\n\n3:17:46.320 --> 3:17:51.920\n want to spend up 10 million fake less Freedmen's, right?\n\n3:17:51.920 --> 3:17:56.640\n It's going to cost you a hundred million dollars to spend up 10 million fake Lexus.\n\n3:17:56.640 --> 3:18:00.080\n But the thing is you could do that with the dollar, but your case, you're saying\n\n3:18:00.080 --> 3:18:06.480\n that it's more tied to physical reality when you do that with Bitcoin.\n\n3:18:06.480 --> 3:18:11.920\n Yeah. Well, let's follow up on that idea a bit more. If you did do it with the dollar,\n\n3:18:12.640 --> 3:18:19.120\n then the question is how to 6 billion people deposit the dollars, right? Because what you're\n\n3:18:19.120 --> 3:18:25.200\n doing is, yeah, could you do it with a credit card? Like how do you send dollars? You have to\n\n3:18:25.200 --> 3:18:31.840\n docks yourself. Like it's not easy. So you're talking about inputting a credit card transaction,\n\n3:18:31.840 --> 3:18:36.560\n docksing yourself. And now you've just eliminated the 2 billion people that don't have credit cards\n\n3:18:36.560 --> 3:18:41.120\n or don't have banks. You've also got a problem with everybody that wants to remain anonymous,\n\n3:18:41.120 --> 3:18:47.600\n but you've also got this other problem, which is credit. You know, credit cards are expensive\n\n3:18:47.600 --> 3:18:55.200\n transactions, low frequency, slow settlement. So do you really want to pay two and a half percent\n\n3:18:55.200 --> 3:19:02.720\n every time you actually show a $20 deposit? And maybe you could do a Kluge version of this for\n\n3:19:02.720 --> 3:19:10.880\n a subset of people. It's like it's 10% as good if you did it with conventional payment rails.\n\n3:19:10.880 --> 3:19:20.240\n But what you can't do is the next idea, which is I want the orange badge to be used to give\n\n3:19:20.240 --> 3:19:27.520\n me safe passage through cyberspace, tripping across every platform. So how do I solve the\n\n3:19:27.520 --> 3:19:34.000\n denial of service attacks against a website? I publish a website. You hit it with a million\n\n3:19:34.000 --> 3:19:41.680\n requests. OK, now how do I deal with that? Well, I can lock you out and I can make it a zero trust\n\n3:19:41.680 --> 3:19:47.760\n website and then you have to be coming at me through a trusted firewall with a trusted credential. But\n\n3:19:47.760 --> 3:19:55.440\n that's that's a pretty draconian thing. Or I could put it behind a lightning wall. A lightning wall\n\n3:19:55.440 --> 3:20:02.000\n would be, you know, I just challenge you, Lex, you want to browse the web, you want to\n\n3:20:02.000 --> 3:20:11.280\n show me your 100000 Satoshis. Do you have 100000 Satoshis? Click. OK, now you click away 100 times\n\n3:20:11.280 --> 3:20:16.800\n or 1000 times. And after 1000 times, you know, well, now, Lex, you're getting offensive to take\n\n3:20:16.800 --> 3:20:21.360\n a Satoshi from you or 10 Satoshis, a microtransaction. You want to hit me a million\n\n3:20:21.360 --> 3:20:27.440\n times? I'm taking all your Satoshis and locking you out. What you want to do is you want to go\n\n3:20:27.440 --> 3:20:35.760\n through 200 websites a day. And what you want every time you cross a domain, you need to be\n\n3:20:35.760 --> 3:20:41.520\n able to, in a split second, prove that you've got some asset. And now when you cross back,\n\n3:20:41.520 --> 3:20:48.480\n when you exit domain, you want to fetch your asset back. So how do I, in a friction free fashion,\n\n3:20:48.480 --> 3:20:55.200\n browse through dozens or hundreds of websites, post a security deposit for state, state, state\n\n3:20:55.200 --> 3:21:00.720\n passage, and then get it back? You couldn't afford to pay a credit card fee each time.\n\n3:21:01.600 --> 3:21:07.040\n When you think about two and a half percent as a transaction fee, it means you trade the money\n\n3:21:08.080 --> 3:21:14.960\n 40 times and it's gone. Yeah, it's gone. Yeah. So you can't do this kind of hopping around through\n\n3:21:14.960 --> 3:21:21.280\n the internet with this kind of verification that grounds you to physical reality. It's a really,\n\n3:21:21.280 --> 3:21:28.480\n really interesting idea. Why hasn't that been done? I think you need two things. You need an\n\n3:21:28.480 --> 3:21:34.400\n idea like a digital asset like Bitcoin that's a bearer instrument for final settlement. And then\n\n3:21:34.400 --> 3:21:40.640\n you need a high speed transaction network like Lightning where the transaction cost might be a\n\n3:21:40.640 --> 3:21:50.800\n 20th of a penny or less. And if you roll the clock back 24 months, I don't think you had the Lightning\n\n3:21:50.800 --> 3:21:56.800\n network in a stable point. It's really just the past 12 months. It's an idea you could think about\n\n3:21:56.800 --> 3:22:05.280\n this year. And I think you need to be aware of Bitcoin as something other than like a scary\n\n3:22:05.280 --> 3:22:12.480\n speculative asset. So I really think we're just the beginning. The embryonic stage. I have to ask\n\n3:22:12.480 --> 3:22:19.280\n Michael Saylor, you said before, there's no second best to Bitcoin. What would be the second best?\n\n3:22:19.280 --> 3:22:23.040\n Traditionally, there's Ethereum with smart contracts, Cardano with proof of stake,\n\n3:22:23.600 --> 3:22:31.840\n Polkadot with interoperability between blockchains. Dogecoin has the incredible power of the meme.\n\n3:22:31.840 --> 3:22:39.440\n Privacy with Monero. I just can keep going. There's of course, after the block size wars,\n\n3:22:40.640 --> 3:22:43.680\n the different offshoots of Bitcoin.\n\n3:22:43.680 --> 3:22:48.960\n I think if you decompose or segment the crypto market, you've got crypto property.\n\n3:22:50.000 --> 3:22:56.480\n Bitcoin is the king of that. And other Bitcoin forks that wanted to be a bearer instrument store\n\n3:22:56.480 --> 3:23:02.400\n of value would be a property, a Bitcoin cash or Litecoin, something like that.\n\n3:23:02.960 --> 3:23:10.240\n Then you've got crypto currencies. I don't think Bitcoin is a currency because a currency I define\n\n3:23:10.240 --> 3:23:18.240\n in nation states since a currency is a digital asset that you can transfer in a transaction\n\n3:23:18.240 --> 3:23:23.360\n without incurring a taxable obligation. So that means it has to be a digital asset.\n\n3:23:23.360 --> 3:23:29.200\n It's a taxable obligation. So that means it has to be a stable dollar or a stable euro or a stable\n\n3:23:29.200 --> 3:23:33.760\n yen, a stable coin. So I think you've got crypto currencies, Tether, Circle, most famous.\n\n3:23:34.640 --> 3:23:39.680\n Then I think you've got crypto platforms. And Ethereum is the most famous of the crypto platforms,\n\n3:23:39.680 --> 3:23:44.720\n the platform upon which with smart contract functionality, et cetera.\n\n3:23:45.600 --> 3:23:49.200\n And then I think you've got just crypto securities. It's just like my favorite\n\n3:23:49.200 --> 3:23:54.400\n or whatever meme coin. And I love it because I love it. And it's attached to my game or my\n\n3:23:54.400 --> 3:24:01.680\n company or my persona or my whatever. I think if you push me and said, what's the second best?\n\n3:24:01.680 --> 3:24:06.800\n I would say the world wants two things. It wants crypto property as a savings account,\n\n3:24:06.800 --> 3:24:13.920\n and it wants cryptocurrency as a checking account. And that means that the most popular thing really\n\n3:24:13.920 --> 3:24:20.320\n is going to be a stable coin dollar. Right. And there's a maybe a fight right now. It might be\n\n3:24:20.320 --> 3:24:28.960\n Tether. Right. But a stable dollar, because I feel like the market opportunity, it's not clear that\n\n3:24:28.960 --> 3:24:34.240\n there'll be one that will win. The class of stable dollars is probably a one to ten trillion dollar\n\n3:24:34.240 --> 3:24:41.760\n market easily. I think that in a crypto platform space, Ethereum will compete with Solana and\n\n3:24:41.760 --> 3:24:46.560\n Binance Smart Chain and the like. Are there certain characteristics of any of them that\n\n3:24:46.560 --> 3:24:53.280\n kind of stand out to you? Don't you think the competition is based on a set of features? Also,\n\n3:24:54.320 --> 3:24:59.600\n the set of features that a cryptocurrency provides, but also the community that it provides.\n\n3:24:59.600 --> 3:25:04.080\n Do you think the community matters in sort of the adoption, the dynamic of the adoption,\n\n3:25:04.080 --> 3:25:08.400\n both across the developers and the investors? If I'm looking at them, I mean, the first question is,\n\n3:25:08.400 --> 3:25:13.520\n what's the regulatory risk? How likely is it to be deemed a property versus security?\n\n3:25:13.520 --> 3:25:18.640\n And the second is, what's the competitive risk? And the third is, what's the speed and the\n\n3:25:18.640 --> 3:25:26.160\n performance? And all those things lead to the question of what's the security risk?\n\n3:25:26.160 --> 3:25:34.560\n How likely is it to crash and burn? And how stable or unstable is it? And then there's the marketing\n\n3:25:34.560 --> 3:25:39.760\n risk. I mean, there are different teams behind each of these things and communities behind them.\n\n3:25:40.400 --> 3:25:48.800\n I think that the big cloud looming over the crypto industry is regulatory treatment of\n\n3:25:48.800 --> 3:25:54.000\n cryptocurrencies and regulatory treatment of crypto securities and crypto platforms. And I think that\n\n3:25:54.000 --> 3:25:58.960\n won't be determined until the end of the first Biden administration. For example, there are\n\n3:25:58.960 --> 3:26:06.640\n people that would like only US FDIC insured banks to issue cryptocurrencies. They want JP Morgan to\n\n3:26:06.640 --> 3:26:12.720\n issue a crypto dollar backed one to one. But then in the US right now, we have Circle and we have\n\n3:26:12.720 --> 3:26:18.480\n other companies that are licensed entities that are backed by cash and cash equivalents, but\n\n3:26:18.480 --> 3:26:24.080\n they're not FDIC insured banks. There's also a debate in Congress about whether state chartered\n\n3:26:24.080 --> 3:26:30.800\n banks should be able to issue these things. And then we have Tether and others that are outside\n\n3:26:30.800 --> 3:26:35.280\n of the US jurisdiction. They're probably not backed by cash and cash equivalents. They're\n\n3:26:35.280 --> 3:26:43.120\n backed by stuff, and we don't know what stuff. And then finally, you have UST and DAI, which are\n\n3:26:43.120 --> 3:26:50.480\n algorithmic stable coins that are even more innovative further outside the compliance\n\n3:26:50.480 --> 3:26:56.320\n framework. So if you ask who's going to win, the question is really, I don't know, will the market\n\n3:26:56.320 --> 3:27:01.200\n decide or will the regulators decide if the regulators get out of the way and the market\n\n3:27:01.200 --> 3:27:07.360\n fall out? Well, then it's an interesting discussion. And then I think that all bets are off if the\n\n3:27:07.360 --> 3:27:11.600\n regulators get more heavy handed with this. And I think you could have the same discussion with\n\n3:27:11.600 --> 3:27:18.000\n crypto properties like the DeFi exchanges and the crypto exchanges. The SEC would like to regulate\n\n3:27:18.000 --> 3:27:22.480\n the crypto exchanges. They'd like to regulate the DeFi exchanges. That means they may regulate the\n\n3:27:22.480 --> 3:27:30.000\n crypto platforms and at what rate and in what fashion. And so I think that I could give you\n\n3:27:30.000 --> 3:27:38.080\n an opinion if it was limited to competition and the current regulatory regime. But I think that\n\n3:27:38.080 --> 3:27:48.480\n the regulations are so fast moving and it's so uncertain that you can't make a decision\n\n3:27:48.480 --> 3:27:53.680\n without considering the potential actions of the regulators.\n\n3:27:53.680 --> 3:27:59.680\n I hope the regulators get out of the way. Can you steel me on the case that Dogecoin is,\n\n3:27:59.680 --> 3:28:04.480\n I guess, the second best cryptocurrency if you don't consider Bitcoin a cryptocurrency,\n\n3:28:04.480 --> 3:28:08.800\n Bitcoin a cryptocurrency, but instead a crypto property?\n\n3:28:08.800 --> 3:28:14.560\n I would classify it as crypto property because the US dollar is a currency. So unless your\n\n3:28:14.560 --> 3:28:20.160\n crypto asset is pegged algorithmically or stably to the value of the dollar is not a currency,\n\n3:28:20.160 --> 3:28:22.160\n it's a property or it's an asset.\n\n3:28:22.880 --> 3:28:28.480\n So then can you steel me on the case that Dogecoin is the best cryptocurrency then?\n\n3:28:29.520 --> 3:28:31.840\n Because Bitcoin is not even in that list.\n\n3:28:31.840 --> 3:28:36.320\n The debate is going to be whether it's property or security. And there's a debate whether it's\n\n3:28:36.320 --> 3:28:40.480\n decentralized enough. So let's assume it was decentralized.\n\n3:28:40.480 --> 3:28:40.980\n Yeah.\n\n3:28:41.600 --> 3:28:48.000\n Well, it's increasing at not quite five, what, 5% a year inflation rate, but it's not 5%\n\n3:28:48.000 --> 3:28:55.840\n exponentially. It's like a plus 5 million, 5% something captain is less. I forget the\n\n3:28:55.840 --> 3:29:01.040\n exact number, but it's an inflationary property. It's got a lower inflation rate\n\n3:29:01.040 --> 3:29:08.960\n than the US dollar. And it's got a much lower inflation rate than many other fiat currencies.\n\n3:29:08.960 --> 3:29:10.640\n So I think you could say that.\n\n3:29:10.640 --> 3:29:18.880\n But don't you see the power of meme, the power of ideas, the power of fun or whatever mechanism\n\n3:29:18.880 --> 3:29:24.160\n is used to captivate a community?\n\n3:29:24.160 --> 3:29:29.520\n I do, but there are meme stocks. It doesn't absolve you of your ethical and securities\n\n3:29:29.520 --> 3:29:36.720\n liabilities if you're promoting it. So I don't have a problem with people buying a stock.\n\n3:29:37.920 --> 3:29:46.640\n It's just the way I divide the world is there's investment, there's saving, and there's speculation\n\n3:29:46.640 --> 3:29:53.280\n and there's trading. So Bitcoin is an asset for saving. If you want to save money for\n\n3:29:53.280 --> 3:30:00.400\n 100 years, you don't really want to take on execution risk or the like. So you're just\n\n3:30:00.400 --> 3:30:05.760\n buying something to hold forever. For you to actually endorse something as a property,\n\n3:30:06.400 --> 3:30:10.400\n like if you said to me, Mike, what should I buy for the next 100 years? I say, well,\n\n3:30:10.400 --> 3:30:15.760\n some amount of real estate, some amount of scarce collectibles, some amount of Bitcoin,\n\n3:30:15.760 --> 3:30:20.640\n right? You can run your company, right? But running your company is an investment. So\n\n3:30:20.640 --> 3:30:24.960\n the savings are properties. If you said, what should I invest in? I'd say, well, here's\n\n3:30:24.960 --> 3:30:29.120\n a list of good companies, private companies. You can start your own company. That's an\n\n3:30:29.120 --> 3:30:36.880\n investment, right? If you said, what should I trade? Well, I'm trading as like a proprietary\n\n3:30:36.880 --> 3:30:42.640\n thing. I don't have any special insight into that. If you're a good trader, you know you\n\n3:30:42.640 --> 3:30:49.840\n are. If you said to me, what should you speculate in? We talk about meme stocks and meme stocks\n\n3:30:49.840 --> 3:30:56.560\n and meme coins, and it kind of sits up there. It sits right in the same space with what\n\n3:30:56.560 --> 3:31:01.120\n horse should you bet on and what sports team should you gamble on and should you bet on\n\n3:31:01.120 --> 3:31:07.840\n black six times in a row and double down each time. I mean, it's fun, but at the end of\n\n3:31:07.840 --> 3:31:17.200\n the day, it's a speculation, right? You can't build a civilization on it. It's not an institutional\n\n3:31:17.200 --> 3:31:23.600\n asset. And in fact, where I'd leave it, right, is Bitcoin is clearly digital property, which\n\n3:31:23.600 --> 3:31:28.800\n makes it an institutional grade investable asset for a public company, a public figure,\n\n3:31:28.800 --> 3:31:37.200\n a public investor, or anybody that's risk adverse. I think that the top 100 other cryptos\n\n3:31:37.200 --> 3:31:42.640\n are like venture capital investments. And if you're a VC and if you're a qualified technical\n\n3:31:42.640 --> 3:31:47.200\n investor and you have a pool of capital and you can take that kind of risk, then you can\n\n3:31:47.200 --> 3:31:52.640\n parse through that and form opinions. It's just orders of magnitude more risky because\n\n3:31:52.640 --> 3:31:59.120\n of competition, because of ambition, and because of regulation. And if you take the meme coins,\n\n3:31:59.120 --> 3:32:05.680\n it's like when some rapper comes out with a meme coin, it's like maybe it'll peak when\n\n3:32:05.680 --> 3:32:13.360\n I hear about it, right? I mean, SHIB was created as the coin such that it had so many zeros\n\n3:32:13.360 --> 3:32:18.720\n after the decimal point that when you looked at it on the exchanges, it always showed zero,\n\n3:32:18.720 --> 3:32:24.320\n zero, zero, zero. And it wasn't until like six months after it got popular that they\n\n3:32:24.320 --> 3:32:27.680\n started expanding the display so you could see whether the price had changed.\n\n3:32:27.680 --> 3:32:33.680\n That's speculation. You've been, maybe you can correct me, but you've been critical of Elon\n\n3:32:33.680 --> 3:32:39.600\n Musk in the past in the crypto space. Where do you stand on Elon's effect on Bitcoin and\n\n3:32:39.600 --> 3:32:46.080\n cryptocurrency in general these days? I believe that Bitcoin is a massive breakthrough for the\n\n3:32:46.080 --> 3:32:51.360\n human race that will cure half the problems in the world and generate hundreds of trillions of\n\n3:32:51.360 --> 3:32:59.280\n dollars of economic value to the civilization. And I believe that it's in an early stage\n\n3:32:59.280 --> 3:33:04.000\n where many people don't understand it, and they're afraid of it, and there's FUD,\n\n3:33:04.000 --> 3:33:09.760\n and there's uncertainty, there's doubt, and there's fear, and there's a very noisy crypto\n\n3:33:09.760 --> 3:33:17.920\n world. And there's 15,000 other cryptos that are seeking relevance. And I think most of the FUD\n\n3:33:19.360 --> 3:33:24.880\n is actually fueled by the other crypto entrepreneurs. So the environmental FUD and\n\n3:33:24.880 --> 3:33:31.040\n the other types of uncertainty that surround Bitcoin, generally they're not coming from\n\n3:33:31.040 --> 3:33:37.520\n legitimate environmentalists. They don't come from legitimate critics. They actually are guerrilla\n\n3:33:37.520 --> 3:33:44.720\n marketing campaigns that are being financed and fueled by other crypto entrepreneurs\n\n3:33:45.840 --> 3:33:52.320\n because they have an interest in doing so. So if I look at the constructive path forward,\n\n3:33:52.320 --> 3:33:59.200\n first, I think it'd be very constructive for corporations to embrace Bitcoin and build\n\n3:33:59.200 --> 3:34:06.000\n applications on top of it. You don't need to fix it. There's nothing wrong with it, right? Like\n\n3:34:06.000 --> 3:34:10.880\n when you put it on a layer two and a layer three, it moves a billion times a second at the speed of\n\n3:34:10.880 --> 3:34:18.960\n light. So every beautiful, cool DeFi application, every crypto application, everything you could\n\n3:34:18.960 --> 3:34:27.760\n imagine you might want to do, you can do with a legitimate company and a legitimate website or\n\n3:34:27.760 --> 3:34:36.320\n mobile application sitting on top of Bitcoin or Lightning if you want to. So I think that\n\n3:34:37.120 --> 3:34:42.480\n to the extent that people do that, that's going to be better for the world. If you consider what\n\n3:34:42.480 --> 3:34:50.160\n holds people back, I think it's just misperceptions about what Bitcoin is. So I'm a big fan of just\n\n3:34:50.160 --> 3:34:56.880\n educating people. If you're not going to commercialize it, then just educate people on\n\n3:34:56.880 --> 3:35:04.320\n what it is. So for example, Bitcoin is the most efficient use of energy in the world by far,\n\n3:35:05.040 --> 3:35:09.840\n right? Most people don't necessarily perceive that or realize that. But if you were to take\n\n3:35:09.840 --> 3:35:16.400\n any metric, energy intensity, you put like $2 billion worth of electricity in the network\n\n3:35:16.400 --> 3:35:25.600\n every year and it's worth $850 billion. There is no industry in the real world, right, that is that\n\n3:35:25.600 --> 3:35:32.240\n energy efficient. Not only that energy efficient, it's also the most sustainable industry. We do\n\n3:35:32.240 --> 3:35:40.640\n surveys. 58% of Bitcoin mining energy is sustainable. So there's a very good story.\n\n3:35:40.640 --> 3:35:46.080\n In fact, every other industry, planes, trains, automobiles, construction, food, medicine,\n\n3:35:46.080 --> 3:35:54.400\n everything else is less clean, less efficient. So the basic debate was...\n\n3:35:54.400 --> 3:35:58.800\n I wouldn't say there is a debate. I would just say that to the extent that the Bitcoin community\n\n3:35:58.800 --> 3:36:07.600\n had any issue with Elon, it was just this environmental uncertainty that he fueled\n\n3:36:07.600 --> 3:36:12.400\n in a couple of his tweets, right? Which I think just is very distracting.\n\n3:36:13.040 --> 3:36:17.440\n But that was one of them. But I think it's like the Bitcoin maximalists, but generally,\n\n3:36:17.440 --> 3:36:25.120\n the crypto community, what you call the crypto entrepreneurs are... It's also... They're using\n\n3:36:25.120 --> 3:36:35.280\n it for investment, for speculation, and therefore get very passionate about people's celebrities,\n\n3:36:35.280 --> 3:36:42.800\n including you, like famous people, saying positive stuff about any one particular\n\n3:36:43.920 --> 3:36:51.280\n crypto thing you can buy in Coinbase. And so they might be unhappy with Elon\n\n3:36:51.280 --> 3:36:56.480\n Musk that he's promoting Bitcoin and then not, and then promoting Dogecoin, then not.\n\n3:37:00.480 --> 3:37:04.480\n There's so much emotion tied up in the communication on this topic.\n\n3:37:05.360 --> 3:37:07.840\n And I think that's where a lot of the...\n\n3:37:08.480 --> 3:37:13.520\n Look, I don't have a criticism of Elon Musk. He's free to do whatever he wishes to do.\n\n3:37:13.520 --> 3:37:20.720\n It's his... In fact, Elon Musk is the second largest supporter of Bitcoin in the world.\n\n3:37:21.280 --> 3:37:26.160\n I think that the Bitcoin community tends to eat its own quite a bit. It tends to be very\n\n3:37:27.920 --> 3:37:34.640\n self critical. And instead of saying, well, Elon is more supportive of Bitcoin\n\n3:37:34.640 --> 3:37:41.440\n than the other 10,000 people in the world with serious amounts of money, they focus upon...\n\n3:37:41.440 --> 3:37:46.080\n Yeah, this is strange. Eating your own is just...\n\n3:37:46.080 --> 3:37:51.200\n I mean, I think he's free to do what he wants to do. And I think he's done a lot of good for\n\n3:37:51.200 --> 3:37:56.800\n Bitcoin in putting it on the balance sheet of Tesla and holding it. And I think that\n\n3:37:56.800 --> 3:38:02.640\n sent a very powerful message. Do you have advice for young people?\n\n3:38:02.640 --> 3:38:07.120\n You've had a heck of a life. You've done quite a lot of things.\n\n3:38:07.120 --> 3:38:12.880\n Start before MIT, but starting with MIT. Is there advice here for young people in high school and\n\n3:38:12.880 --> 3:38:22.160\n college, how to have a career they can be proud of, how to have a life they can be proud of?\n\n3:38:23.040 --> 3:38:32.080\n I was asked by somebody for quick advice for his young children. He had twins when they\n\n3:38:32.080 --> 3:38:37.760\n enter adulthood. He said, give me your advice for them in a letter. I'm going to give it to them\n\n3:38:37.760 --> 3:38:44.800\n when they turn 21 or something. So then he handed... I was at a party and then he handed me\n\n3:38:44.800 --> 3:38:48.320\n this sheet of paper and I thought, oh, he wants me to write it down right now. So I sat down,\n\n3:38:48.320 --> 3:38:51.920\n I started writing and I figured, well, what would you want to tell someone at age 21?\n\n3:38:53.200 --> 3:38:54.320\n You wrote it down.\n\n3:38:54.320 --> 3:38:58.080\n So I wrote it down. And then I tweeted it and it's sitting on Twitter, but I tell you what I said.\n\n3:38:58.080 --> 3:39:08.560\n I said, my advice if you're entering adulthood, focus your energy, guard your time, train your\n\n3:39:08.560 --> 3:39:20.640\n mind, train your body, think for yourself, curate your friends, curate your environment,\n\n3:39:20.640 --> 3:39:29.920\n keep your promises, stay cheerful and constructive, and upgrade the world. That was the 10.\n\n3:39:30.480 --> 3:39:37.600\n Upgrade the world. That's an interesting choice of words. Upgrade the world. Upgrade the world.\n\n3:39:37.600 --> 3:39:39.280\n It's like an engineering train.\n\n3:39:39.280 --> 3:39:43.200\n Focus your energy. It's a very, yeah, it's a very engineering themed...\n\n3:39:43.200 --> 3:39:50.560\n Keep your promises too. That's an interesting one.\n\n3:39:50.560 --> 3:39:59.360\n I think most people suffer because they don't focus. I think the big risk in this world is\n\n3:39:59.360 --> 3:40:06.080\n there's too much of everything. You can sit and watch chess videos 100 hours a week and\n\n3:40:06.080 --> 3:40:12.880\n you'll never get through all the chess videos. There's too much of every possible thing,\n\n3:40:12.880 --> 3:40:20.400\n too much of every good thing. So figuring out what you want to do and then everything will suck\n\n3:40:20.400 --> 3:40:25.280\n up your time, right? There's 100 streaming channels to binge watch on. So you got to\n\n3:40:25.280 --> 3:40:33.120\n guard your time and then train your body, train your mind and control who's around you, control\n\n3:40:33.680 --> 3:40:41.520\n what surrounds you. So ultimately in a world where there's too much of everything, then\n\n3:40:41.520 --> 3:40:46.320\n It's like those laser eyes. It's like those laser eyes. You have to focus\n\n3:40:48.720 --> 3:40:50.400\n on just a few of those things.\n\n3:40:51.280 --> 3:40:56.400\n Yeah. I mean, I got a thousand opinions we could talk about and I could pursue a thousand things,\n\n3:40:56.400 --> 3:41:04.080\n but I don't expect to be successful. And I'm not sure that my opinion in any of the 999 is any more\n\n3:41:04.080 --> 3:41:12.400\n valid than the leader of thought in that area. So how about if I just focus upon one thing\n\n3:41:13.520 --> 3:41:19.520\n and then deliver the best I can in the one thing. That's the laser eye message.\n\n3:41:20.560 --> 3:41:22.320\n The rest get you distracted.\n\n3:41:22.320 --> 3:41:26.640\n Well, how do you achieve that? Do you find yourself, given where you are in life,\n\n3:41:26.640 --> 3:41:32.960\n having to say no a lot? Or just focus comes naturally when you just ignore everything?\n\n3:41:32.960 --> 3:41:35.280\n So how do you achieve that focus?\n\n3:41:36.640 --> 3:41:38.880\n I think it helps if people know what you're focused on.\n\n3:41:40.160 --> 3:41:43.200\n So everything about you just radiates that people know.\n\n3:41:44.480 --> 3:41:50.000\n If they know what you're focused on, then you won't get so many other things coming your way.\n\n3:41:52.800 --> 3:41:59.040\n If you dolly or if you flirt with 27 different things,\n\n3:41:59.040 --> 3:42:03.760\n then you're going to get approached by people in each of the 27 communities, right?\n\n3:42:03.760 --> 3:42:11.360\n You mentioned getting a PhD and giving your roots at MIT. Do you think there's all kinds of\n\n3:42:12.080 --> 3:42:18.400\n journeys you can take to educate yourself? Do you think a PhD or school is still worth it?\n\n3:42:20.160 --> 3:42:23.360\n Or is there other paths through life that...\n\n3:42:23.360 --> 3:42:26.640\n Is it worth it if you have to pay for it? Is it worth it if you spend the time on it?\n\n3:42:26.640 --> 3:42:30.480\n Yeah. The time and the money is a big cost.\n\n3:42:32.880 --> 3:42:34.640\n Time probably the bigger one, right?\n\n3:42:34.640 --> 3:42:42.880\n It seems clear to me that the world wants more specialists. It wants you to be an expert\n\n3:42:43.680 --> 3:42:52.240\n and to focus on one area. And it's punishing generalists, jack of all trades,\n\n3:42:52.240 --> 3:42:56.880\n especially people that are generalists in the physical realm. Because if you're a specialist\n\n3:42:56.880 --> 3:43:01.920\n in the digital realm, you might very well... You're the person with 700,000 followers on\n\n3:43:02.720 --> 3:43:10.320\n Twitter and you show them how to tie knots. Or you're the banjo player with 1.8 million followers.\n\n3:43:10.320 --> 3:43:19.120\n And when everybody types banjo, it's you, right? And so the world wants people that do something\n\n3:43:19.120 --> 3:43:28.000\n well. And then it wants to stamp out 18 million copies of them. And so that argues in favor of\n\n3:43:28.000 --> 3:43:34.240\n focus. Now, the definition of a PhD is someone with enough of an education that they're capable\n\n3:43:34.240 --> 3:43:41.040\n of or have made. I guess to get a PhD, technically, you have to have done a dissertation where you\n\n3:43:41.040 --> 3:43:47.120\n made a seminal contribution to the body of human knowledge. And if you haven't done that,\n\n3:43:47.120 --> 3:43:53.200\n technically, you have a master's degree, but you're not a doctor. So if you're interested\n\n3:43:53.200 --> 3:44:00.400\n in any of the academic disciplines that a PhD would be granted for, then I can see that being\n\n3:44:00.400 --> 3:44:07.120\n a reasonable pursuit. But there are many people that are specialists. You know the agitator?\n\n3:44:07.120 --> 3:44:08.800\n Yeah, yeah, yeah.\n\n3:44:08.800 --> 3:44:10.160\n The agitator on YouTube?\n\n3:44:10.160 --> 3:44:11.040\n Yeah, yeah, yeah.\n\n3:44:11.040 --> 3:44:13.920\n He's the world's greatest chess commentator.\n\n3:44:13.920 --> 3:44:14.560\n Yeah.\n\n3:44:14.560 --> 3:44:18.640\n And I've watched his career, and he's gotten progressively better, and he's really good.\n\n3:44:18.640 --> 3:44:19.760\n He's going to love hearing this.\n\n3:44:20.640 --> 3:44:25.680\n Yeah, if the agitator hears this, I'm a big fan of the agitator. I have to cut myself off,\n\n3:44:25.680 --> 3:44:29.920\n right? Because otherwise, you'll watch the entire Paul Morphy saga for your weekend.\n\n3:44:30.640 --> 3:44:36.640\n But the point really is YouTube is full of experts who are specialists in something,\n\n3:44:36.640 --> 3:44:45.520\n and they rise to the top of their profession. And Twitter is too, and the internet is. So I\n\n3:44:45.520 --> 3:44:54.240\n would advocate that you figure out what you're passionate about and what you're good at, and you\n\n3:44:54.240 --> 3:45:03.360\n do focus on it. Especially if the thing that you're doing can be automated. The problem is,\n\n3:45:03.360 --> 3:45:10.640\n back to that 500,000 algebra teacher type comment, the problem is if it is possible to be automated,\n\n3:45:10.640 --> 3:45:20.080\n then over time, someone's probably going to automate it, and that squeezes the state space\n\n3:45:20.080 --> 3:45:26.400\n of everybody else. It's like after the lockdowns, it used to be there were all these local bands\n\n3:45:26.400 --> 3:45:31.360\n that played in bars, and everyone went to the bar to see the local band. And then during the\n\n3:45:31.360 --> 3:45:37.200\n lockdown, you would have like these six super groups, and they would all get 500,000 or a\n\n3:45:37.200 --> 3:45:45.840\n million followers, and all these smaller local bands just got no attention at all.\n\n3:45:45.840 --> 3:45:51.440\n Well, the interesting thing is one of those 500,000 algebra teachers is likely to be part of\n\n3:45:51.440 --> 3:46:00.080\n the automation. So it's like, it's an opportunity for you to think, where's my field, my discipline,\n\n3:46:00.080 --> 3:46:04.560\n evolving into? I talked to a bunch of librarians, just happened to be friends with librarians,\n\n3:46:04.560 --> 3:46:12.400\n and libraries will probably be evolving. And it's up to you as a librarian to be one of the few\n\n3:46:12.400 --> 3:46:18.800\n that remain in the rubble. If you're going to give commentary on Shakespeare plays,\n\n3:46:18.800 --> 3:46:23.520\n I want you to basically do it for every Shakespeare play. I want you to be the Shakespeare dude,\n\n3:46:23.520 --> 3:46:33.600\n because once I, just like Lex, you're like, you're the deep thinking podcaster, right?\n\n3:46:33.600 --> 3:46:42.560\n You're the podcaster that goes after the deep intellectual conversations. And once I get\n\n3:46:42.560 --> 3:46:49.840\n comfortable with you, and I like you, then I start binge watching Lex. But if you changed\n\n3:46:49.840 --> 3:46:55.680\n your format through 16 different formats, so that you could compete with 16 different other\n\n3:46:55.680 --> 3:47:01.760\n personalities on YouTube, you probably wouldn't beat any of them, right? You would probably just\n\n3:47:01.760 --> 3:47:06.880\n kind of sink into the, you're the number two or number three guy, you're not the number one guy\n\n3:47:06.880 --> 3:47:14.480\n in the format. And I think that the algorithm, right, the Twitter algorithm and the YouTube\n\n3:47:14.480 --> 3:47:21.200\n algorithm, they really reward the person that's focused on message, consistent. The world wants\n\n3:47:21.200 --> 3:47:26.720\n somebody they can trust that's consistent and reliable. And they kind of want to know what\n\n3:47:26.720 --> 3:47:35.280\n they're getting into because, and this is taken for granted maybe, but there's 10 million people\n\n3:47:35.280 --> 3:47:42.640\n vying for every hour of your time. And so the fact that anybody gives you any time at all is a huge\n\n3:47:42.640 --> 3:47:47.680\n privilege, right? And you should be thanking them. And you should respect their time.\n\n3:47:48.240 --> 3:47:52.720\n It's interesting. Like everything you said is very interesting. But of course, from my perspective,\n\n3:47:52.720 --> 3:47:58.800\n and probably from your perspective, my actual life has nothing to do with, it's just being focused\n\n3:47:58.800 --> 3:48:06.960\n on stuff. And in my case, it's like focus on doing the thing I really enjoy doing and being myself\n\n3:48:06.960 --> 3:48:12.800\n and not caring about anything else. Like I don't care about views or likes or attention. And that,\n\n3:48:12.800 --> 3:48:17.040\n just maintaining that focus is the way, from an individual perspective, you live that life.\n\n3:48:17.840 --> 3:48:24.800\n But yeah, it does seem that there's the world and technology is rewarding the specialization\n\n3:48:24.800 --> 3:48:31.520\n and creating bigger and bigger platforms for the different specializations. And that lifts all\n\n3:48:31.520 --> 3:48:36.080\n boats, actually, because the specializations get better and better and better at teaching people to\n\n3:48:36.080 --> 3:48:40.720\n do specific things and they educate themselves. And it's just, everybody gets more and more\n\n3:48:40.720 --> 3:48:47.360\n knowledgeable and more and more empowered. The reward for authenticity more than offsets\n\n3:48:47.360 --> 3:48:53.680\n the specificity with which you pursue your mission. It's like, another way to say it is like,\n\n3:48:53.680 --> 3:48:58.640\n nobody wants to read advertising. Like if you were to spend a hundred million dollars\n\n3:48:58.640 --> 3:49:08.240\n advertising your thing, I probably wouldn't want to watch it. But we see the death of that.\n\n3:49:08.240 --> 3:49:14.480\n And so the commercial shows are losing their audiences and the authentic\n\n3:49:15.040 --> 3:49:21.120\n specialists or the authentic artists are gaining their audience.\n\n3:49:21.120 --> 3:49:28.480\n And that's a beautiful thing. Speaking of deep thinking, you're just a human. Your life ends.\n\n3:49:29.520 --> 3:49:36.480\n You've accumulated so much wisdom, so much money, but the ride ends. Do you think about that?\n\n3:49:36.480 --> 3:49:41.520\n Do you ponder your death, your mortality? Are you afraid of it?\n\n3:49:41.520 --> 3:49:50.880\n When I go, all my assets will flow into a foundation and the foundation's mission is to make\n\n3:49:50.880 --> 3:50:01.520\n education free for everybody forever. And if I'm able to contribute to the creation of a more\n\n3:50:01.520 --> 3:50:06.640\n perfect monetary system, then maybe that foundation will go on forever.\n\n3:50:06.640 --> 3:50:14.320\n The idea, the foundation of the idea. So each of the foundations.\n\n3:50:14.320 --> 3:50:19.280\n It's not clear we're on the S curve of immortal life yet. Like that's a biological question.\n\n3:50:19.280 --> 3:50:24.480\n And you asked that, you know, on some of your other interviews a lot. I think that we are on\n\n3:50:24.480 --> 3:50:33.440\n the threshold of immortal life for ideas or immortal life for certain institutions.\n\n3:50:33.440 --> 3:50:40.640\n Or computer programs. So if we can fix the money, then you can create a technically perfected\n\n3:50:40.640 --> 3:50:47.360\n endowment. And then the question really is, what are your ideas? What do you want to leave behind?\n\n3:50:47.360 --> 3:50:53.280\n And so if it's a park, then you endow the park, right? If it's free education, you endow that.\n\n3:50:53.280 --> 3:50:58.640\n If it's some other ethical idea, right?\n\n3:50:58.640 --> 3:51:06.560\n Does it make you sad that there's something that you've endowed, some very powerful idea\n\n3:51:07.280 --> 3:51:12.880\n of digital energy that you put out into the world, you help put it into the world,\n\n3:51:13.680 --> 3:51:20.880\n and your mind, your conscious mind will no longer be there to experience it.\n\n3:51:21.680 --> 3:51:23.040\n It's just gone forever.\n\n3:51:23.040 --> 3:51:30.640\n I'd rather think that the thing that Satoshi taught us is you should do your part during\n\n3:51:30.640 --> 3:51:33.440\n some phase of the journey, and then you should get out of the way.\n\n3:51:35.440 --> 3:51:42.800\n I think Steve Jobs said something similar to that effect in a very, very famous speech one day,\n\n3:51:42.800 --> 3:51:47.920\n which is, you know, death is a natural part of life, and it makes way for the next generation.\n\n3:51:47.920 --> 3:51:53.520\n And I think the goal is you upgrade the world, right? You leave it a better place,\n\n3:51:53.520 --> 3:52:03.600\n but you get out of the way. And I think when that breaks down, you know, bad things happen.\n\n3:52:04.800 --> 3:52:07.920\n I think nature cleanses itself. There's a cycle of life.\n\n3:52:09.360 --> 3:52:13.600\n And speaking of one of great people who did a great job,\n\n3:52:13.600 --> 3:52:19.760\n and speaking of one of great people who did also get out of the way is George Washington,\n\n3:52:19.760 --> 3:52:26.640\n so hopefully when you get out of the way, nobody's bleeding you to death in hope of helping you.\n\n3:52:29.200 --> 3:52:34.720\n What do you think, to do a bit of a callback, what do you think is the meaning of this whole thing?\n\n3:52:34.720 --> 3:52:39.840\n What's the meaning of life? Why are we here? We talked about the rise of human civilization.\n\n3:52:39.840 --> 3:52:46.480\n It seems like we're engineers at heart. We build cool stuff, better and better use of energy,\n\n3:52:47.040 --> 3:52:51.840\n channeling energy to be productive. Why? What's it all for?\n\n3:52:55.280 --> 3:52:57.040\n You're getting metaphysical on me.\n\n3:52:57.040 --> 3:53:00.640\n Very. There's a beautiful boat to the left of us. Like, why do we do that? This\n\n3:53:01.200 --> 3:53:07.360\n boat that sailed the ocean. Then we build models of it to celebrate great engineering of the past.\n\n3:53:07.360 --> 3:53:15.840\n To engineer is divine. You can make lots of arguments as well. We're here to entertain\n\n3:53:15.840 --> 3:53:21.520\n ourselves or we're here to create something that's beautiful or something that's functional.\n\n3:53:22.160 --> 3:53:25.600\n I think if you're an engineer, you entertain yourself by creating something that's both\n\n3:53:25.600 --> 3:53:31.600\n beautiful and functional. So I think all three of those things, it's entertaining, but it's ethical.\n\n3:53:31.600 --> 3:53:38.000\n You know, you got to admire, you know, the first person that built a bridge, crossing a chasm,\n\n3:53:38.000 --> 3:53:42.480\n or the first person to work out the problem of how to get running water to a village,\n\n3:53:44.000 --> 3:53:52.080\n the first person to figure out how to, you know, dam up a river, or mastered agriculture,\n\n3:53:52.080 --> 3:53:56.800\n or the guy that figured out, you know, how to grow fruit on trees or created orchards,\n\n3:53:56.800 --> 3:54:01.600\n you know, and maybe one day he had like 10 fruit trees, he's pretty proud of himself.\n\n3:54:02.160 --> 3:54:08.480\n So that's functional. There is also something to that, just like you said, that's just beautiful.\n\n3:54:08.480 --> 3:54:14.880\n It does get you closer to, like you said, the divine. Something,\n\n3:54:17.200 --> 3:54:25.760\n when you step back and look at the entirety of it, a collective of humans using a beautiful\n\n3:54:25.760 --> 3:54:35.440\n invention, or creation, or just something about this instrument is creating a beautiful piece of music.\n\n3:54:37.440 --> 3:54:42.480\n That seems just right. That's what we're here for. Whatever the divine is, it seems like we're here\n\n3:54:42.480 --> 3:54:47.520\n for that. And I, of course, love talking to you because from the engineering perspective,\n\n3:54:47.520 --> 3:54:50.480\n the functional is ultimately the mechanism towards the beauty.\n\n3:54:50.480 --> 3:54:55.440\n Isn't there something beautiful about making the world a better place for people that you love,\n\n3:54:56.080 --> 3:54:58.800\n your friends, your family, or yourself?\n\n3:55:02.800 --> 3:55:11.120\n When you think about the entire arc of human existence, and you roll the clock back 500,000\n\n3:55:11.120 --> 3:55:16.320\n years, and you think about every struggle of everyone that came before us and everything\n\n3:55:16.320 --> 3:55:25.120\n they had to overcome in order to put you here right now, you got to admire that, right? You\n\n3:55:25.120 --> 3:55:32.000\n got to respect that. That's a heck of a gift they gave us, but it's also a heck of a responsibility.\n\n3:55:33.280 --> 3:55:40.160\n Don't screw it up. If I dropped you 500,000 years ago, and I said, figure out steel refining,\n\n3:55:40.160 --> 3:55:48.160\n or figure out silicon chips, fabric production, or whatever it is.\n\n3:55:48.160 --> 3:55:50.000\n Fly, or fire.\n\n3:55:50.000 --> 3:55:55.280\n And so now we're here, and I guess the way you repay them is you fix everything in front\n\n3:55:55.280 --> 3:56:02.880\n of your face you can, right? And that means to someone like Elon, it means get us off the planet,\n\n3:56:02.880 --> 3:56:09.280\n right? To someone like me, it's like, I think, you know, fix the energy in the system.\n\n3:56:09.280 --> 3:56:13.280\n And that gives me hope. Michael, this was an incredible conversation. You're an incredible\n\n3:56:13.280 --> 3:56:18.160\n human. It's a huge honor you would sit down with me. Thank you so much for talking to me.\n\n3:56:18.160 --> 3:56:19.680\n Yeah, thanks for having me, Lex.\n\n3:56:20.480 --> 3:56:24.800\n Thanks for listening to this conversation with Michael Saylor. To support this podcast,\n\n3:56:24.800 --> 3:56:33.840\n please check out our sponsors in the description. And now, let me leave you with a few words from\n\n3:56:33.840 --> 3:56:42.160\n Francis Bacon. Money is a great servant, but a bad master. Thank you for listening,\n\n3:56:42.160 --> 3:56:56.160\n and hope to see you next time.\n\n"
}