{
  "title": "Nic Carter: Bitcoin Core Values, Layered Scaling, and Blocksize Debates | Lex Fridman Podcast #173",
  "id": "mDyBbGCiBUU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.420\n The following is a conversation with Nick Carter, who is a partner at Castle\n\n00:04.420 --> 00:09.940\n Island Ventures, cofounder of CoinMetrics.io, and previously a crypto\n\n00:09.940 --> 00:12.780\n asset research analyst at Fidelity Investments.\n\n00:13.220 --> 00:18.820\n He's a prominent writer, speaker, and podcaster on topics around decentralized\n\n00:18.820 --> 00:21.300\n finance and especially Bitcoin.\n\n00:22.100 --> 00:26.500\n Quick mention of our sponsors, The Information, Athletic Greens,\n\n00:26.500 --> 00:31.000\n Four Sigmatic, and Blinkist. Check them out in the description to support this\n\n00:31.000 --> 00:35.800\n podcast. This conversation with Nick Carter is part of a series of episodes on\n\n00:35.800 --> 00:40.400\n cryptocurrency that is a small journey of exploration I'm on because I find\n\n00:40.400 --> 00:45.200\n decentralized finance and especially Bitcoin fascinating, technically and\n\n00:45.200 --> 00:50.200\n philosophically, especially because it may be the very mechanism that achieves a\n\n00:50.200 --> 00:55.200\n global decentralization of power, giving more sovereignty to the individual and\n\n00:55.200 --> 01:00.400\n making our systems more resilient to corruption, manipulation, and in general\n\n01:00.600 --> 01:02.600\n to the darker side of human nature.\n\n01:03.200 --> 01:07.600\n Please let me also address something for a few minutes that happened recently\n\n01:08.000 --> 01:09.400\n that's been weighing heavy on me.\n\n01:10.100 --> 01:13.600\n If you find me annoying to listen to, please skip to the actual conversation\n\n01:13.600 --> 01:14.100\n with Nick.\n\n01:14.700 --> 01:19.600\n I had a recent podcast episode with Anthony Pompliano where we spoke about\n\n01:19.600 --> 01:23.300\n Bitcoin and life in general for three hours.\n\n01:23.300 --> 01:28.800\n I was curious, inspired, positive, or at least I tried to be as I usually do.\n\n01:29.400 --> 01:34.400\n Someone clipped out, out of context, a short segment of me mumbling something\n\n01:34.600 --> 01:39.700\n about having a PhD and I started getting mocked online because that made it\n\n01:39.700 --> 01:44.800\n convenient for people to mock me for being yet another quote unquote expert\n\n01:45.000 --> 01:47.800\n who learns about Bitcoin and thinks he knows everything.\n\n01:47.800 --> 01:52.600\n I almost never mentioned that I have a PhD, except to make fun of myself as\n\n01:52.600 --> 01:57.100\n I was doing, or at least trying to do in the full context of the conversation.\n\n01:58.000 --> 02:01.900\n I brought up grad school as a random example of one of the many journeys\n\n02:01.900 --> 02:07.900\n I've taken that was hard, but where the destination was in itself, not very useful.\n\n02:08.400 --> 02:12.200\n I was saying I enjoy exploring with a curious mind and I'm willing to be\n\n02:12.200 --> 02:17.100\n patient, to learn, to listen, to humble myself with knowledge, and to\n\n02:17.100 --> 02:20.000\n help with knowledge for the sake of knowledge itself.\n\n02:20.500 --> 02:22.500\n Grad school was an example of that.\n\n02:22.900 --> 02:25.700\n The PhD means nothing, at least to me.\n\n02:26.300 --> 02:30.300\n I never call myself an expert or at least try not to because that would\n\n02:30.300 --> 02:33.800\n be dumb because I know how little I know.\n\n02:34.400 --> 02:40.000\n I'm not a influencer or a thought leader or whatever else silly self\n\n02:40.000 --> 02:42.800\n aggrandizing label people put on their LinkedIn.\n\n02:43.300 --> 02:46.200\n I try to be the opposite of what I was mocked for.\n\n02:46.200 --> 02:49.700\n I try to think deeply about the world, to look for the beautiful ideas\n\n02:49.700 --> 02:52.300\n and the minds of others, and to be inspired by them.\n\n02:53.200 --> 02:57.600\n I wanted to say all this because psychologically, it struck a bit of a blow.\n\n02:58.400 --> 03:02.500\n It made me realize that even when I approach things with love, I may be\n\n03:02.500 --> 03:07.800\n mocked, I may be derided, I may be taken out of context or even lied about.\n\n03:08.500 --> 03:11.100\n But the growing platform, this is sadly only increasing.\n\n03:11.100 --> 03:15.700\n I now have learned that there's people who are waiting for my missteps\n\n03:15.800 --> 03:20.300\n so they can point the finger, laugh, and say, see, I told you so.\n\n03:20.500 --> 03:21.500\n That guy's a joke.\n\n03:21.800 --> 03:22.700\n He's a fraud.\n\n03:23.600 --> 03:26.900\n As a fellow human being, the knowledge of this is painful.\n\n03:27.500 --> 03:32.500\n Yes, I know people tell me to toughen up, and my life has been about\n\n03:32.500 --> 03:36.500\n strengthening my mind in the face of my limits, but I refuse to not be\n\n03:36.500 --> 03:38.900\n fragile and wear my heart on my sleeve.\n\n03:39.200 --> 03:40.000\n It's who I am.\n\n03:40.000 --> 03:44.100\n In some sense, this is the immune system of the internet, but let us\n\n03:44.100 --> 03:47.500\n be careful not to destroy the good ones in the process.\n\n03:48.300 --> 03:52.000\n The Bitcoin community had to endure many years of attacks from\n\n03:52.000 --> 03:55.600\n quote unquote experts and also fraudulent cryptocurrency efforts\n\n03:55.800 --> 03:57.500\n that scam people out of their money.\n\n03:58.000 --> 04:02.000\n This created a powerful immune system that fought the attackers\n\n04:02.000 --> 04:02.800\n and the scammers.\n\n04:03.400 --> 04:06.900\n I understand this, and I also understand that one of the beautiful\n\n04:06.900 --> 04:12.300\n aspects of Bitcoin is its community of humans is decentralized, but\n\n04:12.300 --> 04:15.900\n some small part of this community has come to enjoy the us versus\n\n04:15.900 --> 04:20.000\n them battles, sometimes for the sake of the battle in itself.\n\n04:20.700 --> 04:22.900\n This happens in political discourse as well.\n\n04:23.400 --> 04:27.900\n I understand this, but to my limited mind, it sounds like group\n\n04:27.900 --> 04:32.500\n think, which has powerful defense mechanisms against bad ideas, but\n\n04:32.800 --> 04:35.500\n has dangerous consequences if taken too far.\n\n04:35.500 --> 04:39.500\n As in many periods of human history that I often talk about, where\n\n04:39.500 --> 04:43.700\n the us versus them thinking has led to the suffering of many.\n\n04:44.500 --> 04:47.900\n Again, I understand the value of this as many Bitcoin has explained\n\n04:47.900 --> 04:52.400\n to me, but it's not the way I, as a sovereign individual, choose to\n\n04:52.400 --> 04:53.500\n walk in this life.\n\n04:54.200 --> 04:57.000\n By the way, none of this podcast should be treated as financial\n\n04:57.000 --> 05:01.300\n advice. Before Nick kindly gifted me with a hundred dollars worth\n\n05:01.300 --> 05:05.600\n of Bitcoin in hardware form, I didn't own any.\n\n05:06.000 --> 05:10.100\n I'll probably buy some Bitcoin on Cash App, Coinbase, and other\n\n05:10.100 --> 05:13.600\n platforms, and also transfer to a hardware wallet just to learn\n\n05:13.600 --> 05:14.200\n how to do it.\n\n05:14.600 --> 05:18.100\n But other than that, I don't necessarily make wise investment\n\n05:18.100 --> 05:21.100\n decisions. Money is not a motivation for me personally.\n\n05:21.500 --> 05:22.800\n I try to avoid it actually.\n\n05:23.200 --> 05:26.500\n I'm grateful for every day I'm alive, no matter how much money is\n\n05:26.500 --> 05:29.700\n in my bank account. For long stretches of my life, that number\n\n05:29.700 --> 05:34.100\n was very close to zero, and I was always fortunate to be free and\n\n05:34.100 --> 05:38.100\n happy. So I encourage you to listen to people much smarter than\n\n05:38.100 --> 05:42.800\n me for actual good financial advice. Here, I'm just exploring\n\n05:42.800 --> 05:47.500\n ideas. And as if this has not already gone on too long, let me\n\n05:47.500 --> 05:50.900\n please make another comment on the style of discourse among some\n\n05:50.900 --> 05:55.800\n Bitcoin maximalists on platforms like Twitter, that in my humble\n\n05:55.800 --> 06:00.100\n view, I may be wrong, but I believe is not conducive to the\n\n06:00.100 --> 06:04.100\n nuanced empathetic exchange of ideas I very much look for and\n\n06:04.100 --> 06:07.300\n enjoy. Again, I appreciate their style of discourse.\n\n06:07.500 --> 06:10.600\n I think I understand the value of it, but it's not my thing.\n\n06:10.800 --> 06:12.300\n So I don't want to engage in it.\n\n06:12.800 --> 06:14.800\n I want to hear the quiet voices in the room.\n\n06:15.100 --> 06:18.600\n I look for people to inspire each other, and when we disagree,\n\n06:18.600 --> 06:22.500\n I look for disagreement that is grounded in respect and empathy.\n\n06:22.500 --> 06:26.200\n I think that mockery and derision destroys the possibility of\n\n06:26.200 --> 06:27.600\n those nuanced conversations.\n\n06:28.000 --> 06:32.000\n It drives away the quiet, thoughtful, empathetic voices, and\n\n06:32.000 --> 06:35.900\n I try to give those voices space to be heard, to shine, to\n\n06:35.900 --> 06:39.000\n exchange ideas, whether we agree or disagree.\n\n06:39.800 --> 06:44.600\n So, if I happen to block you on Twitter, I block you with love.\n\n06:45.200 --> 06:49.200\n Honestly, I will never speak poorly of you or even think poorly\n\n06:49.200 --> 06:52.600\n of you. I would love to hang out in person, give you a big old\n\n06:52.600 --> 06:57.000\n hug, and talk about life over some beers. If you see or hear\n\n06:57.000 --> 07:01.500\n me say something stupid, which I'm sure I do often, or something\n\n07:01.500 --> 07:04.600\n you disagree with, and you still respect me as a human being,\n\n07:04.600 --> 07:08.100\n please show your love, as I always do to you, but also send\n\n07:08.100 --> 07:12.700\n me some links to blogs, books, videos, podcasts, where people\n\n07:12.700 --> 07:16.200\n describe why my stated idea may be totally wrong.\n\n07:16.200 --> 07:19.600\n I love this kind of long form disagreement. I humble myself\n\n07:19.600 --> 07:23.300\n every day by reading books and blogs by people much smarter\n\n07:23.300 --> 07:27.200\n than me. Sometimes it strengthens my ideas, sometimes it\n\n07:27.200 --> 07:32.000\n totally changes them, but I always learn. This is a too long\n\n07:32.000 --> 07:36.100\n way of saying that I'm here trying to walk with grace and\n\n07:36.100 --> 07:41.200\n with an open mind, a bit of patience, and always love. If I\n\n07:41.200 --> 07:45.500\n make mistakes, cut me some slack. Like you, I'm here trying\n\n07:45.500 --> 07:51.700\n to love. Like you, I'm only human. Allegedly. This is the\n\n07:51.700 --> 07:56.000\n Lex Friedman podcast, and here is my conversation with Nick\n\n07:56.000 --> 08:00.900\n Carter. What philosopher or philosophical idea had a big\n\n08:00.900 --> 08:04.100\n impact on your life, not just in the space of cryptocurrency,\n\n08:04.100 --> 08:04.800\n but in general?\n\n08:05.400 --> 08:08.200\n Oh, so we're going now. We're rolling. We're going right in.\n\n08:08.200 --> 08:11.000\n We're rolling. Because you majored philosophy. I did. I majored\n\n08:11.000 --> 08:14.500\n in philosophy. I didn't know what to do with my life, and my\n\n08:14.500 --> 08:16.900\n parents said, do whatever you find interesting. It's like,\n\n08:16.900 --> 08:21.300\n okay, philosophy, great. I find that interesting. And it had\n\n08:21.300 --> 08:25.500\n way more of an impact on my career, actually, than I thought\n\n08:25.500 --> 08:28.700\n it might. Typically, I guess, if you do philosophy, you go into\n\n08:28.700 --> 08:33.800\n law or finance, so it sort of makes sense. But there are a number\n\n08:33.800 --> 08:38.000\n of philosophers I really admire. One of my favorites would\n\n08:38.000 --> 08:42.200\n be Descartes, probably the notion of skepticism. It's sort of\n\n08:42.200 --> 08:44.900\n a rabbit hole. It's kind of hard to pull yourself out of it.\n\n08:45.700 --> 08:48.000\n Basically, the brain in the vat theory, pulling yourself out\n\n08:48.000 --> 08:52.100\n of that. But yeah, I really like epistemology, you know,\n\n08:52.100 --> 08:56.800\n questioning what it is to have knowledge. So Descartes was\n\n08:56.800 --> 08:58.300\n one of my gateways to that.\n\n08:59.000 --> 09:02.100\n Do you think everything is knowable? Like, we humans can\n\n09:03.000 --> 09:05.800\n can know fully the objective reality?\n\n09:05.900 --> 09:10.600\n Oh, definitely not. No, I mean, reality is very much processed\n\n09:10.600 --> 09:13.000\n through your own, you know, subjective lens.\n\n09:13.900 --> 09:18.100\n So how much do you think do we understand about this world?\n\n09:18.800 --> 09:21.300\n Because a lot of your ideas, a lot of things we might talk\n\n09:21.300 --> 09:25.300\n about today are kind of trying to figure out human civilization,\n\n09:25.300 --> 09:29.400\n how humans, how human behavior works at scale, all those\n\n09:29.400 --> 09:33.200\n kinds of things. That kind of assumes that we have it or\n\n09:33.200 --> 09:38.800\n we're able to somehow figure most of it out, right? So in your\n\n09:38.800 --> 09:42.300\n sort of when you step way back, how much of it have we really\n\n09:42.300 --> 09:43.100\n figured out?\n\n09:43.700 --> 09:47.000\n Well, I think that's the conceit of economics is thinking\n\n09:47.000 --> 09:50.400\n that you can model human behavior in these unbelievably\n\n09:50.400 --> 09:54.600\n complex systems. And then I think that's the modern critique\n\n09:54.600 --> 09:58.200\n of economics, like the sort of Taliban critique is that you\n\n09:58.200 --> 10:01.700\n can't have true knowledge, and they're much less predictable\n\n10:01.700 --> 10:06.000\n than we think they are. And, you know, we behave according\n\n10:06.000 --> 10:09.000\n to our accumulated assumptions, and we're using tiny sort\n\n10:09.000 --> 10:13.200\n of data sets trained on the last 50, 100 years, and they turn\n\n10:13.200 --> 10:16.700\n out to be horribly askew. And that's when we have our gray\n\n10:16.700 --> 10:21.900\n swans and our black swans. So I'm much more on the sort\n\n10:21.900 --> 10:25.500\n of, you know, reality is much less noble than we think side\n\n10:25.500 --> 10:28.800\n of things. But it is nice to have very concrete things like\n\n10:28.800 --> 10:29.900\n Bitcoin, that's for sure.\n\n10:30.200 --> 10:33.500\n Oh, so you think so most of it is shaky ground, but there\n\n10:33.500 --> 10:36.200\n are some things there's like islands of stoniness.\n\n10:36.900 --> 10:38.400\n Yeah, Bitcoin is one of them.\n\n10:38.400 --> 10:40.000\n That's a good way to put it.\n\n10:40.000 --> 10:42.700\n Yeah, I mean, like look at the dollar system, not to pivot\n\n10:42.700 --> 10:46.400\n this into the dollar right away, but the dollar is like\n\n10:46.400 --> 10:47.200\n shaky ground.\n\n10:47.200 --> 10:50.600\n It's the most who truly understands the dollar system.\n\n10:50.600 --> 10:55.000\n I mean, the totality of it, the Euro dollar system, the\n\n10:55.000 --> 10:58.700\n way that monetary policy interacts with the economy is\n\n10:58.800 --> 11:01.100\n monetary issuance inflationary.\n\n11:01.100 --> 11:04.100\n What's the relationship between unemployment and inflation?\n\n11:04.100 --> 11:06.600\n Even policymakers don't understand these things.\n\n11:06.600 --> 11:08.600\n Economists don't seem to understand them.\n\n11:08.600 --> 11:10.100\n What is inflation?\n\n11:10.100 --> 11:11.100\n How do you define inflation?\n\n11:11.100 --> 11:13.700\n None of these things are really known or knowable.\n\n11:13.700 --> 11:17.100\n So a lot of people kind of make a claim that there's a\n\n11:17.100 --> 11:20.300\n lot of manipulation possible with the dollar with those\n\n11:20.300 --> 11:24.200\n currencies. If you couple that with the fact that people\n\n11:24.200 --> 11:27.800\n don't understand it, and yet there's claims that being\n\n11:27.800 --> 11:32.200\n manipulated by centralized power, how do you bring those\n\n11:32.300 --> 11:33.700\n two ideas together?\n\n11:33.900 --> 11:36.300\n If no one understands that, how can you manipulate it?\n\n11:36.600 --> 11:39.700\n I think what we don't understand are the long term consequences\n\n11:39.700 --> 11:41.600\n of our structures.\n\n11:41.600 --> 11:46.400\n So like the Fed's mandate to target unemployment and\n\n11:46.800 --> 11:51.700\n steady, you know, exchange rates or low inflation, you\n\n11:51.700 --> 11:54.900\n know, what we don't understand is okay, what is the result\n\n11:54.900 --> 11:57.000\n of doing that continuously for 40 years?\n\n11:57.000 --> 11:59.200\n What is the net effect of that?\n\n11:59.200 --> 12:02.700\n What is the consequence of the long term accumulation of\n\n12:02.700 --> 12:06.200\n debt and, you know, basement interest rates?\n\n12:06.200 --> 12:08.000\n What is the net effect of that on society?\n\n12:08.000 --> 12:12.900\n We might understand there's much short term features of\n\n12:12.900 --> 12:15.800\n the system, but I think it's the longer term features\n\n12:15.800 --> 12:16.500\n we don't understand.\n\n12:16.500 --> 12:20.600\n Do you think there's like malevolent people with people\n\n12:20.600 --> 12:24.400\n that don't have good intent in central banks like in the\n\n12:24.400 --> 12:29.800\n system, you know, when you have centralized power in any\n\n12:29.800 --> 12:35.700\n forms, it's susceptible to somebody hacking the system,\n\n12:35.900 --> 12:39.600\n taking the power, and in the shadows, this is where conspiracy\n\n12:39.600 --> 12:40.900\n theories come in, right?\n\n12:40.900 --> 12:48.900\n In the shadows, be able to, you know, act out things that\n\n12:48.900 --> 12:51.200\n have a lot of negative impacts on a large percent of the\n\n12:51.200 --> 12:54.600\n population in greedy self interest.\n\n12:54.600 --> 12:55.900\n Do you think there's people like that?\n\n12:55.900 --> 12:59.000\n Or do you think fundamentally most people are good, even\n\n12:59.300 --> 13:03.200\n those associated with the sort of central banking?\n\n13:03.800 --> 13:06.100\n I mean, I don't villainize those people.\n\n13:06.200 --> 13:09.000\n I think everyone is the hero of their own story, right?\n\n13:09.000 --> 13:12.300\n So they all believe that their force are good in the world.\n\n13:12.300 --> 13:13.100\n You have to.\n\n13:13.900 --> 13:15.100\n Are there any true villains?\n\n13:15.100 --> 13:15.800\n I don't think so.\n\n13:15.800 --> 13:20.000\n I think they get socialized into a world where they believe\n\n13:20.000 --> 13:24.400\n there's particular skills and their mandate is, you know,\n\n13:24.400 --> 13:25.600\n what they should be doing.\n\n13:27.100 --> 13:31.400\n I think they might be presumptuous or arrogant in some cases.\n\n13:33.400 --> 13:36.300\n And, you know, I think it's more of a systemic issue where\n\n13:36.300 --> 13:41.700\n you have a small handful of very homogenous types of people\n\n13:41.700 --> 13:45.500\n with PhDs from the same institutions that are brought up\n\n13:45.500 --> 13:50.100\n in the same cultural context that, you know, set policy and\n\n13:50.100 --> 13:52.700\n wield a tremendous amount of control over society.\n\n13:53.500 --> 13:57.400\n And I think they have this notion that you can tinker society.\n\n13:57.500 --> 14:00.500\n You can play with a few key variables and tinker society\n\n14:00.500 --> 14:03.800\n into a state that is desirable or good.\n\n14:04.200 --> 14:05.600\n And that's what they're trying to do.\n\n14:06.500 --> 14:09.100\n And I think the consequences of that can be pretty bad.\n\n14:09.500 --> 14:12.300\n But no, I don't think it's born out of malevolence.\n\n14:12.900 --> 14:14.500\n There's an interesting idea.\n\n14:14.500 --> 14:17.500\n I think Michael Malas brought it up as a test whether you're\n\n14:17.500 --> 14:18.700\n on the left or the right.\n\n14:21.200 --> 14:24.400\n The question he asks, which is, do you think some people\n\n14:24.400 --> 14:25.600\n are better than others?\n\n14:27.700 --> 14:30.400\n If you say yes, he claims you're on the right.\n\n14:31.000 --> 14:34.700\n If you start answering, if you start like saying a lot of\n\n14:34.700 --> 14:39.800\n things, like you're on the left.\n\n14:39.900 --> 14:44.000\n So if you start explaining yourself, well, it's a good term for it.\n\n14:44.000 --> 14:51.000\n I was really, so in this test, I suppose I would be on the left\n\n14:51.000 --> 14:54.500\n because I'm uncomfortable with the idea that some people are\n\n14:54.500 --> 14:59.200\n better than others as a basic feeling, as a starting point in\n\n14:59.200 --> 15:00.500\n the way you think about the world.\n\n15:00.500 --> 15:04.500\n Because as we're talking about, everybody's a hero of their own\n\n15:04.500 --> 15:08.200\n story. When you start to think some people are better than\n\n15:08.200 --> 15:15.000\n others, as a starting axiom, it's like a slippery slope to\n\n15:15.000 --> 15:20.200\n where you think you're way better than others.\n\n15:20.900 --> 15:25.700\n And then you start to like, basically, it's okay to take\n\n15:25.700 --> 15:29.200\n advantage of a large percent of the population for the greater\n\n15:29.200 --> 15:33.800\n good. And then you go into Stalin mode and Hitler mode where\n\n15:33.800 --> 15:37.600\n it's okay to murder a larger part of the population for the\n\n15:37.600 --> 15:41.100\n greater good. So it's like, it's this very dangerous slippery\n\n15:41.100 --> 15:42.100\n slope in my mind.\n\n15:42.100 --> 15:46.000\n So I try to not, yeah, I was always uncomfortable with that\n\n15:46.000 --> 15:48.700\n kind of test or even that kind of thought. And yes, the same\n\n15:48.700 --> 15:54.300\n applies and suppose in government, in central banking is if\n\n15:54.300 --> 15:58.000\n you think some people are better than others, applying your\n\n15:58.000 --> 16:03.100\n idea of what is good can have large scale detrimental effects.\n\n16:03.700 --> 16:04.400\n Of course.\n\n16:04.400 --> 16:04.900\n Yeah.\n\n16:04.900 --> 16:09.900\n I'm glad you didn't pose me the question. I mean, I think it\n\n16:09.900 --> 16:14.700\n maybe not the left right axiom isn't the disjunction isn't the\n\n16:14.700 --> 16:20.200\n way I would sort of put it. But you know, to me, it's just if\n\n16:20.200 --> 16:23.700\n you reason in a consequentialist way, you know, that lends\n\n16:23.700 --> 16:27.300\n itself to authoritarianism. Yeah, where whereby you think\n\n16:27.300 --> 16:30.500\n you can shape society and only you can shape society in a\n\n16:30.500 --> 16:35.600\n positive direction according to your, you know, specific objectives.\n\n16:35.600 --> 16:39.900\n So let's step onto the land of sturdiness that is Bitcoin.\n\n16:39.900 --> 16:45.700\n What is Bitcoin and in your view, what are, you know, the\n\n16:45.700 --> 16:48.600\n principles, the philosophical foundations of Bitcoin?\n\n16:48.600 --> 16:54.100\n Well, Bitcoin the term I think refers to two things specifically.\n\n16:54.100 --> 16:59.300\n So one is the protocol for conveying value through a communications\n\n16:59.300 --> 17:03.100\n channel. So just a set of rules that we collectively opt into\n\n17:03.100 --> 17:08.000\n in order to transact online or just at a distance.\n\n17:08.000 --> 17:13.400\n And then the other thing is the name of the asset, the sort of\n\n17:13.400 --> 17:17.900\n monetary unit which circulates within the system and that always\n\n17:17.900 --> 17:20.700\n confuse people a lot because it's like, well, you got uppercase\n\n17:20.700 --> 17:24.400\n Bitcoin, lowercase Bitcoin, why didn't Satoshi just give them\n\n17:24.400 --> 17:28.600\n different names? Like in Ethereum, you've got Ethereum, the system\n\n17:28.600 --> 17:31.900\n and then Ether. Although people don't really talk about Ether very\n\n17:31.900 --> 17:37.100\n much, but they, you know, chose to distinguish them. In Bitcoin,\n\n17:37.100 --> 17:41.600\n for whatever reason, they're not distinct. So the two Bitcoins\n\n17:41.600 --> 17:45.800\n get commingled all the time in the explanations. Did you find\n\n17:45.800 --> 17:48.600\n that's a problem that confuses things? I mean, what's what's\n\n17:48.600 --> 17:51.100\n really a distinction between the protocol and the currency?\n\n17:51.100 --> 17:55.700\n Well, they are sometimes distinguished practically, like you can\n\n17:55.700 --> 17:59.600\n transact with Bitcoin outside of the Bitcoin protocol, for instance.\n\n17:59.600 --> 18:06.100\n So, you know, you can transact with Bitcoin on Ethereum or I have\n\n18:06.100 --> 18:10.300\n Bitcoin on Opendime here. This would be a Bitcoin transaction.\n\n18:10.300 --> 18:13.000\n It wouldn't settle on the Bitcoin network. Do you mind explaining\n\n18:13.000 --> 18:16.400\n what you have on the table before us? Yeah, so I brought you some\n\n18:16.400 --> 18:20.700\n presents. This is awesome. This isn't a bribe. This is just a proof\n\n18:20.700 --> 18:27.100\n of concept. So this is basically a Bitcoin bearer instrument.\n\n18:27.100 --> 18:32.100\n So I put a hundred bucks of Bitcoin on here. And to spend it,\n\n18:32.100 --> 18:35.100\n you have to basically physically destroy part of the device.\n\n18:35.100 --> 18:38.600\n You have to poke a hole and, you know, poke off one of the little\n\n18:38.600 --> 18:44.800\n transistors on this. So it can only be spent once. And you can't\n\n18:44.800 --> 18:48.100\n extract the private key from this device. So the private key was\n\n18:48.100 --> 18:52.600\n generated on device, always stays on the device. So what it means\n\n18:52.600 --> 18:59.900\n without breaking off, like a small part. So this basically is a way\n\n18:59.900 --> 19:06.100\n to physically instantiate Bitcoin. So it's basically gold.\n\n19:06.100 --> 19:10.300\n Yeah, effectively. So here. Thank you so much. This one's limited\n\n19:10.300 --> 19:15.100\n edition. It's orange. So what is it called again? Opendime.\n\n19:15.100 --> 19:18.700\n The point is, if you wanted to settle a Bitcoin transaction\n\n19:18.700 --> 19:22.800\n instantly, the kind of same way that a cash transaction is instant\n\n19:22.800 --> 19:27.100\n final settlement, right? You would do it with a device like this.\n\n19:27.100 --> 19:32.300\n So if I was buying a house from you, you know, you might prefer\n\n19:32.300 --> 19:36.500\n to do it with a physical bearer instrument as opposed to waiting\n\n19:36.500 --> 19:40.900\n for confirmation on the Bitcoin blockchain. So the moment I hand\n\n19:40.900 --> 19:43.600\n that over to you, goes in your possession, you're the owner.\n\n19:43.600 --> 19:47.700\n There's no way for me to have retained the private key. Like I\n\n19:47.700 --> 19:50.400\n could have created a Bitcoin paper wallet and given that to you,\n\n19:50.400 --> 19:54.100\n but you have no assurance that I didn't copy down that, you know,\n\n19:54.100 --> 19:57.100\n the key elsewhere. So this solves that problem.\n\n19:57.100 --> 20:03.100\n So this is a physical instantiation of the Bitcoin transaction\n\n20:03.100 --> 20:04.800\n outside the Bitcoin protocol.\n\n20:04.800 --> 20:05.400\n That's right.\n\n20:05.400 --> 20:08.200\n So this is, you're transacting the currency outside of the protocol.\n\n20:08.200 --> 20:13.000\n So it's analog Bitcoin. We're running it analog, which I was like,\n\n20:13.000 --> 20:16.300\n because Bitcoin is this immaterial thing. And so it's nice to have\n\n20:16.300 --> 20:17.500\n physical totems.\n\n20:17.500 --> 20:20.600\n How much does it cost to manufacture this, do you know?\n\n20:20.600 --> 20:22.300\n Like 15 bucks or something.\n\n20:22.300 --> 20:27.100\n So this is just kind of almost like a philosophical statement\n\n20:27.100 --> 20:33.900\n versus something that's scalable for use. Like, you know, the point\n\n20:33.900 --> 20:35.900\n of Bitcoin is to be in the digital space, right?\n\n20:35.900 --> 20:38.900\n But this shows like Bitcoin can be anywhere.\n\n20:38.900 --> 20:40.200\n It's useful for gifts.\n\n20:40.200 --> 20:44.600\n But yeah, I mean, I don't know if it would be a suitable foundation\n\n20:44.600 --> 20:48.100\n for a physical Bitcoin economy. In theory, these would be like\n\n20:48.100 --> 20:50.400\n cash like instruments that you could use to transact.\n\n20:50.400 --> 20:52.400\n Well, I just mean post apocalypse.\n\n20:52.400 --> 20:57.100\n Yeah, yeah. But you still need to plug it into your laptop to\n\n20:57.100 --> 20:59.800\n actually verify that there's coins on there.\n\n20:59.800 --> 21:01.800\n So you still need the internet.\n\n21:01.800 --> 21:06.300\n So I have to take your word for how much money is on here.\n\n21:06.300 --> 21:10.100\n No, I mean, you can plug it into your laptop and check.\n\n21:10.100 --> 21:15.000\n Yeah, but to transact, to extract Bitcoin from this, I need to break.\n\n21:15.000 --> 21:18.900\n Yeah, you have to poke a hole through the little hole and that\n\n21:18.900 --> 21:21.400\n renders it spendable, basically.\n\n21:21.400 --> 21:25.800\n So, you know, that's protection against you spending it and then\n\n21:25.800 --> 21:27.500\n representing that it's still loaded.\n\n21:27.500 --> 21:29.100\n That's fascinating. Cool.\n\n21:29.100 --> 21:32.300\n Yeah, so that the other thing I brought here, basically dice,\n\n21:32.300 --> 21:37.400\n 12 sided, they don't have any Bitcoin on them.\n\n21:37.400 --> 21:41.200\n So they just have a bunch of different critiques of Bitcoin on\n\n21:41.200 --> 21:44.900\n each side. We'll go through them then.\n\n21:44.900 --> 21:45.700\n This is awesome.\n\n21:45.700 --> 21:48.900\n I don't know if we have time to do all 11 because there's one\n\n21:48.900 --> 21:50.700\n with my funds logo on it.\n\n21:50.700 --> 21:55.600\n But it's just basically a tongue in cheek joke that the critiques\n\n21:55.600 --> 21:58.300\n of Bitcoin are so formulaic at this point that you can just\n\n21:58.300 --> 21:59.200\n put them on dice.\n\n21:59.200 --> 22:01.800\n Yeah, it's silly.\n\n22:01.800 --> 22:06.900\n Well, some of them might be topics for interesting conversations.\n\n22:06.900 --> 22:10.100\n Oh, yeah. We could even arrange the conversation that way.\n\n22:10.100 --> 22:11.700\n You can roll the dice and see what you got.\n\n22:11.700 --> 22:12.600\n All right.\n\n22:12.600 --> 22:17.400\n But first, the philosophical foundations of Bitcoin.\n\n22:17.400 --> 22:21.500\n Like, how do you see Bitcoin outside of just a basic protocol\n\n22:21.500 --> 22:22.700\n and a basic currency?\n\n22:22.700 --> 22:27.400\n It seems to be, like you said, it seems like sturdy ground.\n\n22:27.400 --> 22:28.400\n So what do you mean by this?\n\n22:28.400 --> 22:28.600\n Yeah.\n\n22:28.600 --> 22:29.200\n Yeah.\n\n22:29.200 --> 22:32.000\n So it's not just any protocol for moving value around.\n\n22:32.000 --> 22:33.100\n It's not just any currency.\n\n22:33.100 --> 22:37.700\n It's got specific rules and values that are embedded in it.\n\n22:37.700 --> 22:41.400\n And this is an important point is that Bitcoin is the encoding\n\n22:41.400 --> 22:47.800\n of certain values, which are often misunderstood or not acknowledged\n\n22:47.800 --> 22:48.500\n necessarily.\n\n22:48.500 --> 22:52.600\n And so it's sort of impregnated with values.\n\n22:52.600 --> 22:55.300\n And what they are specifically is a topic of debate.\n\n22:55.300 --> 22:59.900\n And there have been civil wars fought over the values inherent\n\n22:59.900 --> 23:00.500\n in Bitcoin.\n\n23:00.500 --> 23:05.700\n One of them was, should Bitcoin be this cheap, scalable, the base\n\n23:05.700 --> 23:10.400\n layer, low fee payments system with an emphasis on P2P payments?\n\n23:10.400 --> 23:16.300\n Or should it be more of this gold like digital commodity that\n\n23:16.300 --> 23:21.200\n would eventually settle infrequently and mainly between institutions?\n\n23:21.200 --> 23:21.500\n Right?\n\n23:21.500 --> 23:24.100\n So that's fundamentally a conflict of visions.\n\n23:24.100 --> 23:25.000\n Right?\n\n23:25.000 --> 23:30.500\n So keep in mind that this is just one man's opinion.\n\n23:30.500 --> 23:31.600\n I don't speak for Bitcoin.\n\n23:31.600 --> 23:32.500\n Right?\n\n23:32.500 --> 23:38.000\n So I would say the key number one value that's embedded in\n\n23:38.000 --> 23:41.300\n Bitcoin is the notion of nondiscretionary monetary policy.\n\n23:41.300 --> 23:45.800\n So algorithmic monetary policy as opposed to human based\n\n23:45.800 --> 23:46.700\n monetary policy.\n\n23:46.700 --> 23:48.800\n Satoshi was very clear about that.\n\n23:48.800 --> 23:52.900\n Bitcoin is an alternative to modern central banking where you\n\n23:52.900 --> 23:57.700\n have constant tweaking, constant intervention, which Satoshi felt\n\n23:57.700 --> 23:59.800\n leads to credit bubbles and so on.\n\n23:59.800 --> 24:04.700\n So Bitcoin proposes a completely nondiscretionary monetary\n\n24:04.700 --> 24:08.600\n policy, sort of decays over time.\n\n24:08.600 --> 24:11.800\n 50% of the coins were issued in the first four years and then\n\n24:11.800 --> 24:16.100\n the next 25% in the next four years, then 12.5% in the next\n\n24:16.100 --> 24:18.800\n four years until you get to 21 million units.\n\n24:18.800 --> 24:21.000\n And none of those numbers really matter.\n\n24:21.000 --> 24:24.300\n Like it could have been 25 million units and it could have\n\n24:24.300 --> 24:26.700\n been a more aggressive slope or more gradual slope.\n\n24:26.700 --> 24:31.500\n What matters is that this schedule was proposed even before\n\n24:31.500 --> 24:33.500\n the code was public.\n\n24:33.500 --> 24:37.600\n The schedule was proposed and then we all collectively agreed\n\n24:37.600 --> 24:38.300\n to stick to it.\n\n24:38.300 --> 24:41.800\n And that is kind of a first for monetary system.\n\n24:41.800 --> 24:45.600\n I mean, gold kind of has that property, right?\n\n24:45.600 --> 24:49.300\n Because the supply of gold above ground only really increases\n\n24:49.300 --> 24:53.700\n at 1% to 2% a year. So it's sort of inhuman, which is a good\n\n24:53.700 --> 24:54.300\n feature, right?\n\n24:54.300 --> 24:56.600\n You don't want to give humans that much control over it.\n\n24:56.600 --> 25:02.500\n Bitcoin is a much more, you know, fastidious approach to that.\n\n25:02.500 --> 25:06.600\n It really is super concrete about what the supply schedule\n\n25:06.600 --> 25:09.600\n is and the fact, crucially, that it can't change.\n\n25:09.600 --> 25:13.400\n So we can't have a bailout of debtors.\n\n25:13.400 --> 25:17.900\n Let's say a lot of people had debts denominated in Bitcoin\n\n25:17.900 --> 25:21.200\n and we needed loose, accommodative monetary policy to bail them\n\n25:21.200 --> 25:22.700\n out. That's not possible.\n\n25:22.700 --> 25:26.900\n We couldn't have a jubilee denominated in Bitcoin because the\n\n25:26.900 --> 25:32.500\n social contract we've all bought into and committed to is that\n\n25:32.500 --> 25:36.400\n it's nondiscretionary. So that's sort of one of the first things.\n\n25:36.400 --> 25:41.700\n And I think ultimately that comes back to basically a strong\n\n25:41.700 --> 25:46.600\n respect for property rights because if we were to have unanticipated\n\n25:46.600 --> 25:51.000\n inflation, let's say a really charismatic leader somehow commandeered\n\n25:51.000 --> 25:53.900\n Bitcoin and convinced everyone that we should have 30 million units\n\n25:53.900 --> 25:58.800\n and not 21 million, that would basically be dilutive on everybody\n\n25:58.800 --> 26:05.100\n that held Bitcoin and had opted into the 21 million set of coins.\n\n26:05.100 --> 26:09.100\n An additional 9 million unanticipated would have a dilutive effect\n\n26:09.100 --> 26:09.800\n on everyone else.\n\n26:09.800 --> 26:13.000\n And that would be a covert way of effectively stealing their\n\n26:13.000 --> 26:14.800\n purchasing power through inflation.\n\n26:14.800 --> 26:16.200\n Is that possible, that kind of thing?\n\n26:16.200 --> 26:20.700\n I mean, what's the mechanism of Bitcoin that resists that kind of\n\n26:20.700 --> 26:21.500\n charismatic leader?\n\n26:21.500 --> 26:26.700\n Well, we've had people that have had a lot of influence in Bitcoin\n\n26:26.700 --> 26:30.200\n in the past and they've tried to make changes to the protocol, not\n\n26:30.200 --> 26:36.100\n as dramatic as that, but Bitcoiners have generally resisted those\n\n26:36.100 --> 26:41.100\n individuals, institutions, and Bitcoiners have a good track record\n\n26:41.100 --> 26:44.200\n of sort of staying true to those core values.\n\n26:44.200 --> 26:51.000\n So you mentioned values and sticking to the monetary thing, but\n\n26:51.000 --> 26:52.000\n there's bigger values.\n\n26:52.000 --> 26:56.600\n There's almost like psychological values that are instilled in\n\n26:56.600 --> 27:01.100\n Bitcoin. You make a point that Bitcoin for many is a vessel, quote,\n\n27:01.100 --> 27:04.300\n for their expectations, hopes, and dreams.\n\n27:04.300 --> 27:11.000\n Can the Bitcoin protocol support this kind of complexity of the\n\n27:11.000 --> 27:11.800\n human condition?\n\n27:11.800 --> 27:17.200\n So, like, there's ideas of freedom that seem to be spoken about.\n\n27:17.200 --> 27:23.300\n There's a sort of ideas of, I mean, even love.\n\n27:23.300 --> 27:24.300\n Yeah.\n\n27:24.300 --> 27:28.500\n I mean, some people kind of use it as a meme, like, you know, Bitcoin\n\n27:28.500 --> 27:32.600\n is love or something like that, you know, mostly to troll me because\n\n27:32.600 --> 27:33.800\n I talk about love all the time.\n\n27:33.800 --> 27:39.900\n But, you know, these bigger ideas than just the exchange of\n\n27:39.900 --> 27:40.500\n currencies.\n\n27:40.500 --> 27:45.300\n Yeah, I mean, Bitcoin itself is very simple, I would say.\n\n27:45.300 --> 27:50.400\n Like, ultimately, it doesn't, you know, pretend to do very much.\n\n27:50.400 --> 27:52.200\n It really just settles transactions.\n\n27:52.200 --> 27:57.900\n But people do superimpose their own views on it, for sure.\n\n27:57.900 --> 28:05.100\n And Bitcoin's qualities give rise to these perceptions of it having\n\n28:05.100 --> 28:09.900\n censorship resistance or giving you transactional freedom or a measure\n\n28:09.900 --> 28:11.200\n of transactional privacy.\n\n28:11.200 --> 28:18.400\n So because anyone can operate a node and join the consensus process\n\n28:18.400 --> 28:22.900\n and because mining is a competitive free market process, that means\n\n28:22.900 --> 28:28.100\n that it's likely that you can't be censored by the miners.\n\n28:28.100 --> 28:30.000\n So that means you have transactional freedom.\n\n28:30.000 --> 28:34.000\n So you have these computer science technical features of the system\n\n28:34.000 --> 28:38.200\n that cause it to have these political qualities, which is it's very\n\n28:38.200 --> 28:41.500\n hard or impossible to censor a specific individual.\n\n28:41.500 --> 28:45.900\n So it's interesting to see that flow.\n\n28:45.900 --> 28:50.400\n So that's one of the core values, for sure, is the censorship resistance.\n\n28:50.400 --> 28:56.000\n Then you have the fact that it's a cryptographic based system and you\n\n28:56.000 --> 28:59.500\n can hold value in your brain by memorizing 12 words, for instance.\n\n28:59.500 --> 29:04.600\n That gives it seizure resistance, which is, again, a political concept.\n\n29:04.600 --> 29:09.800\n If you wanted to desert your jurisdiction with your wealth intact in your\n\n29:09.800 --> 29:15.400\n brain, that cryptographic feature of the system, the fact that it's\n\n29:15.400 --> 29:20.100\n built on public key cryptography and that you can encode a Bitcoin private\n\n29:20.100 --> 29:27.400\n key in 12 words, that gives it this political salience that you're now\n\n29:27.400 --> 29:30.200\n empowered relative to a despot, basically.\n\n29:30.200 --> 29:35.300\n Yeah, I mean, there's so many beautiful concepts behind cryptocurrency,\n\n29:35.300 --> 29:40.800\n behind Bitcoin, that stand for sort of freedom, some of the basic\n\n29:40.800 --> 29:42.300\n things at the founding of this country.\n\n29:42.300 --> 29:48.500\n The one thing I don't like personally behind Bitcoin and cryptocurrencies\n\n29:48.500 --> 29:52.700\n that money is involved and it's like people's life savings sometimes are\n\n29:52.700 --> 30:01.100\n involved, so there is naturally a kind of fear, a self preservation, like\n\n30:01.100 --> 30:07.400\n instinctual kind of dogmatic thing that comes in where you're not the best\n\n30:07.400 --> 30:08.100\n of human nature.\n\n30:08.100 --> 30:14.000\n You stop being a George Washington and you lose touch of the foundational\n\n30:14.000 --> 30:17.100\n principles, which I think are beautiful, just like the founding principles\n\n30:17.100 --> 30:17.800\n of this country.\n\n30:17.800 --> 30:23.000\n So that's just like, so I like staying on the level of like the\n\n30:23.000 --> 30:29.300\n philosophy versus the level of like all my money is invested in Bitcoin\n\n30:29.300 --> 30:35.600\n and that becomes very tricky territory to have principle discussions\n\n30:35.600 --> 30:37.300\n about ideas.\n\n30:37.300 --> 30:39.500\n Well, it's an interesting tension.\n\n30:39.500 --> 30:43.100\n I try to stay balanced despite being very exposed to Bitcoin.\n\n30:43.100 --> 30:48.300\n So let me ask the ridiculous question, just in case, who is Satoshi\n\n30:48.300 --> 30:50.300\n Nakamoto and is it you?\n\n30:50.300 --> 30:51.100\n We don't know.\n\n30:51.100 --> 30:59.800\n It's probably not me because I was like 17 when Satoshi mounted Bitcoin,\n\n30:59.800 --> 31:04.700\n 16, so unlikely and also not really a programmer.\n\n31:04.700 --> 31:09.500\n So there's a lot of theories, but honestly, it's one of the greatest\n\n31:09.500 --> 31:13.300\n mysteries of all time because even Bitcoiners that have been around\n\n31:13.300 --> 31:19.000\n since day one, really, you know, people that were around before Bitcoin\n\n31:19.000 --> 31:21.700\n came out, they're on the mailing list, they're active in the cypherpunk\n\n31:21.700 --> 31:26.400\n community, you ask them and they sincerely will not know and they may\n\n31:26.400 --> 31:29.000\n not even have a good guess as to who Satoshi is.\n\n31:29.000 --> 31:32.500\n Is it important to know or is it like actually important not to know?\n\n31:32.500 --> 31:35.500\n Do you think that's a feature or bug that you, we don't know?\n\n31:35.500 --> 31:39.700\n Some people don't like the uncertainty, especially, you know, folks on\n\n31:39.700 --> 31:41.400\n Wall Street, they really want to know.\n\n31:41.400 --> 31:48.200\n And if you read the Coinbase S1, their disclosure pre IPO, that's a risk\n\n31:48.200 --> 31:50.200\n factor that Satoshi could come back.\n\n31:50.200 --> 31:56.000\n So the risk management crowd wants to know because they want to know\n\n31:56.000 --> 32:00.400\n if maybe Satoshi had, you know, undesirable political opinions or\n\n32:00.400 --> 32:02.700\n something that would forever taint the project.\n\n32:02.700 --> 32:06.800\n Do you think they were just trolling with that risk with Satoshi's\n\n32:06.800 --> 32:11.800\n identity being a risk factor or is that like actual, like, was there\n\n32:11.800 --> 32:14.800\n an actual meeting and a discussion of that being a risk factor?\n\n32:14.800 --> 32:18.300\n I think in the risk factor sections of the prospectuses, it's really\n\n32:18.300 --> 32:21.500\n just the lawyers doing a total brain dump to cover absolutely everything\n\n32:21.500 --> 32:22.200\n they can think of.\n\n32:22.200 --> 32:23.200\n So it's just lawyers.\n\n32:23.200 --> 32:29.000\n It's not like, you know, it's like, I think Elon was somewhere in the\n\n32:29.000 --> 32:34.800\n legal documents for SpaceX mentioned that like Earth governments have\n\n32:34.800 --> 32:36.300\n no jurisdiction on Mars.\n\n32:36.300 --> 32:39.800\n Like they threw that in there and it feels like, yeah, that could be\n\n32:39.800 --> 32:42.300\n lawyers, but it could also just be Elon trolling.\n\n32:42.300 --> 32:42.700\n Yeah.\n\n32:42.700 --> 32:48.900\n So I wonder if it's like the Coinbase folks trolling or if it's lawyers.\n\n32:48.900 --> 32:51.000\n I hope it's the trolling, not the lawyers.\n\n32:51.000 --> 32:56.800\n The Coinbase leadership, they're not as big trolls as Elon is, but I\n\n32:56.800 --> 33:01.100\n mean, it's a risk for sure from their perspective because let's say\n\n33:01.100 --> 33:04.300\n Satoshi returned, doesn't seem likely, and let's say they decided to\n\n33:04.300 --> 33:07.300\n spend all their coins, which also seems very unlikely.\n\n33:07.300 --> 33:14.100\n That's, you know, rumored to be or estimates have it at 1 to 1.2\n\n33:14.100 --> 33:19.900\n million Bitcoin, which is like 50, 60 billion dollars worth.\n\n33:19.900 --> 33:23.300\n So some people consider that to be a risk.\n\n33:23.300 --> 33:27.600\n You think it's, you know, this is almost like a topic of leadership.\n\n33:27.600 --> 33:32.400\n It doesn't feel like anybody, any one person speaks for Bitcoin.\n\n33:32.400 --> 33:38.200\n There's not even like prominent figures.\n\n33:38.200 --> 33:41.800\n Like you have for like Ethereum, you have Vitalik Buterin.\n\n33:41.800 --> 33:48.800\n There's a lot of like top minds talking about it like yourself, but\n\n33:48.800 --> 33:50.200\n it's not like one or two.\n\n33:50.200 --> 33:53.100\n Do you think again, is that a feature or a bug?\n\n33:53.100 --> 33:58.400\n Like, do you think for effective, for Bitcoin to effectively have a\n\n33:58.400 --> 34:04.700\n role in society that like is as large or larger than the dollar, there\n\n34:04.700 --> 34:10.100\n needs to be like leadership that represents it, almost like democratic\n\n34:10.100 --> 34:10.600\n kind of thing.\n\n34:10.600 --> 34:14.600\n Well, that's a real counterintuitive point because most Bitcoiners,\n\n34:14.600 --> 34:18.300\n including myself, would say, no, the lack of leadership is a great\n\n34:18.300 --> 34:22.700\n quality to have because if you have a charismatic leader and a foundation\n\n34:22.700 --> 34:26.700\n or corporation that controls it, maybe they can control the features\n\n34:26.700 --> 34:31.400\n of the protocol and maybe they can expropriate holders of the coin\n\n34:31.400 --> 34:37.500\n or, you know, build in an endowment that pays them off and gives them\n\n34:37.500 --> 34:40.700\n privileged access to the units of the coin, for instance.\n\n34:40.700 --> 34:45.900\n So, you know, we call people that have privileged access to the money\n\n34:45.900 --> 34:50.800\n spigot Cantillon insiders, which is there is this economist that pointed\n\n34:50.800 --> 34:55.500\n out that as you know, I think Richard Cantillon that as money enters\n\n34:55.500 --> 34:58.200\n the economy has an uneven flow, right?\n\n34:58.200 --> 35:04.400\n So you see this in last last decade or so before that to the consequence\n\n35:04.400 --> 35:07.900\n of money printing in this country is people that own financial assets\n\n35:07.900 --> 35:10.300\n made a lot of money and people that didn't didn't.\n\n35:10.300 --> 35:15.900\n So you see that Cantillon insider Cantillon outsider effect and it's\n\n35:15.900 --> 35:20.300\n the same with a cryptocurrency in many other alternative cryptocurrencies\n\n35:20.300 --> 35:24.900\n that do have these corporate entities or these leaders and CEOs.\n\n35:24.900 --> 35:29.700\n They're able to make specific decisions regarding the protocol and the\n\n35:29.700 --> 35:33.100\n currency of the asset the benefit themselves the cronies, etc.\n\n35:33.100 --> 35:35.800\n And that's not a good feature to have.\n\n35:35.800 --> 35:41.800\n I mean, it does grant you, you know, the ability to orchestrate decisions\n\n35:41.800 --> 35:43.500\n in a faster and more efficient way.\n\n35:43.500 --> 35:47.800\n But long term what you're trying to optimize for if you're creating\n\n35:47.800 --> 35:52.000\n a money is monetary credibility and soundness so you don't really\n\n35:52.000 --> 35:55.600\n want it changing all that often and you don't want to have the\n\n35:55.600 --> 35:59.900\n appearance of you know, these elites that are engaging in rent\n\n35:59.900 --> 36:01.000\n seeking or anything like that.\n\n36:01.000 --> 36:04.500\n So there's definitely people that are influential in Bitcoin this\n\n36:04.500 --> 36:07.600\n core developers that people listen to because it's I would say\n\n36:07.600 --> 36:11.600\n meritocracy largely and they're sort of self appointed high priest\n\n36:11.600 --> 36:12.300\n of the protocol.\n\n36:12.300 --> 36:16.600\n I write a lot about Bitcoin people listen to me but is a completely\n\n36:16.600 --> 36:18.800\n free market of ideas, right?\n\n36:18.800 --> 36:21.800\n I don't have any authority within Bitcoin whatsoever.\n\n36:21.800 --> 36:30.300\n I'm just a scribbler, you know, so was Aristotle and Socrates and Nietzsche.\n\n36:30.300 --> 36:36.300\n Okay, at the high level, technically, how does Bitcoin work?\n\n36:36.300 --> 36:38.800\n Is there interesting things you could say?\n\n36:38.800 --> 36:39.900\n Like what are miners?\n\n36:39.900 --> 36:41.900\n What are nodes, full nodes?\n\n36:41.900 --> 36:42.800\n What are blocks?\n\n36:42.800 --> 36:44.500\n What's proof of work?\n\n36:44.500 --> 36:50.300\n Is there a nice way to wrap up a clean explanation of the protocol?\n\n36:50.300 --> 36:54.300\n Oh man, that could be a whole, that could be another five hours.\n\n36:54.300 --> 36:58.000\n Is there interesting because I'd love to talk to you about block\n\n36:58.000 --> 37:02.700\n size wars and sort of the politics psychology, the principles\n\n37:02.700 --> 37:04.600\n around that, but sort of building up to that.\n\n37:04.600 --> 37:06.900\n It'd be nice to talk about how the thing works.\n\n37:06.900 --> 37:07.800\n That's fair.\n\n37:07.800 --> 37:12.000\n I mean, and the block size wars are really fascinating discussion\n\n37:12.000 --> 37:16.000\n of how governance debates intersect with technical features.\n\n37:16.000 --> 37:23.000\n So I guess we can, yeah, so basically at the highest possible\n\n37:23.000 --> 37:26.400\n level, Bitcoin is a globally shared.\n\n37:26.400 --> 37:32.500\n It's really a replicated ledger that any participant that wants to\n\n37:32.500 --> 37:37.200\n be an equal peer on that ledger, they want to maintain that ledger\n\n37:37.200 --> 37:40.700\n and they want to stay up to date with the global state of the ledger.\n\n37:40.700 --> 37:46.700\n And really any monetary system is just a ledger with physical\n\n37:46.700 --> 37:52.600\n cash. We benefit from the physical instantiation of the money.\n\n37:52.600 --> 37:54.400\n So the physics is the ledger.\n\n37:54.400 --> 37:55.800\n The physics is a ledger, right?\n\n37:55.800 --> 37:57.200\n Same with gold, right?\n\n37:57.200 --> 37:59.100\n You can't just produce new units of gold.\n\n37:59.100 --> 38:05.600\n So we trust that gold atoms are hard to create, although not\n\n38:05.600 --> 38:06.600\n impossible, right?\n\n38:06.600 --> 38:12.300\n You could find a bunch of protons and whatever is the adjacent\n\n38:12.300 --> 38:15.200\n metal and create gold atoms would be expensive.\n\n38:15.200 --> 38:18.600\n And the same with dollars, you know, we trust that it's hard to\n\n38:18.600 --> 38:19.400\n counterfeit a dollar.\n\n38:19.400 --> 38:23.900\n So we trust the physical analog world to help maintain the state\n\n38:23.900 --> 38:28.400\n of that ledger with digital money, like, you know, the money in\n\n38:28.400 --> 38:30.500\n your bank account, your checking account.\n\n38:30.500 --> 38:34.800\n We basically trust our institutions or banking institutions to\n\n38:34.800 --> 38:36.600\n keep a faithful record.\n\n38:36.600 --> 38:39.800\n And then ultimately we trust the central bank to administer that\n\n38:39.800 --> 38:42.600\n system. So there's kind of a handful of nodes.\n\n38:42.600 --> 38:46.600\n In Bitcoin, we trust that the economic incentives of the system\n\n38:46.600 --> 38:49.200\n are carefully poised, basically.\n\n38:49.200 --> 38:54.500\n So we trust that the free market mining competition will lead to\n\n38:54.500 --> 38:58.800\n the miners assembling transactions into blocks in a faithful and\n\n38:58.800 --> 39:03.000\n correct way, and that we are going to converge on a global state\n\n39:03.000 --> 39:04.500\n of the ledger continuously.\n\n39:04.500 --> 39:08.300\n Which updates every 10 minutes or so with some variance.\n\n39:08.300 --> 39:12.700\n And then the miners aren't the sole entities that control the\n\n39:12.700 --> 39:17.000\n system. To really participate, if you are a merchant and you're\n\n39:17.000 --> 39:20.700\n accepting Bitcoin, you really want to run your own full node and\n\n39:20.700 --> 39:22.500\n check the whole history of transactions.\n\n39:22.500 --> 39:26.100\n Sort of something like, I want to say, five to six hundred million\n\n39:26.100 --> 39:28.100\n transactions that have ever occurred on Bitcoin.\n\n39:28.100 --> 39:33.100\n So full node contains all the transactions ever transacted on\n\n39:33.100 --> 39:34.800\n the Bitcoin blockchain.\n\n39:34.800 --> 39:39.300\n And that's, I saw it's like 200 gigs or something like that.\n\n39:39.300 --> 39:41.400\n Like 350, something like that.\n\n39:41.400 --> 39:45.600\n It's doable on a regular consumer laptop and that is going to be\n\n39:45.600 --> 39:47.700\n really key later on in the discussion.\n\n39:47.700 --> 39:53.000\n But so, you know, that's really the ultimate trust models.\n\n39:53.000 --> 39:55.700\n First of all, we trust that the miners that assemble transactions\n\n39:55.700 --> 39:59.900\n into blocks and they are the archivists, you know, they inscribe\n\n39:59.900 --> 40:03.700\n those transactions onto the ledger and they have an economic\n\n40:03.700 --> 40:06.100\n incentive to sort of behave correctly because they're getting\n\n40:06.100 --> 40:07.700\n paid in no units of Bitcoin.\n\n40:07.700 --> 40:09.600\n That's part of it.\n\n40:09.600 --> 40:13.900\n But then really you are also, you're not fully trusting them.\n\n40:13.900 --> 40:16.500\n You're actually, if you want to run a node, you replay every\n\n40:16.500 --> 40:19.900\n single transaction in the history of Bitcoin from the beginning\n\n40:19.900 --> 40:23.300\n to the current day and you arrive at the present state that way.\n\n40:23.300 --> 40:27.400\n So you don't really have to trust too many people or entities.\n\n40:27.400 --> 40:31.800\n You can validate the correctness that all the rules have been\n\n40:31.800 --> 40:34.800\n followed, that all the Bitcoins that were created were done so in\n\n40:34.800 --> 40:39.900\n the valid way, that the inflation rate was adhered to and that\n\n40:39.900 --> 40:44.000\n there's no covert inflation, you know, that if you're spending\n\n40:44.000 --> 40:49.000\n 50 units of Bitcoin, you had that Bitcoin to spend in the first\n\n40:49.000 --> 40:54.100\n place. So it's sort of delicately poised between node operators\n\n40:54.100 --> 40:58.500\n who, you know, engage in this validity checking kind of anti\n\n40:58.500 --> 41:01.700\n counterfeiting checking and then also the miners which are an\n\n41:01.700 --> 41:06.400\n industrial entity and they basically produce block space and\n\n41:06.400 --> 41:08.500\n assemble transactions in a box.\n\n41:08.500 --> 41:12.900\n And everybody, so the miners are incentivized to not mess with\n\n41:12.900 --> 41:15.300\n the system because they're getting value from the system.\n\n41:15.300 --> 41:20.200\n So if they mess with it, it's going to decrease the value of\n\n41:20.200 --> 41:23.100\n their physical work investment.\n\n41:23.100 --> 41:27.500\n Yeah, so they have to incur a real physical cost to produce a\n\n41:27.500 --> 41:28.100\n block, right?\n\n41:28.100 --> 41:34.200\n So right now you get 6.25 Bitcoins in a block at a minimum\n\n41:34.200 --> 41:35.900\n and then maybe some fees as well.\n\n41:35.900 --> 41:38.400\n How hard is it to produce a block now?\n\n41:38.400 --> 41:39.600\n Well, challenging.\n\n41:39.600 --> 41:44.800\n I mean, you need, so 6.25 Bitcoins and a Bitcoin is worth\n\n41:44.800 --> 41:46.400\n $55,000 or so.\n\n41:46.400 --> 41:50.700\n So it's probably going to cost you about that amount to produce\n\n41:50.700 --> 41:54.400\n it because it's a free market competition and miners have\n\n41:54.400 --> 41:56.100\n very thin margins.\n\n41:56.100 --> 42:00.500\n So it's like if I auction off a dollar, you would pay up to\n\n42:00.500 --> 42:02.700\n $0.99 to buy that dollar from me.\n\n42:02.700 --> 42:05.000\n Exactly what happens with miners.\n\n42:05.000 --> 42:10.700\n They're, you know, basically competing for the right to obtain\n\n42:10.700 --> 42:11.600\n new units of money.\n\n42:11.600 --> 42:15.200\n So logically speaking, they would pay up to the value of that\n\n42:15.200 --> 42:16.500\n money in order to earn it.\n\n42:16.500 --> 42:21.300\n And for people who are not familiar, the process of mining is solving\n\n42:21.300 --> 42:25.000\n a difficult cryptographic problem that's a computational problem.\n\n42:25.000 --> 42:28.600\n I would say it's not like people sometimes represent it as like\n\n42:28.600 --> 42:30.000\n a really challenging puzzle.\n\n42:30.000 --> 42:32.600\n Like the individual puzzle is very simple.\n\n42:32.600 --> 42:35.400\n Like you can do it with pen and paper if you wanted, you know,\n\n42:35.400 --> 42:36.600\n like SHA256.\n\n42:36.600 --> 42:40.100\n It's just that you're searching through the big mathematical\n\n42:40.100 --> 42:42.300\n space to find the needle in the haystack.\n\n42:42.300 --> 42:45.900\n You're just doing lots of iterations of a simple puzzle.\n\n42:45.900 --> 42:47.100\n It's just brute force.\n\n42:47.100 --> 42:50.700\n Hence, like the stability of the whole idea of the proof of work.\n\n42:50.700 --> 42:55.100\n If there was a shortcut, it wouldn't work.\n\n42:55.100 --> 42:56.100\n Exactly.\n\n42:56.100 --> 42:59.700\n So let's hope nobody solves SHA256.\n\n42:59.700 --> 43:03.300\n Yeah, there's a lot of discussions from the quantum computing\n\n43:03.300 --> 43:08.400\n space, but everybody I talked to, all my colleagues that work in\n\n43:08.400 --> 43:13.800\n quantum computers say that we're quite a long way away from that\n\n43:13.800 --> 43:18.700\n being an issue in cryptography and certainly an issue in cryptocurrency.\n\n43:18.700 --> 43:22.200\n That should have been one of the sides on these dice.\n\n43:22.200 --> 43:25.100\n It should have been quantum because I don't think it is.\n\n43:25.100 --> 43:26.600\n I forgot to put it on this edition.\n\n43:26.600 --> 43:28.900\n People should check out Scott Aaronson.\n\n43:28.900 --> 43:36.000\n There's a lot of people that are kind of selling quantum snake\n\n43:36.000 --> 43:38.700\n oil, so you should be very careful.\n\n43:38.700 --> 43:43.100\n I think it is a really exciting space that might change the\n\n43:43.100 --> 43:49.000\n world in the next decade or hundred, couple hundred years, especially\n\n43:49.000 --> 43:53.400\n for simulating quantum mechanical systems, but in quantum machine\n\n43:53.400 --> 43:56.300\n learning, people should check out TensorFlow quantum.\n\n43:56.300 --> 43:59.900\n It's a nice way to sort of educate yourself about the space.\n\n43:59.900 --> 44:05.100\n And actually, if you're pragmatically minded to, you know, through\n\n44:05.100 --> 44:09.200\n software engineering, explore how you simulate quantum circuits, how\n\n44:09.200 --> 44:11.000\n you run machine learning on those quantum circuits.\n\n44:11.000 --> 44:15.600\n The main point that Scott makes, Scott Aaronson, people should check\n\n44:15.600 --> 44:21.100\n out his blog too, is that like, there's not yet a single machine\n\n44:21.100 --> 44:25.800\n learning application that doesn't do almost as well in a classical\n\n44:25.800 --> 44:31.100\n computer. So it doesn't like, yes, the dream is somehow quantum\n\n44:31.100 --> 44:35.600\n computers will change the nature of artificial intelligence, but\n\n44:35.600 --> 44:42.900\n there's yet to be an actual algorithm or problem set or data set\n\n44:42.900 --> 44:44.400\n where that would be the case.\n\n44:44.400 --> 44:47.600\n So skepticism is good in this space.\n\n44:47.600 --> 44:53.100\n Anyway, that said, so you kind of explained how Bitcoin works.\n\n44:53.100 --> 44:58.400\n You also wrote a blog post recently, giving a shout out to the\n\n44:58.400 --> 45:00.500\n new book, The Block Size Wars.\n\n45:00.500 --> 45:03.500\n What is a block size?\n\n45:03.500 --> 45:05.800\n What are the block size wars?\n\n45:05.800 --> 45:10.900\n It's history, it's importance, it's philosophical foundations.\n\n45:10.900 --> 45:15.300\n Yeah, I mean, Bitcoin, at this point, we have our own civil wars,\n\n45:15.300 --> 45:19.000\n if you're wondering about how politically intense it gets.\n\n45:19.000 --> 45:21.200\n It's currently not hot, it's cold.\n\n45:21.200 --> 45:23.400\n Oh yeah, we're in a detente right now.\n\n45:23.400 --> 45:28.600\n There's no tanks or missiles, at least not yet, hopefully.\n\n45:28.600 --> 45:31.000\n It can get a little violent, I guess.\n\n45:31.000 --> 45:35.000\n I think one of the Bitcoin core developers or one of the participants\n\n45:35.000 --> 45:37.500\n in the war got swatted at one point.\n\n45:37.500 --> 45:39.000\n What swatted means?\n\n45:39.000 --> 45:43.000\n When someone does a fake phone call saying that you're holding\n\n45:43.000 --> 45:46.000\n someone hostage at your house and the SWAT team goes,\n\n45:46.000 --> 45:48.000\n it's pretty scary.\n\n45:48.000 --> 45:51.000\n Internet warfare tactic, yeah.\n\n45:51.000 --> 45:56.000\n But the block size war, I would say, effectively ended, although\n\n45:56.000 --> 46:00.000\n we're definitely going to have more civil wars in Bitcoin, for sure.\n\n46:00.000 --> 46:05.500\n But basically, the core argument was a technical one on its surface,\n\n46:05.500 --> 46:09.000\n but a very deep political one at its core.\n\n46:09.000 --> 46:13.000\n The technical question is, how many megabytes should be\n\n46:13.000 --> 46:15.000\n in each successive block?\n\n46:15.000 --> 46:20.000\n So, Satoshi basically installed a limit of one megabyte per block.\n\n46:20.000 --> 46:22.000\n So, we should backtrack.\n\n46:22.000 --> 46:26.500\n There was no limit in the beginning, and it seems like Satoshi,\n\n46:26.500 --> 46:32.000\n what is this, 2000, the war started in what, 2017 or something like that?\n\n46:32.000 --> 46:33.000\n I don't know.\n\n46:33.000 --> 46:38.000\n 2015 was when the battle cries began.\n\n46:38.000 --> 46:40.000\n What was the first battle in the Civil War?\n\n46:40.000 --> 46:41.000\n I don't remember.\n\n46:41.000 --> 46:45.000\n But, Satoshi, I don't know if you can comment on it.\n\n46:45.000 --> 46:49.000\n Why did Satoshi set the limit to one megabyte all of a sudden,\n\n46:49.000 --> 46:55.000\n almost secretively, and in the beginning, there was no limit whatsoever?\n\n46:55.000 --> 46:58.000\n Yeah, I mean, we can get into, and people have spent thousands of hours\n\n46:58.000 --> 47:03.000\n poring over Satoshi's writings to find which side Satoshi was on,\n\n47:03.000 --> 47:08.000\n and you can find, like any textual exegesis, you can find evidence\n\n47:08.000 --> 47:10.000\n for either side, right?\n\n47:10.000 --> 47:13.000\n But, yeah, I mean, effectively, when Bitcoin was launched,\n\n47:13.000 --> 47:17.000\n there was a block size, because if you made a block over a certain size\n\n47:17.000 --> 47:22.000\n with the first edition of the code, it would have crashed nodes.\n\n47:22.000 --> 47:25.000\n But then, yeah, in 2010, Satoshi added the one megabyte limit\n\n47:25.000 --> 47:31.000\n in a covert way with no comments or anything, and that stuck, basically.\n\n47:31.000 --> 47:37.000\n And then Bitcoin blocks filled up, and people that had been socialized\n\n47:37.000 --> 47:41.000\n into this vision of Bitcoin as an effectively free transactional network\n\n47:41.000 --> 47:45.000\n were like, why pay a transaction fee if you're not at congestion?\n\n47:45.000 --> 47:50.000\n If the block isn't full, the miner will mine your transaction for free, right?\n\n47:50.000 --> 47:56.000\n And people that had been brought up in that status quo from 2009\n\n47:56.000 --> 48:00.000\n to kind of 2015, they noticed the block started to fill up,\n\n48:00.000 --> 48:03.000\n and they're like, okay, well, let's just remove this arbitrary limit, right?\n\n48:03.000 --> 48:05.000\n What could possibly be the harm?\n\n48:05.000 --> 48:11.000\n And then a whole other faction said, no, you need to cap the data\n\n48:11.000 --> 48:15.000\n throughput of the system, because if you increase it,\n\n48:15.000 --> 48:19.000\n it's going to be highly exclusionary, and ultimately, regular folks\n\n48:19.000 --> 48:21.000\n are not going to be able to run a full node.\n\n48:21.000 --> 48:26.000\n So there's a fixed number, there's a fixed frequency of blocks,\n\n48:26.000 --> 48:30.000\n and so if you want to increase the number of transactions per second,\n\n48:30.000 --> 48:32.000\n you want to increase the size of the block.\n\n48:32.000 --> 48:36.000\n So huge blocks allow you to shove in a lot of transactions.\n\n48:36.000 --> 48:40.000\n Small blocks don't, so that's what you mean like constraining the system.\n\n48:40.000 --> 48:46.000\n So what's the benefit of a small block size where transactions,\n\n48:46.000 --> 48:50.000\n you can squeeze in only a small number of transactions,\n\n48:50.000 --> 48:53.000\n and what's the benefit of a huge block size where you can squeeze in\n\n48:53.000 --> 48:55.000\n a lot of transactions?\n\n48:55.000 --> 48:58.000\n Well, it really comes down to the way that you think about the system.\n\n48:58.000 --> 49:02.000\n So a lot of people wanted Bitcoin to be Visa scale,\n\n49:02.000 --> 49:06.000\n so to have blocks sufficiently large that you could accommodate\n\n49:06.000 --> 49:10.000\n a Visa level scale of transactions.\n\n49:10.000 --> 49:13.000\n Which is many orders of magnitude more transactions.\n\n49:13.000 --> 49:17.000\n That's right, I mean, preposterously larger in terms of data throughput.\n\n49:17.000 --> 49:21.000\n Then, you know, Bitcoin offers up, or at least it used to,\n\n49:21.000 --> 49:26.000\n 144 megabytes of space per day, and your average transaction is 350 bytes.\n\n49:26.000 --> 49:31.000\n So, you know, you could, at a push, do four or five hundred thousand\n\n49:31.000 --> 49:34.000\n transactions a day, which is not many.\n\n49:34.000 --> 49:38.000\n So if you wanted to get to Visa scale, you'd have to increase blocks\n\n49:38.000 --> 49:41.000\n obnoxiously large.\n\n49:41.000 --> 49:45.000\n The small blockers claimed that this would overwhelm the ability\n\n49:45.000 --> 49:49.000\n of any regular person to ingest that data and stay current\n\n49:49.000 --> 49:54.000\n at the state of the ledger, to replay all those transactions\n\n49:54.000 --> 49:57.000\n to ensure that the protocol rules were valid.\n\n49:57.000 --> 50:01.000\n So basically, the small blocker contention is that you eliminate\n\n50:01.000 --> 50:05.000\n the trustlessness of the system by pushing a ton of data\n\n50:05.000 --> 50:09.000\n through the system, because only one or two industrial heavy duty\n\n50:09.000 --> 50:14.000\n nodes would ever be able to run the protocol at that point.\n\n50:14.000 --> 50:18.000\n So, by the way, in the Civil War, the two sides, as you're calling them,\n\n50:18.000 --> 50:23.000\n the small blocker and the big blocker sides.\n\n50:23.000 --> 50:27.000\n And so that takes us back to the thing that you mentioned,\n\n50:27.000 --> 50:30.000\n that a regular computer could be a node.\n\n50:30.000 --> 50:36.000\n And with big blocks, that's no longer going to be the case.\n\n50:36.000 --> 50:41.000\n So just the number of transactions is going to blow up the size\n\n50:41.000 --> 50:45.000\n of the blockchain that every full node has to store.\n\n50:45.000 --> 50:50.000\n And so then, as opposed to a regular mom and pop type of node,\n\n50:50.000 --> 50:53.000\n you're going to have to have data centers.\n\n50:53.000 --> 50:56.000\n So they're going to have to be owned by large organizations.\n\n50:56.000 --> 50:58.000\n There's going to have to be very few of them.\n\n50:58.000 --> 51:03.000\n And that's how you centralize the control over this whole operation.\n\n51:03.000 --> 51:08.000\n So the big blocker, yes, it allows you to be Visa\n\n51:08.000 --> 51:12.000\n and do a huge number of transactions, but it becomes centralized.\n\n51:12.000 --> 51:16.000\n And then the small blocker is, you cannot actually do kind of\n\n51:16.000 --> 51:21.000\n merchant style transactions, but you get the decentralized benefit.\n\n51:21.000 --> 51:24.000\n Well, I don't even think the big blocker approach would allow you\n\n51:24.000 --> 51:28.000\n to be Visa, frankly, because there's effectively one node\n\n51:28.000 --> 51:30.000\n in the Visa network, right?\n\n51:30.000 --> 51:34.000\n So you don't really need to maintain this peer to peer architecture at all.\n\n51:34.000 --> 51:38.000\n And the amount of data you'd have to push through the network\n\n51:38.000 --> 51:41.000\n to reach Visa scale is a really preposterous amount.\n\n51:41.000 --> 51:46.000\n And we have now evidence for what happens when you try and scale up\n\n51:46.000 --> 51:49.000\n as a blockchain and do 10 million transactions a day,\n\n51:49.000 --> 51:51.000\n which is still not Visa scale, right?\n\n51:51.000 --> 51:58.000\n I've seen what it's like to operate those nodes, and it's not pretty.\n\n51:58.000 --> 52:04.000\n So there are totally genuine computer science physical limits,\n\n52:04.000 --> 52:07.000\n because it's a broadcast network.\n\n52:07.000 --> 52:10.000\n Everyone has to be aware of every transaction.\n\n52:10.000 --> 52:15.000\n And that model, which gives you the trustlessness, the nice guarantees\n\n52:15.000 --> 52:18.000\n where everyone's an equal peer on the network, everyone has audited\n\n52:18.000 --> 52:23.000\n the full history of the transactions, that model falls apart under stress.\n\n52:23.000 --> 52:29.000\n So the small blocker vision is that ultimately you would scale\n\n52:29.000 --> 52:32.000\n in a layered approach, with the base layer transactions\n\n52:32.000 --> 52:36.000\n being settlement style transactions, and payments happening\n\n52:36.000 --> 52:38.000\n at the other layers, basically.\n\n52:38.000 --> 52:43.000\n Is that universally agreed upon, or to a large degree agreed upon\n\n52:43.000 --> 52:47.000\n that the small blockers have won in this debate?\n\n52:47.000 --> 52:51.000\n Where would you put the current state of affairs?\n\n52:51.000 --> 52:54.000\n There was a wave of competing Bitcoin implementations,\n\n52:54.000 --> 52:57.000\n starting in 2015 with Bitcoin XT.\n\n52:57.000 --> 53:02.000\n Actually Gavin Andresen, who was the guy that Satoshi handed the reins to\n\n53:02.000 --> 53:07.000\n when Satoshi left, Gavin supported this large block proposal.\n\n53:07.000 --> 53:13.000\n And so that didn't achieve consensus, and then there was Bitcoin Unlimited.\n\n53:13.000 --> 53:18.000\n And then later on, there was a genuine hard fork,\n\n53:18.000 --> 53:23.000\n where the large blockers couldn't push through their proposals\n\n53:23.000 --> 53:27.000\n on Bitcoin itself, so they just created a competing version of Bitcoin.\n\n53:27.000 --> 53:30.000\n So by the way, maybe you can comment on, but sort of hard fork\n\n53:30.000 --> 53:35.000\n versus a soft fork, a hard fork is when it's no longer compatible.\n\n53:35.000 --> 53:37.000\n What's the right way to put it?\n\n53:37.000 --> 53:41.000\n They can't operate on the same blockchain, with the same protocol.\n\n53:41.000 --> 53:47.000\n Yeah, so there's a few ways to define them, and it gets controversial as well.\n\n53:47.000 --> 53:54.000\n One way to define it as a hard fork is an expansion of protocol rules,\n\n53:54.000 --> 53:57.000\n and a soft fork is a shrinking of protocol rules.\n\n53:57.000 --> 53:59.000\n That's an interesting way to find it.\n\n53:59.000 --> 54:02.000\n It's not very intuitive, so I don't like that way.\n\n54:02.000 --> 54:06.000\n Another way is that a hard fork is backwards incompatible,\n\n54:06.000 --> 54:09.000\n whereas a soft fork is, in theory, backwards compatible.\n\n54:09.000 --> 54:15.000\n So in August 2017, basically the large blockers had had enough,\n\n54:15.000 --> 54:18.000\n and they said, we're going to hard fork Bitcoin,\n\n54:18.000 --> 54:22.000\n we're going to create a clone, an alternative version of Bitcoin,\n\n54:22.000 --> 54:27.000\n which has a shared history as Bitcoin itself,\n\n54:27.000 --> 54:31.000\n but you completely fork it and you create a new future.\n\n54:31.000 --> 54:35.000\n But everybody that had a balance on Bitcoin at the time\n\n54:35.000 --> 54:39.000\n also had a balance on the alternative coin, Bitcoin Cash.\n\n54:39.000 --> 54:43.000\n That's what it's called, Bitcoin Cash is the hard fork.\n\n54:43.000 --> 54:45.000\n That was one of them, there were more actually.\n\n54:45.000 --> 54:50.000\n What the heck is Bitcoin Satoshi's vision BSV, Bitcoin SV?\n\n54:50.000 --> 54:53.000\n So this is all talking about increasing the max,\n\n54:53.000 --> 54:56.000\n the limit of the block size more and more and more.\n\n54:56.000 --> 54:59.000\n Yeah, that was one of the changes they wanted to push through.\n\n54:59.000 --> 55:02.000\n But BSV was a fork of Bitcoin Cash.\n\n55:02.000 --> 55:04.000\n Hard fork of Bitcoin Cash.\n\n55:04.000 --> 55:09.000\n Yeah, so now there's multiple big blocker blockchains floating around.\n\n55:09.000 --> 55:11.000\n What are your thoughts about them?\n\n55:11.000 --> 55:14.000\n These are pretty popular, sorry to interrupt.\n\n55:14.000 --> 55:15.000\n Are they popular?\n\n55:15.000 --> 55:17.000\n I mean, if you look at the metrics, they're not.\n\n55:17.000 --> 55:19.000\n And they don't trade,\n\n55:19.000 --> 55:23.000\n I think each trade below 1% of the value of Bitcoin itself.\n\n55:23.000 --> 55:26.000\n I see, so measuring popularity is like how much they actually,\n\n55:26.000 --> 55:29.000\n oh, value of the frequency of trade.\n\n55:29.000 --> 55:32.000\n Oh, no, no, I mean, they do like a fair number of transactions,\n\n55:32.000 --> 55:37.000\n but there's no way to know that that is genuine or just contrived.\n\n55:37.000 --> 55:42.000\n So ultimately, the true measure I think in my mind is just where the market\n\n55:42.000 --> 55:46.000\n prices these protocols relative to Bitcoin,\n\n55:46.000 --> 55:48.000\n because that's like a prediction market.\n\n55:48.000 --> 55:52.000\n If Bitcoin Cash was being priced at 50% of Bitcoin,\n\n55:52.000 --> 55:58.000\n you could say the market has given it a 50% chance of unseating Bitcoin, right?\n\n55:58.000 --> 56:01.000\n But both Bitcoin Cash and Bitcoin SV,\n\n56:01.000 --> 56:04.000\n which was a hard fork from Bitcoin Cash itself,\n\n56:04.000 --> 56:08.000\n are well, I believe at this point, well below 1% of the value of Bitcoin.\n\n56:08.000 --> 56:12.000\n And in like the ranking of different cryptocurrencies,\n\n56:12.000 --> 56:14.000\n what is it, Bitcoin, Ethereum?\n\n56:14.000 --> 56:17.000\n Is Ethereum in value second?\n\n56:17.000 --> 56:18.000\n Yes, number two.\n\n56:18.000 --> 56:21.000\n And then Bitcoin Cash is in the top five, right?\n\n56:21.000 --> 56:23.000\n But it's just a fast drop off?\n\n56:23.000 --> 56:27.000\n You know, I haven't checked lately, but I think it's reached kind of morbidity.\n\n56:27.000 --> 56:30.000\n You know, it doesn't really have much traction.\n\n56:30.000 --> 56:32.000\n The blocks aren't full.\n\n56:32.000 --> 56:34.000\n So the whole value proposition was, you know,\n\n56:34.000 --> 56:38.000\n we will get all this merchant adoption if we increase the block size.\n\n56:38.000 --> 56:40.000\n That just didn't materialize.\n\n56:40.000 --> 56:44.000\n In my view, they had a flawed vision of how adoption works\n\n56:44.000 --> 56:48.000\n and what blockchain should optimize for.\n\n56:48.000 --> 56:51.000\n Maybe you get a Bitcoin Cash supporter on the show,\n\n56:51.000 --> 56:53.000\n they'll give you a different answer.\n\n56:53.000 --> 56:55.000\n But yeah, full disclosure, you know, I have my sympathies.\n\n56:55.000 --> 56:59.000\n And I think the small blockers won that skirmish for sure.\n\n56:59.000 --> 57:02.000\n So at this time, there's no merchant adoption and so on.\n\n57:02.000 --> 57:06.000\n So it's kind of its vision, the whole reason for existence,\n\n57:06.000 --> 57:08.000\n at least for now, hasn't materialized.\n\n57:08.000 --> 57:13.000\n And so that's an indication as possible that, well,\n\n57:13.000 --> 57:18.000\n it's a sign that perhaps that's the wrong way to accomplish the scalability.\n\n57:18.000 --> 57:20.000\n Well, you know, first of all,\n\n57:20.000 --> 57:24.000\n I think the layered scaling model is definitely, definitely correct.\n\n57:24.000 --> 57:27.000\n I mean, that's absolutely the way these things have to work,\n\n57:27.000 --> 57:29.000\n given the constraints of blockchains.\n\n57:29.000 --> 57:32.000\n What is the layered scaling model?\n\n57:32.000 --> 57:36.000\n It's really how all payment systems scale, blockchain or otherwise.\n\n57:36.000 --> 57:38.000\n And I think a lot of people don't understand this,\n\n57:38.000 --> 57:43.000\n is that there is no equivalent to scaling of the base layer\n\n57:43.000 --> 57:45.000\n in the regular payment space.\n\n57:45.000 --> 57:47.000\n That totally doesn't happen.\n\n57:47.000 --> 57:48.000\n All of them are built on layers.\n\n57:48.000 --> 57:52.000\n So Visa is like the fifth layer in the payment stack\n\n57:52.000 --> 57:55.000\n that ultimately depends on these utility scale settlement systems,\n\n57:55.000 --> 58:01.000\n like Fedwire, CHIPS, ACH, basically interbank settlement systems.\n\n58:01.000 --> 58:07.000\n So you've got these slow moving but high assurance settlement systems.\n\n58:07.000 --> 58:11.000\n Fedwire is probably the number one, you know, like when you send a wire,\n\n58:11.000 --> 58:13.000\n that's using the Fedwire system typically.\n\n58:13.000 --> 58:18.000\n On top of that, you know, you have banks and then you have payment processors,\n\n58:18.000 --> 58:21.000\n and then you build up these layers and layers and layers,\n\n58:21.000 --> 58:24.000\n and then you have these fast payments, you know, Venmo PayPal,\n\n58:24.000 --> 58:27.000\n credit, debit, Visa, you name it.\n\n58:27.000 --> 58:30.000\n Those payments are not final when they occur.\n\n58:30.000 --> 58:36.000\n You know, a credit card transaction will not be final for 90 to 120 days.\n\n58:36.000 --> 58:42.000\n So you've decoupled the payment, the financial message, and the settlement.\n\n58:42.000 --> 58:43.000\n Those are distinct concepts.\n\n58:43.000 --> 58:46.000\n And the settlement happens on a deferred basis.\n\n58:46.000 --> 58:51.000\n So that's how you get scalability, is you have lots and lots of messages,\n\n58:51.000 --> 58:54.000\n but they don't settle for a long time.\n\n58:54.000 --> 58:58.000\n They might settle on a net basis, on an end of day basis.\n\n58:58.000 --> 59:00.000\n But so that's really how it works.\n\n59:00.000 --> 59:04.000\n And then you have Fedwire where your average transaction is in the millions of dollars,\n\n59:04.000 --> 59:07.000\n and there's only a few hundred thousand transactions a day.\n\n59:07.000 --> 59:09.000\n It's sort of an interbank settlement network.\n\n59:09.000 --> 59:15.000\n So that's my vision for how I think Bitcoin will develop too.\n\n59:15.000 --> 59:20.000\n Bitcoin itself on the base layer is the slow moving high assurance final settlement network,\n\n59:20.000 --> 59:25.000\n where if you're sending money to the other side of the globe to someone you don't trust,\n\n59:25.000 --> 59:29.000\n where you want that payment to be final in a short period of time,\n\n59:29.000 --> 59:33.000\n and both counterparties know it's final, then you would use that.\n\n59:33.000 --> 59:37.000\n But if you wanted to buy coffee, you could do it on a second layer.\n\n59:37.000 --> 59:39.000\n Lightning would be one way.\n\n59:39.000 --> 59:41.000\n There's a bunch of side chains now.\n\n59:41.000 --> 59:46.000\n Or you could use a more centralized solution if you wanted.\n\n59:46.000 --> 59:50.000\n It's kind of a profound idea that in the space of transactions,\n\n59:50.000 --> 59:53.000\n when you're buying coffee or buying anything really from a merchant\n\n59:53.000 --> 59:57.000\n or exchanging goods and all those kinds of things,\n\n59:57.000 --> 1:00:04.000\n that most of the time, like basic honest behavior, human behavior,\n\n1:00:04.000 --> 1:00:09.000\n which it does appear that most of our societies is based on the fact that we're all,\n\n1:00:09.000 --> 1:00:15.000\n most of us are honest, is like stuff is not going to go wrong when you do the transaction.\n\n1:00:15.000 --> 1:00:19.000\n And you only need like the base layer, whether it's Bitcoin,\n\n1:00:19.000 --> 1:00:24.000\n whether it's, I forget the terms you use for the credit card version,\n\n1:00:24.000 --> 1:00:33.000\n but you need that just to verify, just to like resolve any disagreements or shady shit.\n\n1:00:33.000 --> 1:00:34.000\n Yeah.\n\n1:00:34.000 --> 1:00:37.000\n And that's a really rare occurrence.\n\n1:00:37.000 --> 1:00:43.000\n So it's okay for that to be handled in a small block debate,\n\n1:00:43.000 --> 1:00:48.000\n handled at a rate that's much, much lower than the rate of the transactions.\n\n1:00:48.000 --> 1:00:52.000\n That's a really interesting idea that when we spend money,\n\n1:00:52.000 --> 1:00:57.000\n we didn't actually exchange the money most of the time.\n\n1:00:57.000 --> 1:01:01.000\n Yeah, most of the time you're not getting final settlement when you do a transaction.\n\n1:01:01.000 --> 1:01:08.000\n And oftentimes that causes, there's pluses and minuses on the plus side of huge efficiency\n\n1:01:08.000 --> 1:01:12.000\n if you use a credit network like Visa, but it's in the name credit, right?\n\n1:01:12.000 --> 1:01:15.000\n Visa is extending you credit, right?\n\n1:01:15.000 --> 1:01:18.000\n They're kind of guaranteeing your reputation to the merchant.\n\n1:01:18.000 --> 1:01:20.000\n But fraud happens all the time, right?\n\n1:01:20.000 --> 1:01:25.000\n There's always fraud because you have this reversibility, right?\n\n1:01:25.000 --> 1:01:30.000\n And so you can engage in fraud against the merchant.\n\n1:01:30.000 --> 1:01:34.000\n If you have a final settlement, there's no possibility for fraud.\n\n1:01:34.000 --> 1:01:37.000\n So that's one reason merchants kind of like accepting Bitcoin\n\n1:01:37.000 --> 1:01:44.000\n because once you receive an inbound Bitcoin payment and you deliver some good or service,\n\n1:01:44.000 --> 1:01:46.000\n that payment can't be reversed.\n\n1:01:46.000 --> 1:01:52.000\n But frankly, most of the transactions we undertake on a daily basis\n\n1:01:52.000 --> 1:01:56.000\n do not require the strong assurances of final settlement.\n\n1:01:56.000 --> 1:01:58.000\n There's one exception, which is physical cash.\n\n1:01:58.000 --> 1:02:02.000\n With physical cash or the open dime, a cash like product,\n\n1:02:02.000 --> 1:02:05.000\n you actually are getting final settlement.\n\n1:02:05.000 --> 1:02:14.000\n But most online banking transactions, most P2P digital wallet transactions\n\n1:02:14.000 --> 1:02:18.000\n in the dollar system, they're not really final at all.\n\n1:02:18.000 --> 1:02:21.000\n You mentioned Lightning, Lightning Network.\n\n1:02:21.000 --> 1:02:24.000\n What is it? What are your thoughts on it?\n\n1:02:24.000 --> 1:02:27.000\n And what are your thoughts about any kind of alternatives?\n\n1:02:27.000 --> 1:02:34.000\n So Lightning is one potential payment solution built on top of Bitcoin\n\n1:02:34.000 --> 1:02:38.000\n where you have different assurances, different transactional assurances,\n\n1:02:38.000 --> 1:02:41.000\n but ultimately it's very proximate to the base layer.\n\n1:02:41.000 --> 1:02:44.000\n So if something goes wrong, you can always basically settle to the base layer.\n\n1:02:44.000 --> 1:02:45.000\n Just layer two.\n\n1:02:45.000 --> 1:02:48.000\n Yeah, layer two, you could say.\n\n1:02:48.000 --> 1:02:52.000\n And basically the intuition is it's kind of like opening a bar tab.\n\n1:02:52.000 --> 1:02:57.000\n So you go to the bar and you might drink a dozen beers over the course of the night,\n\n1:02:57.000 --> 1:03:00.000\n maybe half a dozen.\n\n1:03:00.000 --> 1:03:02.000\n And well, I guess nobody goes to the bar these days,\n\n1:03:02.000 --> 1:03:05.000\n but let's say you did.\n\n1:03:05.000 --> 1:03:09.000\n You open a tab and at the end of the night you settle up once.\n\n1:03:09.000 --> 1:03:14.000\n You're not necessarily paying each time you get another beer.\n\n1:03:14.000 --> 1:03:15.000\n So it's the same idea.\n\n1:03:15.000 --> 1:03:19.000\n You're opening a channel, an ongoing relationship with your counterparty.\n\n1:03:19.000 --> 1:03:22.000\n And so Lightning has you open a channel with the counterparty\n\n1:03:22.000 --> 1:03:26.000\n and you're sort of sending back and forth these cryptographic commitments saying,\n\n1:03:26.000 --> 1:03:29.000\n you know, I agree to send you some Bitcoin,\n\n1:03:29.000 --> 1:03:31.000\n but you don't necessarily settle each time you make a transaction.\n\n1:03:31.000 --> 1:03:35.000\n So you can do hundreds of thousands of transactions in a channel.\n\n1:03:35.000 --> 1:03:38.000\n The other thing Lightning proposes is saying, okay, well,\n\n1:03:38.000 --> 1:03:41.000\n now that we have channels established,\n\n1:03:41.000 --> 1:03:44.000\n what if we interlocked a number of channels together?\n\n1:03:44.000 --> 1:03:48.000\n So if you and I have a channel and, you know, me and my buddy have a channel,\n\n1:03:48.000 --> 1:03:53.000\n my buddy can now pay you because you have a relationship through me basically.\n\n1:03:53.000 --> 1:03:58.000\n And so Lightning is this network, this overlay network that sits on top of Bitcoin\n\n1:03:58.000 --> 1:04:03.000\n and allows people to transact in a much faster and less frictional way\n\n1:04:03.000 --> 1:04:08.000\n without the need for Bitcoin's kind of slow periodic settlement,\n\n1:04:08.000 --> 1:04:12.000\n assuming that everything sort of goes well.\n\n1:04:12.000 --> 1:04:14.000\n Do you see any downsides to this?\n\n1:04:14.000 --> 1:04:17.000\n Like, have you seen flaws in the whole system from a security perspective,\n\n1:04:17.000 --> 1:04:20.000\n from a scaling perspective, any of that?\n\n1:04:20.000 --> 1:04:23.000\n Or is Lightning working well?\n\n1:04:23.000 --> 1:04:24.000\n It works.\n\n1:04:24.000 --> 1:04:25.000\n I use it.\n\n1:04:25.000 --> 1:04:29.000\n When I initially sold those dice, I sold them on Lightning.\n\n1:04:29.000 --> 1:04:33.000\n I was one of the first merchants to use Lightning back in the day,\n\n1:04:33.000 --> 1:04:35.000\n the first edition of the dice.\n\n1:04:35.000 --> 1:04:37.000\n So people could buy these dice somewhere?\n\n1:04:37.000 --> 1:04:39.000\n Well, they used to be able to.\n\n1:04:39.000 --> 1:04:41.000\n I haven't made a new edition recently.\n\n1:04:41.000 --> 1:04:43.000\n They're very scarce and very special.\n\n1:04:43.000 --> 1:04:45.000\n They're like physical NFTs.\n\n1:04:45.000 --> 1:04:47.000\n Physical NFTs.\n\n1:04:47.000 --> 1:04:48.000\n Yeah.\n\n1:04:48.000 --> 1:04:51.000\n I mean, the flaw with Lightning is really that you, you know,\n\n1:04:51.000 --> 1:04:53.000\n and this can be remedied in a number of ways,\n\n1:04:53.000 --> 1:04:55.000\n but you have to kind of prefund these channels.\n\n1:04:55.000 --> 1:04:59.000\n So it's a weird concept to have to inject liquidity into a channel\n\n1:04:59.000 --> 1:05:02.000\n in order to accept a payment, you know.\n\n1:05:02.000 --> 1:05:06.000\n So I'm sure those user experience problems can be solved,\n\n1:05:06.000 --> 1:05:10.000\n but it's still in a state of relative immaturity.\n\n1:05:10.000 --> 1:05:12.000\n So we'll see.\n\n1:05:12.000 --> 1:05:18.000\n In terms of other ideas that are sidechains or soft forks of Bitcoin,\n\n1:05:18.000 --> 1:05:22.000\n you've mentioned something about Schnorr and Taproot.\n\n1:05:22.000 --> 1:05:25.000\n What are your thoughts about this update to Bitcoin\n\n1:05:25.000 --> 1:05:30.000\n in terms of its promise to improve privacy and scaling and so on?\n\n1:05:30.000 --> 1:05:33.000\n And what other things are you interested, excited about\n\n1:05:33.000 --> 1:05:36.000\n in terms of the development of Bitcoin?\n\n1:05:36.000 --> 1:05:38.000\n Well, Schnorr and Taproot,\n\n1:05:38.000 --> 1:05:43.000\n that's the first new protocol upgrade since SegWit in 2017,\n\n1:05:43.000 --> 1:05:49.000\n which was what laid the groundwork for Lightning to be developed, basically.\n\n1:05:49.000 --> 1:05:52.000\n Schnorr and Taproot is really the first protocol change\n\n1:05:52.000 --> 1:05:55.000\n in three, almost four years now.\n\n1:05:55.000 --> 1:06:00.000\n So we're very excited about it.\n\n1:06:00.000 --> 1:06:03.000\n I mean, is there something interesting to say technically\n\n1:06:03.000 --> 1:06:06.000\n about what are the things it's actually going to improve?\n\n1:06:06.000 --> 1:06:10.000\n And maybe on the politics side,\n\n1:06:10.000 --> 1:06:15.000\n bringing a protocol change on Bitcoin,\n\n1:06:15.000 --> 1:06:17.000\n what does that actually involve?\n\n1:06:17.000 --> 1:06:19.000\n Yeah, I mean, it's a huge deal because the last time\n\n1:06:19.000 --> 1:06:21.000\n we tried to make a change to the protocol,\n\n1:06:21.000 --> 1:06:23.000\n we had a whole civil war over it,\n\n1:06:23.000 --> 1:06:28.000\n and it was incredibly difficult to get SegWit activated in 2017.\n\n1:06:28.000 --> 1:06:31.000\n And it took all this brinksmanship and threats\n\n1:06:31.000 --> 1:06:35.000\n and all these campaigns, and it was this whole thing.\n\n1:06:35.000 --> 1:06:37.000\n Luckily, I think things have quieted down\n\n1:06:37.000 --> 1:06:39.000\n and there's much more consensus that Schnorr and Taproot\n\n1:06:39.000 --> 1:06:43.000\n is a good change to Bitcoin, and everyone generally supports it.\n\n1:06:43.000 --> 1:06:46.000\n But everyone kind of has PTSD over the last time.\n\n1:06:46.000 --> 1:06:48.000\n When we tried to change Bitcoin.\n\n1:06:48.000 --> 1:06:50.000\n And so we're sort of really dithering\n\n1:06:50.000 --> 1:06:52.000\n over how we actually want to implement it.\n\n1:06:52.000 --> 1:06:56.000\n So it's taking forever because we're trying to set the protocol\n\n1:06:56.000 --> 1:06:58.000\n for how do you change Bitcoin itself.\n\n1:06:58.000 --> 1:07:01.000\n And all of our assumptions went out the window last time.\n\n1:07:01.000 --> 1:07:05.000\n So we're trying to reset and decide what is a legitimate way\n\n1:07:05.000 --> 1:07:07.000\n to institute a change to Bitcoin.\n\n1:07:07.000 --> 1:07:09.000\n So that's actually the big question right now.\n\n1:07:09.000 --> 1:07:11.000\n It's not, should we implement these changes?\n\n1:07:11.000 --> 1:07:13.000\n We basically all agree that we should.\n\n1:07:13.000 --> 1:07:16.000\n It's a meta question is, what's the valid way\n\n1:07:16.000 --> 1:07:18.000\n to implement new changes to Bitcoin?\n\n1:07:18.000 --> 1:07:21.000\n What's a way that is scalable in the long term\n\n1:07:21.000 --> 1:07:24.000\n and will last and people will consider credible?\n\n1:07:24.000 --> 1:07:26.000\n Even if this one isn't controversial at all.\n\n1:07:26.000 --> 1:07:28.000\n So that's where we're at.\n\n1:07:28.000 --> 1:07:31.000\n We're basically debating over how do we implement this change\n\n1:07:31.000 --> 1:07:33.000\n that we all want.\n\n1:07:33.000 --> 1:07:36.000\n To get a feeling of how slow Bitcoin governance is\n\n1:07:36.000 --> 1:07:38.000\n and how deliberate it is,\n\n1:07:38.000 --> 1:07:40.000\n everybody collectively wants the change.\n\n1:07:40.000 --> 1:07:44.000\n But we haven't fully agreed on how we're going to put it into Bitcoin.\n\n1:07:44.000 --> 1:07:47.000\n So it's a classic sort of Bitcoin situation.\n\n1:07:47.000 --> 1:07:51.000\n But what it is, I mean, Schnorr is an alternative signature scheme.\n\n1:07:51.000 --> 1:07:53.000\n I think it was encumbered by a patent.\n\n1:07:53.000 --> 1:07:57.000\n And it had only just been unencumbered\n\n1:07:57.000 --> 1:07:59.000\n when Satoshi created Bitcoin, I believe.\n\n1:07:59.000 --> 1:08:02.000\n It's a better signature scheme than Elliptic Curves,\n\n1:08:02.000 --> 1:08:06.000\n which is what, than ECDSA, which is what Bitcoin uses.\n\n1:08:06.000 --> 1:08:11.000\n And so it's been long enough that we now trust it.\n\n1:08:11.000 --> 1:08:14.000\n Kind of in cryptography, it's meant to be Lindy.\n\n1:08:14.000 --> 1:08:17.000\n You want to test it over time,\n\n1:08:17.000 --> 1:08:19.000\n and then it's considered safe to use.\n\n1:08:19.000 --> 1:08:21.000\n So Schnorr has been around for long enough\n\n1:08:21.000 --> 1:08:25.000\n that we've decided to rip out ECDSA and insert Schnorr,\n\n1:08:25.000 --> 1:08:27.000\n which is just a different signature scheme,\n\n1:08:27.000 --> 1:08:29.000\n which is more efficient.\n\n1:08:29.000 --> 1:08:31.000\n And it has better properties.\n\n1:08:31.000 --> 1:08:33.000\n Like if you want to do a multi signature transaction\n\n1:08:33.000 --> 1:08:36.000\n where many people collectively sign\n\n1:08:36.000 --> 1:08:38.000\n in order to permission a spend,\n\n1:08:38.000 --> 1:08:42.000\n that would be more efficient in a bytes sense\n\n1:08:42.000 --> 1:08:44.000\n than ECDSA, for instance.\n\n1:08:44.000 --> 1:08:46.000\n So it's pretty incremental.\n\n1:08:46.000 --> 1:08:53.000\n And then Taproot is all about having transactional conditions\n\n1:08:53.000 --> 1:08:58.000\n that are sort of withheld from final entry onto the blockchain.\n\n1:08:58.000 --> 1:09:07.000\n So it's kind of a way to have more private conditional transactions on Bitcoin.\n\n1:09:07.000 --> 1:09:11.000\n So both of them, I would say, are incremental changes.\n\n1:09:11.000 --> 1:09:15.000\n Is this an over exaggeration that Schnorr and Taproot\n\n1:09:15.000 --> 1:09:17.000\n might improve privacy and scaling,\n\n1:09:17.000 --> 1:09:20.000\n which is like at the high level things that people mention?\n\n1:09:20.000 --> 1:09:24.000\n Is that just like a dramatic way of trying to frame\n\n1:09:24.000 --> 1:09:27.000\n what's fundamentally an incremental improvement?\n\n1:09:27.000 --> 1:09:29.000\n Yes, but incremental is the word, right?\n\n1:09:29.000 --> 1:09:32.000\n We're not going to get an order of magnitude enhancement\n\n1:09:32.000 --> 1:09:34.000\n to either privacy or scaling,\n\n1:09:34.000 --> 1:09:37.000\n but we will get a considerable enhancement.\n\n1:09:37.000 --> 1:09:40.000\n But privacy and scaling are actually two sides of the same coin\n\n1:09:40.000 --> 1:09:42.000\n because you get more transactional privacy\n\n1:09:42.000 --> 1:09:45.000\n by removing data from the ledger\n\n1:09:45.000 --> 1:09:49.000\n so that there's less metadata for people to surveil and analyze.\n\n1:09:49.000 --> 1:09:51.000\n And that's also how you scale\n\n1:09:51.000 --> 1:09:56.000\n by compressing and being really space efficient with transactions.\n\n1:09:56.000 --> 1:09:58.000\n And the more parsimonious you are,\n\n1:09:58.000 --> 1:10:04.000\n the more economically dense each byte that everyone has to retain on the ledger is.\n\n1:10:04.000 --> 1:10:09.000\n And so those are very closely allied concepts.\n\n1:10:09.000 --> 1:10:16.000\n So do you mind if we go through some potential criticisms of Bitcoin?\n\n1:10:16.000 --> 1:10:22.000\n Totally. I spent the last five years tackling these every day.\n\n1:10:22.000 --> 1:10:24.000\n Are the dice the same?\n\n1:10:24.000 --> 1:10:26.000\n Those two are the same, yeah. There are three editions.\n\n1:10:26.000 --> 1:10:31.000\n So let's go with the dice.\n\n1:10:31.000 --> 1:10:33.000\n Silk Road. What does that mean?\n\n1:10:33.000 --> 1:10:36.000\n Silk Road. Classic. Classic situation.\n\n1:10:36.000 --> 1:10:40.000\n So that was the darknet marketplace set up by Ross Albrecht\n\n1:10:40.000 --> 1:10:42.000\n in the early days of Bitcoin.\n\n1:10:42.000 --> 1:10:45.000\n That's one of the first killer apps for Bitcoin\n\n1:10:45.000 --> 1:10:50.000\n was being the payments network behind this darknet marketplace\n\n1:10:50.000 --> 1:10:53.000\n where you'd go to buy drugs and things.\n\n1:10:53.000 --> 1:10:55.000\n And so that became associated with Bitcoin,\n\n1:10:55.000 --> 1:10:58.000\n if you remember the press coverage from back then.\n\n1:10:58.000 --> 1:11:02.000\n But over time that faded and it became less of a critique.\n\n1:11:02.000 --> 1:11:06.000\n So like the critique is that Bitcoin is something you would use\n\n1:11:06.000 --> 1:11:10.000\n for illegal activity, for drugs, for crimes, all those kinds of things,\n\n1:11:10.000 --> 1:11:15.000\n as opposed to for any kind of legitimate transactions and merchant transactions.\n\n1:11:15.000 --> 1:11:18.000\n And today Bitcoin settles $10 billion a day\n\n1:11:18.000 --> 1:11:22.000\n and the vast, vast majority of it is completely legitimate.\n\n1:11:22.000 --> 1:11:25.000\n It's just a useful alternative system.\n\n1:11:25.000 --> 1:11:28.000\n But back then a huge fraction of all Bitcoin transactions\n\n1:11:28.000 --> 1:11:32.000\n were related to the basically illicit marketplaces.\n\n1:11:32.000 --> 1:11:36.000\n And if you're just tuning in, this incredible tall sighted guy\n\n1:11:36.000 --> 1:11:41.000\n has 11 common criticisms of Bitcoin that Nick,\n\n1:11:41.000 --> 1:11:44.000\n in a genius way, has put together.\n\n1:11:44.000 --> 1:11:47.000\n Maybe you could do a couple more.\n\n1:11:47.000 --> 1:11:52.000\n It was Satoshi something, Satoshi Coins.\n\n1:11:52.000 --> 1:11:56.000\n Satoshi Coins, we touched on that earlier in the episode.\n\n1:11:56.000 --> 1:12:01.000\n What if Satoshi returns and sells all of their coins?\n\n1:12:01.000 --> 1:12:05.000\n So we don't know for sure how many coins Satoshi actually mined or produced\n\n1:12:05.000 --> 1:12:10.000\n because there's a degree of probabilistic analysis that you would do.\n\n1:12:10.000 --> 1:12:17.000\n There's a few thousand blocks that were mined by what we think is a single entity\n\n1:12:17.000 --> 1:12:19.000\n in sort of 2009.\n\n1:12:19.000 --> 1:12:21.000\n And so if you add them all up, you get to about a million.\n\n1:12:21.000 --> 1:12:24.000\n So people think that Satoshi mined a million coins\n\n1:12:24.000 --> 1:12:27.000\n and then they're worried that Satoshi would return\n\n1:12:27.000 --> 1:12:33.000\n and market sell all the coins, thus crushing the price of Bitcoin.\n\n1:12:33.000 --> 1:12:39.000\n So looking at some of these, no CEO, I think we touched on that.\n\n1:12:39.000 --> 1:12:42.000\n We did, we see, we've already hit on the dice.\n\n1:12:42.000 --> 1:12:46.000\n No merchants, that's no longer true.\n\n1:12:49.000 --> 1:12:53.000\n There's a scalability one, and I think that one has addressed\n\n1:12:53.000 --> 1:12:56.000\n the idea that you're mentioning with the block size debates\n\n1:12:56.000 --> 1:13:00.000\n and the lightning network that by adding extra layers on top,\n\n1:13:00.000 --> 1:13:02.000\n you can achieve scalability.\n\n1:13:02.000 --> 1:13:06.000\n That's my vision, that's my theory.\n\n1:13:06.000 --> 1:13:09.000\n And you can do it in a permissionless and a permissioned way.\n\n1:13:09.000 --> 1:13:12.000\n Like Coinbase is a big Bitcoin exchange.\n\n1:13:12.000 --> 1:13:14.000\n They provide scalability.\n\n1:13:14.000 --> 1:13:16.000\n They're a financial institution.\n\n1:13:16.000 --> 1:13:19.000\n You can settle up internally on their own database\n\n1:13:19.000 --> 1:13:22.000\n and then periodically settle to Bitcoin.\n\n1:13:22.000 --> 1:13:26.000\n So they do something like the lightning network internally,\n\n1:13:26.000 --> 1:13:28.000\n something like this similar kind of mechanism.\n\n1:13:28.000 --> 1:13:30.000\n Well, honestly, I'm not sure exactly how it works.\n\n1:13:30.000 --> 1:13:34.000\n They might have that built in, but just generally speaking,\n\n1:13:34.000 --> 1:13:38.000\n institutional scaling is a model for scaling, right?\n\n1:13:38.000 --> 1:13:40.000\n Where you could have banks holding Bitcoin\n\n1:13:40.000 --> 1:13:42.000\n and they issue notes against Bitcoin,\n\n1:13:42.000 --> 1:13:44.000\n and those are your payments,\n\n1:13:44.000 --> 1:13:48.000\n and then the base layer is the settlement layer.\n\n1:13:48.000 --> 1:13:52.000\n I think that's what you're getting with the boiling oceans,\n\n1:13:52.000 --> 1:13:56.000\n is this is like the impact on weather,\n\n1:13:56.000 --> 1:13:58.000\n I suppose, on the environment.\n\n1:13:58.000 --> 1:14:02.000\n So, you know, that is a concern that people have\n\n1:14:02.000 --> 1:14:04.000\n in terms of like the proof of work requires\n\n1:14:04.000 --> 1:14:07.000\n that there's a lot of computational resources being used\n\n1:14:07.000 --> 1:14:09.000\n and that requires a lot of energy\n\n1:14:09.000 --> 1:14:13.000\n and like some large percentage of the world's energy\n\n1:14:13.000 --> 1:14:15.000\n is used to mine Bitcoin.\n\n1:14:15.000 --> 1:14:18.000\n How would you respond to that criticism?\n\n1:14:18.000 --> 1:14:21.000\n Yeah, I mean, that's been the loudest critique of Bitcoin\n\n1:14:21.000 --> 1:14:22.000\n this year in the press.\n\n1:14:22.000 --> 1:14:23.000\n This year, really?\n\n1:14:23.000 --> 1:14:26.000\n Yeah, so, I mean, it's not like a new criticism,\n\n1:14:26.000 --> 1:14:29.000\n but Bitcoin is consuming more energy than ever.\n\n1:14:29.000 --> 1:14:34.000\n So, as the price rises, the electricity consumption rises,\n\n1:14:34.000 --> 1:14:40.000\n and so we've heard renewed, you know, bellyaching over this,\n\n1:14:40.000 --> 1:14:41.000\n for sure.\n\n1:14:41.000 --> 1:14:44.000\n I mean, if you don't believe that Bitcoin is useful,\n\n1:14:44.000 --> 1:14:47.000\n then you're inclined to think that all the energy consumption\n\n1:14:47.000 --> 1:14:48.000\n is a waste.\n\n1:14:48.000 --> 1:14:53.000\n So that's, you know, it's something that's sort of unrebuttable\n\n1:14:53.000 --> 1:14:58.000\n if you fundamentally contest the validity of the Bitcoin system.\n\n1:14:58.000 --> 1:15:04.000\n So if Bitcoin is like a thing that will take over,\n\n1:15:04.000 --> 1:15:09.000\n it will become like the main mechanism of financial transactions\n\n1:15:09.000 --> 1:15:12.000\n or transactions period in the world, then you say,\n\n1:15:12.000 --> 1:15:15.000\n well, the cost of energy use is actually quite low\n\n1:15:15.000 --> 1:15:17.000\n relative to the benefit it provides.\n\n1:15:17.000 --> 1:15:19.000\n If you think it's not going to be,\n\n1:15:19.000 --> 1:15:25.000\n if it's just a volatile way to make a little money in the short term,\n\n1:15:25.000 --> 1:15:28.000\n then you see the energy use as really wasteful.\n\n1:15:28.000 --> 1:15:30.000\n That's totally spurious, yeah.\n\n1:15:30.000 --> 1:15:34.000\n So then there's no really response, I suppose.\n\n1:15:34.000 --> 1:15:38.000\n That's, so I can totally, you know, get into the details\n\n1:15:38.000 --> 1:15:40.000\n of Bitcoin's energy mix and things like that,\n\n1:15:40.000 --> 1:15:43.000\n but that's like at a high level what the debate is.\n\n1:15:43.000 --> 1:15:46.000\n It's this normative question, like, does Bitcoin have an entitlement\n\n1:15:46.000 --> 1:15:48.000\n to consume any of the world's resources?\n\n1:15:48.000 --> 1:15:52.000\n And that's actually where the debate should end much of the time\n\n1:15:52.000 --> 1:15:57.000\n because a lot of people fundamentally dispute the validity\n\n1:15:57.000 --> 1:16:00.000\n or usefulness of Bitcoin as a system.\n\n1:16:00.000 --> 1:16:04.000\n And so, of course, they're going to consider the energy usage illegitimate.\n\n1:16:04.000 --> 1:16:08.000\n Now, there's a lot of mitigating factors if you, you know,\n\n1:16:08.000 --> 1:16:11.000\n think the Bitcoin is potentially a useful system,\n\n1:16:11.000 --> 1:16:15.000\n which is Bitcoin consumes energy in a very peculiar way,\n\n1:16:15.000 --> 1:16:18.000\n which virtually no other industry does,\n\n1:16:18.000 --> 1:16:25.000\n which is that Bitcoin is a geography independent buyer of energy,\n\n1:16:25.000 --> 1:16:29.000\n which is not how we humans typically consume energy.\n\n1:16:29.000 --> 1:16:33.000\n Like, we need energy to be produced near to population centers,\n\n1:16:33.000 --> 1:16:36.000\n and we need it to be produced at the, you know,\n\n1:16:36.000 --> 1:16:40.000\n corresponding to the peaks and troughs of our consumption, right?\n\n1:16:40.000 --> 1:16:44.000\n Because we have to 100% match the demand and the supply at all times, right?\n\n1:16:44.000 --> 1:16:46.000\n Otherwise, we'd blackouts.\n\n1:16:46.000 --> 1:16:50.000\n So, Bitcoin doesn't care about any of that.\n\n1:16:50.000 --> 1:16:54.000\n It just buys energy on a constant basis.\n\n1:16:54.000 --> 1:16:57.000\n And so, it's, you know, indifferent to where it's being produced.\n\n1:16:57.000 --> 1:17:02.000\n And so, the consequence of all that is that Bitcoin will buy energy\n\n1:17:02.000 --> 1:17:05.000\n that's otherwise being wasted, basically.\n\n1:17:05.000 --> 1:17:09.000\n So, it will buy so called stranded energy assets\n\n1:17:09.000 --> 1:17:11.000\n that would not make it to a population center.\n\n1:17:11.000 --> 1:17:16.000\n And in fact, most energy produced is, ultimately,\n\n1:17:16.000 --> 1:17:21.000\n does not sort of make it to, you know, your socket in your wall.\n\n1:17:21.000 --> 1:17:26.000\n And so, this is why so much Bitcoin is mined in China, for instance.\n\n1:17:26.000 --> 1:17:31.000\n It's not because, you know, Chinese industrialists had a special affinity for Bitcoin.\n\n1:17:31.000 --> 1:17:36.000\n It's because the Chinese grid had a massive overabundance of energy,\n\n1:17:36.000 --> 1:17:40.000\n and particularly in four provinces, Sichuan, Yunnan, Inner Mongolia,\n\n1:17:40.000 --> 1:17:41.000\n and Xinjiang.\n\n1:17:41.000 --> 1:17:45.000\n So, in those four provinces, those are all pretty distant\n\n1:17:45.000 --> 1:17:47.000\n from major population centers.\n\n1:17:47.000 --> 1:17:51.000\n So, because of that, you can't really transport the energy that easily.\n\n1:17:51.000 --> 1:17:54.000\n And so, huge amounts of energy are curtailed\n\n1:17:54.000 --> 1:17:57.000\n or basically wasted in all those provinces.\n\n1:17:57.000 --> 1:17:59.000\n And so, miners set up shop there\n\n1:17:59.000 --> 1:18:02.000\n because they could mine Bitcoin with the excess energy.\n\n1:18:02.000 --> 1:18:05.000\n They could monetize this thing that otherwise was going to go to waste.\n\n1:18:05.000 --> 1:18:11.000\n So, you know, there's things like that which, you know, I think mitigate the reality.\n\n1:18:11.000 --> 1:18:16.000\n Bitcoin is not really rival with our consumption of electricity.\n\n1:18:16.000 --> 1:18:18.000\n It's not depriving anyone of electricity.\n\n1:18:18.000 --> 1:18:24.000\n It's mostly these stranded assets that are going into supporting the Bitcoin network.\n\n1:18:24.000 --> 1:18:28.000\n So, maybe let's do a last one since you mentioned China.\n\n1:18:28.000 --> 1:18:29.000\n This is China control.\n\n1:18:29.000 --> 1:18:32.000\n So, if so much mining is happening in China,\n\n1:18:32.000 --> 1:18:39.000\n how do we prevent nation states from controlling much of Bitcoin?\n\n1:18:39.000 --> 1:18:44.000\n Yeah, that's the flip side of a large portion of the blocks being mined in China\n\n1:18:44.000 --> 1:18:46.000\n due to this energy feature which I discussed,\n\n1:18:46.000 --> 1:18:50.000\n which is that there's a lot of Chinese miners for sure.\n\n1:18:50.000 --> 1:18:53.000\n Now, the question ultimately is,\n\n1:18:53.000 --> 1:18:57.000\n what degree of control do miners have over the Bitcoin system?\n\n1:18:57.000 --> 1:19:01.000\n And that was part of the block size debate.\n\n1:19:01.000 --> 1:19:06.000\n I mean, the miners, when we implemented subgraded witness in 2017,\n\n1:19:06.000 --> 1:19:09.000\n the miners just didn't want to do it.\n\n1:19:09.000 --> 1:19:15.000\n Eventually, the users, the regular folks running nodes rebelled and basically said,\n\n1:19:15.000 --> 1:19:18.000\n look, we're going to implement this whether or not you do it.\n\n1:19:18.000 --> 1:19:22.000\n And it was a threat to the value of Bitcoin because if this threat had gone through,\n\n1:19:22.000 --> 1:19:25.000\n it could have split Bitcoin and it would have been really messy.\n\n1:19:25.000 --> 1:19:27.000\n So, the miners sort of capitulated.\n\n1:19:27.000 --> 1:19:34.000\n So, I think the current consensus is that miners do not have unilateral control over Bitcoin\n\n1:19:34.000 --> 1:19:39.000\n and that governance is more poised between people that run nodes, developers and miners.\n\n1:19:39.000 --> 1:19:44.000\n It's sort of a triumvirate where neither of them has, you know, total control.\n\n1:19:44.000 --> 1:19:48.000\n So, that's my current model for controlling Bitcoin.\n\n1:19:48.000 --> 1:19:52.000\n I think if you asked a miner, they would tell you they didn't feel\n\n1:19:52.000 --> 1:19:56.000\n that they had sort of unilateral control over Bitcoin either.\n\n1:19:56.000 --> 1:20:03.000\n Almost as a thought experiment, can I ask you to think about if some of your predictions,\n\n1:20:03.000 --> 1:20:09.000\n some of your analysis, some of your understanding of Bitcoin is wrong in the following sense\n\n1:20:09.000 --> 1:20:16.000\n where it will not have the impact that you have a vision for it,\n\n1:20:16.000 --> 1:20:21.000\n that you will not have the scale of impact and perhaps in terms of value will go to zero\n\n1:20:21.000 --> 1:20:25.000\n to something very low and other cryptocurrency or other financial systems will overtake it.\n\n1:20:25.000 --> 1:20:29.000\n What would be the reason for that in your mind?\n\n1:20:29.000 --> 1:20:32.000\n Like, why might you be wrong?\n\n1:20:32.000 --> 1:20:41.000\n If you look back at it in the future, what did you not understand about Bitcoin that will result in that?\n\n1:20:41.000 --> 1:20:43.000\n Yeah, that's a great question.\n\n1:20:43.000 --> 1:20:48.000\n I think for that to happen, one of two things would have to obtain,\n\n1:20:48.000 --> 1:20:53.000\n one of two things would have to happen for Bitcoin to just be irrelevant basically.\n\n1:20:53.000 --> 1:21:01.000\n Either central banks totally clean up their act and stop engaging in rampant money printing,\n\n1:21:01.000 --> 1:21:04.000\n which I don't expect that to happen anytime soon.\n\n1:21:04.000 --> 1:21:09.000\n I mean, it looks like we're normalizing this new regime of inflation, pro inflation,\n\n1:21:09.000 --> 1:21:12.000\n just to remediate the debt issues we have.\n\n1:21:12.000 --> 1:21:18.000\n So that would be one thing that would make Bitcoin cryptocurrency much less relevant\n\n1:21:18.000 --> 1:21:25.000\n as if everyone becomes totally assured of the soundness of sovereign currencies basically,\n\n1:21:25.000 --> 1:21:29.000\n namely the dollar, like the dollar being the main one.\n\n1:21:29.000 --> 1:21:33.000\n It seems like we're going in completely opposite direction.\n\n1:21:33.000 --> 1:21:37.000\n Most people seem to be noticing the stirrings of inflation in society.\n\n1:21:37.000 --> 1:21:39.000\n You might have noticed that too.\n\n1:21:39.000 --> 1:21:45.000\n It's showing up in commodity prices, lumber prices, in food, obviously in financial assets.\n\n1:21:45.000 --> 1:21:49.000\n It'll show up in consumer prices generally soon.\n\n1:21:49.000 --> 1:21:53.000\n So that would be one way for Bitcoin to basically become irrelevant\n\n1:21:53.000 --> 1:21:56.000\n because it's a dialectical thing.\n\n1:21:56.000 --> 1:22:02.000\n Bitcoin is held in opposition to the established monetary regime.\n\n1:22:02.000 --> 1:22:09.000\n So if they completely reform themselves and the dollar becomes super sound once again\n\n1:22:09.000 --> 1:22:18.000\n and the Fed stops tinkering the way they constantly do, then we wouldn't need cryptocurrency as much.\n\n1:22:18.000 --> 1:22:28.000\n The other thing would be if a completely superior design for a new sort of state independent monetary system emerged.\n\n1:22:28.000 --> 1:22:32.000\n But it's really hard to even imagine how that would come to emerge.\n\n1:22:32.000 --> 1:22:42.000\n And there's good reasons to think that Bitcoin, the conditions of its launch were extremely favorable and hard to replicate.\n\n1:22:42.000 --> 1:22:50.000\n Can you speak to some of those conditions, why it's a unique timing wise moment for Bitcoin to emerge?\n\n1:22:50.000 --> 1:22:58.000\n Yeah. So obviously Bitcoin was born in the depths of the financial crisis, which gives it a nice historical element.\n\n1:22:58.000 --> 1:23:00.000\n But that was kind of a coincidence.\n\n1:23:00.000 --> 1:23:07.000\n Honestly, we know that Satoshi had been working on it earlier in 2017.\n\n1:23:07.000 --> 1:23:12.000\n The really special thing about Bitcoin was that it was launched anonymously\n\n1:23:12.000 --> 1:23:19.000\n by an entity that did not seek any glory or credit for what they did and apparently never monetized it at all.\n\n1:23:19.000 --> 1:23:23.000\n So they never really moved any of their coins.\n\n1:23:23.000 --> 1:23:29.000\n Satoshi sent one test transaction to Hal Finney, who is one of the earliest Bitcoiners.\n\n1:23:29.000 --> 1:23:33.000\n Aside from that, as far as we know, Satoshi never spent any of their coins.\n\n1:23:33.000 --> 1:23:39.000\n So you have this wonderful Promethean quality whereby it's almost self sacrificial.\n\n1:23:39.000 --> 1:23:48.000\n I mean, it's like this borderline godlike figure in terms of their restraint finds this monetary technology\n\n1:23:48.000 --> 1:23:50.000\n and releases it to the world and pays the price.\n\n1:23:50.000 --> 1:23:53.000\n They never took advantage of their filthy lucre.\n\n1:23:53.000 --> 1:24:00.000\n They never recognized any of the $50 billion that they made from Bitcoin.\n\n1:24:00.000 --> 1:24:06.000\n And Satoshi also didn't assign themselves any privileged access to the coins.\n\n1:24:06.000 --> 1:24:11.000\n Satoshi could have just written in the code, I own 10% of the coins.\n\n1:24:11.000 --> 1:24:15.000\n But they didn't. They just mined in the open free market competition like everyone else.\n\n1:24:15.000 --> 1:24:21.000\n It's just that Satoshi is an early miner to support the network, accumulate a lot of coins for sure.\n\n1:24:21.000 --> 1:24:24.000\n But they didn't have any privileged special access.\n\n1:24:24.000 --> 1:24:29.000\n So that's one thing that's extremely special about the launch is that we had a founder\n\n1:24:29.000 --> 1:24:36.000\n that was truly committed to the monetary protocol and didn't seek either recognition or financial spoils.\n\n1:24:36.000 --> 1:24:42.000\n And then also left. Satoshi left in 2010, 2011 and hasn't really been heard from since.\n\n1:24:42.000 --> 1:24:49.000\n It's a very George Washington gangster move where he didn't want power and once he got power, he let go of it.\n\n1:24:49.000 --> 1:24:50.000\n Precisely.\n\n1:24:50.000 --> 1:24:58.000\n That was a key actually move. That was probably one of the most important moves at the founding of this country.\n\n1:24:58.000 --> 1:25:02.000\n That's right. George Washington could have been a king, probably if he'd wanted.\n\n1:25:02.000 --> 1:25:06.000\n And Satoshi could have been Jerome Powell if he'd wanted.\n\n1:25:06.000 --> 1:25:11.000\n And Satoshi could have held on to power indefinitely but chose to leave.\n\n1:25:11.000 --> 1:25:23.000\n The other thing is that Bitcoin circulated for a long period of time from January 2009 to about July 2010 without really having a financial value.\n\n1:25:23.000 --> 1:25:27.000\n So there weren't really any marketplaces. It didn't have a value.\n\n1:25:27.000 --> 1:25:33.000\n And so that gave it this really great distribution among a broad set of stakeholders.\n\n1:25:33.000 --> 1:25:40.000\n And there were no venture funds or hedge funds trying to aggressively buy up all the supply back then.\n\n1:25:40.000 --> 1:25:50.000\n Now when you have new cryptocurrencies launched, they're aggressively pre mined and some gigantic Silicon Valley venture fund is going to own 30% of it.\n\n1:25:50.000 --> 1:26:02.000\n And so it's impossible to conceive of how that could become a global money because how could a Silicon Valley investment firm own 30% of the money supply?\n\n1:26:02.000 --> 1:26:07.000\n That doesn't make sense. That's just so oligarchical. It's unbelievable.\n\n1:26:07.000 --> 1:26:19.000\n So Bitcoin by contract is a very bottom up thing. It was the early enthusiasts, people that were really excited about the technology.\n\n1:26:19.000 --> 1:26:22.000\n They're the ones that obtained those early coins.\n\n1:26:22.000 --> 1:26:30.000\n And so there was a real element of fairness and just an organic nature to its launch, which would be incredibly hard to recapture today.\n\n1:26:30.000 --> 1:26:37.000\n Let's say Satoshi came back and they said, OK, I made Bitcoin 2.0. I'm going to release it.\n\n1:26:37.000 --> 1:26:48.000\n There would be the most aggressive land grab ever by gigantic pools of capital to sort of get favorable allocations of the new system.\n\n1:26:48.000 --> 1:26:58.000\n Can Satoshi with Bitcoin 2.0 build in a resistance mechanism or a prevention mechanism for the land grab?\n\n1:26:58.000 --> 1:27:07.000\n It would be hard to because if you have capital and resources, I mean, if it was a proof of work chain, you just have people that would invest a ton of money in mining, for instance.\n\n1:27:07.000 --> 1:27:16.000\n But most new blockchains, cryptocurrencies are just sold, basically. They're issued in token offerings kind of thing.\n\n1:27:16.000 --> 1:27:22.000\n So it's hard to enforce through the protocol the decentralization of control power.\n\n1:27:22.000 --> 1:27:29.000\n It'd be challenging to and people have tried to do airdrops where they distribute coins to a large number of people.\n\n1:27:29.000 --> 1:27:36.000\n Basically doesn't work. Most people don't care about the airdrop. So it's hard to have an equitable distribution.\n\n1:27:36.000 --> 1:27:43.000\n I think the conditions of Bitcoin's launch were so lucky and favorable that they're very unlikely to be replicated.\n\n1:27:43.000 --> 1:27:55.000\n So I do think it's going to be a real challenge to ever have a new competitor that's as decentralized, as leaderless, as dispersed, sort of distributed as Bitcoin is, has its credibility.\n\n1:27:55.000 --> 1:27:59.000\n I don't know how you could overrule it on those important features.\n\n1:27:59.000 --> 1:28:06.000\n What about Bitcoin's comparison to other current cryptocurrencies? So Bitcoin versus Ethereum, for example.\n\n1:28:06.000 --> 1:28:12.000\n Why is it possible that Ethereum overtakes Bitcoin?\n\n1:28:12.000 --> 1:28:15.000\n It's certainly possible. Yeah, I'm not ruling it out.\n\n1:28:15.000 --> 1:28:26.000\n Ethereum leadership is sort of wise enough to understand that they shouldn't compete with Bitcoin on those most profound qualities.\n\n1:28:26.000 --> 1:28:33.000\n Ethereum doesn't really aspire to be more sound from a monetary perspective than Bitcoin.\n\n1:28:33.000 --> 1:28:37.000\n In fact, the Ethereum leadership are sort of constantly tweaking the monetary policy.\n\n1:28:37.000 --> 1:28:41.000\n So they went for a completely different trade off.\n\n1:28:41.000 --> 1:28:47.000\n They also don't compete to be as decentralized from a governance perspective, right?\n\n1:28:47.000 --> 1:28:52.000\n Because there's leadership. There's an ETH foundation. There's a charismatic leader, Vitalik.\n\n1:28:52.000 --> 1:28:59.000\n And Ethereum has this policy of hard forks. So in Bitcoin, hard forks are extremely rare.\n\n1:28:59.000 --> 1:29:02.000\n In Ethereum, it's the default way to change things.\n\n1:29:02.000 --> 1:29:06.000\n So it's a much more adaptive system and it changes more frequently.\n\n1:29:06.000 --> 1:29:11.000\n But that also means that it's sort of they're incurring more risk when they introduce those changes.\n\n1:29:11.000 --> 1:29:23.000\n There's much more complexity. So Ethereum is smart because they sort of understood Bitcoin as the top dog when it comes to a sound money, a digital gold type thing.\n\n1:29:23.000 --> 1:29:29.000\n And they went for all of the different trade offs. They wanted to be more of a platform.\n\n1:29:29.000 --> 1:29:32.000\n They wanted to have more complexity of the transactional layer.\n\n1:29:32.000 --> 1:29:38.000\n They wanted to take on more risk in terms of changing the protocol. They wanted to change more quickly.\n\n1:29:38.000 --> 1:29:46.000\n They wanted to make the monetary policy more mutable. So Ethereum takes that completely different tack.\n\n1:29:46.000 --> 1:29:51.000\n Of course, you know, I'm not ruling out that it could take over Bitcoin from a market cap perspective.\n\n1:29:51.000 --> 1:29:53.000\n It's just a very different system.\n\n1:29:53.000 --> 1:30:03.000\n And I tend to think that Bitcoin is the most disruptive one because it's the most equipped to challenge sovereign currencies in the grand scheme.\n\n1:30:03.000 --> 1:30:18.000\n Do you think they can coexist? So like in the future, do you see a world where, you know, Ethereum captures some large percent of the market but nevertheless the minority?\n\n1:30:18.000 --> 1:30:20.000\n A hundred percent.\n\n1:30:20.000 --> 1:30:28.000\n Bitcoin has already been tokenized and put onto Ethereum. Many units of Bitcoin, I think over a billion dollars worth.\n\n1:30:28.000 --> 1:30:43.000\n So not only do they coexist, they are actually mutualistic. So they're like two creatures that have this, you know, it's like the rhino and like the bird that packs the parasites off the rhino's back or whatever.\n\n1:30:43.000 --> 1:30:46.000\n Yeah. Right. So I don't know which is which in the analogy.\n\n1:30:46.000 --> 1:30:51.000\n But yeah, I don't know who the parasites are.\n\n1:30:51.000 --> 1:31:02.000\n Or, you know, the alligator and the teeth cleaning fish or whatever. Right. So, you know, I always wonder why the alligator doesn't just eat the fish, but I guess they're brushing its teeth basically.\n\n1:31:02.000 --> 1:31:14.000\n So Ethereum is it gives you more transactional flexibility. There's much more experimentation happening there. It has this whole decentralized finance element.\n\n1:31:14.000 --> 1:31:22.000\n There's a huge number of Bitcoins that circulate on the Ethereum protocol, right? Because Ethereum is open to other asset types, basically.\n\n1:31:22.000 --> 1:31:34.000\n So I think that's actually accretive to both systems because Ethereum gets to have this good form of collateral Bitcoin on the system, which is good volatility characteristics.\n\n1:31:34.000 --> 1:31:48.000\n And then it's a supply sink for Bitcoins, which are sort of now they're injected into this third party protocol. And that, I think, reduces the velocity of Bitcoin overall, and it's probably good for the valuation.\n\n1:31:48.000 --> 1:31:53.000\n So you see it quite possibly could be a symbiotic relationship. That's really interesting.\n\n1:31:53.000 --> 1:31:55.000\n I think so. I think so.\n\n1:31:55.000 --> 1:32:07.000\n What are your thoughts about Vitalik, Buterin? What are your thoughts about some of the other figures in the space outside of Bitcoin?\n\n1:32:07.000 --> 1:32:15.000\n I think Vitalik made some mistakes with Ethereum ultimately. Like, I disagree with some of the decisions that were made along the way.\n\n1:32:15.000 --> 1:32:29.000\n Like, there's this infamous case of this bailout where 14% of Ether was lost in the smart contract, or really this smart contract that a lot of Ethereum leadership were sort of backing and supporting was hacked.\n\n1:32:29.000 --> 1:32:39.000\n And then the foundation with Vitalik's support chose to make a change to the underlying protocol to undo the hack, right?\n\n1:32:39.000 --> 1:32:56.000\n So to me, that was not the most prudent approach, because you're basically violating the core protocol rules in order to undo, you know, to bail out a specific contract, which has failed.\n\n1:32:56.000 --> 1:33:05.000\n Granted, there was a lot of Ether in there. But I think that shook the credibility of the Ethereum system that happened back in 2016, I think.\n\n1:33:05.000 --> 1:33:09.000\n That was one reason why I became disenchanted with Ethereum.\n\n1:33:09.000 --> 1:33:22.000\n So basically, even if in that case that might fix an important problem that opens the door to centralized, like, manipulation of the protocol in the future.\n\n1:33:22.000 --> 1:33:42.000\n Yeah, it basically demonstrates that there's certain elites at the protocol level that can exercise specific control over the system. And, you know, a lot of people have lost money in hacks on Ethereum, a lot of contracts have gone south, huge amount of value, but they didn't get a bailout.\n\n1:33:42.000 --> 1:33:53.000\n And it was just when, you know, this specific contract called the DAO was hacked, that, you know, the leadership intervened.\n\n1:33:53.000 --> 1:34:04.000\n And, you know, to their credit, they haven't had a significant intervention or bailout since then. But it did normalize the practice. And I think it weakened the social contract.\n\n1:34:04.000 --> 1:34:12.000\n So I would prefer that you sort of bite the bullet in that situation, and you accept the failure of that contract.\n\n1:34:12.000 --> 1:34:15.000\n There'll be a ballsy move to bite that bullet.\n\n1:34:15.000 --> 1:34:21.000\n Yeah, I mean, and then you would have had like, what they thought was a malicious entity in control of a lot of coins.\n\n1:34:21.000 --> 1:34:34.000\n I think the real reason they sort of felt that they had to undo it was because they'd always planned to move to this proof of stake world, where your political control over the system is a function of your wealth in the system.\n\n1:34:34.000 --> 1:34:46.000\n And they didn't want this attacker, which would have inherited all this significant wealth, to have influence over that future proof of stake version. That's sort of my theory.\n\n1:34:46.000 --> 1:35:01.000\n Yeah, I mean, that makes sense. It kind of reminds me of the bailout of car companies. You know, this is difficult. There's a lot of people that criticize the bailout of these large companies, you know.\n\n1:35:01.000 --> 1:35:19.000\n Yeah, creative destruction. I mean, I was critical of the bailouts that happened during COVID. I mean, I generally think that it's healthier for society for bad firms that aren't making money to fail or be reorganized under the various forms of bankruptcy.\n\n1:35:19.000 --> 1:35:32.000\n And you saw what happens. You see the, you know, the corporate sector in Japan in the 90s, there was this like slow motion insolvency where basically firms weren't allowed to fail.\n\n1:35:32.000 --> 1:35:44.000\n And the Japanese corporate sector lost competitiveness because bad firms did not fail. And so, you know, the process of actual capitalism for the market clearing didn't occur.\n\n1:35:44.000 --> 1:35:53.000\n So I'm always in support of, you know, of the free market being allowed to clear for non profitable firms to fail.\n\n1:35:53.000 --> 1:36:10.000\n It's complicated, man, because creative destruction seems to be in the long term a positive. But human civilization is such that short term pain has real impact on people, you know.\n\n1:36:10.000 --> 1:36:19.000\n Yeah, policymakers don't ever want to incur that short term pain because they have a short term outlook and term limits often.\n\n1:36:19.000 --> 1:36:29.000\n And also just it's short term pain. Forget policymakers, forget politicians. It sucks to lose a job for an individual.\n\n1:36:29.000 --> 1:36:41.000\n You know, you could say the company, you know, creative destruction of a company means the company was inefficient and that's going to have a ripple effect of teaching everybody else what an efficient operation looks like.\n\n1:36:41.000 --> 1:36:46.000\n But like there's jobs that are being lost. There's families that have to suffer because of that.\n\n1:36:46.000 --> 1:37:01.000\n I mean, that's the tension we live in society is having a basic safety net for our world because there's a level beyond which, like if through creative destruction,\n\n1:37:01.000 --> 1:37:08.000\n you have some percent of the population that dips below a certain level that you would call like suffering.\n\n1:37:08.000 --> 1:37:21.000\n We don't want that. And that's a difficult thing to live with. Like, yes, in the long term, you want inefficiency to be destroyed and efficiency to be rewarded.\n\n1:37:21.000 --> 1:37:29.000\n But there does seem to be a base level of like quality of life that we want to uphold. That's a difficult thing to think about.\n\n1:37:29.000 --> 1:37:41.000\n I think about that a lot. There's a doctor called Paul Farmer that, you know, there's like in Haiti or in Africa, there's a child who's dying.\n\n1:37:41.000 --> 1:37:52.000\n And as a doctor, you want to give everything you have, all the money you have to save that one child. And you do, actually.\n\n1:37:52.000 --> 1:38:07.000\n But that's a very human action. It's not a rational action from a game theoretic perspective because there's no way you can take that action for every child who is suffering.\n\n1:38:07.000 --> 1:38:16.000\n But there's something deeply human about doing that for that one particular child. In that same sense, creative destruction is an economic principle.\n\n1:38:16.000 --> 1:38:23.000\n But it's not necessarily that same kind of human principle. And there's a tension there.\n\n1:38:23.000 --> 1:38:34.000\n I see it. I mean, I think that's the issue with modern central banking, really, is that the central bank always has an incentive to lower interest rates.\n\n1:38:34.000 --> 1:38:52.000\n And they've been doing that from the 70s towards today on this, you know, well, 80s, really, on this slow march down. Because whenever there was a hint of a crisis in the economy or financial asset prices started to fall, their reaction is, okay, we'll inject more capital into the economy, we'll save it.\n\n1:38:52.000 --> 1:39:11.000\n But my view is that these palliative short term measures cause the buildup of a huge amount of fragility in the long term. And then the ultimate collapse is much worse than the counterfactual situation where you raised interest rates, you took your medicine, and the economy was healthier.\n\n1:39:11.000 --> 1:39:34.000\n So and that's sort of, that's why, you know, people like Ray Dalio point out that you have these long term debt cycles. And we're sort of at the end of one now, is because we couldn't take our medicine, we couldn't, you know, let interest rates clear, we constantly wanted to ward off any difficulty, and we didn't ever want to de leverage truly.\n\n1:39:34.000 --> 1:39:41.000\n And then when the when the debt crisis happens, and it hits, it's, you know, horrendously bad.\n\n1:39:41.000 --> 1:40:03.000\n So do you think Bitcoin might reach a million dollars in value? It's, it's having a current resurgence, a crazy one in 2021, in the recent months of over 60,000, I guess it is now. Do you think it's possible it goes over 100,000? Do you think it's possible it goes to a million?\n\n1:40:03.000 --> 1:40:15.000\n You can't rule anything out with Bitcoin. So I mean, I'm not, you know, wanting to put price targets on it. But one way it could reach a million dollars is Bitcoin's value stays unchanged in real terms.\n\n1:40:15.000 --> 1:40:44.000\n And the dollar depreciates. Not that I expect hyperinflation. But yeah, I mean, like Bitcoin is worth about one 10th, slightly under one 10th the value of all the gold in the world. And, you know, gold is worth 10 trillion, 11 trillion dollars in the aggregate. Do I think Bitcoin can be more culturally and economically salient than gold in two decades time? 100%. Bitcoin was unknown.\n\n1:40:44.000 --> 1:41:07.000\n 12 years ago, and today 100 million people worldwide own Bitcoin. So just extrapolate that what is the level of penetration you think we'll get 500 million a billion? You know, you can easily tune these adoption curves, however you like. I don't think it's done, you know, monetizing and being adopted globally.\n\n1:41:07.000 --> 1:41:29.000\n You think it can become like the base layer for a lot of our financial operation, like become the main base layer for all our transactions. So like, even banks will use Bitcoin, essentially, and like Visa would use Bitcoin as the base layer, like it would actually operate very similarly at the surface layer, but at the base layer would all be Bitcoin.\n\n1:41:29.000 --> 1:41:58.000\n That's precisely what I expect. And banks and Visa are already using Bitcoin. So Visa has embraced Bitcoin in a really big way, actually. And it's always funny to the people saying Bitcoin has to change in a certain way so it can compete with Visa. No, Visa adopted Bitcoin, right? PayPal adopted Bitcoin, Square adopted Bitcoin. Obviously, they're not tearing out all of their existing infrastructure, but they're totally engaging with this thing.\n\n1:41:58.000 --> 1:42:23.000\n Banks have now begun, they got the green light to provide custody for Bitcoin for their depositors. That's the first step. Eventually, you know, it'll happen one of two ways, either Bitcoin native financial institutions will become banks, that's already happening. There's Bitcoin exchanges that have gotten banking licenses, or banks themselves will start to engage with Bitcoin as a reserve asset.\n\n1:42:23.000 --> 1:42:45.000\n It'll converge either way. That's totally happening. And yes, I mean, I don't think Bitcoin is going to power every financial transaction, I think it'll coexist alongside sovereign currencies. But I think it's a great reserve asset. It's a very powerful asset to build a financial system on top of because it's highly, highly auditable.\n\n1:42:45.000 --> 1:43:07.000\n It's something that you can take physical delivery of very cheaply. And those are great qualities. If you're a depositor in a bank, they can prove to you how much Bitcoin they have. They can't really easily prove, you know, in the old system, how much gold they held on deposit. And you can easily conduct a run on the bank, you can hold them accountable, because you can withdraw it.\n\n1:43:07.000 --> 1:43:30.000\n Because, you know, making Bitcoin transaction is pretty easy at the end of the day. Unlike fiat currency, it's like kind of, you can't really withdraw your dollars from the bank. I mean, you sort of can, but you're not going to want to take delivery of pounds of cash or anything like that. So it's a good modern asset upon which to build a financial system, basically.\n\n1:43:30.000 --> 1:43:54.000\n You mentioned Square and Visa sort of investing in Bitcoin. What do you make of probably one of the higher profile big investments in Bitcoin, which is Tesla and Elon Musk? But there's also a few billionaires like Chamath and all of them investing. What do you make of this whole movement? Why do you think they're doing it? I mean, Tesla is an interesting case. Why do you think Tesla is buying so much Bitcoin?\n\n1:43:54.000 --> 1:44:11.000\n I honestly don't know. And I would love to truly know Elon's genuine thoughts on Bitcoin. Because he's kind of sending us mixed messages, honestly, with his embrace of Dogecoin, which is sort of playful, not exactly sure what point he's trying to make there.\n\n1:44:11.000 --> 1:44:36.000\n So you were involved with Dogecoin, you mentioned offline a little bit in the early days, or at least played around with it. What do you make of Dogecoin? What do you make of Elon and Doge? What do you make of this particular meme coin? Is it one, like a legitimate cryptocurrency? Or is it two, like a funny internet way of saying F you to the man?\n\n1:44:36.000 --> 1:44:58.000\n Yeah, it's a good question. I mean, so I wasn't like a figurehead in Dogecoin or anything. But that was totally my introduction to crypto was mining Dogecoin in my dorm room. And then tipping people online in Dogecoin, which I just thought was the funniest thing. So I guess that was really easy to entertain back in 2013.\n\n1:44:58.000 --> 1:45:15.000\n But it was very playful at the time, there was a culture around Dogecoin. And the people liked it, because it was in opposition to the Bitcoin culture, which was really serious and involved lots of Austrian economics, and Rothbard and Hayek and stuff like that.\n\n1:45:15.000 --> 1:45:35.000\n So that was my introduction to cryptocurrency was because I thought the Bitcoin people were pretty lame. Yeah. And they were like, way too serious about all this stuff. And I was like, okay, I'll just be a part of the Dogecoin community. And they did all these funny publicity stunts, like, they paid to send the Jamaican bobsled team to the Olympics.\n\n1:45:35.000 --> 1:45:55.000\n You know, like, great stuff. Like they put the Dogecoin logo on top of a NASCAR car. Yeah. And I just that tickled me so much because it's like this made up internet coin. This was back when crypto is pretty novel and still like kind of funny and stuff. And that was really entertaining. Fast forward seven, eight years.\n\n1:45:55.000 --> 1:46:10.000\n Dogecoin is way less entertaining now, frankly, because it's the leadership left the community spirit evaporated. The meme didn't persist. I mean, Doge itself is not really a contemporary meme, right? I mean, it's an old meme.\n\n1:46:10.000 --> 1:46:30.000\n Although that new refresh of the meme, like Doge, I haven't heard that name in a long time. Like, or Doge is like in a hat smoking a cigarette. I mean, there's some sense where Elon is reinvigorating the meme. And it's funny, because like one influential figure could do just that, which just speaks to the tension that you're talking about.\n\n1:46:30.000 --> 1:46:47.000\n Like Tesla is investing Bitcoin. And yet, Elon, he also tweets about Bitcoin. But yeah, he's, I mean, who am I to question the meme, right? Like, yeah, I can't, you know, dissect internet culture and penantically sit here and tell you it's an invalid meme.\n\n1:46:47.000 --> 1:47:16.000\n You know, if people believe in it, then it's real. Is there a space for meme coins at this time? Like Doge or somebody else to almost like, you know, it does serve a lot of purposes, which is, like you said, it pulls in people into this whole space of digital currency, into cryptocurrency, allow them to explore, allow them to have fun as opposed to taking everything very seriously.\n\n1:47:16.000 --> 1:47:18.000\n Is there still space for that?\n\n1:47:18.000 --> 1:47:46.000\n Yeah, yeah. And I mean, the crypto landscape is very broad today. So whatever, you know, cultural element you seek to find within crypto, you will find. It was a bit different in 2013, because Bitcoin was kind of the only game in town, there were a couple altcoins. And so Dogecoin made a lot of sense as a counterpart to Bitcoin as a less serious counterpart. Today, crypto is just like gigantic cultural and economic trend.\n\n1:47:46.000 --> 1:48:04.000\n So it's, you know, very multifaceted. Dogecoin is one of the many, you know, ways that people have to engage with it. I think a lot of people that buy Dogecoin based on Elon's implied guidance are going to lose money, because fundamentally, there's nothing enduring about Dogecoin.\n\n1:48:04.000 --> 1:48:31.000\n It's an ancient fork of Bitcoin. It's unmaintained. There, you know, it's probably at risk, actually, from a protocol perspective. It's merge mined with Litecoin, I think. If there was an inflation bug on Dogecoin, it's unclear who would sort of be able to remediate that, you know, so it's not technologically very sound. So I wouldn't recommend that anyone stores wealth in it, you know.\n\n1:48:31.000 --> 1:48:56.000\n Yes, it's funny because cryptocurrency, like my interest in cryptocurrency is in the exploration of technical ideas. But cryptocurrency is also, like in the case of Dogecoin, like for LOLs, at least originally, like a meme coin, but it's also a mechanism for investment.\n\n1:48:56.000 --> 1:49:20.000\n And so those are sometimes a tension. And it's unclear, sort of like, yeah, you know, there's the meme with Doge has almost become to take it to, I guess, to a dollar, trying to drive the price of the value up to a dollar. But, you know, implied in that is like this overlap of the meme coin and like legitimate investment.\n\n1:49:20.000 --> 1:49:42.000\n And so you have a lot of young people, I think, who almost start getting greedy and want to make money, like as opposed to having fun. And that becomes a different beast then because you're essentially making financial decisions that can have a long lasting, like, you know, money is freedom.\n\n1:49:42.000 --> 1:50:03.000\n And if you make stupid financial decisions, you can remove freedom from your life. And that's, it can be detrimental in that sense. So I don't, it's difficult. I don't know what to do with that set of ideas because a lot of cryptocurrency, including Bitcoin, is very volatile because it's new.\n\n1:50:03.000 --> 1:50:30.000\n So you're trying to figure out the space of like, what's actually going to be a large part of, like you speak of network effects, like what's going to take over the world. And through that process, there's going to be a lot of volatility. And if you're talking about cryptocurrency as an investment mechanism, then it can have a real detrimental effects on people's lives.\n\n1:50:30.000 --> 1:50:53.000\n Yeah. And that's really the challenge with operating in the crypto space, talking about it, overlaid on top of everything that's interesting politically or culturally about it is the financial incentive. And so, you know, it's not all fun and games because there are literally billions over a trillion dollars at stake now.\n\n1:50:53.000 --> 1:51:22.000\n So if you buy Dogecoin, because some influencer on TikTok said so, you've now made a financial decision, right? So I'm not going to scold any Dogecoin buyers or any crypto asset buyer for that matter. But be aware that there are like billions of dollars of really elite hedge funds that are trying to front run all of your decisions and evaluate social sentiment, things like that. So it's a waterfall of sharks, basically.\n\n1:51:22.000 --> 1:51:36.000\n And by the way, if you're listening to this, don't take this podcast or anything I ever say as financial advice. That's definitely not my interest or expertise level. The interest here is to explore different ideas.\n\n1:51:36.000 --> 1:52:02.000\n Speaking of which, you've written a little bit about NFTs. I'd be interested to hear your opinions on this space of ideas, these non fungible tokens. They seem to have a cultural impact currently, but do they have a long lasting technical, financial or cultural impact or is this just a fad? What do you think of NFTs?\n\n1:52:02.000 --> 1:52:30.000\n Yeah, I think the current enthusiasm for NFTs and the financial metrics, you see the growth there in that sector is partially a function of where we are in the actual credit cycle. So oftentimes, when inflationary events occur, you have correspondence speculative manias that occur at the same time, because people intuitively feel that the fiat currency that they hold is being debased.\n\n1:52:30.000 --> 1:52:53.000\n And so they frantically look around for other places to put it. So stocks, property, commodities, and then other asset classes, NFTs are an asset class. And this is a case with any inflation you look at in history, you saw these correspondence speculative manias, basically, speculative episodes.\n\n1:52:53.000 --> 1:53:22.000\n So a lot of us feel that inflation is occurring, whether it's in CPI or not, that basically lots of dollars are being injected into the economy. We've all seen stocks massively appreciate even as GDP contracted. And so a lot of people sort of got caught on to this notion that, wow, is the Fed, you know, lowers interest rates, and Congress spends a huge amount of stimulus dollars into the economy, financial assets going to go up, so I better have exposure to all that stuff.\n\n1:53:22.000 --> 1:53:46.000\n And so you see, virtually every asset class is awash with cash right now, people are investing like their lives depend on it, investing, trading, whatever, whether it's options, volumes, on Robin Hood, you know, like kind of retail brokerages, things like that, whether it's stocks, whether it's crypto, and then other collectibles, baseball cards, their valuations have been skyrocketing.\n\n1:53:46.000 --> 1:54:07.000\n And so I think NFTs are part of that. It's a new asset class. It's basically an opportunity to invest in sort of art or collectibles, in game items, things like that. I think that explains a large degree of the enthusiasm, the excitement is that it's a novel asset class that people can trade.\n\n1:54:07.000 --> 1:54:29.000\n And right as you know, these inflationary tailwinds pick up. Now as for the sort of virtues of the actual technical phenomenon, NFTs are actually not a new idea at all. So you've had NFTs, I didn't call them NFTs, but in 2016, built on Bitcoin, for instance, so it's been around for a while.\n\n1:54:29.000 --> 1:54:45.000\n What it is, is a serial code, basically a string of data that is inserted onto a public blockchain, and then circulates as a unique token. And then the question is, okay, well, what does that data refer to? What's the external reference?\n\n1:54:45.000 --> 1:55:00.000\n And that has to be defined, there has to be some entity which says, oh, yeah, this unique string refers to like this piece of art or digital content, or, you know, trading card or whatever. So NFT, the concept itself is like an incredibly broad idea.\n\n1:55:00.000 --> 1:55:12.000\n It's just, well, what if we took, you know, barcodes, and put them on chain so that they could be traded. And so they could circulate freely on a peer to peer basis and plugged into exchanges and things like that.\n\n1:55:12.000 --> 1:55:25.000\n So that concept is super valid, clearly has protocol market fit, right? People are using it for a really wide array of purposes, it's completely going to exist.\n\n1:55:25.000 --> 1:55:48.000\n May the valuations contract of NFTs in the aggregate? Definitely possible, probably likely. But I think the notion of creating enduring collectibles or artworks that have accompanying signatures, basically autographed art on the blockchain, that has totally been validated.\n\n1:55:48.000 --> 1:55:50.000\n I think that won't go away.\n\n1:55:50.000 --> 1:56:07.000\n I wonder if there's ideas, like BitCloud, for example, I don't know if you saw that, if there's ideas built on top of this concept, it doesn't have to be like Ethereum NFTs, it could be just the concept of non fungible tokens, whether those kinds of things can take hold.\n\n1:56:07.000 --> 1:56:33.000\n And they, it's less about financial transactions, and more about almost like, I don't know how to put it, but like staking identity in some way, whether it's BitCloud or identity of objects, like there might be some way of connecting physical reality and digital reality in some interesting ways.\n\n1:56:33.000 --> 1:56:56.000\n So just the financial aspect is a way to put some validity behind the identity. I wonder if there's ideas there that are yet to be discovered, or ideas that are yet to take hold. Like BitCloud seems interesting, seems shady as hell, seems a little scammy.\n\n1:56:56.000 --> 1:57:01.000\n I don't know if I like the idea that you can bet on people, essentially.\n\n1:57:01.000 --> 1:57:09.000\n Yeah, I think my market cap on BitCloud is like $90,000, and I haven't done anything there, so.\n\n1:57:09.000 --> 1:57:13.000\n Did you take, did you like take, like verify yourself or whatever?\n\n1:57:13.000 --> 1:57:17.000\n I have not. I think people would yell at me on Twitter if I did, so.\n\n1:57:17.000 --> 1:57:22.000\n And it's unclear whether it's a scam yet or not, right? It's unclear where it's coming from.\n\n1:57:22.000 --> 1:57:36.000\n Well, there is some details about the, you know, investors. It's backed by some pretty big name investors, so I probably wouldn't use the word scam to describe it, but it's got Ponzi like dynamics, like everything in crypto.\n\n1:57:36.000 --> 1:57:58.000\n So there's very questionable, and then also is it using people's likeness without their permission, which is, I think, a legal question, you know, so there's open questions around it. But, you know, is our public blockchains and, you know, that sort of architecture, is that going to be useful for decentralized or alternative forms of social media?\n\n1:57:58.000 --> 1:58:19.000\n 100% yes. You know, I'm super, super bullish on that idea. Basically, creating open protocols, open namespaces, ways to organize without the dependence on a single node effectively in Silicon Valley, you know, the Twitter node or the Facebook node.\n\n1:58:19.000 --> 1:58:32.000\n I think it's a matter of urgency that we create, you know, digital gathering spaces where you have strong property rights, you know, you have a claim on your identity, you have a claim on your data. And open architecture is our way to do that.\n\n1:58:32.000 --> 1:58:46.000\n I don't know if it'll be a blockchain, but certainly I think the general, you know, concept introduced by blockchains is a good template for how to, you know, organize these systems.\n\n1:58:46.000 --> 1:59:09.000\n Yeah, value freedom, value decentralization of power, whatever the mechanism. Let me ask you about love. So there is a Bitcoin maximalist community that sometimes, so those folks in general have a strong belief that Bitcoin is good for the world.\n\n1:59:09.000 --> 1:59:25.000\n And it's almost an ethical imperative to sort of help Bitcoin succeed, which I think as a member of any community, I think is beautiful to believe in the vision of the community.\n\n1:59:25.000 --> 1:59:26.000\n Right.\n\n1:59:26.000 --> 1:59:50.000\n There does seem to be some properties of what some may call like toxicity or derision and mockery and those kinds of things. You know, some folks have criticized this, right, that Bitcoin maximalism is not necessarily good for the world, even if Bitcoin is good for the world.\n\n1:59:50.000 --> 2:00:05.000\n What are your thoughts about this kind of approach philosophically or practically to the spread of Bitcoin? And is there a way that we can add more love to the world while we add more Bitcoin to the world?\n\n2:00:05.000 --> 2:00:30.000\n That's a great question. I mean, you know, Bitcoin is sort of what you make of it. So you can define your own path as you advocate for Bitcoin or don't for that matter. So my chosen approach is the approach you see here, which I try to minimize the amount of sort of harshness or mockery, although I've been known to be mean on Twitter too, you know.\n\n2:00:30.000 --> 2:00:57.000\n Well, Twitter is a specific, sorry to interrupt, is a specific medium where this takes its worst form. So I'm learning, listen, I'm actually because of this podcast, but in general, I'm part of different communities. And some are full of like unabashed love. And some are like, what I experienced on Twitter, the Bitcoin community at first, I was off put in terms of the intensity, the mockery.\n\n2:00:57.000 --> 2:00:58.000\n I bet.\n\n2:00:58.000 --> 2:01:19.000\n The layers of lol, like the layers of not taking anything seriously. And I think there's power to that. There's freedom to that. I appreciate it. I have respect for it. But it's not my thing on Twitter. It's just not the way I enjoy communicating on Twitter.\n\n2:01:19.000 --> 2:01:46.000\n I retired from Twitter. I hit 100,000 followers and then I retired. So I'm free now. I don't have to tweet anymore. It's great. But I totally can see the point. I wish that Bitcoiners were gentler in their approach. Not all Bitcoiners are like that. Of course, there's, you know, 50 to 100 million of them worldwide, and a few 10s of 1000s on Twitter. So I'm not going to claim that they're necessarily representative.\n\n2:01:46.000 --> 2:02:04.000\n The toxicity, though, is kind of a learned habit, because Bitcoin has had so many episodes where strong willed institutions, billionaires, the dice are pretty toxic, you could say, right? I'm basically mocking critics of Bitcoin.\n\n2:02:04.000 --> 2:02:12.000\n But at the same time, you're saying that the criticism has been predictable and repeatable, and it's been the same throughout.\n\n2:02:12.000 --> 2:02:41.000\n Yeah, and that's a pretty dismissive thing to say, right? That I can reduce you to an algorithm with 11 permutations. But the thing to remember, I guess, is that some of the best funded companies in the Bitcoin space, the most powerful miners, billionaires have tried to change and coopt and alter Bitcoin to shape it to their liking.\n\n2:02:41.000 --> 2:03:00.000\n And without these incredibly hardcore sort of high priests of the Bitcoin protocol, it would have been hopeless, hopelessly malleated in all number of ways. And so there is a reason why someone would be incredibly protective of Bitcoin.\n\n2:03:00.000 --> 2:03:19.000\n Does that justify immense toxicity on social media? Probably not. But it's a leaderless protocol. So the whole point is that it's money for enemies. And, you know, some of the Bitcoin maximalists came for me too, when I made suggestions that they didn't like.\n\n2:03:19.000 --> 2:03:33.000\n But, you know, I'm happy to use it, the protocol, because I know that that transaction will be final, regardless of how odious my counterparty is, or how, you know, politically disfavored their opinions are.\n\n2:03:33.000 --> 2:03:58.000\n See, I mean, and this is where there could be disagreements, but I think you have to think about what's effective as a defense mechanism of strong ideas. And I personally think that, like, kindness and thoughtfulness is much more effective because it lets the idea shine.\n\n2:03:58.000 --> 2:04:07.000\n As opposed to the personality of the individual humans overriding it. But there's debates on this, you know.\n\n2:04:07.000 --> 2:04:18.000\n I mean, I take your side on that. I think a patient and careful approach is the way to go. Now, do all critics deserve good faith engagement? No, I would say.\n\n2:04:18.000 --> 2:04:30.000\n A lot of critics of Bitcoin operate in extreme bad faith. And the reason why is because we're not just talking about technical questions. In fact, most of this conversation has not been technical, it's been political.\n\n2:04:30.000 --> 2:04:49.000\n Because Bitcoin is an intensely political idea. And so a lot of people are predisposed to totally hate it, and to wish, you know, death on Bitcoiners. I mean, there's a professor at GW, I saw earlier this week, that was musing about getting all the Bitcoiners on a boat and sinking it.\n\n2:04:49.000 --> 2:05:04.000\n Like, in what other context would a, you know, upstanding professor muse about mass murder? But in the context of Bitcoin, it's sort of okay, you know, within his peers, because you're talking about something that most people don't like.\n\n2:05:04.000 --> 2:05:21.000\n You know, it's a concept that's alien to them, that doesn't jive with the way they see the world. And so because it's so, you know, pitched from a political perspective, there's a lot of critics, as well as defenders that operate in bad faith, I would say.\n\n2:05:21.000 --> 2:05:29.000\n But that's the nature of the beast. It's because we're proposing a very disruptive thing. And there are people that would be disrupted by it.\n\n2:05:29.000 --> 2:05:48.000\n You wrote a blog post titled On Writing. You're, I think, an excellent writer. So let me ask, what does it take to be a good writer? What does it take to write some of the blog posts you've written?\n\n2:05:48.000 --> 2:06:00.000\n Sort of condense set of ideas in your head, the mess that's probably in your head and putting down on paper in a way that communicates the idea clearly and powerfully.\n\n2:06:00.000 --> 2:06:25.000\n So that was basically the point of the blog post is that being an impressive writer is different from being an effective writer. You know, so I think the answer to your question is humility, basically. So I think if you let pride and vanity seep into your writing, then you risk creating a very noisy signal.\n\n2:06:25.000 --> 2:06:44.000\n You know, creating a very inefficient channel for communicating literal neural arrangements from your brain to someone else's brain. And that's what I think about when I write is like, wow, I have the power to, at scale, change the literal physical composition of people's brains, right, to rewire them.\n\n2:06:44.000 --> 2:07:07.000\n If I make an idea that's so persuasive, that's so sticky, if I coin a phrase that is so pithy, then I can alter their brain. That's crazy. I mean, you're letting someone reach into your head and like, mess with it a little bit. That's unbelievable. And that's like a superpower. And if you could do that to 100,000 people at once, how powerful is that, right?\n\n2:07:07.000 --> 2:07:14.000\n You mentioned Descartes, I think, therefore I am. That's like literally rewired millions of brains throughout history.\n\n2:07:14.000 --> 2:07:38.000\n I mean, that's one of the most powerful, like, cogito urgo sum, one of the most powerful phrases ever written. And that sent a zillion philosophy undergraduates down a rabbit hole of skepticism that some of them didn't make it out of, you know? And they're convinced that, you know, the brain in the vat theory is true, and there's no way to know, you know, what our tangible experiences.\n\n2:07:38.000 --> 2:08:07.000\n But yeah, so that's the beauty of writing. And the thing that interferes with that is our pride, our desire to, you know, impress people and, you know, look good to them and show off our vocab and stuff. And that was the point of that piece is that I went on this journey where I eventually realized that I don't know if I'm any better of a writer for having realized it, but I think that is a necessary condition.\n\n2:08:07.000 --> 2:08:19.000\n So does that mean there's a value to striving for simplicity in the words, as opposed to, I mean, complexity?\n\n2:08:19.000 --> 2:08:30.000\n I think so, for sure. And we deal with complex topics all the time in crypto. And that's always a huge red flag for me. I mean, if you can't explain something simply, do you understand it, you know?\n\n2:08:30.000 --> 2:08:31.000\n Yeah.\n\n2:08:31.000 --> 2:08:53.000\n So if you're talking about something that complex, if you can't find simple ways to discuss it, my presumption is that you're actually obfuscating the truth. And this is what Orwell railed against with political language. You know, he really hated political language, because he felt that its authors were using deliberate obfuscation.\n\n2:08:53.000 --> 2:09:08.000\n And, you know, he hated euphemisms. And I hate euphemisms, too. You know, I much prefer, you know, forthrightness and clarity of thought. But most people when they write, don't really endeavor to be particularly clear.\n\n2:09:08.000 --> 2:09:29.000\n They might be writing to show off their startup, or, you know, to demonstrate to people how cool they are, or how well read they are, you know, they're displaying, it's like a peacock style display. What fraction of people write to actually communicate meaning? Small fraction.\n\n2:09:29.000 --> 2:09:42.000\n It's especially difficult because what I've detected is something in us humans as readers assign more credibility to people that obfuscate.\n\n2:09:42.000 --> 2:09:59.000\n So, like, simple, clear communication of an idea is not, like, the immediate reaction is not one where we assign credibility to the person. Like, that was brilliant.\n\n2:09:59.000 --> 2:10:13.000\n There's a lot of people that I kind of listened to without really understanding what the heck they're talking about, but it sounds musical and smart. And then I see a lot of folks assigning credibility to that person.\n\n2:10:13.000 --> 2:10:37.000\n And it's unfortunate. It's unfortunate that there's that tension as a reader, that we appreciate the beauty and power of, like, complex weaving of words without assigning as much value to, like, actual clear communication of an idea.\n\n2:10:37.000 --> 2:10:54.000\n And I'm always skeptical in speech as well. When someone will describe someone as articulate, I'm always immediately skeptical of the value of what that person is saying. Because if you articulate, you can make bad ideas sound very acceptable and great.\n\n2:10:54.000 --> 2:11:08.000\n And Noam Chomsky has said this before, as a way to defend the way he speaks. He said that, like, he's suspicious of charismatic people because they can basically sell any kind of idea.\n\n2:11:08.000 --> 2:11:17.000\n He speaks in a very monotone and boring way so that whatever the value his ideas have, they'll shine through. There's something to that.\n\n2:11:17.000 --> 2:11:28.000\n I love that. But it's a difficult journey. It's a difficult path because then, I think it's the right path because ultimately you focus on the quality of your ideas and in the long term that wins.\n\n2:11:28.000 --> 2:11:30.000\n I agree.\n\n2:11:30.000 --> 2:11:47.000\n Just by way of advice, is there, if people are interested in Bitcoin or cryptocurrency, in your work, what are good books or resources on Bitcoin from you and from others that you can recommend that in your own journey helped you or you've seen help others?\n\n2:11:47.000 --> 2:12:05.000\n Well, it's very easy. It's much easier today to make the Bitcoin journey because the quality of content is so much better than it was when I started. I mean, when I learned about Bitcoin, there was the Bitcoin Wiki and the Bitcoin Stack Exchange and the subreddit and that was kind of it.\n\n2:12:05.000 --> 2:12:13.000\n And you had to just pick up everything. The economic theory hadn't really been worked out very much. So you had to pick everything up from scratch.\n\n2:12:13.000 --> 2:12:22.000\n The good news is that there's a huge abundance of content. And that's actually one of Bitcoin's greatest strengths is that people are totally inspired to write about it.\n\n2:12:22.000 --> 2:12:33.000\n And it's almost a rite of passage at this point if you're like a Bitcoin thinker to have your book. I don't have a book yet. I would love to recommend my book. I haven't written one.\n\n2:12:33.000 --> 2:12:34.000\n Do you think about writing a book?\n\n2:12:34.000 --> 2:12:45.000\n Yeah, I think it's my duty. 100%. Everyone that has created a lot of Bitcoin content probably should condense it into a book to give it an enduring status.\n\n2:12:45.000 --> 2:13:08.000\n It's interesting because you mentioned block size wars and you've written on a lot of different topics. So you could both write like a big like sapient style book about Bitcoin or cryptocurrency, right? But you can also write a book on each like a specific thing.\n\n2:13:08.000 --> 2:13:23.000\n And now that you put pressure on yourself and talk about simplicity, right? Where do you lean on those different book journeys that you might take on? Do you have in you eventually like a Bitcoin book?\n\n2:13:23.000 --> 2:13:44.000\n I mean, I tallied up the words that I wrote in the last couple years on Bitcoin. It's like over 100,000 words a year. So that's two novels there. But yeah, I think I do. I think there's so much underexplored space in Bitcoin. I mean, a systematic interpretation of Satoshi's writings, for instance.\n\n2:13:44.000 --> 2:14:00.000\n And a lot of people don't want anyone to do that because they don't want it to have these religious overtones where you're engaging in interpretation. But that's something that should be done. There's a lot of Bitcoin histories that haven't been written.\n\n2:14:00.000 --> 2:14:20.000\n There was a great Bitcoin history recently published that's this is one of my recommendations is on the block size war by Jonathan beer, who runs probably the best research desk in the industry. So there's huge amounts of history that has transpired that hasn't been chronicled.\n\n2:14:20.000 --> 2:14:37.000\n And some of the accounts are indifferent. You know, they're often written by outsiders, you know, journalists that maybe don't fully engage with the Bitcoin system. But if you think the humans are interesting in the story to, of course, they're the most interesting thing.\n\n2:14:37.000 --> 2:14:52.000\n You know, I mean, Bitcoin itself doesn't really change that much. It's kind of this cold, you know, protocol that just sort of takes along with the characters are just fascinating. I mean, and there's so many unbelievable characters in the Bitcoin story. Unbelievable.\n\n2:14:52.000 --> 2:15:09.000\n Yeah, that's the cool thing about Bitcoin and cryptocurrency and just internet is like the weirdos, the brilliant weirdos, like, all the people in in the stuff that's already established are boring. Like economics professors are all boring, right?\n\n2:15:09.000 --> 2:15:22.000\n But the interesting people, the wild ones are, are the ones that are innovating on in the crypto space, which is, you know, that's where the dangerous weirdos are, and the exciting, brilliant weirdos.\n\n2:15:22.000 --> 2:15:42.000\n Well, you had to be kind of crazy to adopt Bitcoin in the first sort of five years of its life. So there's an adverse selection element there. I don't know if that's an uncharitable way to put it, but like, some of Bitcoin's earliest evangelists are not the evangelists I would have chosen, but they're the ones that we got.\n\n2:15:42.000 --> 2:15:52.000\n It's the one we got. But is there is there resources? You're basically saying, just throw a dart. And most books are going to be good? Or is there something that stands out to you?\n\n2:15:52.000 --> 2:16:17.000\n I mean, your average book is, you know, terrible, for sure. But not on Bitcoin, specifically, but just in general. It depends whether you like the computer science, the economics, or the history. But my recommendations would be, you know, obviously, the Bitcoin white paper, that's, and Satoshi's complimentary writings, that's very important is to try and understand the intentions behind the system.\n\n2:16:17.000 --> 2:16:35.000\n And also to understand the system without having your view colored by some third party's description of it. Most descriptions of Bitcoin are really bad. So just go to the originals, go to the Hal Finney's post, Satoshi's post on Bitcoin talk, there's a huge amount of lucidity there.\n\n2:16:35.000 --> 2:16:44.000\n And actually, most of our questions about Bitcoin today that we have a decade later were really answered in those earliest days. People just don't know it.\n\n2:16:44.000 --> 2:16:54.000\n The canonical economic work relating to Bitcoin, a lot of people don't like it. I think it's fine, would be the Bitcoin standard.\n\n2:16:54.000 --> 2:16:57.000\n A lot of people don't like it. I just read it. It's good. I like it.\n\n2:16:57.000 --> 2:17:15.000\n I think it's a good description of sort of the Austrian perspective, and then how it relates to Bitcoin. There isn't that much about Bitcoin in there. But I think the point is, once you've understood, you know, Saifedean's view of monetary policy, Bitcoin makes a ton of sense, you don't actually need to argue for it that much.\n\n2:17:15.000 --> 2:17:35.000\n So the Bitcoin standard is a good introduction to sort of the orthodox thought in Bitcoin. There's a more recent book called Layered Money, which I liked by Nick Bhatia, which goes into more depth about what I was talking about early in the conversation, the layered approach to scaling.\n\n2:17:35.000 --> 2:17:46.000\n And that's a really critical thing to understand. Then technical books about Bitcoin. I like Grokking Bitcoin, which is a very computer science heavy one.\n\n2:17:46.000 --> 2:18:02.000\n There's a good textbook called Bitcoin and Cryptocurrency Technologies by Arvind Narayan. I think he's a Princeton computer science professor, which is really good at building intuition.\n\n2:18:02.000 --> 2:18:14.000\n Antonopoulos's books, Mastering Bitcoin are good. Then there's like simpler intuition building books that aren't hardcore on the economics or the protocol design.\n\n2:18:14.000 --> 2:18:25.000\n So you have like Inventing Bitcoin by Jan Pritzker, which is good. You have Bitcoin Clarity by Kiara Bakkers. As you can tell, I have like a, my bookshelf is like mostly Bitcoin books.\n\n2:18:25.000 --> 2:18:33.000\n Well, that's a good selection. And of course, like you said, your writing and your book that comes out this year or next year?\n\n2:18:33.000 --> 2:18:49.000\n I think I'm going to need 18 months. But most of the good Bitcoin content is just online, on Medium, on Twitter. So it's a decentralized consensus kind of thing.\n\n2:18:49.000 --> 2:19:05.000\n What about book recommendations that you could give people who love these outside of the world of crypto that maybe had an impact on your life? Fiction, like sci fi, maybe technical, philosophical. Is there something you would recommend that people might read?\n\n2:19:05.000 --> 2:19:19.000\n I really liked the three body problem. But that's a really hackneyed recommendation. But it really made me think and I like the hard sci fi, you know, the commitment to science and science fiction. So I thought it was very clever.\n\n2:19:19.000 --> 2:19:30.000\n Is there one? Is there something that really annoys you? In terms of the opposite of hard sci fi, like that doesn't get stuff right movies?\n\n2:19:30.000 --> 2:19:48.000\n I mean, I have issues when I watch like, ostensibly sci fi or fantasy films that are not consistent about this, the rules for the universe that they've laid out, or where there's impossible to comprehend, like Christopher Nolan's latest film.\n\n2:19:48.000 --> 2:19:58.000\n Oh, yeah. You needed like a spreadsheet to understand that. Yeah. I trust that maybe he was consistent about the rules of his universe. I just did not understand it at all.\n\n2:19:58.000 --> 2:20:22.000\n In that sense, I really probably one of my favorites is 2001 Space Odyssey. It's so obviously it's many, many decades ago, but it's quite brilliant in both its consistency and the depth of thought put into like, what the technology would actually be.\n\n2:20:22.000 --> 2:20:48.000\n Not in like visually, not in kind of silly graphical ways, but in terms of function and its impact on humanity. So, but that takes care. That takes a lot of work and that takes genius actually, which is why Kubrick is regarded for what he is.\n\n2:20:48.000 --> 2:21:08.000\n What advice? You've taken an interesting journey through your life. You were at Fidelity, a philosophy major. You're now one of the seminal minds in the world of Bitcoin and cryptocurrency. Who the hell knows what the next 5, 10 years looks for you.\n\n2:21:08.000 --> 2:21:19.000\n If you were to give advice to somebody young today, making their way through life, making a career, what kind of advice would you give?\n\n2:21:19.000 --> 2:21:41.000\n See, the problem with advice is that in a world where so much of success is defined by luck and serendipity is that the advice givers often don't know why they've been successful, right? And so they might say, you know, I was wearing a green tie on the day of my job interview and so you should go out and wear green ties.\n\n2:21:41.000 --> 2:21:59.000\n And so they might just get the causality completely wrong, right? I mean, I'm not going to claim that I'm super successful yet, but see, that's the problem is that I don't think my journey is replicable necessarily. So, you know, who am I to give advice?\n\n2:21:59.000 --> 2:22:22.000\n Although the one thing I will say is that the thing I did right was to become completely obsessed with a domain I found really interesting and held promise. Like if I had been really interested in like Magic the Gathering, I wouldn't have been able to like do much with that aside from build like a killer, you know, card pack or whatever.\n\n2:22:22.000 --> 2:22:48.000\n And I wasn't afraid to, you know, really put myself out there and, you know, float my thoughts online and see how people reacted to them. Even if I said stuff that was completely erroneous or wrong all the time, the rewards to writing and just publishing content are immense, as you know, obviously, it's the most high leverage activity I think most young people have available to them.\n\n2:22:48.000 --> 2:23:03.000\n And I was very lucky and I benefited from a lot of favorable coincidences, a lot of people that took a chance on me. And if I had more time, I would sit here and name them.\n\n2:23:03.000 --> 2:23:23.000\n Is there something in your actions that made you more open to the benefits of luck? Sort of, you know, luck can bring you a lot of positive and negative things. So saying you're lucky means you were able to ride the wave of whatever positive stuff luck brought you.\n\n2:23:23.000 --> 2:23:43.000\n Well, that's right, you have to put yourself in a position to be lucky. And most people don't. So you just have to get as many shots on goal as possible. And, of course, luck plays an undeniable role in any career path, for sure. But you do have to make yourself available to it.\n\n2:23:43.000 --> 2:23:58.000\n And you have to take a ton of chances. But yeah, that's the problem with advice. It's just so hard to replicate it. So I find it illegitimate most of the time.\n\n2:23:58.000 --> 2:24:01.000\n You heard it here, kids, don't listen to anything Nick just said.\n\n2:24:01.000 --> 2:24:02.000\n Exactly.\n\n2:24:02.000 --> 2:24:12.000\n Wear a green tie to your interviews, it'll work out well. Do you think there's a meaning or reason to any of this, this existence, this life?\n\n2:24:12.000 --> 2:24:34.000\n Well, we make our own meaning, for sure. I find a huge amount of meaning in what I do. I find it beautiful, I feel very lucky and blessed to be in the line of work that I'm in, you know, to have your hobby and your passion and your job just be a completely integrated thing. So that's where I find meaning.\n\n2:24:34.000 --> 2:24:50.000\n But you're just a bag of like cells and bacteria that eventually dissipates, dies, and it goes into the ground and disappears back into the universe. I mean, that doesn't make any sense.\n\n2:24:50.000 --> 2:25:08.000\n Well, that may be true. But I find the sublime in things like Bitcoin. I find it incredibly inspiring to work on it. I believe it's 100 year plus project. And, you know, it stirs those aesthetic emotions in you, as I'm sure your work does.\n\n2:25:08.000 --> 2:25:09.000\n So you find it beautiful?\n\n2:25:09.000 --> 2:25:14.000\n Absolutely. Absolutely. And inspiring more than just beautiful.\n\n2:25:14.000 --> 2:25:18.000\n So you have hope for human civilization and Bitcoin as part of that hope?\n\n2:25:18.000 --> 2:25:42.000\n Yeah, it's a very optimistic view. And people accuse us of being pessimists and saying that we are, you know, rooting for the collapse of civilization. Completely false. Bitcoiners are wildly optimistic, because they believe that you can monetize a completely new system from scratch and compete with the strongest superpower in the military and the dollar and everything that goes with that.\n\n2:25:42.000 --> 2:25:52.000\n That's the craziest, most ludicrously optimistic proposition imaginable. So I think Bitcoiners are the most optimistic people out there.\n\n2:25:52.000 --> 2:26:18.000\n I don't think there's a better way to end it on that hopeful vision of human civilization. Nick, I've heard a lot of amazing things about you. I was binge watching your interviews, binge reading your blogs, fell in love with your work. You're a good dude. Inspiring, brilliant. Thank you so much for wasting all your valuable time with me today.\n\n2:26:18.000 --> 2:26:20.000\n My absolute pleasure.\n\n2:26:20.000 --> 2:26:32.000\n Thanks for listening to this conversation with Nick Carter, and thank you to The Information, Athletic Greens, Four Sigmatic, and Blinkist. Check them out in the description to support this podcast.\n\n2:26:32.000 --> 2:26:38.000\n And now, let me leave you with some words about freedom and beauty from Stephen King.\n\n2:26:38.000 --> 2:26:52.000\n Some birds are not meant to be caged, that's all. Their feathers are too bright, their songs too sweet and wild. So you let them go, or when you open the cage to feed them, they somehow fly out past you.\n\n2:26:52.000 --> 2:27:03.000\n And the part of you that knows it was wrong to imprison them in the first place rejoices. But still, the place where you live is that much more drab and empty for their departure.\n\n2:27:03.000 --> 2:27:14.000\n Thank you for listening, and hope to see you next time.\n\n"
}