{
  "title": "Francis Collins: National Institutes of Health (NIH) | Lex Fridman Podcast #238",
  "id": "mRZE-SJShkE",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.460\n The following is a conversation with Francis Collins, director of the NIH, the National\n\n00:05.460 --> 00:12.060\n Institutes of Health, appointed and reappointed to the role by three presidents, Obama, Trump,\n\n00:12.060 --> 00:18.540\n and Biden. He oversees 27 separate institutes and centers, including NIAID, which makes\n\n00:18.540 --> 00:25.900\n him Anthony Fauci's boss. At the NIH, Francis helped launch and led a huge number of projects\n\n00:25.900 --> 00:31.540\n that pushed the frontiers of science, health, and medicine, including one of my favorites,\n\n00:31.540 --> 00:36.600\n the BRAIN Initiative, that seeks to map the human brain and understand how the function\n\n00:36.600 --> 00:43.360\n arises from the neural circuitry. Before the NIH, Francis led the Human Genome Project,\n\n00:43.360 --> 00:49.560\n one of the largest and most ambitious efforts in the history of science. Given all that,\n\n00:49.560 --> 00:54.780\n Francis is a humble, thoughtful, kind man, and because of this, to me, he's one of the\n\n00:54.780 --> 01:01.340\n best representatives of science in the world. He is a man of God, and yet, also a friend\n\n01:01.340 --> 01:08.480\n of the late Christopher Hitchens, who called him, quote, one of the greatest living Americans.\n\n01:08.480 --> 01:13.700\n This is a Lex Friedman podcast. To support it, please check out our sponsors in the description.\n\n01:13.700 --> 01:18.800\n And now, here's my conversation with Francis Collins.\n\n01:18.800 --> 01:23.700\n Science at its best is a source of hope. So for me, it's been difficult to watch, as it\n\n01:23.700 --> 01:28.880\n has during the pandemic, become at times a source of division. What I would love to do\n\n01:28.880 --> 01:34.480\n in this conversation with you is touch some difficult topics, and do so with empathy and\n\n01:34.480 --> 01:39.440\n humility so that we may begin to regain a sense of trust in science, and that it may\n\n01:39.440 --> 01:43.160\n once again become a source of hope. I hope that's okay with you.\n\n01:43.160 --> 01:45.200\n I love the goal.\n\n01:45.200 --> 01:50.800\n Let's start with some hard questions. You called for, quote, thorough, expert driven,\n\n01:50.800 --> 01:56.420\n and objective inquiry into the origins of COVID 19. So let me ask, is there a reasonable\n\n01:56.420 --> 02:00.200\n chance that COVID 19 leaked from a lab?\n\n02:00.200 --> 02:06.240\n I can't exclude that. I think it's fairly unlikely. I wish we had more ability to be\n\n02:06.240 --> 02:11.720\n able to ask questions of the Chinese government and learn more about what kind of records\n\n02:11.720 --> 02:17.360\n might have been in the lab that we've never been able to see. But most likely, this was\n\n02:17.360 --> 02:22.560\n a natural origin of a virus, probably starting in a bat, perhaps traveling through some other\n\n02:22.560 --> 02:27.560\n intermediate, yet to be identified host, and finding its way into humans.\n\n02:27.560 --> 02:31.880\n Is answering this question within the realm of science, do you think, will we ever know?\n\n02:31.880 --> 02:37.720\n I think we might know if we find that intermediate host. And there has not yet been a thorough\n\n02:37.720 --> 02:42.760\n enough investigation to say that that's not going to happen. And remember, it takes a\n\n02:42.760 --> 02:49.240\n while to do this. With SARS, it was 14 years before we figured out it was the civet cat\n\n02:49.240 --> 02:52.920\n that was the intermediate host. With MERS, it was a little quicker to discover it was\n\n02:52.920 --> 02:58.480\n the camel. With SARS COVID 2, there's been some looking, but especially now with everything\n\n02:58.480 --> 03:03.060\n really tense between the US and China, if there's looking going on, we're not getting\n\n03:03.060 --> 03:05.040\n told about it.\n\n03:05.040 --> 03:07.840\n Do you think it's a scientific question or a political question?\n\n03:07.840 --> 03:12.420\n It's a scientific question, but it has political implications.\n\n03:12.420 --> 03:17.240\n So the world is full of scientists that are working together, but in the political space,\n\n03:17.240 --> 03:24.300\n in the political science space, there's tensions. What is it like to do great science in a time\n\n03:24.300 --> 03:27.960\n of a pandemic when there's political tensions?\n\n03:27.960 --> 03:35.880\n It's very unfortunate. Pasteur said science knows no one country. He was right about that.\n\n03:35.880 --> 03:42.600\n My whole career in genetics, especially, has depended upon international collaboration between\n\n03:42.600 --> 03:48.760\n scientists as a way to make discoveries, get things done. Scientists, by their nature,\n\n03:48.760 --> 03:55.160\n like to be involved in international collaborations. The Human Genome Project, for heaven's sake,\n\n03:55.160 --> 03:59.920\n 2,400 scientists in six countries working together, not worrying who is going to get\n\n03:59.920 --> 04:04.200\n the credit, giving all the data away. I was the person who was supposed to keep all that\n\n04:04.200 --> 04:08.840\n coordinated. It was a wonderful experience, and that included China. That was sort of\n\n04:08.840 --> 04:15.080\n their first real entry into a big international, big science kind of project, and they did\n\n04:15.080 --> 04:19.560\n their part. It's very different now.\n\n04:19.560 --> 04:26.760\n Continuing the line of difficult questions, especially difficult ethical questions. In\n\n04:26.760 --> 04:32.880\n 2014, U.S. put a hold on gain of function research in response to a number of laboratory\n\n04:32.880 --> 04:38.880\n biosecurity incidents, including anthrax, smallpox, and influenza. In December 2017,\n\n04:38.880 --> 04:44.480\n NIH lifted this ban because, quote, gain of function research is important in helping\n\n04:44.480 --> 04:49.820\n us identify, understand, and develop strategies and effective countermeasures against rapidly\n\n04:49.820 --> 04:56.440\n evolving pathogens that pose a threat to public health. All difficult questions have arguments\n\n04:56.440 --> 05:03.400\n on both sides. Can you argue the pros and cons of gain of function research with viruses?\n\n05:03.400 --> 05:11.200\n I can, and first let me say this term, gain of function, is causing such confusion that\n\n05:11.200 --> 05:16.760\n I need to take a minute and just sort of talk about what the common scientific use of that\n\n05:16.760 --> 05:22.600\n term is and where it is very different when we're talking about the current oversight\n\n05:22.600 --> 05:28.820\n of potentially dangerous human pathogens. As you know, in science, we're doing gain\n\n05:28.820 --> 05:36.440\n of function experiments all the time. We support a lot of cancer immunotherapy at NIH. Right\n\n05:36.440 --> 05:41.400\n here in our clinical center, there are trials going on where people's immune cells are taken\n\n05:41.400 --> 05:46.720\n out of their body, treated with a genetic therapy that revs up their ability to discover\n\n05:46.720 --> 05:52.880\n the cancer that that patient currently has, maybe even at stage four, and then give them\n\n05:52.880 --> 05:59.020\n back as those little ninja warriors go after the cancer. It sometimes works dramatically.\n\n05:59.020 --> 06:03.220\n That's gain of function. You gave that patient a gain in their immune function that may have\n\n06:03.220 --> 06:08.580\n saved their life. We've got to be careful not to say, oh, gain of function is bad. Most\n\n06:08.580 --> 06:15.080\n of what we do in science that's good involves quite a bit of that. We are all living with\n\n06:15.080 --> 06:18.920\n gains of function every day. I have a gain of function because I'm wearing these eyeglasses.\n\n06:18.920 --> 06:25.800\n Otherwise, I would not be seeing you as clearly. I'm happy for that gain of function. That's\n\n06:25.800 --> 06:30.560\n where a lot of confusion has happened. The kind of gain of function which is now subject\n\n06:30.560 --> 06:36.960\n to very rigorous and very carefully defined oversight is when you are working with an\n\n06:36.960 --> 06:43.000\n established human pathogen that is known to be potentially causing a pandemic and you\n\n06:43.000 --> 06:50.240\n are enhancing or potentially enhancing its transmissibility or its virulence. We call\n\n06:50.240 --> 07:01.040\n that EPPP, enhanced potential pandemic pathogen. That requires this very stringent oversight\n\n07:01.040 --> 07:08.520\n worked out over three years by the National Science Advisory Board on Biosecurity that\n\n07:08.520 --> 07:14.560\n needs to be looked at by a panel that goes well beyond NIH to decide are the benefits\n\n07:14.560 --> 07:21.840\n worth the risks in that situation. Most of the time, it's not worth the risk. Only three\n\n07:21.840 --> 07:28.440\n times in the last three or four years have experiments been given permission to go forward.\n\n07:28.440 --> 07:35.680\n They were all on influenza. So I will argue that if you're worried about the next pandemic,\n\n07:35.680 --> 07:40.160\n the more you know about the coming enemy, the better chance you have to recognize when\n\n07:40.160 --> 07:47.660\n trouble is starting. And so if you can do it safely, studying influenza or coronaviruses\n\n07:47.660 --> 07:53.720\n like SARS, MERS, and SARS CoV2 would be a good thing to be able to know about. But you\n\n07:53.720 --> 07:59.600\n have to be able to do it safely because we all know lab accidents can happen. I mean,\n\n07:59.600 --> 08:05.280\n look at SARS where there have been lab accidents and people have gotten sick as a result. We\n\n08:05.280 --> 08:09.280\n don't want to take that chance unless there's a compelling scientific reason. That's why\n\n08:09.280 --> 08:16.160\n we have this very stringent oversight. The experiments being done at the Wuhan Institute\n\n08:16.160 --> 08:24.800\n of Virology as a subaward to our grant to EcoHealth in New York did not meet that standard\n\n08:24.800 --> 08:29.280\n of requiring that kind of stringent oversight. I want to be really clear about that because\n\n08:29.280 --> 08:34.760\n there's been so much thrown around about it. Was it gain of function? Well, in the standard\n\n08:34.760 --> 08:39.520\n use of that term that you would use in science in general, you might say it was. But in the\n\n08:39.520 --> 08:48.320\n use of that term that applies to this very specific example of a potential pandemic pathogen,\n\n08:48.320 --> 08:55.920\n absolutely not. So nothing went on there that should not have happened based upon the oversight.\n\n08:55.920 --> 09:02.300\n There was an instance where the grantee institution failed to notify us about the result of an\n\n09:02.300 --> 09:07.280\n experiment that they were supposed to tell us where they mixed and matched some viral\n\n09:07.280 --> 09:15.400\n genomes and got a somewhat larger viral load as a result. But it was not EPPP. It was not\n\n09:15.400 --> 09:19.680\n getting into that zone that would have required this higher level of scrutiny. It was all\n\n09:19.680 --> 09:22.920\n bat viruses. These were not human pathogens.\n\n09:22.920 --> 09:29.200\n So they didn't cross a threshold within that gray area that makes for an EPPP?\n\n09:29.200 --> 09:34.860\n They did not. And anybody who's willing to take the time to look at what EPPP means and\n\n09:34.860 --> 09:39.280\n what those experiments were would have to agree with what I just said.\n\n09:39.280 --> 09:43.800\n What is the biggest reason it didn't cross that threshold? Is it because it wasn't jumping\n\n09:43.800 --> 09:50.160\n to humans? Is it because it did not have a sufficient increase in virulence or transmissibility?\n\n09:50.160 --> 09:51.160\n What's your sense?\n\n09:51.160 --> 10:00.960\n EPPP only applies to agents that are known human pathogens of pandemic potential. These\n\n10:00.960 --> 10:07.600\n were all bat viruses derived in the wild, not shown to be infectious to humans. Just\n\n10:07.600 --> 10:11.640\n looking at what happened if you took four different bat viruses and you tried moving\n\n10:11.640 --> 10:17.200\n the spike protein gene from one into one of the others to see whether it would bind better\n\n10:17.200 --> 10:21.280\n to the ACE2 receptor. That doesn't get across that threshold.\n\n10:21.280 --> 10:26.160\n And let me also say, for those who are trying to connect the dots here, which is the most\n\n10:26.160 --> 10:32.600\n troubling part of this, and say, well, this is how SARS CoV2 got started. That is absolutely\n\n10:32.600 --> 10:40.320\n demonstrably false. These bat viruses that were being studied had only about 80% similarity\n\n10:40.320 --> 10:46.080\n in their genomes to SARS CoV2. They were like decades away in evolutionary terms. And it\n\n10:46.080 --> 10:51.600\n is really irresponsible for people to claim otherwise.\n\n10:51.600 --> 10:58.440\n Speaking of people who claim otherwise, Rand Paul, what do you make of the battle of words\n\n10:58.440 --> 11:03.920\n between Senator Rand Paul and Dr. Anthony Fauci over this particular point?\n\n11:03.920 --> 11:09.440\n I don't want to talk about specific members of Congress, but I will say it's really unfortunate\n\n11:09.440 --> 11:17.480\n that Tony Fauci, who is the epitome of a dedicated public servant, has now somehow been targeted\n\n11:17.480 --> 11:23.920\n for political reasons as somebody that certain figures are trying to discredit, perhaps to\n\n11:23.920 --> 11:29.320\n try to distract from their own failings. This never should have happened. Here's a person\n\n11:29.320 --> 11:35.880\n who's dedicated his whole life to trying to prevent illnesses from infectious diseases,\n\n11:35.880 --> 11:43.000\n including HIV in the 1980s and 90s, and now probably the most knowledgeable infectious\n\n11:43.000 --> 11:49.280\n disease physician in the world, and also a really good communicator, is out there telling\n\n11:49.280 --> 11:54.620\n the truth about where we are with SARS CoV2 to certain political figures who don't want\n\n11:54.620 --> 12:00.520\n to hear it, and who are therefore determined to discredit him. And that is disgraceful.\n\n12:00.520 --> 12:06.480\n So with politicians, they often play games with black and white. They try to sort of\n\n12:06.480 --> 12:13.560\n use the gray areas of science and then paint their own picture. But I have a question about\n\n12:13.560 --> 12:19.160\n the gray areas of science. So like you mentioned, gain of function is a term that has very specific\n\n12:19.160 --> 12:25.120\n scientific meaning, but it also has a more general term. And it's very possible to argue\n\n12:25.120 --> 12:31.320\n that the, not to argue, not the way politicians argue, but just as human beings and scientists,\n\n12:31.320 --> 12:38.440\n that there was a gain of function achieved at the Wuhan Institute of Virology, but it\n\n12:38.440 --> 12:44.160\n didn't cross a threshold. I mean, there's a, it's a, but it could have too. So here's\n\n12:44.160 --> 12:50.660\n the thing. When you do these kinds of experiments, unexpected results may be achieved. And that's\n\n12:50.660 --> 12:58.400\n the gray area of science. You're taking risks with such experiments. And I am very uncomfortable\n\n12:58.400 --> 13:03.280\n that we can't discuss the uncertainty in the gray area of this.\n\n13:03.280 --> 13:08.740\n Oh, I'm comfortable discussing the gray area. What I'm uncomfortable with is people deciding\n\n13:08.740 --> 13:14.900\n to define for themselves what that threshold is based on sort of some political argument.\n\n13:14.900 --> 13:21.880\n The threshold was very explicitly laid out. Everybody agreed to that in the basis of this\n\n13:21.880 --> 13:27.440\n three years of deliberation. So that's what it is. If that threshold needs to be reconsidered,\n\n13:27.440 --> 13:32.360\n let's reconsider it, but let's not try to take an experiment that's already been done\n\n13:32.360 --> 13:37.640\n and decide that the threshold isn't what it was, because that really is doing a disservice\n\n13:37.640 --> 13:38.880\n to the whole process.\n\n13:38.880 --> 13:44.240\n I wish there was a discussion, even in response to Rand Paul, I know we're not talking about\n\n13:44.240 --> 13:48.680\n specific senators, but just that particular case, I'm saying stuff here. I wish there\n\n13:48.680 --> 13:55.080\n was an opportunity to talk about, given the current threshold, this is not gain of function.\n\n13:55.080 --> 13:58.400\n But maybe we need to reconsider the threshold and have an action. That's an opportunity\n\n13:58.400 --> 14:02.920\n for discussion about the ethics of gain of function. You said that there was three studies\n\n14:02.920 --> 14:07.760\n that passed that threshold with influenza. That's a fascinating human question, scientific\n\n14:07.760 --> 14:14.920\n question about ethics, because like you said, there's pros and cons. You're taking risks\n\n14:14.920 --> 14:24.960\n here to prevent horribly destructive viruses in the future, but you also are risking creating\n\n14:24.960 --> 14:33.480\n such viruses in the future. With nuclear weapons and nuclear energy, nuclear energy promises\n\n14:33.480 --> 14:40.200\n a lot of positive effects, and yet you're taking risks here. With mutually shared destruction,\n\n14:40.200 --> 14:49.880\n nations possessing nuclear weapons, a lot of people argue that nuclear weapons is the\n\n14:49.880 --> 14:55.960\n reason we've prevented world wars, and yet they also have the risk of starting world\n\n14:55.960 --> 15:01.880\n wars. And this is what we have to be honest about with the benefits and risks of science,\n\n15:01.880 --> 15:06.160\n that you have to make that calculation. What are the pros and what are the cons?\n\n15:06.160 --> 15:10.840\n I'm totally with you, but I want to reassure you, Lex, that this is not an issue that's\n\n15:10.840 --> 15:16.520\n been ignored. That this issue about the kind of gain of function that might result in a\n\n15:16.520 --> 15:22.400\n serious human pathogen has been front and center in many deliberations for a decade\n\n15:22.400 --> 15:28.100\n or more, involved a lot of my time along the way, by the way, and has been discussed publicly\n\n15:28.100 --> 15:34.400\n on multiple occasions, including two major meetings of the National Academy of Sciences,\n\n15:34.400 --> 15:39.480\n getting input from everybody and ultimately arriving at our current framework. Now, we\n\n15:39.480 --> 15:47.480\n actually back in January of 2020, just before COVID 19 changed everything, had planned and\n\n15:47.480 --> 15:55.880\n even charged that same National Science Advisory Board on Biosecurity to reconvene and look\n\n15:55.880 --> 16:00.080\n at the current framework and say, do we have it right? Let's look at the experience over\n\n16:00.080 --> 16:06.320\n those three years and say, is the threshold too easy, too hard? Do we need to reconsider\n\n16:06.320 --> 16:10.920\n it? Let's look at the experience. COVID came along, the members of the board said, please,\n\n16:10.920 --> 16:14.840\n we're all infectious disease experts. We don't have time for this right now. But I think\n\n16:14.840 --> 16:18.920\n the time is right to do this. I'm totally supportive of that. And that should be just\n\n16:18.920 --> 16:23.320\n as public a discussion as you can imagine about what are the benefits and the risks.\n\n16:23.320 --> 16:27.560\n And if somebody decided, ultimately, this came together and said, we just shouldn't\n\n16:27.560 --> 16:31.720\n be doing these experiments under any circumstances. If that was the conclusion, well, that would\n\n16:31.720 --> 16:35.200\n be the conclusion. But it hasn't been so far.\n\n16:35.200 --> 16:42.960\n If we can briefly look out into the next hundred years on this. I apologize for the existential\n\n16:42.960 --> 16:52.200\n questions. But it seems obvious to me that as gain of function type of research and development\n\n16:52.200 --> 16:59.200\n becomes easier and cheaper, it will become greater and greater risk. So if it doesn't\n\n16:59.200 --> 17:07.440\n no longer need to be contained within laboratories of high security, it feels like this is one\n\n17:07.440 --> 17:12.880\n of the greatest threats facing human civilization. Do you worry that at some point in the future\n\n17:12.880 --> 17:18.600\n a leaked manmade virus may destroy most of human civilization?\n\n17:18.600 --> 17:24.760\n I do worry about the risks. And at the moment where we have the greatest control, the greatest\n\n17:24.760 --> 17:30.440\n oversight is when this is federally funded research. But as you're alluding, there's\n\n17:30.440 --> 17:36.040\n no reason to imagine that's the only place that this kind of activity would go on. If\n\n17:36.040 --> 17:42.520\n there was an evil source that wished to create a virus that was highly pathogenic in their\n\n17:42.520 --> 17:49.640\n garage, the technology does get easier. And there is no international oversight about\n\n17:49.640 --> 17:55.000\n this either that you could say has the same stringency as what we have in the United States.\n\n17:55.000 --> 18:03.560\n So yes, that is a concern. It would take a seriously deranged group or person to undertake\n\n18:03.560 --> 18:10.720\n this on purpose, given the likelihood that they too would go down. We don't imagine there\n\n18:10.720 --> 18:16.120\n are going to be bioweapons that only kill your enemies and don't kill you. Sorry, we're\n\n18:16.120 --> 18:24.560\n too much alike for that to work. So I don't see it as an imminent risk. There's lots of\n\n18:24.560 --> 18:31.040\n scary novels and movies written about it. But I do think it's something we have to consider.\n\n18:31.040 --> 18:36.280\n What are all the things that ought to be watched? You may not know that if somebody is ordering\n\n18:36.280 --> 18:44.880\n a particular oligonucleotide from one of the main suppliers, and it happens to match smallpox,\n\n18:44.880 --> 18:51.480\n they're going to get caught. So there is effort underway to try to track any nefarious actions\n\n18:51.480 --> 18:52.480\n that might be going on.\n\n18:52.480 --> 18:55.960\n In the United States or internationally? Is there an international collaboration of try\n\n18:55.960 --> 18:57.440\n to track this stuff?\n\n18:57.440 --> 19:03.560\n There is some. I wish it were stronger. This is a general issue, Lex, in terms of do we\n\n19:03.560 --> 19:09.120\n have a mechanism, particularly when it comes to ethical issues, to be able to decide what's\n\n19:09.120 --> 19:13.720\n allowable and what's not and enforce it. I mean, look where we are with germline genome\n\n19:13.720 --> 19:18.300\n editing for humans, for instance. There is no enforcement mechanism. There's just bully\n\n19:18.300 --> 19:22.000\n pulpits and governments that get to decide for themselves.\n\n19:22.000 --> 19:26.360\n You talked about evil. What about incompetence? Does that worry you? I was born in the Soviet\n\n19:26.360 --> 19:35.200\n Union. My dad, a physicist, worked at Chernobyl. That comes to mind. That wasn't evil. I don't\n\n19:35.200 --> 19:40.120\n know what word you want to put it. Maybe incompetence is too harsh. Maybe it's the inherent incompetence\n\n19:40.120 --> 19:44.800\n of bureaucracy. I don't know. But for whatever reason, there was an accident. Does that worry\n\n19:44.800 --> 19:45.800\n you?\n\n19:45.800 --> 19:50.880\n Of course it does. We know that SARS, for instance, did manage to leak out of a lab\n\n19:50.880 --> 19:56.760\n in China two or three times. At least in some instances, people died, fortunately quickly\n\n19:56.760 --> 20:03.840\n contained. All one can do in that circumstance, because you need to study the virus and understand\n\n20:03.840 --> 20:09.760\n it in order to keep it from causing a broader pandemic, but you need to insist upon the\n\n20:09.760 --> 20:17.680\n kind of biosecurity, the BSL 2, 3, and 4 framework under which those experiments have to be done.\n\n20:17.680 --> 20:22.480\n Certainly at NIH, we're extremely rigorous about that, but you can't count on every human\n\n20:22.480 --> 20:27.840\n being to always do exactly what they're supposed to. There's a risk there, which is another\n\n20:27.840 --> 20:34.200\n reason why if we're contemplating supporting research on pathogens that might be the next\n\n20:34.200 --> 20:39.320\n pandemic, you have to factor that in, not just whether people are going to do something\n\n20:39.320 --> 20:42.500\n that we couldn't have predicted, where all of a sudden they created a virus that's much\n\n20:42.500 --> 20:47.120\n worse without knowing they were going to do that, but also just having an accident. That's\n\n20:47.120 --> 20:54.440\n in the mix when those estimates are done about whether the risk is worth it or not.\n\n20:54.440 --> 20:56.320\n Continuing on line of difficult questions.\n\n20:56.320 --> 20:58.960\n We're going to get to fun stuff after a while.\n\n20:58.960 --> 21:10.660\n We will soon, I promise. You are the director of the NIH. You are Dr. Anthony Fauci's, technically\n\n21:10.660 --> 21:11.720\n his boss.\n\n21:11.720 --> 21:12.720\n Yep.\n\n21:12.720 --> 21:17.920\n You have stood behind him. You have supported him, just like you did already in this conversation.\n\n21:17.920 --> 21:25.160\n It is painful for me to see division and distrust, but many people in politics and elsewhere\n\n21:25.160 --> 21:31.220\n have called for Anthony Fauci to be fired. When there are such calls of distrust in public\n\n21:31.220 --> 21:38.280\n about a leader like Anthony Fauci, who should garner trust, do you think he should be fired?\n\n21:38.280 --> 21:47.960\n Probably not. To do so would be basically to give the opportunity for those who want\n\n21:47.960 --> 21:54.240\n to make up stories about anybody to destroy them. There is nothing in the ways in which\n\n21:54.240 --> 22:02.520\n Tony Fauci has been targeted that is based upon truth. How could we then accept those\n\n22:02.520 --> 22:08.860\n cries for his firing as having legitimacy? It's a circular argument. They've decided\n\n22:08.860 --> 22:14.720\n they don't like Tony, so they make up stuff and they twist comments that he's made about\n\n22:14.720 --> 22:19.620\n things like gain of function, where he's referring to the very specific gain of function that's\n\n22:19.620 --> 22:24.800\n covered by this policy, and they're trying to say he lied to the Congress. That's simply\n\n22:24.800 --> 22:31.000\n not true. They don't like the fact that Tony changes the medical recommendations about\n\n22:31.000 --> 22:36.820\n what to do with COVID 19 over the space of more than a year. They call that flip flopping\n\n22:36.820 --> 22:40.320\n and you can't trust the guy because he says one thing last year and one thing this year.\n\n22:40.320 --> 22:45.620\n Well, the science has changed. Delta variant has changed everything. You don't want him\n\n22:45.620 --> 22:49.520\n to be saying the same thing he did a year ago. That would be wrong now. It was the best\n\n22:49.520 --> 22:53.760\n we could do then. People don't understand that or else they don't want to understand\n\n22:53.760 --> 23:01.400\n it. So when you basically whip up a largely political argument against a scientist and\n\n23:01.400 --> 23:06.520\n hammer at it over and over again to the point where he now has to have 24 seven security\n\n23:06.520 --> 23:11.920\n to protect him against people who really want to do violence to him. For that to be a reason\n\n23:11.920 --> 23:17.600\n to say that then he should be fired is to hand the evil forces the victory. I will not\n\n23:17.600 --> 23:27.160\n do that. Yet there's something difficult I'm going to try to express to you. So it may\n\n23:27.160 --> 23:33.760\n be your guitar playing. It may be something else, but there's a humility to you. It may\n\n23:33.760 --> 23:45.920\n be because you're a man of God. There's a humility to you that garners trust. And when\n\n23:45.920 --> 23:51.400\n you're in a leadership position representing science, especially in catastrophic events\n\n23:51.400 --> 23:59.800\n like the pandemic, it feels like as a leader, you have to go far above and beyond your usual\n\n23:59.800 --> 24:07.080\n duties. And I think there's no question that Anthony Fauci has delivered on his duties,\n\n24:07.080 --> 24:11.840\n but it feels like he needs to go above as a science communicator. And if there's a large\n\n24:11.840 --> 24:20.080\n number of people that are distrusting him, it's also his responsibility to garner their\n\n24:20.080 --> 24:27.400\n trust to gain their trust as a person who's the face of science. Do you, are you torn\n\n24:27.400 --> 24:34.160\n on this? The responsibility of Anthony Fauci of yourself to represent science, not just\n\n24:34.160 --> 24:41.400\n the communication of advising what should be done, but giving people hope, giving people\n\n24:41.400 --> 24:47.320\n trust in science and alleviating division. Do you think that's also responsibility of\n\n24:47.320 --> 24:50.640\n a leader or is that unfair to ask?\n\n24:50.640 --> 24:55.380\n I think the best way you give people trust is to tell them the truth. And so they recognize\n\n24:55.380 --> 24:59.920\n that when you're sharing information, it's the best you've got at that point. And Tony\n\n24:59.920 --> 25:06.920\n Fauci does that at every moment. I don't think him expressing more humility would change\n\n25:06.920 --> 25:12.740\n the fact that they're looking for a target of somebody to blame, to basically distract\n\n25:12.740 --> 25:19.480\n people from the failings of their own political party. Maybe I'm less targeted, not because\n\n25:19.480 --> 25:25.640\n of a difference in the way in which I convey the information. I'm less visible. If Tony\n\n25:25.640 --> 25:31.320\n were out of the scene and I was placed in that role, I'd probably be seeing a ratcheting\n\n25:31.320 --> 25:34.480\n up of that same targeting.\n\n25:34.480 --> 25:42.600\n I would like to believe that if Tony Fauci said that when I originally made recommendations\n\n25:42.600 --> 25:48.320\n not to wear masks, that was given on the, on the, our best available data. And now we\n\n25:48.320 --> 25:54.620\n know that is a mistake. So admit with humility that there's an error. That's not, that's\n\n25:54.620 --> 26:00.520\n not actually correct, but that's a, that's a statement of humility. And I would like\n\n26:00.520 --> 26:07.760\n to believe, despite the attacks, he would win a lot of people over with that. So a lot\n\n26:07.760 --> 26:13.720\n of people, as you're saying, would use that, see that here we go, here's that Dr. Anthony\n\n26:13.720 --> 26:20.880\n Fauci making mistakes. How can we trust them on anything? I believe if he was that public\n\n26:20.880 --> 26:28.240\n display of humility to say that I made an error, that would win a lot of people over.\n\n26:28.240 --> 26:34.680\n That's my, that's kind of my sense to face the fire of the attacks from politics. You\n\n26:34.680 --> 26:40.960\n have to, like politicians will attack no matter what, but the question is the people, to win\n\n26:40.960 --> 26:47.240\n over the people. The biggest concern I've had is that there was this, this stress of\n\n26:47.240 --> 26:53.360\n science that's been brewing and I'm, maybe you can correct me, but I'm a little bit unwilling\n\n26:53.360 --> 27:00.520\n to fully blame the politicians because politicians play their games no matter what. It just feels\n\n27:00.520 --> 27:05.880\n like this was an opportunity to inspire people with the power of science. The development\n\n27:05.880 --> 27:11.440\n of the vaccines, no matter what you think of those vaccines is one of the greatest accomplishments\n\n27:11.440 --> 27:19.360\n in the history of science. And the fact that that's not inspiring, listen, I host a podcast.\n\n27:19.360 --> 27:25.840\n Whenever I say positive stuff about the vaccine, I get to hear a lot of different opinions.\n\n27:25.840 --> 27:31.080\n The fact that I do is a big problem to me because it's an incredible, an incredible\n\n27:31.080 --> 27:38.840\n accomplishment of science. And so I, I, I, I, I'm sorry, but I have to put responsibility\n\n27:38.840 --> 27:44.120\n on the leaders, even if it's not their mistakes. That's what the leadership is. That's what\n\n27:44.120 --> 27:48.640\n leadership is. You take responsibility for the situation. I wonder if there's something\n\n27:48.640 --> 27:56.480\n that could have been done better to give people hope that science will save us as opposed\n\n27:56.480 --> 28:00.840\n to science will divide us.\n\n28:00.840 --> 28:07.120\n I think you have more confidence in the ability to get beyond our current divisions than I\n\n28:07.120 --> 28:14.000\n do after seeing just how deep and dark they have become. Tony Fauci has said multiple\n\n28:14.000 --> 28:20.560\n times the recommendation about not wearing masks was for two reasons, a shortage of masks,\n\n28:20.560 --> 28:26.000\n which were needed in hospitals and a lack of realization early in the course of the\n\n28:26.000 --> 28:34.760\n epidemic that this was a virus that could heavily infect asymptomatic people. As that\n\n28:34.760 --> 28:40.080\n changed, he changed. Now, did he make an error? No, he was making a judgment based on the\n\n28:40.080 --> 28:45.520\n data available at the time, but he certainly made that clear over and over again. It has\n\n28:45.520 --> 28:51.680\n not stopped those who would like to demonize him from saying, well, he just flip flopped.\n\n28:51.680 --> 28:55.480\n You can't trust a guy. He says one thing today and one thing tomorrow.\n\n28:55.480 --> 29:02.800\n Well, masks is a tricky one. So I'm actually early on, I'm a coauthor on a paper, one of\n\n29:02.800 --> 29:09.400\n many, but this was a survey paper overlooking the, the evidence. It's a summary of the evidence\n\n29:09.400 --> 29:17.120\n we have for the effectiveness of masks. It seems that it's difficult to do rigorous scientific\n\n29:17.120 --> 29:18.120\n study on masks.\n\n29:18.120 --> 29:19.120\n It is difficult.\n\n29:19.120 --> 29:26.000\n There's a lot of philosophical and ethical questions I want to ask you, but within this,\n\n29:26.000 --> 29:33.760\n it's back to your words and Anthony Fauci's words. When you're dealing with so much uncertainty\n\n29:33.760 --> 29:40.960\n and so much potential uncertainty about how catastrophic this virus is in the early days,\n\n29:40.960 --> 29:47.800\n and knowing that each word you say may create panic, how do you communicate science with\n\n29:47.800 --> 29:56.520\n the world? It's a philosophical, it's an ethical, it's a practical question. There was a discussion\n\n29:56.520 --> 30:06.480\n about masks a century ago and that too led to panic. So, I mean, I'm trying to put myself\n\n30:06.480 --> 30:10.700\n in the mind, in your mind, in the mind of Anthony Fauci in those early days, knowing\n\n30:10.700 --> 30:17.220\n that there's limited supply of masks. Like, what do you say? Do you fully convey the uncertainty\n\n30:17.220 --> 30:23.960\n of the situation of the, of the challenges of the supply chain? Or do you say that masks\n\n30:23.960 --> 30:32.600\n don't work? That's a complicated calculation. How do you make that calculation?\n\n30:32.600 --> 30:41.060\n It is a complicated calculation. As a scientist, your temptation would be to give a full brain\n\n30:41.060 --> 30:46.080\n dump of all the details of the information about what's known and what isn't known and\n\n30:46.080 --> 30:51.160\n what experiments need to be done. Most of the time that's not going to play well in\n\n30:51.160 --> 30:55.960\n a soundbite on the evening news. So you have to kind of distill it down to a recommendation\n\n30:55.960 --> 31:01.340\n that is the best you can do at that time with the information you've got.\n\n31:01.340 --> 31:08.740\n So you're a man of God. And we'll return to that to talk about some, some also unanswerable\n\n31:08.740 --> 31:15.580\n philosophical questions. But first let's linger on the vaccine because in the, in the religious,\n\n31:15.580 --> 31:19.200\n in the Christian community, there was some hesitancy with the vaccine.\n\n31:19.200 --> 31:20.200\n Still is.\n\n31:20.200 --> 31:27.900\n There's a lot of data showing high efficacy and safety of vaccines, of COVID vaccines,\n\n31:27.900 --> 31:33.120\n but still they are far from perfect as all vaccines are. Can you empathize with people\n\n31:33.120 --> 31:39.000\n who are hesitant to take the COVID vaccine or to have their children take the COVID vaccine?\n\n31:39.000 --> 31:44.980\n I can totally empathize, especially when people are barraged by conflicting information coming\n\n31:44.980 --> 31:50.920\n at them from all kinds of directions. I've spent a lot of my time in the last year trying\n\n31:50.920 --> 31:59.100\n to figure out how to do a better job of listening because I think we have all got the risk of\n\n31:59.100 --> 32:06.240\n assuming we know the basis for somebody's hesitancy. And that often doesn't turn out\n\n32:06.240 --> 32:14.780\n to be what you thought. And the variety of reasons is quite broad. I think a big concern\n\n32:14.780 --> 32:20.180\n is just this sense of uncertainty about whether this was done too fast and that corners were\n\n32:20.180 --> 32:28.100\n cut and there are good answers to that. Along with that, a sense that maybe this vaccine\n\n32:28.100 --> 32:33.920\n will have longterm effects that we won't know about for years to come. And one can say that\n\n32:33.920 --> 32:38.080\n hasn't been seen with other vaccines and there's no particular reason to think this one's going\n\n32:38.080 --> 32:41.980\n to be different than the dozens of others that we have experience with. But you can't\n\n32:41.980 --> 32:49.540\n absolutely say, no, there's no chance of that. So it does come down to listening and then\n\n32:49.540 --> 32:57.460\n trying in a fashion that doesn't convey a message that you're smarter than the person\n\n32:57.460 --> 33:02.580\n you're talking to because that isn't going to help to really address what the substance\n\n33:02.580 --> 33:09.540\n is of the concerns. But my heart goes out to so many people who are fearful about this\n\n33:09.540 --> 33:16.220\n because of all the information that has been dumped on them. Some of it by politicians,\n\n33:16.220 --> 33:24.380\n a lot of it by the internet, some of it by parts of the media that seem to take pleasure\n\n33:24.380 --> 33:31.700\n in stirring up this kind of fear for their own reasons. And that is shameful. I'm really\n\n33:31.700 --> 33:38.220\n sympathetic with the people who are confused and fearful. I am not sympathetic with people\n\n33:38.220 --> 33:44.060\n who are distributing information that's demonstrably false and continue to do so. They're taking\n\n33:44.060 --> 33:54.740\n lives. I didn't realize how strong that sector of disinformation would be. And it's been\n\n33:54.740 --> 34:00.740\n in many ways more effective than the means of spreading the truth. This is going to take\n\n34:00.740 --> 34:06.260\n us into another place. But Lex, if there's something I'm really worried about in this\n\n34:06.260 --> 34:10.980\n country, and it's not just this country, but it's the one I live in, is that we have another\n\n34:10.980 --> 34:20.740\n epidemic besides COVID 19. And it's an epidemic of the loss of the anchor of truth. That truth\n\n34:20.740 --> 34:27.100\n as a means of making decisions, truth as a means of figuring out how to wrestle with\n\n34:27.100 --> 34:33.300\n a question like, should I get this vaccine for myself or my children, seems to have lost\n\n34:33.300 --> 34:42.780\n its primacy. And instead, it's an opinion of somebody who expressed it very strongly,\n\n34:42.780 --> 34:51.440\n or some Facebook post that I read two hours ago. And for those to become substitutes for\n\n34:51.440 --> 34:58.820\n objective truth, not just, of course, for vaccines, but for many other issues, like\n\n34:58.820 --> 35:06.020\n was the 2020 election actually fair? This worries me deeply. It's bad enough to have\n\n35:06.020 --> 35:12.660\n polarization and divisions, but to have no way of resolving those by actually saying,\n\n35:12.660 --> 35:18.180\n okay, what's true here, makes me very worried about the path we're on. And I'm usually an\n\n35:18.180 --> 35:19.180\n optimist.\n\n35:19.180 --> 35:27.220\n Well, to give you an optimistic angle on this, I actually think that the sense that there's\n\n35:27.220 --> 35:35.100\n no one place for truth is just a thing that will inspire leaders and science communicators\n\n35:35.100 --> 35:39.740\n to speak, not from a place of authority, but from a place of humility. I think it's just\n\n35:39.740 --> 35:46.940\n challenging people to communicate in a new way, to be listeners first. I think the problem\n\n35:46.940 --> 35:59.380\n isn't that there's a lot of misinformation. I think that the internet and the world are\n\n35:59.380 --> 36:06.340\n distrustful of people who speak as if they possess the truth with an authoritarian kind\n\n36:06.340 --> 36:12.780\n of tone, which was, I think, defining for what science was in the 20th century. I just\n\n36:12.780 --> 36:20.100\n think it has to sound different in the 21st. In the battle of ideas, I think humility and\n\n36:20.100 --> 36:27.260\n love wins. And that's how science wins, not through having quote unquote truth. Because\n\n36:27.260 --> 36:34.300\n now everybody can just say, I have the truth. I think you have to speak, like I said, from\n\n36:34.300 --> 36:40.480\n humility, not authority. And so it's just challenges our leaders to go back and learn\n\n36:40.480 --> 36:48.260\n to be, pardon my French, less assholes and more kind. And like you said, to listen, to\n\n36:48.260 --> 36:52.580\n listen to the experiences of people that are good people, not the ones who are trying to\n\n36:52.580 --> 36:58.380\n manipulate the system or play a game and so on, but real people who are just afraid of\n\n36:58.380 --> 37:03.700\n uncertainty of hurting those they loved and so on. So I think it's just an opportunity\n\n37:03.700 --> 37:09.020\n for leaders to go back and take a class on effective communication.\n\n37:09.020 --> 37:14.780\n I'm with you on shifting more from where we are to humility and love. That's got to be\n\n37:14.780 --> 37:18.500\n the right answer. That's very biblical, by the way.\n\n37:18.500 --> 37:24.060\n We'll get there. I have to bring up Joe Rogan. I don't know if you know who he is.\n\n37:24.060 --> 37:25.060\n I do.\n\n37:25.060 --> 37:30.460\n He's a podcaster, comedian, fighting commentator, and my now friend.\n\n37:30.460 --> 37:32.700\n And Iver Mecton believer too.\n\n37:32.700 --> 37:38.620\n Yes. That is the question I have to ask you about. He has gotten some flack in the mainstream\n\n37:38.620 --> 37:44.540\n media for not getting vaccinated. And when he got COVID recently, taking Iver Mecton\n\n37:44.540 --> 37:50.380\n as part of a cocktail of treatments. The NIH actually has a nice page on Iver Mecton saying\n\n37:50.380 --> 37:57.100\n quote, there's insufficient evidence to recommend either for or against the use of Iver Mecton\n\n37:57.100 --> 38:02.860\n for the treatment of COVID 19 results from adequately powered, well designed and well\n\n38:02.860 --> 38:07.900\n conducted clinical trials are needed to provide more specific evidence based guidance on the\n\n38:07.900 --> 38:12.500\n role of Iver Mecton in the treatment of COVID 19.\n\n38:12.500 --> 38:17.460\n So let me ask, why do you think there has been so much attack on Joe Rogan and anyone\n\n38:17.460 --> 38:24.980\n else that's talking about Iver Mecton when there's insufficient evidence for or against?\n\n38:24.980 --> 38:30.120\n Well let's unpack that. First of all, I think the concerns about Joe are not limited to\n\n38:30.120 --> 38:37.260\n his taking Iver Mecton. Much more seriously, his being fairly publicly negative about vaccines\n\n38:37.260 --> 38:44.420\n at a time where people are dying. 700,000 people have died from COVID 19 estimates by\n\n38:44.420 --> 38:50.900\n Kaiser or at least 100,000 of those were unnecessary deaths of unvaccinated people. And for Joe\n\n38:50.900 --> 39:00.840\n to promote that further, even as this pandemic rages through our population is simply irresponsible.\n\n39:00.840 --> 39:05.900\n So yeah, the Iver Mecton is just one other twist. Obviously Iver Mecton has been controversial\n\n39:05.900 --> 39:11.540\n for months and months. The reason that it got particular attention is because of the\n\n39:11.540 --> 39:16.740\n way in which it seemed to have captured the imagination of a lot of people and to the\n\n39:16.740 --> 39:21.780\n point where they were taking doses that were intended for livestock and some of them got\n\n39:21.780 --> 39:28.940\n pretty sick as a result from overdosing on this stuff. That was not good judgment. The\n\n39:28.940 --> 39:35.500\n drug itself remains uncertain. There's a recent review that looks at all of the studies of\n\n39:35.500 --> 39:41.540\n Iver Mecton and basically concludes that it probably doesn't work. We are running a study\n\n39:41.540 --> 39:47.660\n right now. I looked at that data this morning in a trial called active six, which is one\n\n39:47.660 --> 39:52.980\n of the ones that my public private partnership is running. We're up to about 400 patients\n\n39:52.980 --> 39:58.820\n who've been randomized to Iver Mecton or placebo and should know perhaps as soon as a month\n\n39:58.820 --> 40:04.620\n from now in a very carefully controlled trial, did it help or did it not? So there will be\n\n40:04.620 --> 40:11.020\n an answer coming back to Joe again. I don't think the fact that he took the Iver Mecton\n\n40:11.020 --> 40:16.140\n and hoping it might work, uh, is that big a knock against him. It's more the conveying\n\n40:16.140 --> 40:21.240\n of we don't trust what science says, which is vaccines are going to save your life. We're\n\n40:21.240 --> 40:25.340\n going to trust what's on the internet that says Iver Mecton and hydroxychloroquine really\n\n40:25.340 --> 40:28.260\n do work, even though the scientific community says probably not.\n\n40:28.260 --> 40:34.080\n So let me push back in that a little bit. So he doesn't, he doesn't say, let's not listen\n\n40:34.080 --> 40:44.020\n to science. He doesn't say the vaccine don't get vaccinated. He says it's okay to ask questions.\n\n40:44.020 --> 40:50.600\n I'm okay with that. How risky is the vaccine for certain populations? What are the benefits\n\n40:50.600 --> 40:57.800\n and risks? There's other friends of Joe and friends of mine, like Sam Harris, who says,\n\n40:57.800 --> 41:04.780\n if you look at the data, it's obvious that the benefits outweigh the risks. And what Joe says\n\n41:04.780 --> 41:11.960\n is yes, but let's still openly talk about risks. And he often brings up anecdotal evidence\n\n41:11.960 --> 41:18.780\n of people who've had, uh, highly negative effects from vaccines. Science is not done\n\n41:18.780 --> 41:24.780\n with anecdotal evidence. And so you could infer a lot of stuff from the way he expresses\n\n41:24.780 --> 41:30.260\n it, but he also communicates a lot of interesting questions. Uh, and that's something maybe\n\n41:30.260 --> 41:36.660\n you can comment on this. You know, there's certain groups that are healthy. They have,\n\n41:36.660 --> 41:41.740\n they're younger, they have, they exercise a lot. They get the all, you know, nutrition\n\n41:41.740 --> 41:48.960\n and all those kinds of things. He shows skepticism on whether it's so obvious that they should\n\n41:48.960 --> 41:55.240\n get vaccinated. And the same is he makes this, he kind of presents the same kind of skepticism\n\n41:55.240 --> 42:07.480\n for kids, for young kids. So with empathy and, uh, you know, listening my Russian ineliquent\n\n42:07.480 --> 42:13.680\n description of what Joe believes, what, what is your kind of response to that? Why should\n\n42:13.680 --> 42:18.320\n certain categories of healthy and young people still get vaccinated? Do you think?\n\n42:18.320 --> 42:22.380\n Well, first just to say it's great for Joe to be a skeptic, to ask questions. We should\n\n42:22.380 --> 42:26.760\n all be doing that. But then the next step is to go and see what the data says and see\n\n42:26.760 --> 42:32.740\n if they're actually answers to those questions. So coming to healthy people, I've done a bunch\n\n42:32.740 --> 42:40.820\n of podcasts besides this one. The one I think I remember most was a podcast with a worldwide\n\n42:40.820 --> 42:48.240\n wrestling superstar. Very nice. He's about six foot six and just absolutely solid muscle.\n\n42:48.240 --> 42:57.800\n And he got COVID and he almost died. And recovering from that, he said, I've got to let my supporters\n\n42:57.800 --> 43:04.320\n know because you can imagine worldwide wrestling fans are probably not big embracers of the\n\n43:04.320 --> 43:13.060\n need for vaccines. And he want, he just turned himself into a spokesperson for the fact that\n\n43:13.060 --> 43:18.920\n this virus doesn't care how healthy you are, how much you exercise, what a great specimen\n\n43:18.920 --> 43:26.520\n you are. It wiped him out. And we see that, you know, the average person in the ICU right\n\n43:26.520 --> 43:31.880\n now with COVID 19 is under age 50. I think there's a lot of people still thinking, Oh,\n\n43:31.880 --> 43:35.080\n it's just those old people in the nursing homes. That's not going to be about me. They're\n\n43:35.080 --> 43:40.680\n wrong. And there are plenty of instances of people who were totally healthy with no underlying\n\n43:40.680 --> 43:46.200\n diseases, taking good care of themselves, not obese exercising who have died from this\n\n43:46.200 --> 43:54.500\n disease. 700 children have died from this disease. Yes. Some of them had underlying\n\n43:54.500 --> 44:00.400\n factors like obesity, but a lot of them did not. So it's fair to say younger people are\n\n44:00.400 --> 44:07.900\n less susceptible to serious illness, kids even less so, and then young adults, but it\n\n44:07.900 --> 44:15.540\n ain't zero. And if the vaccine is really safe and really effective, then you probably want\n\n44:15.540 --> 44:20.240\n everybody to take advantage of that. Even though some are dropping their risks more\n\n44:20.240 --> 44:26.520\n than others, everybody's dropping their risks. Some, are you worried about variants? So looking\n\n44:26.520 --> 44:33.000\n out into the future, what's your vision for all the possible trajectories that this virus\n\n44:33.000 --> 44:40.800\n takes in human society? I'm totally worried about the variants. Delta was such an impressive\n\n44:40.800 --> 44:47.460\n arrival on the scene in all the wrong ways. I mean, it took over the world in the space\n\n44:47.460 --> 44:53.960\n of just a couple months because of its extremely contagious ability. Viruses would be beautiful\n\n44:53.960 --> 44:58.460\n if they weren't terrifying. Yeah, exactly. I mean, this whole story of viral evolution\n\n44:58.460 --> 45:03.360\n scientifically is just amazingly elegant. Anybody who really wanted to understand how\n\n45:03.360 --> 45:09.920\n evolution works in real time, study SARS CoV 2, because it's not just Delta, it's Alpha,\n\n45:09.920 --> 45:16.520\n it's Beta, and it's Gamma, and it's the fact that these sweep through the world's population\n\n45:16.520 --> 45:23.280\n by fairly minor differences in fitness. So the real question many people are wrestling\n\n45:23.280 --> 45:30.280\n is, is Delta it? Is it such a fit virus that nothing else will be able to displace it?\n\n45:30.280 --> 45:37.520\n I don't know. I mean, there's now Delta AY4, which is a variant of Delta that at least\n\n45:37.520 --> 45:43.800\n in the UK seems to be taking over the Delta population as though it's maybe even a little\n\n45:43.800 --> 45:49.320\n more contagious. That might be the first hint that we're seeing something new here. It's\n\n45:49.320 --> 45:55.720\n not a completely different virus. It's still Delta, but it's Delta Plus. You know, the\n\n45:55.720 --> 46:07.480\n big worry is what's out there that is so different that the vaccine protection doesn't work.\n\n46:07.480 --> 46:12.440\n And we don't know how different it needs to be for the vaccine to start working. That's\n\n46:12.440 --> 46:18.120\n the terrifying thing about each of these variants. It's like, it's always a pleasant surprise\n\n46:18.120 --> 46:21.200\n that a vaccine seems to still have efficacy.\n\n46:21.200 --> 46:27.080\n And hooray for our immune system, may I say, because the vaccine immunized you against\n\n46:27.080 --> 46:35.840\n that original Wuhan virus. Now we can see that especially after two doses and even more\n\n46:35.840 --> 46:42.080\n so after a booster, your immune system is so clever that it's also making a diversity\n\n46:42.080 --> 46:47.760\n of antibodies to cover some other things that might happen to that virus to make it a little\n\n46:47.760 --> 46:54.440\n different. And you're still getting really good coverage. Even for beta, which was South\n\n46:54.440 --> 47:00.680\n Africa B1351, which is the most different, it looks pretty good. But that doesn't mean\n\n47:00.680 --> 47:06.200\n it will always be as good as that if something gets really far away from the original virus.\n\n47:06.200 --> 47:11.720\n Now the good news is we would know what to do in that situation. The mRNA vaccines allow\n\n47:11.720 --> 47:19.160\n you to redesign the vaccine like that and to quickly get it through a few thousand participants\n\n47:19.160 --> 47:23.200\n in a clinical trial to be sure it's raising antibodies and then bang, you could go. But\n\n47:23.200 --> 47:28.720\n I don't want to have to do that. There will be people's lives at risk in the meantime.\n\n47:28.720 --> 47:32.240\n And what's the best way to keep that from happening? Well, try to cut down the number\n\n47:32.240 --> 47:37.400\n of infections because you don't get variants unless the virus is replicating in a person.\n\n47:37.400 --> 47:44.200\n So how do we solve this thing? How do we get out of this pandemic? What's like, if you\n\n47:44.200 --> 47:51.080\n had a, like a wand or something, or you could really implement policies, what's the full\n\n47:51.080 --> 47:56.800\n cocktail of solutions here? It's a full cocktail. It's not just one thing. In our own country\n\n47:56.800 --> 48:01.920\n here in the US, it would be getting those 64 million reluctant people to actually go\n\n48:01.920 --> 48:05.840\n ahead and get vaccinated. There's 64 million people who didn't get vaccinated? Adults.\n\n48:05.840 --> 48:13.640\n Yes. Not even counting the kids. 64 million. Isn't that astounding? Get the kids vaccinated.\n\n48:13.640 --> 48:18.240\n Hopefully their parents will see that as a good thing too. Get those of us who are due\n\n48:18.240 --> 48:22.060\n for boosters boosted because that's going to reduce our likelihood of having breakthrough\n\n48:22.060 --> 48:27.600\n infections and keep spreading it. Convince people that until we're really done with this,\n\n48:27.600 --> 48:32.880\n and we're not now, that social distancing and mask wearing indoors are still critical\n\n48:32.880 --> 48:39.200\n to cut down the number of new infections. But of course, that's our country. This is\n\n48:39.200 --> 48:45.400\n a worldwide pandemic. I worry greatly about the fact that low and middle income countries\n\n48:45.400 --> 48:50.480\n have for the most part, not even gotten started with access to vaccines. And we have to figure\n\n48:50.480 --> 48:56.880\n out a way to speed that up because otherwise that's where the next variant will probably\n\n48:56.880 --> 49:01.820\n arrive. And who knows how bad it will be. And it will cross the world quickly as we've\n\n49:01.820 --> 49:05.960\n seen happen repeatedly in the last 22 months.\n\n49:05.960 --> 49:14.540\n I think I'm really surprised, annoyed, frustrated that rapid at home testing from the very beginning\n\n49:14.540 --> 49:20.780\n wasn't a big, big part of the solution. First of all, nobody's against it. That's one huge\n\n49:20.780 --> 49:28.400\n plus for testing. Everybody supports. Second of all, that's what America is good at is\n\n49:28.400 --> 49:33.680\n mask manufacturer stuff, like stepping up, engineers stepping up and really deploying\n\n49:33.680 --> 49:39.680\n it. Plus, without the collection of data is giving people freedom, is giving them information\n\n49:39.680 --> 49:44.040\n and then freedom to decide what to do with that information. It's such a powerful solution.\n\n49:44.040 --> 49:49.520\n I don't understand. Well, now I think the Biden administration is, I think, emphasized\n\n49:49.520 --> 49:54.120\n like the scaling of testing manufacturers. But I just feel like it's an obvious solution.\n\n49:54.120 --> 49:59.480\n Get a test that costs less than a dollar to manufacture, costs less than a dollar to buy.\n\n49:59.480 --> 50:03.980\n And just everybody gets tested every single day. Don't share that data with anyone. You\n\n50:03.980 --> 50:08.280\n just make the decisions. And I believe in the intelligence of people to make the right\n\n50:08.280 --> 50:11.120\n decision to stay at home when the test is positive.\n\n50:11.120 --> 50:15.720\n I am so completely with you on that. And NIH has been smack in the middle of trying to\n\n50:15.720 --> 50:25.440\n make that dream come true. We're running a trial right now in Georgia, Indiana, Hawaii.\n\n50:25.440 --> 50:32.000\n And where is the other one? Oh, Kentucky. Basically blanketing a community with free\n\n50:32.000 --> 50:33.000\n testing.\n\n50:33.000 --> 50:34.000\n That's beautiful.\n\n50:34.000 --> 50:39.100\n And look to see what happens as far as stemming the spread of the epidemic and measuring it\n\n50:39.100 --> 50:43.460\n by wastewater because you can really tell whether you've cut back the amount of infection\n\n50:43.460 --> 50:50.780\n in the community. Yeah, I'm so with you. We got off to such a bad start with testing.\n\n50:50.780 --> 50:55.840\n And of course, all the testing was being done for the first several months in big box laboratories\n\n50:55.840 --> 50:59.940\n where you had to send the sample off and put it through the mail somehow and get the result\n\n50:59.940 --> 51:04.320\n back sometimes five days later after you've already infected a dozen people. It was just\n\n51:04.320 --> 51:08.720\n a completely wrong model. But it's what we had. And everybody was like, oh, we got to\n\n51:08.720 --> 51:13.480\n stick with PCR because if you start using those home tests that are based on antigens,\n\n51:13.480 --> 51:18.280\n lateral flow, probably there's going to be false positives and false negatives. Okay,\n\n51:18.280 --> 51:24.960\n sure. No test is perfect. But having a test that's not acceptable or accessible is the\n\n51:24.960 --> 51:26.220\n worst setting.\n\n51:26.220 --> 51:32.560\n So we, NIH, with some requests from Congress, got a billion dollars to create this program\n\n51:32.560 --> 51:39.040\n called Rapid Acceleration of Diagnostics, RADx. And we turned into a venture capital\n\n51:39.040 --> 51:42.920\n organization, and we invited every small business or academic lab that had a cool idea about\n\n51:42.920 --> 51:47.040\n how to do home testing to bring it forward. And we threw them into what we called our\n\n51:47.040 --> 51:52.600\n shark tank of business experts, engineers, technology people, people who understood how\n\n51:52.600 --> 51:59.760\n to deal with supply chains and manufacturing. And right now today, there are about two million\n\n51:59.760 --> 52:05.600\n tests being done based on what came out of that program, including most of the home tests\n\n52:05.600 --> 52:10.400\n that you can now buy on the pharmacy shelves. We did that. And I wish we had done it faster,\n\n52:10.400 --> 52:15.640\n but it was an amazingly speedy effort. And you're right, companies are really good. Once\n\n52:15.640 --> 52:20.440\n they've got an FDA emergency use authorization, and we helped a lot of them get that, they\n\n52:20.440 --> 52:28.000\n can scale up their manufacturing. I think in December, we should have about 410 million\n\n52:28.000 --> 52:34.080\n tests for that month ready to go. And if we can get one or two more platforms approved,\n\n52:34.080 --> 52:39.400\n and by the way, we are now helping FDA by being their validation lab. If we can get\n\n52:39.400 --> 52:44.880\n a couple more of these approved, we could be in the half a billion tests a month, which\n\n52:44.880 --> 52:47.040\n is really getting where we need to be.\n\n52:47.040 --> 52:52.160\n Wow. Yeah, that's a dream. That's a dream for me. It seems like an obvious solution,\n\n52:52.160 --> 52:57.720\n engineering solution. Everybody's behind it, at least to hope versus division. I love it.\n\n52:57.720 --> 52:58.720\n Yeah.\n\n52:58.720 --> 52:59.720\n A happy story.\n\n52:59.720 --> 53:00.720\n A happy story.\n\n53:00.720 --> 53:02.680\n I was waiting for one.\n\n53:02.680 --> 53:07.480\n Yeah. All right. Well, one last dive into the not happy, but you won't even have to\n\n53:07.480 --> 53:15.240\n comment on it. Well, comment on the broader philosophical question. So NIH, again, I said,\n\n53:15.240 --> 53:20.480\n Joe Rogan is the first one who pointed me to this. NIH was recently accused of funding\n\n53:20.480 --> 53:25.720\n research of a paper that had images of sedated puppies with their heads inserted into small\n\n53:25.720 --> 53:32.720\n enclosures containing disease carrying sand flies. So I can just say that this story is\n\n53:32.720 --> 53:40.280\n not true, or at least the... I think it is true that the paper that showed those images\n\n53:40.280 --> 53:45.160\n cited NIH as a funding source, but that citation is not correct.\n\n53:45.160 --> 53:46.720\n That was not correct.\n\n53:46.720 --> 53:54.760\n Yeah. But that brings up a bigger philosophical question, that it could have been correct.\n\n53:54.760 --> 53:59.240\n How difficult is it as a director of NIH or just NIH as an organization that's funding\n\n53:59.240 --> 54:07.600\n so many amazing deep research studies to ensure the ethical fortitude of those studies when\n\n54:07.600 --> 54:14.000\n the ethics of science is... There's such a gray area between what is and what isn't ethical.\n\n54:14.000 --> 54:19.920\n Well, tough issues. Certainly animal research is a tough issue.\n\n54:19.920 --> 54:26.320\n I was going to bring up as a good example of that tough issue is in 2015, you announced\n\n54:26.320 --> 54:32.160\n that NIH will no longer support any biomedical research involving chimpanzees. So that's\n\n54:32.160 --> 54:39.480\n like one example of looking in the mirror, thinking deeply about what is and isn't ethical.\n\n54:39.480 --> 54:45.120\n And there was a conclusion that biomedical research on chimps is not ethical.\n\n54:45.120 --> 54:49.120\n That was the conclusion. That was based on a lot of deep thinking and a lot of input\n\n54:49.120 --> 54:54.840\n from people who have considered this issue and a panel of the National Academy of Sciences\n\n54:54.840 --> 55:00.880\n that was asked to review the issue. I mean, the question that I wanted them to look at\n\n55:00.880 --> 55:06.800\n was, are we actually learning anything that's really essential from chimpanzee invasive\n\n55:06.800 --> 55:14.080\n research at this point? Or is it time to say that these closest relatives of ours should\n\n55:14.080 --> 55:19.240\n not be subjected to that any further and ought to be retired to a sanctuary?\n\n55:19.240 --> 55:24.520\n And that was the conclusion that there was really no kind of medical experimentation\n\n55:24.520 --> 55:29.840\n that needed to be done on chimps in order to proceed. So why are we still doing this?\n\n55:29.840 --> 55:36.640\n Many of these were chimpanzees that were purchased because we thought they would be good hosts\n\n55:36.640 --> 55:43.140\n for HIV AIDS, and they sort of weren't. And they were kept around in these primate laboratories\n\n55:43.140 --> 55:48.420\n with people coming up with other things to do, but they weren't compelling scientifically.\n\n55:48.420 --> 55:52.960\n So I think that was the right decision. I took a lot of flak from some of the scientific\n\n55:52.960 --> 55:57.320\n community said, well, you're caving in to the animal rights people. And now that you've\n\n55:57.320 --> 56:05.520\n said no more research on chimps, what's next? Certainly when it comes to companion animals,\n\n56:05.520 --> 56:12.520\n everybody's heart starts to be hurting when you see anything done that seems harmful to\n\n56:12.520 --> 56:18.320\n a dog or a cat. I have a cat, I don't have a dog. And I understand that completely. That's\n\n56:18.320 --> 56:24.500\n why we have these oversight groups that decide before you do any of that kind of research,\n\n56:24.500 --> 56:32.500\n is it justified? And what kind of provision is going to be made to avoid pain and suffering?\n\n56:32.500 --> 56:39.300\n And those have input from the public as well as the scientific community. Is that completely\n\n56:39.300 --> 56:47.400\n saying that every step that's happening there is ethical by some standard that would be\n\n56:47.400 --> 56:54.740\n hard for anybody to agree to? No, but at least it's a consensus of what people think is acceptable.\n\n56:54.740 --> 57:02.040\n Dogs are the only host for some diseases like leishmaniasis, which was that paper that we\n\n57:02.040 --> 57:06.400\n were not responsible for, but I know why they were doing the experiment, or like lymphatic\n\n57:06.400 --> 57:13.040\n filariasis, which is an experiment that we are supporting in Georgia that involves dogs\n\n57:13.040 --> 57:16.940\n getting infected with a parasite, because that's the only model we have to know whether\n\n57:16.940 --> 57:23.600\n a treatment is going to work or not. So I will defend that. I am not in the place of\n\n57:23.600 --> 57:28.440\n those who think all animal research is evil, because I think if there's something that's\n\n57:28.440 --> 57:33.820\n going to be done to save a child from a terrible disease or an adult, and it involves animal\n\n57:33.820 --> 57:39.400\n research that's been carefully reviewed, then I think ethically why it doesn't make me comfortable,\n\n57:39.400 --> 57:45.280\n it still seems like it's the right choice. I think to say all animal research should\n\n57:45.280 --> 57:50.960\n be taken off the table is also very unethical, because that means you have basically doomed\n\n57:50.960 --> 57:58.200\n a lot of people for whom that research might have saved their lives to having no more hope.\n\n57:58.200 --> 58:03.480\n And to me personally, there's far greater concerns ethically in terms of factory farming,\n\n58:03.480 --> 58:06.800\n for example, the treatment of animals in other contexts.\n\n58:06.800 --> 58:12.560\n There's so much that goes on outside of medical research that is much more troubling.\n\n58:12.560 --> 58:17.860\n That said, I think all cats have to go. That's just my off the record opinion. That's why\n\n58:17.860 --> 58:22.360\n I'm not involved with any ethical decisions. I'm just joking internet ethic. I love cats.\n\n58:22.360 --> 58:23.360\n You're a dog person.\n\n58:23.360 --> 58:24.360\n I'm a dog person. I'm sorry.\n\n58:24.360 --> 58:29.920\n Have you seen the New Yorker cartoon where there are two dogs in the bar having a martini\n\n58:29.920 --> 58:34.200\n and one is saying they're dressed up in their business suits and one says to the other,\n\n58:34.200 --> 58:39.680\n you know, it's not enough for the dogs to win. The cats have to lose.\n\n58:39.680 --> 58:47.680\n That's beautiful. So a few weeks ago, you've announced that you're resigning from the NIH\n\n58:47.680 --> 58:48.920\n at the end of the year.\n\n58:48.920 --> 58:53.660\n I'm stepping down. I'm still going to be at NIH at a different capacity.\n\n58:53.660 --> 59:02.360\n Right. And it's over a decade of an incredible career overseeing the NIH as its director.\n\n59:02.360 --> 59:07.660\n What are the things you're most proud of, of the NIH in your time here as its director\n\n59:07.660 --> 59:12.920\n may be memorable moments?\n\n59:12.920 --> 59:22.680\n There's a lot in 12 years. Science has just progressed in amazing ways over those 12 years.\n\n59:22.680 --> 59:28.040\n Think about where we are right now. Something like gene editing, being able to make changes\n\n59:28.040 --> 59:35.040\n in DNA, even for therapeutic purposes, which is now curing sickle cell disease. Unthinkable\n\n59:35.040 --> 59:42.400\n when I became director in 2009. The ability to study single cells and ask them what they're\n\n59:42.400 --> 59:48.800\n doing and get an answer. Single cell biology just has emerged in this incredibly powerful\n\n59:48.800 --> 59:57.000\n way. Having the courage to be able to say we could actually understand the human brain\n\n59:57.000 --> 1:00:04.400\n seemed like so far out there. And we're in the process of doing that with the Brain Initiative.\n\n1:00:04.400 --> 1:00:09.920\n Taking all that we've learned about the genome and applying it to cancer to make individual\n\n1:00:09.920 --> 1:00:15.880\n cancer treatment really precision. And developing cancer immunotherapy, which seemed like sort\n\n1:00:15.880 --> 1:00:22.640\n of a backwater into some of the hottest science around. All those things sort of erupting.\n\n1:00:22.640 --> 1:00:28.080\n And much more to come, I'm sure. We're on an exponential curve of medical research advances,\n\n1:00:28.080 --> 1:00:35.400\n and that's glorious to watch. And of course, COVID 19, as a beneficiary of decades of basic\n\n1:00:35.400 --> 1:00:41.080\n science, understanding what mRNA is, understanding basics about coronaviruses and spike proteins\n\n1:00:41.080 --> 1:00:46.320\n and how to combine structural biology and immunology and genomics into this package\n\n1:00:46.320 --> 1:00:52.160\n that allows you to make a vaccine in 11 months. Just I would never have imagined that possible\n\n1:00:52.160 --> 1:00:57.800\n in 2009. So to have been able to kind of be the midwife, helping all of those things get\n\n1:00:57.800 --> 1:01:05.200\n birthed, that's been just an amazing 12 years. And as NIH director, you have this convening\n\n1:01:05.200 --> 1:01:10.340\n power and this ability to look across the whole landscape of biomedical research and\n\n1:01:10.340 --> 1:01:16.240\n identify areas that are just like ready for something big to happen. But it isn't going\n\n1:01:16.240 --> 1:01:21.120\n to happen spontaneously without some encouragement, without pulling people together from different\n\n1:01:21.120 --> 1:01:24.940\n disciplines who don't know each other and maybe don't know how to quite understand each\n\n1:01:24.940 --> 1:01:29.880\n other's scientific language and create an environment for that to happen. That has been\n\n1:01:29.880 --> 1:01:35.400\n just an amazing experience. I mean, I mentioned the Brain Initiative as one of those. The\n\n1:01:35.400 --> 1:01:41.280\n Brain Initiative right now, I think there's about 600 investigators working on this. Last\n\n1:01:41.280 --> 1:01:46.320\n week, the whole issue of Nature magazine was about the output of the Brain Initiative basically\n\n1:01:46.320 --> 1:01:51.760\n now giving us a cell census of what those cells in the brain are doing, which has just\n\n1:01:51.760 --> 1:01:59.040\n never been imaginable. And interestingly, more than half of the investigators in the\n\n1:01:59.040 --> 1:02:04.460\n Brain Initiative are engineers. They're not biologists in a traditional sense. I love\n\n1:02:04.460 --> 1:02:10.640\n that. Maybe partly because my PhD is in quantum mechanics. So I think it's really a good idea\n\n1:02:10.640 --> 1:02:16.600\n to bring disciplines together and see what happens. That's an exciting thing. And I will\n\n1:02:16.600 --> 1:02:23.000\n not ever forget having the chance to announce that program in the East Room in that White\n\n1:02:23.000 --> 1:02:29.560\n House with President Obama, who totally got it and totally loved science and working with\n\n1:02:29.560 --> 1:02:35.240\n him in some of those rare moments of sort of one on one conversation in the Oval Office,\n\n1:02:35.240 --> 1:02:38.120\n just him and me about science. That's a gift.\n\n1:02:38.120 --> 1:02:44.600\n What's it like talking to Barack Obama about science? He seems to be a sponge. I've heard\n\n1:02:44.600 --> 1:02:49.800\n him. I'm an artificial intelligence person. And I've heard him talk about AI. And it was\n\n1:02:49.800 --> 1:02:54.000\n like, it made me think, is somebody like whispering in his ear or something? Because he was saying\n\n1:02:54.000 --> 1:02:58.600\n stuff that totally passed the BS test, like he really understands stuff.\n\n1:02:58.600 --> 1:02:59.600\n He does.\n\n1:02:59.600 --> 1:03:04.240\n That means he listened to a bunch of experts on AI. He was explaining the difference between\n\n1:03:04.240 --> 1:03:08.920\n narrow artificial intelligence and strong AI. He was saying all this, both technical\n\n1:03:08.920 --> 1:03:14.940\n and philosophical stuff. And it just made me, I don't know, it made me hopeful about\n\n1:03:14.940 --> 1:03:18.680\n the depth of understanding that a human being in political office can attain.\n\n1:03:18.680 --> 1:03:24.340\n That gave me hope as well, and having those experiences. Oftentimes in a group, I mean,\n\n1:03:24.340 --> 1:03:28.380\n another example was trying to figure out, how do we take what we've learned about the\n\n1:03:28.380 --> 1:03:34.080\n genome and really apply it at scale to figure out how to prevent illness, not just treat\n\n1:03:34.080 --> 1:03:40.160\n it, but prevent it, out of which came this program called All of Us, this million strong\n\n1:03:40.160 --> 1:03:45.280\n American cohort of participants who make their electronic health records and their genome\n\n1:03:45.280 --> 1:03:50.120\n sequences and everything else available for researchers to look at. That came out of a\n\n1:03:50.120 --> 1:03:58.720\n couple of conversations with Obama and others in his office, and he asked the best questions.\n\n1:03:58.720 --> 1:04:03.440\n That was what struck me so much. I mean, a room full of scientists, and we'd be talking\n\n1:04:03.440 --> 1:04:09.400\n about the possible approaches, and he would come up with this incredibly insightful penetrating\n\n1:04:09.400 --> 1:04:12.060\n question. Not that he knew what the answer was going to be, but he knew what the right\n\n1:04:12.060 --> 1:04:13.360\n question was.\n\n1:04:13.360 --> 1:04:19.760\n I think the core to that is curiosity. I don't think he's even like, he's trying to be a\n\n1:04:19.760 --> 1:04:22.120\n good leader. He's legit curious.\n\n1:04:22.120 --> 1:04:23.120\n Yes.\n\n1:04:23.120 --> 1:04:24.120\n Legit.\n\n1:04:24.120 --> 1:04:29.520\n That he, almost like a kid in a candy store, gets to talk to the world experts. He somehow\n\n1:04:29.520 --> 1:04:35.520\n sneaked into this office and gets to talk to the world experts. That's the kind of energy\n\n1:04:35.520 --> 1:04:40.640\n that I think leads to beautiful leadership in the space of science.\n\n1:04:40.640 --> 1:04:45.000\n Indeed. Another thing I've been able to do as director is to try to break down some of\n\n1:04:45.000 --> 1:04:49.360\n the boundaries that seem to be traditional between the public and the private sectors.\n\n1:04:49.360 --> 1:04:54.000\n When it comes to areas of science that really could and should be open access anyway, why\n\n1:04:54.000 --> 1:05:03.160\n don't we work together? That was obvious early on. After identifying a few possible collaborators\n\n1:05:03.160 --> 1:05:08.740\n who are chief scientists of pharmaceutical companies, it looked like we might be able\n\n1:05:08.740 --> 1:05:10.560\n to do something in that space.\n\n1:05:10.560 --> 1:05:16.320\n Out of that was born something called the Accelerating Medicines Partnership, AMP. It\n\n1:05:16.320 --> 1:05:21.640\n took a couple of years of convening people who usually didn't talk to each other. There\n\n1:05:21.640 --> 1:05:27.220\n was a lot of suspicion. Academic scientists saying, oh, those scientists in pharma, they're\n\n1:05:27.220 --> 1:05:32.280\n not that smart. They're just trying to make money. The academic scientists getting the\n\n1:05:32.280 --> 1:05:36.160\n rap from the pharmaceutical scientists, all they want to do is publish papers. They don't\n\n1:05:36.160 --> 1:05:38.360\n really care about helping anybody.\n\n1:05:38.360 --> 1:05:44.400\n We found out both of those stereotypes were wrong. Over the course of that couple of years,\n\n1:05:44.400 --> 1:05:50.120\n we built a momentum behind three starting projects, one on Alzheimer's, one on diabetes,\n\n1:05:50.120 --> 1:05:54.280\n one on rheumatoid arthritis and lupus. Very different, each one of them trying to identify\n\n1:05:54.280 --> 1:06:00.520\n what is an area that we both really need to see advance and we could do better together.\n\n1:06:00.520 --> 1:06:05.400\n It's going to have to be open access, otherwise NIH is not going to play. Guess what, industry?\n\n1:06:05.400 --> 1:06:08.960\n If you really want to do this, you got to have skin in the game. We'll cover half the\n\n1:06:08.960 --> 1:06:10.720\n cost. You got to cover the other half.\n\n1:06:10.720 --> 1:06:16.600\n I love it. Enforcing open access, resulting in open science.\n\n1:06:16.600 --> 1:06:21.000\n Millions of dollars gone into this and it has been a wild success. After many people\n\n1:06:21.000 --> 1:06:27.880\n were skeptical, a couple of years later, we had another project on Parkinson's. More recently,\n\n1:06:27.880 --> 1:06:35.520\n we added one on schizophrenia. Just this week, we added one on gene therapy, on bespoke gene\n\n1:06:35.520 --> 1:06:41.320\n therapy for ultra rare diseases, which otherwise aren't going to have enough commercial appeal.\n\n1:06:41.320 --> 1:06:45.800\n If we did this together, especially with FDA at the table, and they have been, we could\n\n1:06:45.800 --> 1:06:51.080\n make something happen, turn this into a standardized approach where everything didn't have to be\n\n1:06:51.080 --> 1:06:54.760\n a one off. I'm really excited about that.\n\n1:06:54.760 --> 1:06:59.680\n What began as three projects is six and it's about to be seven next year with a heart failure\n\n1:06:59.680 --> 1:07:06.040\n and all of us have gotten to know each other. If it weren't for that background when COVID\n\n1:07:06.040 --> 1:07:11.160\n came along, it would have been a lot harder to build the partnership called ACTIV, which\n\n1:07:11.160 --> 1:07:17.440\n has been my passion for the last 20 months, accelerating COVID 19 therapeutic interventions\n\n1:07:17.440 --> 1:07:18.440\n and vaccines.\n\n1:07:18.440 --> 1:07:23.320\n We just had our leadership team meeting this morning. It was amazing what's been accomplished.\n\n1:07:23.320 --> 1:07:28.380\n That's pretty much 100 people who dropped everything just to work on this, about half\n\n1:07:28.380 --> 1:07:34.520\n from industry and half from government and academia. That's how we got vaccine master\n\n1:07:34.520 --> 1:07:40.520\n protocols designed. We all agreed about what the endpoints had to be and you wondered why\n\n1:07:40.520 --> 1:07:46.440\n are there 30,000 participants in each of these trials? That's because of ACTIV's group mapping\n\n1:07:46.440 --> 1:07:51.240\n out what the power needed to be for this to be convincing.\n\n1:07:51.240 --> 1:07:58.080\n Same with therapeutics. We have run at least 20 therapeutic agents through trials that\n\n1:07:58.080 --> 1:08:02.880\n ACTIV supported in record time. That's how we got monoclonal antibodies that we know\n\n1:08:02.880 --> 1:08:12.200\n work. That would not have been possible if I didn't already have a sense of how to work\n\n1:08:12.200 --> 1:08:17.680\n with the private sector that came out of AMP. AMP took two years to get started. ACTIV took\n\n1:08:17.680 --> 1:08:20.600\n two weeks. We just kept the lawyers.\n\n1:08:20.600 --> 1:08:21.920\n Wow, to get 100 people over?\n\n1:08:21.920 --> 1:08:25.920\n Yeah, kept the lawyers out of the room and away we went.\n\n1:08:25.920 --> 1:08:34.120\n Now you're going to get yourself in trouble. I do hope one day the story of this incredible\n\n1:08:34.120 --> 1:08:38.080\n vaccine development of vaccine protocols and trials and all this kind of details, the messy\n\n1:08:38.080 --> 1:08:44.280\n beautiful details of science and engineering that led to the manufacturing, the deployment\n\n1:08:44.280 --> 1:08:48.960\n and the scientific test. It's such a nice dance between engineering in the space of\n\n1:08:48.960 --> 1:08:53.840\n manufacturing the vaccines. You start before the studies are complete, you start making\n\n1:08:53.840 --> 1:08:59.160\n the vaccines just in case that if the studies proved to be positive, then you can start\n\n1:08:59.160 --> 1:09:05.280\n deploying them just like so many parties, like you said, private and public playing\n\n1:09:05.280 --> 1:09:11.840\n together. That's just a beautiful dance that is one of the, for me, the sources of hope\n\n1:09:11.840 --> 1:09:20.800\n in this very tricky time where there's a lot of things to be cynical about in terms of\n\n1:09:20.800 --> 1:09:24.480\n the games politicians play and the hardship experience of the economy and all those kinds\n\n1:09:24.480 --> 1:09:31.800\n of things. That to me, this dance was a vaccine development was done just beautifully and\n\n1:09:31.800 --> 1:09:33.240\n it gives me hope.\n\n1:09:33.240 --> 1:09:38.880\n It does me as well. And it was in many ways the finest hour that science has had in a\n\n1:09:38.880 --> 1:09:44.960\n long time being called upon when every day counted and making sure that time was not\n\n1:09:44.960 --> 1:09:50.240\n wasted and things were done rigorously, but quickly.\n\n1:09:50.240 --> 1:09:56.360\n So, you're incredibly good as a leader of the NIH. It seems like you're having a heck\n\n1:09:56.360 --> 1:10:02.320\n of a lot of fun. Why step down from this role after so much fun?\n\n1:10:02.320 --> 1:10:09.640\n Well, no other NIH director has served more than one president after being appointed by\n\n1:10:09.640 --> 1:10:14.160\n one. You're sort of done. And the idea of being carried over for a second presidency\n\n1:10:14.160 --> 1:10:20.440\n with Trump and now a third one with Biden is unheard of. I just think, Lex, that scientific\n\n1:10:20.440 --> 1:10:26.720\n organizations benefit from new vision and 12 years is a really long time to have the\n\n1:10:26.720 --> 1:10:33.440\n same leader. And if I wasn't going to stick it out for the entire Biden four year term,\n\n1:10:33.440 --> 1:10:39.120\n it's good not to wait too late during that to signal an intent to step down because the\n\n1:10:39.120 --> 1:10:43.080\n president's got to find the right person, got to nominate them, got to get the Senate\n\n1:10:43.080 --> 1:10:47.680\n to confirm them, which is an unpredictable process right now.\n\n1:10:47.680 --> 1:10:52.840\n And you don't want to try to do that in the second half of somebody's term as president.\n\n1:10:52.840 --> 1:10:56.860\n This has got to happen now. So, I kind of decided back at the end of May that this should\n\n1:10:56.860 --> 1:11:04.840\n be my final year. And I'm okay with that. I do have some mixed emotions because I love\n\n1:11:04.840 --> 1:11:13.440\n the NIH. I love the job. It's exhausting. I'm traditionally for the last 20 months anyway,\n\n1:11:13.440 --> 1:11:19.800\n working 100 hours a week. It's just, that's what it takes to juggle all of this. And that\n\n1:11:19.800 --> 1:11:24.680\n keeps me from having a lot of time for anything else. And I wouldn't mind because I don't\n\n1:11:24.680 --> 1:11:30.000\n think I'm done yet. I wouldn't mind having some time to really think about what the next\n\n1:11:30.000 --> 1:11:35.240\n chapter should be. And I have none of that time right now. Do I have another calling?\n\n1:11:35.240 --> 1:11:40.200\n Is there something else I could contribute that's different than this? I'd like to find\n\n1:11:40.200 --> 1:11:42.800\n that out.\n\n1:11:42.800 --> 1:11:49.760\n I think the right answer is you're just stepping down to focus on your music career.\n\n1:11:49.760 --> 1:11:54.080\n That might not be a good plan for anything very sustainable.\n\n1:11:54.080 --> 1:11:59.080\n But I think that is a sign of a great leader as George Washington did stepping down at\n\n1:11:59.080 --> 1:12:00.080\n the right time.\n\n1:12:00.080 --> 1:12:01.080\n Ted Williams.\n\n1:12:01.080 --> 1:12:02.080\n Yes.\n\n1:12:02.080 --> 1:12:07.920\n He quit when I think he hit a home run on his last at bat and his average was 400 at\n\n1:12:07.920 --> 1:12:08.920\n the time.\n\n1:12:08.920 --> 1:12:15.200\n No one to walk away. I mean, it's hard, but it's beautiful to see in a leader. You also\n\n1:12:15.200 --> 1:12:22.540\n oversaw the human genome project. You mentioned the brain initiative, which has, it's a dream\n\n1:12:22.540 --> 1:12:29.580\n to map the human brain. And there's the dream to map the human code, which was the human\n\n1:12:29.580 --> 1:12:34.920\n genome project. And you have said that it is humbling for me and awe inspiring to realize\n\n1:12:34.920 --> 1:12:41.240\n that we have caught the first glimpse of our own instruction book, previously known only\n\n1:12:41.240 --> 1:12:48.400\n to God. How does that, if you can just kind of wax poetic for a second, how does it make\n\n1:12:48.400 --> 1:12:55.360\n you feel that we were able to map this instruction book, look into our own code, and be able\n\n1:12:55.360 --> 1:12:59.360\n to reverse engineer it?\n\n1:12:59.360 --> 1:13:06.520\n It's breathtaking. It's so fundamental. And yet, for all of human history, we're ignorant\n\n1:13:06.520 --> 1:13:13.420\n of the details of what that instruction book looked like. And then we crossed a bridge\n\n1:13:13.420 --> 1:13:19.120\n into the territory of the known. And we had that in front of us still written in a language\n\n1:13:19.120 --> 1:13:23.740\n that we had to learn how to read. And we're in the process of doing that and will be for\n\n1:13:23.740 --> 1:13:31.000\n decades to come. But we owned it, we had it. And it has such profound consequences. It's\n\n1:13:31.000 --> 1:13:38.840\n it's both a book about our history. It's a book of sort of the parts list of a human\n\n1:13:38.840 --> 1:13:43.960\n being, the genes that are in there and how they're regulated. And it's also a medical\n\n1:13:43.960 --> 1:13:51.400\n textbook that can teach us things that will provide answers to illnesses we don't understand,\n\n1:13:51.400 --> 1:13:57.240\n and alleviate suffering and premature death. So it's a pretty amazing thing to contemplate.\n\n1:13:57.240 --> 1:14:03.320\n And it has utterly transformed the way we do science. And it is in the process of transforming\n\n1:14:03.320 --> 1:14:09.320\n the way we do medicine, although much of that still lies ahead. You know, while we were\n\n1:14:09.320 --> 1:14:17.160\n working on the Genome Project, it was sort of hard to get this sense of a wellness, because\n\n1:14:17.160 --> 1:14:21.840\n it was just hard work. And you were getting, you know, another mega base, okay, this is\n\n1:14:21.840 --> 1:14:29.240\n good. But when did you actually step back and say, we did it? It's the profoundness\n\n1:14:29.240 --> 1:14:33.640\n of that. I mean, there were two points, I guess. One was the announcement on that June\n\n1:14:33.640 --> 1:14:37.800\n 26, 2000, where the whole world heard, well, we don't quite have it, but we got a pretty\n\n1:14:37.800 --> 1:14:45.400\n good draft. And suddenly, people are like realizing, oh, this is this a big deal. For\n\n1:14:45.400 --> 1:14:50.560\n me, it was more when we got the full analysis of it, published it in February 2001. And\n\n1:14:50.560 --> 1:14:55.980\n that issue of Nature paper that Eric Lander and Bob Waterston and I were the main authors,\n\n1:14:55.980 --> 1:15:01.400\n and we toiled over and tried to get as much insight as we could in there about what the\n\n1:15:01.400 --> 1:15:07.160\n meaning of all this was. But you also had this sense that we are such beginning readers\n\n1:15:07.160 --> 1:15:13.360\n here. We are still in kindergarten, trying to make sense out of this 3 billion letter\n\n1:15:13.360 --> 1:15:19.320\n book. And we're going to be at this for generations to come.\n\n1:15:19.320 --> 1:15:25.920\n You are a man of faith, Christian, and you are a man of science. What is the role of\n\n1:15:25.920 --> 1:15:35.360\n religion and of science in society and in the individual human mind and heart like yours?\n\n1:15:35.360 --> 1:15:42.760\n Well, I was not a person of faith when I was growing up. I became a believer in my 20s,\n\n1:15:42.760 --> 1:15:48.000\n influenced as a medical student by a recognition that I hadn't really thought through the\n\n1:15:48.000 --> 1:15:55.440\n issues of what's the meaning of life? Why are we all here? What happens when you die?\n\n1:15:55.440 --> 1:16:01.000\n Is there a God? Science is not so helpful in answering those questions. So I had to\n\n1:16:01.000 --> 1:16:07.160\n look around in other places and ultimately came to my own conclusion that atheism, which\n\n1:16:07.160 --> 1:16:12.800\n is where I had been, was the least supportable of the choices because it was the assertion\n\n1:16:12.800 --> 1:16:20.280\n of a universal negative, which scientists aren't supposed to do. And agnosticism came\n\n1:16:20.280 --> 1:16:24.640\n as an attractive option but felt a little bit like a cop out, so I had to keep going\n\n1:16:24.640 --> 1:16:30.580\n trying to figure out why do believers actually believe this stuff? And I came to realize\n\n1:16:30.580 --> 1:16:34.960\n it was all pretty compelling, that there's no proof. I can't prove to you or anybody\n\n1:16:34.960 --> 1:16:39.920\n else that God exists, but I can say it's pretty darn plausible.\n\n1:16:39.920 --> 1:16:45.520\n And ultimately, what kind of God is it that caused me to search through various religions\n\n1:16:45.520 --> 1:16:51.640\n and see, well, what do people think about that? And to my surprise, encountered the\n\n1:16:51.640 --> 1:16:58.840\n person of Jesus Christ as unique in every possible way and answering a lot of the questions\n\n1:16:58.840 --> 1:17:06.880\n I couldn't otherwise answer. And somewhat kicking and screaming, I became a Christian,\n\n1:17:06.880 --> 1:17:12.720\n even though at the time, as a medical student already interested in genetics, people predicted\n\n1:17:12.720 --> 1:17:18.580\n my head would then explode because these were incompatible worldviews. They really have\n\n1:17:18.580 --> 1:17:27.200\n not been for me. I am so fortunate, I think, that in a given day, wrestling with an issue,\n\n1:17:27.200 --> 1:17:33.360\n it can have both the rigorous scientific component and it can have the spiritual component. COVID\n\n1:17:33.360 --> 1:17:39.760\n 19 is a great example. These vaccines are both an amazing scientific achievement and\n\n1:17:39.760 --> 1:17:45.880\n an answer to prayer. When I'm wrestling with vaccine hesitancy and trying to figure out\n\n1:17:45.880 --> 1:17:53.020\n what answers to come up with, I get so frustrated sometimes and I'm comforted by reassurances\n\n1:17:53.020 --> 1:17:58.720\n that God is aware of that. I don't have to do this alone.\n\n1:17:58.720 --> 1:18:05.200\n So I know there are people like your friend, Sam Harris, who feel differently. Sam wrote\n\n1:18:05.200 --> 1:18:12.920\n a rather famous op ed in the New York Times when I was nominated as the NIH director saying,\n\n1:18:12.920 --> 1:18:21.400\n this is a terrible mistake. You can't have somebody who believes in God running the NIH.\n\n1:18:21.400 --> 1:18:23.560\n He's just going to completely ruin the place.\n\n1:18:23.560 --> 1:18:31.440\n Well, I have a testimonial. Christopher Hitchens, a devout atheist, if I could say so, was a\n\n1:18:31.440 --> 1:18:37.120\n friend of yours and referred to you as, quote, one of the greatest living Americans and stated\n\n1:18:37.120 --> 1:18:41.880\n that you were one of the most devout believers he has ever met. He further stated that you\n\n1:18:41.880 --> 1:18:46.440\n were sequencing the genome of the cancer that would ultimately claim his life and that your\n\n1:18:46.440 --> 1:18:52.560\n friendship, despite their differing opinions on religion, was an example of the greatest\n\n1:18:52.560 --> 1:18:55.520\n confirmed truth in modern times.\n\n1:18:55.520 --> 1:18:59.560\n What did you learn from Christopher Hitchens about life or perhaps what is a fond memory\n\n1:18:59.560 --> 1:19:05.800\n you have of this man with whom you've disagreed, but who is also your friend?\n\n1:19:05.800 --> 1:19:13.920\n Yeah, I loved Hitch. I'm sorry he's gone. Iron sharpens iron. There's nothing better\n\n1:19:13.920 --> 1:19:19.200\n for trying to figure out where you are with your own situation and your own opinions,\n\n1:19:19.200 --> 1:19:24.720\n your own worldviews, than encountering somebody who's completely in another space and who's\n\n1:19:24.720 --> 1:19:30.360\n got the gift, as Hitch did, of challenging everything and doing so over a glass of scotch\n\n1:19:30.360 --> 1:19:33.200\n or two or three.\n\n1:19:33.200 --> 1:19:41.360\n We got off to a rough start in an interaction we had at a rather highbrow dinner. He was\n\n1:19:41.360 --> 1:19:48.280\n really deeply insulting of a question I was asking. I was like, okay, that's fine. Let's\n\n1:19:48.280 --> 1:19:53.320\n figure out how we could have a more civil conversation. Then I really learned to greatly\n\n1:19:53.320 --> 1:20:00.320\n admire his intellect and to find the jousting with him. It wasn't all about faith, although\n\n1:20:00.320 --> 1:20:05.720\n it often was. It was really inspiring and innovating, energizing.\n\n1:20:05.720 --> 1:20:13.000\n Then when he got cancer, I became his ally, trying to help him find pathways through the\n\n1:20:13.000 --> 1:20:19.120\n various options and maybe helped him to stay around on this planet for an extra six months\n\n1:20:19.120 --> 1:20:28.520\n or so. I have the warmest feelings of being in his apartment downtown over a glass of\n\n1:20:28.520 --> 1:20:35.320\n wine talking about whatever. Sometimes it was science. He was fascinated by science.\n\n1:20:35.320 --> 1:20:42.560\n Sometimes it was Thomas Jefferson. Sometimes it was faith. I knew it would always be really\n\n1:20:42.560 --> 1:20:43.560\n interesting.\n\n1:20:43.560 --> 1:20:51.120\n He's now gone. Do you think about your own mortality? Are you afraid of death?\n\n1:20:51.120 --> 1:20:55.560\n I'm not afraid. I'm not looking forward to it. I don't want to rush it because I feel\n\n1:20:55.560 --> 1:21:02.480\n like I got some things I can still do here. As a person of faith, I don't think I'm afraid.\n\n1:21:02.480 --> 1:21:08.560\n I'm 71. I know I don't have an infinite amount of time left. I want to use the time I've\n\n1:21:08.560 --> 1:21:17.840\n got in some sort of way that matters. I'm not ready to become a full time golfer, but\n\n1:21:17.840 --> 1:21:25.560\n I don't quite know what that is. I do feel that I've had a chance to do amazingly powerful\n\n1:21:25.560 --> 1:21:31.640\n things as far as experiences, and maybe God has something else in mind.\n\n1:21:31.640 --> 1:21:37.440\n I wrote this book 16 years ago, The Language of God, about science and faith, trying to\n\n1:21:37.440 --> 1:21:44.120\n explain how, from my perspective, these are compatible. These are in harmony. They're\n\n1:21:44.120 --> 1:21:50.520\n complementary if you are careful about which kind of question you're asking. To my surprise,\n\n1:21:50.520 --> 1:21:56.480\n a lot of people seem to be interested in that. They were tired of hearing the extreme voices\n\n1:21:56.480 --> 1:22:02.760\n like Dawkins at one end and people like Ken Ham and Answers in Genesis on the other end\n\n1:22:02.760 --> 1:22:07.480\n saying, if you trust science, you're going to hell. They thought there must be a way\n\n1:22:07.480 --> 1:22:10.720\n that these things could get along, and that's what I tried to put forward.\n\n1:22:10.720 --> 1:22:16.440\n Then I started a foundation, BioLogos, which then I had to step away from to become NIH\n\n1:22:16.440 --> 1:22:21.320\n director, which has just flourished, maybe because I stepped away. I don't know. It\n\n1:22:21.320 --> 1:22:26.640\n now has millions of people who come to that website and they run amazing meetings. I think\n\n1:22:26.640 --> 1:22:31.320\n a lot of people have really come to a sense that this is okay. I can love science and\n\n1:22:31.320 --> 1:22:36.000\n I can love God, and that's not a bad thing. So maybe there's something more I can do in\n\n1:22:36.000 --> 1:22:39.680\n that space. Maybe that book is ready for a second edition.\n\n1:22:39.680 --> 1:22:47.920\n I think so. But when you look back, life is finite. What do you hope your legacy is?\n\n1:22:47.920 --> 1:22:54.960\n I don't know. This whole legacy thing is a little bit hard to embrace. It feels a little\n\n1:22:54.960 --> 1:22:59.520\n self promoting, doesn't it? I sort of feel like in many ways, I went to my own funeral\n\n1:22:59.520 --> 1:23:05.760\n on October 5th when I announced that I was stepping down and I got the most amazing responses\n\n1:23:05.760 --> 1:23:10.240\n from people, some of whom I knew really well, some of whom I didn't know at all, who were\n\n1:23:10.240 --> 1:23:16.000\n just telling me stories about something that I had contributed to that made a difference\n\n1:23:16.000 --> 1:23:21.640\n to them. That was incredibly heartwarming, and that's enough. I don't want to build\n\n1:23:21.640 --> 1:23:27.600\n an edifice. I don't have a plan for a monument or a statue. God help us.\n\n1:23:27.600 --> 1:23:33.200\n I do feel like I've been incredibly fortunate. I've had the chance to play a role in things\n\n1:23:33.200 --> 1:23:39.840\n that were pretty profound from the Genome Project to NIH to COVID vaccines, and I ought\n\n1:23:39.840 --> 1:23:46.520\n to be plenty satisfied that I've had enough experiences here to feel pretty good about\n\n1:23:46.520 --> 1:23:50.720\n the way in which my life panned out.\n\n1:23:50.720 --> 1:23:54.640\n We did a bunch of difficult questions in this conversation. Let me ask the most difficult\n\n1:23:54.640 --> 1:24:03.160\n one, that perhaps is the reason you turned to God. What is the meaning of life? Have\n\n1:24:03.160 --> 1:24:07.400\n you figured it out yet?\n\n1:24:07.400 --> 1:24:09.400\n Expect me to put that into three sentences.\n\n1:24:09.400 --> 1:24:15.640\n We only have a couple of minutes. At least hurry up.\n\n1:24:15.640 --> 1:24:19.280\n Well that's not a question that I think science helps me with, so you're going to push me\n\n1:24:19.280 --> 1:24:25.120\n into the faith zone, which is where I'd want to go with that. What is the meaning? Why\n\n1:24:25.120 --> 1:24:30.780\n are we here? What are we put here to do? I do believe we're here for just a blink of\n\n1:24:30.780 --> 1:24:37.000\n an eye and that our existence somehow goes on beyond that in a way that I don't entirely\n\n1:24:37.000 --> 1:24:43.920\n understand despite efforts to do so. I think we are called upon in this blink of an eye\n\n1:24:43.920 --> 1:24:50.200\n to try to make the world a better place, to try to love people, to try to do a better\n\n1:24:50.200 --> 1:25:01.480\n job of our more altruistic instincts and less of our selfish instincts, to try to be what\n\n1:25:01.480 --> 1:25:12.040\n God calls us to be, people who are holy, not people who are driven by self indulgence.\n\n1:25:12.040 --> 1:25:17.720\n And sometimes I'm better at that than others. But I think that for me as a Christian is\n\n1:25:17.720 --> 1:25:24.520\n a pretty clear, I mean, it's to live out the Sermon on the Mount. Once I read that,\n\n1:25:24.520 --> 1:25:32.360\n I couldn't unread it. All those beatitudes, all the blessings, that's what we're supposed\n\n1:25:32.360 --> 1:25:37.320\n to do. And the meaning of life is to strive for that standard, recognizing you're going\n\n1:25:37.320 --> 1:25:44.020\n to fail over and over again, and that God forgives you. Hopefully to put a little bit\n\n1:25:44.020 --> 1:25:51.480\n of love out there into the world. That's what it's about. Francis, I'm truly humbled and\n\n1:25:51.480 --> 1:25:58.120\n inspired by both your brilliance and your humility and that you would spend your extremely\n\n1:25:58.120 --> 1:26:02.040\n valuable time with me today. It was really an honor. Thank you so much for talking today.\n\n1:26:02.040 --> 1:26:08.760\n I was glad to. And you asked a really good question. So your reputation as the best podcaster\n\n1:26:08.760 --> 1:26:13.560\n has borne itself out here this afternoon. Thank you so much. Thanks for listening to\n\n1:26:13.560 --> 1:26:17.320\n this conversation with Francis Collins. To support this podcast, please check out our\n\n1:26:17.320 --> 1:26:22.880\n sponsors in the description. And now let me leave you with some words from Isaac Newton\n\n1:26:22.880 --> 1:26:29.680\n reflecting on his life and work. I seem to have been only like a boy playing on the seashore\n\n1:26:29.680 --> 1:26:35.960\n and diverting myself in now and then finding a smoother pebble or prettier shell than ordinary.\n\n1:26:35.960 --> 1:26:43.200\n Whilst the great ocean of truth lay all undiscovered before me. Thank you for listening and hope\n\n1:26:43.200 --> 1:27:00.480\n to see you next time.\n\n"
}