{
  "title": "Luís and João Batalha: Fermat's Library and the Art of Studying Papers | Lex Fridman Podcast #209",
  "id": "ndMahzDCH1Y",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:06.320\n The following is a conversation with Luis and João Botala, brothers and cofounders of Fermat's\n\n00:06.320 --> 00:12.800\n Library, which is an incredible platform for annotating papers. As they write on the Fermat's\n\n00:12.800 --> 00:19.200\n Library website, just as Pierre de Fermat scribbled his famous last theorem in the margins, professional\n\n00:19.200 --> 00:25.200\n scientists, academics, and citizen scientists can annotate equations, figures, ideas, and write\n\n00:25.200 --> 00:31.600\n in the margins. Fermat's Library is also a really good Twitter account to follow. I highly recommend\n\n00:31.600 --> 00:37.840\n it. They post little visual factoids and explorations that reveal the beauty of mathematics.\n\n00:38.480 --> 00:47.840\n I love it. Quick mention of our sponsors. Skiff, SimplySafe, Indeed, NetSuite, and Four Sigmatic.\n\n00:47.840 --> 00:52.800\n Check them out in the description to support this podcast. As a side note, let me say a few words\n\n00:52.800 --> 00:59.280\n about the dissemination of scientific ideas. I believe that all scientific articles should be\n\n00:59.280 --> 01:05.840\n freely accessible to the public. They currently are not. In one analysis I saw, more than 70%\n\n01:05.840 --> 01:11.040\n of published research articles are behind a paywall. In case you don't know, the funders of\n\n01:11.040 --> 01:18.240\n the research, whether that's government or industry, aren't the ones putting up the paywall. The journals\n\n01:18.240 --> 01:24.080\n are the ones putting up the paywall, while using unpaid labor from researchers for the peer review\n\n01:24.080 --> 01:31.360\n process. Where is all that money from the paywall going? In this digital age, the costs here should\n\n01:31.360 --> 01:37.600\n be minimal. This cost can easily be covered through donation, advertisement, or public funding of\n\n01:37.600 --> 01:43.120\n science. The benefit versus the cost of all papers being free to read is obvious, and the fact that\n\n01:43.120 --> 01:48.640\n they're not free goes against everything science should stand for, which is the free dissemination\n\n01:48.640 --> 01:56.560\n of ideas that educate and inspire. Science cannot be a gated institution. The more people can freely\n\n01:56.560 --> 02:02.160\n learn and collaborate on ideas, the more problems we can solve in the world together, and the faster\n\n02:02.160 --> 02:10.320\n we can drive old ideas out and bring new, better ideas in. Science is beautiful and powerful, and\n\n02:10.320 --> 02:17.680\n its dissemination in this digital age should be free. This is the Lex Friedman podcast, and here's\n\n02:17.680 --> 02:26.720\n my conversation with Luis and Joao Batala. Luis, you suggested an interesting idea. Imagine if most\n\n02:26.720 --> 02:34.800\n papers had a backstory section, the same way that they have an abstract. So knowing more about how\n\n02:34.800 --> 02:40.240\n the authors ended up working on a paper can be extremely insightful. And then you went on to give\n\n02:40.240 --> 02:45.200\n a backstory for the Feynman QED paper. This is all in a tweet, by the way. We're doing tweet analysis\n\n02:45.200 --> 02:51.600\n today. How much of the human backstory do you think is important in understanding the idea itself\n\n02:51.600 --> 02:57.760\n that's presented in the paper or in general? I think this gives way more context to the work of\n\n02:57.760 --> 03:03.600\n scientists. I think people, a lot of people have this almost kind of romantic misconception that\n\n03:03.600 --> 03:09.600\n the way a lot of scientists work is almost as the sum of eureka moments where all of a sudden they\n\n03:09.600 --> 03:15.200\n sit down and start writing two papers in a row, and the papers are usually isolated. And when you\n\n03:15.200 --> 03:23.760\n actually look at it, the papers are chapters of a way more complex story. And the Feynman QED paper\n\n03:23.760 --> 03:29.040\n is a good example. So Feynman was actually going through a pretty dark phase before writing that\n\n03:29.040 --> 03:35.680\n paper. He lost enthusiasm with physics and doing physics problems. And there was one time when he\n\n03:35.680 --> 03:41.840\n was in the cafeteria of Cornell, and he saw a guy that was throwing plates in the air. And he noticed\n\n03:41.840 --> 03:47.200\n that when the plate was in the air, there were two movements there. The plate was wobbling, but he\n\n03:47.200 --> 03:52.640\n also noticed that the Cornell symbol was rotating. And he was able to figure out the equations of\n\n03:52.640 --> 04:03.040\n motions of those plates. And that led him to kind of think a little bit about electron orbits in\n\n04:03.040 --> 04:11.120\n relativity, which led to the paper about quantum electrodynamics. So that kind of reignited his\n\n04:11.120 --> 04:18.560\n interest in physics and ended up publishing the paper that led to his Nobel Prize, basically.\n\n04:18.560 --> 04:24.560\n And I think there are a lot of really interesting backstories about papers that readers never get to\n\n04:24.560 --> 04:33.120\n know. For instance, we did a couple of months ago an AMA around a paper, a pretty famous paper,\n\n04:33.120 --> 04:38.960\n the GAMS paper with Ian Goodfellow. And so we did an AMA where everyone could ask questions about\n\n04:38.960 --> 04:44.640\n the paper, and Ian was responding to those questions. And he was also telling the story of\n\n04:44.640 --> 04:50.720\n how he got the idea for that paper in a bar. So that was also an interesting backstory. I also\n\n04:50.720 --> 04:59.040\n read a book by Cedric Villani. Cedric Villani is this mathematician, a Fields Medalist. And in his\n\n04:59.040 --> 05:05.760\n book, he tries to explain how he got from a PhD student to the Fields Medal. And he tries to be\n\n05:05.760 --> 05:11.360\n as descriptive as possible, every single step, how he got to the Fields Medal. And it's interesting\n\n05:11.360 --> 05:16.800\n also to see just the amount of random interactions and discussions with other researchers, sometimes\n\n05:16.800 --> 05:22.160\n over coffee, and how it led to like fundamental breakthroughs and some of his most important\n\n05:22.160 --> 05:25.920\n papers. So I think it's super interesting to have that context of the backstory.\n\n05:25.920 --> 05:29.600\n Well, the Ian Goodfellow story is kind of interesting, and perhaps that's true for\n\n05:29.600 --> 05:35.600\n Feynman as well. I don't know if it's romanticizing the thing, but it seems like just a few little\n\n05:35.600 --> 05:41.840\n insights and a little bit of work does most of the leap required. Do you have a sense that for a lot\n\n05:41.840 --> 05:49.200\n of the stuff you've looked at, just looking back through history, it wasn't necessarily the grind\n\n05:49.920 --> 05:55.760\n of like Andrew Wiles or the Fermat's Last Theorem, for example. It was more like a brilliant moment\n\n05:55.760 --> 06:02.640\n of insight. In fact, Ian Goodfellow has a kind of sadness to him almost, in that at that time in\n\n06:02.640 --> 06:10.480\n machine learning, like at that time, especially for GANs, you could code something up really\n\n06:10.480 --> 06:18.000\n quickly in a single machine and almost do the invention, go from idea to experimental validation\n\n06:18.000 --> 06:22.800\n in like a single night, a single person could do it. And now there's kind of a sadness that a lot\n\n06:22.800 --> 06:27.440\n of the breakthroughs you might have in machine learning kind of require large scale experiments.\n\n06:27.440 --> 06:35.040\n So it was almost like the early days. So I wonder how many low hanging fruit there are\n\n06:35.040 --> 06:41.920\n in science and mathematics and even engineering where it's like you could do that little experiment\n\n06:41.920 --> 06:46.560\n quickly, like you have an insight in a bar. Why is it always a bar? But you have an insight at a bar\n\n06:46.560 --> 06:53.600\n and then just implement and the world changes. It's a good point. I think it also depends a lot\n\n06:53.600 --> 06:59.680\n on the maturity of the field. When you look at a field like mathematics, like it's a pretty mature\n\n06:59.680 --> 07:07.040\n field, a field like machine learning, it's growing pretty fast. And it's actually pretty\n\n07:07.040 --> 07:14.880\n interesting. I looked up like the number of new papers on archive with the keyword machine learning\n\n07:14.880 --> 07:20.960\n and like 50% of those papers have been published in the last 12 months. So you can see just the\n\n07:20.960 --> 07:29.680\n 5.0, 50%. So you can see the magnitude of growth in that field. And so I think like as fields\n\n07:29.680 --> 07:37.280\n mature, like those types of moments, I think naturally are less frequent. It's just a consequence\n\n07:37.280 --> 07:42.560\n of that. The other point that is interesting about the backstory is that it can really make it\n\n07:42.560 --> 07:47.680\n more memorable in a way. And by making it more memorable, it kind of sediments the knowledge\n\n07:47.680 --> 07:54.800\n more in your mind. I remember also reading the sort of the backstory to Dijkstra's shortest path\n\n07:54.800 --> 08:03.440\n algorithm. He came up with it essentially while he was sitting down at a coffee shop in Amsterdam.\n\n08:03.440 --> 08:09.120\n And he came up with that algorithm over 20 minutes. And one interesting aspect is he didn't have any\n\n08:09.120 --> 08:13.600\n pen or paper at the time. And so he had to do it all in his mind. And so there's only so much\n\n08:13.600 --> 08:18.160\n complexity that he can handle if you're just thinking about it in your mind. And that like\n\n08:18.160 --> 08:24.720\n when you think about the simplicity of Dijkstra's shortest path finding algorithm, it's knowing that\n\n08:24.720 --> 08:30.080\n backstory helps sediment that algorithm in your mind so that you don't forget about it as easily.\n\n08:30.080 --> 08:38.240\n It might be from you that I saw a meme about Dijkstra. It's like he's trying to solve it and\n\n08:38.240 --> 08:45.680\n he comes up with some kind of random path. And then it's like my parents aren't home. And then\n\n08:45.680 --> 08:53.840\n he does. He figures out the algorithm for the shortest path. He tried through words to convey\n\n08:53.840 --> 08:59.840\n memes, but it's hilarious. I don't know if it's in post that we construct stories that romanticize\n\n08:59.840 --> 09:05.440\n it. Apparently with Newton, there was no apple. Especially when you're working on problems that\n\n09:05.440 --> 09:11.280\n have a physical manifestation or a visual manifestation, it feels like the world\n\n09:12.240 --> 09:19.520\n could be an inspiration to you. So it doesn't have to be completely on paper. Like you could\n\n09:19.520 --> 09:25.360\n be sitting at a bar and all of a sudden see something and a pattern will spark another\n\n09:25.360 --> 09:31.200\n pattern and you can visualize it and rethink a problem in a particular way. Of course, you can\n\n09:31.200 --> 09:35.440\n also load the math that you have on paper and always carry that with you. So when you show up to\n\n09:35.440 --> 09:40.320\n the bar, some little inspiration could be the thing that changes it. Is there any other people\n\n09:41.360 --> 09:44.640\n almost on the human side, whether it's physics with Feynman,\n\n09:45.920 --> 09:51.680\n Dirac, Einstein, or computer science, Turing, anybody else? Any backstories that you remember\n\n09:51.680 --> 09:58.160\n that jump out? Because I'm also referring to not necessarily these stories where something magical\n\n09:58.160 --> 10:04.640\n happens, but these are personalities. They have big egos. Some of them are super friendly. Some of\n\n10:04.640 --> 10:11.360\n them are like self obsessed. Some of them have anger issues. Some of them, how do I describe\n\n10:11.360 --> 10:19.040\n Feynman? But he appears to have a appreciation of the beautiful in all its forms. He has a wit\n\n10:19.040 --> 10:24.400\n and a cleverness and a humor about him. So does that come into play in terms of the construction\n\n10:24.400 --> 10:29.600\n of the science? Well, I think you brought up Newton. Newton is a good example also to think\n\n10:29.600 --> 10:35.200\n about his backstory because there's a certain backstory of Newton that people always talk about,\n\n10:35.200 --> 10:41.120\n but then there's a whole another aspect of him that is also a big part of the person that he was,\n\n10:41.120 --> 10:48.000\n but he was really into alchemy and that he spent a lot of time thinking about that and writing\n\n10:48.000 --> 10:53.040\n about it and he took it very seriously. He was really into Bible interpretation, trying to\n\n10:53.040 --> 10:58.080\n predict things based on the Bible. And so there's also a whole backstory then and of course you need\n\n10:58.080 --> 11:06.320\n to look at it in the context and the time that when Newton lived, but it adds to his personality\n\n11:06.320 --> 11:12.960\n and it's important to also understand those aspects that maybe people are not as proud to\n\n11:12.960 --> 11:18.320\n teach to little kids, but it's important. It was part of who he was and maybe without those,\n\n11:18.320 --> 11:23.360\n who knows what he would have done otherwise. Well, the cool thing about alchemy,\n\n11:24.320 --> 11:29.280\n I don't know how it was viewed at the time, but it almost like to me symbolizes\n\n11:30.480 --> 11:36.320\n dreaming of the impossible. Like most of the breakthrough ideas kind of seem impossible\n\n11:36.320 --> 11:40.960\n until they're actually done. It's like achieving human flight. It's not completely obvious to me\n\n11:40.960 --> 11:48.160\n that alchemy is impossible or putting myself in the mindset of the time. And perhaps even still,\n\n11:49.200 --> 11:55.680\n everything that some of the most incredible breakthroughs would seem impossible.\n\n11:56.560 --> 12:04.880\n And I wonder the value of believing, almost like focusing and dreaming of the impossible,\n\n12:04.880 --> 12:09.200\n such that it actually is possible in your mind and that in itself manifests\n\n12:09.200 --> 12:14.720\n whether the accomplishing that goal or making progress in some unexpected direction.\n\n12:14.720 --> 12:19.920\n So alchemy almost symbolizes that for me. I distinctly remember having the same thought\n\n12:19.920 --> 12:24.000\n of thinking, when I learned about atoms and that they have protons and electrons,\n\n12:24.000 --> 12:28.320\n I was like, okay, to make gold, you just take whatever has an atomic weight below it and then\n\n12:28.320 --> 12:32.880\n shove another proton in there and then you have a bunch of gold. So like, why don't people do that?\n\n12:33.440 --> 12:37.840\n It seemed like conceptually is like, this sounds feasible. You might be able to do it,\n\n12:37.840 --> 12:41.760\n you might be able to do it. And you can actually, it's just very, very expensive.\n\n12:41.760 --> 12:48.560\n Yeah, exactly. So in a sense we do have alchemy and maybe even back then it wasn't as crazy that\n\n12:48.560 --> 12:54.720\n he was so into it, but people just don't like to talk about that as much. But Newton in general\n\n12:54.720 --> 13:01.760\n was a very interesting fellow. Anybody else come to mind? In terms of people that inspire you,\n\n13:01.760 --> 13:07.840\n in terms of people that you just are happy that they have once or still exist on this earth?\n\n13:08.720 --> 13:11.360\n I think, I mean, Freeman Dyson for me.\n\n13:12.080 --> 13:17.840\n Yeah, Freeman Dyson was, I've had a chance to actually exchange a couple of emails with him.\n\n13:17.840 --> 13:23.200\n It was probably one of the most humble scientists that I've ever met. And that had a big impact\n\n13:23.200 --> 13:29.600\n on me. We were trying, we're actually trying to convince him to annotate a paper on Fermat's\n\n13:29.600 --> 13:37.120\n library. And I sent him an email asking him if he could annotate a paper. And his response was\n\n13:37.120 --> 13:42.400\n something like, I have very limited knowledge. I just know a couple of things about certain fields.\n\n13:42.400 --> 13:48.880\n I'm not sure if I'm qualified to do that. That was his first response. And this was someone that\n\n13:48.880 --> 13:53.360\n should have won an Obel prize and worked on a bunch of different fields, did some really,\n\n13:53.360 --> 13:59.520\n really great work. And then just the interactions that I had with him, every time I asked him a\n\n13:59.520 --> 14:05.520\n couple of questions about his papers, and he always responded saying, I'm not here to answer\n\n14:05.520 --> 14:13.120\n your questions. I just want to open more questions. And so that had a big impact on me. It was like\n\n14:13.120 --> 14:21.920\n just an example of an extremely humble, yet accomplished scientist. And Feynman was also\n\n14:21.920 --> 14:29.280\n a big, big inspiration in the sense that he was able to be, again, extremely talented and scientist,\n\n14:29.280 --> 14:34.960\n but at the same time, socially, he was able to, he was also really smart from a social perspective.\n\n14:35.520 --> 14:42.400\n And he was able to interact with people. He was also a really good teacher and was also to did\n\n14:43.040 --> 14:49.760\n awesome work in terms of explaining physics to the masses and motivating and getting people\n\n14:49.760 --> 14:53.680\n interested in physics. And that for me was, was also a big inspiration.\n\n14:54.640 --> 14:57.920\n Yeah. I liked the childlike curiosity of some of those folks that you mentioned,\n\n14:57.920 --> 15:03.440\n Feynman. I've, Daniel Kahneman, I got a chance to meet and interact with some of these truly\n\n15:03.440 --> 15:10.880\n special scientists. What makes them special is that even in older age, there's still like,\n\n15:10.880 --> 15:17.440\n there's still that fire of childlike curiosity that burns. And some of that is like not taking\n\n15:17.440 --> 15:21.760\n yourself so seriously that you think you've figured it all out, but almost like thinking that\n\n15:21.760 --> 15:31.680\n you don't know much of it. And that's like step one in having a great conversation or collaboration\n\n15:31.680 --> 15:37.280\n or exploring a scientific question. And it's cool how the very thing that probably earned people\n\n15:37.280 --> 15:45.440\n the Nobel prize or, or work that's seminal in some way is the very thing that still burns even after\n\n15:45.440 --> 15:50.000\n they've won the prize. It's cool to see. And they're rare humans, it seems.\n\n15:50.000 --> 15:54.560\n And to that point, I remember like the last email that I sent to Freeman Dyson was like in his last\n\n15:54.560 --> 16:00.800\n birthday, he was really into number theory and primes. So what I did is I took like a photo of\n\n16:00.800 --> 16:07.680\n him picture, and then I turned that into like a giant prime number. So I converted the picture\n\n16:07.680 --> 16:13.040\n into a bunch of one and eights. And then I moved some numbers around until it was a prime. And\n\n16:13.040 --> 16:18.320\n then I sent him that. Oh, so the, the visual, like it's still look like the picture, it's made up of\n\n16:18.320 --> 16:24.400\n a prime. That's tricky to do. It's hard to do. It looks harder than it actually is. So the way you\n\n16:24.400 --> 16:29.600\n do it is like you convert the darker regions into eights and the lighter regions in ones.\n\n16:30.160 --> 16:35.760\n And then there's... And then just keep flipping numbers until... But there's like some primality\n\n16:35.760 --> 16:41.520\n tests that are cheaper from a computational standpoint. But what it gives you is like\n\n16:41.520 --> 16:46.080\n it excludes numbers that are not prime. Then you end up with a set of numbers that you don't know\n\n16:46.080 --> 16:50.880\n if they are prime or not. And then you run the full primality test on that. So you just have to\n\n16:50.880 --> 16:55.280\n keep iterating on that. And it was, it's funny because when you got the picture, it was like,\n\n16:55.280 --> 17:00.240\n how did you do that? It was super curious too. And then we got into the details. And again,\n\n17:00.240 --> 17:06.000\n this was, it was already 90, I think 92 or something. And that curiosity was still there.\n\n17:06.000 --> 17:09.520\n So you can really see that in some of these scientists.\n\n17:10.080 --> 17:11.920\n So could we talk about Fermat's library?\n\n17:12.880 --> 17:13.920\n Yeah, absolutely.\n\n17:13.920 --> 17:18.080\n What is it? What's the main goal? What's the dream?\n\n17:18.640 --> 17:24.160\n It is a platform for annotating papers in its essence, right? And so academic papers can be\n\n17:24.160 --> 17:31.200\n one of the densest forms of content out there and generally pretty hard to understand at times. And\n\n17:31.200 --> 17:36.400\n the idea is that you can make them more accessible and easier to understand by adding these rich\n\n17:36.400 --> 17:41.200\n annotations to the site, right? And so we can just imagine a PDF view on your browser, and then you\n\n17:41.200 --> 17:45.360\n have annotations on each side. And then when you click on them, a sidebar expands and then you have\n\n17:46.240 --> 17:51.760\n annotations that support LaTeX and Markdown. And so the idea is that you can, say, explain a\n\n17:51.760 --> 17:56.560\n tougher part of a paper where there's a step that is not completely obvious. And then you can\n\n17:56.560 --> 18:04.560\n add more context to it. And then over time, papers can become easier and easier to understand and can\n\n18:04.560 --> 18:11.920\n evolve in a way. But it really came from myself, Luis, and two other friends. We've had this\n\n18:11.920 --> 18:17.040\n long running habit of kind of running a journal club amongst us. We come from different backgrounds,\n\n18:17.040 --> 18:21.600\n right? I studied CS, we studied physics. And so we'd read papers and present them to the\n\n18:21.600 --> 18:30.320\n each other. And then we tried to bring some of that online. And that's when we decided to\n\n18:30.320 --> 18:39.120\n build Fermat's library. And then over time, it kind of grew into something with a broader goal.\n\n18:40.480 --> 18:46.160\n And really, what we're trying to do is trying to help move science in the right direction.\n\n18:46.160 --> 18:52.880\n That's really the ultimate goal and where we want to take it now.\n\n18:52.880 --> 18:56.960\n Well, so there's a lot to be said. So first of all, for people who haven't seen it,\n\n18:58.160 --> 19:02.960\n the interface is exceptionally well done. Execution is really important here.\n\n19:02.960 --> 19:03.760\n Absolutely.\n\n19:03.760 --> 19:10.000\n The other thing is just to mention for a large number of people, apparently, which is new to me,\n\n19:10.000 --> 19:16.640\n don't know what LaTeX is. So it's spelled like LaTeX. So be careful googling it if you haven't\n\n19:16.640 --> 19:21.600\n before. It's a, sorry, I don't even know the correct terminology.\n\n19:21.600 --> 19:22.320\n Type setting language?\n\n19:22.320 --> 19:28.400\n It's a type setting language where you're basically program, writing a program that\n\n19:28.400 --> 19:34.160\n then generates something that looks, from a typography perspective, beautiful.\n\n19:34.160 --> 19:34.880\n Absolutely.\n\n19:34.880 --> 19:41.600\n And so a lot of academics use it to write papers. I think there's like a bunch of communities that\n\n19:41.600 --> 19:46.240\n use it to write papers. I would say it's mathematics, physics, computer science.\n\n19:47.120 --> 19:47.520\n Yeah.\n\n19:47.520 --> 19:49.440\n That's, yeah, that's the main.\n\n19:49.440 --> 19:54.400\n Because I'm collaborating currently on a paper with two neuroscientists from Stanford.\n\n19:54.400 --> 19:55.440\n And they don't know LaTeX.\n\n19:55.440 --> 20:04.640\n So I'm using Microsoft Word and Mendeley, and like all of those kinds of things. And I'm being\n\n20:04.640 --> 20:10.720\n very zen like about the whole process, but it's fascinating. It's a little heartbreaking actually,\n\n20:11.680 --> 20:18.480\n because it actually, it's funny to say, but, and we'll talk about open science, actually,\n\n20:18.480 --> 20:20.800\n the bigger mission behind Fermat's library is like,\n\n20:20.800 --> 20:28.480\n really opening up the world of science to everybody. Is these silly two facts of like\n\n20:28.480 --> 20:35.200\n one community uses LaTeX and another uses Word, is actually a barrier between them.\n\n20:35.840 --> 20:40.560\n That's like, it's like boring and practical in a sense, but it makes it very difficult to collaborate.\n\n20:41.360 --> 20:46.000\n Just on that, like, I think there are some people that should have received like a Nobel\n\n20:46.000 --> 20:51.120\n Prize, but will never get it. And I think one of those is like Donald Knuth, because of tech\n\n20:51.120 --> 20:57.680\n and LaTeX. And then, because it had a huge impact in terms of like just making it easier for\n\n20:57.680 --> 21:02.880\n researchers to put their content out there, like making it uniform as much as possible.\n\n21:02.880 --> 21:05.040\n Oh, you mean like a Nobel Peace Prize?\n\n21:05.040 --> 21:12.240\n Maybe a Nobel Peace Prize. Maybe a Nobel Peace Prize. Yeah, yeah, yeah. I don't know.\n\n21:12.240 --> 21:17.120\n Maybe a Nobel Peace Prize. Yeah, yeah, yeah. I think so.\n\n21:17.120 --> 21:21.840\n I mean, he at a very young age, got the Turing Award for his work in algorithms and so on. So\n\n21:21.840 --> 21:27.760\n like an incredibly, I think it's in, it might be even the sixties, but I think it's the seventies.\n\n21:27.760 --> 21:33.360\n So when he was really young and then he went on to do like incredible work with his book\n\n21:33.360 --> 21:36.400\n and yeah, with tech that people don't know.\n\n21:36.400 --> 21:41.760\n And going back just on the reason why we ended up, because I think this is interesting. The reason\n\n21:41.760 --> 21:47.760\n why we ended up using the name Fermat's Library, this was because of Fermat's Last Theorem. And\n\n21:47.760 --> 21:53.680\n Fermat's Last Theorem is actually a funny story. So Pierre de Fermat, he was like a lawyer and he\n\n21:54.400 --> 22:01.760\n wrote like on a book that he had a solution to Fermat's Last Theorem, which, but that didn't\n\n22:01.760 --> 22:08.720\n fit the margin of that book. And so Fermat's Last Theorem basically states that there's no solution.\n\n22:08.720 --> 22:14.480\n If you have integers a, b and c, there's no solution to a to the power of n plus b to the\n\n22:14.480 --> 22:21.920\n power of n equals to c to the power of n, if n is bigger than two. So there's no solutions.\n\n22:21.920 --> 22:30.560\n And he said that, and that problem remained open for almost 300 years, I believe. And a lot of the\n\n22:30.560 --> 22:35.680\n most famous mathematicians tried to tackle that problem. No one was able to figure that out until\n\n22:35.680 --> 22:42.160\n Andrew Wiles, I think was in the 90s, was able to publish the solution, which was, I believe, almost\n\n22:42.160 --> 22:49.360\n 300 pages long. And so it's kind of an anecdote that, you know, there's a lot of knowledge and\n\n22:50.000 --> 22:55.760\n insights that can be trapped in the margins. And there's a lot of potential energy that you can\n\n22:55.760 --> 23:03.920\n release if you actually spend some time trying to digest that. And that was the origin story for\n\n23:03.920 --> 23:09.840\n for the name. Yes, you can share the contents of the margins with the world that could inspire\n\n23:09.840 --> 23:15.680\n a solution or a communication that then leads to a solution. And if you think about papers,\n\n23:15.680 --> 23:21.600\n like papers are, as Joan was saying, probably one of the densest pieces of text that any human can\n\n23:21.600 --> 23:27.200\n read. And you have these researchers, like some of the brightest minds in these fields, working on\n\n23:27.200 --> 23:32.480\n like new discoveries and publishing these work on journals that are imposing them restrictions in\n\n23:32.480 --> 23:38.160\n terms of the number of pages that they can have to explain a new scientific breakthrough. So at the\n\n23:38.160 --> 23:45.840\n end of the day, papers are not optimized for clarity and for a proper explanation of that\n\n23:45.840 --> 23:50.320\n content because there are so many restrictions. So there's, as I mentioned, there's a lot of\n\n23:50.320 --> 23:57.040\n potential energy that can be freed if you actually try to digest a lot of the contents of papers.\n\n23:57.040 --> 24:02.240\n Trey Lockerbie Can you explain some of the other things? So margins, librarian, journal club?\n\n24:02.240 --> 24:06.880\n Ofer Yusuf So journal club is what a lot of people know us for, where we every week,\n\n24:06.880 --> 24:11.760\n we release an annotated paper and in all sorts of different fields, but physics, CS, math,\n\n24:12.480 --> 24:16.960\n margins is kind of the same software that we use to run the journal club and to\n\n24:16.960 --> 24:22.240\n host the annotations. But we've made that available for free to anybody that wants to use it. And so\n\n24:22.240 --> 24:29.280\n folks use it at universities and for running journal clubs. And so we've just made that freely\n\n24:29.280 --> 24:34.400\n available. And then librarian is a browser extension that we developed that is sort of an\n\n24:34.400 --> 24:40.720\n overlay on top of archive. So it's about bringing some of the same functionality around comments,\n\n24:40.720 --> 24:48.320\n plus adding some extra niceties to archive, like being able to very easily extract the references\n\n24:48.320 --> 24:52.560\n of a paper that you're looking at or being able to extract the bib deck in order to cite that\n\n24:52.560 --> 24:57.280\n paper yourself. So it's an overlay on top of archive. The idea is that you can have that\n\n24:57.280 --> 25:01.760\n commenting interface without having to leave archive. Trey Lockerbie It's kind of incredible.\n\n25:01.760 --> 25:10.240\n I didn't know about it. And once I learned of it, it's like, holy shit. Why isn't it more popular,\n\n25:10.240 --> 25:14.880\n given how popular archive is? Like everybody should be using it. Archive sucks in terms of\n\n25:14.880 --> 25:19.920\n its interface. Let me rephrase that. It's limited in terms of its interface.\n\n25:19.920 --> 25:29.120\n Archive is a pretty incredible project. And it is, in a way, the growth has been completely\n\n25:29.120 --> 25:34.560\n linear over time. If you look at the number of papers published on archive, it's pretty much\n\n25:34.560 --> 25:40.400\n a straight line for the past 20 years. Especially if you're coming from a startup background and\n\n25:40.400 --> 25:47.200\n then you were trying to do archive, you'd probably try all sorts of growth acts and try to then maybe\n\n25:47.200 --> 25:53.120\n have paid features and things like that. And that would kind of maybe ruin it. And so there's a\n\n25:53.120 --> 25:57.760\n subtle balance there. And I don't know what aspects you can change about it.\n\n25:57.760 --> 26:04.400\n For some tools in science, it just takes time for them to grow. Archive has just turned 30,\n\n26:04.400 --> 26:09.120\n I believe. And for people that don't know, archive is these kind of online repositories\n\n26:09.120 --> 26:15.440\n where people put preprints, which are versions of the papers, before they actually make it to journals.\n\n26:15.440 --> 26:23.120\n A R X I V, for people who don't know. And it's actually a really vibrant place to publish your\n\n26:23.120 --> 26:29.360\n papers in the aforementioned communities of mathematics, physics, and computer science.\n\n26:29.360 --> 26:34.800\n It started with mathematics and physics, and then over the last 30 years, it evolved. And now,\n\n26:34.800 --> 26:40.640\n actually computer science now, it's a more popular category than physics and math on archive.\n\n26:40.640 --> 26:46.160\n And there's also, which I don't know very much about, like a biology, medical version of that.\n\n26:46.160 --> 26:54.160\n Bioarchive. Yeah, bioarchive. It's interesting because if you look at these platforms for\n\n26:54.160 --> 27:01.360\n preprints, they actually play a super important role. Because if you look at a category like math,\n\n27:01.360 --> 27:08.880\n for some papers in math, it might take close to three years after you click upload paper on the\n\n27:08.880 --> 27:14.240\n journal website, and the paper gets published on the website of the journal. So this is literally\n\n27:14.240 --> 27:24.080\n the longest upload period on the internet. And during those three years, their content is just\n\n27:24.720 --> 27:29.920\n locked. And so that's why it's so important for people to have websites that are open to\n\n27:29.920 --> 27:35.200\n people to have websites like archive so that you can share that before it goes to the journal\n\n27:35.200 --> 27:40.640\n with the rest of the world. There was actually on archive that Perelman published the three\n\n27:40.640 --> 27:45.760\n papers that led to the proof of the Poincare conjecture. And then you have other fields like\n\n27:46.640 --> 27:52.320\n machine learning, for instance, where the field is evolving at such a high rate that people don't\n\n27:52.320 --> 27:57.520\n even wait before the papers go to journals before they start working on top of those papers. So they\n\n27:57.520 --> 28:02.240\n publish them on archive, then other people see them, they start working on that. And archive did\n\n28:02.240 --> 28:07.840\n a really good job at building that core platform to host papers. But I think there's a really,\n\n28:07.840 --> 28:13.040\n really big opportunity in building more features on top of that platform, apart from just hosting\n\n28:13.040 --> 28:19.440\n papers. So collaboration, annotations, and having other things apart from papers like code\n\n28:20.880 --> 28:24.960\n and other things. Because, for instance, in the field like machine learning,\n\n28:24.960 --> 28:29.920\n there's a really big, as I mentioned, people start working on top of preprints, and they are\n\n28:29.920 --> 28:38.000\n assuming that preprint is correct. But you really need a way, for instance, to maybe, it's not peer\n\n28:38.000 --> 28:44.320\n review, but distinguish what is good work from bad work on archive. How do you do that? So like\n\n28:44.320 --> 28:50.960\n a commenting interface like librarian, it's useful for that so that you can distinguish that in a\n\n28:50.960 --> 28:56.400\n field that is growing so fast as machine learning. And then you have platforms that focus, for\n\n28:56.400 --> 29:02.960\n instance, on just biology. BioArchive is a good example. BioArchive is also super interesting\n\n29:02.960 --> 29:11.200\n because there's actually an interesting experiment that was run in the 60s. So in the 60s, the NIH\n\n29:12.400 --> 29:19.680\n supported this experiment called the Information Exchange Group, which at the time was a way for\n\n29:19.680 --> 29:27.280\n researchers to share biology preprints via mail or using libraries. And that project in the 1960s\n\n29:27.280 --> 29:32.880\n got canceled six years after it started. And it was due to intense pressure from the journals\n\n29:32.880 --> 29:41.360\n to kill that project because they were fearing competition from the preprints for the journal\n\n29:41.360 --> 29:50.400\n industry. Crick was one of the famous scientists that opposed to the Information Exchange Group.\n\n29:50.400 --> 29:55.920\n And it's interesting because right now, if you analyze the number of biology papers that appear\n\n29:55.920 --> 30:03.520\n first as preprints, it's only 2% of the papers. And this was almost 50 years after that first\n\n30:03.520 --> 30:08.960\n experiment. So you can see that pressure from the journals to cancel that initial version of a\n\n30:08.960 --> 30:15.840\n preprint repo had a tremendous impact on the number of papers that are showing up in biology\n\n30:15.840 --> 30:24.000\n as preprints. So it delayed a lot that revolution. But now platforms like BioArchive are doing that\n\n30:24.000 --> 30:28.240\n work. But there's still a lot of room for growth there. And I think it's super important because\n\n30:28.240 --> 30:33.520\n those are the papers that are open that everyone can read. Okay. But if we just look at the entire\n\n30:33.520 --> 30:40.720\n process of science as a big system, can we just talk about how it can be revolutionized? So you\n\n30:40.720 --> 30:46.960\n have an idea, depending on the field, you want to make that idea concrete, you want to run a few\n\n30:46.960 --> 30:53.920\n experiments in computer science, there might be some code, there'd be a data set for, you know,\n\n30:53.920 --> 31:02.240\n some of the more sort of biology, psychology, you might be collecting the data set that's called,\n\n31:02.240 --> 31:07.920\n you know, a study, right? So that's part of that, that's part of the methodology.\n\n31:08.480 --> 31:16.640\n And so you are putting all that into a paper form. And then you have some results. And then you\n\n31:16.640 --> 31:23.760\n submit that to a place for review through the peer review process. And there's a process where,\n\n31:23.760 --> 31:28.960\n how would you summarize the peer review process? But it's really just like a handful of people look\n\n31:28.960 --> 31:34.640\n over your paper and comment. And based on that, decide whether your paper is good or not. So\n\n31:34.640 --> 31:40.480\n there's a whole broken nature to it. At the same time, I love the peer review process when I buy\n\n31:40.480 --> 31:48.480\n stuff on Amazon, like for like the commenting system, whatever that is. So, okay. So there's\n\n31:48.480 --> 31:53.120\n a bunch of possibilities for revolutions there. And then there's the other side, which is the\n\n31:53.120 --> 31:58.720\n collaborative aspect of the science, which is people annotating, people commenting, sort of the\n\n31:58.720 --> 32:04.400\n low effort collaboration, which is a comment. Sometimes, as you've talked about, a comment can\n\n32:04.400 --> 32:10.320\n change everything. But, you know, or a higher effort collaboration, like more like maybe\n\n32:10.320 --> 32:17.280\n annotations, or even like contributing to the paper, you can think of like, collaborative\n\n32:17.280 --> 32:24.800\n updating of the paper over time. So there's all these possibilities for doing things better than\n\n32:24.800 --> 32:31.040\n they've been done. Can we talk about some ideas in this space? Some ideas that you're working on,\n\n32:31.040 --> 32:36.320\n some ideas that you're not yet working on, but should be revolutionized? Because it does seem\n\n32:37.120 --> 32:44.640\n that archive and like open review, for example, are like the craigslist of science. Like,\n\n32:45.360 --> 32:53.040\n like, yeah, okay. I'm very grateful that we have it. But it just feels like, it's like 10 to 20\n\n32:53.040 --> 32:58.240\n years. Like, it doesn't feel like that's a feature. The simplicity of it is a feature. It feels like\n\n32:58.240 --> 33:07.200\n it's a, it's a bug. But then again, the pushback there is Wikipedia has the same kind of simplicity\n\n33:07.200 --> 33:14.320\n to it. And it seems to work exceptionally well in the crowdsourcing aspect of it. So I'm sorry,\n\n33:14.320 --> 33:19.360\n there's a bunch of stuff going on on the table. Let's just pick random things that we can talk\n\n33:19.360 --> 33:24.640\n about. Wikipedia, you know, for me, it's the cosmological constant of the internet. It's,\n\n33:24.640 --> 33:29.280\n I think we are lucky to live in the parallel universe where Wikipedia exists. Yes. Because\n\n33:29.280 --> 33:35.360\n if someone had pitched me Wikipedia, like a publicly edited encyclopedia, like a couple of\n\n33:35.360 --> 33:40.000\n years ago, like it would be, I don't know how many people would have said that that would have\n\n33:40.640 --> 33:45.520\n survived. I mean, it makes almost no sense. It's like having a Google doc that everybody on the\n\n33:45.520 --> 33:51.120\n internet can edit. And like, that will be like the most reliable source for knowledge. And I don't\n\n33:51.120 --> 33:58.240\n know how many, but hundreds of thousands of topics. Yeah. It's insane. It's insane. And like you have,\n\n33:58.240 --> 34:03.920\n and then you have users, like there's one single user that edited one third of the articles on\n\n34:03.920 --> 34:10.400\n Wikipedia. So we have these really, really big power users. There are a substantial part of like\n\n34:10.400 --> 34:18.400\n what makes Wikipedia successful. And so like, no one would have ever imagined that that could\n\n34:18.400 --> 34:24.400\n happen. And so that's one thing. I completely agree with what you just said. I also...\n\n34:24.400 --> 34:28.880\n Sorry to interrupt briefly. Maybe let's inject that into the discussion of everything else.\n\n34:29.920 --> 34:35.280\n I also believe, I've seen that with Stack Overflow, that one individual or a small collection of\n\n34:35.280 --> 34:42.000\n individuals contribute or revolutionized most of the community. Like if you create a really\n\n34:42.000 --> 34:50.960\n powerful system for archive or like open review and made it really easy and compelling and exciting\n\n34:50.960 --> 34:57.840\n for one person who is like a 10x contributor to do their thing, that's going to change everything.\n\n34:57.840 --> 35:02.240\n It seems like that was the mechanism that changed everything for Wikipedia. And that's the mechanism\n\n35:02.240 --> 35:07.600\n that changed everything for Stack Overflow. Is gamifying or making it exciting or just making\n\n35:07.600 --> 35:15.280\n it fun or pleasant or fulfilling in some way for those people who are insane enough to like answer\n\n35:15.280 --> 35:21.920\n thousands of questions or write thousands of factoids and like research them and check them,\n\n35:21.920 --> 35:25.040\n all those kinds of things, or read thousands of papers.\n\n35:25.040 --> 35:31.360\n Yeah. No, Stack Overflow is another great example of that. And it's just, and those are both to\n\n35:31.360 --> 35:38.720\n do incredibly productive communities that generate a ton of value and capture almost none of it.\n\n35:38.720 --> 35:49.840\n Right. And it's in a way, it's almost like, it's very counterintuitive that these communities would\n\n35:49.840 --> 35:57.760\n exist and thrive. And it's really hard to, there aren't that many communities like that.\n\n35:57.760 --> 36:01.280\n Right. So how do we do that for science? Do you have ideas there?\n\n36:01.280 --> 36:04.800\n Like what are the biggest problems that you see? You're working on some of them.\n\n36:05.440 --> 36:09.120\n Like just on that, there are a couple of really interesting experiments that people are running.\n\n36:09.120 --> 36:15.440\n An example would be like the Polymath projects. So this is a kind of a social experiment that was\n\n36:16.400 --> 36:22.320\n created by Tim Gowers, Fields Medalist. And his idea was to try to prove that,\n\n36:22.320 --> 36:29.440\n is it possible to do mathematics in a massively collaborative way on the internet? So he decided\n\n36:29.440 --> 36:36.640\n to pick a couple of problems and test that. And they found out that it actually is possible for\n\n36:36.640 --> 36:42.400\n specific types of problems, namely problems that you're able to break down in little pieces and\n\n36:42.400 --> 36:48.240\n go step by step. You might need, as with open source, you might need people that are just kind\n\n36:48.240 --> 36:55.200\n of reorganizing the house every once in a while. And then people throw a bunch of ideas and then\n\n36:55.200 --> 36:59.520\n you make some progress, then you reorganize, you reframe the problem and you go step by step.\n\n36:59.520 --> 37:07.520\n But they were actually able to prove that it is possible to collaborate online and do progress\n\n37:07.520 --> 37:13.280\n in terms of mathematics. And so I'm confident that there are other avenues that could be\n\n37:13.280 --> 37:16.720\n explored here. Can we talk about peer review, for example?\n\n37:16.720 --> 37:23.360\n Absolutely. I think in terms of the peer review, I think it's important to look at the bigger\n\n37:23.360 --> 37:32.480\n picture here of what the scientific publishing ecosystem looks like. Because for me, there are\n\n37:32.480 --> 37:39.440\n a lot of things that are wrong about that entire process. So if you look at what publishing means\n\n37:39.440 --> 37:48.240\n in a traditional journal, you have journals that pay authors for their articles, and then they might\n\n37:48.240 --> 37:56.400\n pay reviewers to review those articles. And finally, they pay people or distributors to\n\n37:56.400 --> 38:02.320\n distribute the content. In the scientific publishing world, you have scientists that are\n\n38:02.320 --> 38:07.040\n usually backed by government grants. They are giving away their work for free in the form of\n\n38:07.040 --> 38:13.680\n papers. And then you have other scientists that are reviewing their work. This process is known\n\n38:13.680 --> 38:21.120\n as the peer review process, again for free. And then finally, we have government backed\n\n38:21.120 --> 38:29.440\n universities and libraries that are buying back all that work so that other scientists can read.\n\n38:29.440 --> 38:33.520\n So this is, for me, it's bizarre. You have the government that is funding the research,\n\n38:33.520 --> 38:37.280\n it's paying the salaries of the scientists, it's paying the salaries of the reviewers,\n\n38:37.280 --> 38:43.840\n and it's buying back all that product of their work again. And I think the problem with this\n\n38:43.840 --> 38:52.480\n system and it's why it's so difficult to break this suboptimal equilibrium is because of the way\n\n38:52.480 --> 38:59.840\n academia works right now and the way you can progress in your academic life. And so in a lot\n\n38:59.840 --> 39:06.640\n of fields, the competition in academia is really insane. So you have hundreds of PhD students,\n\n39:06.640 --> 39:15.040\n they are trying to get to a professor position and it's hyper competitive. And the only way for\n\n39:15.040 --> 39:23.680\n you to get there is if you publish papers, ideally in journals with a high impact factor.\n\n39:23.680 --> 39:28.160\n In computer science, it's often conferences are also very prestigious or actually more\n\n39:28.160 --> 39:33.680\n prestigious than journals now. So that's the one discipline where, I mean, that has to do\n\n39:33.680 --> 39:40.800\n with the thing we've discussed in terms of how quickly the field turns around. But like NeurIPS,\n\n39:40.800 --> 39:46.880\n CVPR, those conferences are more prestigious, or at the very least as prestigious as the journals.\n\n39:47.920 --> 39:49.840\n But it doesn't matter. The process is what it is.\n\n39:51.840 --> 39:56.160\n So for people that don't know, the impact factor of a journal is basically the average number of\n\n39:56.160 --> 40:02.960\n citations that a paper would get if it gets published on that journal. But so you can really\n\n40:02.960 --> 40:11.040\n think that the problem with the impact factor is that it's a way to turn papers into accounting\n\n40:11.040 --> 40:19.680\n units. And let me unpack this because the impact factor is almost like a nobility title. Because\n\n40:19.680 --> 40:25.200\n papers are born with impact even before anyone reads them. So the researchers, they don't have\n\n40:25.200 --> 40:32.240\n the incentive to care about if this paper is going to have a long term impact on the world.\n\n40:32.240 --> 40:37.520\n What they care, their goal, their end goal is the paper to get published so that they get that\n\n40:37.520 --> 40:43.760\n value upfront. So for me, that is one of the problems of that. And that really creates a\n\n40:43.760 --> 40:49.440\n tyranny of metrics. Because at the end of the day, if you are a dean, what you want to hire is\n\n40:49.440 --> 40:55.360\n people, researchers that publish papers on journals with high impact factors because that will\n\n40:55.360 --> 40:59.920\n increase the ranking of your university and will allow you to charge more for tuition,\n\n40:59.920 --> 41:06.800\n so on and so forth. And that, especially when you are in super competitive areas,\n\n41:07.600 --> 41:14.880\n that people will try to gamify that system and misconduct starts showing up. There's a really\n\n41:14.880 --> 41:21.600\n interesting book on this topic called Gaming the Metrics. It's a book by a researcher called Mario\n\n41:21.600 --> 41:29.280\n Biagioli. It goes a lot into how the impact factor and metrics affect science negatively.\n\n41:29.280 --> 41:34.800\n And it's interesting to think, especially in terms of citations, if you look at the early work of\n\n41:34.800 --> 41:39.680\n looking at citations, there was a lot of work that was done by a guy called Eugene Garfield.\n\n41:39.680 --> 41:46.800\n And this guy, the early work in terms of citation, they wanted to use citations from a descriptive\n\n41:46.800 --> 41:52.960\n point of view. So what they wanted to create was a map. And that map would create a visual\n\n41:52.960 --> 42:00.000\n representation of influence. So citations would be links between papers. And ideally, what they\n\n42:00.000 --> 42:05.760\n would show, they would represent is that you read someone else's paper and it had an impact on your\n\n42:05.760 --> 42:12.240\n research. They weren't supposed to be counted. I think this inspired Larry and Sergey's work for\n\n42:12.240 --> 42:16.640\n Google. Exactly. I think they even mentioned that. But what happens is, as you start counting\n\n42:16.640 --> 42:25.360\n citations, you create a market. And the work of Eugene Garfield was a big inspiration for Larry\n\n42:25.360 --> 42:31.440\n and Sergey and for the PageRank algorithm that led to the creation of Google. And they even\n\n42:31.440 --> 42:37.360\n recognized that. And if you think about it, it's like the same way there's a gigantic market for\n\n42:37.360 --> 42:46.080\n search engine optimization, SEO, where people try to optimize the PageRank and how a web page will\n\n42:46.080 --> 42:52.800\n rank on Google. The same will happen for papers. People will try to optimize the impact factors\n\n42:52.800 --> 42:58.800\n and the citations that they get. And that creates a really big problem. And it's super interesting\n\n42:58.800 --> 43:05.280\n to actually analyze them. If you look at the distribution of the impact factors of journals,\n\n43:05.280 --> 43:11.600\n you have like Nature. Nature, I believe, is in the low 40s. And then you have, I believe, Science\n\n43:11.600 --> 43:20.240\n is high 30s. And then you have a really good set of good journals that will fall between 10 and 30.\n\n43:20.240 --> 43:26.880\n And then you have a gigantic tale of journals that have impact factor below 2. And you can really\n\n43:26.880 --> 43:34.960\n see two economies here. You see the universities that are maybe less prestigious, less known,\n\n43:35.840 --> 43:41.040\n where the faculty are pressured to just publish papers regardless of the journal. What I want to\n\n43:41.040 --> 43:47.120\n do is increase the ranking of my university. And so they end up publishing as many papers as they\n\n43:47.120 --> 43:53.440\n can in journals with low impact factor. And unfortunately, this represents a lot of the\n\n43:53.440 --> 44:02.320\n global south. And then you have the luxury good economy. And there are also problems here in\n\n44:02.320 --> 44:07.760\n the luxury good economy. So if you look at the journal like Nature, so with impact factor in\n\n44:07.760 --> 44:14.800\n the low 40s, there's no way that you're going to be able to sustain that level of impact factor\n\n44:14.800 --> 44:22.080\n by just grabbing the attention of scientists. What I mean by that is for the journals,\n\n44:22.080 --> 44:29.280\n the articles that get published in Nature, they need to be New York Times grade. So they need to\n\n44:29.280 --> 44:34.960\n make it to the big media. They need to be captured by the big media. And because that's the only way\n\n44:34.960 --> 44:40.960\n for you to capture enough attention to sustain that level of citations. And that, of course,\n\n44:40.960 --> 44:47.440\n creates problems because people then will try to, again, gamify the system and have like titles or\n\n44:47.440 --> 44:55.760\n abstracts or that are bigger, make claims that are bigger than what is actually can be, you know,\n\n44:55.760 --> 45:01.520\n sustained by the data or the content of the paper. And you'll have clickbait titles or clickbait\n\n45:01.520 --> 45:10.320\n abstracts. And again, this is all a consequence of science or metrics. And this is a very dangerous\n\n45:10.320 --> 45:16.240\n cycle that I think it's very hard to break, but it's happening in academia in a lot of fields\n\n45:16.240 --> 45:21.120\n right now. Is it fundamentally the existence of metrics or the metrics just need to be\n\n45:21.120 --> 45:28.080\n significantly improved? Because like I said, the metrics used for Amazon for purchasing,\n\n45:29.200 --> 45:34.400\n I don't know, computer parts is pretty damn good in terms of selecting which are the good ones,\n\n45:34.400 --> 45:42.880\n which are not. In that same way, if we had Amazon type of review system in the space of ideas,\n\n45:42.880 --> 45:46.400\n in the space of science, it feels like that those metrics would be a little bit better.\n\n45:47.280 --> 45:55.600\n Sort of when it's significantly more open to the crowdsource nature of the internet,\n\n45:55.600 --> 46:01.840\n of the scientific internet, meaning as opposed to, like my biggest problem with peer review\n\n46:02.400 --> 46:09.760\n has always been that it's like five, six, seven people, usually even less. And it's often,\n\n46:09.760 --> 46:17.440\n nobody's incentivized to do a good job in the whole process. Meaning it's anonymous in a way\n\n46:17.440 --> 46:26.960\n that doesn't incentivize, like doesn't gamify or incentivize great work. And also it doesn't\n\n46:26.960 --> 46:36.400\n necessarily have to be anonymous. Like there has to be, the entire system is, doesn't encourage\n\n46:36.400 --> 46:45.040\n actual sort of rigorous review. For example, like open review does kind of incentivize that kind of\n\n46:45.040 --> 46:50.960\n process of collaborative review, but it's also imperfect. But it just feels like the thing that\n\n46:50.960 --> 46:56.080\n Amazon has, which is like thousands of people contributing their reviews to a product,\n\n46:58.080 --> 47:04.640\n it feels like that could be applied to science where the same kind of thing you're doing with\n\n47:04.640 --> 47:11.120\n Fermat's library, but doing at a scale that's much larger. It feels like that should be possible\n\n47:11.920 --> 47:17.440\n given the number of grad students, given the number of general public that's getting,\n\n47:17.440 --> 47:24.320\n for example, I personally, as a person who got an education in mathematics and computer science,\n\n47:24.320 --> 47:35.520\n like I can be a quote unquote, like reviewer on a lot bigger set of things than is my exact\n\n47:36.160 --> 47:43.200\n expertise. If I'm one of thousands of reviewers, if I'm the only reviewer, one of five,\n\n47:43.200 --> 47:48.880\n then I better be like an expert in the thing. But if I, and I've learned this with COVID,\n\n47:48.880 --> 47:55.520\n which is like, you can just use your basic skills as a data analyst to contribute to\n\n47:55.520 --> 48:00.640\n the review process and a particular little aspect of a paper and be able to comment, be able to\n\n48:00.640 --> 48:07.200\n sort of draw in some references that challenge the ideas presented or to enrich the ideas that\n\n48:07.200 --> 48:16.240\n are presented. It just feels like crowdsourcing the review process would be able to allow you to have\n\n48:16.240 --> 48:22.640\n metrics in terms of how good a paper is that are much better representative of its actual impact\n\n48:22.640 --> 48:29.040\n in the world, of its actual value to the world, as opposed to some kind of arbitrary, gamified\n\n48:30.800 --> 48:36.880\n version of its impact. I agree with that. I think there's definitely the possibility,\n\n48:36.880 --> 48:41.600\n at least for a more resilient system than what we have today. And I think that's kind of what\n\n48:41.600 --> 48:48.560\n you're describing, Alex. I mean, to an extent, we kind of have like a little bit of a Heisenberg\n\n48:48.560 --> 48:52.960\n uncertainty principle. When you pick a metric, as soon as you do it, then maybe it works as a good\n\n48:52.960 --> 48:58.960\n heuristic for a short amount of time, but soon enough, people would start gamifying. But then\n\n48:58.960 --> 49:03.760\n you can definitely have metrics that are more resilient to gamification and they'll work as a\n\n49:03.760 --> 49:10.320\n better heuristic to try to push you in the best direction. But I guess down the line,\n\n49:10.320 --> 49:15.840\n the underlying problem you're saying is there's a shortage of positions in academia. That's a big\n\n49:15.840 --> 49:21.120\n problem for me. Yeah. And that, and so they're going to be constantly gamifying the metrics.\n\n49:21.120 --> 49:26.640\n It's a bit of a zero sum game. It's a very competitive field. And that's what usually\n\n49:26.640 --> 49:33.040\n happens in very competitive fields. Yeah. Yeah. But I think some of the peer review problems,\n\n49:33.040 --> 49:37.600\n like scale helps, I think. And it's interesting to look at what you're mentioning, breaking it\n\n49:37.600 --> 49:45.280\n down, maybe in like smaller parts and having more people jumping in. But this is definitely\n\n49:45.280 --> 49:50.400\n a problem. And the peer review problem, as I mentioned, is correlated with the problem of\n\n49:50.400 --> 49:55.840\n academic career progression. And it's all intertwined. And that's why I think it's so hard\n\n49:55.840 --> 50:01.360\n to break it. There are a couple of really interesting things that are being done right\n\n50:01.360 --> 50:06.080\n now. There are a couple of, for instance, journals that are overlay journals on top of\n\n50:06.080 --> 50:12.000\n platforms like archive and bio archive that want to remove like the more traditional journals from\n\n50:12.000 --> 50:19.280\n the equation. So essentially a journal is just a collection of links to papers. And what they're\n\n50:19.280 --> 50:24.800\n trying to do is like removing that middleman and trying to make the review process a little bit\n\n50:24.800 --> 50:33.840\n more transparent and not charging universities. There are a couple of more famous ones. There's\n\n50:33.840 --> 50:39.120\n one discrete analysis in mathematics. There's one called the quantum journal, which we're actually\n\n50:39.120 --> 50:43.760\n working with them. We have a partnership with them for the papers that get published in quantum\n\n50:43.760 --> 50:48.640\n journal. They also get the annotations on formats and they're doing pretty well. They've been able\n\n50:48.640 --> 50:53.520\n to grow substantially. The problem there is getting to critical mass. So it's again, convincing the\n\n50:53.520 --> 50:59.440\n researchers and especially the young researchers that need that impact factor, need those\n\n50:59.440 --> 51:05.760\n publications to have citations to not publish on the traditional journal and go on an open journal\n\n51:05.760 --> 51:11.120\n and publish their work there. There, I think there are a couple of really high profile scientists of\n\n51:11.120 --> 51:16.400\n people like Tim Gowers. They are trying to incentivize like famous scientists that already\n\n51:16.400 --> 51:22.240\n have tenure and that don't need that to publish that to increase the reputation of those journals.\n\n51:22.240 --> 51:27.280\n So that other maybe younger scientists can start publishing on those as well. And so that you can\n\n51:27.280 --> 51:32.960\n try to break that vicious cycle of the more traditional journals.\n\n51:32.960 --> 51:39.520\n I mean, another possible way to break this cycle is to like raise public awareness and just by\n\n51:39.520 --> 51:47.680\n force, like ban paid journals. Like what exactly are they contributing to the world? Like basically\n\n51:47.680 --> 51:55.280\n making it illegal to forget the fact that it's mostly federally funded. So that's that's\n\n51:55.280 --> 52:03.760\n a super ugly picture too. But like, why should knowledge be so expensive? Like where everyone\n\n52:03.760 --> 52:10.080\n is working for the public good. And then there's these gatekeepers that, you know, most people\n\n52:10.080 --> 52:17.600\n can't read most papers without having to pay money. And that's, that doesn't make any sense.\n\n52:17.600 --> 52:20.000\n That's like that, that should be illegal.\n\n52:20.000 --> 52:23.280\n I mean, that's what you're saying is exactly right. I mean, for instance,\n\n52:23.280 --> 52:28.880\n right, I went to school here in the US, we studied in Europe, and you would sit like you'd\n\n52:28.880 --> 52:32.640\n ask me all the time to download papers and send it to him because he just couldn't get it. And like\n\n52:32.640 --> 52:35.120\n papers that he needed for his research. And so,\n\n52:35.120 --> 52:37.920\n But he's a student, like he's a grad student.\n\n52:37.920 --> 52:42.000\n He was a grad student. But that, you know, I'm even referring to just regular people.\n\n52:42.000 --> 52:44.240\n Oh, yeah. Okay. That too. Yeah.\n\n52:44.240 --> 52:50.800\n And I think during 2020, because of COVID, a lot of journals put down the\n\n52:50.800 --> 52:56.800\n walls for certain kind of coronavirus related papers. But like, that just gave me an indication\n\n52:56.800 --> 53:03.200\n that like, this should be done for everything. It's absurd. Like people should be outraged\n\n53:03.200 --> 53:09.120\n that there's these gates. Because, so the moment you dissolve the journals,\n\n53:09.920 --> 53:16.400\n then there will be an opportunity for startups to build stuff on top of archive. It'd be an\n\n53:16.400 --> 53:22.480\n opportunity for like, for my library to step up to scale up to something much even larger.\n\n53:22.480 --> 53:28.240\n I mean, that was the original dream of Google, which I've always admired, which is make the\n\n53:28.240 --> 53:33.200\n world's information accessible. Actually, it's interesting that Google hasn't, maybe you guys\n\n53:33.200 --> 53:39.120\n can correct me, but they put together Google Scholar, which is incredible. But they, and they've\n\n53:39.120 --> 53:47.040\n did the scanning of books, but they haven't really tried to make science accessible in the following\n\n53:47.040 --> 53:54.400\n way. Like, besides doing Google Scholar, they haven't like delved into the papers, right?\n\n53:54.400 --> 53:59.120\n Which is especially curious given what Luis was saying, right? That it's kind of in their genesis.\n\n53:59.120 --> 54:04.000\n There's this, you know, research that was very connected with how papers reference each other\n\n54:04.000 --> 54:09.360\n and like building a network out of that. Interestingly enough, like Google, I think there was a,\n\n54:09.360 --> 54:14.320\n there was not intended, Google Plus was like the Google social network that got cancelled, was used\n\n54:14.320 --> 54:19.600\n by a lot of researchers. Yes, it was. Which I think was just a, you know, side, kind of a side effect.\n\n54:19.600 --> 54:23.360\n But then a lot of people ended up migrating to Twitter, but it was not on purpose. But yeah,\n\n54:23.360 --> 54:29.360\n I agree with you. Like they haven't gone past Google Scholar and I don't know why. Well, that said,\n\n54:29.360 --> 54:35.680\n Google Scholar is incredible. For people who are not familiar, it's one of the best aggregation of\n\n54:35.680 --> 54:39.920\n all the scientific work that's out there and especially the network that connects to all of\n\n54:39.920 --> 54:45.120\n them. What sites, what. And also trying to aggregate all of the versions of the papers that are\n\n54:45.120 --> 54:50.560\n available there and trying to merge them in a way that one particular work, even though it's available\n\n54:50.560 --> 54:56.720\n in a bunch of places, counts as, you know, like a central hub of what that work is, according to\n\n54:56.720 --> 55:03.280\n multiple versions. But that almost seems like a fun pet project of a couple of engineers within\n\n55:03.280 --> 55:09.520\n within Google, as opposed to a serious effort to make the world science accessible. But going back\n\n55:09.520 --> 55:16.000\n to just the journals, when you're talking about that, Lex, I believe that in that front, I think\n\n55:16.000 --> 55:23.200\n we might be past the event horizon. So I think the model, the business model for the journals,\n\n55:23.200 --> 55:27.280\n you know, doesn't make sense. They're a middle layer that is not adding a lot of value. And you\n\n55:27.280 --> 55:35.600\n see a lot of motions, whereas like in Europe, a lot of the papers that are funded by the European\n\n55:35.600 --> 55:41.920\n Union, they will have to be open to the public. And I think there's a lot of... Bill Gates too,\n\n55:41.920 --> 55:49.520\n like what the Gates Foundation funds, like the demand that it's accessible to everybody.\n\n55:49.520 --> 55:55.200\n So I think it's a question of time before that wall kind of falls. And that is going to open a\n\n55:55.200 --> 56:02.160\n lot of possibilities. Because, you know, imagine if you had like the layer of that gigantic layer\n\n56:02.160 --> 56:08.880\n of papers all available online, you know, that unlocks a lot of potential as a platform for\n\n56:08.880 --> 56:13.920\n people to build things on top of that. But to what you're saying, it is weird, like you can literally\n\n56:13.920 --> 56:20.800\n go and listen to any song that was ever made on your phone, right? You open Spotify and you might\n\n56:20.800 --> 56:24.960\n not even pay for it. You might be on the free version and you can listen to any song that was\n\n56:24.960 --> 56:33.120\n ever made, pretty much. But there's like, you don't have access to a huge percentage of academic\n\n56:33.120 --> 56:37.840\n papers, which is just like this fundamental knowledge that we're all funding. But you as an\n\n56:37.840 --> 56:42.320\n individual don't have access to it. And some of it, you know, you don't have access to, you know,\n\n56:42.320 --> 56:48.320\n don't have access to it. And somehow, you know, like the problem for music got solved. But for\n\n56:48.320 --> 56:53.200\n papers, it's still like... It's just not yet. It could be ad supported, all those kinds of things.\n\n56:53.200 --> 56:57.600\n And then hopefully, that would change the way we do science. This is the most exciting thing for me\n\n56:58.480 --> 57:04.800\n is, especially once I started like making videos and this silly podcast thing, I started to realize\n\n57:04.800 --> 57:13.120\n like that if you want to do science, one of the most effective ways is to do like couple the\n\n57:13.120 --> 57:21.360\n paper with a set of YouTube videos, like explaining it. That also seems like there's a lot of room for\n\n57:21.360 --> 57:27.120\n disruption there. What is the paper 2.0 going to look like? I think like LaTeX and the PDF,\n\n57:28.000 --> 57:33.280\n seems like if you... It's interesting. If you look at the first paper that got published in Nature,\n\n57:33.280 --> 57:37.360\n and if you look at the paper that got published in Nature today, if you look at the two side by\n\n57:37.360 --> 57:42.880\n side, they are fundamentally the same. And even though like the paper that gets published today,\n\n57:42.880 --> 57:49.760\n you know, you get... Even code, like right now, people put like code, like on a PDF.\n\n57:51.040 --> 57:56.240\n And there are so many things that are related to papers today, you know, you have data,\n\n57:56.240 --> 58:03.680\n you have code, you might need videos to better explain the concepts. So, I think for me,\n\n58:03.680 --> 58:07.600\n it's natural that there's going to be also an evolution there, that papers are not going to be\n\n58:07.600 --> 58:15.680\n just the static PDFs or LaTeX, there's going to be a next interface. So, in academia, a lot of\n\n58:15.680 --> 58:22.160\n things that are judged, you're judged by is often quantity, not quality. I wonder if there's an\n\n58:22.160 --> 58:27.520\n opportunity to have like... I tend to judge people by the best work they've ever done as opposed to...\n\n58:28.960 --> 58:34.000\n I wonder if there's a possibility for that to encourage sort of focusing on the quality,\n\n58:34.800 --> 58:39.840\n and not necessarily in paper form, but maybe a subset of a paper, subset of idea, almost even a\n\n58:39.840 --> 58:46.800\n blog post or an experiment. Like, why does it have to be published in a journal to be legitimate?\n\n58:46.800 --> 58:53.200\n And it's interesting that you mentioned that I also think like, yeah, it's why is that the only\n\n58:53.200 --> 59:01.200\n format? Why can't a blog post or... We were even experimenting with these a few months ago,\n\n59:01.200 --> 59:08.480\n or can you actually like publish something or like a new scientific breakthrough or\n\n59:10.320 --> 59:13.280\n something that you've discovered in the form of like a set of tweets,\n\n59:13.280 --> 59:20.240\n a Twitter thread. Why can't that be possible? And we were experimenting with that idea.\n\n59:20.960 --> 59:26.560\n We even, yeah, we ran a couple of... Like some people submitted a couple of those,\n\n59:26.560 --> 59:31.920\n like I think the limit was three or four tweets. Maybe it's a new way to look at a proof or\n\n59:31.920 --> 59:37.120\n something, but I think it just serves to show that there should be other ways to publish\n\n59:37.120 --> 59:43.520\n like scientific discoveries that don't fit the paper format. Well, but so even with the Twitter\n\n59:43.520 --> 59:52.000\n thread, it would be nice to have some mechanism of formalizing it and making it into an NFT.\n\n59:52.000 --> 1:00:00.880\n Like a concrete thing that you can reference as a link that's unique. Because, I mean, everything\n\n1:00:00.880 --> 1:00:11.680\n we've been saying, all of that, while being true, it's also true that the constraints and the\n\n1:00:11.680 --> 1:00:18.560\n formalism of a paper works well. It like forces you, constraints forces you to narrow down your\n\n1:00:18.560 --> 1:00:29.120\n thing and literally put it on paper. But, you know, make concrete. And that's why, I mean,\n\n1:00:29.120 --> 1:00:34.400\n it's not broken. It just could be better. And that's the main idea. I think there's something\n\n1:00:34.400 --> 1:00:42.000\n about writing, whether it's a blog post or Twitter thread or a paper, that's really nice to\n\n1:00:42.000 --> 1:00:51.040\n concretize a particular little idea that can then be referenced by other ideas, then it can be built\n\n1:00:51.040 --> 1:01:01.440\n on top of with other ideas. So let me ask, you've read quite a few papers. You've annotated quite a\n\n1:01:01.440 --> 1:01:08.640\n few papers. Let's talk about the process itself. How do you advise people read papers? Or maybe\n\n1:01:08.640 --> 1:01:14.080\n you want to broaden it beyond just papers, but just read concrete pieces of information to\n\n1:01:14.080 --> 1:01:20.160\n understand the insights that labeled in. I would say for paper specifically, I would bring back\n\n1:01:20.160 --> 1:01:24.960\n kind of what Louise was talking about, is that it's important to keep in mind that papers are\n\n1:01:24.960 --> 1:01:32.160\n not optimized for ease of understanding. And so, right, there's all sorts of restrictions and size\n\n1:01:32.960 --> 1:01:38.880\n and format and language that they can use. And so it's important to keep that in mind. And so that\n\n1:01:38.880 --> 1:01:45.200\n if you're struggling to read a paper, that might not mean that the underlying material is actually\n\n1:01:45.200 --> 1:01:53.120\n that hard. And so that's definitely something that, especially for us, that we read papers and\n\n1:01:53.120 --> 1:01:59.440\n most of the time the papers are completely outside of our comfort zone, I guess. And so it would be\n\n1:01:59.440 --> 1:02:05.280\n completely new areas to us. So I always try to keep that in mind. So there's usually a certain\n\n1:02:05.280 --> 1:02:12.480\n kind of structure, like abstract introductions, methodology, depending on the community and so on.\n\n1:02:12.480 --> 1:02:19.280\n Is there something about the process of how to read it, whether you want to skim it to try to\n\n1:02:19.280 --> 1:02:26.160\n find the parts that are easy to understand or not, reading it multiple times? Is there any kind of\n\n1:02:26.160 --> 1:02:32.000\n hacks that you can comment on? I remember like Feynman had this kind of hack when he was reading\n\n1:02:32.000 --> 1:02:39.360\n papers, where you would basically, I think I believe you would read the conclusion of the\n\n1:02:39.360 --> 1:02:47.040\n paper. And we would try to just see if he would be able to figure out how to get to the conclusion\n\n1:02:47.040 --> 1:02:54.640\n in like a couple of minutes by himself. And he would read a lot of papers that way. And I think\n\n1:02:54.640 --> 1:02:59.760\n Fermi also did that almost. And Fermi was known for doing a lot of back of the envelope calculation.\n\n1:02:59.760 --> 1:03:08.240\n So he was a master at doing that. And in terms of like, especially when reading a paper, I think\n\n1:03:08.240 --> 1:03:14.160\n a lot of times people might feel discouraged about the first time you read it. You know,\n\n1:03:14.160 --> 1:03:20.160\n it's very hard to grasp or you don't understand a huge fraction of the paper. And I think it's\n\n1:03:20.160 --> 1:03:25.920\n having read a lot of papers in my life, I think I'm in peace with like the fact that you might\n\n1:03:25.920 --> 1:03:31.280\n spend hours where you're just reading a paper and jumping from paper to paper, reading citations.\n\n1:03:31.280 --> 1:03:38.560\n And like your level of understanding sometimes of the paper is very close to 0%. And all of a\n\n1:03:38.560 --> 1:03:45.040\n sudden, you know, everything kind of makes sense in your mind. And then, you know, you have this\n\n1:03:45.040 --> 1:03:54.000\n quantum jump where all of a sudden you understand the big picture of the paper. And this is an\n\n1:03:54.000 --> 1:03:58.400\n exercise that I have to do when reading papers and especially like more complex papers, like,\n\n1:03:58.400 --> 1:04:02.160\n okay, you don't understand because you're just going through the process and just keep going.\n\n1:04:02.160 --> 1:04:07.360\n And like, it might feel super chaotic, especially if you're jumping from reference to reference.\n\n1:04:07.360 --> 1:04:12.000\n You know, you might end up with like 20 tabs open and you're reading a ton of other papers,\n\n1:04:12.000 --> 1:04:18.240\n but it's just trusting that process that at the end, like you'll find light. And I think for me,\n\n1:04:18.240 --> 1:04:24.960\n that's a good framework when reading a paper. It's hard because, you know, you might end up spending\n\n1:04:24.960 --> 1:04:32.080\n a lot of time and it looks like you're lost, but that's the process to actually, you know,\n\n1:04:32.080 --> 1:04:34.640\n understand what they're talking about in the paper.\n\n1:04:34.640 --> 1:04:40.320\n Yeah, I think that process, I enjoy, I've found a lot of value in the process, especially for\n\n1:04:40.320 --> 1:04:47.520\n things outside my field of reading a lot of related work sections and kind of going down\n\n1:04:47.520 --> 1:04:52.320\n that path of getting a big context of the field. Because what's, especially when they're well\n\n1:04:52.320 --> 1:04:57.840\n written, there's opinions injected into the really related work. Like what work is important,\n\n1:04:57.840 --> 1:05:03.600\n what is not. And if you read multiple related work sections that cite or don't cite each other,\n\n1:05:03.600 --> 1:05:09.040\n like the papers, you get a sense of where the field, where the tensions of the field are,\n\n1:05:09.760 --> 1:05:16.560\n where the field is striving. And that helps you put into context, like whether the work is radical,\n\n1:05:16.560 --> 1:05:23.280\n whether it's overselling itself, whether it's underselling itself, all those things. And added\n\n1:05:23.280 --> 1:05:31.200\n on top of that, I find that often the related work section is the most kind of accessible and\n\n1:05:31.200 --> 1:05:38.160\n readable part of a paper because it's kind of, it's brief to the point, it's like summarizing,\n\n1:05:38.160 --> 1:05:43.840\n it's almost like a Wikipedia style article. The introduction is supposed to be a compelling story\n\n1:05:43.840 --> 1:05:49.120\n or whatever, but it's often like overselling, there's like an agenda in the introduction.\n\n1:05:49.920 --> 1:05:54.960\n The related work usually has the least amount of agenda except for the few like elements where\n\n1:05:54.960 --> 1:05:58.880\n you're trying to talk shit about previous work where you're trying to sell that you're doing\n\n1:05:58.880 --> 1:06:05.040\n much better. But other than that, when you're just painting where the field came from or where the\n\n1:06:05.040 --> 1:06:11.360\n field stands, that's really valuable. And also again, just to agree with Fionn in the conclusion,\n\n1:06:11.360 --> 1:06:17.840\n I get a lot of value from the breadth first search, kind of read the conclusion, then read\n\n1:06:17.840 --> 1:06:24.000\n the related work, and then go through the references in the related work, read the conclusion,\n\n1:06:24.000 --> 1:06:30.720\n read the related work, and just go down the tree until you like hit dead ends or run out of coffee.\n\n1:06:30.720 --> 1:06:35.760\n And then through that process, you go back up the tree and now you can see the results in their\n\n1:06:35.760 --> 1:06:42.000\n proper context, unless of course the paper is truly revolutionary, which even that process will help\n\n1:06:42.000 --> 1:06:50.960\n you understand that is in fact truly revolutionary. You've also, you talked about just following your\n\n1:06:50.960 --> 1:06:59.040\n Twitter thread in depth first search. You talked about that you read the book on Grisha Perlman,\n\n1:06:59.040 --> 1:07:07.120\n Grigori Perlman, and then you had a really nice Twitter thread on it and you were taking notes\n\n1:07:07.120 --> 1:07:12.800\n throughout. So at a high level, is there suggestions you can give on how to take good notes?\n\n1:07:13.440 --> 1:07:20.400\n Whether it's we're talking about annotations or just for yourself to try to put on paper ideas\n\n1:07:20.400 --> 1:07:24.560\n as you progress through the work in order to then like understand the work better.\n\n1:07:24.560 --> 1:07:31.280\n For me, I always try not to underestimate how much you can forget within six months after\n\n1:07:31.280 --> 1:07:34.880\n you've read something. I thought you were going to say five minutes, but yeah, six months is good.\n\n1:07:34.880 --> 1:07:42.240\n Yeah, or even shorter. And so that's something that I always try to keep in mind. And it's often,\n\n1:07:42.240 --> 1:07:49.440\n I mean, every once in a while I'll read back a paper that I annotated on Fermat and I'll read\n\n1:07:49.440 --> 1:07:59.120\n through my own annotations and I've completely forgotten what I had written. But it's interesting\n\n1:07:59.120 --> 1:08:03.920\n because in a way, after you just understood something, you're kind of the best possible\n\n1:08:03.920 --> 1:08:12.720\n teacher that can teach your future self. After you've forgotten it, you're kind of your own best\n\n1:08:12.720 --> 1:08:19.520\n possible teacher at that moment. And so it can be great to try to capture that.\n\n1:08:19.520 --> 1:08:27.280\n It's brilliant. It just made me kind of realize it's really nice to put yourself in the position\n\n1:08:27.280 --> 1:08:32.800\n of teaching an older version of yourself that returns to this paper, almost like thinking literally.\n\n1:08:33.520 --> 1:08:38.560\n That's under explored, but it's super powerful because you were the person that you can,\n\n1:08:38.560 --> 1:08:43.280\n if you look at the scale from one not knowing anything about the topic and 10,\n\n1:08:44.000 --> 1:08:48.320\n you are the one that progressed from one to 10 and you know which steps you struggled with.\n\n1:08:48.320 --> 1:08:53.120\n So you're really the best person to help yourself make that transition from one to 10.\n\n1:08:53.680 --> 1:09:02.480\n And a lot of the times, I really believe that the framework that we have to expose ourselves to\n\n1:09:02.480 --> 1:09:07.680\n be talking to us when we were an expert, when we were taking that class and we knew everything\n\n1:09:07.680 --> 1:09:12.160\n about quantum mechanics. And then six months later, you don't remember half of the things.\n\n1:09:12.160 --> 1:09:18.080\n How could we make it easier to have those conversations between you and your past\n\n1:09:19.120 --> 1:09:26.640\n expert self? I think there might be, it's an under explored idea. I think notes on paper\n\n1:09:26.640 --> 1:09:30.560\n are probably not the best way. I'm not sure if it's a combination of video,\n\n1:09:31.360 --> 1:09:36.720\n audio, where it's like you have a guided framework that you follow to extract information from\n\n1:09:36.720 --> 1:09:44.160\n yourself so that you can later kind of revisit to make it easier to remember. But that's,\n\n1:09:44.160 --> 1:09:50.560\n I think it's an interesting idea worth exploring that I haven't seen a lot of people kind of\n\n1:09:50.560 --> 1:09:53.200\n trying to distill that problem.\n\n1:09:53.920 --> 1:09:59.680\n Yeah, I'm creating the kind of tools. I find if I record, it sounds weird, but I'll take notes,\n\n1:09:59.680 --> 1:10:09.440\n but if I record audio, like little clips of thoughts, like rants, that's really effective\n\n1:10:09.440 --> 1:10:14.960\n at capturing something that notes can't. Because when I replay them, for some reason,\n\n1:10:15.600 --> 1:10:22.160\n it loads my brain back into where I was when I was reading that in a way that notes don't. Like\n\n1:10:22.160 --> 1:10:29.040\n when I read notes, I'll often be like, what? What was I thinking there? But when I listened\n\n1:10:29.040 --> 1:10:35.440\n to the audio, it brings you right back to that place. And maybe with video, with visual, that\n\n1:10:35.440 --> 1:10:36.880\n might be even more powerful.\n\n1:10:36.880 --> 1:10:37.440\n I think so.\n\n1:10:38.320 --> 1:10:45.680\n And I think just the process of verbalizing it, that alone kind of makes you have to structure\n\n1:10:45.680 --> 1:10:51.280\n your thought and put it in a way that somebody else could come and understand it. And just\n\n1:10:51.280 --> 1:10:58.400\n the process of that is useful to organize your thoughts and yeah, just that alone.\n\n1:10:58.400 --> 1:11:02.480\n Does the Fermat's Library Journal Club have a video component or no?\n\n1:11:03.680 --> 1:11:07.920\n Not natively. We sometimes will include videos, but it's always embedded.\n\n1:11:07.920 --> 1:11:12.720\n Do people build videos on top of it to explain the paper? Because you're doing all the hard work\n\n1:11:12.720 --> 1:11:14.880\n of understanding deeply the paper.\n\n1:11:16.400 --> 1:11:22.560\n We haven't seen that happening too much. But we were actually playing around with the idea of\n\n1:11:22.560 --> 1:11:29.040\n creating some sort of podcast version where we try to distill the paper on an audio format that\n\n1:11:29.040 --> 1:11:30.320\n not maybe you can have access to.\n\n1:11:30.320 --> 1:11:31.280\n Might be tricky.\n\n1:11:31.280 --> 1:11:35.120\n Might be trickier, but there are definitely people that could be interested in the paper\n\n1:11:35.120 --> 1:11:40.080\n and that topic, but are not willing to read it. But they might listen to a 30 minute episode\n\n1:11:40.080 --> 1:11:44.720\n on that paper. You could reach more people and you might even bring the authors to the\n\n1:11:44.720 --> 1:11:49.520\n conversation, but it's tricky. And especially for like more technical papers. We've thought\n\n1:11:49.520 --> 1:11:55.920\n about doing that, but we haven't converged. I'm not sure if you have any tips.\n\n1:11:55.920 --> 1:12:00.800\n Well, I'm going to take that as a small project to take one of the Fermat's almost like\n\n1:12:01.360 --> 1:12:05.840\n half advertisement and half as a challenge for myself to take one of the annotated papers and\n\n1:12:05.840 --> 1:12:14.160\n use it as a basis for creating a quick video. I've seen like, hopefully I'm saying the name\n\n1:12:14.160 --> 1:12:20.720\n correctly, but machine learning street talk. I think that's the name of the show that I\n\n1:12:20.720 --> 1:12:26.320\n recommend highly. That's the right name. But they do exactly that, which is multiple hour\n\n1:12:26.320 --> 1:12:32.240\n breakdown of a paper with video component. Sometimes with authors, people love it.\n\n1:12:32.240 --> 1:12:33.520\n It's very effective.\n\n1:12:33.520 --> 1:12:39.440\n There's also, I've seen, I haven't seen the entire, in its entirety, but I've seen like the\n\n1:12:39.440 --> 1:12:46.320\n founder of comma.ai, George. I've seen him like just taking a paper and then, you know,\n\n1:12:46.320 --> 1:12:53.440\n distilling the paper and coding it, coding it sometimes during 10 hours. And he was able to,\n\n1:12:53.440 --> 1:12:57.120\n you know, get a lot of people interested in that and viewing him.\n\n1:12:57.120 --> 1:13:03.280\n I'm a huge fan of that. Like, George is a personality. I think a lot of people like\n\n1:13:03.280 --> 1:13:08.880\n listen to this podcast for the same reason. It's not necessarily the contents. They like to listen\n\n1:13:08.880 --> 1:13:16.560\n to like a silly Russian who has a childlike brain and mumbles and all those like struggle with\n\n1:13:16.560 --> 1:13:22.160\n ideas, right? And George is a madman who people just enjoy. Like, how is he going to struggle\n\n1:13:22.160 --> 1:13:26.320\n in implementing this particular paper? How is he going to struggle with this idea? It's fun to\n\n1:13:26.320 --> 1:13:29.600\n watch and that actually pulls you in. The personality is important there.\n\n1:13:29.600 --> 1:13:34.720\n True. But there's, you know, I agree with you, but there also, it's visible, like it's,\n\n1:13:34.720 --> 1:13:39.520\n there's an extraordinary ability that is there. Like, he's talented and you need to have,\n\n1:13:40.080 --> 1:13:45.120\n there's a craft and this guy definitely has talent and he's doing something that is not easy.\n\n1:13:45.120 --> 1:13:47.520\n And I think that also draws the attention of people.\n\n1:13:47.520 --> 1:13:48.160\n Oh yeah.\n\n1:13:48.160 --> 1:13:53.600\n And like the other day we were actually, we ran into this YouTube channel of this guy that was\n\n1:13:53.600 --> 1:14:03.120\n restoring art, right? And it was basically just a video of him, like the production is really like\n\n1:14:03.120 --> 1:14:09.760\n really well done. And it's just him taking really old pieces of art, like, and then paintings and\n\n1:14:09.760 --> 1:14:14.880\n then restoring them. But he's really good at that. And he describes that process. And that draws\n\n1:14:14.880 --> 1:14:20.480\n attention, draws the attention of people, regardless of your craft, be it like annotating a\n\n1:14:20.480 --> 1:14:22.320\n paper or like restoring it.\n\n1:14:22.320 --> 1:14:26.400\n Procurement, excellence. Yeah. Like George is incredibly good at programming.\n\n1:14:26.400 --> 1:14:34.720\n Like quick, like, you know, those competitive programmers, like Topcoder and all those kinds of\n\n1:14:34.720 --> 1:14:38.800\n stuff, he has the same kind of element where the brain just jumps around really quickly.\n\n1:14:38.800 --> 1:14:48.640\n And that's, yeah, just like, it's motivating, but you're right in watching people who are good at\n\n1:14:48.640 --> 1:14:52.720\n what they do. It's motivating. Even if the thing you're trying to do is not what they're doing,\n\n1:14:52.720 --> 1:14:57.280\n it's contagious when they're really good at it. And the same kind of analysis with the paper,\n\n1:14:57.280 --> 1:15:03.280\n I think, not just like the final result, but the process of struggling with it. That's really\n\n1:15:03.280 --> 1:15:07.760\n interesting. Yeah. I think, I mean, I think Twitch proved that, like, you know, that there's\n\n1:15:07.760 --> 1:15:14.560\n really a market for that, for watching people do things that they're really good at. And you'll\n\n1:15:14.560 --> 1:15:20.480\n just watch it. You will enjoy that. That might even spike your interest in that specific topic.\n\n1:15:20.480 --> 1:15:26.720\n And yeah, and people will enjoy watching sometimes hours on end of great craftsmans.\n\n1:15:27.280 --> 1:15:31.520\n Do you mind if we talk about some of the papers? Do any papers come to mind\n\n1:15:31.520 --> 1:15:33.760\n that have been annotated on Fermat's library?\n\n1:15:34.640 --> 1:15:39.040\n The papers that we annotated can be about completely random topics, but that's part of\n\n1:15:39.040 --> 1:15:43.440\n what we enjoy as well. It forces you to explore these topics that otherwise maybe you'd never\n\n1:15:43.440 --> 1:15:51.760\n run into. And so the ones that come to mind are, to me, are fairly random. But one that I really\n\n1:15:51.760 --> 1:16:00.080\n enjoyed learning more about is a paper written by a mathematician, actually, Thomas Postol,\n\n1:16:00.080 --> 1:16:10.240\n and about a tunnel in a Greek island off the coast of Turkey. So it's very random.\n\n1:16:10.240 --> 1:16:18.000\n Yeah. Okay, so what's interesting about this tunnel? So this tunnel was built in the sixth\n\n1:16:18.000 --> 1:16:27.360\n century BC. And it was built in the island of Samos, which is, as I said, off the coast of Turkey.\n\n1:16:27.360 --> 1:16:33.760\n And they had the city on one side, and they had a mountain, and then they had a bunch of\n\n1:16:33.760 --> 1:16:40.000\n springs on the other side, and they wanted to bring water into the city. Building an aqueduct\n\n1:16:40.000 --> 1:16:44.880\n would be pretty hard because of the way the mountain was shaped. And it would also, if they\n\n1:16:44.880 --> 1:16:51.360\n were under a siege, they could just easily destroy that aqueduct, and then the water wouldn't have\n\n1:16:51.360 --> 1:16:56.480\n any water supply. The city wouldn't have any water supply. And so they decided to build a tunnel,\n\n1:16:57.680 --> 1:17:06.720\n and they decided to try to do it quickly. And so they started digging from both ends\n\n1:17:06.720 --> 1:17:12.480\n at the same time through the mountain. And so when you start thinking about this,\n\n1:17:12.480 --> 1:17:19.920\n it's a fairly difficult problem. And this is like sixth century BC, so you had very limited access\n\n1:17:20.560 --> 1:17:25.360\n to the mathematical tools that you had at the time, were very limited. And so what this paper\n\n1:17:25.360 --> 1:17:32.320\n is about is about the story of how they built it and about the fact that for about 2000 years,\n\n1:17:32.320 --> 1:17:38.960\n kind of the accepted explanation of how they built it was actually wrong. And so this tunnel\n\n1:17:38.960 --> 1:17:43.360\n has been famous for a while. There are a number of historians that talked about it since ancient\n\n1:17:43.360 --> 1:17:54.480\n Egypt. And the method that they described for building it was just wrong. And so these researchers\n\n1:17:54.480 --> 1:18:00.960\n went there and were able to figure that out. And so basically, kind of the way that they thought\n\n1:18:00.960 --> 1:18:06.080\n they had built it was basically, if you can imagine looking at the mountain from the top,\n\n1:18:06.080 --> 1:18:11.760\n and you have the mountain and then you have both entrances. And so what they thought,\n\n1:18:11.760 --> 1:18:18.480\n and this is what the ancient historians described, is that they effectively tried to draw a right\n\n1:18:19.600 --> 1:18:27.280\n angle triangle with the two entrances at each end of the hypotenuse. And the way they did it is like\n\n1:18:27.280 --> 1:18:32.640\n they would go around the mountain and kind of walking in a grid fashion. And then you can figure\n\n1:18:32.640 --> 1:18:40.480\n out the two sides of the triangle. And then after you have that triangle, you can effectively draw\n\n1:18:40.480 --> 1:18:47.360\n two smaller triangles at each entrance that are proportional to that big triangle. And then you\n\n1:18:47.360 --> 1:18:54.560\n kind of have arrows pointing in each way. And then you know at least that you have a line going\n\n1:18:54.560 --> 1:19:01.920\n through the mountain that connects both entrances. The issue with that is like once you go to this\n\n1:19:01.920 --> 1:19:06.960\n mountain and you start thinking of doing this, you realize that especially given that the tools that\n\n1:19:06.960 --> 1:19:12.400\n they had at the time, that your error margin would be too small. You wouldn't be able to do it.\n\n1:19:14.960 --> 1:19:20.880\n Just the fact of trying to build this triangle in that fashion, the error would accumulate and you\n\n1:19:20.880 --> 1:19:24.960\n would end up missing. You'd start building these tunnels and they would miss each other. So the task\n\n1:19:24.960 --> 1:19:30.320\n ultimately is to figure out like really perfectly as close as possible the direction you should be\n\n1:19:30.320 --> 1:19:35.680\n digging. First of all that it's possible to have a straight line through and then what that the\n\n1:19:35.680 --> 1:19:40.960\n direction would be. And then you are trying to infer that by constructing a right triangle\n\n1:19:42.000 --> 1:19:49.280\n by doing. I'm not exactly sure about how to do that rigorously like by tracing the mountain,\n\n1:19:49.280 --> 1:19:55.040\n by walking along the mountain. You said grids? Yeah you kind of walk as if you were in a grid\n\n1:19:55.040 --> 1:20:00.800\n and so you just walk in right angles. But then you have to walk really precisely then. Exactly.\n\n1:20:00.800 --> 1:20:07.360\n You have to use tools to measure this and the terrain is probably a mess. So this makes more\n\n1:20:07.360 --> 1:20:14.480\n sense in 2D and 3D gets even weirder. So okay gotcha. But so this method was described by like\n\n1:20:14.480 --> 1:20:20.720\n an ancient Egyptian historian. I think hero of Alexandria. And then for about like yeah for\n\n1:20:20.720 --> 1:20:28.720\n about 2000 years that's how we thought that they had built this tunnel. And then these\n\n1:20:28.720 --> 1:20:35.600\n researchers went there and found out that actually they must have had to use other methods. And then\n\n1:20:35.600 --> 1:20:41.040\n in this paper they describe these other methods and of course they can't know for sure. But\n\n1:20:41.040 --> 1:20:46.880\n there's they present a bunch of plausible alternatives. The one that for me was is the\n\n1:20:46.880 --> 1:20:51.920\n most plausible is that what they probably must have done is to use something that is similar to\n\n1:20:52.720 --> 1:21:00.240\n an iron sight on a rifle. The way you can line up your rifle with a target off in the distance\n\n1:21:00.240 --> 1:21:08.160\n by having an iron sight. And they must have done something similar to that\n\n1:21:08.160 --> 1:21:16.560\n effectively with three sticks. And that way they were able to line up sticks along the side of the\n\n1:21:16.560 --> 1:21:21.920\n mountain that were all on the same height. And so that then you could get to the other side\n\n1:21:22.480 --> 1:21:26.640\n and you could and then you could draw that line. So this for me is the most plausible\n\n1:21:27.840 --> 1:21:34.400\n way that they might have done that. But then they described this in detail and other possible\n\n1:21:34.400 --> 1:21:40.320\n approaches in this paper. So this is a mathematician doing this? Yeah this is a mathematician that did\n\n1:21:40.320 --> 1:21:46.880\n this. Which I suppose is the right mindset instead of skills required to solve an ancient problem\n\n1:21:46.880 --> 1:21:52.320\n right? Yeah. Yeah. There's mathematicians and engineers a lot of things. Because they didn't\n\n1:21:52.320 --> 1:21:58.240\n have computers or drones or lidar back then or whatever technology you would use modern day for\n\n1:21:58.240 --> 1:22:04.640\n the civil engineering. Yeah. Another fascinating thing is that like you know after effectively\n\n1:22:04.640 --> 1:22:09.600\n after the the downfall of the Roman civilization people didn't build tunnels for about a thousand\n\n1:22:09.600 --> 1:22:15.360\n years. We go a thousand years without tunnels and then like only in like in late middle ages that\n\n1:22:15.360 --> 1:22:20.640\n we start doing them again. But here is the tunnel like sixth century BC like incredibly limited\n\n1:22:20.640 --> 1:22:28.960\n mathematics and they and they build it in this way. And it was a mystery for a long time exactly\n\n1:22:28.960 --> 1:22:35.040\n how they did it. And then these mathematicians went there and basically with no archaeology\n\n1:22:35.040 --> 1:22:40.400\n kind of background were able to figure it out. How do annotations for this paper look like? What is\n\n1:22:40.400 --> 1:22:46.640\n it what's a successful annotation for paper like this? Yeah so sometimes you're for this paper\n\n1:22:46.640 --> 1:22:54.160\n sometimes adding some more context on on a specific part like sometimes they they mentioned\n\n1:22:54.160 --> 1:23:02.000\n for instance these instruments that were common in ancient Greece and ancient Rome for for building\n\n1:23:02.000 --> 1:23:08.240\n things. And and and so in some of those annotations I describe these instruments in more detail and\n\n1:23:08.240 --> 1:23:12.960\n how they worked because sometimes it can be hard to to visualize these.\n\n1:23:12.960 --> 1:23:20.720\n Then this paper I forget exactly when when this was published I believe maybe maybe the 70s.\n\n1:23:21.760 --> 1:23:26.240\n And then there was further research into this tunnel and more interesting other interesting\n\n1:23:26.240 --> 1:23:32.720\n aspects about it. I add those to that paper as well. There's historical context that I also go\n\n1:23:32.720 --> 1:23:39.280\n into there for instance the fact that as a as I said that effectively after the downfall of the\n\n1:23:39.280 --> 1:23:43.360\n Roman Empire no tunnels were built like this something that I that I go that I that I added\n\n1:23:43.360 --> 1:23:49.360\n to the paper as well. Yeah so so when other people look at the paper how do they usually consume the\n\n1:23:49.360 --> 1:23:55.920\n annotations? So they it's like is there a commenting feature is the I mean like this is a really\n\n1:23:55.920 --> 1:24:02.000\n enriching experience the way you read a paper. What what aspects do you do people usually talk\n\n1:24:02.000 --> 1:24:09.120\n about that they they value from this? So yeah so anybody can just go on there and and either add\n\n1:24:09.120 --> 1:24:15.840\n a new annotation or add a comment to an existing annotation and so you can start a kind of a thread\n\n1:24:15.840 --> 1:24:21.680\n within an existing annotation. And that's something that happens relative frequency and then\n\n1:24:21.680 --> 1:24:27.440\n because I was the original author of the initial annotation I get pinged and so oftentimes I'll go\n\n1:24:27.440 --> 1:24:33.840\n back and and and add on to to that thread. How'd you pick the paper? I mean first of all this whole\n\n1:24:33.840 --> 1:24:38.880\n process is really exciting. I'm gonna especially after this conversation I'm gonna make sure I\n\n1:24:38.880 --> 1:24:44.960\n participate much more actively on papers that I know a lot about and on paper I know nothing about.\n\n1:24:44.960 --> 1:24:52.880\n I should both of us annotate the paper. I would love to. I also I mean I realized that uh there's\n\n1:24:52.880 --> 1:25:02.640\n like it's an opportunity for people like me to publicly annotate a paper. Or do an AMA around\n\n1:25:02.640 --> 1:25:09.760\n the paper. Yeah exactly but yeah but like be um be in the conversation about a paper. It's like a\n\n1:25:09.760 --> 1:25:15.200\n place to have a conversation about an idea. You get the other way to do it that's much more ad hoc\n\n1:25:15.200 --> 1:25:19.760\n is on Twitter right? But this is more like formal and you don't have to be in the conversation\n\n1:25:19.760 --> 1:25:24.880\n on Twitter right? But this is more like formal and you could actually probably integrate the two.\n\n1:25:24.880 --> 1:25:29.360\n You have a conversation about the conversation. So the Twitter is the conversation about a\n\n1:25:29.360 --> 1:25:34.720\n conversation and the main conversation is in this space of annotations. There's an interesting effect\n\n1:25:34.720 --> 1:25:39.440\n that we we see sometimes with the annotations on our papers is that a lot of people especially if\n\n1:25:39.440 --> 1:25:46.960\n we the annotations are really well done people sometimes are afraid of adding more annotations\n\n1:25:46.960 --> 1:25:51.440\n because they see that as a kind of a finished work. Yes. And so they they don't want to pollute\n\n1:25:51.440 --> 1:25:57.280\n that or uh and especially if it's like a silly question. This is I don't think that's good. I\n\n1:25:57.280 --> 1:26:02.400\n think you know we should as much as possible try to lower the barrier for someone to jump in and\n\n1:26:02.400 --> 1:26:07.600\n ask questions. I think it only like most of the times it adds value but it's some feedback that\n\n1:26:07.600 --> 1:26:17.680\n we got from users and and readers. I'm not exactly sure how to to kind of fight that but um. Well I\n\n1:26:17.680 --> 1:26:26.080\n think I think if I serve as an inspiration in any way is by asking a lot of dumb questions and saying\n\n1:26:26.080 --> 1:26:31.200\n a bunch of dumb shit all the time and hopefully that inspires the rest of the other folks to do\n\n1:26:31.200 --> 1:26:37.440\n the same because that's the only way to knowledge I think is to be willing to ask the dumb questions.\n\n1:26:37.440 --> 1:26:42.160\n And there are papers that are like um you know we have a lot of papers on Fermat's where it's just\n\n1:26:42.160 --> 1:26:48.400\n one page or really short papers and you we have like the shortest paper ever published in a math\n\n1:26:48.400 --> 1:26:53.200\n journal like with like just a couple of words. Yeah. One of my favorite papers on the platform\n\n1:26:53.200 --> 1:26:59.520\n is actually a paper um written by Enrico Fermi. Yeah. And the title of the paper is my obs I think\n\n1:26:59.520 --> 1:27:06.240\n is my observations at Trinity. So basically Fermi was part of the Manhattan Project. So he was in\n\n1:27:06.240 --> 1:27:13.120\n New Mexico when they exploded the first atomic bomb and so he was a couple of miles away from\n\n1:27:13.120 --> 1:27:18.960\n the explosion and he was probably one of the first persons to calculate the energy of the explosion.\n\n1:27:18.960 --> 1:27:25.040\n And so the way he did that was he took a piece of paper and he tore down a piece of paper in in\n\n1:27:25.040 --> 1:27:30.560\n little pieces and when the bomb exploded the Trinity bomb was the name of the bomb like he\n\n1:27:30.560 --> 1:27:37.440\n waited for the blast to arrive at where he was and then he threw those pieces of paper in the air\n\n1:27:37.440 --> 1:27:42.800\n and he calculated the energy based on the displacement of the paper the pieces of paper\n\n1:27:42.800 --> 1:27:47.920\n and then he wrote a report which was classified until like a couple of years ago one page report\n\n1:27:47.920 --> 1:27:53.600\n like calculating the energy of the explosion. Oh that's so badass. And I we actually went there\n\n1:27:53.600 --> 1:27:58.960\n and kind of unpacked and like I think he just mentions basically the energy and we we actually\n\n1:27:58.960 --> 1:28:04.480\n went and one of the annotations is like explaining how he did that. I wonder how accurate he was.\n\n1:28:05.040 --> 1:28:10.880\n It was maybe I think like 20 or 25 percent off. Then there was another person that actually\n\n1:28:10.880 --> 1:28:17.680\n calculated the energy based on images after the explosion at the rate and the rate at which the\n\n1:28:18.800 --> 1:28:23.440\n like the mushroom of the explosion expanded and it's more accurate to calculate the energy based\n\n1:28:23.440 --> 1:28:29.200\n on that and I think it was like 20 20 percent off but it's it's really interesting because you know\n\n1:28:29.200 --> 1:28:34.240\n Fermi was known for all these being a master at these back of the envelope calculations always\n\n1:28:34.240 --> 1:28:40.480\n like the the Fermi problems are well known for for that and it's super interesting to see like\n\n1:28:40.480 --> 1:28:45.760\n that just one page report that was also actually classified and it's interesting because a couple\n\n1:28:45.760 --> 1:28:52.640\n months ago when the Beirut explosion happened there was a video circulating of these a bride\n\n1:28:52.640 --> 1:28:57.760\n that was doing a photo shoot when the explosion in Beirut happened and so you can see a video of\n\n1:28:57.760 --> 1:29:02.160\n her with the wedding dress and then the explosion happens in the blast arrives at where she was she\n\n1:29:02.160 --> 1:29:09.200\n was a couple of miles away from the last and you can see like the displacement of the dress as well\n\n1:29:09.200 --> 1:29:13.280\n and I actually looked and that video went viral on Twitter and I actually looked at that video\n\n1:29:13.280 --> 1:29:18.880\n and based I used the same techniques that Fermi used to calculate the energy of the explosion\n\n1:29:18.880 --> 1:29:23.520\n based on the displacement of the dress and you could actually see where where she was at the\n\n1:29:23.520 --> 1:29:27.520\n the distance from the explosion because there was a store behind her and you could look the name of\n\n1:29:27.520 --> 1:29:32.720\n the store and and so I calculated that it was the distance and then you can the based on the\n\n1:29:32.720 --> 1:29:37.600\n distance where she was from the the explosion and also on the the displacement of the dress\n\n1:29:37.600 --> 1:29:43.520\n like because you can when the blast happens like you can see the dress going back and then going\n\n1:29:43.520 --> 1:29:49.360\n back to the original position and like by just looking at like how much the the dress moved you\n\n1:29:49.360 --> 1:29:54.960\n can estimate the explode the energy of the explosion I assume you published this on Twitter\n\n1:29:54.960 --> 1:30:00.720\n was just a Twitter thread but it actually like a lot of people share that and it was picked up by\n\n1:30:00.720 --> 1:30:07.120\n a couple of news outlets but I was hoping it would be like a formal title and it would be an archive\n\n1:30:07.120 --> 1:30:11.440\n no no no it may be submitted just the Twitter thread but it was interesting because it was\n\n1:30:11.440 --> 1:30:17.920\n exactly the same method that Fermi used is there something else that jumps to mind like what is\n\n1:30:17.920 --> 1:30:23.040\n there something um I know like in terms of papers like I know the Bitcoin paper is super popular\n\n1:30:24.000 --> 1:30:28.560\n is there something interesting to be said about any of the white papers in the cryptocurrency space\n\n1:30:29.680 --> 1:30:36.560\n yeah the the the Bitcoin paper was the first paper that we put on for months and uh why that\n\n1:30:36.560 --> 1:30:42.720\n why that choice as the first paper it was a while ago and it was one of the papers that I read\n\n1:30:42.720 --> 1:30:48.400\n and then uh and then kind of explained it to to louise and or to other friends that do this\n\n1:30:48.400 --> 1:30:56.000\n journal club with us and um I did some research in cryptography uh as an undergrad and so it was a\n\n1:30:56.000 --> 1:31:02.880\n topic that I was interested in um but even for me that I I had that background but reading the\n\n1:31:02.880 --> 1:31:08.720\n Bitcoin paper it took me a few reads to really kind of wrap my head around it it's it's right\n\n1:31:08.720 --> 1:31:14.400\n it's it uses very spartan precise language in a way it's like you feel like you can't take any\n\n1:31:14.400 --> 1:31:20.800\n word out of it without something falling apart and uh and it's all there I think it's a beautiful\n\n1:31:20.800 --> 1:31:28.400\n paper and it's it's it's very well written of course but um you know we wanted to try to make\n\n1:31:28.400 --> 1:31:33.840\n it accessible so that anybody that maybe is an undergrad in computer science could go on there\n\n1:31:33.840 --> 1:31:39.840\n and then and and know that you have all the information in in that page that you're going\n\n1:31:39.840 --> 1:31:45.840\n to need to understand the mechanics of Bitcoin and so like I explain you know the basic\n\n1:31:47.120 --> 1:31:52.080\n public key cryptography that you need to to know in order to understand it like explain\n\n1:31:52.080 --> 1:31:57.040\n okay what are the properties of a hash function and how they are useful in this context\n\n1:31:57.040 --> 1:32:02.560\n um explain what a merkle tree is so a bunch of those basic concepts that maybe if you're reading\n\n1:32:02.560 --> 1:32:06.080\n it for a first time and you're an undergrad and you know you don't know those terms you're going\n\n1:32:06.080 --> 1:32:10.800\n to be you know discouraged because maybe okay now I have to go and google around until I understand\n\n1:32:10.800 --> 1:32:16.640\n these before I can make progress in the paper um and and this way it's all there you know so so\n\n1:32:16.640 --> 1:32:23.840\n there's a magic to also to the fact that over time more people went on there and and added further\n\n1:32:23.840 --> 1:32:29.280\n annotations so the the idea that the paper gets easier and more accessible over time but that's\n\n1:32:29.280 --> 1:32:36.000\n still you're still looking at the original content the way the the author intended it to be uh but\n\n1:32:36.000 --> 1:32:43.680\n there's just more context and the toughest bits have have more in depth explanations okay I think\n\n1:32:43.680 --> 1:32:50.640\n like there's a just so many interesting papers uh there like I remember reading the paper that was\n\n1:32:50.640 --> 1:32:56.720\n written by Freeman Dyson on the like the the first time that he explained he came up with\n\n1:32:56.720 --> 1:33:02.720\n the concept of the Dyson sphere and he he put that out like it's again it's a one page paper\n\n1:33:02.720 --> 1:33:10.240\n um and he what he explained was that eventually if a civilization develops and and grows there's\n\n1:33:10.240 --> 1:33:16.880\n going to be a point where when the resources on the planet are not are not enough for the energy\n\n1:33:16.880 --> 1:33:22.160\n requirements of that civilization so if you want to go the next step is you need to go to the next\n\n1:33:22.160 --> 1:33:28.480\n star and extract energy from that star and the way to do it is you need to build some sort of cap\n\n1:33:28.480 --> 1:33:35.280\n around the star that extracts the energy so he theorized this idea of the the Dyson sphere\n\n1:33:35.280 --> 1:33:40.640\n and he went on to kind of analyze how you would build that the stability of that sphere like\n\n1:33:40.640 --> 1:33:45.680\n if something happens if there's like a small oscillation with that fear collapse into the\n\n1:33:45.680 --> 1:33:53.040\n star or know what what would happen and even went on to kind of say that a good way for us to look\n\n1:33:53.040 --> 1:34:00.240\n for signs of intelligent life out there is to look for signals of these Dyson spheres and because you\n\n1:34:00.240 --> 1:34:04.160\n know according to the law of second law of thermodynamics like there's going to be some a\n\n1:34:04.160 --> 1:34:08.320\n lot of infrared radiation that is going to be emitted as a consequence of extracting energy\n\n1:34:08.320 --> 1:34:14.960\n from the star and we should be able to see those signals of like infrared if we look at the sky\n\n1:34:14.960 --> 1:34:20.080\n but all these like from the introduction of the concept like the how to build the Dyson sphere\n\n1:34:20.080 --> 1:34:24.800\n the problems of like having a Dyson sphere how to detect how that could be used as a signal for\n\n1:34:24.800 --> 1:34:29.600\n intelligence life really that's all in the paper all in one like one page paper and it's like it's\n\n1:34:29.600 --> 1:34:35.040\n it's for me it's beautiful it's like where was this published i don't remember it's fascinating\n\n1:34:35.040 --> 1:34:41.760\n that papers like that could be yeah i mean the guts it takes to put that all together in a paper\n\n1:34:41.760 --> 1:34:46.880\n before you know that that kind of challenges our previous discussion that of paper i mean papers\n\n1:34:46.880 --> 1:34:52.480\n can be beautiful you can play with the format right it but there's a lot to unpack there that's\n\n1:34:52.480 --> 1:34:57.440\n like the the that's the the starting point but it's it's beautiful that you're able to put that\n\n1:34:57.440 --> 1:35:03.760\n in one page and then people can build on top of that and but the key ideas are there yeah exactly\n\n1:35:04.640 --> 1:35:09.360\n what about have you looked at any of the the big seminal papers throughout the history of\n\n1:35:09.360 --> 1:35:16.000\n science like you look at simple like einstein papers have any of those been annotated yeah\n\n1:35:16.000 --> 1:35:22.320\n yeah no we we have some more seminal papers that that people have heard about um you know we have\n\n1:35:22.320 --> 1:35:33.200\n the the DNA double elix paper on there we have the Higgs boson uh paper um yeah there's papers\n\n1:35:33.200 --> 1:35:39.360\n that they'll that we know that it's they're not going to be finding out about them because of us\n\n1:35:39.360 --> 1:35:45.120\n but it's papers that we think um should be more widely read and that folks would benefit from\n\n1:35:45.120 --> 1:35:50.640\n having some annotations there and so we also have a number of those a lot of like discovery papers\n\n1:35:50.640 --> 1:35:56.400\n for fundamental like particles and all that there's we have a lot of those on from us library\n\n1:35:56.400 --> 1:36:00.560\n um yeah we i would like to end we haven't annotated that one but i'd like to on the\n\n1:36:00.560 --> 1:36:06.880\n Riemann hypothesis that's a really interesting paper as well um and and but we haven't annotated\n\n1:36:06.880 --> 1:36:13.520\n that one but there's a lot of like more historical landmark papers um on the platform have you done\n\n1:36:13.520 --> 1:36:19.680\n uh Poincare conjecture with uh with Perlman that's too much that's too much that's too much\n\n1:36:19.680 --> 1:36:25.040\n too much for me but it's uh it's it's interesting that you know and going back to our discussion\n\n1:36:25.040 --> 1:36:30.000\n like the the Poincare paper was like published on archive and and it was not on a journal like\n\n1:36:30.000 --> 1:36:34.640\n the three papers and yeah what do you make of that i mean he's such a fascinating human being\n\n1:36:34.640 --> 1:36:40.320\n exactly i mentioned to you offline that i'm going to russia he's somebody i'm really uh to interview\n\n1:36:40.320 --> 1:36:48.800\n yeah i well i so i definitely will interview him i um and i believe i will i believe i can i just\n\n1:36:48.800 --> 1:36:57.520\n don't know how to i know where he lives so here okay my my uh my hope is my conjecture is that\n\n1:36:57.520 --> 1:37:03.280\n if i just show up to the house and look desperate enough uh that uh or threatening enough for some\n\n1:37:03.280 --> 1:37:08.720\n combination of both that like the only way to get rid of me is to just get the thing done that's the\n\n1:37:08.720 --> 1:37:14.080\n hope it's actually interesting that you mentioned that because i after i um so a couple of weeks ago\n\n1:37:14.080 --> 1:37:19.760\n i was searching for like stuff about Perlman Perlman online ended up on this twitter account\n\n1:37:19.760 --> 1:37:26.000\n of like this guy that claims to be Perlman Perlman's assistant and he's like he has been\n\n1:37:26.000 --> 1:37:30.640\n posting a bunch of pictures like next to Perlman you can see like Perlman in in a library and he's\n\n1:37:30.640 --> 1:37:36.080\n like next to him like taking a selfie or like Perlman walking on the street and like maybe you\n\n1:37:36.080 --> 1:37:42.640\n could reach out to his assistant then i'll send you i'll send you this twitter account so maybe\n\n1:37:42.640 --> 1:37:47.120\n you're onto something no but but going going back to like Perlman is super interesting because the\n\n1:37:47.120 --> 1:37:53.040\n fact that he published the the the the proofs on archive is what was also like a way for him to\n\n1:37:53.040 --> 1:37:58.160\n because he really didn't like the scientific publishing industry and the fact that you had to\n\n1:37:58.160 --> 1:38:06.000\n pay to get uh access to to articles and that was a form of like protest and that's why he published\n\n1:38:06.000 --> 1:38:11.680\n um those papers there i mean i i think Perlman is just a fascinating like character and for me\n\n1:38:11.680 --> 1:38:18.240\n it's this kind of ideal of a platonic ideal of what a mathematician should be you know it's it's\n\n1:38:18.240 --> 1:38:23.200\n someone that is you know it's just cares about deeply cares about mathematics you know it cares\n\n1:38:23.200 --> 1:38:31.040\n about fair attribution of of um disregards money and um and and like the fact that he published\n\n1:38:31.040 --> 1:38:35.920\n like on archive was is a good example of what about the Fields Medal that he turned down the\n\n1:38:35.920 --> 1:38:42.000\n Fields Medal what's what's yeah what do you make of that yeah i mean if you look at like the reasons\n\n1:38:42.000 --> 1:38:47.840\n why he rejected the Fields Medal so after so Perlman did a postdoc in the US and when he came\n\n1:38:47.840 --> 1:38:53.840\n back to Russia um do you know how good his English is i think it's very fairly good it's pretty good\n\n1:38:53.840 --> 1:38:59.760\n i think it's really good especially given lectures yeah but i haven't been able to listen to anything\n\n1:38:59.760 --> 1:39:03.920\n well certainly not listen but i haven't been able to get anybody because i know a lot of people have\n\n1:39:03.920 --> 1:39:10.480\n been to those lectures i'm not able to get a sense of like yeah but how strong is the accent what are\n\n1:39:10.480 --> 1:39:13.840\n we talking about here is this going to have to be in Russian it's going to have to be in English\n\n1:39:13.840 --> 1:39:18.480\n is fascinating but he writes the papers in English so true like there's there's but there's so many\n\n1:39:18.480 --> 1:39:23.840\n like it's such a fascinating character and um there are a couple of examples like him like at\n\n1:39:23.840 --> 1:39:29.280\n i think 28 or 29 he proved like a really famous uh conjecture called the soul conjecture i believe\n\n1:39:29.280 --> 1:39:34.000\n it was like in a very short four page proof of that was a really big breakthrough then he went\n\n1:39:34.000 --> 1:39:40.720\n to Princeton to give a lecture on that and after the lecture uh the the chair of the math department\n\n1:39:40.720 --> 1:39:46.000\n at Princeton a guy called Peter Sarnak went up to to Perelman was trying to recruit him\n\n1:39:46.640 --> 1:39:52.640\n trying to offer him a position at Princeton and he was and at some point he asked for Perelman's\n\n1:39:52.640 --> 1:39:59.600\n resume and Perelman responded saying just gave a lecture on like this really tough problem why do\n\n1:39:59.600 --> 1:40:06.160\n you need my resume like i'm not gonna send you like i just proved like my value uh but uh but\n\n1:40:06.160 --> 1:40:12.560\n going back to the Fields Medal like when when Perelman went to back to Russia he arrived at a\n\n1:40:12.560 --> 1:40:20.800\n time where the the salary of postdocs were so much off in regards to inflation that they were not\n\n1:40:20.800 --> 1:40:25.920\n making any money like the the people didn't even bother to pick up the checks at the end of the\n\n1:40:25.920 --> 1:40:30.640\n month because they were just like ridiculous but thankfully he had some money that he had\n\n1:40:30.640 --> 1:40:36.320\n uh gained while he was doing this postdoc so he just concentrated on like the Poincare the the\n\n1:40:36.320 --> 1:40:42.560\n Poincare conjecture problem which he when he when he took that um he took it after uh it was\n\n1:40:42.560 --> 1:40:48.320\n reframed by this uh mathematician called Richard Hamilton which posed the problem in a way that\n\n1:40:48.320 --> 1:40:54.320\n it turned into this super like math Olympiad problem with like perfect boundaries well defined\n\n1:40:54.320 --> 1:40:59.360\n and that was perfect for Perelman to attack and so he spent like seven years working on that and\n\n1:40:59.360 --> 1:41:06.720\n then in 2002 he started publishing those papers on archive and people started jumping on that\n\n1:41:06.720 --> 1:41:12.480\n reading those papers and there was like a lot of excitement around that a couple of years later\n\n1:41:12.480 --> 1:41:18.320\n there were two researchers i believe it was they were from Harvard that took Perelman's Perelman's\n\n1:41:18.320 --> 1:41:25.200\n work they sanded some of the edges and they republished that saying that you know based on\n\n1:41:25.200 --> 1:41:31.920\n Perelman's work they were able to figure out the the Poincare conjecture and then there was um\n\n1:41:31.920 --> 1:41:39.280\n at the time at the the international um conference of mathematics in 2000 2006 i believe that's when\n\n1:41:39.280 --> 1:41:44.960\n they were going to give out the Fields Medal there was a lot of debate like oh who's who's\n\n1:41:44.960 --> 1:41:52.720\n like we should get the credit for solving this big problem and for Perelman it like it it felt\n\n1:41:52.720 --> 1:41:57.280\n really sad that people were even considering that he was not the person that solved that\n\n1:41:57.840 --> 1:42:03.520\n and and the claims that those like researchers when they published after Perelman they were\n\n1:42:03.520 --> 1:42:07.520\n false claims that they were the ones they just sanded a couple of edges like Perelman did all\n\n1:42:07.520 --> 1:42:14.320\n the really hard work and so just just the fact that they doubted that Perelman had done that\n\n1:42:14.320 --> 1:42:19.280\n like was enough for him to say i'm not i'm not interested in this prize and that was one of the\n\n1:42:19.280 --> 1:42:25.920\n reasons why he rejected the Fields Medal then he also rejected the clay prize so the Poincare\n\n1:42:25.920 --> 1:42:30.560\n conjecture was one of the millennium prizes there was a million dollar prize associated with that\n\n1:42:30.560 --> 1:42:35.920\n problem and that has to add to do with the fact that for them to attribute that prize i think it\n\n1:42:35.920 --> 1:42:43.520\n had to be published on a journal yes the proof and again Perelman's principles of like interfered\n\n1:42:43.520 --> 1:42:48.800\n here and and he also just didn't care about the money he was like um clay i think was a businessman\n\n1:42:48.800 --> 1:42:53.040\n and he's like doesn't have to do anything with with mathematics i don't care about these like\n\n1:42:54.000 --> 1:42:58.960\n that's one of the reasons why he rejected it yeah there's it's hard to convert into words but\n\n1:43:00.080 --> 1:43:07.680\n at MIT i'm distinctly aware of the distinction between when i enter a room there's a certain\n\n1:43:07.680 --> 1:43:15.520\n kind of music to the way people talk when we're talking about ideas versus what that music sounds\n\n1:43:15.520 --> 1:43:24.640\n like when we're talking when it's like bickering in the space of like whether it's politics or\n\n1:43:24.640 --> 1:43:35.280\n funding or egos it's a different sound to it and i'm distinctly aware of the two and i kind of\n\n1:43:35.280 --> 1:43:42.800\n sort of to me personally happiness was just like swimming around the one that like is the political\n\n1:43:42.800 --> 1:43:51.120\n stuff or the money stuff and all that or egos and i think that's probably what problem is as well\n\n1:43:51.120 --> 1:43:57.120\n like the moment he senses there's any as what it feels metal like the moment you start to have any\n\n1:43:57.120 --> 1:44:03.280\n kind of drama around credit assignment all those kinds of things it's almost not that it's important\n\n1:44:03.280 --> 1:44:08.320\n who gets the credit it's like the drama in itself gets in the way of the exploration of the ideas\n\n1:44:08.320 --> 1:44:13.680\n or the fundamental thing that makes science so damn beautiful and and you can really see that\n\n1:44:13.680 --> 1:44:21.120\n is also a product of that russian school of like doing science and you can see that that um that\n\n1:44:21.120 --> 1:44:26.640\n people were you know during the cold war a lot of mathematicians they were not making any money they\n\n1:44:26.640 --> 1:44:33.280\n were doing math for the sake of math like for the intellectual pleasure of like solving a difficult\n\n1:44:33.280 --> 1:44:38.080\n problem yeah and you know even even if it was a flawed system and there were a lot of problems with\n\n1:44:38.080 --> 1:44:43.840\n with that there's these they were able to to actually achieve these and there were a lot of\n\n1:44:43.840 --> 1:44:49.840\n and perelman for me is the perfect product of that he just cared about like working on tough problems\n\n1:44:49.840 --> 1:44:56.480\n he didn't care about anything else it was just math you know pure math yeah there's a like for\n\n1:44:56.480 --> 1:45:02.160\n the broader audience i think another example of that is like professional sports versus olympics\n\n1:45:02.160 --> 1:45:09.280\n i've especially in russia i've seen that clear distinction where because the state manages\n\n1:45:10.480 --> 1:45:16.560\n so much of the olympic process in russia as people know with the steroids yes yes yes but outside\n\n1:45:16.560 --> 1:45:25.440\n of steroids thing uh is like the athlete can focus on the pure artistry of the sport like\n\n1:45:26.400 --> 1:45:31.040\n like not worry about the money not just in the way they talk about it the way they think about it the\n\n1:45:31.040 --> 1:45:38.400\n way they define excellence versus like in the perhaps a bit of a capitalist system in united\n\n1:45:38.400 --> 1:45:46.640\n states with american football with baseball basketball so much of the discussion is about\n\n1:45:46.640 --> 1:45:53.040\n money now of course at the end of the day it's about excellence and artistry and all that but\n\n1:45:53.040 --> 1:45:58.080\n when the culture is so richly grounded in discussions of money and\n\n1:45:58.080 --> 1:46:04.880\n uh sort of this capitalistic like uh merch and uh businesses and all those kinds of things\n\n1:46:04.880 --> 1:46:11.120\n it changes the nature of the activity and it's in a way that's hard again to describe in words but\n\n1:46:11.120 --> 1:46:18.960\n when it's purely about the activity itself it's almost like you quiet down all the noise\n\n1:46:18.960 --> 1:46:23.680\n enough to hear the signal enough to hear the beauty like whenever you're talking about the\n\n1:46:23.680 --> 1:46:28.640\n like whenever you're talking about the money that's when the marketing people come and the\n\n1:46:28.640 --> 1:46:32.880\n business people the non creatives come and they fill the room and there's and they create drama\n\n1:46:32.880 --> 1:46:36.880\n and they know how to create the drama and the noise as opposed to the people who are truly\n\n1:46:36.880 --> 1:46:44.480\n excellent at what they do the the person in their arena right like when you remove all the money\n\n1:46:44.480 --> 1:46:51.600\n and you just let that thing shine that's when true excellence can and can come out and that was\n\n1:46:51.600 --> 1:46:56.480\n one of the few things that worked with the communist system in the Soviet Union to me at\n\n1:46:56.480 --> 1:47:03.840\n least as somebody who loves sport and loves mathematics and uh science that worked well\n\n1:47:03.840 --> 1:47:11.920\n removing the money from the picture uh you know not that I'm um not that I'm saying poverty is\n\n1:47:11.920 --> 1:47:18.960\n good for science there's some level in which not worrying about money is good for science it's a\n\n1:47:18.960 --> 1:47:24.400\n weird I'm not exactly sure what to make of that because capitalism works really damn well yeah but\n\n1:47:25.200 --> 1:47:32.240\n it's um it's tricky how to find that balance one field's medalist that is interesting to look at\n\n1:47:32.240 --> 1:47:37.600\n and I think you mentioned it earlier but it's Cédric Villani which is might be the only uh\n\n1:47:38.080 --> 1:47:43.840\n field's medalist that is also a politician now but so it's this it's this brilliant French\n\n1:47:43.840 --> 1:47:51.920\n mathematician that won the field's medal and and after that he decided that one of the ways that\n\n1:47:51.920 --> 1:47:58.000\n he could have could have uh you know the biggest leverage kind of is in pushing science in the\n\n1:47:58.000 --> 1:48:04.480\n direction that he thinks science should go would be to to try to go into politics and so that's\n\n1:48:04.480 --> 1:48:11.360\n what he did and and uh and he has ran I'm not sure if he has won any election but I think he's running\n\n1:48:11.360 --> 1:48:15.440\n I think he's running for mayor for mayor of Paris or something like that but it's this brilliant\n\n1:48:15.440 --> 1:48:22.240\n mathematician that uh that uh before winning the field's medal had only been just a brilliant\n\n1:48:22.240 --> 1:48:27.520\n mathematician but but after that he decided to go into politics to to try to to have an impact and\n\n1:48:27.520 --> 1:48:33.440\n try to change some of the things that he he would complain about um before so so there's that\n\n1:48:33.440 --> 1:48:40.400\n component as well yeah and I've always thought mathematics and science should be like like James\n\n1:48:40.400 --> 1:48:48.160\n Bond would in my eyes I think be sexier if he did math like we should as a society put\n\n1:48:49.040 --> 1:48:53.840\n excellence in mathematics at the same level as being able to kill a man with your bare hands\n\n1:48:53.840 --> 1:48:59.840\n like those are both useful features like that's admirable it's like oh like that makes you like\n\n1:48:59.840 --> 1:49:05.520\n that makes the person interesting like being extremely well read about history or philosophy\n\n1:49:05.520 --> 1:49:10.720\n being good at mathematics being able to kill a man with bare hands these are all the same in my book\n\n1:49:10.720 --> 1:49:16.640\n so I think all are useful for action stars uh and I think the society will benefit for uh for giving\n\n1:49:16.640 --> 1:49:24.880\n more value to that like one of the things that bothers me about American culture is the I don't\n\n1:49:24.880 --> 1:49:32.320\n know the right words to use but like the nerdiness associated with science like like in I I don't\n\n1:49:32.320 --> 1:49:40.400\n think nerd is a good word in in American culture because uh it's seen as like weakness there's like\n\n1:49:40.400 --> 1:49:47.280\n images that come with that and it's fine you could you could be all kinds of shapes and colors and\n\n1:49:47.280 --> 1:49:55.120\n personalities but like to me uh having sophisticated knowledge in science being good at math\n\n1:49:56.160 --> 1:50:01.840\n doesn't mean you're weak in fact it could be the very opposite and so it's it's an\n\n1:50:01.840 --> 1:50:07.600\n interesting thing because it was very much differently viewed in the uh in the Soviet Union\n\n1:50:07.600 --> 1:50:14.480\n so I know for sure as an existence proof that uh it doesn't have to be that way but it um\n\n1:50:15.440 --> 1:50:22.000\n I also feel like we lack a lot of role models in terms if you ask people are mentioned to mention\n\n1:50:22.000 --> 1:50:26.400\n one mathematician that they know that is alive today I think a lot of people would struggle\n\n1:50:26.400 --> 1:50:36.960\n to answer that question um and I also think I love Neil deGrasse Tyson okay but there is uh\n\n1:50:38.080 --> 1:50:44.000\n having more role models is good like different kinds of personalities he he has kind of fun and\n\n1:50:44.000 --> 1:50:49.760\n and it's very it's uh like Bill Nye the science guy I don't know if you guys know him so like that\n\n1:50:49.760 --> 1:50:56.880\n spectrum that yeah but there there's not like Feynman is no longer there uh those kinds of\n\n1:50:56.880 --> 1:51:05.120\n personality Carl Sagan even Carl Sagan yeah like a seriousness that's like not playful like not\n\n1:51:05.120 --> 1:51:12.800\n apologetical yeah exactly not apologetic about being knowledgeable like like in fact like the\n\n1:51:12.800 --> 1:51:21.920\n kind of energy where you feel uh self conscious about not having thought about some of these\n\n1:51:21.920 --> 1:51:28.400\n questions right just like when I see James Bond I feel bad about that I don't have never killed a\n\n1:51:28.400 --> 1:51:33.280\n man like I need to make sure I fix that that's the way I feel the same way I want to feel like\n\n1:51:33.280 --> 1:51:38.320\n that way well Carl Sagan talks I I feel like I need to have that same kind of seriousness about\n\n1:51:38.320 --> 1:51:43.440\n science like if I don't know something I want to I want to know well what about Terrence Tao\n\n1:51:44.160 --> 1:51:48.720\n he's kind of a superstar what are your thoughts about him true it's probably one of the most\n\n1:51:48.720 --> 1:51:53.440\n famous mathematicians alive today and probably one of I mean regardless of like is of course\n\n1:51:54.400 --> 1:52:02.640\n he won a field the Fields Medal is really smart and talented mathematician um it's also like a\n\n1:52:02.640 --> 1:52:10.160\n big inspiration for us um at least for some of the work that we do with Fermat's library\n\n1:52:10.160 --> 1:52:15.120\n so Terrence Tao is is known for having you know a big blog and he's pretty open about\n\n1:52:15.920 --> 1:52:23.760\n um like his research and he also he tries to make his work as public as possible um through his blog\n\n1:52:23.760 --> 1:52:30.400\n posts um in fact there's a really interesting um problem that got solved a couple of years ago\n\n1:52:30.400 --> 1:52:36.800\n so Tao was working with uh on a problem on an Erdos problem actually so Paul Erdos was this\n\n1:52:37.840 --> 1:52:44.800\n mathematician from Hungary and he was known for like um the Erdos for a lot of things but one of\n\n1:52:44.800 --> 1:52:49.680\n the things that he was also known was for the Erdos problem so he was always like um creating\n\n1:52:49.680 --> 1:52:54.000\n these problems and usually associating prizes with those problems and a lot of those problems\n\n1:52:54.000 --> 1:52:58.080\n are still open like and and there will be some of them will be open for like maybe\n\n1:52:58.080 --> 1:53:02.720\n a couple hundred years and I think that's actually an interesting hack for him to collaborate with\n\n1:53:02.720 --> 1:53:08.880\n future mathematicians you know his his name will keep coming up and you know for future generations\n\n1:53:08.880 --> 1:53:14.240\n but so Tao was working on one of these problems called the Erdos discrepancy and he published a\n\n1:53:14.240 --> 1:53:21.600\n blog post on like uh about that problem about that problem and he reached like a dead end and then um\n\n1:53:21.600 --> 1:53:26.640\n all of a sudden there was this guy from from Germany that wrote like a comment on his blog post\n\n1:53:26.640 --> 1:53:32.800\n saying okay like some of the that so this problem is like a Sudoku like flavor and some of the\n\n1:53:32.800 --> 1:53:38.400\n machinery that we're using to solve Sudoku could be used here and that was actually the key to\n\n1:53:38.400 --> 1:53:43.440\n solve the Erdos discrepancy problem so the there was a comment on his blog and I think that that\n\n1:53:43.440 --> 1:53:50.480\n that for me is an example of like how to do again going back to collaborative science online um and\n\n1:53:50.480 --> 1:53:57.760\n the power that it has but Tao is also like pretty public about like some of the struggles and of\n\n1:53:57.760 --> 1:54:04.320\n of being a a mathematician like and and even he wrote about some of the unintended consequences\n\n1:54:04.320 --> 1:54:10.880\n of having extraordinary ability in a field and he used himself as an example when he was growing up\n\n1:54:10.880 --> 1:54:17.440\n he was extremely talented in in mathematics from a young age like Tao was a person he won an\n\n1:54:17.440 --> 1:54:22.480\n uh medal in like one of the IMOs at the age I think was a gold medal at the age of 10 or something\n\n1:54:22.480 --> 1:54:28.560\n like that and so he mentioned that when he was growing up like and especially in college when he\n\n1:54:28.560 --> 1:54:34.080\n was in a class that he enjoyed it didn't it just came very natural for him and he didn't have to\n\n1:54:34.080 --> 1:54:40.160\n work hard to just ace the class and when he found that the class was boring like it didn't work and\n\n1:54:40.160 --> 1:54:47.760\n he barely passed barely passed even some I think in college he almost failed two classes and and\n\n1:54:47.760 --> 1:54:53.280\n he was talking about that and how he brought those studying habits or like uh in existence of studying\n\n1:54:53.280 --> 1:54:58.880\n habits when he went to Princeton Princeton for his PhD and in Princeton when he you know started kind\n\n1:54:58.880 --> 1:55:05.920\n of um delving into more complex problems and classes he struggled a lot because he didn't have\n\n1:55:05.920 --> 1:55:11.440\n that uh those those habits like he wasn't taking notes and he was he wasn't studying hard when he\n\n1:55:11.440 --> 1:55:18.080\n when he faced problems and he almost failed out of his his PhD uh he almost failed his PhD exam\n\n1:55:18.080 --> 1:55:23.280\n and um it it talks about like having this conversation with with his advisor and the\n\n1:55:23.280 --> 1:55:28.160\n advisor pointing out like you're not this is not working you you might have to get out of the\n\n1:55:28.160 --> 1:55:35.680\n program and like how that was a kind of a turning point for him and um he was like you know he was\n\n1:55:35.680 --> 1:55:41.200\n um and like it was super important in his career so I think Tao is also like this figure that apart\n\n1:55:41.200 --> 1:55:46.080\n from being just an exceptional mathematician he's also pretty open about you know what what it takes\n\n1:55:46.080 --> 1:55:50.880\n to to to be a mathematician and some of the struggles of this type of careers and and I think\n\n1:55:50.880 --> 1:55:56.880\n it's that's super important in many ways he's a contributor to open science and open humanity\n\n1:55:56.880 --> 1:56:03.200\n so he's being an open human true by communicating uh Scott Aaronson is another in computer science\n\n1:56:03.200 --> 1:56:08.400\n world who's a very different style very different style but there's something about a blog that\n\n1:56:09.280 --> 1:56:15.760\n is authentic and real and just gives us a window into the into the mind and soul of of of these\n\n1:56:15.760 --> 1:56:20.720\n brilliant folks so it's it's definitely a gift let me ask you about Fermat's library on twitter\n\n1:56:22.000 --> 1:56:27.200\n which uh I mean I don't know how to describe it people should definitely just follow Fermat's\n\n1:56:27.200 --> 1:56:35.280\n library on twitter I keep following and unfollowing from his library because because uh it's so\n\n1:56:35.920 --> 1:56:46.080\n it it gives when I follow it um leads me on down rabbit holes often that um that um that are very\n\n1:56:46.080 --> 1:56:53.360\n fruitful but but anyway so the the posts you do with the on twitter are just these beautiful\n\n1:56:53.360 --> 1:57:00.960\n are things that reveal some beautiful aspect of mathematics um is there um is there something you\n\n1:57:00.960 --> 1:57:10.080\n could say about the approach there yeah and um maybe maybe broadly what you find beautiful about\n\n1:57:10.080 --> 1:57:17.120\n mathematics and then more specifically how you convert that into a rigorous process of revealing\n\n1:57:17.120 --> 1:57:22.560\n that in tweet form that's a good point I think there's something about math that you know a lot\n\n1:57:22.560 --> 1:57:28.560\n you know a lot of the mathematical content and you know papers or like little proofs um you know\n\n1:57:29.360 --> 1:57:36.000\n has in a way sort of an infinite half life what I mean by that is that if you look at like Euclid's\n\n1:57:36.000 --> 1:57:42.720\n elements it's as valid today as it was when it was created like 2000 years ago and that's not true\n\n1:57:42.720 --> 1:57:51.920\n for a lot of other scientific fields um and so in regards to twitter I think there's also a very\n\n1:57:51.920 --> 1:57:58.960\n it's a very under under explored platform from a learning perspective I think if you look at\n\n1:57:58.960 --> 1:58:07.040\n content on twitter it's very easy to consume it's very easy to read um and especially when you're\n\n1:58:07.600 --> 1:58:12.960\n trying to explain something you know we humans get a dopamine hit if we learn something new\n\n1:58:14.000 --> 1:58:20.000\n and that's a very very powerful feeling and that's why you know people go to classes when\n\n1:58:20.000 --> 1:58:24.640\n you have a really good professor you know it's looking for those dopamine hits and\n\n1:58:25.840 --> 1:58:31.280\n and and that's something that we try to explore when we're producing content on twitter imagine\n\n1:58:31.280 --> 1:58:36.960\n if we could if you would on a line to a restaurant you could go go to your phone to learn something\n\n1:58:36.960 --> 1:58:44.640\n new instead of social going to a you know social network and to just and so and I think it's very\n\n1:58:44.640 --> 1:58:51.680\n hard to to sometimes to kind of provide that feeling because you need to sometimes digest\n\n1:58:51.680 --> 1:58:58.960\n content and and put it um in a way you know that it feeds 280 characters um and and it requires a\n\n1:58:58.960 --> 1:59:04.880\n lot of sometimes time to do that uh even though it's easy to consume it's hard to make but once\n\n1:59:04.880 --> 1:59:10.960\n you are able to to provide that eureka moment to people like that's very powerful they get that\n\n1:59:10.960 --> 1:59:16.320\n dopamine hit and like you create this feedback cycle and people come back for for more and in\n\n1:59:16.320 --> 1:59:21.200\n twitter compared to like you know an online course for a book you have a zero percent dropout so\n\n1:59:21.200 --> 1:59:27.440\n people will read the content the content so that it's it's like it's part of the creators like the\n\n1:59:27.440 --> 1:59:32.160\n person that is creating the content if you're able to actually get that feedback cycle it's\n\n1:59:32.160 --> 1:59:38.080\n super super powerful yeah but some of the stuff is like like how the heck do you find that and\n\n1:59:38.080 --> 1:59:44.240\n and i don't know why it's so appealing it uh like uh this is from uh what is it\n\n1:59:45.760 --> 1:59:53.120\n a couple days ago i'll just read out the number 23456789 is the largest prime number with\n\n1:59:53.120 --> 2:00:00.800\n consecutive increasing digits i mean that is so cool that's like some weird like glimpse\n\n2:00:00.800 --> 2:00:07.440\n into some deep universal truth even though it's just a number i mean that's like so arbitrary\n\n2:00:07.440 --> 2:00:12.880\n like why why is it so pleasant that that's a thing but it is in some way it's almost like\n\n2:00:12.880 --> 2:00:19.920\n it is a little glimpse at some much bigger like um and and i think like especially if we're talking\n\n2:00:19.920 --> 2:00:25.440\n about science there's something unique about you go and with a lot of the tweets you go sometimes\n\n2:00:25.440 --> 2:00:30.960\n from a state of not knowing something to knowing something and that is very particular to science\n\n2:00:30.960 --> 2:00:37.200\n math physics and that again is extra extremely addictive and that's that's how i i i i feel about\n\n2:00:37.200 --> 2:00:43.920\n that and um that's why i think people engage so much with with our tweets and go into rabbit holes\n\n2:00:43.920 --> 2:00:49.200\n and then they you know we start with prime numbers and all of a sudden you are spending hours reading\n\n2:00:49.200 --> 2:00:56.000\n number theory things and you go into wikipedia and you lose a lot of time there but uh well the\n\n2:00:56.000 --> 2:01:01.680\n variety is really interesting too there's human things there's uh there's physics things there's\n\n2:01:01.680 --> 2:01:07.600\n like numeric things like i just mentioned but there's also more rigorous mathematical things\n\n2:01:08.240 --> 2:01:12.720\n there's stuff that's tied to the history of math and the proofs and there's visual there's\n\n2:01:12.720 --> 2:01:17.600\n animations uh there are looping animations that are incredible that reveal something\n\n2:01:17.600 --> 2:01:24.960\n there's uh andrew wiles on being smart this is just me now like ignoring you guys is just going\n\n2:01:24.960 --> 2:01:29.840\n through yeah we're a bit like math drug dealers we're just trying to get you hooked we're trying\n\n2:01:29.840 --> 2:01:35.120\n to give you that hit and trying to get you hooked yes some people are brighter than others but i\n\n2:01:35.120 --> 2:01:40.320\n really believe that most people can really get to to quite a good level of mathematics if they're\n\n2:01:40.320 --> 2:01:45.440\n prepared to deal with these psychological issues of how to handle the situation of being stuck\n\n2:01:45.440 --> 2:01:51.600\n yeah there's some truth to that that's truth i feel that's like really it's some truth in terms\n\n2:01:51.600 --> 2:01:57.120\n of research and also about startups you're stuck a lot of the time before you you get to a\n\n2:01:57.120 --> 2:02:02.320\n breakthrough and and it's difficult to endure that process of like being stuck and because you're not\n\n2:02:02.320 --> 2:02:09.040\n trained to to be in that position um i feel uh yeah that's yeah most people are broken by the\n\n2:02:09.040 --> 2:02:16.720\n stuckness or like their district like uh i i've i've been very cognizant of the fact that\n\n2:02:17.760 --> 2:02:24.960\n more and more social media becomes a thing like distractions become a thing that that moment of\n\n2:02:24.960 --> 2:02:32.400\n being stuck is uh your mind wants to to go do stuff that's unrelated to being stuck and you\n\n2:02:32.400 --> 2:02:39.040\n should be stuck i'm referring to small stucknesses like you're like trying to design something and\n\n2:02:39.040 --> 2:02:44.000\n it's a dead end basically little dead ends dead ends of programming dead ends and trying to think\n\n2:02:44.000 --> 2:02:50.640\n through something and then your mind wants to like like like uh this is the problem this like\n\n2:02:51.440 --> 2:02:58.640\n work life balance culture is like take a break like as if taking a break will solve everything\n\n2:02:58.640 --> 2:03:02.560\n sometimes it solves quite a bit but like sometimes you need to sit in the stuckness and suffer a\n\n2:03:02.560 --> 2:03:08.880\n little bit and then take a break but you you definitely need to be this and like most people\n\n2:03:08.880 --> 2:03:17.680\n quit from that psychological battle being stuck so success is people who who who uh persevere\n\n2:03:17.680 --> 2:03:22.880\n through that yeah yeah and and in the creative process that's also true i was the other day i\n\n2:03:22.880 --> 2:03:28.400\n was i think was reading about is this um what is his name ed sheeran like the musician yeah was\n\n2:03:28.400 --> 2:03:33.120\n talking a little bit about the creative process and using was using this analogy of a faucet like\n\n2:03:33.120 --> 2:03:38.800\n where you when you turn on a faucet is as like the dirty water coming out in the beginning and you\n\n2:03:38.800 --> 2:03:45.120\n just have to you know keep trusting that at some point your clean clean clear water will come out\n\n2:03:45.120 --> 2:03:50.000\n but you have to endure that process like in the beginning it's going to be dirty water and and and\n\n2:03:50.000 --> 2:03:56.400\n just you know embrace that yeah actually this uh the entirety of my youtube channel and this\n\n2:03:56.400 --> 2:04:02.640\n podcast have been following that philosophy of dirty water like i've been you know i do believe\n\n2:04:02.640 --> 2:04:08.000\n that like you have to get all the crap out of your system first and uh sometimes it it's it's all\n\n2:04:08.560 --> 2:04:14.880\n sometimes it's all crappy work i tend to be very self critical but i do think that quantity leads\n\n2:04:14.880 --> 2:04:20.240\n to quality for some people it does for my the way my mind works is like just keep putting stuff out\n\n2:04:20.240 --> 2:04:28.880\n there keep creating and uh the quality will come as opposed to sitting there waiting not doing\n\n2:04:28.880 --> 2:04:35.600\n anything until the thing seems perfect because the perfect may never come but just just on like on\n\n2:04:35.600 --> 2:04:40.480\n on on our twitter like profile i really and sometimes when you look on some of those tweets\n\n2:04:40.480 --> 2:04:47.360\n they might seem like pretty kind of um you know why is this interesting it's like so raw uh like\n\n2:04:47.360 --> 2:04:53.680\n it's just a number but i really believe that especially with math or physics it is possible\n\n2:04:53.680 --> 2:04:59.600\n to get everyone to love math or physics even if you think you hate it it's it's not a function of\n\n2:04:59.600 --> 2:05:04.240\n the student or the person that is on the other side i think is just purely a function of like\n\n2:05:04.240 --> 2:05:11.040\n how you explain uh hidden beauty that they hadn't realized before it's not easy but i think it's\n\n2:05:11.040 --> 2:05:16.880\n like a lot of the times it's on like on the creator's side to to be able to like show that\n\n2:05:16.880 --> 2:05:22.800\n beauty to the other person i think some of that is native to to humans we just have that curiosity\n\n2:05:22.800 --> 2:05:28.000\n and you look at small toddlers and babies and like them trying to figure things out and there's\n\n2:05:28.000 --> 2:05:32.880\n just something that is born with us that we we we want for that understanding of the world\n\n2:05:32.880 --> 2:05:38.480\n we want for that understanding we want to figure out the world around us and and so yeah it shouldn't\n\n2:05:38.480 --> 2:05:45.680\n be like uh whether or not people are going are going to to enjoy it like i i i also really\n\n2:05:45.680 --> 2:05:51.680\n believe that everybody has that capacity to fall in love with with math and physics you mentioned\n\n2:05:51.680 --> 2:05:58.960\n startup what do you think it takes to build a successful startup yeah that it's what what\n\n2:05:58.960 --> 2:06:06.080\n luis was saying that um you need to in to be able to endure being stuck and and i think the best way\n\n2:06:06.080 --> 2:06:14.000\n to put it is that startups don't have a linear reward function right you oftentimes don't get\n\n2:06:14.000 --> 2:06:21.760\n rewarded for effort and and and most of our lives we go through these processes that do\n\n2:06:22.640 --> 2:06:27.200\n give you those small rewards for effort right in school you study hard generally you'll get a good\n\n2:06:27.200 --> 2:06:33.040\n grade and then you good you get like good grades ever or you get grades every semester and so you're\n\n2:06:33.040 --> 2:06:40.400\n slowly getting rewarded and pushed in the right direction for for startups and startups are not\n\n2:06:40.400 --> 2:06:45.280\n the only thing that is like this but for startups it's you know you can put in a ton of effort into\n\n2:06:45.280 --> 2:06:51.200\n something that and then get no reward for it right it's it's like like sisyphus boulder where you're\n\n2:06:51.200 --> 2:06:57.360\n pushing that boulder up the mountain and and and you get to the top and then it just rolls all the\n\n2:06:57.360 --> 2:07:02.480\n way back down and and so that's something that i think a lot of people are not equipped to deal\n\n2:07:02.480 --> 2:07:10.560\n with and can be incredibly demoralizing especially if that happens more than than a few times and so\n\n2:07:10.560 --> 2:07:16.800\n but i think it's absolutely essential to to power through it because um by the nature of startups\n\n2:07:16.800 --> 2:07:23.040\n it's oftentimes you know you're dealing with with with non obvious ideas and things that\n\n2:07:23.040 --> 2:07:28.720\n there might be contrarian and so you're gonna you're gonna run into into that a lot you're\n\n2:07:28.720 --> 2:07:33.760\n gonna do things that are not gonna work out and you need to be prepared to deal with that but\n\n2:07:34.400 --> 2:07:38.800\n but if we're not coming out of college you're you're just not equipped i'm not sure if there's\n\n2:07:38.800 --> 2:07:45.360\n a way to train people to deal with those nonlinear reward functions but it's definitely i think one\n\n2:07:45.360 --> 2:07:51.440\n of the most difficult things to you know about doing a startup and also happens in research\n\n2:07:51.440 --> 2:07:56.480\n sometimes you know we're talking about the default state is being stuck you just you know you don't\n\n2:07:56.480 --> 2:08:02.080\n like you try things you get zero results you close doors you constantly closing doors until you you\n\n2:08:02.080 --> 2:08:08.000\n know find something and um yeah that is a big thing what about sort of this point when you're\n\n2:08:08.000 --> 2:08:15.520\n stuck there's a kind of decision whether if you have a vision to persist through with this direction\n\n2:08:15.520 --> 2:08:21.680\n that you've been going along or what a lot of startups do or businesses is pivot how do you\n\n2:08:21.680 --> 2:08:29.920\n decide whether like to give up on a particular flavor of the way you've imagined the design\n\n2:08:29.920 --> 2:08:38.560\n and to like adjust it or completely like alter it i think that's a core question for startups that\n\n2:08:38.560 --> 2:08:44.160\n i've asked myself exactly and like i i've never been able to come up with a great framework to\n\n2:08:44.160 --> 2:08:51.120\n make those decisions um i think that's really at the core of uh yeah out of a lot of the the\n\n2:08:51.120 --> 2:08:57.840\n toughest questions that that people that's that started a company you have to deal with um i think\n\n2:08:57.840 --> 2:09:03.200\n maybe the best framework that i i have was able to figure out like when you run out of ideas\n\n2:09:04.080 --> 2:09:09.360\n you just you know you're exploring something is not working you try it in a different angle uh\n\n2:09:09.360 --> 2:09:14.320\n you know we try a different business model when you run out of ideas like you don't have any more\n\n2:09:14.320 --> 2:09:22.560\n cards just switch and yeah it's not perfect because you also it's you have a lot of stories\n\n2:09:22.560 --> 2:09:29.520\n of startups is like people kept pushing and then you know that paid off and then you have uh\n\n2:09:29.520 --> 2:09:36.720\n philosophies is like fail fast and pivot fast um so it's you know it's hard to you know balance\n\n2:09:36.720 --> 2:09:42.000\n these two worlds and understand what is the best framework and i mean if you look at for miles\n\n2:09:42.000 --> 2:09:48.080\n library you're maybe you can correct me but it feels like you're an operating in a space\n\n2:09:48.080 --> 2:09:53.840\n where there's a lot of things that are broken and or could be significantly improved so it\n\n2:09:53.840 --> 2:10:00.240\n feels like there's a lot of possibilities for pivoting or like how do you revolutionize science\n\n2:10:00.240 --> 2:10:08.240\n how do you revolutionize the aggregation the the annotation the commenting the community around\n\n2:10:08.240 --> 2:10:13.520\n information of knowledge structured knowledge i mean that's kind of what like stack overflow\n\n2:10:13.520 --> 2:10:19.200\n and stack exchange has struggled with to come up with a solution and they've come up i think with\n\n2:10:19.200 --> 2:10:23.680\n an interesting set of solutions that are also i think flawed in some ways but they're much much\n\n2:10:23.680 --> 2:10:29.280\n better than the alternatives but there's a lot of other possibilities if we just look at papers as\n\n2:10:29.280 --> 2:10:33.440\n we talked about there's so many possible revolutions and they're a lot of money to be\n\n2:10:33.440 --> 2:10:39.760\n potentially made those revolutions plus coupled with that the benefit to humanity and so like\n\n2:10:39.760 --> 2:10:45.440\n you're sitting there like i don't know how many people are legitimately from a business perspective\n\n2:10:45.440 --> 2:10:50.880\n playing with these ideas it feels like there's a lot of ideas here true it varies are you right\n\n2:10:50.880 --> 2:10:55.680\n now grinding in a particular direction like is there a video like a five year vision that you're\n\n2:10:55.680 --> 2:11:03.040\n thinking in your mind for us it's more like a 20 year vision in the sense that uh we we've\n\n2:11:03.040 --> 2:11:10.880\n consciously tried to make the decision of so we so we run formats as it's a side project and it's\n\n2:11:10.880 --> 2:11:18.720\n separate in the sense like it's not what we're working on full time and uh but our thesis there\n\n2:11:18.720 --> 2:11:24.880\n is that we actually think that it's that's a good thing at least for for this stage of formats\n\n2:11:24.880 --> 2:11:32.480\n library um and also because some of these projects you just if you're coming from a start from a\n\n2:11:32.480 --> 2:11:40.240\n startup framework you probably try to try to fit every single idea into something that can change\n\n2:11:40.240 --> 2:11:45.360\n the world within three to five years and there's just some problems that take longer than that\n\n2:11:45.360 --> 2:11:51.200\n right and so you know we're talking about archive and i'm very doubtful that you could grow like\n\n2:11:51.200 --> 2:11:56.480\n archive into what it is today like within two or three years no matter how much money you throw at\n\n2:11:56.480 --> 2:12:02.880\n it there's just some things that can take longer but you need to be able to power through the the\n\n2:12:02.880 --> 2:12:08.080\n that the time that it takes um but if you look at it as okay this is a company this is a startup\n\n2:12:08.080 --> 2:12:14.080\n we have to grow fast we have to raise money then uh then sometimes you might forego those ideas\n\n2:12:14.080 --> 2:12:22.080\n because of that um because they don't very well fit into the the typical startup framework and\n\n2:12:22.080 --> 2:12:27.840\n so for us formats it's something that we're okay with growing with having it grow slowly and and\n\n2:12:27.840 --> 2:12:34.240\n maybe taking many years and and and that's why we think it's it's not a bad thing that it is a side\n\n2:12:34.240 --> 2:12:41.600\n project because it makes it much more um acceptable in a way and that to to be able to be okay with\n\n2:12:41.600 --> 2:12:48.400\n that that said i think what happens is if you keep pushing new little features new little ideas\n\n2:12:48.400 --> 2:12:54.880\n i feel like there's like certain ideas will just become viral like and then you just won't be able\n\n2:12:54.880 --> 2:13:00.320\n to help yourself but it'll revolutionize things it feels like there needs to be not needs to be\n\n2:13:00.320 --> 2:13:08.720\n but there's um opportunity for viral ideas to change science absolutely and maybe we don't know\n\n2:13:08.720 --> 2:13:13.440\n what those are yet it might be a very small kind of thing maybe you don't even know if should this\n\n2:13:13.440 --> 2:13:19.840\n be a for profit company doing these it's the wikipedia question yeah um is that there are a lot\n\n2:13:19.840 --> 2:13:24.880\n of questions like really fundamental questions about this space um that we've we've talked about\n\n2:13:24.880 --> 2:13:29.280\n i mean you take wikipedia and you try to run it as a startup and by now we'd have a paywall you'd be\n\n2:13:29.280 --> 2:13:34.800\n paying 9.99 a month to to read more than 20 articles i mean that's that's one view yeah the\n\n2:13:34.800 --> 2:13:41.920\n other the ad driven model so they rejected the ad driven model i don't know if we could i mean this\n\n2:13:41.920 --> 2:13:48.960\n is a difficult question you know if archive was supported by ads i don't know if that's bad for\n\n2:13:48.960 --> 2:13:55.440\n archive if for mass library was supported by ads i don't know i don't i'm not it's not trivial to\n\n2:13:55.440 --> 2:14:02.640\n me i'm unlike i think a lot of people uh i'm not against advertisements i think ads when done\n\n2:14:02.640 --> 2:14:06.640\n well are really good i think the problem with facebook and all the social networks are the way\n\n2:14:07.200 --> 2:14:12.880\n the lack of transparency around the way they use data and uh the lack of control the users have\n\n2:14:12.880 --> 2:14:18.240\n over their data not the fact that data is being collected and used to sell advertisements it's a\n\n2:14:18.240 --> 2:14:23.040\n lack of transparency lack of control if you if you do a good job with that i feel like it's really\n\n2:14:23.040 --> 2:14:29.200\n nice way to make stuff free yeah it's like stack overflow right i mean i think they've done a okay\n\n2:14:29.200 --> 2:14:33.920\n a good job with that uh even though as we said like they're capturing very little of the value\n\n2:14:33.920 --> 2:14:39.920\n that they're putting out there right but but it makes it a sustainable company and and they're\n\n2:14:39.920 --> 2:14:46.960\n providing a lot of it's a fantastic and very productive community let me ask a a ridiculous\n\n2:14:46.960 --> 2:14:53.520\n tangent of a question please you wrote a paper on uh on game of thrones battle of winterfell just\n\n2:14:53.520 --> 2:15:02.080\n as a side little i i'm sorry i noticed i'm sure you've done a lot of ridiculous stuff like this i\n\n2:15:02.080 --> 2:15:08.240\n just noticed that particular one by ridiculous i mean ridiculously awesome can you describe the uh\n\n2:15:08.240 --> 2:15:14.000\n the approach in this work which i believe is a legitimate publication so going back to the\n\n2:15:14.000 --> 2:15:18.720\n original like uh when we were talking about the backstory of of papers and the importance of that\n\n2:15:18.720 --> 2:15:25.760\n you know there was a when the last season of the the show was airing uh this was a during a company\n\n2:15:25.760 --> 2:15:32.880\n lunch we there was in in the last season there's the there's a really big battle against the the\n\n2:15:32.880 --> 2:15:39.920\n forces of evil and the you know the forces of good and it's called the battle of winterfell\n\n2:15:39.920 --> 2:15:46.160\n and um in this battle there are like these two armies and there's a very particular thing that\n\n2:15:46.160 --> 2:15:51.360\n they have to take into account is that in the army of dead like if someone dies in the army of\n\n2:15:51.360 --> 2:15:59.200\n the living uh like that person is gonna you know be a reborn as a soldier in the army of the dead\n\n2:15:59.200 --> 2:16:04.000\n yes and so that was a an important thing to take into account and the initial conditions as you\n\n2:16:04.000 --> 2:16:08.800\n specify it's about a hundred thousand on each side exactly so i was able i was able to like based on\n\n2:16:08.800 --> 2:16:13.200\n some images or like on previous episodes to figure out what was the size of the armies and so what i\n\n2:16:13.200 --> 2:16:19.760\n want what we wanted to what we were theorizing was like how many soldiers does like a soldier\n\n2:16:19.760 --> 2:16:26.880\n on the army of the living has to kill in order for them to be able to destroy the army of the dead\n\n2:16:26.880 --> 2:16:33.280\n without like losing because every time one of the good soldiers dies gonna turn into like the other\n\n2:16:33.280 --> 2:16:39.120\n side and so it's so i we we were theorizing that and and i wrote wrote a couple of differential\n\n2:16:39.120 --> 2:16:43.840\n equations and i was able to figure out that based on the size of the armies i think i think was the\n\n2:16:43.840 --> 2:16:50.560\n ratio had to be like 1.7 so it had to kill like 1.7 soldiers like the army of the dead in order\n\n2:16:50.560 --> 2:16:57.520\n for them to win the battle well yeah that's that's science it is it's it's the most powerful\n\n2:16:58.160 --> 2:17:05.680\n and this is also somehow a pitch for uh like a hiring pitch in a sense like this is the kind of\n\n2:17:05.680 --> 2:17:11.840\n yeah important science you do exactly well turned out to be you know as as for people that have\n\n2:17:11.840 --> 2:17:16.240\n watched these shows is like they know that every time you try to predict something that is going\n\n2:17:16.240 --> 2:17:20.240\n to happen it's going to you're going to fail miserably and that's what happened so it was not\n\n2:17:20.240 --> 2:17:26.160\n not at all important for the show but yeah we ended up like putting that out and there was a\n\n2:17:26.160 --> 2:17:30.480\n lot of people that share that i think was some like elements of the of the show the cast of the\n\n2:17:30.480 --> 2:17:35.760\n show that actually retweeted that and shared that that first one was fun i would love if this kind\n\n2:17:35.760 --> 2:17:43.440\n of calculation happened uh like during the making of the show or you know i love it like in um\n\n2:17:44.720 --> 2:17:51.040\n for example i i now know uh alex garland the director of ex machina and i love it he doesn't\n\n2:17:51.040 --> 2:17:58.400\n seem to be some not many people seem to do this but i love it when directors and people who wrote\n\n2:17:58.400 --> 2:18:04.960\n the story really think through the technical details like whether it's knowing like how things\n\n2:18:04.960 --> 2:18:10.160\n even if it's science fiction if you were to try to do this how would you do this uh like\n\n2:18:10.160 --> 2:18:16.320\n stephen wolfram and his son were um were collaborating with the movie arrival in\n\n2:18:16.320 --> 2:18:21.840\n designing the alien language how you communicate with aliens like how would you really have\n\n2:18:21.840 --> 2:18:31.200\n uh a math based language that uh that could span the alien and uh being and the human being so i\n\n2:18:31.200 --> 2:18:35.120\n i love it when they have that kind of rigor the martian was also big on that like the book and\n\n2:18:35.120 --> 2:18:41.280\n the movie was all about like can we actually you know is this plausible can this happen it was all\n\n2:18:41.280 --> 2:18:46.960\n about that and that can really bring you in like the sometimes those small details uh i mean the\n\n2:18:46.960 --> 2:18:52.320\n i mean the the guy that wrote the martian book is another book uh that is also filled with those\n\n2:18:52.320 --> 2:18:58.720\n like things that when you realize that okay these are grounded in in science can just really bring\n\n2:18:58.720 --> 2:19:04.720\n you in yeah like the like the he has a book about a colony on the colony on the moon and he goes\n\n2:19:04.720 --> 2:19:09.280\n about like all the details that would you know be required about setting up a colony in the moon\n\n2:19:09.280 --> 2:19:14.960\n and like things that he wouldn't think about like the the fact that um they would you know it's\n\n2:19:14.960 --> 2:19:21.360\n hard to bring like uh air to the moon say so they wouldn't like how do you make that breathable that\n\n2:19:21.360 --> 2:19:26.800\n environment breathable you need to bring oxygen but like you you you probably wouldn't be bring\n\n2:19:26.800 --> 2:19:34.240\n nitrogen so what you do is like instead of having a an atmosphere that is 100 oxygen you like\n\n2:19:34.240 --> 2:19:39.760\n decrease the pressure so that you have the same ratio of oxygen on earth but like lowering the\n\n2:19:39.760 --> 2:19:45.840\n pressure here and so like things like water boils at the lower temperature so people would would\n\n2:19:45.840 --> 2:19:50.880\n have coffee and the coffee would be colder like there was a problem in this uh environment in\n\n2:19:50.880 --> 2:19:57.360\n the moon so like and these are like small things in the book but i studied physics so like when i\n\n2:19:57.360 --> 2:20:04.080\n read these like that throws me into like uh tangents and i start researching that and it's\n\n2:20:04.080 --> 2:20:11.520\n like i really like to read books and watch movies when they go to that level of detail uh about\n\n2:20:11.520 --> 2:20:15.760\n science yeah i think interstellar was one where they also consulted heavily with with a number of\n\n2:20:15.760 --> 2:20:20.560\n yeah i think even resulted in a couple of papers a couple of papers about like the black hole\n\n2:20:20.560 --> 2:20:27.360\n um visualizations and um yeah but there isn't and there's even more examples of interesting science\n\n2:20:27.360 --> 2:20:33.680\n around like these fantasy we were reading at some point like these guys that were trying to figure\n\n2:20:33.680 --> 2:20:42.480\n out if if the tolkien's middle earth if it was uh round if it was like a sphere yeah it's like a\n\n2:20:42.480 --> 2:20:50.240\n flat based on the map based on the map and some of the references in the in the books and so uh\n\n2:20:50.240 --> 2:20:54.480\n yeah we actually i think we tweeted about that you can yeah we did based on the distance between the\n\n2:20:54.480 --> 2:21:00.320\n cities you can actually prove that that could be like a map of a sphere or like a spheroid\n\n2:21:00.320 --> 2:21:09.680\n and and you can actually calculate the radius of that planet uh that's fascinating i mean yeah\n\n2:21:09.680 --> 2:21:16.880\n that's fascinating but there's something about like calculating the number like exactly the\n\n2:21:16.880 --> 2:21:23.120\n calculation you did for the battle winterfell is um something fascinating about that because\n\n2:21:23.120 --> 2:21:30.640\n that's not like being that's very mathematical versus like grounded in physics and that's really\n\n2:21:30.640 --> 2:21:38.400\n interesting i mean that's like injecting mathematics into fantasy there's there's something um i see\n\n2:21:38.400 --> 2:21:42.640\n what you're saying about that and and that for me that's why i think it's also when you look at\n\n2:21:42.640 --> 2:21:49.440\n things like like Fermat's last theorem like problems that are very kind of self contained\n\n2:21:49.440 --> 2:21:54.160\n and simple to study i think like that's the same with that paper it's very easy to understand the\n\n2:21:54.160 --> 2:22:01.760\n boundaries of the problem you know um and and that for me that's why those and that's why math is so\n\n2:22:01.760 --> 2:22:06.480\n appealing and those like problems are also so appealing to the general public it's not that\n\n2:22:06.480 --> 2:22:12.320\n they look simple or that people think that they are easy to like solve but i feel that a lot of\n\n2:22:12.320 --> 2:22:18.240\n the times they are almost intellectually democratic because everyone understands the starting point\n\n2:22:18.240 --> 2:22:23.360\n you know you look at Fermat's last theorem everyone understands like is this is the the\n\n2:22:23.360 --> 2:22:27.440\n universe of the problem and the same maybe with that paper everyone understands okay these are\n\n2:22:27.440 --> 2:22:34.320\n the starting conditions and um and and yeah that the fact that it becomes intellectually democratic\n\n2:22:34.320 --> 2:22:39.760\n and i think that's a huge motivation for people and that's why so so many people gravitate towards\n\n2:22:39.760 --> 2:22:44.080\n these like Riemann hypotheses or Fermat's last theorem or that simple paper which is like just\n\n2:22:44.080 --> 2:22:48.960\n one page it was very simple and i just talked to somebody i don't know if you know who he is\n\n2:22:48.960 --> 2:22:58.160\n Jocko Willink who was uh this person who among many things loves military tactics so he would\n\n2:22:58.160 --> 2:23:04.080\n probably either publish a follow on paper maybe you guys should collaborate but he would see the\n\n2:23:04.080 --> 2:23:09.200\n fundamental the basic assumptions that you started that paper with is flawed because you know there's\n\n2:23:09.200 --> 2:23:15.280\n like dragons too right there's like like you have to integrate tactics because not it's not it's not\n\n2:23:15.280 --> 2:23:20.400\n a homogeneous system it's not i don't take into account the dragons and like and he would say\n\n2:23:20.400 --> 2:23:25.120\n tactics fundamentally change the dynamics of the system and so like that's what happened\n\n2:23:27.600 --> 2:23:32.320\n so uh yeah so at least from a scientific perspective he was right but he never published\n\n2:23:32.320 --> 2:23:36.480\n so there you go uh let me ask the most important question you guys are from\n\n2:23:36.480 --> 2:23:44.320\n um portugal both yeah portugal uh so who is the greatest soccer player footballer of all time\n\n2:23:45.520 --> 2:23:52.480\n yeah i think we're a little bit biased on this topic but i i mean i don't know i i have i have\n\n2:23:52.480 --> 2:23:58.960\n a huge i have a you know tremendous respect for for what um here we go this is the political\n\n2:23:59.840 --> 2:24:05.280\n you can convince you i i i mean i have tremendous respect for what ronaldo has achieved in his\n\n2:24:05.280 --> 2:24:10.080\n career and and i think soccer is one of those sports where i think you can get to maybe be one\n\n2:24:10.080 --> 2:24:16.800\n of the best players in the world we if you just have like natural talent and even if you don't put\n\n2:24:16.800 --> 2:24:22.400\n a lot of hard work and discipline into soccer you can be one of the best players in the world\n\n2:24:22.400 --> 2:24:27.600\n and i think ronaldo is kind of like of course he's naturally talented but he also ronaldo should say\n\n2:24:27.600 --> 2:24:33.680\n the the football from exactly from portugal um and and not uh not the brazilian in this case\n\n2:24:33.680 --> 2:24:39.600\n and so um and ronaldo put like came from nothing he is known from being probably one of the hardest\n\n2:24:39.600 --> 2:24:44.560\n working athletes in the game and and i see that sometimes a lot of these discussions about the\n\n2:24:44.560 --> 2:24:51.040\n best player a lot of people tend to gravitate towards like um you know this person is naturally\n\n2:24:51.040 --> 2:24:58.240\n talented and the other person has to work hard and so and so as if it was bad if he had to work\n\n2:24:58.240 --> 2:25:04.960\n hard to to be good at something and i think that you know the the i think so many people fall into\n\n2:25:04.960 --> 2:25:10.400\n that trap and the reason why so many people fall into that trap is because if you're saying that\n\n2:25:10.400 --> 2:25:17.040\n someone is good and achieved a lot of success by working hard as opposed to achieving success\n\n2:25:17.040 --> 2:25:22.320\n because he has some sort of god given natural talent that you can't explain why the person was\n\n2:25:22.320 --> 2:25:28.560\n born with that what does it tell you about you it tells you that maybe if you work hard on a lot of\n\n2:25:28.560 --> 2:25:33.200\n fields you could have could accomplish a lot of great things and i think that's hard to digest\n\n2:25:33.200 --> 2:25:38.800\n for a lot of people and and in that way ronaldo's inspiring that i think so you find hard work\n\n2:25:39.520 --> 2:25:45.440\n inspiring but he's he's way too good looking that's that's the yeah i don't like him no i\n\n2:25:45.440 --> 2:25:50.240\n like the part of the hard work and like of him being like one of the hardest working athletes\n\n2:25:50.240 --> 2:25:56.000\n in in soccer so he is to you the greatest of all time is he up there is he would be number\n\n2:25:56.000 --> 2:26:03.920\n okay do you agree with this thing well i definitely disagree i mean i i like him very much he works\n\n2:26:03.920 --> 2:26:15.280\n hard i admire i admire you know um what like he's incredible uh goal scorer right um but i\n\n2:26:15.280 --> 2:26:22.000\n i so first of all leo messi and there was some confusion because i've kept saying maradona is\n\n2:26:22.000 --> 2:26:30.560\n my favorite player but i i think i think leo has surpassed them so uh um it's messy then maradona\n\n2:26:30.560 --> 2:26:39.280\n then pelé for me but the the reason is is um there's certain aesthetic definitions of beauty\n\n2:26:39.280 --> 2:26:45.840\n that i admire whether it came by hard work or through god given talent or through anything and\n\n2:26:45.840 --> 2:26:51.680\n it doesn't it doesn't really matter to me there's certain aesthetic like genius when i when i see it\n\n2:26:51.680 --> 2:26:57.520\n to me and uh especially it doesn't have to be consistent it is in the case of messi in case\n\n2:26:57.520 --> 2:27:04.880\n in the ronaldo but just even moments of genius which is where maradona really shines it i even\n\n2:27:04.880 --> 2:27:09.840\n if that doesn't translate into like results and goals being scored right right and that's the\n\n2:27:09.840 --> 2:27:17.520\n challenge like they did that uh because that's where people that tell me that leo messi's never\n\n2:27:18.480 --> 2:27:24.320\n even on strong teams have led his the national team people as far as the world cup right as\n\n2:27:24.320 --> 2:27:30.720\n really important and to me no it's the moment like winning to me was never important what's\n\n2:27:30.720 --> 2:27:37.920\n more important is the moments of genius and but you're you're talking to the human story and\n\n2:27:40.000 --> 2:27:44.080\n yeah christiano ronaldo definitely has a beautiful human story yeah and i think you can't\n\n2:27:44.080 --> 2:27:49.920\n i for me it's hard to decouple those two um i don't i don't just look at you know the the\n\n2:27:49.920 --> 2:27:54.960\n list of achievements but i like how he got there and how he keeps pushing the boundaries at like\n\n2:27:54.960 --> 2:28:00.960\n almost 40 yeah and how that sets up an example like maybe 10 years ago i wouldn't have ever imagined\n\n2:28:00.960 --> 2:28:06.240\n that like one of the top players in the world could be a top player at like 37 or but so and\n\n2:28:06.240 --> 2:28:11.760\n there's an interesting tent the human story is really important but like if you look at ronaldo\n\n2:28:11.760 --> 2:28:18.480\n he's like he's somebody like kids could aspire to be but at the same time i also like maradona who\n\n2:28:18.480 --> 2:28:25.600\n like is a is a tragic figure in many ways is like the you know the drugs the the temper\n\n2:28:26.240 --> 2:28:31.920\n all of those things that's beautiful too like i don't necessarily think to me first the flaws\n\n2:28:31.920 --> 2:28:39.680\n are beautiful too in in athletes i don't think you need to be perfect i agree uh from a personality\n\n2:28:39.680 --> 2:28:47.360\n perspective those flaws are also beautiful so but yeah there is something about hard work and\n\n2:28:47.360 --> 2:28:52.160\n uh there's also something about the being an underdog and being able to carry a team\n\n2:28:53.760 --> 2:28:57.600\n uh that's that's an argument for maradona i don't know if you can make that argument for\n\n2:28:57.600 --> 2:29:03.040\n messi and ronaldo either because they've all played on superstar teams for most of their lives\n\n2:29:04.000 --> 2:29:12.480\n um so i don't know how it you know it's it's difficult to know how they would do um when they\n\n2:29:12.480 --> 2:29:19.200\n had to work like did what maradona had to do to carry a team on his shoulders true and pelle did\n\n2:29:19.200 --> 2:29:24.080\n as well and depending on the the context yeah maybe you could argue that with the portuguese\n\n2:29:24.080 --> 2:29:30.080\n national team but then we have a good team uh yeah but maybe what maradona did with you know\n\n2:29:30.080 --> 2:29:35.200\n lap naples and and a couple other teams it's it's incredible it speaks to the beauty of the game that\n\n2:29:35.200 --> 2:29:39.600\n you know we're talking about all these different players that have or especially you know if you're\n\n2:29:39.600 --> 2:29:45.040\n if you're comparing messi and ronaldo that have such different you know styles of play and also\n\n2:29:45.040 --> 2:29:52.960\n even their bodies are so different and and and but these two very different players can be at the top\n\n2:29:52.960 --> 2:29:58.800\n of the game and that's not that's the there are not a lot of other sports where you where you have\n\n2:29:58.800 --> 2:30:04.880\n that you know like you have kind of a mental image of a basketball player and like the the top\n\n2:30:04.880 --> 2:30:11.280\n basketball players kind of fit that mental image and they look a certain way and um but for soccer\n\n2:30:11.280 --> 2:30:17.520\n there's some there's the it's it's not so much like that and and that's i think that's that's\n\n2:30:17.520 --> 2:30:23.520\n beautiful uh but that really adds something to the sport well do you play soccer yourself\n\n2:30:23.520 --> 2:30:27.840\n have you played that in your your life what do you find beautiful about the game yeah i mean it's one\n\n2:30:27.840 --> 2:30:33.360\n of the i'd say it's the biggest sport in portugal and so growing up we played a lot did you see the\n\n2:30:33.360 --> 2:30:39.920\n paper from deep mind i didn't look at it where they're like uh doing some uh analysis on soccer\n\n2:30:39.920 --> 2:30:46.560\n strategy interesting i i saved that paper uh i haven't read it yet um it's actually i i when i\n\n2:30:46.560 --> 2:30:54.400\n was in college i actually did some research on on applying um machine learning and statistics in\n\n2:30:54.400 --> 2:31:02.640\n sports and in our case in our case we're doing it for basketball um but uh what they're effectively\n\n2:31:02.640 --> 2:31:08.480\n trying to do was have you ever watched moneyball like so they're trying to do something similar\n\n2:31:08.480 --> 2:31:14.480\n right taking that in this case basketball taking a statistical approach to to to basketball um\n\n2:31:15.280 --> 2:31:20.320\n the interesting thing there is that baseball is much more about having these discrete events that\n\n2:31:20.320 --> 2:31:25.520\n happen kind of in similar conditions and so it's easier to take a statistical approach to it whereas\n\n2:31:25.520 --> 2:31:33.200\n basketball it's a much more dynamic game uh it's harder to measure um it's hard to to replicate\n\n2:31:33.200 --> 2:31:39.040\n these conditions and so you you have to think about it in a slightly different way and so we\n\n2:31:39.040 --> 2:31:44.800\n were doing work on that and working like with the celtics to analyze the the data that they had like\n\n2:31:44.800 --> 2:31:49.200\n they had these cameras in the in the arena they were tracking the players and so you so they had\n\n2:31:49.200 --> 2:31:54.000\n a ton of data but they didn't really know what to do with it and so we we were doing work on that\n\n2:31:54.000 --> 2:31:59.360\n and and and soccer is maybe even a step further it's it's right it's a game where you don't have\n\n2:31:59.360 --> 2:32:05.440\n as many in basketball you have a lot of field goals and so you can measure success uh soccer\n\n2:32:05.440 --> 2:32:11.360\n it's it's right it's more of a process almost where it's like you have a goal like or two in\n\n2:32:11.360 --> 2:32:15.520\n in a game in terms of metrics i wonder if there's a way and i've actually have thought about this\n\n2:32:15.520 --> 2:32:20.480\n in the past never coming up with any good solution if there's a way to definitively say whether it's\n\n2:32:20.480 --> 2:32:24.960\n messy or not they're the greatest of all time like like honestly sort of measure interesting\n\n2:32:25.600 --> 2:32:30.400\n like convert the game of soccer into metrics like you said baseball but like those moments\n\n2:32:30.400 --> 2:32:36.960\n of genius like past like um you know if it's just about goals or passes that led to goals\n\n2:32:36.960 --> 2:32:41.440\n yeah that feels like it doesn't capture the genius of the play yeah they'll be like you know like\n\n2:32:43.360 --> 2:32:48.080\n like you kind of do you have more metrics for instance in chess right and you can try to\n\n2:32:48.080 --> 2:32:54.240\n understand how hard of a move that was you know there's like bobby fisher has this move that like\n\n2:32:54.800 --> 2:33:00.800\n that it's i think it's called the move of the century where uh you have to go so deep into the\n\n2:33:00.800 --> 2:33:05.760\n tree to understand that that was the right move and you can quantify how hard it was uh so it'd\n\n2:33:05.760 --> 2:33:09.520\n be interesting to try to think of those type of metrics but say yeah for soccer and computer\n\n2:33:09.520 --> 2:33:14.160\n vision unlocks some of that for us that's that's one possibility i have a cool idea a computer\n\n2:33:14.160 --> 2:33:20.400\n vision product legs that you could build for soccer let's go i'm taking notes if you could\n\n2:33:20.400 --> 2:33:27.360\n detect the ball and like imagine that um it seems like totally doable right now but like if you could\n\n2:33:27.360 --> 2:33:33.680\n detect when the ball enters one of the goals and like just had like um you know a crowd cheering\n\n2:33:33.680 --> 2:33:37.280\n for you when you're playing soccer with your friends every time you score a goal or you had\n\n2:33:37.280 --> 2:33:42.560\n like the the champions league song going on yeah and like having that like you go play soccer with\n\n2:33:42.560 --> 2:33:46.960\n your friends just turn that on and there's like a computer vision like program analyzing the ball\n\n2:33:46.960 --> 2:33:50.880\n detects the ball every time there's a goal like if you miss like there's a you know the fans are\n\n2:33:50.880 --> 2:33:55.520\n reacting to that and then it should be pretty simple by now it's like i think there's an\n\n2:33:55.520 --> 2:34:01.680\n opportunity yeah just throwing that i'm gonna go all out but by the way i did uh i've never\n\n2:34:01.680 --> 2:34:05.840\n released i was thinking of just putting on github but i did write exactly that which is the trackers\n\n2:34:05.840 --> 2:34:10.640\n for the players uh for the for the bodies of the player is this is the hard part actually\n\n2:34:10.640 --> 2:34:18.640\n uh the detection of player bodies and the ball is not hard what's hard is very like robust tracking\n\n2:34:18.640 --> 2:34:25.280\n through time of each of those so like so i wrote a track of this pretty damn good this is this is\n\n2:34:25.280 --> 2:34:29.200\n that is that open source you open so i know i've never released it because interesting because i\n\n2:34:29.200 --> 2:34:36.480\n felt like i need to i would this is the perfection thing because i knew it was going to be like\n\n2:34:36.480 --> 2:34:42.160\n it's gonna pull me in and and it wasn't really that done and so i've never actually been part\n\n2:34:42.160 --> 2:34:47.600\n of a github project where it's like really active development and i didn't want to make it i knew\n\n2:34:47.600 --> 2:34:52.640\n there's a nonzero probability that it will become my life for like a half a year that uh could just\n\n2:34:52.640 --> 2:34:58.000\n how much i love soccer and all those kinds of things and and ultimately it will be all for just\n\n2:34:58.000 --> 2:35:03.920\n the the joy of analyzing the game which i'm all for i remember you also like one of in one of the\n\n2:35:03.920 --> 2:35:08.240\n episodes you mentioned that you did also a lot of high tracking analysis on like joe rogan's that\n\n2:35:08.240 --> 2:35:12.800\n was the that was the research side of my life interesting yeah and you have that library right\n\n2:35:12.800 --> 2:35:18.160\n you you kind of downloaded all the episodes yep allegedly i and of course i didn't if you're a\n\n2:35:18.160 --> 2:35:21.920\n lawyer i'm listening to this no it is yeah i i was listening to the episode where you mentioned\n\n2:35:21.920 --> 2:35:27.120\n that and i was actually there was something that i and i might ask you for for access to that to\n\n2:35:27.120 --> 2:35:33.760\n like allegedly that library uh but i was doing some not not regarding like eye tracking but i was\n\n2:35:33.760 --> 2:35:40.400\n playing around with um analyzing the distribution of silences on uh one of the joe rogan episodes\n\n2:35:40.400 --> 2:35:46.640\n so like i did that for the elon uh conversation where it's like you just take all the silences\n\n2:35:47.200 --> 2:35:52.240\n like after joe asked the question and elon responded and you plot that distribution and\n\n2:35:52.240 --> 2:35:57.760\n like and see how how how that looks like yeah i think there's a huge opportunity especially\n\n2:35:57.760 --> 2:36:04.720\n long form podcasts to do that kind of analysis bigger than joe exactly but it has to be a fairly\n\n2:36:04.720 --> 2:36:10.240\n unedited podcast so that you don't get the silence so one of the benefits i have like doing this\n\n2:36:10.240 --> 2:36:17.040\n podcast is like the what we're recording today is there's individual audio being recorded makes it\n\n2:36:17.040 --> 2:36:22.000\n so like i have the raw information it's when it's published it's all combined together and individual\n\n2:36:22.000 --> 2:36:26.800\n video feeds so even when you're listening which i usually don't i only show one video stream\n\n2:36:27.600 --> 2:36:35.040\n i i'll know i can track your blinks and so on um but yeah but ultimately the hope is you don't\n\n2:36:35.040 --> 2:36:39.200\n need that raw data because if you don't need the raw data for whatever analysis you're doing\n\n2:36:39.520 --> 2:36:44.080\n you can then do a huge number of parts because there's so it's quickly growing now the number\n\n2:36:44.080 --> 2:36:50.000\n especially comedians there's uh quite a few comedians with with long form podcasts and\n\n2:36:51.200 --> 2:36:54.960\n they have a lot of facial expressions they have a lot of fun and all those kinds of things and\n\n2:36:54.960 --> 2:37:01.200\n it's it's prone for analysis and it's there's so many interesting things that that that idea\n\n2:37:01.200 --> 2:37:08.000\n actually sparked because i was watching a um a q a by by steve jobs and i think it was at mit and\n\n2:37:08.000 --> 2:37:13.520\n then like people's like he did a talk there and then the q a started and people starting asking\n\n2:37:13.520 --> 2:37:18.400\n questions that i was i was working while listening to it and like someone asked the question and he\n\n2:37:18.400 --> 2:37:24.080\n goes like on a 20 second silence before answering the question i like i had to check if the if the\n\n2:37:24.080 --> 2:37:30.560\n video hadn't paused or or something and and i was thinking about like like if that is a feature of\n\n2:37:30.560 --> 2:37:36.400\n a person like how long on average you take to respond to a question and if it's like oh that's\n\n2:37:36.400 --> 2:37:41.680\n that has to do with the like how thoughtful you are and if that changes over time oh but it also\n\n2:37:41.680 --> 2:37:46.640\n could be this really fascinating metric because it also could be it's certainly a feature of a\n\n2:37:46.640 --> 2:37:52.000\n person but it's also a function of the question like if you normalize to the person you can\n\n2:37:52.000 --> 2:37:56.880\n probably infer a bunch of stuff about the question so it's a nice flag like it's a really strong\n\n2:37:56.880 --> 2:38:03.120\n signal the length of that silence but relative to the usual silence they have so one the silence is\n\n2:38:03.120 --> 2:38:08.640\n a measure of how thoughtful they are and two the particular silence is a measure how thoughtful\n\n2:38:08.640 --> 2:38:13.040\n the question was thoughtful the question was it's really interesting i mean yeah yeah i just\n\n2:38:13.040 --> 2:38:19.760\n analyzed elon's uh episode but i think there's like room for exploration there i feel like the\n\n2:38:19.760 --> 2:38:24.160\n average they could do for comedians would be like i mean the time would be so small because you're\n\n2:38:24.160 --> 2:38:28.240\n trained to like i would i would think you're reacting to hecklers you're reacting to all\n\n2:38:28.240 --> 2:38:33.680\n sorts of things you have to be like so quick maybe right yeah but some of the greatest comedians are\n\n2:38:33.680 --> 2:38:40.240\n very good at sitting in the silence i mean there there's louis ck they play with that because you\n\n2:38:40.240 --> 2:38:49.520\n have a rhythm and like um dave chappelle a comedian who did a joe show recently he has uh\n\n2:38:50.160 --> 2:38:55.840\n especially when he's just having a conversation he does long pauses it's kind of cool because it\n\n2:38:55.840 --> 2:39:03.120\n uh it it's one of the ways to have people hang in your word is to play with the pauses to play\n\n2:39:03.120 --> 2:39:09.120\n with the silences and the emphasis and like mid sentence there's a bunch of different things that\n\n2:39:09.120 --> 2:39:15.120\n uh it'd be interesting to really really analyze but still soccer to me is uh that that one's\n\n2:39:15.120 --> 2:39:20.880\n fascinating just i just want a conclusive definitive statement about because like there's so\n\n2:39:20.880 --> 2:39:28.960\n many soccer highlights of both messi and ronaldo i just feel like the raw data is there\n\n2:39:29.840 --> 2:39:38.000\n um because you don't have that with pelé and mardona just yeah true but here's a huge amount\n\n2:39:38.000 --> 2:39:43.040\n of high dev data then the the annoying the difficult thing and this is really hard for\n\n2:39:43.040 --> 2:39:48.480\n tracking and this is actually where i kind of gave up because i didn't really give much effort\n\n2:39:48.480 --> 2:39:56.640\n but i gave up to the the way that highlights or usually football match filmed is they switch\n\n2:39:56.640 --> 2:40:02.320\n to camera so they'll they'll do a different switch perspective so you have to it's a really\n\n2:40:02.320 --> 2:40:06.000\n interesting computer vision problem when the perspective is switched you still have a lot of\n\n2:40:06.000 --> 2:40:10.720\n overlap about the players but the perspective is sufficiently different that you have to like\n\n2:40:10.720 --> 2:40:21.360\n recompute everything so i there there's two ways to solve this so one is doing it the full way where\n\n2:40:21.360 --> 2:40:25.840\n you're constantly doing the slam problem you you're doing a 3d reconstruction the whole time\n\n2:40:25.840 --> 2:40:32.320\n and projecting into that 3d world but you could also there could be some hacks that i wonder like\n\n2:40:32.320 --> 2:40:39.440\n some trick where you can hop like when the perspective shifts do a high probability\n\n2:40:39.440 --> 2:40:47.040\n from one object to another but i i thought especially in exciting moments when when when\n\n2:40:47.040 --> 2:40:53.280\n you're passing players like you're doing a single ball dribble across players and you switch\n\n2:40:53.280 --> 2:40:57.040\n perspective which is when they often do when you're making a run on goal if you switch your\n\n2:40:57.040 --> 2:41:02.480\n perspective it's it feels like that's going to be really tricky to get right uh that's\n\n2:41:02.480 --> 2:41:06.640\n automatically but in that case for instance i feel like if somebody released that data set\n\n2:41:06.640 --> 2:41:12.880\n or it's like you just have all like these this data set a massive data set of all these games\n\n2:41:12.880 --> 2:41:19.040\n from from say ronaldo and messy like and just you just add that in like whatever csv format and some\n\n2:41:19.040 --> 2:41:24.400\n some publicly available data set like that i feel like people would just there there would be so\n\n2:41:24.400 --> 2:41:28.720\n many cool things that you could do with it and you just set it free and then like the world would\n\n2:41:28.720 --> 2:41:34.080\n like do its thing and then like interesting things would come out of it by the way i have this data\n\n2:41:34.080 --> 2:41:40.720\n set so the two the two things i've did of this scale uh is soccer so his body pose and ball\n\n2:41:40.720 --> 2:41:48.560\n tracking for soccer and then um i try it's pupil tracking and blink tracking for it was joe rogan\n\n2:41:48.560 --> 2:41:53.600\n and a few other podcasts that i did so those are the two data sets i have did you analyze any of\n\n2:41:53.600 --> 2:42:03.120\n your podcasts no i i think i really started doing this podcast after after doing that work and it's\n\n2:42:03.120 --> 2:42:12.800\n difficult to maybe i'd be afraid of what i find i'm already annoyed with my own voice and video\n\n2:42:12.800 --> 2:42:18.640\n like editing it uh but perhaps that's the honest thing to do because uh one useful thing i about\n\n2:42:18.640 --> 2:42:24.320\n doing computer vision about myself is like i know what i was thinking at the time so you can start\n\n2:42:24.320 --> 2:42:32.000\n to like connect the particular the behavioral peculiarities of like the way you blink the way\n\n2:42:32.000 --> 2:42:39.760\n you squint the way you close your eyes like talking about details there's it's like for example i just\n\n2:42:39.760 --> 2:42:46.560\n closed my eyes is that a blink or no like figuring that out in terms of timing in terms of the link\n\n2:42:46.560 --> 2:42:53.920\n dynamics it's tricky it's very doable i i think there's universal laws about what is a blink and\n\n2:42:53.920 --> 2:43:00.560\n what is a closed eye and all those things plus makeup and eyelashes i actually um have annoyingly\n\n2:43:00.560 --> 2:43:06.080\n long eyelashes so i remember when i was doing a lot of this work i i would cut off my eyelashes\n\n2:43:06.080 --> 2:43:11.280\n which when like especially it was funny like female colleagues were like what the fuck are\n\n2:43:11.280 --> 2:43:16.160\n you doing like those no keep the eyelashes but because it got in the way made the computer\n\n2:43:16.160 --> 2:43:23.680\n vision a lot more difficult but super interesting topics yeah but speaking about the one uh still\n\n2:43:23.680 --> 2:43:28.960\n on the topic of the data sets for sports there's one um one paper that and i actually annotated\n\n2:43:28.960 --> 2:43:37.280\n on format and and uh it's it was published in 90s 90s i believe 90s or 80s i forget but it would\n\n2:43:37.280 --> 2:43:45.520\n they you the researcher was effectively looking at the hot end phenomena in basketball right so\n\n2:43:45.520 --> 2:43:52.400\n whether like the fact that you just made a field goal um if you know if on your next attempt if\n\n2:43:52.400 --> 2:43:59.120\n you're more likely to make it or not um and it was super interesting because they i mean he polled\n\n2:43:59.120 --> 2:44:04.480\n like i think 100 undergrads and i think from stanford and cornell and asking people like do\n\n2:44:04.480 --> 2:44:09.680\n you you think that's that you have a higher likelihood of making your free throw if you just\n\n2:44:09.680 --> 2:44:16.880\n just made one and i think it's like 68 68 percent said yes they believe that and then he looked\n\n2:44:16.880 --> 2:44:22.640\n at the data and this was back in as i said like a few decades ago and so i think he had the data\n\n2:44:22.640 --> 2:44:28.800\n set of about uh he looked at it specifically for free throws and he had a data set of about 5,000\n\n2:44:28.800 --> 2:44:36.640\n free throws and um and effectively what he found was that specifically in the case of free throws\n\n2:44:37.280 --> 2:44:44.160\n he didn't for the aggregate data he didn't find um that he couldn't really spot that correlation\n\n2:44:44.160 --> 2:44:50.320\n that hot end correlation so if you made the first one you weren't more likely to to make the second\n\n2:44:50.320 --> 2:44:55.040\n one what he did find was that they were just better at the second one because you just got\n\n2:44:55.040 --> 2:45:00.080\n like maybe a tiny practice and you just attempted once and then and then you're going to be better\n\n2:45:00.080 --> 2:45:06.400\n at the next one and then i i then i went and there's a data set on kaggle that has like 600,000\n\n2:45:06.400 --> 2:45:13.120\n free throws and i reran the the same computations and and and confirmed like you can see a very\n\n2:45:13.120 --> 2:45:18.880\n clear pattern that they're just better at their second free throw um that's interesting because\n\n2:45:18.880 --> 2:45:23.840\n i think there's similarly that kind of analysis is so awesome because i think with tennis they\n\n2:45:23.840 --> 2:45:29.120\n have like uh like a fault like when you serve they have analysis of like are you most likely\n\n2:45:29.120 --> 2:45:34.640\n to miss the second serve if you missed the first obviously um yeah i think that's the case so that\n\n2:45:34.640 --> 2:45:40.960\n integrates that's so cool when psychology is converted into metrics in that way and in sports\n\n2:45:40.960 --> 2:45:46.640\n sports it's especially cool because it's such a constrained system that you can really study\n\n2:45:46.640 --> 2:45:51.760\n human psychology because it's repeated it's constrained so many things are controlled which\n\n2:45:51.760 --> 2:45:59.040\n is something you rarely have in in the wild psychological experiments so it's cool uh plus\n\n2:45:59.040 --> 2:46:04.000\n everyone loves it like sports is really cool to analyze people actually care about the results\n\n2:46:04.000 --> 2:46:11.520\n yeah um i still think well like i uh i and i will definitely publish uh this work on messy\n\n2:46:11.520 --> 2:46:15.840\n versus ronaldo and i'd love to read it objective fully objective to peer review\n\n2:46:18.400 --> 2:46:21.840\n um yeah this is very true this is not past period\n\n2:46:22.800 --> 2:46:30.400\n um let me ask sort of um an advice question to uh to young folks you've explored a lot of\n\n2:46:30.400 --> 2:46:36.640\n fascinating ideas in your life you built a startup worked on physics worked on computer science\n\n2:46:37.360 --> 2:46:43.440\n what advice would you give to young people today in high school maybe early college about life\n\n2:46:43.440 --> 2:46:52.320\n about career about science and mathematics i remember like uh i read like i remember reading\n\n2:46:52.320 --> 2:47:00.560\n that um punk area was once asked by a um a french journal about his advice for young people and what\n\n2:47:00.560 --> 2:47:05.600\n was his teaching philosophy and he said that like one of the most important things that parents\n\n2:47:05.600 --> 2:47:11.920\n should teach their kids is how to be enthusiastic um in regards to like the mysteries of the world\n\n2:47:12.560 --> 2:47:17.040\n and that he said like striking that balance was actually one of the most important things between\n\n2:47:17.040 --> 2:47:21.680\n like in education you know you want to have your kids be enthusiastic about the mysteries of the\n\n2:47:21.680 --> 2:47:25.520\n world but you also don't want to traumatize them like if you really force them into something\n\n2:47:25.520 --> 2:47:33.520\n and i think like especially if you're young i think you should be curious and i think you should\n\n2:47:35.360 --> 2:47:41.360\n explore that curiosity to the fullest to the point where you even become almost as an expert\n\n2:47:41.360 --> 2:47:47.120\n on that topic and now and you might start with something that it's small like you might start\n\n2:47:47.120 --> 2:47:51.920\n with you know you're interested in numbers and how to factor numbers into primes and then all of a\n\n2:47:51.920 --> 2:47:57.760\n sudden you go and and you're like lost in number theory and you discover cryptography and then all\n\n2:47:57.760 --> 2:48:03.680\n of a sudden you're buying bitcoin and i and i think you should do this um you should really try\n\n2:48:03.680 --> 2:48:08.720\n to fulfill this curiosity and you should live in a society that allows you to fulfill this curiosity\n\n2:48:08.720 --> 2:48:14.400\n which is also important and i think you should do this not to get to some sort of status or fame or\n\n2:48:14.400 --> 2:48:20.160\n money but i think this is the way this iterative process i think this is the way to find happiness\n\n2:48:20.800 --> 2:48:26.960\n and and i think this is also allows you to find the meaning for your life i think it's all about\n\n2:48:26.960 --> 2:48:33.360\n like being curious and being able to fulfill that curiosity and that path to fulfilling that your\n\n2:48:33.360 --> 2:48:39.120\n curiosity yeah the the start small let the fire build this kind of interesting way to think about\n\n2:48:39.120 --> 2:48:44.960\n it and you never know where you're going to end up it's it's like for us is just a really good\n\n2:48:44.960 --> 2:48:50.720\n example we started like by doing this as an internal like thing that we did in the company\n\n2:48:50.720 --> 2:48:55.600\n and then we started putting out there and now a lot of people follow it and know about it and so\n\n2:48:56.160 --> 2:49:01.760\n and you still don't know where from our library is going to end up actually true exactly so um\n\n2:49:01.760 --> 2:49:07.760\n yeah i think that would be my piece of advice with very limited experience of course but yeah yeah i\n\n2:49:07.760 --> 2:49:14.640\n agree i agree uh i mean is there something in from particular joao from the computer science\n\n2:49:14.640 --> 2:49:20.560\n versus physics perspective uh do do you regret not doing physics do you regret not doing computer\n\n2:49:20.560 --> 2:49:26.240\n science which one is the the wiser the better human being this is messy versus ronaldo um\n\n2:49:27.120 --> 2:49:33.600\n those are very i i don't know if you would agree but they're kind of different disciplines true\n\n2:49:33.600 --> 2:49:42.080\n yeah very much so um i actually i actually uh i was i had that question in my mind i i took\n\n2:49:42.080 --> 2:49:50.080\n physics classes as an undergrad or like besides what i had to take and um it's definitely something\n\n2:49:50.080 --> 2:50:01.200\n that i considered at some point um and and that i i i do feel like later in life that might be\n\n2:50:01.200 --> 2:50:07.200\n something that i'm not sure if regret is is the right word but it's it's kind of something that\n\n2:50:07.200 --> 2:50:12.880\n i can imagine in an alternative universe what would have happened if i if i got into physics\n\n2:50:13.440 --> 2:50:21.760\n um i try to think that like well depends on what your path ends up being but that it's it's not\n\n2:50:22.560 --> 2:50:29.120\n super important right like exactly what you decide to major on like i think there's there's um\n\n2:50:29.120 --> 2:50:34.640\n um i think tim urban like the blogger had a good visualization of this where it's like\n\n2:50:34.640 --> 2:50:39.520\n you know like he he he has a picture where you have all sorts of paths that you could pursue in\n\n2:50:39.520 --> 2:50:43.680\n your life and then maybe you're in the middle of it and so there's maybe some paths that are not\n\n2:50:43.680 --> 2:50:48.560\n accessible to you but like the the tree that is still in front of you gives you a lot of optionality\n\n2:50:48.560 --> 2:50:53.440\n and so um there's two lessons to learn from that like we have a huge number of options now\n\n2:50:53.440 --> 2:51:02.320\n and probably you're just one to reflect like to try to uh derive wisdom from the one little path\n\n2:51:02.320 --> 2:51:07.360\n you've taken so far may be flawed because there's all these other paths you could have taken yeah so\n\n2:51:07.360 --> 2:51:13.520\n it's like uh so one it's inspiring that you can take any path now and two it's like you you the\n\n2:51:13.520 --> 2:51:20.240\n path you've taken so far is just one of many possible ones but it does seem that like physics\n\n2:51:20.240 --> 2:51:26.000\n and computer science both open a lot of doors and a lot of different doors it's very interesting it\n\n2:51:26.000 --> 2:51:31.600\n is i i like in this case like and especially in in our case because i could see the difference i\n\n2:51:31.600 --> 2:51:37.440\n studied i i went to college in europe and joel went to college here in the u.s so i could see\n\n2:51:37.440 --> 2:51:43.200\n the difference and like in the european system is um more rigid in the sense that when you decide\n\n2:51:43.200 --> 2:51:47.600\n to study physics you don't have a lot especially in the early years you don't have a lot of um\n\n2:51:47.600 --> 2:51:52.000\n you can't choose to take like a class from like computer science course or something like that\n\n2:51:52.000 --> 2:51:56.000\n don't have a lot of freedom to explore in that sense in university as opposed to here in the\n\n2:51:56.000 --> 2:52:02.000\n u.s where you have more freedom and i think um i think that's important i think that's what\n\n2:52:02.000 --> 2:52:07.760\n constitutes you know a good kind of educational system is one that gravitates towards the interests\n\n2:52:07.760 --> 2:52:13.200\n of a student as as you progress but i think in order for you to do that you need to explore\n\n2:52:13.200 --> 2:52:18.320\n different areas and i i felt like if i had a chance to take say more computer science class\n\n2:52:18.320 --> 2:52:23.440\n when i was in college i would have probably have taken those classes but um yeah but i ended up\n\n2:52:23.440 --> 2:52:28.880\n like focusing maybe too like too much in physics and uh i think here at least my perception is\n\n2:52:28.880 --> 2:52:36.560\n that you can explore more more fields but there is a kind of it's funny but physics can be difficult\n\n2:52:36.560 --> 2:52:42.000\n so i don't see too many computer science people than exploring into physics it's only like the one\n\n2:52:42.000 --> 2:52:51.200\n the not the one but one of the beneficial things of physics it feels like it uh what was it rutherford\n\n2:52:51.200 --> 2:52:58.000\n that said like like basically that physics is the hard thing and everything is easy uh so like\n\n2:52:58.000 --> 2:53:02.880\n there's a certain sense once you've figured out some basic like physics that it's not that you\n\n2:53:02.880 --> 2:53:08.400\n need the tools of physics to understand the other disciplines it's that you're empowered by having\n\n2:53:08.400 --> 2:53:15.120\n done difficult shit i mean the ultimate i think is probably mathematics there yeah true uh so maybe\n\n2:53:15.120 --> 2:53:20.000\n just doing difficult things and proving to yourself that you can do difficult things whatever those\n\n2:53:20.000 --> 2:53:25.600\n are that's net positive i believe net positive yeah and i think like i i before i started company\n\n2:53:25.600 --> 2:53:32.320\n i had like i i worked in the financial sector for a bit and like i think having a physics background\n\n2:53:32.320 --> 2:53:37.520\n i was i felt i was not afraid of like learning like finance things and i think like when you\n\n2:53:37.520 --> 2:53:42.720\n come from those backgrounds you are generally not afraid of stepping into other fields and learning\n\n2:53:42.720 --> 2:53:49.360\n about those because um yeah i feel we've learned a lot of difficult things and um yeah that's an\n\n2:53:49.360 --> 2:53:58.000\n added benefit i believe this was uh an incredible conversation louise joao we started with uh who\n\n2:53:58.000 --> 2:54:02.960\n do we start with fineman ended up with messi and ronaldo so this is like the perfect conversation\n\n2:54:02.960 --> 2:54:07.200\n it's really an honor that you guys would waste all this time with me today it was really fun\n\n2:54:07.200 --> 2:54:11.920\n thanks for talking so much for having us yeah thank you so much thanks for listening to this\n\n2:54:11.920 --> 2:54:17.920\n conversation with louise and joao batala and thank you to skiff simply safe and thank you\n\n2:54:17.920 --> 2:54:24.400\n for watching this podcast simply safe indeed net sweet and for sigmatic check them out in the\n\n2:54:24.400 --> 2:54:30.160\n description to support this podcast and now let me leave you with some words from richard fineman\n\n2:54:30.160 --> 2:54:37.200\n nobody ever figures out what life is all about and it doesn't matter explore the world nearly\n\n2:54:37.200 --> 2:54:43.040\n everything is really interesting if you go into it deeply enough thank you for listening i hope\n\n2:54:43.040 --> 2:54:48.480\n to see you next time\n\n"
}