{
  "title": "Cristos Goodrow: YouTube Algorithm | Lex Fridman Podcast #68",
  "id": "nkWmiNRPU-c",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:02.720\n The following is a conversation with Christos Goudreau,\n\n00:03.360 --> 00:08.320\n Vice President of Engineering at Google and Head of Search and Discovery at YouTube,\n\n00:08.320 --> 00:10.560\n also known as the YouTube Algorithm.\n\n00:11.360 --> 00:15.120\n YouTube has approximately 1.9 billion users,\n\n00:15.120 --> 00:19.680\n and every day people watch over 1 billion hours of YouTube video.\n\n00:20.320 --> 00:23.360\n It is the second most popular search engine behind Google itself.\n\n00:24.080 --> 00:27.200\n For many people, it is not only a source of entertainment,\n\n00:27.200 --> 00:33.680\n but also how we learn new ideas from math and physics videos to podcasts to debates, opinions,\n\n00:33.680 --> 00:38.640\n ideas from out of the box thinkers and activists on some of the most tense,\n\n00:38.640 --> 00:41.520\n challenging, and impactful topics in the world today.\n\n00:42.400 --> 00:48.080\n YouTube and other content platforms receive criticism from both viewers and creators,\n\n00:48.080 --> 00:53.600\n as they should, because the engineering task before them is hard, and they don't always\n\n00:53.600 --> 00:57.520\n succeed, and the impact of their work is truly world changing.\n\n00:58.560 --> 01:02.400\n To me, YouTube has been an incredible wellspring of knowledge.\n\n01:02.400 --> 01:06.800\n I've watched hundreds, if not thousands, of lectures that changed the way I see\n\n01:06.800 --> 01:11.280\n many fundamental ideas in math, science, engineering, and philosophy.\n\n01:12.480 --> 01:17.600\n But it does put a mirror to ourselves, and keeps the responsibility of the steps we take\n\n01:17.600 --> 01:21.760\n in each of our online educational journeys into the hands of each of us.\n\n01:21.760 --> 01:26.480\n The YouTube algorithm has an important role in that journey of helping us find new,\n\n01:26.480 --> 01:28.080\n exciting ideas to learn about.\n\n01:28.560 --> 01:32.800\n That's a difficult and an exciting problem for an artificial intelligence system.\n\n01:33.360 --> 01:37.520\n As I've said in lectures and other forums, recommendation systems will be one of the\n\n01:37.520 --> 01:43.680\n most impactful areas of AI in the 21st century, and YouTube is one of the biggest\n\n01:43.680 --> 01:45.760\n recommendation systems in the world.\n\n01:46.640 --> 01:49.680\n This is the Artificial Intelligence Podcast.\n\n01:49.680 --> 01:54.640\n If you enjoy it, subscribe on YouTube, give it five stars on Apple Podcast, follow on\n\n01:54.640 --> 01:59.920\n Spotify, support it on Patreon, or simply connect with me on Twitter, at Lex Friedman,\n\n01:59.920 --> 02:02.000\n spelled F R I D M A N.\n\n02:02.880 --> 02:05.920\n I recently started doing ads at the end of the introduction.\n\n02:05.920 --> 02:10.400\n I'll do one or two minutes after introducing the episode, and never any ads in the middle\n\n02:10.400 --> 02:12.720\n that can break the flow of the conversation.\n\n02:12.720 --> 02:16.400\n I hope that works for you and doesn't hurt the listening experience.\n\n02:16.400 --> 02:20.720\n This show is presented by Cash App, the number one finance app in the App Store.\n\n02:20.720 --> 02:25.120\n I personally use Cash App to send money to friends, but you can also use it to buy,\n\n02:25.120 --> 02:27.680\n sell, and deposit Bitcoin in just seconds.\n\n02:27.680 --> 02:30.640\n Cash App also has a new investing feature.\n\n02:30.640 --> 02:35.120\n You can buy fractions of a stock, say, $1 worth, no matter what the stock price is.\n\n02:35.760 --> 02:40.640\n Broker services are provided by Cash App Investing, a subsidiary of Square and Member\n\n02:40.640 --> 02:41.200\n SIPC.\n\n02:41.200 --> 02:45.840\n I'm excited to be working with Cash App to support one of my favorite organizations\n\n02:45.840 --> 02:50.560\n called FIRST, best known for their FIRST Robotics and Lego competitions.\n\n02:50.560 --> 02:56.000\n They educate and inspire hundreds of thousands of students in over 110 countries and have\n\n02:56.000 --> 03:00.880\n a perfect rating and charity navigator, which means that donated money is used to maximum\n\n03:00.880 --> 03:01.680\n effectiveness.\n\n03:02.320 --> 03:08.240\n When you get Cash App from the App Store or Google Play and use code LEXPODCAST, you'll\n\n03:08.240 --> 03:14.080\n get $10, and Cash App will also donate $10 to FIRST, which again is an organization that\n\n03:14.080 --> 03:19.040\n I've personally seen inspire girls and boys to dream of engineering a better world.\n\n03:19.920 --> 03:23.440\n And now, here's my conversation with Christos Goudreau.\n\n03:24.640 --> 03:28.640\n YouTube is the world's second most popular search engine, behind Google, of course.\n\n03:29.360 --> 03:34.800\n We watch more than 1 billion hours of YouTube videos a day, more than Netflix and Facebook\n\n03:34.800 --> 03:35.760\n video combined.\n\n03:35.760 --> 03:40.080\n YouTube creators upload over 500,000 hours of video every day.\n\n03:41.040 --> 03:46.160\n Average lifespan of a human being, just for comparison, is about 700,000 hours.\n\n03:47.440 --> 03:53.360\n So, what's uploaded every single day is just enough for a human to watch in a lifetime.\n\n03:53.360 --> 03:55.760\n So, let me ask an absurd philosophical question.\n\n03:56.640 --> 04:00.960\n If from birth, when I was born, and there's many people born today with the internet,\n\n04:00.960 --> 04:06.640\n I watched YouTube videos nonstop, do you think there are trajectories through YouTube video\n\n04:06.640 --> 04:14.240\n space that can maximize my average happiness, or maybe education, or my growth as a human\n\n04:14.240 --> 04:14.740\n being?\n\n04:15.760 --> 04:21.200\n I think there are some great trajectories through YouTube videos, but I wouldn't recommend\n\n04:21.200 --> 04:26.640\n that anyone spend all of their waking hours or all of their hours watching YouTube.\n\n04:26.640 --> 04:31.200\n I mean, I think about the fact that YouTube has been really great for my kids, for instance.\n\n04:32.720 --> 04:37.920\n My oldest daughter, she's been watching YouTube for several years.\n\n04:37.920 --> 04:44.640\n She watches Tyler Oakley and the Vlogbrothers, and I know that it's had a very profound and\n\n04:44.640 --> 04:46.160\n positive impact on her character.\n\n04:46.160 --> 04:52.080\n And my younger daughter, she's a ballerina, and her teachers tell her that YouTube is\n\n04:52.080 --> 04:58.960\n a huge advantage for her because she can practice a routine and watch professional dancers do\n\n04:58.960 --> 05:03.440\n that same routine and stop it and back it up and rewind and all that stuff, right?\n\n05:03.440 --> 05:06.240\n So, it's been really good for them.\n\n05:06.240 --> 05:08.560\n And then even my son is a sophomore in college.\n\n05:08.560 --> 05:15.360\n He got through his linear algebra class because of a channel called Three Blue, One Brown,\n\n05:15.360 --> 05:22.240\n which helps you understand linear algebra, but in a way that would be very hard for anyone\n\n05:22.240 --> 05:24.080\n to do on a whiteboard or a chalkboard.\n\n05:25.200 --> 05:30.640\n And so, I think that those experiences, from my point of view, were very good.\n\n05:30.640 --> 05:34.080\n And so, I can imagine really good trajectories through YouTube, yes.\n\n05:34.080 --> 05:38.880\n Have you looked at, do you think of broadly about that trajectory over a period?\n\n05:38.880 --> 05:41.120\n Because YouTube has grown up now.\n\n05:41.120 --> 05:48.480\n So, over a period of years, you just kind of gave a few anecdotal examples, but I used\n\n05:48.480 --> 05:49.920\n to watch certain shows on YouTube.\n\n05:49.920 --> 05:50.720\n I don't anymore.\n\n05:50.720 --> 05:52.880\n I've moved on to other shows.\n\n05:52.880 --> 05:57.760\n Ultimately, you want people to, from YouTube's perspective, to stay on YouTube, to grow as\n\n05:57.760 --> 05:59.120\n human beings on YouTube.\n\n06:00.160 --> 06:07.040\n So, you have to think not just what makes them engage today or this month, but what\n\n06:07.040 --> 06:12.720\n makes them engage today or this month, but also for a period of years.\n\n06:12.720 --> 06:13.360\n Absolutely.\n\n06:13.360 --> 06:13.920\n That's right.\n\n06:13.920 --> 06:20.320\n I mean, if YouTube is going to continue to enrich people's lives, then it has to grow\n\n06:20.320 --> 06:25.200\n with them, and people's interests change over time.\n\n06:25.200 --> 06:31.920\n And so, I think we've been working on this problem, and I'll just say it broadly as\n\n06:31.920 --> 06:38.720\n like how to introduce diversity and introduce people who are watching one thing to something\n\n06:38.720 --> 06:40.000\n else they might like.\n\n06:40.000 --> 06:43.520\n We've been working on that problem all the eight years I've been at YouTube.\n\n06:45.120 --> 06:51.360\n It's a hard problem because, I mean, of course, it's trivial to introduce diversity\n\n06:51.360 --> 06:52.640\n that doesn't help.\n\n06:52.640 --> 06:54.160\n Yeah, just add a random video.\n\n06:54.160 --> 06:57.840\n I could just randomly select a video from the billions that we have.\n\n06:58.800 --> 07:01.280\n It's likely not to even be in your language.\n\n07:01.280 --> 07:07.520\n So, the likelihood that you would watch it and develop a new interest is very, very low.\n\n07:08.560 --> 07:14.080\n And so, what you want to do when you're trying to increase diversity is find something that\n\n07:14.640 --> 07:21.520\n is not too similar to the things that you've watched, but also something that you might\n\n07:21.520 --> 07:22.560\n be likely to watch.\n\n07:23.440 --> 07:28.720\n And that balance, finding that spot between those two things is quite challenging.\n\n07:28.720 --> 07:36.400\n So, the diversity of content, diversity of ideas, it's a really difficult, it's a thing\n\n07:36.400 --> 07:39.360\n like that's almost impossible to define, right?\n\n07:39.360 --> 07:40.480\n Like, what's different?\n\n07:41.680 --> 07:43.680\n So, how do you think about that?\n\n07:43.680 --> 07:51.440\n So, two examples is I'm a huge fan of Three Blue One Brown, say, and then one diversity.\n\n07:51.440 --> 07:57.200\n I wasn't even aware of a channel called Veritasium, which is a great science, physics, whatever\n\n07:57.200 --> 07:57.600\n channel.\n\n07:57.600 --> 08:03.120\n So, one version of diversity is showing me Derek's Veritasium channel, which I was really\n\n08:03.120 --> 08:04.160\n excited to discover.\n\n08:04.160 --> 08:06.400\n I actually now watch a lot of his videos.\n\n08:06.400 --> 08:12.160\n Okay, so you're a person who's watching some math channels and you might be interested\n\n08:12.160 --> 08:14.560\n in some other science or math channels.\n\n08:14.560 --> 08:20.160\n So, like you mentioned, the first kind of diversity is just show you some things from\n\n08:20.160 --> 08:27.600\n other channels that are related, but not just, you know, not all the Three Blue One Brown\n\n08:27.600 --> 08:29.280\n channel, throw in a couple others.\n\n08:29.280 --> 08:34.080\n So, that's maybe the first kind of diversity that we started with many, many years ago.\n\n08:36.400 --> 08:44.640\n Taking a bigger leap is about, I mean, the mechanisms we use for that is we basically\n\n08:44.640 --> 08:48.400\n cluster videos and channels together, mostly videos.\n\n08:48.400 --> 08:50.640\n We do almost everything at the video level.\n\n08:50.640 --> 08:58.000\n And so, we'll make some kind of a cluster via some embedding process and then measure\n\n08:58.800 --> 09:05.200\n what is the likelihood that users who watch one cluster might also watch another cluster\n\n09:05.200 --> 09:06.560\n that's very distinct.\n\n09:06.560 --> 09:14.640\n So, we may come to find that people who watch science videos also like jazz.\n\n09:15.680 --> 09:16.720\n This is possible, right?\n\n09:16.720 --> 09:25.600\n And so, because of that relationship that we've identified through the embeddings and\n\n09:25.600 --> 09:30.640\n then the measurement of the people who watch both, we might recommend a jazz video once\n\n09:30.640 --> 09:31.440\n in a while.\n\n09:31.440 --> 09:36.480\n So, there's this cluster in the embedding space of jazz videos and science videos.\n\n09:36.480 --> 09:42.960\n And so, you kind of try to look at aggregate statistics where if a lot of people that jump\n\n09:42.960 --> 09:50.880\n from science cluster to the jazz cluster tend to remain as engaged or become more engaged,\n\n09:51.520 --> 09:57.280\n then that means those two, they should hop back and forth and they'll be happy.\n\n09:57.280 --> 09:57.520\n Right.\n\n09:57.520 --> 10:03.200\n There's a higher likelihood that a person who's watching science would like jazz than\n\n10:03.840 --> 10:08.080\n the person watching science would like, I don't know, backyard railroads or something\n\n10:08.080 --> 10:08.480\n else, right?\n\n10:08.480 --> 10:15.120\n And so, we can try to measure these likelihoods and use that to make the best recommendation\n\n10:15.120 --> 10:15.520\n we can.\n\n10:16.320 --> 10:16.960\n So, okay.\n\n10:16.960 --> 10:21.600\n So, we'll talk about the machine learning of that, but I have to linger on things that\n\n10:21.600 --> 10:24.240\n neither you or anyone have an answer to.\n\n10:24.240 --> 10:31.440\n There's gray areas of truth, which is, for example, now I can't believe I'm going there,\n\n10:31.440 --> 10:32.720\n but politics.\n\n10:32.720 --> 10:36.960\n It happens so that certain people believe certain things and they're very certain about\n\n10:36.960 --> 10:37.460\n them.\n\n10:38.400 --> 10:44.080\n Let's move outside the red versus blue politics of today's world, but there's different ideologies.\n\n10:44.080 --> 10:49.840\n For example, in college, I read quite a lot of Ayn Rand I studied, and that's a particular\n\n10:49.840 --> 10:53.360\n philosophical ideology I found interesting to explore.\n\n10:53.360 --> 10:53.840\n Okay.\n\n10:53.840 --> 10:55.120\n So, that was that kind of space.\n\n10:55.120 --> 11:00.240\n I've kind of moved on from that cluster intellectually, but it nevertheless is an interesting cluster.\n\n11:00.240 --> 11:02.720\n I was born in the Soviet Union.\n\n11:02.720 --> 11:06.880\n Socialism, communism is a certain kind of political ideology that's really interesting\n\n11:06.880 --> 11:07.840\n to explore.\n\n11:07.840 --> 11:12.880\n Again, objectively, there's a set of beliefs about how the economy should work and so on.\n\n11:12.880 --> 11:18.400\n And so, it's hard to know what's true or not in terms of people within those communities\n\n11:18.400 --> 11:24.000\n are often advocating that this is how we achieve utopia in this world, and they're pretty\n\n11:24.000 --> 11:25.040\n certain about it.\n\n11:25.040 --> 11:33.840\n So, how do you try to manage politics in this chaotic, divisive world?\n\n11:33.840 --> 11:38.560\n Not positive or any kind of ideas in terms of filtering what people should watch next\n\n11:38.560 --> 11:43.680\n and in terms of also not letting certain things be on YouTube.\n\n11:44.160 --> 11:47.280\n This is an exceptionally difficult responsibility.\n\n11:47.280 --> 11:52.240\n Well, the responsibility to get this right is our top priority.\n\n11:52.240 --> 11:58.640\n And the first comes down to making sure that we have good, clear rules of the road, right?\n\n11:58.640 --> 12:03.440\n Like, just because we have freedom of speech doesn't mean that you can literally say anything,\n\n12:03.440 --> 12:03.920\n right?\n\n12:03.920 --> 12:09.920\n Like, we as a society have accepted certain restrictions on our freedom of speech.\n\n12:10.800 --> 12:13.760\n There are things like libel laws and things like that.\n\n12:13.760 --> 12:20.080\n And so, where we can draw a clear line, we do, and that's what we do.\n\n12:20.080 --> 12:25.360\n We draw a clear line, we do, and we continue to evolve that line over time.\n\n12:27.360 --> 12:32.240\n However, as you pointed out, wherever you draw the line, there's going to be a border\n\n12:32.240 --> 12:32.720\n line.\n\n12:33.360 --> 12:40.800\n And in that border line area, we are going to maybe not remove videos, but we will try\n\n12:40.800 --> 12:47.440\n to reduce the recommendations of them or the proliferation of them by demoting them.\n\n12:47.440 --> 12:53.040\n Alternatively, in those situations, try to raise what we would call authoritative or\n\n12:53.040 --> 12:55.520\n credible sources of information.\n\n12:55.520 --> 13:00.880\n So, we're not trying to, I mean, you mentioned Ayn Rand and communism.\n\n13:03.360 --> 13:07.920\n Those are two valid points of view that people are going to debate and discuss.\n\n13:07.920 --> 13:13.520\n And of course, people who believe in one or the other of those things are going to try\n\n13:13.520 --> 13:15.600\n to persuade other people to their point of view.\n\n13:15.600 --> 13:21.840\n And so, we're not trying to settle that or choose a side or anything like that.\n\n13:21.840 --> 13:26.960\n What we're trying to do is make sure that the people who are expressing those point\n\n13:26.960 --> 13:32.240\n of view and offering those positions are authoritative and credible.\n\n13:33.680 --> 13:38.720\n So, let me ask a question about people I don't like personally.\n\n13:38.720 --> 13:39.360\n You heard me.\n\n13:39.360 --> 13:41.120\n I don't care if you leave comments on this.\n\n13:41.120 --> 13:44.400\n But sometimes, they're brilliantly funny, which is trolls.\n\n13:45.600 --> 13:53.600\n So, people who kind of mock, I mean, the internet is full, Reddit of mock style\n\n13:53.600 --> 13:59.200\n comedy where people just kind of make fun of, point out that the emperor has no clothes.\n\n13:59.200 --> 14:02.720\n And there's brilliant comedy in that, but sometimes it can get cruel and mean.\n\n14:03.920 --> 14:10.560\n So, on that, on the mean point, and sorry to look at the comments, but I'm going to\n\n14:10.560 --> 14:13.920\n and sorry to linger on these things that have no good answers.\n\n14:13.920 --> 14:18.640\n But actually, I totally hear you that this is really important that you're trying to\n\n14:19.520 --> 14:19.920\n solve it.\n\n14:19.920 --> 14:24.800\n But how do you reduce the meanness of people on YouTube?\n\n14:26.400 --> 14:33.600\n I understand that anyone who uploads YouTube videos has to become resilient to a certain\n\n14:33.600 --> 14:35.360\n amount of meanness.\n\n14:35.360 --> 14:37.440\n Like I've heard that from many creators.\n\n14:37.440 --> 14:47.920\n And we are trying in various ways, comment ranking, allowing certain features to block\n\n14:47.920 --> 14:55.840\n people, to reduce or make that meanness or that trolling behavior less effective on YouTube.\n\n14:55.840 --> 14:56.340\n Yeah.\n\n14:56.560 --> 15:05.440\n And so, I mean, it's very important, but it's something that we're going to keep having\n\n15:05.440 --> 15:12.960\n to work on and as we improve it, like maybe we'll get to a point where people don't have\n\n15:12.960 --> 15:16.320\n to suffer this sort of meanness when they upload YouTube videos.\n\n15:16.320 --> 15:23.440\n I hope we do, but it just does seem to be something that you have to be able to deal\n\n15:23.440 --> 15:25.440\n with as a YouTube creator nowadays.\n\n15:25.440 --> 15:29.040\n Do you have a hope that, so you mentioned two things that I kind of agree with.\n\n15:29.040 --> 15:37.200\n So there's like a machine learning approach of ranking comments based on whatever, based\n\n15:37.200 --> 15:39.760\n on how much they contribute to the healthy conversation.\n\n15:40.320 --> 15:41.600\n Let's put it that way.\n\n15:41.600 --> 15:48.880\n Then the other is almost an interface question of how do you, how does the creator filter?\n\n15:48.880 --> 15:56.880\n So block or how does, how do humans themselves, the users of YouTube manage their own conversation?\n\n15:56.880 --> 16:02.400\n Do you have hope that these two tools will create a better society without limiting freedom\n\n16:02.400 --> 16:07.840\n of speech too much, without sort of attacking, even like saying that people, what do you\n\n16:07.840 --> 16:11.840\n mean limiting, sort of curating speech?\n\n16:12.560 --> 16:16.960\n I mean, I think that that overall is our whole project here at YouTube.\n\n16:16.960 --> 16:17.280\n Right.\n\n16:17.280 --> 16:24.160\n Like we fundamentally believe and I personally believe very much that YouTube can be great.\n\n16:24.720 --> 16:26.080\n It's been great for my kids.\n\n16:26.080 --> 16:28.400\n I think it can be great for society.\n\n16:29.360 --> 16:34.400\n But it's absolutely critical that we get this responsibility part right.\n\n16:34.400 --> 16:36.000\n And that's why it's our top priority.\n\n16:37.040 --> 16:42.080\n Susan Wojcicki, who's the CEO of YouTube, she says something that I personally find\n\n16:42.080 --> 16:49.920\n very inspiring, which is that we want to do our jobs today in a manner so that people\n\n16:49.920 --> 16:54.880\n 20 and 30 years from now will look back and say, YouTube, they really figured this out.\n\n16:54.880 --> 17:00.960\n They really found a way to strike the right balance between the openness and the value\n\n17:00.960 --> 17:06.480\n that the openness has and also making sure that we are meeting our responsibility to\n\n17:06.480 --> 17:07.600\n users in society.\n\n17:09.040 --> 17:12.080\n So the burden on YouTube actually is quite incredible.\n\n17:12.080 --> 17:18.400\n And the one thing that people don't give enough credit to the seriousness and the magnitude\n\n17:18.400 --> 17:19.360\n of the problem, I think.\n\n17:19.360 --> 17:26.960\n So I personally hope that you do solve it because a lot is in your hand, a lot is riding\n\n17:26.960 --> 17:28.320\n on your success or failure.\n\n17:28.320 --> 17:34.240\n So it's besides, of course, running a successful company, you're also curating the content\n\n17:34.240 --> 17:36.800\n of the internet and the conversation on the internet.\n\n17:36.800 --> 17:39.040\n That's a powerful thing.\n\n17:40.160 --> 17:48.320\n So one thing that people wonder about is how much of it can be solved with pure machine\n\n17:48.320 --> 17:49.360\n learning.\n\n17:49.360 --> 17:55.600\n So looking at the data, studying the data and creating algorithms that curate the comments,\n\n17:55.600 --> 18:02.880\n curate the content, and how much of it needs human intervention, meaning people here at\n\n18:02.880 --> 18:11.920\n YouTube in a room sitting and thinking about what is the nature of truth, what are the\n\n18:11.920 --> 18:14.480\n ideals that we should be promoting, that kind of thing.\n\n18:14.480 --> 18:18.000\n So algorithm versus human input, what's your sense?\n\n18:18.800 --> 18:23.600\n I mean, my own experience has demonstrated that you need both of those things.\n\n18:25.200 --> 18:29.360\n Algorithms, I mean, you're familiar with machine learning algorithms and the thing\n\n18:29.360 --> 18:34.640\n they need most is data and the data is generated by humans.\n\n18:34.640 --> 18:42.000\n And so, for instance, when we're building a system to try to figure out which are the\n\n18:42.000 --> 18:49.680\n videos that are misinformation or borderline policy violations, well, the first thing we\n\n18:49.680 --> 18:57.600\n need to do is get human beings to make decisions about which of those videos are in which category.\n\n18:57.600 --> 19:04.240\n And then we use that data and basically take that information that's determined and governed\n\n19:04.240 --> 19:12.960\n by humans and extrapolate it or apply it to the entire set of billions of YouTube videos.\n\n19:12.960 --> 19:20.720\n And we couldn't get to all the videos on YouTube well without the humans, and we couldn't use\n\n19:20.720 --> 19:23.120\n the humans to get to all the videos of YouTube.\n\n19:23.120 --> 19:28.320\n So there's no world in which you have only one or the other of these things.\n\n19:28.320 --> 19:36.880\n And just as you said, a lot of it comes down to people at YouTube spending a lot of time\n\n19:37.440 --> 19:43.840\n trying to figure out what are the right policies, what are the outcomes based on those policies,\n\n19:43.840 --> 19:45.680\n are they the kinds of things we want to see?\n\n19:46.640 --> 19:53.760\n And then once we kind of get an agreement or build some consensus around what the policies\n\n19:53.760 --> 19:59.040\n are, well, then we've got to find a way to implement those policies across all of YouTube.\n\n19:59.040 --> 20:05.360\n And that's where both the human beings, we call them evaluators or reviewers, come into\n\n20:05.360 --> 20:07.360\n play to help us with that.\n\n20:07.360 --> 20:12.080\n And then once we get a lot of training data from them, then we apply the machine learning\n\n20:12.080 --> 20:13.840\n techniques to take it even further.\n\n20:14.560 --> 20:20.480\n Do you have a sense that these human beings have a bias in some kind of direction?\n\n20:20.480 --> 20:22.880\n I mean, that's an interesting question.\n\n20:22.880 --> 20:28.000\n We do sort of in autonomous vehicles and computer vision in general, a lot of annotation, and\n\n20:28.000 --> 20:32.880\n we rarely ask what bias do the annotators have.\n\n20:35.360 --> 20:42.480\n Even in the sense that they're better at annotating certain things than others.\n\n20:42.480 --> 20:48.320\n For example, people are much better at, for example, at writing, they're much better at\n\n20:48.320 --> 20:56.080\n or much better at annotating segmentation at segmenting cars in a scene versus segmenting\n\n20:56.080 --> 20:57.200\n bushes or trees.\n\n20:59.120 --> 21:04.960\n There's specific mechanical reasons for that, but also because it's semantic gray area.\n\n21:04.960 --> 21:09.520\n And just for a lot of reasons, people are just terrible at annotating trees.\n\n21:09.520 --> 21:15.040\n Okay, so in the same kind of sense, do you think of, in terms of people reviewing videos\n\n21:15.040 --> 21:21.440\n or annotating the content of videos, is there some kind of bias that you're aware of or\n\n21:21.440 --> 21:24.160\n seek out in that human input?\n\n21:24.160 --> 21:30.560\n Well, we take steps to try to overcome these kinds of biases or biases that we think would\n\n21:30.560 --> 21:31.760\n be problematic.\n\n21:32.960 --> 21:38.400\n So for instance, like we ask people to have a bias towards scientific consensus.\n\n21:38.400 --> 21:41.040\n That's something that we instruct them to do.\n\n21:41.040 --> 21:47.760\n We ask them to have a bias towards demonstration of expertise or credibility or authoritativeness.\n\n21:48.560 --> 21:53.280\n But there are other biases that we want to make sure to try to remove.\n\n21:53.280 --> 21:55.600\n And there's many techniques for doing this.\n\n21:55.600 --> 22:01.520\n One of them is you send the same thing to be reviewed to many people.\n\n22:01.520 --> 22:04.080\n And so, that's one technique.\n\n22:04.080 --> 22:09.440\n Another is that you make sure that the people that are doing these sorts of tasks, that\n\n22:09.440 --> 22:15.920\n these sorts of tasks are from different backgrounds and different areas of the United States or\n\n22:15.920 --> 22:17.040\n of the world.\n\n22:17.040 --> 22:25.280\n But then, even with all of that, it's possible for certain kinds of what we would call unfair\n\n22:25.280 --> 22:31.200\n biases to creep into machine learning systems, primarily, as you said, because maybe the\n\n22:31.200 --> 22:34.160\n training data itself comes in in a biased way.\n\n22:34.160 --> 22:41.760\n So, we also have worked very hard on improving the machine learning systems to remove and\n\n22:41.760 --> 22:50.640\n reduce unfair biases when it goes against or involves some protected class, for instance.\n\n22:51.520 --> 22:55.680\n Thank you for exploring with me some of the more challenging things.\n\n22:55.680 --> 22:57.920\n I'm sure there's a few more that we'll jump back to.\n\n22:57.920 --> 23:05.040\n But let me jump into the fun part, which is maybe the basics of the quote, unquote, YouTube\n\n23:05.040 --> 23:05.520\n algorithm.\n\n23:06.880 --> 23:11.600\n What does the YouTube algorithm look at to make recommendation for what to watch next?\n\n23:11.600 --> 23:14.480\n And it's from a machine learning perspective.\n\n23:14.480 --> 23:20.320\n Or when you search for a particular term, how does it know what to show you next?\n\n23:20.320 --> 23:24.400\n Because it seems to, at least for me, do an incredible job of both.\n\n23:25.200 --> 23:26.400\n Well, that's kind of you to say.\n\n23:26.400 --> 23:31.840\n It didn't used to do a very good job, but it's gotten better over the years.\n\n23:31.840 --> 23:34.480\n Even I observed that it's improved quite a bit.\n\n23:35.440 --> 23:36.960\n Those are two different situations.\n\n23:36.960 --> 23:44.160\n Like when you search for something, YouTube uses the best technology we can get from Google\n\n23:45.760 --> 23:50.000\n to make sure that the YouTube search system finds what someone's looking for.\n\n23:50.000 --> 23:55.680\n And of course, the very first things that one thinks about is, okay, well, does the\n\n23:55.680 --> 23:58.560\n word occur in the title, for instance?\n\n24:00.560 --> 24:07.280\n But there are much more sophisticated things where we're mostly trying to do some syntactic\n\n24:07.280 --> 24:15.600\n match or maybe a semantic match based on words that we can add to the document itself.\n\n24:15.600 --> 24:21.760\n For instance, maybe is this video watched a lot after this query?\n\n24:21.760 --> 24:30.080\n That's something that we can observe and then as a result, make sure that that document\n\n24:30.080 --> 24:31.920\n would be retrieved for that query.\n\n24:33.040 --> 24:40.480\n Now, when you talk about what kind of videos would be recommended to watch next, that's\n\n24:40.480 --> 24:50.000\n something, again, we've been working on for many years and probably the first real attempt\n\n24:50.000 --> 24:54.000\n to do that well was to use collaborative filtering.\n\n24:55.520 --> 24:57.760\n Can you describe what collaborative filtering is?\n\n24:57.760 --> 24:58.240\n Sure.\n\n24:58.240 --> 25:06.320\n It's just basically what we do is we observe which videos get watched close together by\n\n25:06.320 --> 25:07.120\n the same person.\n\n25:08.320 --> 25:15.040\n And if you observe that and if you can imagine creating a graph where the videos that get\n\n25:15.040 --> 25:20.640\n watched close together by the most people are very close to one another in this graph\n\n25:20.640 --> 25:26.080\n and videos that don't frequently get watched close together by the same person or the same\n\n25:26.080 --> 25:33.280\n people are far apart, then you end up with this graph that we call the related graph\n\n25:33.280 --> 25:38.640\n that basically represents videos that are very similar or related in some way.\n\n25:38.640 --> 25:45.760\n And what's amazing about that is that it puts all the videos that are in the same\n\n25:45.760 --> 25:49.440\n language together, for instance, and we didn't even have to think about language.\n\n25:51.280 --> 25:52.880\n It just does it, right?\n\n25:52.880 --> 25:56.800\n And it puts all the videos that are about sports together and it puts most of the music\n\n25:56.800 --> 26:02.640\n videos together and it puts all of these sorts of videos together just because that's sort\n\n26:02.640 --> 26:05.920\n of the way the people using YouTube behave.\n\n26:05.920 --> 26:09.920\n So that already cleans up a lot of the problem.\n\n26:10.640 --> 26:16.800\n It takes care of the lowest hanging fruit, which happens to be a huge one of just managing\n\n26:16.800 --> 26:18.560\n these millions of videos.\n\n26:18.560 --> 26:19.120\n That's right.\n\n26:19.680 --> 26:27.520\n I remember a few years ago I was talking to someone who was trying to propose that we\n\n26:27.520 --> 26:37.680\n do a research project concerning people who are bilingual, and this person was making\n\n26:37.680 --> 26:44.160\n this proposal based on the idea that YouTube could not possibly be good at recommending\n\n26:44.160 --> 26:47.200\n videos well to people who are bilingual.\n\n26:48.000 --> 26:54.400\n And so she was telling me about this and I said, well, can you give me an example of\n\n26:54.400 --> 26:57.920\n what problem do you think we have on YouTube with the recommendations?\n\n26:57.920 --> 27:04.960\n And so she said, well, I'm a researcher in the US and when I'm looking for academic\n\n27:04.960 --> 27:07.920\n topics, I want to see them in English.\n\n27:07.920 --> 27:12.640\n And so she searched for one, found a video, and then looked at the watch next suggestions\n\n27:12.640 --> 27:13.920\n and they were all in English.\n\n27:14.720 --> 27:16.080\n And so she said, oh, I see.\n\n27:16.080 --> 27:18.480\n YouTube must think that I speak only English.\n\n27:18.480 --> 27:23.360\n And so she said, now I'm actually originally from Turkey and sometimes when I'm cooking,\n\n27:23.360 --> 27:27.600\n let's say I want to make some baklava, I really like to watch videos that are in Turkish.\n\n27:27.600 --> 27:33.040\n And so she searched for a video about making the baklava and then selected it and it was\n\n27:33.040 --> 27:35.600\n in Turkish and the watch next recommendations were in Turkish.\n\n27:35.600 --> 27:41.840\n And she just couldn't believe how this was possible and how is it that you know that\n\n27:41.840 --> 27:44.720\n I speak both these two languages and put all the videos together?\n\n27:44.720 --> 27:49.520\n And it's just as a sort of an outcome of this related graph that's created through\n\n27:49.520 --> 27:50.400\n collaborative filtering.\n\n27:51.440 --> 27:54.800\n So for me, one of my huge interests is just human psychology, right?\n\n27:54.800 --> 28:02.160\n And that's such a powerful platform on which to utilize human psychology to discover what\n\n28:02.160 --> 28:04.640\n people, individual people want to watch next.\n\n28:04.640 --> 28:06.720\n But it's also be just fascinating to me.\n\n28:06.720 --> 28:13.520\n You know, I've, Google search has ability to look at your own history and I've done\n\n28:13.520 --> 28:17.760\n that before, just, just what I've searched three years for many, many years.\n\n28:17.760 --> 28:20.320\n And it's fascinating picture of who I am actually.\n\n28:21.200 --> 28:24.880\n And I don't think anyone's ever summarized.\n\n28:24.880 --> 28:26.720\n I personally would love that.\n\n28:26.720 --> 28:32.480\n A summary of who I am as a person on the internet to me, because I didn't get a reply\n\n28:32.480 --> 28:38.080\n of who I am as a person on the internet to me, because I think it reveals, I think it\n\n28:38.080 --> 28:40.960\n puts a mirror to me or to others.\n\n28:41.920 --> 28:47.840\n You know, that's actually quite revealing and interesting, you know, just the, maybe\n\n28:47.840 --> 28:53.280\n in the number of, it's a joke, but not really is the number of cat videos I've watched or\n\n28:53.280 --> 28:59.120\n videos of people falling, you know, stuff that's absurd, that kind of stuff.\n\n28:59.120 --> 29:00.160\n It's really interesting.\n\n29:00.160 --> 29:06.240\n And of course it's really good for the machine learning aspect to, to show, to figure out\n\n29:06.240 --> 29:06.880\n what to show next.\n\n29:06.880 --> 29:07.840\n But it's interesting.\n\n29:09.120 --> 29:16.800\n Have you just as a tangent played around with the idea of giving a map to people sort of,\n\n29:16.800 --> 29:22.320\n as opposed to just using this information to show what's next, showing them here are\n\n29:22.320 --> 29:25.120\n the clusters you've loved over the years kind of thing?\n\n29:25.680 --> 29:29.200\n Well, we do provide the history of all the videos that you've watched.\n\n29:29.200 --> 29:29.440\n Yes.\n\n29:29.440 --> 29:32.880\n So you can definitely search through that and look through it and search through it\n\n29:32.880 --> 29:35.600\n to see what it is that you've been watching on YouTube.\n\n29:35.600 --> 29:44.720\n We have actually in various times experimented with this sort of cluster idea, finding ways\n\n29:44.720 --> 29:51.120\n to demonstrate or show people what topics they've been interested in or what clusters\n\n29:51.120 --> 29:51.920\n they've watched from.\n\n29:51.920 --> 29:58.800\n It's interesting that you bring this up because in some sense, the way the recommendation\n\n29:58.800 --> 30:04.720\n system of YouTube sees a user is exactly as the history of all the videos they've\n\n30:04.720 --> 30:05.520\n watched on YouTube.\n\n30:06.320 --> 30:17.200\n And so you can think of yourself or any user on YouTube as kind of like a DNA strand of\n\n30:17.200 --> 30:18.640\n all your videos, right?\n\n30:18.640 --> 30:23.520\n That sort of represents you, you can also think of it as maybe a vector in the space\n\n30:23.520 --> 30:25.120\n of all the videos on YouTube.\n\n30:26.160 --> 30:31.680\n And so now once you think of it as a vector in the space of all the videos on YouTube,\n\n30:31.680 --> 30:39.120\n then you can start to say, okay, well, which other vectors are close to me and to my vector?\n\n30:39.120 --> 30:44.560\n And that's one of the ways that we generate some diverse recommendations is because you're\n\n30:44.560 --> 30:50.080\n like, okay, well, these people seem to be close with respect to the videos they've\n\n30:50.080 --> 30:55.440\n watched on YouTube, but here's a topic or a video that one of them has watched and\n\n30:55.440 --> 31:01.040\n enjoyed, but the other one hasn't, that could be an opportunity to make a good recommendation.\n\n31:01.040 --> 31:04.720\n I got to tell you, I mean, I know I'm going to ask for things that are impossible, but\n\n31:04.720 --> 31:07.760\n I would love to cluster than human beings.\n\n31:07.760 --> 31:12.400\n I would love to know who has similar trajectories as me, because you probably would want to\n\n31:12.400 --> 31:14.560\n hang out, right?\n\n31:14.560 --> 31:18.800\n There's a social aspect there, like actually finding some of the most fascinating people\n\n31:18.800 --> 31:23.440\n I find on YouTube, but have like no followers and I start following them and they create\n\n31:23.440 --> 31:29.280\n incredible content and on that topic, I just love to ask, there's some videos that just\n\n31:29.280 --> 31:37.040\n blow my mind in terms of quality and depth and just in every regard are amazing videos\n\n31:37.040 --> 31:40.640\n and they have like 57 views, okay?\n\n31:40.640 --> 31:46.800\n How do you get videos of quality to be seen by many eyes?\n\n31:46.800 --> 31:53.440\n So the measure of quality, is it just something, yeah, how do you know that something is good?\n\n31:53.440 --> 31:58.640\n Well, I mean, I think it depends initially on what sort of video we're talking about.\n\n31:58.640 --> 32:08.400\n So in the realm of, let's say you mentioned politics and news, in that realm, you know,\n\n32:08.400 --> 32:16.880\n quality news or quality journalism relies on having a journalism department, right?\n\n32:16.880 --> 32:22.800\n Like you have to have actual journalists and fact checkers and people like that and so\n\n32:22.800 --> 32:30.000\n in that situation and in others, maybe science or in medicine, quality has a lot to do with\n\n32:30.000 --> 32:34.000\n the authoritativeness and the credibility and the expertise of the people who make the\n\n32:34.000 --> 32:36.000\n video.\n\n32:36.000 --> 32:42.240\n Now, if you think about the other end of the spectrum, you know, what is the highest quality\n\n32:42.240 --> 32:49.280\n prank video or what is the highest quality Minecraft video, right?\n\n32:49.280 --> 32:54.320\n That might be the one that people enjoy watching the most and watch to the end or it might\n\n32:54.320 --> 33:03.200\n be the one that when we ask people the next day after they watched it, were they satisfied\n\n33:03.200 --> 33:04.200\n with it?\n\n33:04.200 --> 33:11.600\n And so we in, especially in the realm of entertainment, have been trying to get at better and better\n\n33:11.600 --> 33:19.320\n measures of quality or satisfaction or enrichment since I came to YouTube.\n\n33:19.320 --> 33:27.280\n And we started with, well, you know, the first approximation is the one that gets more views.\n\n33:27.280 --> 33:32.360\n But you know, we both know that things can get a lot of views and not really be that\n\n33:32.360 --> 33:37.400\n high quality, especially if people are clicking on something and then immediately realizing\n\n33:37.400 --> 33:41.000\n that it's not that great and abandoning it.\n\n33:41.000 --> 33:46.160\n And that's why we moved from views to thinking about the amount of time people spend watching\n\n33:46.160 --> 33:52.840\n it with the premise that like, you know, in some sense, the time that someone spends watching\n\n33:52.840 --> 33:57.520\n a video is related to the value that they get from that video.\n\n33:57.520 --> 34:02.120\n It may not be perfectly related, but it has something to say about how much value they\n\n34:02.120 --> 34:04.040\n get.\n\n34:04.040 --> 34:05.680\n But even that's not good enough, right?\n\n34:05.680 --> 34:11.480\n Because I myself have spent time clicking through channels on television late at night\n\n34:11.480 --> 34:16.560\n and ended up watching Under Siege 2 for some reason I don't know.\n\n34:16.560 --> 34:21.580\n And if you were to ask me the next day, are you glad that you watched that show on TV\n\n34:21.580 --> 34:22.580\n last night?\n\n34:22.580 --> 34:27.800\n I'd say, yeah, I wish I would have gone to bed or read a book or almost anything else,\n\n34:27.800 --> 34:29.060\n really.\n\n34:29.060 --> 34:35.600\n And so that's why some people got the idea a few years ago to try to survey users afterwards.\n\n34:35.600 --> 34:43.340\n And so we get feedback data from those surveys and then use that in the machine learning\n\n34:43.340 --> 34:47.720\n system to try to not just predict what you're going to click on right now, what you might\n\n34:47.720 --> 34:54.020\n watch for a while, but what when we ask you tomorrow, you'll give four or five stars to.\n\n34:54.020 --> 34:59.320\n So just to summarize, what are the signals from a machine learning perspective that a\n\n34:59.320 --> 35:00.320\n user can provide?\n\n35:00.320 --> 35:05.000\n So you mentioned just clicking on the video views, the time watched, maybe the relative\n\n35:05.000 --> 35:12.760\n time watched, the clicking like and dislike on the video, maybe commenting on the video.\n\n35:12.760 --> 35:14.480\n All of those things.\n\n35:14.480 --> 35:15.480\n All of those things.\n\n35:15.480 --> 35:20.640\n And then the one I wasn't actually quite aware of, even though I might have engaged in it\n\n35:20.640 --> 35:24.660\n is a survey afterwards, which is a brilliant idea.\n\n35:24.660 --> 35:26.200\n Is there other signals?\n\n35:26.200 --> 35:30.680\n I mean, that's already a really rich space of signals to learn from.\n\n35:30.680 --> 35:31.920\n Is there something else?\n\n35:31.920 --> 35:35.960\n Well, you mentioned commenting, also sharing the video.\n\n35:35.960 --> 35:39.560\n If you think it's worthy to be shared with someone else you know.\n\n35:39.560 --> 35:41.600\n Within YouTube or outside of YouTube as well?\n\n35:41.600 --> 35:42.600\n Either.\n\n35:42.600 --> 35:44.920\n Let's see, you mentioned like, dislike.\n\n35:44.920 --> 35:45.920\n Like and dislike.\n\n35:45.920 --> 35:47.480\n How important is that?\n\n35:47.480 --> 35:48.480\n It's very important, right?\n\n35:48.480 --> 35:52.960\n We want, it's predictive of satisfaction.\n\n35:52.960 --> 35:56.400\n But it's not perfectly predictive.\n\n35:56.400 --> 35:57.400\n Subscribe.\n\n35:57.400 --> 36:03.840\n If you subscribe to the channel of the person who made the video, then that also is a piece\n\n36:03.840 --> 36:07.360\n of information and it signals satisfaction.\n\n36:07.360 --> 36:13.840\n Although over the years, we've learned that people have a wide range of attitudes about\n\n36:13.840 --> 36:17.080\n what it means to subscribe.\n\n36:17.080 --> 36:24.640\n We would ask some users who didn't subscribe very much, but they watched a lot from a few\n\n36:24.640 --> 36:25.640\n channels.\n\n36:25.640 --> 36:26.640\n We'd say, well, why didn't you subscribe?\n\n36:26.640 --> 36:32.000\n And they would say, well, I can't afford to pay for anything.\n\n36:32.000 --> 36:35.040\n We tried to let them understand like, actually it doesn't cost anything.\n\n36:35.040 --> 36:36.040\n It's free.\n\n36:36.040 --> 36:41.180\n It just helps us know that you are very interested in this creator.\n\n36:41.180 --> 36:47.560\n But then we've asked other people who subscribe to many things and don't really watch any\n\n36:47.560 --> 36:49.080\n of the videos from those channels.\n\n36:49.080 --> 36:54.920\n And we say, well, why did you subscribe to this if you weren't really interested in any\n\n36:54.920 --> 36:56.300\n more videos from that channel?\n\n36:56.300 --> 37:00.140\n And they might tell us, well, I just, you know, I thought the person did a great job\n\n37:00.140 --> 37:03.280\n and I just want to kind of give them a high five.\n\n37:03.280 --> 37:04.280\n And so.\n\n37:04.280 --> 37:05.280\n Yeah.\n\n37:05.280 --> 37:06.280\n That's where I sit.\n\n37:06.280 --> 37:11.320\n I go to channels where I just, this person is amazing.\n\n37:11.320 --> 37:13.200\n I like this person.\n\n37:13.200 --> 37:18.000\n But then I like this person and I really want to support them.\n\n37:18.000 --> 37:19.760\n That's how I click subscribe.\n\n37:19.760 --> 37:23.200\n Even though I mean never actually want to click on their videos when they're releasing\n\n37:23.200 --> 37:24.200\n it.\n\n37:24.200 --> 37:25.200\n I just love what they're doing.\n\n37:25.200 --> 37:30.440\n And it's maybe outside of my interest area and so on, which is probably the wrong way\n\n37:30.440 --> 37:31.440\n to use the subscribe button.\n\n37:31.440 --> 37:32.920\n But I just want to say congrats.\n\n37:32.920 --> 37:34.920\n This is great work.\n\n37:34.920 --> 37:39.320\n Well, so you have to deal with all the space of people that see the subscribe button is\n\n37:39.320 --> 37:40.320\n totally different.\n\n37:40.320 --> 37:41.320\n That's right.\n\n37:41.320 --> 37:46.200\n And so, you know, we can't just close our eyes and say, sorry, you're using it wrong.\n\n37:46.200 --> 37:50.260\n You know, we're not going to pay attention to what you've done.\n\n37:50.260 --> 37:53.880\n We need to embrace all the ways in which all the different people in the world use the\n\n37:53.880 --> 37:57.840\n subscribe button or the like and the dislike button.\n\n37:57.840 --> 38:05.400\n So in terms of signals of machine learning, using for the search and for the recommendation,\n\n38:05.400 --> 38:06.400\n you've mentioned title.\n\n38:06.400 --> 38:13.840\n So like metadata, like text data that people provide description and title and maybe keywords.\n\n38:13.840 --> 38:19.760\n Maybe you can speak to the value of those things in search and also this incredible\n\n38:19.760 --> 38:22.860\n fascinating area of the content itself.\n\n38:22.860 --> 38:26.280\n So the video content itself, trying to understand what's happening in the video.\n\n38:26.280 --> 38:30.960\n So YouTube released a data set that, you know, in the machine learning computer vision world,\n\n38:30.960 --> 38:33.280\n this is just an exciting space.\n\n38:33.280 --> 38:35.760\n How much is that currently?\n\n38:35.760 --> 38:37.300\n How much are you playing with that currently?\n\n38:37.300 --> 38:42.120\n How much is your hope for the future of being able to analyze the content of the video itself?\n\n38:42.120 --> 38:46.560\n Well, we have been working on that also since I came to YouTube.\n\n38:46.560 --> 38:47.560\n Analyzing the content.\n\n38:47.560 --> 38:50.700\n Analyzing the content of the video, right?\n\n38:50.700 --> 39:00.280\n And what I can tell you is that our ability to do it well is still somewhat crude.\n\n39:00.280 --> 39:05.120\n We can tell if it's a music video, we can tell if it's a sports video, we can probably\n\n39:05.120 --> 39:09.520\n tell you that people are playing soccer.\n\n39:09.520 --> 39:15.440\n We probably can't tell whether it's Manchester United or my daughter's soccer team.\n\n39:15.440 --> 39:21.280\n So these things are kind of difficult and using them, we can use them in some ways.\n\n39:21.280 --> 39:27.080\n So for instance, we use that kind of information to understand and inform these clusters that\n\n39:27.080 --> 39:30.240\n I talked about.\n\n39:30.240 --> 39:34.980\n And also maybe to add some words like soccer, for instance, to the video, if it doesn't\n\n39:34.980 --> 39:40.960\n occur in the title or the description, which is remarkable that often it doesn't.\n\n39:40.960 --> 39:47.560\n One of the things that I ask creators to do is please help us out with the title and the\n\n39:47.560 --> 39:48.560\n description.\n\n39:48.560 --> 39:56.160\n For instance, we were a few years ago having a live stream of some competition for World\n\n39:56.160 --> 39:59.080\n of Warcraft on YouTube.\n\n39:59.080 --> 40:04.220\n And it was a very important competition, but if you typed World of Warcraft in search,\n\n40:04.220 --> 40:05.480\n you wouldn't find it.\n\n40:05.480 --> 40:07.600\n World of Warcraft wasn't in the title?\n\n40:07.600 --> 40:09.120\n World of Warcraft wasn't in the title.\n\n40:09.120 --> 40:14.520\n It was match 478, you know, A team versus B team and World of Warcraft wasn't in the\n\n40:14.520 --> 40:15.520\n title.\n\n40:15.520 --> 40:17.940\n I'm just like, come on, give me.\n\n40:17.940 --> 40:22.120\n Being literal on the internet is actually very uncool, which is the problem.\n\n40:22.120 --> 40:23.920\n Oh, is that right?\n\n40:23.920 --> 40:28.520\n Well, I mean, in some sense, well, some of the greatest videos, I mean, there's a humor\n\n40:28.520 --> 40:31.800\n to just being indirect, being witty and so on.\n\n40:31.800 --> 40:37.560\n And actually being, you know, machine learning algorithms want you to be, you know, literal,\n\n40:37.560 --> 40:38.560\n right?\n\n40:38.560 --> 40:42.840\n You just want to say what's in the thing, be very, very simple.\n\n40:42.840 --> 40:46.160\n And in some sense that gets away from wit and humor.\n\n40:46.160 --> 40:48.920\n So you have to play with both, right?\n\n40:48.920 --> 40:54.280\n But you're saying that for now, sort of the content of the title, the content of the description,\n\n40:54.280 --> 41:01.920\n the actual text is one of the best ways for the algorithm to find your video and put them\n\n41:01.920 --> 41:03.080\n in the right cluster.\n\n41:03.080 --> 41:04.160\n That's right.\n\n41:04.160 --> 41:10.240\n And I would go further and say that if you want people, human beings to select your video\n\n41:10.240 --> 41:14.920\n in search, then it helps to have, let's say World of Warcraft in the title.\n\n41:14.920 --> 41:20.000\n Because why would a person, you know, if they're looking at a bunch, they type World of Warcraft\n\n41:20.000 --> 41:23.880\n and they have a bunch of videos, all of whom say World of Warcraft, except the one that\n\n41:23.880 --> 41:24.880\n you uploaded.\n\n41:24.880 --> 41:29.280\n Well, even the person is going to think, well, maybe this isn't somehow search made a mistake.\n\n41:29.280 --> 41:31.540\n This isn't really about World of Warcraft.\n\n41:31.540 --> 41:36.160\n So it's important not just for the machine learning systems, but also for the people\n\n41:36.160 --> 41:38.000\n who might be looking for this sort of thing.\n\n41:38.000 --> 41:44.680\n They get a clue that it's what they're looking for by seeing that same thing prominently\n\n41:44.680 --> 41:45.960\n in the title of the video.\n\n41:45.960 --> 41:46.960\n Okay.\n\n41:46.960 --> 41:47.960\n Let me push back on that.\n\n41:47.960 --> 41:52.640\n So I think from the algorithm perspective, yes, but if they typed in World of Warcraft\n\n41:52.640 --> 42:02.440\n and saw a video that with the title simply winning and the thumbnail has like a sad orc\n\n42:02.440 --> 42:04.480\n or something, I don't know, right?\n\n42:04.480 --> 42:11.760\n Like I think that's much, it gets your curiosity up.\n\n42:11.760 --> 42:15.920\n And then if they could trust that the algorithm was smart enough to figure out somehow that\n\n42:15.920 --> 42:20.000\n this is indeed a World of Warcraft video, that would have created the most beautiful\n\n42:20.000 --> 42:21.000\n experience.\n\n42:21.000 --> 42:25.720\n I think in terms of just the wit and the humor and the curiosity that we human beings naturally\n\n42:25.720 --> 42:26.720\n have.\n\n42:26.720 --> 42:30.080\n But you're saying, I mean, realistically speaking, it's really hard for the algorithm\n\n42:30.080 --> 42:34.680\n to figure out that the content of that video will be a World of Warcraft video.\n\n42:34.680 --> 42:37.120\n And you have to accept that some people are going to skip it.\n\n42:37.120 --> 42:38.120\n Yeah.\n\n42:38.120 --> 42:39.120\n Right?\n\n42:39.120 --> 42:41.040\n I mean, and so you're right.\n\n42:41.040 --> 42:47.120\n The people who don't skip it and select it are going to be delighted, but other people\n\n42:47.120 --> 42:50.080\n might say, yeah, this is not what I was looking for.\n\n42:50.080 --> 42:56.600\n And making stuff discoverable, I think is what you're really working on and hoping.\n\n42:56.600 --> 42:57.600\n So yeah.\n\n42:57.600 --> 43:00.440\n So from your perspective, put stuff in the title description.\n\n43:00.440 --> 43:07.960\n And remember the collaborative filtering part of the system starts by the same user watching\n\n43:07.960 --> 43:09.800\n videos together, right?\n\n43:09.800 --> 43:14.200\n So the way that they're probably going to do that is by searching for them.\n\n43:14.200 --> 43:15.480\n That's a fascinating aspect of it.\n\n43:15.480 --> 43:16.480\n It's like ant colonies.\n\n43:16.480 --> 43:19.000\n That's how they find stuff.\n\n43:19.000 --> 43:27.680\n So I mean, what degree for collaborative filtering in general is one curious ant, one curious\n\n43:27.680 --> 43:28.680\n user, essential?\n\n43:28.680 --> 43:33.800\n So just a person who is more willing to click on random videos and sort of explore these\n\n43:33.800 --> 43:35.520\n cluster spaces.\n\n43:35.520 --> 43:39.640\n In your sense, how many people are just like watching the same thing over and over and\n\n43:39.640 --> 43:40.640\n over and over?\n\n43:40.640 --> 43:44.760\n And how many are just like the explorers and just kind of like click on stuff and then\n\n43:44.760 --> 43:49.680\n help the other ant in the ant's colony discover the cool stuff?\n\n43:49.680 --> 43:51.080\n Do you have a sense of that at all?\n\n43:51.080 --> 43:56.040\n I really don't think I have a sense for the relative sizes of those groups.\n\n43:56.040 --> 44:01.240\n But I would say that people come to YouTube with some certain amount of intent.\n\n44:01.240 --> 44:08.040\n And as long as they, to the extent to which they try to satisfy that intent, that certainly\n\n44:08.040 --> 44:09.520\n helps our systems, right?\n\n44:09.520 --> 44:17.360\n Because our systems rely on kind of a faithful amount of behavior, right?\n\n44:17.360 --> 44:19.000\n And there are people who try to trick us, right?\n\n44:19.000 --> 44:25.280\n There are people and machines that try to associate videos together that really don't\n\n44:25.280 --> 44:30.360\n belong together, but they're trying to get that association made because it's profitable\n\n44:30.360 --> 44:31.440\n for them.\n\n44:31.440 --> 44:37.680\n And so we have to always be resilient to that sort of attempt at gaming the systems.\n\n44:37.680 --> 44:42.760\n So speaking to that, there's a lot of people that in a positive way, perhaps, I don't know,\n\n44:42.760 --> 44:47.720\n I don't like it, but like to want to try to game the system to get more attention.\n\n44:47.720 --> 44:51.500\n Everybody creators in a positive sense want to get attention, right?\n\n44:51.500 --> 45:01.020\n So how do you work in this space when people create more and more sort of click baity titles\n\n45:01.020 --> 45:02.020\n and thumbnails?\n\n45:02.020 --> 45:08.080\n Sort of very to ask him, Derek has made a video where basically describes that it seems\n\n45:08.080 --> 45:12.920\n what works is to create a high quality video, really good video, where people would want\n\n45:12.920 --> 45:18.040\n to watch it once they click on it, but have click baity titles and thumbnails to get them\n\n45:18.040 --> 45:19.640\n to click on it in the first place.\n\n45:19.640 --> 45:23.600\n And he's saying, I'm embracing this fact, I'm just going to keep doing it.\n\n45:23.600 --> 45:28.520\n And I hope you forgive me for doing it and you will enjoy my videos once you click on\n\n45:28.520 --> 45:29.520\n them.\n\n45:29.520 --> 45:38.000\n So in what sense do you see this kind of click bait style attempt to manipulate, to get people\n\n45:38.000 --> 45:43.400\n in the door to manipulate the algorithm or play with the algorithm or game the algorithm?\n\n45:43.400 --> 45:47.560\n I think that you can look at it as an attempt to game the algorithm.\n\n45:47.560 --> 45:52.800\n But even if you were to take the algorithm out of it and just say, okay, well, all these\n\n45:52.800 --> 45:57.800\n videos happen to be lined up, which the algorithm didn't make any decision about which one to\n\n45:57.800 --> 46:02.240\n put at the top or the bottom, but they're all lined up there, which one are the people\n\n46:02.240 --> 46:04.180\n going to choose?\n\n46:04.180 --> 46:09.640\n And I'll tell you the same thing that I told Derek is, I have a bookshelf and they have\n\n46:09.640 --> 46:13.560\n two kinds of books on them, science books.\n\n46:13.560 --> 46:19.340\n I have my math books from when I was a student and they all look identical except for the\n\n46:19.340 --> 46:21.220\n titles on the covers.\n\n46:21.220 --> 46:24.920\n They're all yellow, they're all from Springer and they're every single one of them.\n\n46:24.920 --> 46:27.240\n The cover is totally the same.\n\n46:27.240 --> 46:28.240\n Yes.\n\n46:28.240 --> 46:29.240\n Right?\n\n46:29.240 --> 46:30.240\n Yeah.\n\n46:30.240 --> 46:34.960\n On the other hand, I have other more pop science type books and they all have very interesting\n\n46:34.960 --> 46:40.400\n covers and they have provocative titles and things like that.\n\n46:40.400 --> 46:45.640\n I wouldn't say that they're click baity because they are indeed good books.\n\n46:45.640 --> 46:52.720\n And I don't think that they cross any line, but that's just a decision you have to make.\n\n46:52.720 --> 46:58.560\n Like the people who write classical recursion theory by Piero di Freddie, he was fine with\n\n46:58.560 --> 47:02.240\n the yellow title and nothing more.\n\n47:02.240 --> 47:10.320\n Whereas I think other people who wrote a more popular type book understand that they need\n\n47:10.320 --> 47:15.320\n to have a compelling cover and a compelling title.\n\n47:15.320 --> 47:19.240\n And I don't think there's anything really wrong with that.\n\n47:19.240 --> 47:24.880\n We do take steps to make sure that there is a line that you don't cross.\n\n47:24.880 --> 47:32.080\n And if you go too far, maybe your thumbnail is especially racy or it's all caps with too\n\n47:32.080 --> 47:41.960\n many exclamation points, we observe that users are sometimes offended by that.\n\n47:41.960 --> 47:51.240\n And so for the users who are offended by that, we will then depress or suppress those videos.\n\n47:51.240 --> 47:55.640\n And which reminds me, there's also another signal where users can say, I don't know if\n\n47:55.640 --> 47:58.080\n it was recently added, but I really enjoy it.\n\n47:58.080 --> 48:04.640\n Just saying, something like, I don't want to see this video anymore or something like,\n\n48:04.640 --> 48:09.200\n like this is a, like there's certain videos that just cut me the wrong way.\n\n48:09.200 --> 48:12.160\n Like just, just jump out at me, it's like, I don't want to, I don't want this.\n\n48:12.160 --> 48:17.120\n And it feels really good to clean that up, to be like, I don't, that's not, that's not\n\n48:17.120 --> 48:18.120\n for me.\n\n48:18.120 --> 48:19.120\n I don't know.\n\n48:19.120 --> 48:22.440\n I think that might've been recently added, but that's also a really strong signal.\n\n48:22.440 --> 48:23.440\n Yes, absolutely.\n\n48:23.440 --> 48:24.440\n Right.\n\n48:24.440 --> 48:29.440\n We don't want to make a recommendation that people are unhappy with.\n\n48:29.440 --> 48:34.000\n And that makes me, that particular one makes me feel good as a user in general and as a\n\n48:34.000 --> 48:35.000\n machine learning person.\n\n48:35.000 --> 48:37.840\n Cause I feel like I'm helping the algorithm.\n\n48:37.840 --> 48:41.040\n My interactions on YouTube don't always feel like I'm helping the algorithm.\n\n48:41.040 --> 48:43.920\n Like I'm not reminded of that fact.\n\n48:43.920 --> 48:50.680\n Like for example, Tesla and Autopilot and Elon Musk create a feeling for their customers,\n\n48:50.680 --> 48:54.080\n for people that own Teslas, that they're helping the algorithm of Tesla vehicles.\n\n48:54.080 --> 48:57.160\n Like they're all, like are really proud they're helping the fleet learn.\n\n48:57.160 --> 49:02.560\n I think YouTube doesn't always remind people that you're helping the algorithm get smarter.\n\n49:02.560 --> 49:04.560\n And for me, I love that idea.\n\n49:04.560 --> 49:09.960\n Like we're all collaboratively, like Wikipedia gives that sense that we're all together creating\n\n49:09.960 --> 49:12.040\n a beautiful thing.\n\n49:12.040 --> 49:14.720\n YouTube is a, doesn't always remind me of that.\n\n49:14.720 --> 49:18.560\n It's a, this conversation is reminding me of that, but.\n\n49:18.560 --> 49:19.560\n Well that's a good tip.\n\n49:19.560 --> 49:22.520\n We should keep that fact in mind when we design these features.\n\n49:22.520 --> 49:28.000\n I'm not sure I really thought about it that way, but that's a very interesting perspective.\n\n49:28.000 --> 49:35.140\n It's an interesting question of personalization that I feel like when I click like on a video,\n\n49:35.140 --> 49:39.420\n I'm just improving my experience.\n\n49:39.420 --> 49:40.940\n It would be great.\n\n49:40.940 --> 49:45.060\n It would make me personally, people are different, but make me feel great if I was helping also\n\n49:45.060 --> 49:47.640\n the YouTube algorithm broadly say something.\n\n49:47.640 --> 49:48.640\n You know what I'm saying?\n\n49:48.640 --> 49:53.720\n Like there's a, that I don't know if that's human nature, but you want the products you\n\n49:53.720 --> 49:58.960\n love, and I certainly love YouTube, like you want to help it get smarter, smarter, smarter\n\n49:58.960 --> 50:04.780\n because there's some kind of coupling between our lives together being better.\n\n50:04.780 --> 50:07.120\n If YouTube is better than I will, my life will be better.\n\n50:07.120 --> 50:08.120\n And there's that kind of reasoning.\n\n50:08.120 --> 50:12.240\n I'm not sure what that is and I'm not sure how many people share that feeling.\n\n50:12.240 --> 50:14.240\n That could be just a machine learning feeling.\n\n50:14.240 --> 50:22.720\n But on that point, how much personalization is there in terms of next video recommendations?\n\n50:22.720 --> 50:28.200\n So is it kind of all really boiling down to clustering?\n\n50:28.200 --> 50:33.400\n Like if I'm the nearest clusters to me and so on and that kind of thing, or how much\n\n50:33.400 --> 50:36.120\n is personalized to me, the individual completely?\n\n50:36.120 --> 50:38.900\n It's very, very personalized.\n\n50:38.900 --> 50:45.160\n So your experience will be quite a bit different from anybody else's who's watching that same\n\n50:45.160 --> 50:48.640\n video, at least when they're logged in.\n\n50:48.640 --> 50:56.240\n And the reason is that we found that users often want two different kinds of things when\n\n50:56.240 --> 50:58.320\n they're watching a video.\n\n50:58.320 --> 51:05.000\n Sometimes they want to keep watching more on that topic or more in that genre.\n\n51:05.000 --> 51:09.320\n And other times they just are done and they're ready to move on to something else.\n\n51:09.320 --> 51:13.200\n And so the question is, well, what is the something else?\n\n51:13.200 --> 51:19.040\n And one of the first things one can imagine is, well, maybe something else is the latest\n\n51:19.040 --> 51:22.400\n video from some channel to which you've subscribed.\n\n51:22.400 --> 51:27.840\n And that's going to be very different for you than it is for me.\n\n51:27.840 --> 51:31.160\n And even if it's not something that you subscribe to, it's something that you watch a lot.\n\n51:31.160 --> 51:34.960\n And again, that'll be very different on a person by person basis.\n\n51:34.960 --> 51:43.800\n And so even the Watch Next, as well as the homepage, of course, is quite personalized.\n\n51:43.800 --> 51:47.760\n So what, we mentioned some of the signals, but what does success look like?\n\n51:47.760 --> 51:52.200\n What does success look like in terms of the algorithm creating a great long term experience\n\n51:52.200 --> 51:53.560\n for a user?\n\n51:53.560 --> 52:00.240\n Or to put another way, if you look at the videos I've watched this month, how do you\n\n52:00.240 --> 52:03.680\n know the algorithm succeeded for me?\n\n52:03.680 --> 52:09.000\n I think, first of all, if you come back and watch more YouTube, then that's one indication\n\n52:09.000 --> 52:10.840\n that you found some value from it.\n\n52:10.840 --> 52:13.480\n So just the number of hours is a powerful indicator.\n\n52:13.480 --> 52:22.120\n Well, I mean, not the hours themselves, but the fact that you return on another day.\n\n52:22.120 --> 52:26.320\n So that's probably the most simple indicator.\n\n52:26.320 --> 52:29.240\n People don't come back to things that they don't find value in, right?\n\n52:29.240 --> 52:32.440\n There's a lot of other things that they could do.\n\n52:32.440 --> 52:38.320\n But like I said, ideally, we would like everybody to feel that YouTube enriches their lives\n\n52:38.320 --> 52:43.320\n and that every video they watched is the best one they've ever watched since they've started\n\n52:43.320 --> 52:44.840\n watching YouTube.\n\n52:44.840 --> 52:52.960\n And so that's why we survey them and ask them, is this one to five stars?\n\n52:52.960 --> 52:58.400\n And so our version of success is every time someone takes that survey, they say it's five\n\n52:58.400 --> 53:00.040\n stars.\n\n53:00.040 --> 53:03.620\n And if we ask them, is this the best video you've ever seen on YouTube?\n\n53:03.620 --> 53:05.960\n They say, yes, every single time.\n\n53:05.960 --> 53:09.760\n So it's hard to imagine that we would actually achieve that.\n\n53:09.760 --> 53:16.560\n Maybe asymptotically we would get there, but that would be what we think success is.\n\n53:16.560 --> 53:17.560\n It's funny.\n\n53:17.560 --> 53:23.640\n I've recently said somewhere, I don't know, maybe tweeted, but that Ray Dalio has this\n\n53:23.640 --> 53:29.280\n video on the economic machine, I forget what it's called, but it's a 30 minute video.\n\n53:29.280 --> 53:32.880\n And I said it's the greatest video I've ever watched on YouTube.\n\n53:32.880 --> 53:38.560\n It's like I watched the whole thing and my mind was blown as a very crisp, clean description\n\n53:38.560 --> 53:41.400\n of how the, at least the American economic system works.\n\n53:41.400 --> 53:43.080\n It's a beautiful video.\n\n53:43.080 --> 53:47.560\n And I was just, I wanted to click on something to say this is the best thing.\n\n53:47.560 --> 53:48.720\n This is the best thing ever.\n\n53:48.720 --> 53:51.040\n Please let me, I can't believe I discovered it.\n\n53:51.040 --> 53:57.400\n I mean, the views and the likes reflect its quality, but I was almost upset that I haven't\n\n53:57.400 --> 54:01.000\n found it earlier and wanted to find other things like it.\n\n54:01.000 --> 54:05.000\n I don't think I've ever felt that this is the best video I've ever watched.\n\n54:05.000 --> 54:06.180\n That was that.\n\n54:06.180 --> 54:10.960\n And to me, the ultimate utopia, the best experiences were every single video.\n\n54:10.960 --> 54:15.520\n Where I don't see any of the videos I regret and every single video I watch is one that\n\n54:15.520 --> 54:25.080\n actually helps me grow, helps me enjoy life, be happy and so on.\n\n54:25.080 --> 54:31.480\n So that's a heck of a, that's one of the most beautiful and ambitious, I think, machine\n\n54:31.480 --> 54:32.840\n learning tasks.\n\n54:32.840 --> 54:37.760\n So when you look at a society as opposed to the individual user, do you think of how YouTube\n\n54:37.760 --> 54:44.200\n is changing society when you have these millions of people watching videos, growing, learning,\n\n54:44.200 --> 54:45.840\n changing, having debates?\n\n54:45.840 --> 54:51.520\n Do you have a sense of, yeah, what the big impact on society is?\n\n54:51.520 --> 54:55.960\n I think it's huge, but do you have a sense of what direction we're taking this world?\n\n54:55.960 --> 55:02.520\n Well, I mean, I think openness has had an impact on society already.\n\n55:02.520 --> 55:03.520\n There's a lot of...\n\n55:03.520 --> 55:05.680\n What do you mean by openness?\n\n55:05.680 --> 55:14.160\n Well, the fact that unlike other mediums, there's not someone sitting at YouTube who\n\n55:14.160 --> 55:20.080\n decides before you can upload your video, whether it's worth having you upload it or\n\n55:20.080 --> 55:23.120\n worth anybody seeing it really, right?\n\n55:23.120 --> 55:32.440\n And so there are some creators who say, like, I wouldn't have this opportunity to reach\n\n55:32.440 --> 55:33.720\n an audience.\n\n55:33.720 --> 55:39.440\n Tyler Oakley often said that he wouldn't have had this opportunity to reach this audience\n\n55:39.440 --> 55:44.000\n if it weren't for YouTube.\n\n55:44.000 --> 55:50.080\n And so I think that's one way in which YouTube has changed society.\n\n55:50.080 --> 55:56.160\n I know that there are people that I work with from outside the United States, especially\n\n55:56.160 --> 56:03.760\n from places where literacy is low, and they think that YouTube can help in those places\n\n56:03.760 --> 56:09.060\n because you don't need to be able to read and write in order to learn something important\n\n56:09.060 --> 56:15.200\n for your life, maybe how to do some job or how to fix something.\n\n56:15.200 --> 56:21.520\n And so that's another way in which I think YouTube is possibly changing society.\n\n56:21.520 --> 56:25.960\n So I've worked at YouTube for eight, almost nine years now.\n\n56:25.960 --> 56:32.720\n And it's fun because I meet people and you tell them where you work, you say you work\n\n56:32.720 --> 56:36.740\n on YouTube and they immediately say, I love YouTube, right?\n\n56:36.740 --> 56:39.260\n Which is great, makes me feel great.\n\n56:39.260 --> 56:43.680\n But then of course, when I ask them, well, what is it that you love about YouTube?\n\n56:43.680 --> 56:50.080\n Not one time ever has anybody said that the search works outstanding or that the recommendations\n\n56:50.080 --> 56:52.760\n are great.\n\n56:52.760 --> 56:57.860\n What they always say when I ask them, what do you love about YouTube is they immediately\n\n56:57.860 --> 57:03.600\n start talking about some channel or some creator or some topic or some community that they\n\n57:03.600 --> 57:07.500\n found on YouTube and that they just love.\n\n57:07.500 --> 57:16.640\n And so that has made me realize that YouTube is really about the video and connecting the\n\n57:16.640 --> 57:19.200\n people with the videos.\n\n57:19.200 --> 57:22.680\n And then everything else kind of gets out of the way.\n\n57:22.680 --> 57:28.940\n So beyond the video, it's an interesting, because you kind of mentioned creator.\n\n57:28.940 --> 57:35.240\n What about the connection with just the individual creators as opposed to just individual video?\n\n57:35.240 --> 57:42.720\n So like I gave the example of Ray Dalio video that the video itself is incredible, but there's\n\n57:42.720 --> 57:47.640\n some people who are just creators that I love.\n\n57:47.640 --> 57:52.200\n One of the cool things about people who call themselves YouTubers or whatever is they have\n\n57:52.200 --> 57:53.200\n a journey.\n\n57:53.200 --> 57:57.820\n They usually, almost all of them, they suck horribly in the beginning and then they kind\n\n57:57.820 --> 58:01.800\n of grow and then there's that genuineness in their growth.\n\n58:01.800 --> 58:07.480\n So YouTube clearly wants to help creators connect with their audience in this kind of\n\n58:07.480 --> 58:08.480\n way.\n\n58:08.480 --> 58:12.060\n So how do you think about that process of helping creators grow, helping them connect\n\n58:12.060 --> 58:17.440\n with their audience, develop not just individual videos, but the entirety of a creator's life\n\n58:17.440 --> 58:18.440\n on YouTube?\n\n58:18.440 --> 58:24.700\n Well, I mean, we're trying to help creators find the biggest audience that they can find.\n\n58:24.700 --> 58:30.580\n And the reason why that's, you brought up creator versus video, the reason why creator\n\n58:30.580 --> 58:41.120\n channel is so important is because if we have a hope of people coming back to YouTube, well,\n\n58:41.120 --> 58:46.000\n they have to have in their minds some sense of what they're going to find when they come\n\n58:46.000 --> 58:48.020\n back to YouTube.\n\n58:48.020 --> 58:54.740\n If YouTube were just the next viral video and I have no concept of what the next viral\n\n58:54.740 --> 59:00.000\n video could be, one time it's a cat playing a piano and the next day it's some children\n\n59:00.000 --> 59:06.600\n interrupting a reporter and the next day it's some other thing happening, then it's hard\n\n59:06.600 --> 59:14.760\n for me to, when I'm not watching YouTube, say, gosh, I really would like to see something\n\n59:14.760 --> 59:17.980\n from someone or about something, right?\n\n59:17.980 --> 59:24.280\n And so that's why I think this connection between fans and creators is so important\n\n59:24.280 --> 59:31.700\n for both, because it's a way of sort of fostering a relationship that can play out into the\n\n59:31.700 --> 59:32.700\n future.\n\n59:32.700 --> 59:40.100\n Let me talk about kind of a dark and interesting question in general, and again, a topic that\n\n59:40.100 --> 59:42.400\n you or nobody has an answer to.\n\n59:42.400 --> 59:50.580\n But social media has a sense of, it gives us highs and it gives us lows in the sense\n\n59:50.580 --> 59:58.180\n that sort of creators often speak about having sort of burnout and having psychological ups\n\n59:58.180 --> 1:00:02.800\n and downs and challenges mentally in terms of continuing the creation process.\n\n1:00:02.800 --> 1:00:08.960\n There's a momentum, there's a huge excited audience that makes creators feel great.\n\n1:00:08.960 --> 1:00:11.740\n And I think it's more than just financial.\n\n1:00:11.740 --> 1:00:16.220\n I think it's literally just, they love that sense of community.\n\n1:00:16.220 --> 1:00:18.340\n It's part of the reason I upload to YouTube.\n\n1:00:18.340 --> 1:00:20.580\n I don't care about money, never will.\n\n1:00:20.580 --> 1:00:26.420\n What I care about is the community, but some people feel like this momentum, and even when\n\n1:00:26.420 --> 1:00:31.260\n there's times in their life when they don't feel, you know, for some reason don't feel\n\n1:00:31.260 --> 1:00:32.260\n like creating.\n\n1:00:32.260 --> 1:00:38.220\n So how do you think about burnout, this mental exhaustion that some YouTube creators go through?\n\n1:00:38.220 --> 1:00:40.500\n Is that something we have an answer for?\n\n1:00:40.500 --> 1:00:42.740\n Is that something, how do we even think about that?\n\n1:00:42.740 --> 1:00:47.700\n Well, the first thing is we want to make sure that the YouTube systems are not contributing\n\n1:00:47.700 --> 1:00:49.180\n to this sense, right?\n\n1:00:49.180 --> 1:00:56.780\n And so we've done a fair amount of research to demonstrate that you can absolutely take\n\n1:00:56.780 --> 1:00:57.940\n a break.\n\n1:00:57.940 --> 1:01:03.620\n If you are a creator and you've been uploading a lot, we have just as many examples of people\n\n1:01:03.620 --> 1:01:08.780\n who took a break and came back more popular than they were before as we have examples\n\n1:01:08.780 --> 1:01:09.780\n of going the other way.\n\n1:01:09.780 --> 1:01:10.780\n Yeah.\n\n1:01:10.780 --> 1:01:11.780\n Can we pause on that for a second?\n\n1:01:11.780 --> 1:01:17.500\n So the feeling that people have, I think, is if I take a break, everybody, the party\n\n1:01:17.500 --> 1:01:19.280\n will leave, right?\n\n1:01:19.280 --> 1:01:21.780\n So if you could just linger on that.\n\n1:01:21.780 --> 1:01:24.460\n So in your sense that taking a break is okay.\n\n1:01:24.460 --> 1:01:27.780\n Yes, taking a break is absolutely okay.\n\n1:01:27.780 --> 1:01:35.100\n And the reason I say that is because we have, we can observe many examples of being, of\n\n1:01:35.100 --> 1:01:40.780\n creators coming back very strong and even stronger after they have taken some sort of\n\n1:01:40.780 --> 1:01:41.780\n break.\n\n1:01:41.780 --> 1:01:50.440\n And so I just want to dispel the myth that this somehow necessarily means that your channel\n\n1:01:50.440 --> 1:01:53.420\n is going to go down or lose views.\n\n1:01:53.420 --> 1:01:55.460\n That is not the case.\n\n1:01:55.460 --> 1:01:59.780\n We know for sure that this is not a necessary outcome.\n\n1:01:59.780 --> 1:02:04.020\n And so we want to encourage people to make sure that they take care of themselves.\n\n1:02:04.020 --> 1:02:06.060\n That is job one, right?\n\n1:02:06.060 --> 1:02:10.340\n You have to look after yourself and your mental health.\n\n1:02:10.340 --> 1:02:19.140\n And I think that it probably, in some of these cases, contributes to better videos once they\n\n1:02:19.140 --> 1:02:20.180\n come back, right?\n\n1:02:20.180 --> 1:02:24.420\n Because a lot of people, I mean, I know myself, if I burn out on something, then I'm probably\n\n1:02:24.420 --> 1:02:30.180\n not doing my best work, even though I can keep working until I pass out.\n\n1:02:30.180 --> 1:02:38.020\n And so I think that the taking a break may even improve the creative ideas that someone\n\n1:02:38.020 --> 1:02:39.020\n has.\n\n1:02:39.020 --> 1:02:40.020\n Okay.\n\n1:02:40.020 --> 1:02:42.820\n I think that's a really important thing to sort of dispel.\n\n1:02:42.820 --> 1:02:47.460\n I think that applies to all of social media, like literally I've taken a break for a day\n\n1:02:47.460 --> 1:02:49.460\n every once in a while.\n\n1:02:49.460 --> 1:02:50.460\n Sorry.\n\n1:02:50.460 --> 1:02:57.620\n Sorry if that sounds like a short time, but even like, sorry, email, just taking a break\n\n1:02:57.620 --> 1:03:02.060\n from email, or only checking email once a day, especially when you're going through\n\n1:03:02.060 --> 1:03:06.500\n something psychologically in your personal life or so on, or really not sleeping much\n\n1:03:06.500 --> 1:03:10.940\n because of work deadlines, it can refresh you in a way that's profound.\n\n1:03:10.940 --> 1:03:11.940\n And so the same applies.\n\n1:03:11.940 --> 1:03:13.100\n It was there when you came back, right?\n\n1:03:13.100 --> 1:03:14.100\n It's there.\n\n1:03:14.100 --> 1:03:17.380\n And it looks different, actually, when you come back.\n\n1:03:17.380 --> 1:03:22.340\n You're sort of brighter eyed with some coffee, everything, the world looks better.\n\n1:03:22.340 --> 1:03:26.400\n So it's important to take a break when you need it.\n\n1:03:26.400 --> 1:03:33.020\n So you've mentioned kind of the YouTube algorithm that isn't E equals MC squared, it's not the\n\n1:03:33.020 --> 1:03:41.500\n single equation, it's potentially sort of more than a million lines of code.\n\n1:03:41.500 --> 1:03:47.940\n Is it more akin to what successful autonomous vehicles today are, which is they're just\n\n1:03:47.940 --> 1:03:55.540\n basically patches on top of patches of heuristics and human experts really tuning the algorithm\n\n1:03:55.540 --> 1:03:58.540\n and have some machine learning modules?\n\n1:03:58.540 --> 1:04:04.740\n Or is it becoming more and more a giant machine learning system with humans just doing a little\n\n1:04:04.740 --> 1:04:06.300\n bit of tweaking here and there?\n\n1:04:06.300 --> 1:04:07.300\n What's your sense?\n\n1:04:07.300 --> 1:04:11.420\n First of all, do you even have a sense of what is the YouTube algorithm at this point?\n\n1:04:11.420 --> 1:04:15.540\n And however much you do have a sense, what does it look like?\n\n1:04:15.540 --> 1:04:21.500\n Well, we don't usually think about it as the algorithm because it's a bunch of systems\n\n1:04:21.500 --> 1:04:24.300\n that work on different services.\n\n1:04:24.300 --> 1:04:29.940\n The other thing that I think people don't understand is that what you might refer to\n\n1:04:29.940 --> 1:04:37.820\n as the YouTube algorithm from outside of YouTube is actually a bunch of code and machine learning\n\n1:04:37.820 --> 1:04:43.620\n systems and heuristics, but that's married with the behavior of all the people who come\n\n1:04:43.620 --> 1:04:44.780\n to YouTube every day.\n\n1:04:44.780 --> 1:04:46.780\n So the people part of the code, essentially.\n\n1:04:46.780 --> 1:04:47.780\n Exactly.\n\n1:04:47.780 --> 1:04:51.580\n If there were no people who came to YouTube tomorrow, then the algorithm wouldn't work\n\n1:04:51.580 --> 1:04:52.580\n anymore.\n\n1:04:52.580 --> 1:04:53.580\n Right.\n\n1:04:53.580 --> 1:04:55.500\n That's the whole part of the algorithm.\n\n1:04:55.500 --> 1:05:00.020\n And so when people talk about, well, the algorithm does this, the algorithm does that, it's sometimes\n\n1:05:00.020 --> 1:05:04.700\n hard to understand, well, it could be the viewers are doing that.\n\n1:05:04.700 --> 1:05:10.520\n And the algorithm is mostly just keeping track of what the viewers do and then reacting to\n\n1:05:10.520 --> 1:05:16.220\n those things in sort of more fine grain situations.\n\n1:05:16.220 --> 1:05:21.280\n And I think that this is the way that the recommendation system and the search system\n\n1:05:21.280 --> 1:05:28.180\n and probably many machine learning systems evolve is you start trying to solve a problem\n\n1:05:28.180 --> 1:05:34.380\n and the first way to solve a problem is often with a simple heuristic.\n\n1:05:34.380 --> 1:05:36.820\n And you want to say, what are the videos we're going to recommend?\n\n1:05:36.820 --> 1:05:39.540\n Well, how about the most popular ones?\n\n1:05:39.540 --> 1:05:43.100\n That's where you start.\n\n1:05:43.100 --> 1:05:48.900\n And over time, you collect some data and you refine your situation so that you're making\n\n1:05:48.900 --> 1:05:54.620\n less heuristics and you're building a system that can actually learn what to do in different\n\n1:05:54.620 --> 1:06:00.760\n situations based on some observations of those situations in the past.\n\n1:06:00.760 --> 1:06:03.600\n And you keep chipping away at these heuristics over time.\n\n1:06:03.600 --> 1:06:10.980\n And so I think that just like with diversity, I think the first diversity measure we took\n\n1:06:10.980 --> 1:06:15.460\n was, okay, not more than three videos in a row from the same channel.\n\n1:06:15.460 --> 1:06:20.700\n It's a pretty simple heuristic to encourage diversity, but it worked, right?\n\n1:06:20.700 --> 1:06:25.300\n Who needs to see four, five, six videos in a row from the same channel?\n\n1:06:25.300 --> 1:06:31.320\n And over time, we try to chip away at that and make it more fine grain and basically\n\n1:06:31.320 --> 1:06:39.380\n have it remove the heuristics in favor of something that can react to individuals and\n\n1:06:39.380 --> 1:06:41.340\n individual situations.\n\n1:06:41.340 --> 1:06:46.660\n So how do you, you mentioned, you know, we know that something worked.\n\n1:06:46.660 --> 1:06:51.860\n How do you get a sense when decisions are kind of A, B testing that this idea was a\n\n1:06:51.860 --> 1:06:55.180\n good one, this was not so good?\n\n1:06:55.180 --> 1:07:00.780\n How do you measure that and across which time scale, across how many users, that kind of\n\n1:07:00.780 --> 1:07:01.780\n thing?\n\n1:07:01.780 --> 1:07:04.540\n Well, you mentioned the A, B experiments.\n\n1:07:04.540 --> 1:07:11.780\n And so just about every single change we make to YouTube, we do it only after we've run\n\n1:07:11.780 --> 1:07:13.800\n a A, B experiment.\n\n1:07:13.800 --> 1:07:24.280\n And so in those experiments, which run from one week to months, we measure hundreds, literally\n\n1:07:24.280 --> 1:07:30.460\n hundreds of different variables and measure changes with confidence intervals in all of\n\n1:07:30.460 --> 1:07:36.900\n them, because we really are trying to get a sense for ultimately, does this improve\n\n1:07:36.900 --> 1:07:38.340\n the experience for viewers?\n\n1:07:38.340 --> 1:07:40.540\n That's the question we're trying to answer.\n\n1:07:40.540 --> 1:07:45.100\n And an experiment is one way because we can see certain things go up and down.\n\n1:07:45.100 --> 1:07:52.700\n So for instance, if we noticed in the experiment, people are dismissing videos less frequently,\n\n1:07:52.700 --> 1:07:58.700\n or they're saying that they're more satisfied, they're giving more videos five stars after\n\n1:07:58.700 --> 1:08:04.540\n they watch them, then those would be indications that the experiment is successful, that it's\n\n1:08:04.540 --> 1:08:08.180\n improving the situation for viewers.\n\n1:08:08.180 --> 1:08:12.900\n But we can also look at other things, like we might do user studies, where we invite\n\n1:08:12.900 --> 1:08:16.060\n some people in and ask them, like, what do you think about this?\n\n1:08:16.060 --> 1:08:17.060\n What do you think about that?\n\n1:08:17.060 --> 1:08:19.620\n How do you feel about this?\n\n1:08:19.620 --> 1:08:22.000\n And other various kinds of user research.\n\n1:08:22.000 --> 1:08:26.140\n But ultimately, before we launch something, we're going to want to run an experiment.\n\n1:08:26.140 --> 1:08:31.260\n So we get a sense for what the impact is going to be, not just to the viewers, but also to\n\n1:08:31.260 --> 1:08:36.640\n the different channels and all of that.\n\n1:08:36.640 --> 1:08:38.180\n An absurd question.\n\n1:08:38.180 --> 1:08:39.180\n Nobody knows.\n\n1:08:39.180 --> 1:08:40.180\n Well, actually, it's interesting.\n\n1:08:40.180 --> 1:08:41.180\n Maybe there's an answer.\n\n1:08:41.180 --> 1:08:45.700\n But if I want to make a viral video, how do I do it?\n\n1:08:45.700 --> 1:08:48.180\n I don't know how you make a viral video.\n\n1:08:48.180 --> 1:08:55.820\n I know that we have in the past tried to figure out if we could detect when a video was going\n\n1:08:55.820 --> 1:08:57.500\n to go viral.\n\n1:08:57.500 --> 1:09:03.100\n And those were, you take the first and second derivatives of the view count and maybe use\n\n1:09:03.100 --> 1:09:07.780\n that to do some prediction.\n\n1:09:07.780 --> 1:09:10.860\n But I can't say we ever got very good at that.\n\n1:09:10.860 --> 1:09:14.660\n Oftentimes we look at where the traffic was coming from.\n\n1:09:14.660 --> 1:09:20.620\n If a lot of the viewership is coming from something like Twitter, then maybe it has\n\n1:09:20.620 --> 1:09:26.940\n a higher chance of becoming viral than if it were coming from search or something.\n\n1:09:26.940 --> 1:09:30.220\n But that was just trying to detect a video that might be viral.\n\n1:09:30.220 --> 1:09:33.620\n How to make one, I have no idea.\n\n1:09:33.620 --> 1:09:38.140\n You get your kids to interrupt you while you're on the news or something.\n\n1:09:38.140 --> 1:09:39.140\n Absolutely.\n\n1:09:39.140 --> 1:09:44.060\n But after the fact, on one individual video, sort of ahead of time predicting is a really\n\n1:09:44.060 --> 1:09:45.060\n hard task.\n\n1:09:45.060 --> 1:09:53.780\n But after the video went viral, in analysis, can you sometimes understand why it went viral?\n\n1:09:53.780 --> 1:09:58.060\n From the perspective of YouTube broadly, first of all, is it even interesting for YouTube\n\n1:09:58.060 --> 1:10:04.540\n that a particular video is viral or does that not matter for the individual, for the experience\n\n1:10:04.540 --> 1:10:05.540\n of people?\n\n1:10:05.540 --> 1:10:11.260\n Well, I think people expect that if a video is going viral and it's something they would\n\n1:10:11.260 --> 1:10:16.460\n be interested in, then I think they would expect YouTube to recommend it to them.\n\n1:10:16.460 --> 1:10:17.460\n Right.\n\n1:10:17.460 --> 1:10:21.820\n So if something's going viral, it's good to just let the wave, let people ride the wave\n\n1:10:21.820 --> 1:10:22.820\n of its violence.\n\n1:10:22.820 --> 1:10:27.780\n Well, I mean, we want to meet people's expectations in that way, of course.\n\n1:10:27.780 --> 1:10:34.180\n So like I mentioned, I hung out with Derek Mueller a while ago, a couple of months back.\n\n1:10:34.180 --> 1:10:37.980\n He's actually the person who suggested I talk to you on this podcast.\n\n1:10:37.980 --> 1:10:38.980\n All right.\n\n1:10:38.980 --> 1:10:40.700\n Well, thank you, Derek.\n\n1:10:40.700 --> 1:10:48.020\n At that time, he just recently posted an awesome science video titled, why are 96 million black\n\n1:10:48.020 --> 1:10:50.500\n balls on this reservoir?\n\n1:10:50.500 --> 1:10:55.500\n And in a matter of, I don't know how long, but like a few days, he got 38 million views\n\n1:10:55.500 --> 1:10:57.960\n and it's still growing.\n\n1:10:57.960 --> 1:11:03.980\n Is this something you can analyze and understand why it happened, this video and you want a\n\n1:11:03.980 --> 1:11:06.140\n particular video like it?\n\n1:11:06.140 --> 1:11:13.220\n I mean, we can surely see where it was recommended, where it was found, who watched it and those\n\n1:11:13.220 --> 1:11:14.220\n sorts of things.\n\n1:11:14.220 --> 1:11:20.300\n So it's actually, sorry to interrupt, it is the video which helped me discover who Derek\n\n1:11:20.300 --> 1:11:21.300\n is.\n\n1:11:21.300 --> 1:11:22.300\n I didn't know who he is before.\n\n1:11:22.300 --> 1:11:28.060\n So I remember, you know, usually I just have all of these technical, boring MIT Stanford\n\n1:11:28.060 --> 1:11:30.580\n talks in my recommendation because that's how I watch.\n\n1:11:30.580 --> 1:11:35.860\n And then all of a sudden there's this black balls and reservoir video with like an excited\n\n1:11:35.860 --> 1:11:40.940\n nerd with like just, why is this being recommended to me?\n\n1:11:40.940 --> 1:11:44.060\n So I clicked on it and watched the whole thing and it was awesome.\n\n1:11:44.060 --> 1:11:48.020\n And then a lot of people had that experience, like why was I recommended this?\n\n1:11:48.020 --> 1:11:52.900\n But they all of course watched it and enjoyed it, which is, what's your sense of this just\n\n1:11:52.900 --> 1:11:58.420\n wave of recommendation that comes with this viral video that ultimately people get enjoy\n\n1:11:58.420 --> 1:11:59.860\n after they click on it?\n\n1:11:59.860 --> 1:12:05.060\n Well, I think it's the system, you know, basically doing what anybody who's recommending something\n\n1:12:05.060 --> 1:12:09.820\n would do, which is you show it to some people and if they like it, you say, okay, well,\n\n1:12:09.820 --> 1:12:12.140\n can I find some more people who are a little bit like them?\n\n1:12:12.140 --> 1:12:14.060\n Okay, I'm going to try it with them.\n\n1:12:14.060 --> 1:12:15.180\n Oh, they like it too.\n\n1:12:15.180 --> 1:12:17.500\n Let me expand the circle some more, find some more people.\n\n1:12:17.500 --> 1:12:19.460\n Oh, it turns out they like it too.\n\n1:12:19.460 --> 1:12:23.140\n And you just keep going until you get some feedback that says that, no, now you've gone\n\n1:12:23.140 --> 1:12:24.140\n too far.\n\n1:12:24.140 --> 1:12:25.940\n These people don't like it anymore.\n\n1:12:25.940 --> 1:12:28.900\n And so I think that's basically what happened.\n\n1:12:28.900 --> 1:12:35.300\n And you asked me about how to make a video go viral or make a viral video.\n\n1:12:35.300 --> 1:12:41.380\n I don't think that if you or I decided to make a video about 96 million balls that it\n\n1:12:41.380 --> 1:12:42.700\n would also go viral.\n\n1:12:42.700 --> 1:12:51.100\n It's possible that Derek made like the canonical video about those black balls in the lake.\n\n1:12:51.100 --> 1:12:52.100\n He did actually.\n\n1:12:52.100 --> 1:12:53.100\n Right.\n\n1:12:53.100 --> 1:12:59.100\n And I don't know whether or not just following along is the secret.\n\n1:12:59.100 --> 1:13:00.100\n Yeah.\n\n1:13:00.100 --> 1:13:01.100\n But it's fascinating.\n\n1:13:01.100 --> 1:13:04.420\n I mean, just like you said, the algorithm sort of expanding that circle and then figuring\n\n1:13:04.420 --> 1:13:09.880\n out that more and more people did enjoy it and that sort of phase shift of just a huge\n\n1:13:09.880 --> 1:13:15.100\n number of people enjoying it and the algorithm quickly, automatically, I assume, figuring\n\n1:13:15.100 --> 1:13:16.100\n that out.\n\n1:13:16.100 --> 1:13:20.300\n I don't know, the dynamics of psychology of that is a beautiful thing.\n\n1:13:20.300 --> 1:13:25.340\n So what do you think about the idea of clipping?\n\n1:13:25.340 --> 1:13:29.780\n Too many people annoyed me into doing it, which is they were requesting it.\n\n1:13:29.780 --> 1:13:36.580\n They said it would be very beneficial to add clips in like the coolest points and actually\n\n1:13:36.580 --> 1:13:37.860\n have explicit videos.\n\n1:13:37.860 --> 1:13:44.420\n Like I'm re uploading a video, like a short clip, which is what the podcasts are doing.\n\n1:13:44.420 --> 1:13:49.180\n Do you see as opposed to, like I also add timestamps for the topics, do you want the\n\n1:13:49.180 --> 1:13:50.180\n clip?\n\n1:13:50.180 --> 1:13:54.820\n Do you see YouTube somehow helping creators with that process or helping connect clips\n\n1:13:54.820 --> 1:14:00.420\n to the original videos or is that just on a long list of amazing features to work towards?\n\n1:14:00.420 --> 1:14:01.420\n Yeah.\n\n1:14:01.420 --> 1:14:08.300\n I mean, it's not something that I think we've done yet, but I can tell you that I think\n\n1:14:08.300 --> 1:14:12.660\n clipping is great and I think it's actually great for you as a creator.\n\n1:14:12.660 --> 1:14:15.100\n And here's the reason.\n\n1:14:15.100 --> 1:14:23.020\n If you think about, I mean, let's say the NBA is uploading videos of its games.\n\n1:14:23.020 --> 1:14:31.060\n Well, people might search for warriors versus rockets or they might search for Steph Curry.\n\n1:14:31.060 --> 1:14:37.740\n And so a highlight from the game in which Steph Curry makes an amazing shot is an opportunity\n\n1:14:37.740 --> 1:14:41.180\n for someone to find a portion of that video.\n\n1:14:41.180 --> 1:14:48.100\n And so I think that you never know how people are going to search for something that you've\n\n1:14:48.100 --> 1:14:49.100\n created.\n\n1:14:49.100 --> 1:14:54.100\n And so you want to, I would say you want to make clips and add titles and things like\n\n1:14:54.100 --> 1:14:58.340\n that so that they can find it as easily as possible.\n\n1:14:58.340 --> 1:15:03.980\n Do you have a dream of a future, perhaps a distant future when the YouTube algorithm\n\n1:15:03.980 --> 1:15:05.580\n figures that out?\n\n1:15:05.580 --> 1:15:12.260\n Sort of automatically detects the parts of the video that are really interesting, exciting,\n\n1:15:12.260 --> 1:15:17.420\n potentially exciting for people and sort of clip them out in this incredibly rich space.\n\n1:15:17.420 --> 1:15:21.260\n Cause if you talk about, if you talk, even just this conversation, we probably covered\n\n1:15:21.260 --> 1:15:29.620\n 30, 40 little topics and there's a huge space of users that would find, you know, 30% of\n\n1:15:29.620 --> 1:15:30.620\n those topics really interesting.\n\n1:15:30.620 --> 1:15:33.460\n And that space is very different.\n\n1:15:33.460 --> 1:15:37.700\n It's something that's beyond my ability to clip out, right?\n\n1:15:37.700 --> 1:15:43.580\n But the algorithm might be able to figure all that out, sort of expand into clips.\n\n1:15:43.580 --> 1:15:46.140\n Do you have a, do you think about this kind of thing?\n\n1:15:46.140 --> 1:15:49.580\n Do you have a hope or dream that one day the algorithm will be able to do that kind of\n\n1:15:49.580 --> 1:15:50.820\n deep content analysis?\n\n1:15:50.820 --> 1:15:57.620\n Well, we've actually had projects that attempt to achieve this, but it really does depend\n\n1:15:57.620 --> 1:16:03.780\n on understanding the video well and our understanding of the video right now is quite crude.\n\n1:16:03.780 --> 1:16:11.360\n And so I think it would be especially hard to do it with a conversation like this.\n\n1:16:11.360 --> 1:16:18.020\n One might be able to do it with, let's say a soccer match more easily, right?\n\n1:16:18.020 --> 1:16:20.620\n You could probably find out where the goals were scored.\n\n1:16:20.620 --> 1:16:25.780\n And then of course you, you need to figure out who it was that scored the goal and, and\n\n1:16:25.780 --> 1:16:28.300\n that might require a human to do some annotation.\n\n1:16:28.300 --> 1:16:35.140\n But I think that trying to identify coherent topics in a transcript, like, like the one\n\n1:16:35.140 --> 1:16:42.540\n of our conversation is, is not something that we're going to be very good at right away.\n\n1:16:42.540 --> 1:16:46.820\n And I was speaking more to the general problem actually of being able to do both a soccer\n\n1:16:46.820 --> 1:16:52.560\n match and our conversation without explicit sort of almost my, my hope was that there\n\n1:16:52.560 --> 1:17:00.700\n exists an algorithm that's able to find exciting things in video.\n\n1:17:00.700 --> 1:17:06.100\n So Google now on Google search will help you find the segment of the video that you're\n\n1:17:06.100 --> 1:17:07.100\n interested in.\n\n1:17:07.100 --> 1:17:13.940\n So if you search for something like how to change the filter in my dishwasher, then if\n\n1:17:13.940 --> 1:17:17.620\n there's a long video about your dishwasher and this is the part where the person shows\n\n1:17:17.620 --> 1:17:22.140\n you how to change the filter, then, then it will highlight that area.\n\n1:17:22.140 --> 1:17:24.180\n And provide a link directly to it.\n\n1:17:24.180 --> 1:17:29.500\n And do you know if, from your recollection, do you know if the thumbnail reflects, like,\n\n1:17:29.500 --> 1:17:32.700\n what's the difference between showing the full video and the shorter clip?\n\n1:17:32.700 --> 1:17:34.820\n Do you know how it's presented in search results?\n\n1:17:34.820 --> 1:17:36.260\n I don't remember how it's presented.\n\n1:17:36.260 --> 1:17:41.860\n And the other thing I would say is that right now it's based on creator annotations.\n\n1:17:41.860 --> 1:17:43.100\n Ah, got it.\n\n1:17:43.100 --> 1:17:45.940\n So it's not the thing we're talking about.\n\n1:17:45.940 --> 1:17:50.020\n But folks are working on the more automatic version.\n\n1:17:50.020 --> 1:17:56.740\n It's interesting, people might not imagine this, but a lot of our systems start by using\n\n1:17:56.740 --> 1:18:00.720\n almost entirely the audience behavior.\n\n1:18:00.720 --> 1:18:07.780\n And then as they get better, the refinement comes from using the content.\n\n1:18:07.780 --> 1:18:15.660\n And I wish, I know there's privacy concerns, but I wish YouTube explored the space, which\n\n1:18:15.660 --> 1:18:21.500\n is sort of putting a camera on the users if they allowed it, right, to study their, like,\n\n1:18:21.500 --> 1:18:27.260\n I did a lot of emotion recognition work and so on, to study actual sort of richer signal.\n\n1:18:27.260 --> 1:18:32.660\n One of the cool things when you upload 360 like VR video to YouTube, and I've done this\n\n1:18:32.660 --> 1:18:37.500\n a few times, so I've uploaded myself, it's a horrible idea.\n\n1:18:37.500 --> 1:18:39.540\n Some people enjoyed it, but whatever.\n\n1:18:39.540 --> 1:18:44.220\n The video of me giving a lecture in 360 with a 360 camera, and it's cool because YouTube\n\n1:18:44.220 --> 1:18:47.460\n allows you to then watch where did people look at?\n\n1:18:47.460 --> 1:18:53.300\n There's a heat map of where, you know, of where the center of the VR experience was.\n\n1:18:53.300 --> 1:18:57.340\n And it's interesting because that reveals to you, like, what people looked at.\n\n1:18:57.340 --> 1:19:00.700\n It's not always what you were expecting.\n\n1:19:00.700 --> 1:19:05.140\n In the case of the lecture, it's pretty boring, it is what we were expecting, but we did a\n\n1:19:05.140 --> 1:19:09.500\n few funny videos where there's a bunch of people doing things, and everybody tracks\n\n1:19:09.500 --> 1:19:10.500\n those people.\n\n1:19:10.500 --> 1:19:13.540\n You know, in the beginning, they all look at the main person and they start spreading\n\n1:19:13.540 --> 1:19:15.220\n around and looking at the other people.\n\n1:19:15.220 --> 1:19:16.220\n It's fascinating.\n\n1:19:16.220 --> 1:19:21.860\n So that kind of, that's a really strong signal of what people found exciting in the video.\n\n1:19:21.860 --> 1:19:26.260\n I don't know how you get that from people just watching, except they tuned out at this\n\n1:19:26.260 --> 1:19:27.260\n point.\n\n1:19:27.260 --> 1:19:32.540\n Like, it's hard to measure this moment was super exciting for people.\n\n1:19:32.540 --> 1:19:34.260\n I don't know how you get that signal.\n\n1:19:34.260 --> 1:19:38.240\n Maybe comment, is there a way to get that signal where this was like, this is when their\n\n1:19:38.240 --> 1:19:42.580\n eyes opened up and they're like, like for me with the Ray Dalio video, right?\n\n1:19:42.580 --> 1:19:48.020\n Like at first I was like, okay, this is another one of these like dumb it down for you videos.\n\n1:19:48.020 --> 1:19:52.660\n And then you like start watching, it's like, okay, there's really crisp, clean, deep explanation\n\n1:19:52.660 --> 1:19:54.380\n of how the economy works.\n\n1:19:54.380 --> 1:19:56.700\n That's where I like set up and started watching, right?\n\n1:19:56.700 --> 1:19:59.800\n That moment, is there a way to detect that moment?\n\n1:19:59.800 --> 1:20:05.180\n The only way I can think of is by asking people to label it.\n\n1:20:05.180 --> 1:20:09.900\n You mentioned that we're quite far away in terms of doing video analysis, deep video\n\n1:20:09.900 --> 1:20:11.820\n analysis.\n\n1:20:11.820 --> 1:20:18.180\n Of course, Google, YouTube, you know, we're quite far away from solving autonomous driving\n\n1:20:18.180 --> 1:20:19.180\n problem too.\n\n1:20:19.180 --> 1:20:20.180\n So it's a...\n\n1:20:20.180 --> 1:20:21.180\n I don't know.\n\n1:20:21.180 --> 1:20:22.180\n I think we're closer to that.\n\n1:20:22.180 --> 1:20:25.340\n Well, the, you know, you never know.\n\n1:20:25.340 --> 1:20:29.260\n And the Wright brothers thought they're never, they're not going to fly for 50 years, three\n\n1:20:29.260 --> 1:20:30.760\n years before they flew.\n\n1:20:30.760 --> 1:20:34.960\n So what are the biggest challenges would you say?\n\n1:20:34.960 --> 1:20:40.920\n Is it the broad challenge of understanding video, understanding natural language, understanding\n\n1:20:40.920 --> 1:20:45.140\n the challenge before the entire machine learning community or just being able to understand\n\n1:20:45.140 --> 1:20:46.140\n data?\n\n1:20:46.140 --> 1:20:51.460\n Is there something specific to video that's even more challenging than understanding natural\n\n1:20:51.460 --> 1:20:53.020\n language understanding?\n\n1:20:53.020 --> 1:20:54.500\n What's your sense of what the biggest challenge is?\n\n1:20:54.500 --> 1:20:56.960\n Video is just so much information.\n\n1:20:56.960 --> 1:21:01.140\n And so precision becomes a real problem.\n\n1:21:01.140 --> 1:21:08.660\n It's like, you know, you're trying to classify something and you've got a million classes\n\n1:21:08.660 --> 1:21:17.820\n and the distinctions among them, at least from a machine learning perspective are often\n\n1:21:17.820 --> 1:21:19.820\n pretty small, right?\n\n1:21:19.820 --> 1:21:28.580\n Like, you know, you need to see this person's number in order to know which player it is.\n\n1:21:28.580 --> 1:21:35.820\n And there's a lot of players or you need to see, you know, the logo on their chest in\n\n1:21:35.820 --> 1:21:38.500\n order to know like which team they play for.\n\n1:21:38.500 --> 1:21:41.900\n And so, and that's just figuring out who's who, right?\n\n1:21:41.900 --> 1:21:45.620\n And then you go further and saying, okay, well, you know, was that a goal?\n\n1:21:45.620 --> 1:21:46.620\n Was it not a goal?\n\n1:21:46.620 --> 1:21:51.600\n Like, is that an interesting moment as you said, or is that not an interesting moment?\n\n1:21:51.600 --> 1:21:53.080\n These things can be pretty hard.\n\n1:21:53.080 --> 1:21:54.080\n So okay.\n\n1:21:54.080 --> 1:21:59.800\n So Yann LeCun, I'm not sure if you're familiar sort of with his current thinking and work.\n\n1:21:59.800 --> 1:22:05.340\n So he believes that self, what he's referring to as self supervised learning will be the\n\n1:22:05.340 --> 1:22:09.740\n solution sort of to achieving this kind of greater level of intelligence.\n\n1:22:09.740 --> 1:22:14.940\n In fact, the thing he's focusing on is watching video and predicting the next frame.\n\n1:22:14.940 --> 1:22:18.220\n So predicting the future of video, right?\n\n1:22:18.220 --> 1:22:24.340\n So for now we're very far from that, but his thought is because it's unsupervised or as\n\n1:22:24.340 --> 1:22:29.540\n he refers to as self supervised, you know, if you watch enough video, essentially if\n\n1:22:29.540 --> 1:22:34.780\n you watch YouTube, you'll be able to learn about the nature of reality, the physics,\n\n1:22:34.780 --> 1:22:40.140\n the common sense reasoning required by just teaching a system to predict the next frame.\n\n1:22:40.140 --> 1:22:42.660\n So he's confident this is the way to go.\n\n1:22:42.660 --> 1:22:50.220\n So for you, from the perspective of just working with this video, how do you think an algorithm\n\n1:22:50.220 --> 1:22:55.900\n that just watches all of YouTube, stays up all day and night watching YouTube would be\n\n1:22:55.900 --> 1:23:02.180\n able to understand enough of the physics of the world about the way this world works,\n\n1:23:02.180 --> 1:23:05.020\n be able to do common sense reasoning and so on?\n\n1:23:05.020 --> 1:23:10.940\n Well, I mean, we have systems that already watch all the videos on YouTube, right?\n\n1:23:10.940 --> 1:23:13.660\n But they're just looking for very specific things, right?\n\n1:23:13.660 --> 1:23:22.140\n They're supervised learning systems that are trying to identify something or classify something.\n\n1:23:22.140 --> 1:23:25.580\n And I don't know if, I don't know if predicting the next frame is really going to get there\n\n1:23:25.580 --> 1:23:32.740\n because I'm not an expert on compression algorithms, but I understand that that's kind of what\n\n1:23:32.740 --> 1:23:37.060\n compression video compression algorithms do is they basically try to predict the next\n\n1:23:37.060 --> 1:23:41.920\n frame and then fix up the places where they got it wrong.\n\n1:23:41.920 --> 1:23:46.180\n And that leads to higher compression than if you actually put all the bits for the next\n\n1:23:46.180 --> 1:23:48.340\n frame there.\n\n1:23:48.340 --> 1:23:53.220\n So I don't know if I believe that just being able to predict the next frame is going to\n\n1:23:53.220 --> 1:24:00.020\n be enough because there's so many frames and even a tiny bit of error on a per frame basis\n\n1:24:00.020 --> 1:24:02.740\n can lead to wildly different videos.\n\n1:24:02.740 --> 1:24:08.860\n So the thing is, the idea of compression is one way to do compression is to describe through\n\n1:24:08.860 --> 1:24:10.460\n text what's contained in the video.\n\n1:24:10.460 --> 1:24:12.220\n That's the ultimate high level of compression.\n\n1:24:12.220 --> 1:24:16.940\n So the idea is traditionally when you think of video image compression, you're trying\n\n1:24:16.940 --> 1:24:22.520\n to maintain the same visual quality while reducing the size.\n\n1:24:22.520 --> 1:24:27.420\n But if you think of deep learning from a bigger perspective of what compression is, is you're\n\n1:24:27.420 --> 1:24:29.600\n trying to summarize the video.\n\n1:24:29.600 --> 1:24:35.460\n And the idea there is if you have a big enough neural network, just by watching the next,\n\n1:24:35.460 --> 1:24:40.720\n trying to predict the next frame, you'll be able to form a compression of actually understanding\n\n1:24:40.720 --> 1:24:42.340\n what's going on in the scene.\n\n1:24:42.340 --> 1:24:47.480\n If there's two people talking, you can just reduce that entire video into the fact that\n\n1:24:47.480 --> 1:24:51.780\n two people are talking and maybe the content of what they're saying and so on.\n\n1:24:51.780 --> 1:24:55.440\n That's kind of the open ended dream.\n\n1:24:55.440 --> 1:25:01.220\n So I just wanted to sort of express that because it's interesting, compelling notion, but it\n\n1:25:01.220 --> 1:25:07.460\n is nevertheless true that video, our world is a lot more complicated than we get a credit\n\n1:25:07.460 --> 1:25:08.460\n for.\n\n1:25:08.460 --> 1:25:12.720\n I mean, in terms of search and discovery, we have been working on trying to summarize\n\n1:25:12.720 --> 1:25:20.520\n videos in text or with some kind of labels for eight years at least.\n\n1:25:20.520 --> 1:25:25.180\n And you know, and we're kind of so, so.\n\n1:25:25.180 --> 1:25:31.460\n So if you were to say the problem is a hundred percent solved and eight years ago was zero\n\n1:25:31.460 --> 1:25:37.300\n percent solved, where are we on that timeline would you say?\n\n1:25:37.300 --> 1:25:38.300\n Yeah.\n\n1:25:38.300 --> 1:25:44.420\n To summarize a video well, maybe less than a quarter of the way.\n\n1:25:44.420 --> 1:25:50.700\n So on that topic, what does YouTube look like 10, 20, 30 years from now?\n\n1:25:50.700 --> 1:25:58.140\n I mean, I think that YouTube is evolving to take the place of TV.\n\n1:25:58.140 --> 1:26:03.700\n I grew up as a kid in the seventies and I watched a tremendous amount of television\n\n1:26:03.700 --> 1:26:09.580\n and I feel sorry for my poor mom because people told her at the time that it was going to\n\n1:26:09.580 --> 1:26:14.380\n rot my brain and that she should kill her television.\n\n1:26:14.380 --> 1:26:21.060\n But anyway, I mean, I think that YouTube is at least for my family, a better version of\n\n1:26:21.060 --> 1:26:22.120\n television, right?\n\n1:26:22.120 --> 1:26:24.560\n It's one that is on demand.\n\n1:26:24.560 --> 1:26:28.740\n It's more tailored to the things that my kids want to watch.\n\n1:26:28.740 --> 1:26:34.360\n And also they can find things that they would never have found on television.\n\n1:26:34.360 --> 1:26:40.360\n And so I think that at least from just observing my own family, that's where we're headed is\n\n1:26:40.360 --> 1:26:46.220\n that people watch YouTube kind of in the same way that I watched television when I was younger.\n\n1:26:46.220 --> 1:26:51.820\n So from a search and discovery perspective, what do you, what are you excited about in\n\n1:26:51.820 --> 1:26:54.060\n the five, 10, 20, 30 years?\n\n1:26:54.060 --> 1:26:55.660\n Like what kind of things?\n\n1:26:55.660 --> 1:26:56.660\n It's already really good.\n\n1:26:56.660 --> 1:27:01.980\n I think it's achieved a lot of, of course we don't know what's possible.\n\n1:27:01.980 --> 1:27:08.140\n So it's the task of search of typing in the text or discovering new videos by the next\n\n1:27:08.140 --> 1:27:09.140\n recommendation.\n\n1:27:09.140 --> 1:27:12.060\n So I personally am really happy with the experience.\n\n1:27:12.060 --> 1:27:18.180\n I continuously, I rarely watch a video that's not awesome from my own perspective, but what's,\n\n1:27:18.180 --> 1:27:19.940\n what else is possible?\n\n1:27:19.940 --> 1:27:21.260\n What are you excited about?\n\n1:27:21.260 --> 1:27:28.840\n Well, I think introducing people to more of what's available on YouTube is not only very\n\n1:27:28.840 --> 1:27:34.380\n important to YouTube and to creators, but I think it will help enrich people's lives\n\n1:27:34.380 --> 1:27:38.780\n because there's a lot that I'm still finding out is available on YouTube that I didn't\n\n1:27:38.780 --> 1:27:39.780\n even know.\n\n1:27:39.780 --> 1:27:46.220\n I've been working YouTube eight years and it wasn't until last year that I learned that,\n\n1:27:46.220 --> 1:27:51.140\n that I could watch USC football games from the 1970s.\n\n1:27:51.140 --> 1:27:55.060\n Like I didn't even know that was possible until last year and I've been working here\n\n1:27:55.060 --> 1:27:56.060\n quite some time.\n\n1:27:56.060 --> 1:27:58.980\n So, you know, what was broken about, about that?\n\n1:27:58.980 --> 1:28:03.060\n That it took me seven years to learn that this stuff was already on YouTube even when\n\n1:28:03.060 --> 1:28:04.580\n I got here.\n\n1:28:04.580 --> 1:28:07.100\n So I think there's a big opportunity there.\n\n1:28:07.100 --> 1:28:16.740\n And then as I said before, you know, we want to make sure that YouTube finds a way to ensure\n\n1:28:16.740 --> 1:28:23.340\n that it's acting responsibly with respect to society and enriching people's lives.\n\n1:28:23.340 --> 1:28:28.260\n So we want to take all of the great things that it does and make sure that we are eliminating\n\n1:28:28.260 --> 1:28:31.820\n the negative consequences that might happen.\n\n1:28:31.820 --> 1:28:37.300\n And then lastly, if we could get to a point where all the videos people watch are the\n\n1:28:37.300 --> 1:28:40.940\n best ones they've ever watched, that'd be outstanding too.\n\n1:28:40.940 --> 1:28:45.660\n Do you see in many senses becoming a window into the world for people?\n\n1:28:45.660 --> 1:28:49.500\n It's especially with live video, you get to watch events.\n\n1:28:49.500 --> 1:28:54.580\n I mean, it's really, it's the way you experience a lot of the world that's out there is better\n\n1:28:54.580 --> 1:28:56.780\n than TV in many, many ways.\n\n1:28:56.780 --> 1:29:00.900\n So do you see becoming more than just video?\n\n1:29:00.900 --> 1:29:06.500\n Do you see creators creating visual experiences and virtual worlds that if I'm, I'm talking\n\n1:29:06.500 --> 1:29:11.000\n crazy now, but sort of virtual reality and entering that space, or is that at least for\n\n1:29:11.000 --> 1:29:14.020\n now totally outside what YouTube is thinking about?\n\n1:29:14.020 --> 1:29:18.100\n I mean, I think Google is thinking about virtual reality.\n\n1:29:18.100 --> 1:29:22.660\n I don't think about virtual reality too much.\n\n1:29:22.660 --> 1:29:28.880\n I know that we would want to make sure that YouTube is there when virtual reality becomes\n\n1:29:28.880 --> 1:29:34.620\n something or if virtual reality becomes something that a lot of people are interested in.\n\n1:29:34.620 --> 1:29:38.220\n But I haven't seen it really take off yet.\n\n1:29:38.220 --> 1:29:39.220\n Take off.\n\n1:29:39.220 --> 1:29:41.260\n Well, the future is wide open.\n\n1:29:41.260 --> 1:29:43.980\n Christos, I've been really looking forward to this conversation.\n\n1:29:43.980 --> 1:29:45.220\n It's been a huge honor.\n\n1:29:45.220 --> 1:29:48.580\n Thank you for answering some of the more difficult questions I've asked.\n\n1:29:48.580 --> 1:29:52.220\n I'm really excited about what YouTube has in store for us.\n\n1:29:52.220 --> 1:29:54.740\n It's one of the greatest products I've ever used and continues.\n\n1:29:54.740 --> 1:29:56.500\n So thank you so much for talking to me.\n\n1:29:56.500 --> 1:29:57.500\n It's my pleasure.\n\n1:29:57.500 --> 1:29:58.500\n Thanks for asking me.\n\n1:29:58.500 --> 1:30:01.500\n Thanks for listening to this conversation.\n\n1:30:01.500 --> 1:30:04.740\n And thank you to our presenting sponsor, Cash App.\n\n1:30:04.740 --> 1:30:05.740\n Download it.\n\n1:30:05.740 --> 1:30:07.380\n Use code LexPodcast.\n\n1:30:07.380 --> 1:30:12.700\n You'll get $10 and $10 will go to FIRST, a STEM education nonprofit that inspires hundreds\n\n1:30:12.700 --> 1:30:17.460\n of thousands of young minds to become future leaders and innovators.\n\n1:30:17.460 --> 1:30:22.500\n If you enjoy this podcast, subscribe on YouTube, give it five stars on Apple Podcast, follow\n\n1:30:22.500 --> 1:30:27.220\n on Spotify, support on Patreon, or simply connect with me on Twitter.\n\n1:30:27.220 --> 1:30:32.540\n And now, let me leave you with some words of wisdom from Marcel Proust.\n\n1:30:32.540 --> 1:30:37.940\n The real voyage of discovery consists not in seeking new landscapes, but in having new\n\n1:30:37.940 --> 1:30:40.140\n eyes.\n\n1:30:40.140 --> 1:30:57.420\n Thank you for listening and hope to see you next time.\n\n"
}