{
  "title": "Ian Hutchinson: Nuclear Fusion, Plasma Physics, and Religion | Lex Fridman Podcast #112",
  "id": "pDSEjaDCtOU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:06.320\n The following is a conversation with Ian Hutchinson, a nuclear engineer and plasma physicist at MIT.\n\n00:06.320 --> 00:12.080\n He has made a number of important contributions in plasma physics, including the magnetic confinement of plasmas,\n\n00:12.080 --> 00:17.760\n seeking to enable fusion reactions, which happens to be the energy source of the stars,\n\n00:17.760 --> 00:25.840\n to be used for practical energy production. Current nuclear reactors, by the way, are based on fission, as we discuss.\n\n00:25.840 --> 00:32.400\n Ian has also written on the philosophy of science and the relationship between science and religion,\n\n00:32.400 --> 00:41.440\n arguing in particular against scientism, which is a negative description of the overreach of the scientific method to questions not amenable to it.\n\n00:41.440 --> 00:46.880\n On this latter topic, I recommend two of his books, his new one, Can a Scientist Believe in Miracles?,\n\n00:46.880 --> 00:50.880\n where he answers more than 200 questions on all aspects of God and science,\n\n00:50.880 --> 00:56.080\n and his earlier book on scientism called Monopolizing Knowledge.\n\n00:56.080 --> 01:02.320\n As you may have seen already, I work hard on having an open mind, always questioning my assumptions,\n\n01:02.320 --> 01:10.400\n and in general marvel at the immense mystery of everything around us and the limitations of at least my mind.\n\n01:10.400 --> 01:15.680\n I'm not religious myself in that I don't go to the synagogue, a church, a mosque,\n\n01:15.680 --> 01:21.360\n but I see the beautiful bond in the community that religion at its best can create.\n\n01:21.360 --> 01:31.760\n I also see, both in scientist and religious leaders, signs of arrogance, hypocrisy, greed, and a will to power.\n\n01:31.760 --> 01:38.480\n We're human. Whether Buddhist, Christian, Hindu, Jewish, Muslim, agnostic, or atheist,\n\n01:38.480 --> 01:43.280\n this podcast is my humble attempt to explore a complicated human nature.\n\n01:43.280 --> 01:50.480\n What Stanislav Lem in his book Solaris called our own labyrinth of dark passages and secret chambers.\n\n01:50.480 --> 01:57.600\n I ask that you try to keep an open mind as well and be patient with the limitations of mind.\n\n01:57.600 --> 02:03.760\n Quick summary of the ads. Two new amazing sponsors, Sunbasket and Powerdot.\n\n02:03.760 --> 02:10.320\n Please consider supporting this podcast by going to sunbasket.com slash lex and use code lex at checkout\n\n02:10.320 --> 02:16.080\n and go into powerdot.com slash lex and use code lex at checkout as well.\n\n02:16.080 --> 02:21.040\n Click the links, buy the stuff if you like. Just visiting the site and considering the purchase\n\n02:21.040 --> 02:25.520\n is really the best way to support this podcast. It's how they know I sent you,\n\n02:25.520 --> 02:28.720\n and based on that they might sponsor the podcast in the future.\n\n02:28.720 --> 02:33.200\n If you enjoy this thing, subscribe on YouTube, review it with five stars on Apple Podcast,\n\n02:33.200 --> 02:38.240\n support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n02:38.240 --> 02:42.160\n As usual, I'll do a few minutes of ads now and never any ads in the middle\n\n02:42.160 --> 02:48.080\n that can break the flow of the conversation. This show sponsored by Sunbasket.\n\n02:48.080 --> 02:57.040\n Visit sunbasket.com slash lex and use code lex to get 35 bucks off your order to support this podcast.\n\n02:57.040 --> 03:01.600\n Sunbasket delivers fresh, healthy, delicious meals straight to your door.\n\n03:01.600 --> 03:07.760\n As you may know, my diet is pretty minimalist, so it's nice to get some healthy variety into the mix.\n\n03:07.760 --> 03:12.880\n They make it super easy, with everything preportioned and ready to prep and cook.\n\n03:12.880 --> 03:17.120\n You can enjoy a delicious, healthy dinner in as little as 15 minutes.\n\n03:17.120 --> 03:21.760\n I just ordered my first set of meals. Haven't gotten them yet, but I can't wait.\n\n03:21.760 --> 03:29.680\n I just finished the 6 mile run and 1000 bodyweight reps and I'm starving,\n\n03:29.680 --> 03:35.440\n but let me risk listing the actual menu items that I ordered because they sound delicious.\n\n03:35.440 --> 03:39.120\n Italian sausages and vegetable skewers with two romescos.\n\n03:39.120 --> 03:42.880\n I don't actually know what romescos are, but the pictures looked awesome.\n\n03:42.880 --> 03:47.200\n And pork fried cauliflower rice with carrots and peas.\n\n03:47.200 --> 03:52.560\n By the way, cauliflower rice is one of my favorite things ever.\n\n03:52.560 --> 04:00.800\n Right now, Sunbasket is offering $35 off your order when you go right now to sunbasket.com slash lex.\n\n04:00.800 --> 04:06.080\n They told me to say right now, with urgency, so pause this podcast and go to the website\n\n04:06.080 --> 04:08.960\n and make the purchase, or just go to the website and check it out.\n\n04:08.960 --> 04:12.320\n And enter a promo code LEX at checkout.\n\n04:12.320 --> 04:16.240\n This show is also sponsored by Power Dot.\n\n04:16.240 --> 04:24.800\n Get it at powerdot.com slash lex and use code LEX at checkout to get 20% off and to support this podcast.\n\n04:24.800 --> 04:26.160\n This thing is amazing.\n\n04:26.160 --> 04:32.400\n It's an eStim electrical stimulation device that I've been using a lot for muscle recovery recently,\n\n04:32.400 --> 04:41.200\n mostly for my shoulders and legs as I've been doing the 1000 bodyweight reps and 6 miles every day as I just finished.\n\n04:41.200 --> 04:47.920\n They call it the smart muscle stimulator, which is true, since the app that goes with it is amazing.\n\n04:47.920 --> 04:52.880\n It has 15 programs for different body parts and guides you through everything you need to do.\n\n04:52.880 --> 04:58.080\n I take recovery really seriously these days and Power Dot has been a powerful addition\n\n04:58.080 --> 05:03.280\n to the whole regime of stretching, ice, massage, and sleep and diet that I do.\n\n05:03.280 --> 05:10.960\n It's used by professional athletes and by slightly insane but mostly normal people like me.\n\n05:10.960 --> 05:15.360\n It's portable so you can throw it in a bag and bring it anywhere.\n\n05:15.360 --> 05:26.960\n Get it at powerdot.com slash lex and use code LEX at checkout to get 20% off on top of the 30 day free trial and to support this podcast.\n\n05:26.960 --> 05:32.000\n And now here's my conversation with Ian Hutchinson.\n\n05:32.000 --> 05:37.040\n Maybe it'd be nice to draw a distinction between nuclear physics and plasma physics.\n\n05:37.040 --> 05:39.040\n What is the distinction?\n\n05:39.040 --> 05:41.680\n Nuclear physics is about the physics of the nucleus.\n\n05:41.680 --> 05:46.240\n And my department, Department of Nuclear Science and Engineering at MIT,\n\n05:46.240 --> 05:54.240\n is very concerned about all the interactions and reactions and consequences of things that go on in the nucleus,\n\n05:54.240 --> 05:59.440\n including nuclear energy, fission energy, which is the nuclear energy that we have already,\n\n05:59.440 --> 06:03.760\n and fusion energy, which is the energy source of the sun and stars,\n\n06:03.760 --> 06:12.000\n which we don't quite know how to turn into practical energy for humankind at the moment.\n\n06:12.000 --> 06:16.720\n That's what my research has mostly been aimed at.\n\n06:16.720 --> 06:22.880\n But plasmas are essentially the fourth state of matter.\n\n06:22.880 --> 06:29.920\n So if you think about solid, liquid, gas, plasma is the fourth of those states of matter.\n\n06:29.920 --> 06:36.160\n And it's actually the state of matter which one reaches if one raises the temperature.\n\n06:36.160 --> 06:40.800\n So cold things, you know, like ice are solid.\n\n06:40.800 --> 06:43.520\n Liquids are hotter water.\n\n06:43.520 --> 06:48.720\n And if you heat water beyond 100 degrees Celsius, it becomes gas.\n\n06:48.720 --> 06:51.520\n Well, that's true of most substances.\n\n06:51.520 --> 07:01.920\n And plasma is a state of matter in which the electrons are unbound from the nuclei.\n\n07:01.920 --> 07:06.080\n So they become separate from the nuclei and can move separately.\n\n07:06.080 --> 07:12.160\n So we have positively charged nuclei and we have negatively charged electrons.\n\n07:12.160 --> 07:17.680\n The net is still electrically neutral.\n\n07:17.680 --> 07:25.200\n But a plasma conducts electricity, has all sorts of important properties that are associated\n\n07:25.200 --> 07:27.120\n with that separation.\n\n07:27.120 --> 07:29.280\n And that's what plasmas are all about.\n\n07:29.280 --> 07:34.240\n And the reason why my department is interested in plasma physics very strongly is because\n\n07:34.240 --> 07:37.920\n most things, well, for one thing, most things in the universe are plasma.\n\n07:37.920 --> 07:40.480\n The vast majority of matter in the universe is plasma.\n\n07:40.480 --> 07:48.880\n But most particularly, stars and the sun are plasmas because they're very hot.\n\n07:48.880 --> 07:54.800\n And it's only in very hot states that nuclear fusion reactions take place.\n\n07:54.800 --> 08:00.920\n And we want to understand how to implement those kind of phenomena on Earth.\n\n08:00.920 --> 08:05.040\n Maybe another distinction we want to try to get at is the difference between fission\n\n08:05.040 --> 08:06.040\n and fusion.\n\n08:06.040 --> 08:09.080\n So you mentioned fusion is the kind of reaction happening in the sun.\n\n08:09.080 --> 08:11.200\n So what's fission and what's fusion?\n\n08:11.200 --> 08:18.400\n Well, fission is taking heavy elements like uranium and breaking them up.\n\n08:18.400 --> 08:23.040\n And it turns out that that process of breaking up heavy elements releases energy.\n\n08:23.040 --> 08:25.240\n What does it mean to be a heavy element?\n\n08:25.240 --> 08:33.260\n It means that there are many nuclear particles in the nucleus itself, neutrons and protons\n\n08:33.260 --> 08:42.480\n in the nucleus itself so that in the case of uranium, there are 92 protons in each nucleus\n\n08:42.480 --> 08:49.920\n and even more neutrons so that the total number of nucleons in the nucleus, nucleons is short\n\n08:49.920 --> 08:58.160\n for either a proton or a neutron, the total number might be 235, that's U235, or it might\n\n08:58.160 --> 09:01.720\n be 238, that's U238.\n\n09:01.720 --> 09:03.320\n So those are heavy elements.\n\n09:03.320 --> 09:10.400\n Light elements, by contrast, have very few nucleons, protons or neutrons in the nucleus.\n\n09:10.400 --> 09:12.840\n Hydrogen is the lightest nucleus.\n\n09:12.840 --> 09:14.800\n It has one proton.\n\n09:14.800 --> 09:19.480\n There are actually slightly heavier forms of hydrogen, isotopes.\n\n09:19.480 --> 09:26.280\n Deuterium has a proton and a neutron and tritium has a proton and two neutrons.\n\n09:26.280 --> 09:31.040\n So it has a total of three nucleons in the nucleus.\n\n09:31.040 --> 09:38.520\n While taking light elements like isotopes of hydrogen and not breaking them up but actually\n\n09:38.520 --> 09:45.680\n fusing them together, reacting them together to produce heavier elements, typically helium,\n\n09:45.680 --> 09:52.680\n which is helium is a nucleus which has two protons and two neutrons, that also releases\n\n09:52.680 --> 10:00.120\n energy and that or reactions like that, making heavier elements from lighter elements is\n\n10:00.120 --> 10:05.160\n what mostly powers the sun and stars.\n\n10:05.160 --> 10:14.520\n Both fusion and fission release approximately a million times more energy per unit mass\n\n10:14.520 --> 10:16.360\n than chemical reactions.\n\n10:16.360 --> 10:22.040\n So a chemical reaction means take hydrogen, take oxygen, react them together, let's say,\n\n10:22.040 --> 10:25.000\n and get water, that releases energy.\n\n10:25.000 --> 10:29.600\n The energy released in a chemical reaction like that or the burning of coal or on oil\n\n10:29.600 --> 10:35.940\n or whatever else is about a million times less per unit mass than what is released in\n\n10:35.940 --> 10:37.460\n nuclear reactions.\n\n10:37.460 --> 10:38.960\n So but it's hard to do.\n\n10:38.960 --> 10:44.240\n It requires very high energy of impact.\n\n10:44.240 --> 10:46.500\n And actually, it's very easy to understand why.\n\n10:46.500 --> 10:52.360\n And that is that those two nuclei, if they're both, let's say, hydrogen nuclei, one is,\n\n10:52.360 --> 10:58.160\n let's say, deuterium and the other is, let's say, tritium, they're both electrically charged.\n\n10:58.160 --> 11:02.080\n And they're positively charged, so they like charges repel.\n\n11:02.080 --> 11:03.620\n Everyone knows that, right?\n\n11:03.620 --> 11:09.980\n So basically, to get them close enough together to react, you have to overcome the repulsion,\n\n11:09.980 --> 11:15.800\n the electric repulsion of the two nuclei from one another.\n\n11:15.800 --> 11:20.180\n And you have to get them extremely close to one another in order for the nuclear forces\n\n11:20.180 --> 11:25.900\n to overtake the electrical forces and actually form a new nucleus.\n\n11:25.900 --> 11:31.320\n And so one requires very high energies of impact in order for reactions to take place.\n\n11:31.320 --> 11:37.940\n And those high energies of impact correspond to very high temperatures of random motion.\n\n11:37.940 --> 11:41.000\n So that's why you can do something like that in the sun.\n\n11:41.000 --> 11:42.660\n So we can build the sun.\n\n11:42.660 --> 11:43.740\n That's one way to do it.\n\n11:43.740 --> 11:47.260\n But on Earth, how do you create a fusion reaction?\n\n11:47.260 --> 11:48.260\n Yeah.\n\n11:48.260 --> 11:49.260\n Well, nature's.\n\n11:49.260 --> 11:50.260\n Engineering wise.\n\n11:50.260 --> 12:00.960\n Nature's fusion reactors are indeed the stars, and they are very hot in the center.\n\n12:00.960 --> 12:07.080\n And they reach the point where they release more energy from those reactions than they\n\n12:07.080 --> 12:10.920\n lose by radiation and transport to the surface and so forth.\n\n12:10.920 --> 12:15.740\n And that's a state of ignition.\n\n12:15.740 --> 12:19.340\n And that's what we have to achieve to give net energy.\n\n12:19.340 --> 12:21.220\n That's like lighting a fire.\n\n12:21.220 --> 12:27.100\n If you have a bundle of sticks and you hold a match up to it and you see smoke coming\n\n12:27.100 --> 12:33.980\n from the sticks, but you take the match away and the sticks just fizzle out.\n\n12:33.980 --> 12:38.060\n That's not the reason they fizzled out is that, yes, they were burning, there was smoke\n\n12:38.060 --> 12:41.300\n coming from them, but they were not ignited.\n\n12:41.300 --> 12:45.700\n But if you are able to take the match away and they keep burning and they are generating\n\n12:45.700 --> 12:51.700\n enough heat to keep themselves hot and hence keep the reactions going, that's chemical\n\n12:51.700 --> 12:52.700\n ignition.\n\n12:52.700 --> 13:00.140\n But what we need to do, what the stars do in order to generate nuclear fusion energy\n\n13:00.140 --> 13:02.460\n is they are ignited.\n\n13:02.460 --> 13:08.180\n They are generated enough energy to keep themselves hot.\n\n13:08.180 --> 13:13.700\n And that's what we've got to do on Earth if we're going to make fusion work on Earth.\n\n13:13.700 --> 13:22.560\n But it's much harder to do on Earth than it is in a star because we need temperatures\n\n13:22.560 --> 13:31.140\n of order tens of millions of degrees Celsius in order for the reactions to go fast enough\n\n13:31.140 --> 13:37.580\n to generate enough energy to keep it going.\n\n13:37.580 --> 13:44.220\n And so if you've got something that's tens of millions of degrees Celsius and you want\n\n13:44.220 --> 13:48.580\n to keep it all together and keep the heat in long enough to have enough reactions taking\n\n13:48.580 --> 13:57.400\n place, you can't just put it in a bottle, plastic or glass, it would be gone in milliseconds.\n\n13:57.400 --> 14:05.340\n So you have to have some nonmaterial mechanism of confining the plasma.\n\n14:05.340 --> 14:10.940\n In the case of stars, that nonmaterial force is gravity.\n\n14:10.940 --> 14:16.180\n So gravity is what holds the star together, it's what holds the plasma in long enough\n\n14:16.180 --> 14:22.640\n for it to react and sustain itself by the fusion reactions.\n\n14:22.640 --> 14:24.580\n But on Earth, gravity is extremely weak.\n\n14:24.580 --> 14:27.420\n I mean, I don't mean to say we don't fall, yes, we fall.\n\n14:27.420 --> 14:35.700\n But the mutual gravitational attraction of small objects is very weak compared with the\n\n14:35.700 --> 14:40.300\n electrical repulsion or any other force that you can think about on Earth.\n\n14:40.300 --> 14:48.020\n And so we need a stronger force to keep the plasma together, to confine it.\n\n14:48.020 --> 14:55.460\n And the predominant attempt at making fusion work on Earth is to use magnetic fields to\n\n14:55.460 --> 14:57.460\n confine the plasma.\n\n14:57.460 --> 15:03.580\n And that's what I've worked on for much, essentially most of my career, is to understand how we\n\n15:03.580 --> 15:11.880\n can and how best we can confine these incredibly hot gases, plasmas, using magnetic fields\n\n15:11.880 --> 15:18.740\n with the ultimate objective of releasing fusion energy on Earth and generating electricity\n\n15:18.740 --> 15:21.780\n with it and powering our society with it.\n\n15:21.780 --> 15:23.540\n A dumb question.\n\n15:23.540 --> 15:28.460\n So on top of the magnetic fields, do you also need the plastic water bottle walls or is\n\n15:28.460 --> 15:30.340\n it purely magnetic fields?\n\n15:30.340 --> 15:36.780\n Well, actually what we do need walls, those walls must be kept away from the plasma because\n\n15:36.780 --> 15:42.340\n otherwise they'd be melted or the plasma must be kept away from them inside of them.\n\n15:42.340 --> 15:48.460\n But the main purpose of the walls is not to keep the plasma in, it's to keep the atmosphere\n\n15:48.460 --> 15:50.300\n out.\n\n15:50.300 --> 15:56.380\n So if we want to do it on Earth where there's air, we want the plasma to consist of hydrogen\n\n15:56.380 --> 15:59.740\n isotopes or other things, the things we're trying to react.\n\n15:59.740 --> 16:06.300\n And by the way, the density of those plasmas, at least in magnetic confinement fusion, is\n\n16:06.300 --> 16:07.300\n very low.\n\n16:07.300 --> 16:13.740\n It's maybe a million times less than the density of air in this room.\n\n16:13.740 --> 16:19.260\n So in order for a fusion reactor like that to work, you have to keep all of the air out\n\n16:19.260 --> 16:20.620\n and just keep the plasma in.\n\n16:20.620 --> 16:24.300\n So yes, there are other things, but those are things that are relatively easy.\n\n16:24.300 --> 16:29.180\n I mean, making a vacuum these days is technologically quite straightforward.\n\n16:29.180 --> 16:31.500\n We know how to do that.\n\n16:31.500 --> 16:38.540\n What we don't quite know how to do is to make a confinement device that isolates the plasma\n\n16:38.540 --> 16:43.900\n well enough so that it's able to keep itself burning with its own reaction.\n\n16:43.900 --> 16:47.420\n So maybe can you talk about what a tokamak is?\n\n16:47.420 --> 16:54.060\n The Russian acronym from which the word tokamak is built just means toroidal magnetic chamber.\n\n16:54.060 --> 17:00.700\n So it's a toroidal chamber, a torus is a geometric shape which is like a doughnut with a hole\n\n17:00.700 --> 17:02.740\n down the middle.\n\n17:02.740 --> 17:10.640\n And so it's the meat of the doughnut, that's the torus, and it's got a magnetic field.\n\n17:10.640 --> 17:13.320\n So that's really all tokamak means.\n\n17:13.320 --> 17:22.180\n But the particular configuration that is very widespread and is the sort of best prospect\n\n17:22.180 --> 17:28.100\n in the least in the near term for making fusion energy work is one in which there's a very\n\n17:28.100 --> 17:35.940\n strong magnetic field the long way around the doughnut, around the torus.\n\n17:35.940 --> 17:40.280\n So you've got to imagine that there's this doughnut shape with an embedded magnetic field\n\n17:40.280 --> 17:43.300\n just going round and round the long way.\n\n17:43.300 --> 17:53.300\n The big advantage of that is that plasma particles when they're in the presence of a magnetic\n\n17:53.300 --> 17:59.780\n field feel strong forces from the magnetic field and those forces make the particles\n\n17:59.780 --> 18:04.360\n gyrate around the direction of the magnetic field line.\n\n18:04.360 --> 18:12.320\n So basically the particles follow helical orbits following like a spring that's directed\n\n18:12.320 --> 18:13.980\n along the magnetic field.\n\n18:13.980 --> 18:18.640\n Well if you make the magnetic field go inside this toroidal chamber and just simply go round\n\n18:18.640 --> 18:27.840\n and round the chamber then because of this helical orbit the particles can't move fast\n\n18:27.840 --> 18:33.920\n across the magnetic field but they can move very quickly along the magnetic field.\n\n18:33.920 --> 18:38.680\n And if you have a magnetic field that doesn't leave the chamber it doesn't matter if they\n\n18:38.680 --> 18:44.260\n move along the magnetic field it doesn't mean they're going to exit the chamber.\n\n18:44.260 --> 18:52.440\n But if you just had a straight magnetic field for example coming from a Helmholtz coil or\n\n18:52.440 --> 18:57.800\n a bar magnet then you'd have to have ends that would come to the ends of the chamber\n\n18:57.800 --> 19:02.960\n somewhere and the particles would hit the ends and they would lose their energy.\n\n19:02.960 --> 19:07.460\n So that's why it's toroidal and that's why we have a strong magnetic field.\n\n19:07.460 --> 19:14.840\n It's providing a confinement against motion in the in the direction that would lead the\n\n19:14.840 --> 19:16.960\n particles to leave the chamber.\n\n19:16.960 --> 19:21.580\n It turns out that here we're getting a little bit technical but turns out that a toroidal\n\n19:21.580 --> 19:27.680\n field alone is not enough and so you need more fields to produce true true confinement\n\n19:27.680 --> 19:32.720\n of plasma and we get those by passing a current as well through the plasma itself.\n\n19:32.720 --> 19:34.840\n I can make sure it stays on track.\n\n19:34.840 --> 19:40.800\n Well that what that does is makes the field lines themselves into much bigger helices\n\n19:40.800 --> 19:47.560\n and that for reasons that are too complicated to explain that clinches the confinement of\n\n19:47.560 --> 19:53.400\n the particles at least in terms of their single particle orbits so they don't leave the chamber.\n\n19:53.400 --> 20:00.480\n So when the particles are flying along this this this donut the inside of the donut are\n\n20:00.480 --> 20:03.960\n they what's where's the generation of the energy coming from?\n\n20:03.960 --> 20:07.480\n Are they smashing into each other?\n\n20:07.480 --> 20:12.520\n Yeah eventually I mean in a fusion reactor there will be deuterons and tritons and they\n\n20:12.520 --> 20:13.800\n will be smashing in.\n\n20:13.800 --> 20:19.080\n They will be very hot there'll be a hundred million degrees Celsius or something so they're\n\n20:19.080 --> 20:24.960\n moving thermally with very large thermal energies in random directions and they will collide\n\n20:24.960 --> 20:28.400\n with one another and have fusion reactions.\n\n20:28.400 --> 20:33.080\n When those fusion reactions take place energy is released large amounts of energy is released\n\n20:33.080 --> 20:35.260\n in the form of particles.\n\n20:35.260 --> 20:39.060\n One of the particles that's released is an alpha particle which is also charged and it's\n\n20:39.060 --> 20:45.120\n also confined and that alpha particle stays in the in the in the donut and heats the other\n\n20:45.120 --> 20:49.720\n particles that are in that donut so it transfers its energy to those and they it keeps them\n\n20:49.720 --> 20:50.720\n hot.\n\n20:50.720 --> 20:54.880\n There are there's some leaking of heat all the time a little bit of radiation some transport\n\n20:54.880 --> 20:56.320\n and so forth.\n\n20:56.320 --> 21:00.440\n There's also a neutron released from that reaction the neutron carries out four fifths\n\n21:00.440 --> 21:06.240\n of the fusion energy and that will have to be captured in a blanket that surrounds the\n\n21:06.240 --> 21:17.600\n chamber in which we take the energy drive some kind of electrical generator from you\n\n21:17.600 --> 21:25.320\n know thermal thermal engine gas turbine or something like that and power the power.\n\n21:25.320 --> 21:26.480\n You got energy.\n\n21:26.480 --> 21:28.200\n So where do we stand?\n\n21:28.200 --> 21:29.200\n Where do we stand?\n\n21:29.200 --> 21:35.440\n I'm getting this thing to be something that actually works that generates energy.\n\n21:35.440 --> 21:42.200\n Well there have been experiments that have generated net nuclear energies or nuclear\n\n21:42.200 --> 21:49.720\n powers in the vicinity of you know a few tens of megawatts for a few seconds.\n\n21:49.720 --> 21:56.360\n So that's you know 10 megajoules that's not much energy it's a few donuts worth of energy\n\n21:56.360 --> 21:57.360\n okay.\n\n21:57.360 --> 22:02.600\n A literal donut.\n\n22:02.600 --> 22:11.120\n But we have studied how well tokamaks can find plasmas and so we now understand in rather\n\n22:11.120 --> 22:19.160\n great detail the way they work and we're able to predict what is going to be required in\n\n22:19.160 --> 22:24.680\n order to build a tokamak that becomes self sustaining that becomes essentially ignited\n\n22:24.680 --> 22:29.560\n or very so close to ignited that it doesn't matter.\n\n22:29.560 --> 22:38.160\n And at the moment at least if you use the modest magnetic field values still very strong\n\n22:38.160 --> 22:44.720\n but limited magnetic field values you have to build a very big device.\n\n22:44.720 --> 22:53.300\n And so we are at the moment worldwide fusion research is at the moment in the process of\n\n22:53.300 --> 22:58.080\n building a very big experiment that's located in the south of France.\n\n22:58.080 --> 23:04.460\n It's called ITER which means the way or just means the international tokamak experimental\n\n23:04.460 --> 23:08.440\n reactor if you like.\n\n23:08.440 --> 23:14.720\n And that experiment is designed to reach this burning plasma state and to generate about\n\n23:14.720 --> 23:21.360\n 500 megawatts of fusion power for hundreds of seconds at a time.\n\n23:21.360 --> 23:24.400\n It'll still only be an experiment.\n\n23:24.400 --> 23:28.480\n It won't put electricity on the grid or anything like that.\n\n23:28.480 --> 23:34.400\n It's to figure out whether it works and what the remaining engineering challenges are.\n\n23:34.400 --> 23:36.200\n It's a scientific experiment.\n\n23:36.200 --> 23:41.440\n It won't be engineered to run round the clock and so on and so forth which ultimately one\n\n23:41.440 --> 23:46.260\n needs to do in order to make something that's practical for generating electricity.\n\n23:46.260 --> 23:53.960\n But it will be the first demonstration on earth of a controlled fusion reaction for\n\n23:53.960 --> 23:55.280\n you know long time periods.\n\n23:55.280 --> 23:59.000\n Is that exciting to you?\n\n23:59.000 --> 24:05.400\n It's been an objective that is in many ways motivated my entire career and the career\n\n24:05.400 --> 24:09.960\n of many people like me in the field.\n\n24:09.960 --> 24:15.640\n I have to admit though that one of the problems with ITER is that it's an extremely big and\n\n24:15.640 --> 24:23.760\n expensive and long time to build experiment and so it won't even come into operation until\n\n24:23.760 --> 24:31.200\n about 2025 even though it's been being built for 10 years and it was designed for 30 years\n\n24:31.200 --> 24:33.860\n before that.\n\n24:33.860 --> 24:40.520\n And so that's actually one of the big disappointments of my career in a certain sense which is that\n\n24:40.520 --> 24:47.480\n we won't get to burning fusion reaction until well past the first operation of ITER and\n\n24:47.480 --> 24:52.560\n whether I'm alive or not I don't know but I certainly will be well and truly retired\n\n24:52.560 --> 24:54.480\n by the time that happens.\n\n24:54.480 --> 24:59.920\n And so when I realized maybe some years ago that that was going to be the case it was\n\n24:59.920 --> 25:03.520\n a discouragement to me let's put it like that.\n\n25:03.520 --> 25:09.760\n But if we can try to look maybe in a ridiculous kind of way look into a hundred years from\n\n25:09.760 --> 25:14.520\n now two hundred years five hundred years from now and we you know there's folks like Elon\n\n25:14.520 --> 25:18.640\n Musk trying to travel outside the solar system.\n\n25:18.640 --> 25:22.640\n I mean the amount of energy we need for some of the exciting things we want to do in this\n\n25:22.640 --> 25:29.320\n world if we look again hundred years from now seems to be a very large amount.\n\n25:29.320 --> 25:38.640\n So do you think fusion energy will eventually sometime into your retirement will be basically\n\n25:38.640 --> 25:41.320\n behind most of the things we do?\n\n25:41.320 --> 25:47.200\n Look I absolutely think that fusion research is completely justified.\n\n25:47.200 --> 25:51.880\n In fact we should be spending more time and effort on it than we currently do.\n\n25:51.880 --> 25:59.580\n But it isn't going to be a magic bullet that somehow solves all the problems of energy.\n\n25:59.580 --> 26:04.240\n By the way that's a generic statement you can make about any energy source in my view.\n\n26:04.240 --> 26:09.560\n I think it's a grave mistake to think that science of any sort is suddenly going to find\n\n26:09.560 --> 26:13.840\n a magic bullet for meeting all the energy needs of society or any of the other needs\n\n26:13.840 --> 26:15.840\n of society by the way.\n\n26:15.840 --> 26:21.280\n But and we can talk about that later.\n\n26:21.280 --> 26:25.620\n But fusion is very worthwhile and we should be doing it.\n\n26:25.620 --> 26:32.920\n And so my disappointment that I just expressed was in a certain sense of personal disappointment.\n\n26:32.920 --> 26:36.600\n I do think that fusion energy is a terrific challenge.\n\n26:36.600 --> 26:42.400\n It's very difficult to bring the energy source of the sun and stars down to earth.\n\n26:42.400 --> 26:47.560\n This does contrast in a certain sense with fission energy.\n\n26:47.560 --> 26:54.480\n By contrast fission energy efficient to build a fission reactor proved to be amazingly easy.\n\n26:54.480 --> 27:00.900\n You know we did it within a few years of discovering nuclear fission.\n\n27:00.900 --> 27:07.740\n People had figured out how to build a reactor and did so during the Second World War.\n\n27:07.740 --> 27:11.920\n Which is by the way fission is how the current nuclear power plants work.\n\n27:11.920 --> 27:21.520\n And so we have nuclear energy today because fission reactors are relatively easy to build.\n\n27:21.520 --> 27:26.340\n What's hard is getting the materials and that's just as well because if everyone could get\n\n27:26.340 --> 27:30.680\n those materials there would be weapons proliferation and so forth.\n\n27:30.680 --> 27:38.360\n But it wasn't all that long after even the discovery of nuclear fission that fission\n\n27:38.360 --> 27:44.160\n reactors were built and fission reactors of course operated before we had weapons.\n\n27:44.160 --> 27:57.120\n So I think nuclear power is obviously important to meet the energy challenges of our age.\n\n27:57.120 --> 28:04.080\n It is completely intrinsically completely CO2 emissions free.\n\n28:04.080 --> 28:09.360\n And in fact the wastes that come from nuclear power whether it's fission or fusion for that\n\n28:09.360 --> 28:18.240\n matter are so moderate in quantity that we shouldn't really be worried about them.\n\n28:18.240 --> 28:23.540\n I mean yes fission products are highly radioactive and we need to keep them away from people\n\n28:23.540 --> 28:27.360\n but there's so little of them it's that keeping them away from people is not particularly\n\n28:27.360 --> 28:28.680\n difficult.\n\n28:28.680 --> 28:36.160\n And so while people complain a lot about the drawbacks of fission energy I think most of\n\n28:36.160 --> 28:39.160\n those complaints are ill informed.\n\n28:39.160 --> 28:45.760\n We can talk about you know the challenges and the disasters if you like of fission reactors\n\n28:45.760 --> 28:53.760\n but I think fission in the near term offers a terrific opportunity for environmentally\n\n28:53.760 --> 28:59.320\n friendly energy which in the world as a whole is rapidly being taken advantage of.\n\n28:59.320 --> 29:03.840\n You know China and India and places like that are rapidly building fission plants.\n\n29:03.840 --> 29:08.000\n We're not rapidly building fission plants in the US although we are actually building\n\n29:08.000 --> 29:12.200\n two at the moment, two new ones.\n\n29:12.200 --> 29:17.200\n But we do still get 20 percent of our electricity from fission energy and we could get a lot\n\n29:17.200 --> 29:18.200\n more.\n\n29:18.200 --> 29:19.680\n So it's clean energy.\n\n29:19.680 --> 29:20.960\n So it's clean energy.\n\n29:20.960 --> 29:28.640\n Now again the concern is there's a very popular HBO show and just came out on Chernobyl.\n\n29:28.640 --> 29:32.480\n There's the Three Mile Island, there's Fukushima, that's the most recent disaster.\n\n29:32.480 --> 29:37.560\n So there's a kind of a concern of yeah I mean nuclear disasters.\n\n29:37.560 --> 29:42.280\n Is that, what do you make of that kind of concern especially if we look into the future\n\n29:42.280 --> 29:44.880\n of fission energy based reactors?\n\n29:44.880 --> 29:48.600\n Well first of all let me say one or two words about the contrast between fission and fusion\n\n29:48.600 --> 29:53.160\n and then we'll come on to the question of the disasters and so forth.\n\n29:53.160 --> 30:00.500\n Fission does have some drawbacks and they're largely to do with four main areas.\n\n30:00.500 --> 30:06.960\n One is do we have enough uranium or other fissile fuels to supply our energy needs for\n\n30:06.960 --> 30:08.040\n a long time?\n\n30:08.040 --> 30:16.080\n The answer to that is we know we have enough uranium to support fission energy worldwide\n\n30:16.080 --> 30:23.200\n for thousands of years but maybe not for millions of years okay.\n\n30:23.200 --> 30:25.680\n So that's resources.\n\n30:25.680 --> 30:29.120\n Secondly there are issues to do with wastes.\n\n30:29.120 --> 30:36.600\n Fission wastes are highly radioactive and some of them are volatile and so for example\n\n30:36.600 --> 30:44.840\n in Fukushima the problem was that some fraction of the fission wastes were volatilized and\n\n30:44.840 --> 30:55.040\n went out as a cloud and polluted areas with cesium 137, strontium 90 and things like that.\n\n30:55.040 --> 30:58.000\n So that's a challenge of fission.\n\n30:58.000 --> 31:07.040\n There's a problem of safety beyond that and that is that in fission it's hard to turn\n\n31:07.040 --> 31:09.040\n the reactor off.\n\n31:09.040 --> 31:14.880\n When you stop the nuclear reactions there is still a lot of heat being liberated from\n\n31:14.880 --> 31:20.600\n the fission products and that is actually what the problem was at Fukushima.\n\n31:20.600 --> 31:27.920\n The Fukushima reactors were shut down the moment that the earthquake took place and\n\n31:27.920 --> 31:29.920\n they were shut down safely.\n\n31:29.920 --> 31:35.540\n What then happened after that at Fukushima was you know there was this enormous tidal\n\n31:35.540 --> 31:45.960\n wave many tens of meters high that came through and destroyed the electricity grid feed to\n\n31:45.960 --> 31:52.480\n the Fukushima reactors and their cooling was then turned off and it was the after heat\n\n31:52.480 --> 31:57.840\n of the turned off reactors that eventually caused the problems that led to release.\n\n31:57.840 --> 32:06.680\n And so that's a safety concern and then finally there's a problem of proliferation and that\n\n32:06.680 --> 32:13.920\n is that fission reactors need fissile fuel and the technologies for producing and enriching\n\n32:13.920 --> 32:24.200\n and so forth the fuels can be used by bad actors to generate the materials needed for\n\n32:24.200 --> 32:27.240\n a nuclear weapon and that's a very serious concern.\n\n32:27.240 --> 32:29.840\n So those are the four problems.\n\n32:29.840 --> 32:34.440\n Fusion has major advantages in respect of all of those problems.\n\n32:34.440 --> 32:45.900\n It has more longer term fuel resources, it has far more benign waste issues, the radioactivity\n\n32:45.900 --> 32:51.340\n from fusion reactions is at least a hundred times less than it is from fission reactions.\n\n32:51.340 --> 32:57.280\n It has essentially none of this after heat problem because it doesn't produce fission\n\n32:57.280 --> 33:02.800\n products that are highly radioactive and generating their own heat when it's turned off.\n\n33:02.800 --> 33:07.840\n In fact the hard part of fusion is turning it on not turning it off.\n\n33:07.840 --> 33:15.320\n And finally you don't need the same fission technology to make fusion work and so it's\n\n33:15.320 --> 33:19.360\n got terrific advantages from the point of view of proliferation control.\n\n33:19.360 --> 33:28.360\n So those are the four main issues which make fusion seem attractive technologically because\n\n33:28.360 --> 33:31.120\n they address some of the problems of fission energy.\n\n33:31.120 --> 33:36.600\n I don't mean to say that fission energy is overwhelmingly problematic but clearly there\n\n33:36.600 --> 33:41.920\n have been catastrophes associated with fission reactors.\n\n33:41.920 --> 33:47.600\n Fukushima actually is I think in many ways are often overstated as a disaster because\n\n33:47.600 --> 33:53.840\n after all nobody was killed by the reactors essentially, zero.\n\n33:53.840 --> 34:02.280\n And that's in the context of a disaster and tsunami that killed between 15 and 20,000\n\n34:02.280 --> 34:05.720\n people instantane more or less instantaneously.\n\n34:05.720 --> 34:17.080\n So you know in the scale of risks one should take the view that in my estimation that fission\n\n34:17.080 --> 34:19.560\n energy came out of that looking pretty good.\n\n34:19.560 --> 34:20.560\n Okay.\n\n34:20.560 --> 34:22.720\n Of course that's not the popular conception.\n\n34:22.720 --> 34:23.720\n Okay.\n\n34:23.720 --> 34:24.720\n Yes that's good.\n\n34:24.720 --> 34:31.100\n I mean with a lot of things that threaten our well being we seem to be very bad users\n\n34:31.100 --> 34:32.440\n of data.\n\n34:32.440 --> 34:38.800\n We seem to be very scared of shock attacks and not at all scared of car accidents and\n\n34:38.800 --> 34:40.520\n this kind of miscalculation.\n\n34:40.520 --> 34:46.840\n And I think from everything I understand nuclear energy, fission based energy goes into that\n\n34:46.840 --> 34:47.840\n category.\n\n34:47.840 --> 34:54.240\n It's one of the safest, one of the cleanest forms of energy and yet the PR, whoever does\n\n34:54.240 --> 34:59.640\n the PR for nuclear energy has a hard job ahead of them at the moment.\n\n34:59.640 --> 35:03.400\n Well I think part of that is their association with nuclear weapons because when you say\n\n35:03.400 --> 35:07.600\n the word nuclear people don't instantly think about nuclear energy, they think about nuclear\n\n35:07.600 --> 35:09.440\n weapons.\n\n35:09.440 --> 35:14.320\n And so there is perhaps a natural tendency to do that.\n\n35:14.320 --> 35:20.040\n But yes I agree with you, people are very poor at estimating risks and they react emotionally\n\n35:20.040 --> 35:22.880\n not rationally in most of these situations.\n\n35:22.880 --> 35:27.940\n Can we talk about nuclear weapons just for a little bit?\n\n35:27.940 --> 35:33.200\n So fission is the kind of reaction that's central to the nuclear weapons we have today?\n\n35:33.200 --> 35:35.240\n That's what sets them off.\n\n35:35.240 --> 35:36.660\n That's what sets them off.\n\n35:36.660 --> 35:41.220\n So if we look at the hydrogen bomb maybe you can say how these different weapons work.\n\n35:41.220 --> 35:47.320\n So the earliest nuclear weapons, the nuclear bombs that were dropped on Japan etc. etc.\n\n35:47.320 --> 35:50.040\n were pure fission weapons.\n\n35:50.040 --> 35:57.960\n They used enriched uranium or plutonium and their energy is essentially entirely derived\n\n35:57.960 --> 36:00.880\n from fission reactions.\n\n36:00.880 --> 36:09.840\n But it was early realized that more energy was available if one could somehow combine\n\n36:09.840 --> 36:17.360\n a fission bomb with fusion reactions.\n\n36:17.360 --> 36:26.880\n Because the fusion reactions give more energy per unit mass than fission reactions.\n\n36:26.880 --> 36:31.640\n And this was called the super, you might have heard of the expression the super or more\n\n36:31.640 --> 36:35.640\n simply hydrogen bombs.\n\n36:35.640 --> 36:40.320\n Bombs which use isotopes of hydrogen and the fusion reactions associated with them.\n\n36:40.320 --> 36:41.840\n Like you said it's hard to turn on.\n\n36:41.840 --> 36:47.600\n It's hard to turn on because you need very high temperatures and you need confinement\n\n36:47.600 --> 36:50.920\n of that long enough for the reactions to take place.\n\n36:50.920 --> 37:03.320\n And so a bomb actually, a thermonuclear bomb or a hydrogen bomb has essentially a chemical\n\n37:03.320 --> 37:15.040\n implosion which then sets off a fission explosion which then sets off and compresses hydrogen\n\n37:15.040 --> 37:22.000\n isotopes and other things, which I don't know because I've never had a security clearance.\n\n37:22.000 --> 37:28.240\n So I can't betray any secrets about weapons because I've never been party to them because\n\n37:28.240 --> 37:33.280\n I know a lot about this problem I can guess.\n\n37:33.280 --> 37:36.600\n And sets off fusion reactions in the middle.\n\n37:36.600 --> 37:41.700\n So that's basically it's that sequence of things which produce these enormous multi\n\n37:41.700 --> 37:47.660\n megaton bombs that have very large yields.\n\n37:47.660 --> 37:52.200\n And so fusion alone can't get you there.\n\n37:52.200 --> 38:00.480\n It is actually possible to set off or to try to set off little fusion bombs alone without\n\n38:00.480 --> 38:08.940\n the surrounding fission explosion and that is what is called laser fusion.\n\n38:08.940 --> 38:17.880\n So another approach to fusion which actually is mostly researched in the weapons complex,\n\n38:17.880 --> 38:24.760\n the national labs and so forth because it's more associated with the technologies of weapons\n\n38:24.760 --> 38:26.080\n is inertial fusion.\n\n38:26.080 --> 38:32.280\n So if you decide instead of trying to make your plasma just sit there in this Taurus\n\n38:32.280 --> 38:37.480\n and in the tokamak and be controlled steady state with a magnetic field, if you're willing\n\n38:37.480 --> 38:43.840\n to accept that I'll just set off an explosion and then I'll gather the energy from that\n\n38:43.840 --> 38:49.720\n somehow I don't quite know how but let's not ask that question too much.\n\n38:49.720 --> 38:58.440\n Then it is possible to imagine generating fusion alone explosions and the way you do\n\n38:58.440 --> 39:06.160\n it is you take some small amount of deuterium tritium fuel you bombard it with energy from\n\n39:06.160 --> 39:12.200\n all sides and this is what the lasers are used for extremely powerful at lasers which\n\n39:12.200 --> 39:16.680\n compresses the pellet of fusion and heats it.\n\n39:16.680 --> 39:21.220\n It compresses it to such a high density and temperature that the reactions take place\n\n39:21.220 --> 39:25.680\n very very quickly and in fact they can take place so quickly that it's all over with before\n\n39:25.680 --> 39:27.120\n the thing flies apart.\n\n39:27.120 --> 39:28.120\n Wow.\n\n39:28.120 --> 39:29.120\n And that is.\n\n39:29.120 --> 39:30.120\n Heated up really fast.\n\n39:30.120 --> 39:33.240\n That is inertial fusion okay.\n\n39:33.240 --> 39:36.680\n Is that useful for energy generation for outside?\n\n39:36.680 --> 39:41.560\n Not yet I mean there are those people who think it will be but you may have heard of\n\n39:41.560 --> 39:46.920\n the big experiment called the National Ignition Facility which was built at Livermore starting\n\n39:46.920 --> 39:53.320\n in the late 1990s and has been in operation since around about 2010.\n\n39:53.320 --> 39:59.800\n It was designed with the claim that it would reach ignition fusion ignition in this pulsed\n\n39:59.800 --> 40:04.940\n form where the reactions have got over with so quickly before the thing whole thing flies\n\n40:04.940 --> 40:05.940\n apart.\n\n40:05.940 --> 40:09.880\n It didn't actually reach ignition and it doesn't look as if it will although you know we never\n\n40:09.880 --> 40:14.360\n know maybe people figure out how to make it work better.\n\n40:14.360 --> 40:20.840\n But the answer is in principle it seems possible to reach ignition in this way maybe not with\n\n40:20.840 --> 40:22.680\n that particular laser facility.\n\n40:22.680 --> 40:31.580\n Are you surprised that we humans haven't destroyed ourselves given that we've invented such powerful\n\n40:31.580 --> 40:33.080\n tools of destruction?\n\n40:33.080 --> 40:39.200\n Like what do you make of the fact that for many decades we've had nuclear weapons now\n\n40:39.200 --> 40:44.280\n speaking about estimating risk at least to me it's exceptionally surprising I was born\n\n40:44.280 --> 40:53.360\n in the Soviet Union that big egos of the big leaders when rubbing up against each other\n\n40:53.360 --> 40:59.880\n have not created the kind of destruction everybody was afraid of for decades.\n\n40:59.880 --> 41:03.960\n Well I must say I'm extremely thankful that it hasn't I don't know whether I'm surprised\n\n41:03.960 --> 41:09.800\n about it I've never thought about it and from the point of view of is it surprising that\n\n41:09.800 --> 41:14.360\n we've we've avoided it I'm just very thankful that we have I think that there is a sense\n\n41:14.360 --> 41:22.040\n in which cooler heads have prevailed at crucial moments I think there is also a sense in which\n\n41:22.040 --> 41:30.800\n you know mutually assured destruction has in fact worked as a policy to restrain the\n\n41:30.800 --> 41:38.560\n great powers from going to war and in fact you know the the the fact that we haven't\n\n41:38.560 --> 41:49.680\n had a world war you know since the 1940s is perhaps even attributable to nuclear weapons\n\n41:49.680 --> 41:59.220\n in a kind of strange and peculiar way but I think humans are deeply flawed and sinful\n\n41:59.220 --> 42:06.540\n people and I certainly don't feel that we're guaranteed that it's going to go on like this.\n\n42:06.540 --> 42:12.280\n And we'll talk about the sort of the biggest picture view of it all but let me just ask\n\n42:12.280 --> 42:18.320\n in terms of your worries of if we look a hundred years from now we're in the middle of what\n\n42:18.320 --> 42:26.160\n is now a natural pandemic that from the looks of it as fortunately as not as bad as it could\n\n42:26.160 --> 42:30.960\n possibly been if you look at the Spanish flu if you look at the history of pandemics if\n\n42:30.960 --> 42:35.400\n you look at all the possible pandemics that could have been that folks like Bill Gates\n\n42:35.400 --> 42:42.840\n are exceptionally terrified about we've I know many people are suffering but it's better\n\n42:42.840 --> 42:48.320\n than it could have been so and now we're talking about nuclear weapons in terms of existential\n\n42:48.320 --> 42:58.440\n threats to us as sinful humans what worries you the most is it nuclear weapons is is it\n\n42:58.440 --> 43:05.280\n natural pandemics engineered pandemics nanotechnology in my field of artificial intelligence some\n\n43:05.280 --> 43:12.440\n people are afraid of killer robots and robots yeah is there do you think in those existential\n\n43:12.440 --> 43:21.680\n terms and do any aspect to any of those things were you I am certainly not confident that\n\n43:21.680 --> 43:29.600\n my children and grandchildren will experience the benefits of civilization that I have enjoyed\n\n43:29.600 --> 43:37.240\n I think it's possible for our civilizations to break down catastrophically I also think\n\n43:37.240 --> 43:44.160\n that it's possible for our civilizations to break down progressively and I think they\n\n43:44.160 --> 43:50.760\n will if we continue to have the explosion of population on the planet that we currently\n\n43:50.760 --> 43:58.640\n have I mean it's it's quite it's quite wrong to think of our problems as mostly being co2\n\n43:58.640 --> 44:05.000\n if we can just solve co2 then we can go on having this you know continually expanding\n\n44:05.000 --> 44:10.960\n economy everywhere in the world of course you can't do that okay I mean there is a finite\n\n44:10.960 --> 44:16.320\n you know bearing capacity of our planet on the resources of our planet on the resources\n\n44:16.320 --> 44:21.480\n of our planet and and we can't continue to do that so I think there are lots of technical\n\n44:21.480 --> 44:32.080\n reasons why a continually expanding economy and and and civilization is impossible and\n\n44:32.080 --> 44:37.560\n therefore actually I'm as much nervous about the fact that our population is eight billion\n\n44:37.560 --> 44:44.680\n or something right now worldwide as I am about the fact that you know a few million people\n\n44:44.680 --> 44:51.380\n would be would be killed by COVID 19 I mean I don't want to be callous about this but\n\n44:51.380 --> 44:57.840\n from the big picture it seems like that's much more of a problem over population people\n\n44:57.840 --> 45:05.680\n not dying is ultimately more of a problem than people dying so you know that probably\n\n45:05.680 --> 45:11.780\n sounds incredibly callous to your listeners but I think it's simply you know a sober assessment\n\n45:11.780 --> 45:18.840\n of the situation is there is there ways from the way those eight billion or seven billion\n\n45:18.840 --> 45:24.800\n or whatever the number is live that could make it sustainable you know because you've\n\n45:24.800 --> 45:29.720\n kind of implied there's a kind of we have especially in the West this kind of capitalist\n\n45:29.720 --> 45:36.880\n view of really consuming a lot of resources is there a way to like if you could change\n\n45:36.880 --> 45:43.440\n one thing or a few things what would you change to make this life make it more likely that\n\n45:43.440 --> 45:50.520\n your grandchildren have a better life than you well okay so let's talk a bit about energy\n\n45:50.520 --> 45:55.680\n because that's something I know a lot a lot about having thought about it most of my career\n\n45:55.680 --> 46:02.580\n in order to reach steady state co2 level okay that's acceptable in terms of global climate\n\n46:02.580 --> 46:10.960\n change and so on and so forth we need to reduce our carbon emissions by at least a factor\n\n46:10.960 --> 46:21.240\n of ten worldwide okay what's more you know the average energy consumption and hence co2\n\n46:21.240 --> 46:28.720\n emission of people in the world is less than a tenth of what we per capita of them what\n\n46:28.720 --> 46:35.280\n we have in the West in America and Europe and so forth so if you have in mind some utopia\n\n46:35.280 --> 46:43.280\n in the future where we've reached a sustainable use of energy and we've also reached a situation\n\n46:43.280 --> 46:50.080\n in which there is far less inequity in the world in the sense that people have share\n\n46:50.080 --> 46:58.000\n the energy resources more uniformly then what that is equivalent to would be to reduce the\n\n46:58.000 --> 47:05.120\n co2 emissions in Western economies not by a factor of ten but by a factor of a hundred\n\n47:05.120 --> 47:10.520\n in other words has to go down to one percent of what it is now okay so you know when people\n\n47:10.520 --> 47:16.440\n talk about you know let's use natural gas because you know maybe it only uses sixty\n\n47:16.440 --> 47:21.600\n percent of the energy of coal it's complete nonsense that's not not even scratching the\n\n47:21.600 --> 47:30.440\n surface of what we would need to do so you know is that going to be feasible I very much\n\n47:30.440 --> 47:40.640\n doubt it and therefore I actually doubt that we can reach a level of energy of fossil energy\n\n47:40.640 --> 47:47.340\n use that is one percent of the current use in the West without totally dramatic changes\n\n47:47.340 --> 47:53.600\n either in you know our society our use of of energy and so forth which actually of course\n\n47:53.600 --> 47:58.160\n is much of that energy is used for producing food and so on and so forth so it's actually\n\n47:58.160 --> 48:03.520\n not so obvious that we can we can get we can cut down our energy usage by that factor or\n\n48:03.520 --> 48:09.800\n we've got to reduce the human population so you run up against that number that's increasing\n\n48:09.800 --> 48:17.680\n still and you don't think that could be it's not it's not that it's not it's not depressing\n\n48:17.680 --> 48:28.600\n it's it's difficult like many truths are do you have a hope that there could be a technological\n\n48:28.600 --> 48:37.120\n solution in short no there is no technological solution to for example for population control\n\n48:37.120 --> 48:41.920\n I mean we have the technology just you know to prevent ourselves bearing children that's\n\n48:41.920 --> 48:49.880\n not a problem technology is in okay solved the challenge is society the challenge is\n\n48:49.880 --> 48:57.160\n human choices the challenge is almost entirely human and sociological not technology not\n\n48:57.160 --> 49:01.480\n technology and when people thought talk about energy they thought they think that there's\n\n49:01.480 --> 49:06.720\n some kind of technological magic bullet for this but there isn't okay and and there isn't\n\n49:06.720 --> 49:10.280\n for the reasons I just mentioned not because it's obvious there isn't but actually there\n\n49:10.280 --> 49:18.080\n isn't and and in in any case that it's true of energy it's true of pollution it's true\n\n49:18.080 --> 49:25.040\n of human population it's true of most of the big challenges in our society are not scientific\n\n49:25.040 --> 49:32.320\n or technological challenges they're human sociological challenges and that's why I think\n\n49:32.320 --> 49:38.440\n it's a terrible mistake even for folks like me who work at you know well the high temple\n\n49:38.440 --> 49:45.160\n of science and technology in in America and maybe in the galaxy yeah I mean you know it's\n\n49:45.160 --> 49:52.760\n it's MIT it's at MIT best university in the world it's it's a terrible mistake if we give\n\n49:52.760 --> 49:57.760\n the impression that technology is going to solve it all technology will make tremendous\n\n49:57.760 --> 50:04.200\n contributions and I think it's it's worth working on it but it's a disaster if you think\n\n50:04.200 --> 50:09.040\n it's going to solve all of our problems and and actually you know I've written a whole\n\n50:09.040 --> 50:15.300\n book about the question of of scientism and the and the over emphasis on science both\n\n50:15.300 --> 50:20.840\n as a way of of solving problems through technology but also as a way of gaining knowledge I think\n\n50:20.840 --> 50:27.560\n it's not all the knowledge there is either yeah I think that book and your journey there\n\n50:27.560 --> 50:33.120\n is fascinating so maybe you can go there can can you tell me about your on a personal side\n\n50:33.120 --> 50:39.600\n your the personal journey of your faith of Christianity and your relationship with with\n\n50:39.600 --> 50:46.080\n God with religion in general yeah in my in my latest book Can a Scientist Believe in\n\n50:46.080 --> 50:52.300\n Miracles I I give a first I devote most of the first chapter to telling how how I became\n\n50:52.300 --> 50:58.280\n a Christian why I became a Christian I I didn't grow up as a Christian which is fascinating\n\n50:58.280 --> 51:02.940\n I mean you didn't grow up as a Christian so you you've discovered the beauty of God and\n\n51:02.940 --> 51:07.960\n physics at the same time concurrent that's a very poetic way of putting it but yes I\n\n51:07.960 --> 51:13.440\n would accept that I became a Christian when I was an undergraduate at Cambridge University\n\n51:13.440 --> 51:18.900\n I I had you know I had gone to a school in which there was religion kind of was part\n\n51:18.900 --> 51:25.040\n of the society there were prayers and at the at the at the daily you know gathering of\n\n51:25.040 --> 51:30.240\n the of the students of the assembly of the students but I but I didn't really believe\n\n51:30.240 --> 51:34.800\n it I just sort of went along with it and it wasn't particularly you know aggressive or\n\n51:34.800 --> 51:41.160\n benign you know benign it just sort of was there but I didn't believe it I didn't didn't\n\n51:41.160 --> 51:45.560\n make much sense to me but when I but I came across Christians from time to time and when\n\n51:45.560 --> 51:54.120\n I went to Cambridge University two of my closest friends turned out were Christians and I think\n\n51:54.120 --> 52:03.240\n it was that was the most important influence on me that that here were two people who were\n\n52:03.240 --> 52:11.440\n really smart like me I'm giving you my yeah my impressions the way I the way I felt at\n\n52:11.440 --> 52:21.560\n the time and and they thought Christianity made sense and and you know testified to its\n\n52:21.560 --> 52:28.120\n significance in their lives and so that was a very important influence on me and I and\n\n52:28.120 --> 52:34.480\n ultimately I mean the reason I I hadn't I hadn't I didn't see Christianity as some\n\n52:34.480 --> 52:38.880\n kind of great evil the way it's sometimes portrayed by the by the radical atheists of\n\n52:38.880 --> 52:43.880\n this century I mean I think that's nonsense but but but I so I think there were certain\n\n52:43.880 --> 52:48.000\n attractive things if you go to a university like Cambridge you know you're surrounded\n\n52:48.000 --> 52:55.240\n by by by Western culture you know from from about you know the 15th century onwards and\n\n52:55.240 --> 53:03.160\n that saturated with Christian art and architecture and so forth and so it's hard it's hard not\n\n53:03.160 --> 53:09.800\n to recognize that Christianity is in fact the foundation of Western society in Western\n\n53:09.800 --> 53:17.880\n culture most Western civilization so so I mean maybe I was in that sense favorably disposed\n\n53:17.880 --> 53:22.600\n towards Christianity as a religion but as a personal faith it didn't mean anything\n\n53:22.600 --> 53:30.320\n to me but I became convinced really of two things one is that the evidence for the resurrection\n\n53:30.320 --> 53:35.440\n of Jesus Christ is actually rather good I mean it's not a proof it's not kind of some\n\n53:35.440 --> 53:40.120\n some kind of scientific demonstrate or mathematical demonstration but it's actually extremely\n\n53:40.120 --> 53:44.520\n good it's not scientific evidence by and large it's historical evidence historical evidence\n\n53:44.520 --> 53:51.360\n yeah so that was one thing and the other thing that came to me when I was at Cambridge it\n\n53:51.360 --> 54:01.520\n became clear that Christianity ultimately is not you know some kind of moral theory\n\n54:01.520 --> 54:08.760\n or philosophy or something like that it is or elite or at least it claims to be a personal\n\n54:08.760 --> 54:14.880\n relationship with God which is made possible you know by what Jesus did and on the cross\n\n54:14.880 --> 54:21.440\n and his life and his teaching and and it's a personal call to a relationship with God\n\n54:21.440 --> 54:26.920\n and that had I'd never thought of it in those terms when I was you know when I was younger\n\n54:26.920 --> 54:33.760\n and that that thought became attractive to me I mean I think most people find the person\n\n54:33.760 --> 54:39.380\n of Christ and just teachings you know compelling insert in a certain sense what do you mean\n\n54:39.380 --> 54:44.840\n by personal do you mean personal for you like a relationship like it's a meditative\n\n54:44.840 --> 54:52.640\n like you specifically you Ian have a connection with God and and then the other side you say\n\n54:52.640 --> 54:59.000\n personal with the actual body the person of Jesus Christ so all of those things what do\n\n54:59.000 --> 55:05.240\n you mean by personal connection and why that was well so as I'm sorry for the stupid questions\n\n55:05.240 --> 55:11.200\n no it's okay no problem as a Christian I believe that I have a relationship with God which\n\n55:11.200 --> 55:18.360\n is best expressed by saying that it's personal and that comes about because you know Jesus\n\n55:18.360 --> 55:31.000\n through his acts has reconciled me with God me a sinner me someone full of sins of failings\n\n55:31.000 --> 55:36.360\n of ways in which I don't live up to even my own ideals let alone the ideals of a holy\n\n55:36.360 --> 55:47.120\n God have been reconciled to the creator of everything and and so Christians myself included\n\n55:47.120 --> 55:53.040\n believe that prayer is in a certain sense a connection with God and there are times\n\n55:53.040 --> 55:59.000\n when I have felt you know that God spoke to me I don't mean necessarily orally in words\n\n55:59.000 --> 56:09.380\n but showed me things or enlighten me or inspired me in ways that I I attribute to him so I\n\n56:09.380 --> 56:17.120\n see it as a as a two way you know relationship in a certain sense of course it's a very asymmetrical\n\n56:17.120 --> 56:21.880\n relationship but nevertheless Christians think that it's a two way it's a two way street\n\n56:21.880 --> 56:28.000\n we're not just talking into the air when we say we won't I'm going to pray for someone\n\n56:28.000 --> 56:33.960\n in this two way communication is there a way that you could try to describe on a podcast\n\n56:33.960 --> 56:46.120\n what is God what is God like in your view if you try to describe is it a force is it\n\n56:46.120 --> 56:53.200\n a set is it a for you intellectually is a set of metaphors that you use to reason about\n\n56:53.200 --> 57:02.040\n the world is it is it is it kind of a computer that does some computation that's the infinitely\n\n57:02.040 --> 57:08.320\n powerful computer or is it like Santa Claus a guy with a with a beard on the cloud like\n\n57:08.320 --> 57:15.480\n I don't mean I don't mean what God actually is I mean in your limited cognitive capacity\n\n57:15.480 --> 57:21.120\n as a human what do you actually what do you find helpful for thinking of what God actually\n\n57:21.120 --> 57:27.040\n looks like what is God well let me start by saying none of the above okay I mean clearly\n\n57:27.040 --> 57:37.400\n God in the Christian God the God of Abraham Isaac and Jacob etc it is is not any of those\n\n57:37.400 --> 57:45.100\n things because all of those things you just mentioned are phenomena or or or entities\n\n57:45.100 --> 57:52.800\n in the created world and the most fundamental thing about monotheism as you know Abraham\n\n57:52.800 --> 58:00.640\n and Moses and so forth handed it down is that God is not an entity within the creation within\n\n58:00.640 --> 58:06.280\n the universe that God is the creator of it all and that's what Genesis first two chapters\n\n58:06.280 --> 58:11.880\n of Genesis is really about is it's not it's not about telling us you know how God created\n\n58:11.880 --> 58:18.260\n the world it's about telling us and telling the early Hebrews that God created the world\n\n58:18.260 --> 58:23.360\n okay and that therefore he is not you know simply an entity within it on the other hand\n\n58:23.360 --> 58:31.120\n you know our finite minds have a pretty hard time encompassing that so so one has to therefore\n\n58:31.120 --> 58:38.700\n work in terms of metaphors and images and and so forth and I think we would know very\n\n58:38.700 --> 58:47.200\n little about who God is if we if it was simply up if we were simply left to our own devices\n\n58:47.200 --> 58:51.600\n you know if if we were just you know here you are you're in the universe try to figure\n\n58:51.600 --> 58:56.800\n out who made it and and so forth well you know philosophers think they can do a little\n\n58:56.800 --> 59:03.600\n bit of that maybe and theologians think that they can do a little bit more but but Christians\n\n59:03.600 --> 59:11.720\n think that God has actually helped us along a lot by revealing himself and and we say\n\n59:11.720 --> 59:18.020\n that he's revealed himself supremely in the person of Jesus Christ and so you know when\n\n59:18.020 --> 59:25.200\n Jesus says to his disciples if you've seen me you've seen the Father then that is in\n\n59:25.200 --> 59:31.800\n a certain sense a watchword for answering this question for Christians it is that supremely\n\n59:31.800 --> 59:37.800\n if we want to help ourselves understand who God really is we look to Jesus we look to\n\n59:37.800 --> 59:48.680\n what he did we look to what he said and so forth and we believe that he is one with the\n\n59:48.680 --> 59:53.720\n Father and that's why we believe you know in the Trinity I mean it's basically because\n\n59:53.720 --> 1:00:01.700\n that revelation is extremely central to Christian belief and teaching so in that in that sense\n\n1:00:01.700 --> 1:00:07.520\n through Jesus there was a that's kind of a historical moment that's profound that's\n\n1:00:07.520 --> 1:00:15.000\n really powerful do you also think that God makes himself seen in less obvious ways in\n\n1:00:15.000 --> 1:00:26.240\n our world today absolutely absolutely I mean it's it's certainly been the outlook of Jews\n\n1:00:26.240 --> 1:00:32.760\n and Christians throughout history that God is seen in the creation that we when we look\n\n1:00:32.760 --> 1:00:41.120\n at the creation we see to some extent the wonder the majesty the might of the person\n\n1:00:41.120 --> 1:00:49.320\n or the entity but the person who created it and and that's a way in which scientists\n\n1:00:49.320 --> 1:00:58.040\n particularly have over over the ages and certainly over most of the last five centuries since\n\n1:00:58.040 --> 1:01:05.040\n the scientific revolution scientists have seen in a certain sense the hand of God in\n\n1:01:05.040 --> 1:01:10.660\n creation I mean this leads us perhaps to a different discussion but I mean it's it's\n\n1:01:10.660 --> 1:01:19.800\n remarkable to me how influential Christianity and religion in generally has been in science\n\n1:01:19.800 --> 1:01:24.240\n yeah most of the scientists through history as if you described I mean God has been a\n\n1:01:24.240 --> 1:01:29.960\n very big part of their life and their work certainly up until the at the beginning of\n\n1:01:29.960 --> 1:01:34.920\n the 20th century that was the case so maybe this is a good time to can you tell me what\n\n1:01:34.920 --> 1:01:41.520\n scientism is yeah I mean the short answer is that by scientism we mean we mean the\n\n1:01:41.520 --> 1:01:48.280\n belief that science is all the real knowledge there is that's a shorthand there are lots\n\n1:01:48.280 --> 1:01:52.700\n of different facets of it and what which one can explore and the book in which I explored\n\n1:01:52.700 --> 1:02:00.200\n it most most thoroughly was actually an earlier book called monopolizing knowledge and and\n\n1:02:00.200 --> 1:02:06.640\n the purpose of that title is to is to draw attention to the fact that in our society\n\n1:02:06.640 --> 1:02:15.760\n as a whole in particularly in the West today we we have grown so reliant on science that\n\n1:02:15.760 --> 1:02:23.760\n we that we tend to put aside other ways of getting to know things and so of course at\n\n1:02:23.760 --> 1:02:31.800\n MIT we are focused on science and we do focus on it very much but the truth is that there\n\n1:02:31.800 --> 1:02:38.440\n are many ways of getting to know things in our world know things reliably in our world\n\n1:02:38.440 --> 1:02:45.120\n and a lot of them are not science so scientism in my view is a terrible intellectual error\n\n1:02:45.120 --> 1:02:49.280\n it's to believe it's the belief that somehow the methods of science as we develop them\n\n1:02:49.280 --> 1:02:56.340\n with you know experiments and in the end they it relies particularly upon reproducibility\n\n1:02:56.340 --> 1:03:02.600\n in the world and on a kind of clarity that comes from measurements and mathematics and\n\n1:03:02.600 --> 1:03:10.280\n related types of of skills those powerful though they are for finding out about the\n\n1:03:10.280 --> 1:03:16.640\n world are not all the knowledge do not give us all the knowledge we we have and there's\n\n1:03:16.640 --> 1:03:24.800\n many other forms of knowledge and the illustration that I usually use to to try to help people\n\n1:03:24.800 --> 1:03:28.640\n to think about this is to say well look let's think about human history I mean to what extent\n\n1:03:28.640 --> 1:03:34.360\n can human history be discovered scientifically the answer is essentially can't because and\n\n1:03:34.360 --> 1:03:40.060\n the reason is because human history is not reproducible you can't do reproducible experiments\n\n1:03:40.060 --> 1:03:46.920\n or observations and and go back and you know try it over again it's it's a one off thing\n\n1:03:46.920 --> 1:03:53.240\n you know the history is full of unique events and and so you you know you you can't hope\n\n1:03:53.240 --> 1:04:00.140\n to do history using the methods of science yeah I mean in some sense history is a story\n\n1:04:00.140 --> 1:04:05.760\n of miracles I mean they don't have to do with God it's just uniqueness is anyway unique\n\n1:04:05.760 --> 1:04:12.160\n events unique events and that science doesn't like that because it's unique events by their\n\n1:04:12.160 --> 1:04:18.060\n very definition are not reproducible can I ask sort of a tricky question I don't even\n\n1:04:18.060 --> 1:04:25.460\n know what atheist or atheism is but is it possible for somebody to be an atheist and\n\n1:04:25.460 --> 1:04:33.520\n avoid slipping into scientism oh yeah absolutely I mean it I mean there these are two separate\n\n1:04:33.520 --> 1:04:39.480\n things okay I'm quite sure there are many people who don't believe in God and yet recognize\n\n1:04:39.480 --> 1:04:44.200\n that there are many different ways of we get knowledge you know some is history some is\n\n1:04:44.200 --> 1:04:54.440\n sociology economics politics philosophy art history language literature etc etc there\n\n1:04:54.440 --> 1:05:00.220\n are many people who recognize those disciplines as having their own approaches to epistemology\n\n1:05:00.220 --> 1:05:05.800\n and to get how we get knowledge and valuing them very highly I don't mean to say that\n\n1:05:05.800 --> 1:05:14.480\n everyone you know who's an atheist automatically you know subscribes to the scientistic viewpoint\n\n1:05:14.480 --> 1:05:21.280\n that's not true but it's certainly the case that many of the arguments in fact most of\n\n1:05:21.280 --> 1:05:27.960\n the arguments of the aggressive atheists of this century people are sometimes called new\n\n1:05:27.960 --> 1:05:33.360\n atheists although they're actually rather old most of their arguments are rather old\n\n1:05:33.360 --> 1:05:40.240\n you know are drawing heavily on scientism so when they say things like there's no evidence\n\n1:05:40.240 --> 1:05:48.160\n to support Christianity okay what they are really focusing on is to say is saying that\n\n1:05:48.160 --> 1:05:54.020\n Christianity isn't proved or the evidence for Christianity is not science okay science\n\n1:05:54.020 --> 1:05:59.960\n doesn't prove it and and you you know if you read their books that's what you find they\n\n1:05:59.960 --> 1:06:08.160\n really mean is science doesn't lead you necessarily to believe in a creator God or into it in\n\n1:06:08.160 --> 1:06:15.480\n any particular in religion I accept that that's not a problem to me because I don't think\n\n1:06:15.480 --> 1:06:18.240\n that science is all the knowledge there is and I think there are other important ways\n\n1:06:18.240 --> 1:06:22.600\n of getting to know things and one of them is historical for example and I mentioned\n\n1:06:22.600 --> 1:06:28.040\n earlier that I think I became persuaded and I were and I still am persuaded that the historical\n\n1:06:28.040 --> 1:06:34.340\n evidence for the resurrection is very is very persuasive again it's not proof or anything\n\n1:06:34.340 --> 1:06:40.880\n like that but it's but it's pretty good evidence okay yeah I've um I talked to Richard Dawkins\n\n1:06:40.880 --> 1:06:48.120\n on this podcast and um uh and uh I saw you debate with Sean Carroll so I I understand\n\n1:06:48.120 --> 1:06:54.540\n this world it makes it makes me very curious maybe uh let me ask sort of another way my\n\n1:06:54.540 --> 1:07:04.640\n own kind of uh world view maybe you can help as by way of therapy understand um you know\n\n1:07:04.640 --> 1:07:09.880\n because you've kind of said that there's other ways of knowing what about if we if if I kind\n\n1:07:09.880 --> 1:07:17.600\n of sit here and am cognizant of the fact that I almost don't know anything so sort of I'm\n\n1:07:17.600 --> 1:07:23.360\n sitting here almost paralyzed by the the mystery of it all and it's not even when you say there's\n\n1:07:23.360 --> 1:07:30.680\n other ways of knowing it um it feels almost too confident to me because uh yeah when I\n\n1:07:30.680 --> 1:07:36.760\n when I listen to beautiful music or uh see art there's something there that's and that's\n\n1:07:36.760 --> 1:07:43.640\n uh that's beyond the reach of scientism I would say so beyond the reach of uh the the\n\n1:07:43.640 --> 1:07:52.200\n tools of science but I don't even feel like that could be as an actual tool of knowing\n\n1:07:52.200 --> 1:07:57.000\n it um yeah I just don't even know where to begin because it just feels like we know so\n\n1:07:57.000 --> 1:08:02.220\n little like uh if we look even a hundred years from now when people look back to this time\n\n1:08:02.220 --> 1:08:07.100\n humans look back to this time they'll probably laugh at how little we knew even a hundred\n\n1:08:07.100 --> 1:08:11.120\n years from now and if we look at a thousand years from now hopefully we're still alive\n\n1:08:11.120 --> 1:08:18.360\n or some version of ourselves or AI version of ourselves you know they they'll certainly\n\n1:08:18.360 --> 1:08:26.400\n laugh at the absurdity of our beliefs so what do you uh so you don't seem to be as paralyzed\n\n1:08:26.400 --> 1:08:31.760\n by how little we know you confidently push on forward but what do you make of that sense\n\n1:08:31.760 --> 1:08:42.360\n of uh of just not knowing of the mystery we need to be modest or or humble if even about\n\n1:08:42.360 --> 1:08:48.360\n what we know I accept that and I certainly think that's true not not simply because in\n\n1:08:48.360 --> 1:08:54.240\n the future we'll know more science and and there will be more powerful ways of finding\n\n1:08:54.240 --> 1:09:01.320\n out about things but simply because you know sometimes we're not right we're wrong okay\n\n1:09:01.320 --> 1:09:11.280\n in what we think we know um uh so that's crucial but it's also a very Christian outlook that\n\n1:09:11.280 --> 1:09:17.520\n kind of humility is what Jesus taught so I so I don't know whether this was in the back\n\n1:09:17.520 --> 1:09:23.100\n of your mind when you were thinking about this but it's often the case that um people\n\n1:09:23.100 --> 1:09:27.960\n of religious faith are are accused of being dogmatists okay and there is a sense in which\n\n1:09:27.960 --> 1:09:35.080\n dogma teaching accepted teaching is is part of religions okay but I don't think that\n\n1:09:35.080 --> 1:09:42.960\n necessarily uh uh that leads one to blind dogmatism and I don't I certainly don't\n\n1:09:42.960 --> 1:09:47.640\n think that faith we can talk about this later if you'd like but I certainly don't think\n\n1:09:47.640 --> 1:09:53.800\n that faith means thinking you know something and not listening to counter arguments for\n\n1:09:53.800 --> 1:10:01.160\n example um so I I think that's crucial yeah what is uh what does faith mean to you what\n\n1:10:01.160 --> 1:10:06.920\n does it uh feel like what does it actually sort of how do you carry your faith in terms\n\n1:10:06.920 --> 1:10:13.920\n of the way you see the world well I think faith is very often misunderstood in our society\n\n1:10:13.920 --> 1:10:23.520\n at the moment um because uh it's often portrayed as being nothing other than uh believing things\n\n1:10:23.520 --> 1:10:34.440\n you know ain't true you know um or or believing things that are are are not proven okay um\n\n1:10:34.440 --> 1:10:41.560\n and um and this and faith does have a strand which is to do with you know basically believing\n\n1:10:41.560 --> 1:10:50.280\n in um in concepts or um propositions but actually the the word faith is much broader than that\n\n1:10:50.280 --> 1:11:00.000\n faith also means um you know trusting in something trusting in a person or trusting in a thing\n\n1:11:00.000 --> 1:11:06.640\n uh the reliability of some technology for example um that's equally part of the meaning\n\n1:11:06.640 --> 1:11:10.920\n of the word faith and and there's a third strand to the to the meaning of the word as\n\n1:11:10.920 --> 1:11:19.080\n well and that is loyalty um so you know I have faith in my wife and and I try to act\n\n1:11:19.080 --> 1:11:25.320\n in faith towards her and that's a kind of loyalty and so those three strands are the\n\n1:11:25.320 --> 1:11:31.760\n are the most important strands of the meaning of faith yes belief in uh in propositions\n\n1:11:31.760 --> 1:11:38.040\n that we might not have you know full proof about or maybe we have very little proof about\n\n1:11:38.040 --> 1:11:46.080\n but it's also trust and and loyalty and actually in the in terms of the Christian faith Christians\n\n1:11:46.080 --> 1:11:51.920\n are far more called to trust and loyalty than they are to belief in things they don't you\n\n1:11:51.920 --> 1:12:00.000\n know don't have proof of okay um but but the critics of religion generally um tend to emphasize\n\n1:12:00.000 --> 1:12:03.920\n the first one and say well you know you believe things for which you have no evidence okay\n\n1:12:03.920 --> 1:12:09.320\n that's what that's what they think faith is well yeah there there is a sense in which\n\n1:12:09.320 --> 1:12:19.800\n everybody has to live their lives uh believing or or or making decisions in situations when\n\n1:12:19.800 --> 1:12:27.520\n they don't have all the proof or evidence or knowledge that enables you to make a completely\n\n1:12:27.520 --> 1:12:34.840\n um rational or well informed or prudent decision we you know we do this all the time you know\n\n1:12:34.840 --> 1:12:39.480\n my drive down here I nearly took a wrong turning and I thought which which which way do I go\n\n1:12:39.480 --> 1:12:50.920\n do I keep going straight on and so my uh voice came out and I think go straight okay so so\n\n1:12:50.920 --> 1:12:56.080\n you have to make decisions and sometimes you know you don't have a navigation system telling\n\n1:12:56.080 --> 1:13:00.480\n you what to do you just have to make that decision with no with insufficient evidence\n\n1:13:00.480 --> 1:13:06.200\n and you're doing it all the time as a human and that's part of being sentient um and so\n\n1:13:06.200 --> 1:13:13.240\n that kind of um action and belief on the basis of incomplete evidence is not something that\n\n1:13:13.240 --> 1:13:19.280\n I feel uncomfortable doing or I feel that I feel that somehow my Christian commitments\n\n1:13:19.280 --> 1:13:22.800\n are forced me to do when I wouldn't have had to have done it otherwise I would have had\n\n1:13:22.800 --> 1:13:28.800\n to do it anyway um and and so you know there's a sense in which um I think it's important\n\n1:13:28.800 --> 1:13:33.840\n to see the breadth of meaning of faith and and and to recognize that in certainly in\n\n1:13:33.840 --> 1:13:39.600\n the case of Christianity um it's trust and loyalty that the the key themes that we're\n\n1:13:39.600 --> 1:13:48.360\n called to and I mean another interesting extension of that that you speak to is kind of loyalty\n\n1:13:48.360 --> 1:13:54.520\n is referring to a connection with something outside of yourself yeah um so I think you've\n\n1:13:54.520 --> 1:14:00.000\n spoken about like existentialism or even just atheism in general as um as leading naturally\n\n1:14:00.000 --> 1:14:07.720\n to an individualism as a focus on the on the self and uh ideas that maybe the Christian\n\n1:14:07.720 --> 1:14:13.640\n faith can um instill in you is um allowing you to sort of look outside of yourself so\n\n1:14:13.640 --> 1:14:21.080\n connection I mean loyalty fundamentally is about other beings um and yeah other beings\n\n1:14:21.080 --> 1:14:27.280\n and I mean I think I don't know what it is in me but I'm very much drawn to that idea\n\n1:14:27.280 --> 1:14:32.640\n and um I think humans in general are drawn to that idea you can you can make all kinds\n\n1:14:32.640 --> 1:14:37.320\n of evolutionary arguments all that kind of stuff but uh people always kind of tease me\n\n1:14:37.320 --> 1:14:44.060\n uh because I talk about love a lot and I mean there's a lot of uh non scientific things\n\n1:14:44.060 --> 1:14:48.920\n about love right like what the heck is that thing why why do we even need that thing it\n\n1:14:48.920 --> 1:14:54.160\n uh it seems to be an annoying burden that uh that we we get so much uh joy in in life\n\n1:14:54.160 --> 1:14:59.160\n from a connection with other human beings deep uh lasting connections with human beings\n\n1:14:59.160 --> 1:15:05.080\n same thing with loyalty why why do we get so much value and pleasure and strength and\n\n1:15:05.080 --> 1:15:09.760\n meaning from loyalty from a connection with somebody else uh going through uh thick and\n\n1:15:09.760 --> 1:15:13.560\n thin with somebody else going through some hard times I mean some of the you know the\n\n1:15:13.560 --> 1:15:19.720\n closest friends I I have is going through some some rough times together and that seems\n\n1:15:19.720 --> 1:15:29.540\n to make life deeply meaningful what is that so yeah um I that's that resonates with me\n\n1:15:29.540 --> 1:15:37.480\n and I obviously I would I would affirm it um I think just to just to correct the implication\n\n1:15:37.480 --> 1:15:45.920\n that you made I I don't think it's necessarily the the consequence of atheism uh that we\n\n1:15:45.920 --> 1:15:51.040\n that we lose track of those kinds of things I I mean I think that atheists can be loyal\n\n1:15:51.040 --> 1:15:57.560\n okay if you like um the question more often comes up in the context of you know where\n\n1:15:57.560 --> 1:16:05.120\n does morality come from and loyalty I think and duty are related to one another you know\n\n1:16:05.120 --> 1:16:10.540\n if we have loyalty to someone then we have a duty to them okay as well and I think that\n\n1:16:10.540 --> 1:16:17.640\n insofar as we see ourselves as having some kinds any kinds of duties or moral compulsions\n\n1:16:17.640 --> 1:16:23.480\n with respect to our relationships to other people it's I think it's a question that always\n\n1:16:23.480 --> 1:16:28.440\n arises well where does these where do these come from and there there are various approaches\n\n1:16:28.440 --> 1:16:37.500\n that people have towards deciding what makes ethics or or morality moral okay but I do\n\n1:16:37.500 --> 1:16:48.760\n think it's the case that um it's very hard to ground morality um in a in any kind of\n\n1:16:48.760 --> 1:16:57.360\n absolute way or a persuasive way um in mere human relationships and so it's certainly\n\n1:16:57.360 --> 1:17:07.040\n the case that in Christianity um there is a sense in which um morality and you know\n\n1:17:07.040 --> 1:17:16.120\n the morality of morals comes from a transcendent place from a transcendent deity and that we\n\n1:17:16.120 --> 1:17:27.640\n um that we ground are the compelling force of of morals on God are more than we do on\n\n1:17:27.640 --> 1:17:33.460\n individuals because after all you know if it if you if you've got nothing but you know\n\n1:17:33.460 --> 1:17:40.840\n other people why should you you know treat your neighbor well why shouldn't you defraud\n\n1:17:40.840 --> 1:17:45.880\n your neighbor if it's good for you well you know you can construct all kinds of arguments\n\n1:17:45.880 --> 1:17:50.600\n and some of them are you know obviously arguments that are commonplace in religion too you should\n\n1:17:50.600 --> 1:17:55.800\n do as you would be done by and all this kind of thing right but none of that seems any\n\n1:17:55.800 --> 1:18:00.760\n any more than mere pragmatism to most people okay and so that's what that's one of the\n\n1:18:00.760 --> 1:18:06.520\n things if that Nietzsche amongst others you know really identified you know if God is\n\n1:18:06.520 --> 1:18:13.240\n dead if the idea of God is grounding our moral behavior is no longer viable in the West which\n\n1:18:13.240 --> 1:18:18.960\n Nietzsche thought that it wasn't okay then what does ground it and he had no good answer\n\n1:18:18.960 --> 1:18:23.960\n for it in fact he claimed there was no answer but then he couldn't live with that and so\n\n1:18:23.960 --> 1:18:32.120\n he invented the idea of the ubermensch you know this this superior human being okay and\n\n1:18:32.120 --> 1:18:38.400\n this was a different way of trying to ground morality not a very successful one you know\n\n1:18:38.400 --> 1:18:46.440\n you could argue that it's a forerunner of the sort of racism of Hitler's regime and\n\n1:18:46.440 --> 1:18:53.800\n so forth that you know we've in the West thankfully shied away from in the in the past\n\n1:18:53.800 --> 1:19:03.240\n half or three quarters of a century but you know I think it is the case that Christianity\n\n1:19:03.240 --> 1:19:13.920\n gives me a basis for my moral beliefs that is more than mere pragmatism yeah but there\n\n1:19:13.920 --> 1:19:20.560\n is a stepping outside of all that there does seem to be a powerful stabilizing like we\n\n1:19:20.560 --> 1:19:27.640\n humans are able to hold ideas together like in a distributed way outside of whether God\n\n1:19:27.640 --> 1:19:32.760\n exists or not or any that just our ability to kind of converge together towards a set\n\n1:19:32.760 --> 1:19:40.320\n of beliefs into sometimes into tribes it's kind of I don't know if it's inherent to being\n\n1:19:40.320 --> 1:19:46.800\n human beings I hope not because now if I look on Twitter and there's a there's the red team\n\n1:19:46.800 --> 1:19:53.120\n and the blue team right it's almost like it's a care it's some kind of TV show that we're\n\n1:19:53.120 --> 1:19:58.200\n living in that people get into these tribes and they hold a set of beliefs that sometimes\n\n1:19:58.200 --> 1:20:05.320\n don't I mean they are beliefs for the sake of holding those beliefs and we get this intimate\n\n1:20:05.320 --> 1:20:11.600\n connection between each other for sharing those beliefs and we spoke to the things about\n\n1:20:11.600 --> 1:20:17.000\n loyalty and love and that's the thing that people feel inside the tribe and it seems\n\n1:20:17.000 --> 1:20:23.000\n very human that within that tribe those beliefs don't necessarily always have to be connected\n\n1:20:23.000 --> 1:20:29.680\n to anything it's just the fact that you know I've did sports my whole life whenever you're\n\n1:20:29.680 --> 1:20:35.600\n on a team the bond you get with it with other people on the team is incredible and the actual\n\n1:20:35.600 --> 1:20:42.080\n sport is often the silliest I mean I don't play ball sports anymore but the ball when\n\n1:20:42.080 --> 1:20:46.620\n I played like soccer or tennis I mean all those sports are silly right you're playing\n\n1:20:46.620 --> 1:20:52.900\n with a little ball but there's the bond you get is so deeply meaningful I just it's interesting\n\n1:20:52.900 --> 1:20:59.720\n to me on the sociological level that it's possible to me whatever the beliefs of religion\n\n1:20:59.720 --> 1:21:09.680\n is whatever they're actually grounded in they might be they might have a power in themselves\n\n1:21:09.680 --> 1:21:14.200\n I think there is tribalism everywhere and I think tribalism in the US at the moment\n\n1:21:14.200 --> 1:21:21.240\n is rather difficult to bear from my point of view and it's I think fed by the internet\n\n1:21:21.240 --> 1:21:27.660\n and social media and so forth but it's but historically tribalism has been a trait and\n\n1:21:27.660 --> 1:21:38.280\n remains a trait in humans the genius of Christianity is that it supersedes tribalism I mean yes\n\n1:21:38.280 --> 1:21:48.300\n when the Hebrews thought about Yahweh initially they thought about him as their tribal deity\n\n1:21:48.300 --> 1:21:56.600\n just like the tribal deities round about about them and so but and and yet from you know\n\n1:21:56.600 --> 1:22:06.440\n early on in Hebrew history the crucial thing that Yahweh came to mean or I would say revealed\n\n1:22:06.440 --> 1:22:13.680\n of himself to them was that he wasn't just a tribal deity he was the God that created\n\n1:22:13.680 --> 1:22:18.920\n the whole thing and if he is the God of the whole thing then he's not just the God of\n\n1:22:18.920 --> 1:22:26.800\n the Hebrews or in the case of you know Americans God is not just the God of Americans he's\n\n1:22:26.800 --> 1:22:36.880\n the God of everybody okay and that is a way in a way the most amazing transcending of\n\n1:22:36.880 --> 1:22:45.440\n tribal loyalties and one of the crucial you know occasions in the New Testament you know\n\n1:22:45.440 --> 1:22:52.760\n when the Holy Spirit comes at Pentecost you know the the apostles and the and the disciples\n\n1:22:52.760 --> 1:22:57.220\n speak in other tongues and there are people from all all the countries you know round\n\n1:22:57.220 --> 1:23:02.900\n about hear them in their own languages and so you know whether whether you take that\n\n1:23:02.900 --> 1:23:12.360\n as factual or not that is the a statement of the transcendent aspects of Christianity\n\n1:23:12.360 --> 1:23:18.120\n or the claimed transcendent aspects of Christianity that it transcends culture and that's certainly\n\n1:23:18.120 --> 1:23:20.320\n something which I find appealing.\n\n1:23:20.320 --> 1:23:29.360\n When I kind of touch on this topic in my own mind one of the hardest questions is as why\n\n1:23:29.360 --> 1:23:36.520\n is there suffering in the world do you have a good answer well I have I have some answers\n\n1:23:36.520 --> 1:23:41.480\n but you're right that it is one of the toughest questions the problem of pain or the problem\n\n1:23:41.480 --> 1:23:49.160\n of suffering or the problem of theodicy as as theologians call it is is is probably one\n\n1:23:49.160 --> 1:23:55.760\n of the toughest I think it's important to say that there are certain types of answers\n\n1:23:55.760 --> 1:24:01.620\n to this question but there are aspects of this question to which there is no intellectual\n\n1:24:01.620 --> 1:24:09.520\n answer that is going to satisfy and and the fact of the matter is you know when I'm speaking\n\n1:24:09.520 --> 1:24:18.680\n to an audience let's say at at at some kind of lecture I can be sure that there are people\n\n1:24:18.680 --> 1:24:23.200\n in that audience who are either personally suffering they've got illness they've got\n\n1:24:23.200 --> 1:24:28.080\n pains there maybe they're facing death or someone in their family is in similar sorts\n\n1:24:28.080 --> 1:24:35.200\n of situations so suffering is a reality and and there is nothing that I can say that is\n\n1:24:35.200 --> 1:24:43.640\n going to solve their feeling of agony and angst and and maybe despair in those types\n\n1:24:43.640 --> 1:24:50.640\n of situations there is really only one thing that I think humans can do for one another\n\n1:24:50.640 --> 1:24:57.340\n in those kinds of situations and that is simply to be there to be there alongside your friend\n\n1:24:57.340 --> 1:25:04.920\n or your or your colleague or or whoever you know family member or whoever it might be\n\n1:25:04.920 --> 1:25:11.200\n and that's the only really sense in which we can give comfort if we try to give intellectual\n\n1:25:11.200 --> 1:25:17.480\n solutions to these problems we're going to be like like the comforters that were in the\n\n1:25:17.480 --> 1:25:26.320\n book of Job in the in the Bible who who brought no comfort to Job himself with their intellectual\n\n1:25:26.320 --> 1:25:32.520\n answers but if they had been there and some of them were there they sat alongside that\n\n1:25:32.520 --> 1:25:39.200\n is some level of comfort and and after all that's the meaning of the word compassion\n\n1:25:39.200 --> 1:25:45.480\n it means to suffer alongside of somebody and I would say first off you know what does a\n\n1:25:45.480 --> 1:25:52.000\n Christian say about suffering the the first thing a Christian should say is compassion\n\n1:25:52.000 --> 1:26:00.360\n is all that really counts and what's more we say that God has acted in compassion towards\n\n1:26:00.360 --> 1:26:07.040\n us that is to say he has suffered with us in the person of Jesus Christ and when we\n\n1:26:07.040 --> 1:26:15.120\n see the passion of Jesus we recognize that God takes suffering deadly seriously has taken\n\n1:26:15.120 --> 1:26:21.120\n it so seriously that he's been willing to come and be a part of his creation in the\n\n1:26:21.120 --> 1:26:29.040\n person of of Jesus Christ and suffer death the most horrible death on the cross and for\n\n1:26:29.040 --> 1:26:35.840\n our benefit so that's one side of of suffering but the question you know the philosophical\n\n1:26:35.840 --> 1:26:44.400\n question remains you know surely if God is good you know and God is omnipotent benevolent\n\n1:26:44.400 --> 1:26:50.100\n you know why doesn't he take away all the suffering why doesn't he cause miracles to\n\n1:26:50.100 --> 1:26:54.760\n occur that will take away all this suffering I think there are some good answers to that\n\n1:26:54.760 --> 1:27:05.520\n question in the in the following sense that you know we live in a world where the consistency\n\n1:27:05.520 --> 1:27:13.400\n of the world is an absolutely crucial part of it you know the fact that our world behaves\n\n1:27:13.400 --> 1:27:22.280\n reproducibly in the main is absolutely essential for the integrity of our lives without it\n\n1:27:22.280 --> 1:27:29.640\n we wouldn't exist okay and so there is a sense in which the integrity of creation calls for\n\n1:27:29.640 --> 1:27:34.800\n there being consistent behavior which you know these days we think of as being the laws\n\n1:27:34.800 --> 1:27:41.600\n of nature okay and so the consistent behavior of nature is very very important it's what\n\n1:27:41.600 --> 1:27:50.000\n enables us to be what we are and if you're calling upon God in in in in your critique\n\n1:27:50.000 --> 1:27:58.260\n of why isn't this benevolent creator you know fixing things one answer is he's fixed things\n\n1:27:58.260 --> 1:28:07.640\n in a certain sense to have an integrity in them and that integrity is the best thing\n\n1:28:07.640 --> 1:28:13.360\n it's the way we have our existence it's the way we live and move and have our being and\n\n1:28:13.360 --> 1:28:19.720\n you know if you want something different you've got to show that there is a way in which you\n\n1:28:19.720 --> 1:28:25.680\n could invent a world that is better that it has the integrity that we need to exist okay\n\n1:28:25.680 --> 1:28:32.840\n and and and to be able to think and and and love and and be but but you were going to\n\n1:28:32.840 --> 1:28:38.280\n do it better you know and the atheists think that maybe they have got a better idea but\n\n1:28:38.280 --> 1:28:42.560\n if they thought about it a bit more carefully they'd realize no one has put forward a better\n\n1:28:42.560 --> 1:28:50.120\n idea okay so the so another way to say that uh i mean is that suffering is an integral\n\n1:28:50.120 --> 1:29:02.360\n part of this of um of a consistent existence so so sort of uh and the philosophical in\n\n1:29:02.360 --> 1:29:08.560\n a philosophical sense uh the full richness and the beauty of our experience would not\n\n1:29:08.560 --> 1:29:14.760\n be as beautiful would not be as rich uh if there was no suffering in the world is that\n\n1:29:14.760 --> 1:29:18.520\n is that possible well i think you said two different things that aren't exactly at least\n\n1:29:18.520 --> 1:29:25.400\n that aren't exactly the same one is that suffering is an integral part of our experience you\n\n1:29:25.400 --> 1:29:31.960\n know that might be considered a challenge to certain types of christian theology or\n\n1:29:31.960 --> 1:29:37.000\n or even uh jewish theology in other words um christians talk about the fall and talk\n\n1:29:37.000 --> 1:29:43.920\n about uh adam and eve in the garden and and have have a vision of there being some kind\n\n1:29:43.920 --> 1:29:50.440\n of perception from or perfection from which we have fallen and i think there is a perfection\n\n1:29:50.440 --> 1:29:56.920\n from which we've fallen but i don't think that perfection is some kind of physical perfection\n\n1:29:56.920 --> 1:30:02.120\n in other words i don't subscribe personally to the view that some some christians do that\n\n1:30:02.120 --> 1:30:09.320\n there was some state um prior to the fall in which death did not occur i don't think\n\n1:30:09.320 --> 1:30:15.480\n that that's consistent with science as we know it and i and i think that um death for\n\n1:30:15.480 --> 1:30:23.440\n example has been part of the biological world and the and the universe as a whole um from\n\n1:30:23.440 --> 1:30:30.600\n from billions of years ago so so just to be clear about that um you know i on the other\n\n1:30:30.600 --> 1:30:38.440\n hand i do so if that's the case then certainly in that sense at the very least um suffering\n\n1:30:38.440 --> 1:30:47.560\n or at least death okay is part of the biological existence and that probably seems so completely\n\n1:30:47.560 --> 1:30:53.040\n obvious to somebody who you know is au fait with science whether they you know whether\n\n1:30:53.040 --> 1:30:59.000\n they're a scientist or not well so and i apologize if i'm interrupting but it's the obvious reality\n\n1:30:59.000 --> 1:31:03.920\n of of uh our life today but there's a lot of people i think it's currently in vogue\n\n1:31:03.920 --> 1:31:09.800\n i've talked to quite a few folks who kind of see as the goal of many of our pursuits\n\n1:31:09.800 --> 1:31:15.280\n as to extend life indefinitely a sort of uh you know a dream for many people is to live\n\n1:31:15.280 --> 1:31:21.500\n forever uh but in the in the technological world in the engineering world in the scientific\n\n1:31:21.500 --> 1:31:29.680\n world i mean that's that's the big dream to me it feels like that's not a dream it's i\n\n1:31:29.680 --> 1:31:34.480\n certainly would like to live forever uh like that that's the initial feeling the instinctual\n\n1:31:34.480 --> 1:31:40.640\n feeling because you know life is so amazing but then if you actually kind of like you've\n\n1:31:40.640 --> 1:31:45.860\n presented it if you actually uh live that kind of life you would realize that that's\n\n1:31:45.860 --> 1:31:50.560\n actually a step uh backwards that's a step down from the experience of this life in my\n\n1:31:50.560 --> 1:31:57.540\n sense that death is an essential part of life uh about an essential part of this experience\n\n1:31:57.540 --> 1:32:04.560\n death of all things so the thing the fact that things end somehow and the scarcity of\n\n1:32:04.560 --> 1:32:12.680\n things somehow create the beauty of this experience that we have yeah transhumanism doesn't look\n\n1:32:12.680 --> 1:32:20.760\n very attractive to me either but it also doesn't look very feasible um but that's a whole big\n\n1:32:20.760 --> 1:32:27.560\n topic that i'm not exactly an expert but i'll say but i but you know i'm of a certain age\n\n1:32:27.560 --> 1:32:35.640\n where my mortality is more pressing or more obvious to me than it once was okay um and\n\n1:32:35.640 --> 1:32:45.080\n and i don't dread that i don't see that as in a certain sense even the enemy okay you're\n\n1:32:45.080 --> 1:32:50.720\n not afraid of death well i'm afraid of lots of things in a in a in a conceptual way but\n\n1:32:50.720 --> 1:32:58.400\n it doesn't keep me awake at night okay um i i'm i think like most people i'm more afraid\n\n1:32:58.400 --> 1:33:03.400\n of pain than i am of death so i i don't want to put myself forward as some kind of hero\n\n1:33:03.400 --> 1:33:10.080\n that doesn't worry about these things that's not true but i i do think and maybe this is\n\n1:33:10.080 --> 1:33:19.120\n part of my christian outlook um that there is life beyond the grave um but i don't think\n\n1:33:19.120 --> 1:33:26.880\n that that it's life in this universe or in this um certainly not in this body and maybe\n\n1:33:26.880 --> 1:33:30.880\n not in a certain sense in this mind i mean you know christian christian belief in the\n\n1:33:30.880 --> 1:33:35.680\n afterlife is is that we will be resurrected we will be in a certain sense be with god\n\n1:33:35.680 --> 1:33:39.040\n i don't know what that means and i don't think anybody else really quite knows what that\n\n1:33:39.040 --> 1:33:45.300\n means but there are lots of ways that over history people artists and and and writers\n\n1:33:45.300 --> 1:33:49.680\n and so forth have pictured it um and these are all perhaps some of them helpful ways\n\n1:33:49.680 --> 1:33:55.640\n of thinking about it do you think it's possible to know what happens after we die um i i don't\n\n1:33:55.640 --> 1:34:02.080\n think we find out by near death experiences or those kinds of things but but i but i think\n\n1:34:02.080 --> 1:34:09.560\n that uh you know that we have sufficient i feel i have sufficient information if you\n\n1:34:09.560 --> 1:34:16.360\n like um in terms of god's revelation to be confident that that i will go somewhere\n\n1:34:16.360 --> 1:34:29.320\n else okay but it won't be here and i to me the aspirations of transhumanism are horrific\n\n1:34:29.320 --> 1:34:34.640\n i mean i think it would be a nightmare not a dream a nightmare you know to be somehow\n\n1:34:34.640 --> 1:34:42.680\n downloaded into a computer and live one's life like that i because it it completely\n\n1:34:42.680 --> 1:34:49.720\n discounts the integrity of our bodies as well as our minds i mean we aren't just disembodied\n\n1:34:49.720 --> 1:34:58.360\n minds it would not be me that was in the computer it would be something else if if that kind\n\n1:34:58.360 --> 1:35:03.000\n of download were possible of course it isn't possible and it's very long way from being\n\n1:35:03.000 --> 1:35:08.040\n possible but you know amazing things happen so we shouldn't be too certain so this is\n\n1:35:08.040 --> 1:35:14.320\n this is a place that uh again maybe taking a slight step outside uh wherever philosophizing\n\n1:35:14.320 --> 1:35:21.680\n a little bit uh let me ask you about uh human level or superhuman level intelligence uh\n\n1:35:21.680 --> 1:35:30.240\n the artificial intelligence systems do you what do you make from um from almost a religious\n\n1:35:30.240 --> 1:35:37.240\n or a perspective that we've been talking about of the special aspect of human nature of us\n\n1:35:37.240 --> 1:35:43.800\n creating intelligence systems that exhibit some elements of that human nature is that\n\n1:35:43.800 --> 1:35:48.360\n something again like we were talking about with transhumanism uh there's a feasibility\n\n1:35:48.360 --> 1:35:52.400\n question of how hard is it to actually build machines that human level intelligence or\n\n1:35:52.400 --> 1:35:57.160\n have something like consciousness or have all those kinds of human qualities and then\n\n1:35:57.160 --> 1:36:03.880\n there's the do we want to do that kind of thing so on both of those directions what\n\n1:36:03.880 --> 1:36:10.120\n do you think well okay so you know since your podcast is called ai i don't want to offend\n\n1:36:10.120 --> 1:36:15.200\n too many of your listeners out there that's but i but i i think one should be a little\n\n1:36:15.200 --> 1:36:20.640\n bit more modest about one's claims for ai than have typically been the case yeah i think\n\n1:36:20.640 --> 1:36:25.720\n that actually a lot of people in ai are somewhat chastened and so there there are more modest\n\n1:36:25.720 --> 1:36:33.920\n claims than are common with the transhumanists and yes and and so forth um and you know i\n\n1:36:33.920 --> 1:36:39.640\n used to play chess when i was a kid i was pretty good at it okay um won competitions\n\n1:36:39.640 --> 1:36:44.680\n and so on and so forth and i when i and i'm talking about when i was in high school i\n\n1:36:44.680 --> 1:36:50.800\n thought it was pretty unlikely that a computer would be able to become good at chess but\n\n1:36:50.800 --> 1:36:56.240\n i was dead wrong okay and so you know um how did that make you feel by the way when um\n\n1:36:56.240 --> 1:37:03.000\n t blue big i stopped playing chess seriously when i had when i encountered computers that\n\n1:37:03.000 --> 1:37:10.280\n could beat me okay i still play with my grandchildren a little bit but but um but yeah it it seemed\n\n1:37:10.280 --> 1:37:15.640\n like in a certain sense it became a solved problem uh when ai was able to do it better\n\n1:37:15.640 --> 1:37:22.620\n than i could so i think that there are ways in which today we've seen um computers do\n\n1:37:22.620 --> 1:37:29.400\n things which historically were regarded as being very characteristic of human intelligence\n\n1:37:29.400 --> 1:37:36.920\n and in that sense there there is some success to ai i also think that um you know there\n\n1:37:36.920 --> 1:37:41.820\n are certain things which one might think of as being ai which are you know completely\n\n1:37:41.820 --> 1:37:49.440\n widespread in our society i'm thinking about the internet search engines and so forth which\n\n1:37:49.440 --> 1:37:55.540\n are enormously influential and obviously do things more powerfully than any individual\n\n1:37:55.540 --> 1:38:04.320\n human or even any combination of humans could do much faster and and and accessing databases\n\n1:38:04.320 --> 1:38:12.880\n and so on and so forth is all of this is outstripped our human intelligence um i'm not sure the\n\n1:38:12.880 --> 1:38:19.420\n extent though to which that is really intelligence uh in the way that was traditionally meant\n\n1:38:19.420 --> 1:38:28.760\n but it's certainly amazingly um facile and um it it multiplies our ability to access\n\n1:38:28.760 --> 1:38:34.160\n human knowledge and and data and so forth so is that something is that is that enter\n\n1:38:34.160 --> 1:38:39.920\n the realm of something we should be concerned about so in the realm of religion you talk\n\n1:38:39.920 --> 1:38:44.760\n about what is good what is evil what is right what is wrong you have set of morals set of\n\n1:38:44.760 --> 1:38:50.880\n beliefs and when you have an entity come into the picture that uh that has quite a bit of\n\n1:38:50.880 --> 1:38:58.120\n power if we potentially look into the future and intelligence and capability um do you\n\n1:38:58.120 --> 1:39:05.560\n think there's something that religion can say about artificial intelligence or is that\n\n1:39:05.560 --> 1:39:09.360\n something you we shouldn't worry about until that arrives you think just like with the\n\n1:39:09.360 --> 1:39:15.880\n chess program um you know religious writers have thought about this for centuries uh you\n\n1:39:15.880 --> 1:39:21.500\n know there's been a long debate about what is what was historically called the plurality\n\n1:39:21.500 --> 1:39:29.680\n of worlds and it was actually more about whether there are places where other intelligent creatures\n\n1:39:29.680 --> 1:39:35.680\n live than it was about us creating them but but i think it's largely the same question\n\n1:39:35.680 --> 1:39:40.600\n it's almost like aliens like other intelligent so if there is other intelligent life in the\n\n1:39:40.600 --> 1:39:46.520\n universe what is its relationship to god okay that is in a certain sense the puzzle that\n\n1:39:46.520 --> 1:39:50.360\n religious thinkers and writers have thought about for a long time and there's a whole\n\n1:39:50.360 --> 1:39:55.960\n range of of different opinions about that i mean personally you know i think it's it's\n\n1:39:55.960 --> 1:40:00.400\n an interesting question but it's not a very pressing question at the moment um yeah and\n\n1:40:00.400 --> 1:40:06.480\n i think the same way about the the question of what happens if we're able to build a sentient\n\n1:40:06.480 --> 1:40:11.080\n robot for example um i think it's an interesting question and we'll have to think about it\n\n1:40:11.080 --> 1:40:16.240\n when that happens um but i think we're still quite a ways away from that and so i i don't\n\n1:40:16.240 --> 1:40:21.560\n have a good answer um but i think there's a literature that you one could tap um to\n\n1:40:21.560 --> 1:40:28.080\n think about if you want to start early on the question well let me ask you another impossible\n\n1:40:28.080 --> 1:40:33.400\n question from a religious or from a personal perspective what do you think is consciousness\n\n1:40:33.400 --> 1:40:41.240\n this this uh subjective experience that we seem to be having there's uh this there's\n\n1:40:41.240 --> 1:40:46.880\n uh the christian religion have something to say about consciousness does your own when\n\n1:40:46.880 --> 1:40:52.760\n you look in the mirror do you have a sense of what is consciousness um i think the bible\n\n1:40:52.760 --> 1:40:57.080\n doesn't have much in the way of answers about that directly in the sense that you're perhaps\n\n1:40:57.080 --> 1:41:02.380\n asking it which is more like i think you're asking for some kind of uh quasi scientific\n\n1:41:02.380 --> 1:41:08.520\n or maybe indeed scientific uh description that's really looking for one yes um i i think\n\n1:41:08.520 --> 1:41:15.720\n that i think that there it's an interesting question i think it's actually um it's a\n\n1:41:15.720 --> 1:41:19.800\n jump too far i think we have we don't even know the answer to the question what is the\n\n1:41:19.800 --> 1:41:25.320\n mind let alone consciousness so if you distinguish between those two things i think the question\n\n1:41:25.320 --> 1:41:32.320\n that's being addressed more directly um scientifically as well as in other ways it is what is the\n\n1:41:32.320 --> 1:41:38.800\n mind um and that is certainly a very topical question even in places like mit which is\n\n1:41:38.800 --> 1:41:43.880\n not historically involved with philosophical questions you know that people are doing neuroscience\n\n1:41:43.880 --> 1:41:50.880\n and so forth i think it's a very important question and i think that we're going to find\n\n1:41:50.880 --> 1:42:01.760\n that um we are not computers in other words i think uh the the commonplace theory of what\n\n1:42:01.760 --> 1:42:11.680\n mind is is is generally speaking by analogy that we are basically wet wetware okay um\n\n1:42:11.680 --> 1:42:20.800\n that we're some computer like um entity um and that that the analogy to digital computers\n\n1:42:20.800 --> 1:42:27.180\n is is is a pretty decent one i mean that that's of course a viewpoint which um you know which\n\n1:42:27.180 --> 1:42:32.320\n drives the aspirations of the transhumanists i mean they they so much believe that our\n\n1:42:32.320 --> 1:42:37.200\n minds are nothing other than you know in a certain sense some kind of implementation\n\n1:42:37.200 --> 1:42:42.040\n of software in biology that they say to themselves well of course we're going to be able to download\n\n1:42:42.040 --> 1:42:50.960\n it into a into a digital computer i don't think that's true i think it's most likely\n\n1:42:50.960 --> 1:42:58.280\n that quantum mechanics is very important in the brain uh it seems most unlikely that it's\n\n1:42:58.280 --> 1:43:04.520\n not to me i know that that's contrary to the opinions of many people but but that's my\n\n1:43:04.520 --> 1:43:09.560\n view and it's also a view for example of people like roger penrose and and people like that\n\n1:43:09.560 --> 1:43:17.080\n who've written about it um rather extensively and if that's the case then really my mind\n\n1:43:17.080 --> 1:43:25.320\n is not reproduce reducible to some kind of software which can be considered to be portable\n\n1:43:25.320 --> 1:43:33.480\n it is so uh connected to the hardware of my body that the two are inseparable okay and\n\n1:43:33.480 --> 1:43:39.900\n so if that is in fact what we find um as i suspect will be the case then the aspirations\n\n1:43:39.900 --> 1:43:47.480\n of the transhumanists will be very long incoming if at all um so i think that actually physics\n\n1:43:47.480 --> 1:43:56.040\n and chemistry um you know are in a are in a sense um involved with the brain and with\n\n1:43:56.040 --> 1:44:03.360\n in the mind but not in a very simple way like you know like the computer analogy um in and\n\n1:44:03.360 --> 1:44:14.480\n a much more complicated way and i and i also think that um it's philosophically ignorant\n\n1:44:14.480 --> 1:44:23.760\n to speak as if um when and if the actions of the brain are understood at the physical\n\n1:44:23.760 --> 1:44:31.120\n and chemical level that will mean that the mind will vanish as a concept you know that\n\n1:44:31.120 --> 1:44:36.840\n we'll just say no we're nothing but brains okay of course it won't i mean it may well\n\n1:44:36.840 --> 1:44:42.440\n be that our mind is an emergent phenomenon that comes out of the physics and chemistry\n\n1:44:42.440 --> 1:44:50.000\n and biology okay but it's also something that we have to encounter and take seriously and\n\n1:44:50.000 --> 1:44:58.320\n so um you know it's it's not the case that it that the mind is reducible to nothing but\n\n1:44:58.320 --> 1:45:04.720\n physics and chemistry even if it's embedded in you know continuously into physics and\n\n1:45:04.720 --> 1:45:12.040\n chemistry as i rather suspect it is um so i that that's my own view i mean another way\n\n1:45:12.040 --> 1:45:19.320\n of putting it is that the mind or the soul is not something added into humans as might\n\n1:45:19.320 --> 1:45:25.360\n have been the viewpoint um historically i do think there is you know there is something\n\n1:45:25.360 --> 1:45:30.240\n added to humans but it's not it's not the mind it's the spirit and that takes us beyond\n\n1:45:30.240 --> 1:45:35.640\n the physical it takes us beyond this universe but i but i don't think that that consciousness\n\n1:45:35.640 --> 1:45:42.360\n the mind etc etc is that thing which is necessarily added in so i i'm not be emergent in some\n\n1:45:42.360 --> 1:45:47.880\n way i'm not a substance dualist in that sense okay if you want to put it philosophically\n\n1:45:47.880 --> 1:45:54.000\n i mean uh but you see your sense is um so the mind and the intelligence and consciousness\n\n1:45:54.000 --> 1:46:00.520\n can be these emergent things do you do you have a hope a sense that science could help\n\n1:46:00.520 --> 1:46:07.800\n us get it pretty far down the road of understanding we will get much further than we have and\n\n1:46:07.800 --> 1:46:15.920\n we it'll be interesting um i mean right now our our methods of diagnosing the human brain\n\n1:46:15.920 --> 1:46:22.440\n are extremely primitive i mean the resolution that we have you know that comes out of uh\n\n1:46:22.440 --> 1:46:28.840\n out of nmr and and brain scans and so forth is miserable compared with what we need in\n\n1:46:28.840 --> 1:46:36.120\n order to understand the brain at the cellular level let alone at the atomic level um but\n\n1:46:36.120 --> 1:46:40.360\n you know we're making progress it's relatively slow progress but it's progress and people\n\n1:46:40.360 --> 1:46:44.160\n are working on it and we're going to get better at it and we'll find out very interesting\n\n1:46:44.160 --> 1:46:49.520\n things as we do um the time resolution is also completely hopeless compared compare\n\n1:46:49.520 --> 1:46:55.080\n with what we need to understand of a thought you know so um so there's a long way to go\n\n1:46:55.080 --> 1:47:01.200\n and we will get better at it um but i'm but i'm not at all worried as some people are\n\n1:47:01.200 --> 1:47:07.600\n and some people speak as if this is a good thing that somehow the concepts of humanity\n\n1:47:07.600 --> 1:47:15.480\n and the mind and religion and and consciousness are going to vanish because we're going to\n\n1:47:15.480 --> 1:47:21.280\n have you know complete uh physicochemical description of the brain in the near future\n\n1:47:21.280 --> 1:47:26.160\n that we're not going to have that and secondly even if we had it the mind and all these other\n\n1:47:26.160 --> 1:47:31.760\n things aren't going to vanish because of it well i i find kind of compelling the the notion\n\n1:47:31.760 --> 1:47:42.400\n that whoever created this universe uh and us uh did so to understand itself himself\n\n1:47:42.400 --> 1:47:50.760\n i mean there's a there's a there's a powerful self reflection notion to this whole experiment\n\n1:47:50.760 --> 1:47:57.000\n that we're a part of i certainly think that god takes delight in his creation and that\n\n1:47:57.000 --> 1:48:04.240\n it was created for that delight as much as it was um for any other reason and that you\n\n1:48:04.240 --> 1:48:11.040\n know that therefore are there's reason to be hopeful and and awestruck by the creation\n\n1:48:11.040 --> 1:48:15.920\n whether it's on the very small or on the very large i'm not sure if you're familiar there's\n\n1:48:15.920 --> 1:48:21.880\n something called the simulation hypothesis well that's been fun to talk about with the\n\n1:48:21.880 --> 1:48:29.560\n computer scientists and so on which is a kind of thought experiment that proposes that um\n\n1:48:29.560 --> 1:48:33.720\n you know the entirety of the world around us is a kind of a computer program that's\n\n1:48:33.720 --> 1:48:39.520\n a simulation and then we're living inside it i think there's um i think from a certain\n\n1:48:39.520 --> 1:48:45.480\n perspective that could be consistent with a religious view of the world i mean you could\n\n1:48:45.480 --> 1:48:51.760\n just use different terms uh basically uh what are your but it's a it's a it feels like a\n\n1:48:51.760 --> 1:49:01.120\n more um modern updated version of that but what is what's what's your sense of this uh\n\n1:49:01.120 --> 1:49:06.080\n the simulation hypothesis do you find interesting useful to think about it do you find it ridiculous\n\n1:49:06.080 --> 1:49:11.680\n did you find it fun what are your thoughts uh it's fun and it's been of course the subject\n\n1:49:11.680 --> 1:49:21.200\n of various movies yeah um that that some of which are very well known um you know i don't\n\n1:49:21.200 --> 1:49:28.800\n think it makes sense to think of it as a simulation hypothesis in the sense that we're really\n\n1:49:28.800 --> 1:49:38.040\n lying in uh banks um of of uh on banks of of beds having our energy drained away from\n\n1:49:38.040 --> 1:49:43.760\n us um and and the simulation is going on in our individual brains that that makes no sense\n\n1:49:43.760 --> 1:49:48.920\n to me at all i don't think that's what's meant by the simulation hypothesis as you're using\n\n1:49:48.920 --> 1:49:57.080\n it now but i think that there is a um there is very little distinction between saying\n\n1:49:57.080 --> 1:50:07.560\n that a an intelligent creator has set up the universe according to his will and his plan\n\n1:50:07.560 --> 1:50:16.260\n and set it in motion and is allowing it to run out maybe as christians say he's sustaining\n\n1:50:16.260 --> 1:50:23.160\n it actually um by his word of power it says in the book of the letter to hebrews okay\n\n1:50:23.160 --> 1:50:34.140\n um in in in in this amazingly consistent and um integrated way um i don't think there's\n\n1:50:34.140 --> 1:50:38.320\n very much difference between saying that and saying that it's a simulation okay i mean\n\n1:50:38.320 --> 1:50:44.240\n i think it's almost the same thing okay but i but i think from but i think it's important\n\n1:50:44.240 --> 1:50:52.200\n to recognize that the simulation in that concept the simulation and the creation or the universe\n\n1:50:52.200 --> 1:50:59.780\n are the same thing okay in other words it's a simulation you know that is billions of\n\n1:50:59.780 --> 1:51:07.600\n light years across okay yeah um i mean there's a sense in which it helps one understand especially\n\n1:51:07.600 --> 1:51:13.320\n if you're not religious that there is something outside of the world that uh we live in that\n\n1:51:13.320 --> 1:51:17.600\n there's something bigger than the world we live in um and that i mean it's just another\n\n1:51:17.600 --> 1:51:26.840\n perspective on uh that humbles humbles you um so in that sense one shortcoming of that\n\n1:51:26.840 --> 1:51:33.120\n is is the following is of the of the analogy is this that we think of a simulation as something\n\n1:51:33.120 --> 1:51:39.200\n take taking place in the universe you know when we it's it's taking place in my computer\n\n1:51:39.200 --> 1:51:48.600\n okay i don't think that's the right analogy for um a christian view of creation okay i\n\n1:51:48.600 --> 1:51:55.880\n don't think it's taking place in some other universe that god has made okay i i think\n\n1:51:55.880 --> 1:52:02.280\n maybe it's taking place in the mind of god christians might hypothesize also but i but\n\n1:52:02.280 --> 1:52:07.920\n i think that that that it's important to recognize that christian theology at any rate\n\n1:52:07.920 --> 1:52:14.520\n is that god is not one of the entities in the universe and and presumably therefore\n\n1:52:14.520 --> 1:52:21.360\n is very different from a simulation that we might run on a computer let me ask you adam\n\n1:52:21.360 --> 1:52:26.680\n and eve even adam ate of the fruit of the tree of knowledge of good and evil does this\n\n1:52:26.680 --> 1:52:31.640\n is this story meaningful to you what does the story mean to you yeah i it is meaningful\n\n1:52:31.640 --> 1:52:37.200\n to me um i i take the you know the writings of the bible very seriously and i think that\n\n1:52:37.200 --> 1:52:43.760\n most christians regard them as having some kind of authoritative um role in their in\n\n1:52:43.760 --> 1:52:49.560\n their in their faith um what do i get from it i mean i think the most important thing\n\n1:52:49.560 --> 1:52:53.440\n that christians get from the story of adam and eve and they're eating the apple and\n\n1:52:53.440 --> 1:53:01.160\n so forth is that the relationship between humans and god is broken has been broken by\n\n1:53:01.160 --> 1:53:07.520\n man's disobedience that's what the the story of adam and eve and the apple is all about\n\n1:53:07.520 --> 1:53:17.300\n and um that that broken relationship is for christians what jesus came to redeem came\n\n1:53:17.300 --> 1:53:29.280\n to overcome that brokenness and uh restore uh that relationship with god um uh to some\n\n1:53:29.280 --> 1:53:36.360\n extent at any rate on earth and and ultimately um you know in in the in eternity to restore\n\n1:53:36.360 --> 1:53:43.120\n it fully so that's really what christians mean and gain from the story of adam and eve\n\n1:53:43.120 --> 1:53:48.800\n of course lots of people ask the questions about how sort how literally should we take\n\n1:53:48.800 --> 1:53:53.720\n these stories of particularly the first few few chapters of genesis which is an important\n\n1:53:53.720 --> 1:54:00.560\n question but but i mean but we tend to um get bogged down with it a bit too much i think\n\n1:54:00.560 --> 1:54:08.440\n we should take away the message um and i think the the the uh what the what actually we would\n\n1:54:08.440 --> 1:54:14.320\n have seen if we'd been there okay is something which is a matter of speculation and it's\n\n1:54:14.320 --> 1:54:18.480\n certainly not terribly important from the point of view of christian theology but it\n\n1:54:18.480 --> 1:54:25.880\n seems like a very important moment um as a man of faith do you um do you do you wish\n\n1:54:25.880 --> 1:54:32.680\n that uh i think it was eve first uh yeah well see do you wish that by the way it was just\n\n1:54:32.680 --> 1:54:38.800\n a fruit as a few what you said it very carefully as the fruit fruit of the tree right uh do\n\n1:54:38.800 --> 1:54:43.720\n you wish they wouldn't have eaten of the tree i mean this is a back to our discussion of\n\n1:54:43.720 --> 1:54:50.240\n suffering was that like an essential thing that needed to happen you're gonna have to\n\n1:54:50.240 --> 1:54:59.480\n read paradise lost to get your answer to that beautifully put okay well let me ask the the\n\n1:54:59.480 --> 1:55:05.760\n biggest question one that you also touch in your book but one that i asked every once\n\n1:55:05.760 --> 1:55:13.520\n in a while is what is the meaning of life the meaning of my life is many different things\n\n1:55:13.520 --> 1:55:24.360\n okay but it but they are all kind of centered around um relationships um i mean for a christian\n\n1:55:24.360 --> 1:55:32.080\n one's relationship with god is a crucial part of the meaning of life but one's relationship\n\n1:55:32.080 --> 1:55:40.040\n with one's family wife's wife parents children grandchildren in my case um and so forth those\n\n1:55:40.040 --> 1:55:46.480\n are crucially important um these are all the places where people whether they're religious\n\n1:55:46.480 --> 1:55:56.120\n or not find meaning um but ultimately um i think a person who has faith in a creator\n\n1:55:56.120 --> 1:56:10.200\n um who we think has a an intention or many intentions but a but a but a will um in respect\n\n1:56:10.200 --> 1:56:19.540\n of the world as a whole that's a crucial part of meaning and the idea that my life might\n\n1:56:19.540 --> 1:56:30.920\n have some small significance in the plan of that creator is an amazingly powerful idea\n\n1:56:30.920 --> 1:56:38.640\n that give that brings meaning um i i tell a story in my book that um when i was a student\n\n1:56:38.640 --> 1:56:44.000\n before i became a christian i read a philosophy book with whose approximate title was um what\n\n1:56:44.000 --> 1:56:48.600\n you know what is the meaning of life and you know that book basically said there is no\n\n1:56:48.600 --> 1:56:52.960\n meaning to life you have to make up the meaning as you go along and i think that's probably\n\n1:56:52.960 --> 1:56:59.520\n the the predominant secular view is these days that there is no real meaning but you\n\n1:56:59.520 --> 1:57:05.560\n can make up a meaning and that will give you meaning into your life um i don't subscribe\n\n1:57:05.560 --> 1:57:11.280\n to that view anymore um i think there is more meaning than that um but i do think that those\n\n1:57:11.280 --> 1:57:15.320\n things which give meaning to our life are very important and we should emphasize them\n\n1:57:15.320 --> 1:57:21.360\n and you you have said that as the part of the as the part of that meaning is the part\n\n1:57:21.360 --> 1:57:31.760\n of your faith uh love and loyalty are key parts so can you try to say what is uh love\n\n1:57:31.760 --> 1:57:45.800\n and loyalty like what what does it mean to you what does it look like if you were to\n\n1:57:45.800 --> 1:57:54.840\n give advice to uh to your children grandchildren of what to look for in in looking for loyalty\n\n1:57:54.840 --> 1:58:02.200\n and and and love what would you try to say well i think it's something like yielding\n\n1:58:02.200 --> 1:58:14.780\n your will or desire to another um it's valuing others more highly or at least as highly as\n\n1:58:14.780 --> 1:58:22.720\n yourself but that's just the start of it because true love you reach a point where you are\n\n1:58:22.720 --> 1:58:32.720\n you feel compelled by the other uh and that i think to some people sounds very scary but\n\n1:58:32.720 --> 1:58:43.000\n actually it's terrifically liberating um and i think that love then brings you into service\n\n1:58:43.000 --> 1:58:52.220\n towards another and i'm you know reminded of um the phrase from the anglican uh prayer\n\n1:58:52.220 --> 1:59:00.200\n book where it talks about um jesus whose service is perfect freedom in other words for us christians\n\n1:59:00.200 --> 1:59:08.480\n to serve god is what perfects our freedom and i think there is an amazing love is um\n\n1:59:08.480 --> 1:59:18.600\n is in part kept captivity but in a kind of paradoxical sense it's also an amazing freedom\n\n1:59:18.600 --> 1:59:24.160\n love is freedom i don't think there's a better way to end it we started with fusion energy\n\n1:59:24.160 --> 1:59:28.720\n and ending on love in there's a huge honor to talk to you thank you so much for your\n\n1:59:28.720 --> 1:59:33.680\n time today thanks it was a pleasure thanks for listening to this conversation with ian\n\n1:59:33.680 --> 1:59:40.760\n hutchinson and thank you to our sponsors sun basket and power dot please consider supporting\n\n1:59:40.760 --> 1:59:48.120\n this podcast by going to sun basket.com slash lex and use code lex at checkout and going\n\n1:59:48.120 --> 1:59:56.160\n to power dot.com slash lex and use code lex at checkout click the links buy the stuff\n\n1:59:56.160 --> 2:00:02.080\n even just visiting the site is really the best way to support this podcast because it\n\n2:00:02.080 --> 2:00:07.880\n helps convince them to sponsor it in the future if you enjoy this thing subscribe on youtube\n\n2:00:07.880 --> 2:00:13.080\n review it with five stars on apple podcast support on patreon or connect with me on twitter\n\n2:00:13.080 --> 2:00:21.000\n at lex friedman spelled somehow without the letter e just f r i d m a n and now let me\n\n2:00:21.000 --> 2:00:27.080\n leave you with some words from arthur c clark finally i would like to assure my many buddhist\n\n2:00:27.080 --> 2:00:32.440\n christian hindu jewish and muslim friends that i am sincerely happy that the religion\n\n2:00:32.440 --> 2:00:38.120\n which chance has given you has contributed to your peace of mind and often as western\n\n2:00:38.120 --> 2:00:44.120\n medical science now reluctantly admits to your physical well being perhaps it is better\n\n2:00:44.120 --> 2:00:53.240\n to be unsane and happy than sane and unhappy but it is the best of all to be sane and happy\n\n2:00:53.240 --> 2:00:58.320\n whether our descendants can achieve that goal will be the greatest challenge of the future\n\n2:00:58.320 --> 2:01:05.080\n indeed it may well decide whether we have any future thank you for listening and hope\n\n2:01:05.080 --> 2:01:08.280\n to see you next time\n\n"
}