{
  "title": "Christof Koch: Consciousness | Lex Fridman Podcast #2",
  "id": "piHkfmeU7Wo",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.800\n As part of MIT course 6S099 on artificial general intelligence, I got a chance to sit\n\n00:05.800 --> 00:12.960\n down with Christoph Koch, who is one of the seminal figures in neurobiology, neuroscience,\n\n00:12.960 --> 00:15.640\n and generally in the study of consciousness.\n\n00:15.640 --> 00:21.180\n He is the president, the chief scientific officer of the Allen Institute for Brain Science\n\n00:21.180 --> 00:22.480\n in Seattle.\n\n00:22.480 --> 00:27.360\n From 1986 to 2013, he was a professor at Caltech.\n\n00:27.360 --> 00:33.880\n Before that, he was at MIT, he is extremely well cited, over 100,000 citations.\n\n00:33.880 --> 00:38.760\n His research, his writing, his ideas have had big impact on the scientific community\n\n00:38.760 --> 00:43.720\n and the general public in the way we think about consciousness, in the way we see ourselves\n\n00:43.720 --> 00:44.840\n as human beings.\n\n00:44.840 --> 00:49.360\n He's the author of several books, The Quest for Consciousness and Neurobiological Approach,\n\n00:49.360 --> 00:55.180\n and a more recent book, Consciousness, Confessions of a Romantic Reductionist.\n\n00:55.180 --> 01:00.000\n If you enjoy this conversation, this course, subscribe, click the little bell icon to make\n\n01:00.000 --> 01:05.180\n sure you never miss a video, and in the comments, leave suggestions for any people you'd like\n\n01:05.180 --> 01:09.800\n to see be part of the course or any ideas that you would like us to explore.\n\n01:09.800 --> 01:11.760\n Thanks very much and I hope you enjoy.\n\n01:11.760 --> 01:17.360\n Okay, before we delve into the beautiful mysteries of consciousness, let's zoom out a little\n\n01:17.360 --> 01:23.200\n bit and let me ask, do you think there's intelligent life out there in the universe?\n\n01:23.200 --> 01:25.560\n Yes, I do believe so.\n\n01:25.560 --> 01:29.600\n We have no evidence of it, but I think the probabilities are overwhelming in favor of\n\n01:29.600 --> 01:30.600\n it.\n\n01:30.600 --> 01:35.200\n Given a universe where we have 10 to the 11 galaxies and each galaxy has between 10 to\n\n01:35.200 --> 01:41.520\n the 11, 10 to the 12 stars and we know most stars have one or more planets.\n\n01:41.520 --> 01:43.480\n So how does that make you feel?\n\n01:43.480 --> 01:49.020\n It still makes me feel special because I have experiences.\n\n01:49.020 --> 01:55.320\n I feel the world, I experience the world and independent of whether there are other creatures\n\n01:55.320 --> 02:00.520\n out there, I still feel the world and I have access to this world in this very strange\n\n02:00.520 --> 02:04.760\n compelling way and that's the core of human existence.\n\n02:04.760 --> 02:10.480\n Now, you said human, do you think if those intelligent creatures are out there, do you\n\n02:10.480 --> 02:13.680\n think they experience their world?\n\n02:13.680 --> 02:18.120\n Yes, if they are evolved, if they are a product of natural evolution as they would have to\n\n02:18.120 --> 02:20.200\n be, they will also experience their own world.\n\n02:20.200 --> 02:24.640\n The consciousness isn't just human, you're right, it's much wider.\n\n02:24.640 --> 02:27.920\n It may be spread across all of biology.\n\n02:27.920 --> 02:30.880\n The only thing that we have special is we can talk about it.\n\n02:30.880 --> 02:33.360\n Of course, not all people can talk about it.\n\n02:33.360 --> 02:35.600\n Babies and little children can talk about it.\n\n02:35.600 --> 02:41.200\n Patients who have a stroke in the left inferior frontal gyrus can talk about it, but most\n\n02:41.200 --> 02:45.760\n normal adult people can talk about it and so we think that makes us special compared\n\n02:45.760 --> 02:49.480\n to let's say monkeys or dogs or cats or mice or all the other creatures that we share the\n\n02:49.480 --> 02:54.240\n planet with, but all the evidence seems to suggest that they too experience the world\n\n02:54.240 --> 02:59.520\n and so it's overwhelmingly likely that aliens would also experience their world.\n\n02:59.520 --> 03:02.520\n Of course, differently because they have a different sensorium, they have different sensors,\n\n03:02.520 --> 03:08.280\n they have a very different environment, but the fact that I would strongly suppose that\n\n03:08.280 --> 03:09.760\n they also have experiences.\n\n03:09.760 --> 03:16.400\n They feel pain and pleasure and see in some sort of spectrum and hear and have all the\n\n03:16.400 --> 03:17.760\n other senses.\n\n03:17.760 --> 03:21.080\n Of course, their language, if they have one, would be different so we might not be able\n\n03:21.080 --> 03:24.600\n to understand their poetry about the experiences that they have.\n\n03:24.600 --> 03:26.240\n That's correct.\n\n03:26.240 --> 03:33.200\n So in a talk, in a video, I've heard you mention Siputzo, a dachshund that you came up with,\n\n03:33.200 --> 03:37.160\n that you grew up with, it was part of your family when you were young.\n\n03:37.160 --> 03:40.840\n First of all, you're technically a Midwestern boy.\n\n03:40.840 --> 03:41.840\n You just –\n\n03:41.840 --> 03:42.840\n Technically.\n\n03:42.840 --> 03:43.840\n Yes.\n\n03:43.840 --> 03:48.480\n But after that, you traveled around a bit, hence a little bit of the accent.\n\n03:48.480 --> 03:55.920\n You talked about Siputzo, the dachshund, having these elements of humanness, of consciousness\n\n03:55.920 --> 03:56.920\n that you discovered.\n\n03:56.920 --> 04:01.440\n So I just wanted to ask, can you look back in your childhood and remember when was the\n\n04:01.440 --> 04:07.280\n first time you realized you yourself, sort of from a third person perspective, are a\n\n04:07.280 --> 04:08.800\n conscious being?\n\n04:08.800 --> 04:15.480\n This idea of stepping outside yourself and seeing there's something special going on\n\n04:15.480 --> 04:17.960\n here in my brain.\n\n04:17.960 --> 04:19.640\n I can't really actually – it's a good question.\n\n04:19.640 --> 04:21.960\n I'm not sure I recall a discrete moment.\n\n04:21.960 --> 04:25.880\n I mean, you take it for granted because that's the only world you know.\n\n04:25.880 --> 04:33.040\n The only world I know and you know is the world of seeing and hearing voices and touching\n\n04:33.040 --> 04:34.040\n and all the other things.\n\n04:34.040 --> 04:40.040\n So it's only much later at early – in my underguided days when I enrolled in physics\n\n04:40.040 --> 04:43.480\n and in philosophy that I really thought about it and thought, well, this is really fundamentally\n\n04:43.480 --> 04:48.040\n very, very mysterious and there's nothing really in physics right now that explains\n\n04:48.040 --> 04:52.000\n this transition from the physics of the brain to feelings.\n\n04:52.000 --> 04:53.480\n Where do the feelings come in?\n\n04:53.480 --> 04:57.560\n So you can look at the foundational equation of quantum mechanics, general relativity.\n\n04:57.560 --> 04:59.960\n You can look at the periodic table of the elements.\n\n04:59.960 --> 05:05.680\n You can look at the endless ATGC chat in our genes and nowhere is consciousness.\n\n05:05.680 --> 05:09.600\n Yet I wake up every morning to a world where I have experiences.\n\n05:09.600 --> 05:12.680\n And so that's the heart of the ancient mind body problem.\n\n05:12.680 --> 05:16.760\n How do experiences get into the world?\n\n05:16.760 --> 05:19.720\n So what is consciousness?\n\n05:19.720 --> 05:20.800\n Experience.\n\n05:20.800 --> 05:24.560\n This is any experience.\n\n05:24.560 --> 05:26.500\n Some people call it subjective feeling.\n\n05:26.500 --> 05:29.520\n Some people call it phenomenology.\n\n05:29.520 --> 05:31.500\n Some people call it qualia of the philosopher.\n\n05:31.500 --> 05:32.840\n But they all denote the same thing.\n\n05:32.840 --> 05:37.200\n It feels like something in the famous word of the philosopher Thomas Nagel.\n\n05:37.200 --> 05:45.200\n It feels like something to be a bat or to be an American or to be angry or to be sad\n\n05:45.200 --> 05:49.440\n or to be in love or to have pain.\n\n05:49.440 --> 05:53.080\n And that is what experience is, any possible experience.\n\n05:53.080 --> 05:55.320\n Could be as mundane as just sitting in a chair.\n\n05:55.320 --> 06:01.240\n Could be as exalted as having a mystical moment in deep meditation.\n\n06:01.240 --> 06:03.520\n Those are just different forms of experiences.\n\n06:03.520 --> 06:04.520\n Experience.\n\n06:04.520 --> 06:11.920\n So if you were to sit down with maybe the next, skip a couple generations, of IBM Watson,\n\n06:11.920 --> 06:18.320\n something that won Jeopardy, what is the gap, I guess the question is, between Watson, that\n\n06:18.320 --> 06:26.280\n might be much smarter than you, than us, than any human alive, but may not have experience,\n\n06:26.280 --> 06:27.280\n what is the gap?\n\n06:27.280 --> 06:30.520\n Well, so that's a big, big question.\n\n06:30.520 --> 06:35.720\n That's occupied people for the last, certainly last 50 years since we, you know, since the\n\n06:35.720 --> 06:39.040\n advent, the birth of computers.\n\n06:39.040 --> 06:40.920\n That's a question Alan Turing tried to answer.\n\n06:40.920 --> 06:46.280\n And of course he did it in this indirect way by proposing a test, an operational test.\n\n06:46.280 --> 06:50.400\n But that's not really, that's, you know, he tried to get at what does it mean for a person\n\n06:50.400 --> 06:52.840\n to think, and then he had this test, right?\n\n06:52.840 --> 06:57.200\n You lock them away, and then you have a communication with them, and then you try to guess after\n\n06:57.200 --> 07:00.720\n a while whether that is a person or whether it's a computer system.\n\n07:00.720 --> 07:05.400\n There's no question that now or very soon, you know, Alexa or Siri or, you know, Google\n\n07:05.400 --> 07:07.640\n now will pass this test, right?\n\n07:07.640 --> 07:12.440\n And you can game it, but you know, ultimately, certainly in your generation, there will be\n\n07:12.440 --> 07:16.680\n machines that will speak with complete poise that will remember everything you ever said.\n\n07:16.680 --> 07:21.320\n They'll remember every email you ever had, like Samantha, remember in the movie Her?\n\n07:21.320 --> 07:22.320\n Yeah.\n\n07:22.320 --> 07:24.360\n There's no question it's going to happen.\n\n07:24.360 --> 07:28.280\n But of course, the key question is, does it feel like anything to be Samantha in the movie\n\n07:28.280 --> 07:29.280\n Her?\n\n07:29.280 --> 07:32.200\n Or does it feel like anything to be Watson?\n\n07:32.200 --> 07:38.200\n And there one has to very, very strongly think there are two different concepts here that\n\n07:38.200 --> 07:39.200\n we co mingle.\n\n07:39.200 --> 07:45.160\n There is the concept of intelligence, natural or artificial, and there is a concept of consciousness,\n\n07:45.160 --> 07:47.400\n of experience, natural or artificial.\n\n07:47.400 --> 07:49.440\n Those are very, very different things.\n\n07:49.440 --> 07:53.440\n Now, historically, we associate consciousness with intelligence.\n\n07:53.440 --> 07:54.440\n Why?\n\n07:54.440 --> 07:59.240\n Because we live in a world, leaving aside computers, of natural selection, where we're\n\n07:59.240 --> 08:04.120\n surrounded by creatures, either our own kin that are less or more intelligent, or we go\n\n08:04.120 --> 08:06.040\n across species.\n\n08:06.040 --> 08:08.120\n Some are more adapted to a particular environment.\n\n08:08.120 --> 08:12.760\n Others are less adapted, whether it's a whale or dog, or you go talk about a paramecium\n\n08:12.760 --> 08:15.040\n or a little worm.\n\n08:15.040 --> 08:21.240\n And we see the complexity of the nervous system goes from one cell to specialized cells, to\n\n08:21.240 --> 08:26.000\n a worm that has three nets, that has 30 percent of its cells are nerve cells, to creature\n\n08:26.000 --> 08:30.160\n like us or like a blue whale that has 100 billion, even more nerve cells.\n\n08:30.160 --> 08:35.160\n And so based on behavioral evidence and based on the underlying neuroscience, we believe\n\n08:35.160 --> 08:40.840\n that as these creatures become more complex, they are better adapted to their particular\n\n08:40.840 --> 08:46.520\n ecological niche, and they become more conscious, partly because their brain grows.\n\n08:46.520 --> 08:50.840\n And we believe consciousness, unlike the ancient, ancient people thought most, almost every\n\n08:50.840 --> 08:55.240\n culture thought that consciousness with intelligence has to do with your heart.\n\n08:55.240 --> 08:56.920\n And you still see that today.\n\n08:56.920 --> 08:59.420\n You see, honey, I love you with all my heart.\n\n08:59.420 --> 09:04.440\n But what you should actually say is, no, honey, I love you with all my lateral hypothalamus.\n\n09:04.440 --> 09:09.280\n And for Valentine's Day, you should give your sweetheart, you know, hypothalamus, a piece\n\n09:09.280 --> 09:11.400\n of chocolate and not a heart shaped chocolate.\n\n09:11.400 --> 09:14.560\n Anyway, so we still have this language, but now we believe it's a brain.\n\n09:14.560 --> 09:18.720\n And so we see brains of different complexity and we think, well, they have different levels\n\n09:18.720 --> 09:19.720\n of consciousness.\n\n09:19.720 --> 09:25.300\n They're capable of different experiences.\n\n09:25.300 --> 09:32.040\n But now we confront the world where we know where we're beginning to engineer intelligence.\n\n09:32.040 --> 09:37.080\n And it's radical unclear whether the intelligence we're engineering has anything to do with\n\n09:37.080 --> 09:40.120\n consciousness and whether it can experience anything.\n\n09:40.120 --> 09:42.900\n Because fundamentally, what's the difference?\n\n09:42.900 --> 09:44.840\n Intelligence is about function.\n\n09:44.840 --> 09:48.840\n Intelligence no matter exactly how you define it, sort of adaptation to new environments,\n\n09:48.840 --> 09:53.240\n being able to learn and quickly understand, you know, the setup of this and what's going\n\n09:53.240 --> 09:55.900\n on and who are the actors and what's going to happen next.\n\n09:55.900 --> 09:58.200\n That's all about function.\n\n09:58.200 --> 10:00.800\n Consciousness is not about function.\n\n10:00.800 --> 10:02.420\n Consciousness is about being.\n\n10:02.420 --> 10:05.640\n It's in some sense much fundamental.\n\n10:05.640 --> 10:08.760\n You can see this in several cases.\n\n10:08.760 --> 10:12.160\n You can see it, for instance, in the case of the clinic.\n\n10:12.160 --> 10:17.200\n When you're dealing with patients who are, let's say, had a stroke or had were in traffic\n\n10:17.200 --> 10:20.120\n accident, et cetera, they're pretty much immobile.\n\n10:20.120 --> 10:26.640\n Terri Schiavo, you may have heard historically, she was a person here in the 90s in Florida.\n\n10:26.640 --> 10:27.640\n Her heart stood still.\n\n10:27.640 --> 10:28.640\n She was reanimated.\n\n10:28.640 --> 10:31.760\n And then for the next 14 years, she was what's called in a vegetative state.\n\n10:31.760 --> 10:34.000\n So there are thousands of people in a vegetative state.\n\n10:34.000 --> 10:36.720\n So they're, you know, they're, you know, they're like this.\n\n10:36.720 --> 10:40.680\n Occasionally, they open their eyes for two, three, four, five, six, eight hours, and then\n\n10:40.680 --> 10:41.680\n close their eyes.\n\n10:41.680 --> 10:42.680\n They have sleep wake cycle.\n\n10:42.680 --> 10:44.160\n Occasionally, they have behaviors.\n\n10:44.160 --> 10:50.480\n They do like, you know, but there's no way that you can establish a lawful relationship\n\n10:50.480 --> 10:55.360\n between what you say or the doctor says or the mom says and what the patient does.\n\n10:55.360 --> 11:03.120\n So there isn't any behavior, yet in some of these people, there is still experience.\n\n11:03.120 --> 11:08.840\n You can design and build brain machine interfaces where you can see there's still experience\n\n11:08.840 --> 11:09.840\n something.\n\n11:09.840 --> 11:13.640\n And of course, these cases of locked in state, there's this famous book called The Diving\n\n11:13.640 --> 11:19.640\n Bell and the Butterfly, where you had an editor, a French editor, he had a stroke in the brainstem,\n\n11:19.640 --> 11:22.960\n unable to move except his vertical eyes, eye movement.\n\n11:22.960 --> 11:25.280\n He could just move his eyes up and down.\n\n11:25.280 --> 11:27.840\n And he dictated an entire book.\n\n11:27.840 --> 11:30.320\n And some people even lose this at the end.\n\n11:30.320 --> 11:33.360\n All the evidence seems to suggest that they're still in there.\n\n11:33.360 --> 11:37.520\n In this case, you have no behavior, you have consciousness.\n\n11:37.520 --> 11:41.880\n Second case is tonight, like all of us, you're going to go to sleep, close your eyes, you\n\n11:41.880 --> 11:46.520\n go to sleep, you will wake up inside your sleeping body, and you will have conscious\n\n11:46.520 --> 11:47.520\n experiences.\n\n11:47.520 --> 11:49.840\n They are different from everyday experience.\n\n11:49.840 --> 11:53.520\n You might fly, you might not be surprised that you're flying, you might meet a long\n\n11:53.520 --> 11:58.280\n dead pet, childhood dog, and you're not surprised that you're meeting them.\n\n11:58.280 --> 12:02.420\n But you have conscious experience of love, of hate, they can be very emotional.\n\n12:02.420 --> 12:07.680\n Your body during this state, typically it's REM state, sends an active signal to your\n\n12:07.680 --> 12:09.360\n motor neurons to paralyze you.\n\n12:09.360 --> 12:11.720\n It's called atonia.\n\n12:11.720 --> 12:14.220\n Because if you don't have that, like some patients, what do you do?\n\n12:14.220 --> 12:15.660\n You act out your dreams.\n\n12:15.660 --> 12:19.960\n You get, for example, REM behavioral disorder, which is bad juju to get.\n\n12:19.960 --> 12:20.960\n Okay.\n\n12:20.960 --> 12:22.760\n Third case is pure experience.\n\n12:22.760 --> 12:27.400\n So I recently had this, what some people call a mystical experience.\n\n12:27.400 --> 12:30.240\n I went to Singapore and went into a flotation tank.\n\n12:30.240 --> 12:31.240\n Yeah.\n\n12:31.240 --> 12:32.240\n All right.\n\n12:32.240 --> 12:37.800\n So this is a big tub filled with water, that's body temperature and Epsom salt.\n\n12:37.800 --> 12:41.440\n You strip completely naked, you lie inside of it, you close the lid.\n\n12:41.440 --> 12:42.440\n Darkness.\n\n12:42.440 --> 12:44.920\n Complete darkness, soundproof.\n\n12:44.920 --> 12:48.640\n So very quickly, you become bodiless because you're floating and you're naked.\n\n12:48.640 --> 12:50.580\n You have no rings, no watch, no nothing.\n\n12:50.580 --> 12:52.880\n You don't feel your body anymore.\n\n12:52.880 --> 12:54.640\n There's no sound, soundless.\n\n12:54.640 --> 13:01.080\n There's no photon, sightless, timeless, because after a while, early on you actually hear\n\n13:01.080 --> 13:06.600\n your heart, but then you sort of adapt to that and then sort of the passage of time\n\n13:06.600 --> 13:07.600\n ceases.\n\n13:07.600 --> 13:08.600\n Yeah.\n\n13:08.600 --> 13:12.560\n And if you train yourself, like in a meditation, not to think, early on you think a lot.\n\n13:12.560 --> 13:13.560\n It's a little bit spooky.\n\n13:13.560 --> 13:17.000\n You feel somewhat uncomfortable or you think, well, I'm going to get bored.\n\n13:17.000 --> 13:20.640\n And if you try to not to think actively, you become mindless.\n\n13:20.640 --> 13:27.120\n There you are, bodiless, timeless, you know, soundless, sightless, mindless, but you're\n\n13:27.120 --> 13:28.120\n in a conscious experience.\n\n13:28.120 --> 13:29.120\n You're not asleep.\n\n13:29.120 --> 13:30.120\n Yeah.\n\n13:30.120 --> 13:31.120\n You're not asleep.\n\n13:31.120 --> 13:33.640\n You are a being of pure, you're a pure being.\n\n13:33.640 --> 13:34.640\n There isn't any function.\n\n13:34.640 --> 13:36.280\n You aren't doing any computation.\n\n13:36.280 --> 13:37.280\n You're not remembering.\n\n13:37.280 --> 13:38.280\n You're not projecting.\n\n13:38.280 --> 13:39.280\n You're not planning.\n\n13:39.280 --> 13:40.680\n Yet you are fully conscious.\n\n13:40.680 --> 13:41.960\n You're fully conscious.\n\n13:41.960 --> 13:42.960\n There's something going on there.\n\n13:42.960 --> 13:44.320\n It could be just a side effect.\n\n13:44.320 --> 13:45.320\n So what is the...\n\n13:45.320 --> 13:47.880\n You mean epiphenomena.\n\n13:47.880 --> 13:57.480\n So what's the select, meaning why, what is the function of you being able to lay in this\n\n13:57.480 --> 14:01.120\n sensory free deprivation tank and still have a conscious experience?\n\n14:01.120 --> 14:02.120\n Evolutionary?\n\n14:02.120 --> 14:03.120\n Evolutionary.\n\n14:03.120 --> 14:06.720\n Obviously we didn't evolve with flotation tanks in our environment.\n\n14:06.720 --> 14:11.520\n I mean, so biology is notoriously bad at asking why question, telenormical question.\n\n14:11.520 --> 14:12.520\n Why do we have two eyes?\n\n14:12.520 --> 14:15.520\n Why don't we have four eyes like some teachers or three eyes or something?\n\n14:15.520 --> 14:20.440\n Well, no, there's probably, there is a function to that, but we're not very good at answering\n\n14:20.440 --> 14:21.440\n those questions.\n\n14:21.440 --> 14:25.200\n We can speculate endlessly where biology is very, or science is very good about mechanistic\n\n14:25.200 --> 14:26.200\n question.\n\n14:26.200 --> 14:27.200\n Why is there a charge in the universe?\n\n14:27.200 --> 14:28.200\n Right?\n\n14:28.200 --> 14:30.200\n We find a certain universe where there are positive and negative charges.\n\n14:30.200 --> 14:31.200\n Why?\n\n14:31.200 --> 14:33.040\n Why does quantum mechanics hold?\n\n14:33.040 --> 14:36.040\n You know, why doesn't some other theory hold?\n\n14:36.040 --> 14:38.600\n Quantum mechanics holding our universe is very unclear why.\n\n14:38.600 --> 14:42.120\n So telenormical question, why questions are difficult to answer.\n\n14:42.120 --> 14:49.000\n There's some relationship between complexity, brain processing power and consciousness.\n\n14:49.000 --> 14:53.800\n But however, in these cases, in these three examples I gave, one is an everyday experience\n\n14:53.800 --> 14:54.800\n at night.\n\n14:54.800 --> 14:55.800\n The other one is trauma.\n\n14:55.800 --> 15:00.520\n And third one is in principle, you can, everybody can have these sort of mystical experiences.\n\n15:00.520 --> 15:09.440\n You have a dissociation of function from, of intelligence from consciousness.\n\n15:09.440 --> 15:12.260\n You caught me asking a why question.\n\n15:12.260 --> 15:15.180\n Let me ask a question that's not a why question.\n\n15:15.180 --> 15:19.440\n You're giving a talk later today on the Turing test for intelligence and consciousness, drawing\n\n15:19.440 --> 15:21.320\n lines between the two.\n\n15:21.320 --> 15:28.320\n So is there a scientific way to say there's consciousness present in this entity or not?\n\n15:28.320 --> 15:34.220\n And to anticipate your answer, cause you, you will also, there's a neurobiological answer.\n\n15:34.220 --> 15:38.640\n So we can test the human brain, but if you take a machine brain that you don't know tests\n\n15:38.640 --> 15:45.440\n for yet, how would you even begin to approach a test if there's consciousness present in\n\n15:45.440 --> 15:46.440\n this thing?\n\n15:46.440 --> 15:47.440\n Okay.\n\n15:47.440 --> 15:48.440\n That's a really good question.\n\n15:48.440 --> 15:49.440\n So let me take it in two steps.\n\n15:49.440 --> 15:54.280\n So as you point out for, for, for, for humans, let's just stick with humans.\n\n15:54.280 --> 15:58.680\n There's now a test called the Zap and Zip is a procedure where you ping the brain using\n\n15:58.680 --> 16:00.960\n transcranial magnetic stimulation.\n\n16:00.960 --> 16:06.000\n You look at the electrical reverberations essentially using EG, and then you can measure\n\n16:06.000 --> 16:07.880\n the complexity of this brain response.\n\n16:07.880 --> 16:12.360\n And you can do this in awake people, in asleep, normal people, you can do it in awake people\n\n16:12.360 --> 16:13.740\n and then anesthetize them.\n\n16:13.740 --> 16:15.640\n You can do it in patients.\n\n16:15.640 --> 16:20.400\n And it, it, it has a hundred percent accuracy that in all those cases, when you're clear,\n\n16:20.400 --> 16:23.920\n the patient or the person is either conscious or unconscious, the complexity is either high\n\n16:23.920 --> 16:24.960\n or low.\n\n16:24.960 --> 16:28.640\n And then you can adopt these techniques to similar creatures like monkeys and dogs and,\n\n16:28.640 --> 16:32.080\n and, and mice that have very similar brains.\n\n16:32.080 --> 16:36.320\n Now of course you, you point out that may not help you because we don't have a cortex,\n\n16:36.320 --> 16:40.120\n you know, and if I send a magnetic pulse into my iPhone or my computer, it's probably going\n\n16:40.120 --> 16:41.520\n to break something.\n\n16:41.520 --> 16:42.520\n So we don't have that.\n\n16:42.520 --> 16:47.460\n So what we need ultimately, we need a theory of consciousness.\n\n16:47.460 --> 16:49.400\n We can't just rely on our intuition.\n\n16:49.400 --> 16:52.840\n Our intuition is, well, yeah, if somebody talks, they're conscious.\n\n16:52.840 --> 16:56.760\n However, then there are all these patients, children, babies don't talk, right?\n\n16:56.760 --> 17:01.400\n But we believe that, that the babies also have conscious experiences, right?\n\n17:01.400 --> 17:04.960\n And then there are all these patients I mentioned and they don't talk.\n\n17:04.960 --> 17:07.800\n When you dream, you can't talk because you're paralyzed.\n\n17:07.800 --> 17:11.220\n So what we ultimately need, we can't just rely on our intuition.\n\n17:11.220 --> 17:15.560\n We need a theory of conscience that tells us what is it about a piece of matter?\n\n17:15.560 --> 17:19.720\n What is it about a piece of highly excitable matter like the brain or like a computer that\n\n17:19.720 --> 17:21.840\n gives rise to conscious experience?\n\n17:21.840 --> 17:24.400\n We all believe, none of us believes anymore in the old story.\n\n17:24.400 --> 17:25.680\n It's a soul, right?\n\n17:25.680 --> 17:28.680\n That used to be the most common explanation that most people accept that instill a lot\n\n17:28.680 --> 17:34.040\n of people today believe, well, there's, there's God endowed only us with a special thing\n\n17:34.040 --> 17:35.440\n that animals don't have.\n\n17:35.440 --> 17:39.900\n Rene Descartes famously said, a dog, if you hit it with your carriage may yell, may cry,\n\n17:39.900 --> 17:41.840\n but it doesn't have this special thing.\n\n17:41.840 --> 17:45.120\n It doesn't have the magic, the magic soul.\n\n17:45.120 --> 17:46.680\n It doesn't have res cogitans, the soul.\n\n17:46.680 --> 17:48.920\n Now we believe that isn't the case anymore.\n\n17:48.920 --> 17:55.680\n So what is the difference between brains and, and these guys, silicon?\n\n17:55.680 --> 17:58.200\n And in particular, once their behavior matches.\n\n17:58.200 --> 18:03.220\n So if you have Siri or Alexa in 20 years from now that she can talk just as good as any\n\n18:03.220 --> 18:07.680\n possible human, what grounds do you have to say she's not conscious in particular, if\n\n18:07.680 --> 18:11.520\n she says it's of course she will, well, of course I'm conscious.\n\n18:11.520 --> 18:12.600\n You ask her how are you doing?\n\n18:12.600 --> 18:17.840\n And she'll say, well, you know, they, they'll generate some way to, of course she'll behave\n\n18:17.840 --> 18:19.880\n like a, like a person.\n\n18:19.880 --> 18:21.640\n Now there's several differences.\n\n18:21.640 --> 18:28.260\n One is, so this relates to the problem, the very hard, why is consciousness a hard problem?\n\n18:28.260 --> 18:30.760\n It's because it's subjective, right?\n\n18:30.760 --> 18:36.440\n Only I have it, for only I know I have direct experience of my own consciousness.\n\n18:36.440 --> 18:38.780\n I don't have experience in your consciousness.\n\n18:38.780 --> 18:42.720\n Now I assume as a sort of a Bayesian person who believes in probability theory and all\n\n18:42.720 --> 18:46.960\n of that, you know, I can do, I can do an abduction to the, to the best available facts.\n\n18:46.960 --> 18:48.920\n I deduce your brain is very similar to mine.\n\n18:48.920 --> 18:53.160\n If I put you in a scanner, your brain is roughly going to behave the same way as I do.\n\n18:53.160 --> 18:56.480\n If, if, if, you know, if I give you this muesli and ask you, how does it taste?\n\n18:56.480 --> 19:00.520\n You tell me things that, you know, that, that I would also say more or less, right?\n\n19:00.520 --> 19:02.680\n So I infer based on all of that, that you're conscious.\n\n19:02.680 --> 19:03.920\n Now with theory, I can't do that.\n\n19:03.920 --> 19:09.280\n So there I really need a theory that tells me what is it about, about any system, this\n\n19:09.280 --> 19:11.240\n or this, that makes it conscious.\n\n19:11.240 --> 19:12.240\n We have such a theory.\n\n19:12.240 --> 19:13.240\n Yes.\n\n19:13.240 --> 19:17.640\n So the integrated information theory, but let me first, maybe as an introduction for\n\n19:17.640 --> 19:24.280\n people who are not familiar, Descartes, can you, you talk a lot about pan, panpsychism.\n\n19:24.280 --> 19:29.320\n Can you describe what, uh, physicalism versus dualism?\n\n19:29.320 --> 19:33.520\n This you, you mentioned the soul, what, what is the history of that idea?\n\n19:33.520 --> 19:39.600\n What is the idea of panpsychism or no, the debate really, uh, out of which panpsychism\n\n19:39.600 --> 19:48.480\n can, um, emerge of, of, of, um, dualism versus, uh, physicalism or do you not see panpsychism\n\n19:48.480 --> 19:49.480\n as fitting into that?\n\n19:49.480 --> 19:52.640\n No, you can argue there's some, okay, so let's step back.\n\n19:52.640 --> 19:57.800\n So panpsychism is a very ancient belief that's been around, uh, I mean, Plato and Aristotle\n\n19:57.800 --> 20:01.560\n talks about it, uh, modern philosophers talk about it.\n\n20:01.560 --> 20:06.200\n Of course, in Buddhism, the idea is very prevalent that, I mean, there are different versions\n\n20:06.200 --> 20:07.200\n of it.\n\n20:07.200 --> 20:12.400\n One version says everything is ensouled, everything, rocks and stones and dogs and people and forest\n\n20:12.400 --> 20:14.480\n and iPhones, all of us all, right?\n\n20:14.480 --> 20:15.480\n All matter is ensouled.\n\n20:15.480 --> 20:17.240\n That's sort of one version.\n\n20:17.240 --> 20:24.120\n Another version is that all biology, all creatures, small or large, from a single cell to a giant\n\n20:24.120 --> 20:26.160\n sequoia tree feel like something.\n\n20:26.160 --> 20:28.280\n This one I think is somewhat more realistic.\n\n20:28.280 --> 20:33.180\n Um, so the different versions, what do you mean by feel like something, have, have feelings,\n\n20:33.180 --> 20:37.000\n have some kind of, it feels like something, it may well be possible that it feels like\n\n20:37.000 --> 20:39.360\n something to be a paramecium.\n\n20:39.360 --> 20:45.080\n I think it's pretty likely it feels like something to be a bee or a mouse or a dog.\n\n20:45.080 --> 20:46.080\n Sure.\n\n20:46.080 --> 20:47.080\n So, okay.\n\n20:47.080 --> 20:53.200\n So, so that you can see that's also, so panpsychism is very broad and you can, so some people,\n\n20:53.200 --> 20:59.520\n for example, Bertrand Russell, tried to advocate this, this idea, it's called Rasselian Monism,\n\n20:59.520 --> 21:04.400\n that that panpsychism is really physics viewed from the inside.\n\n21:04.400 --> 21:09.920\n So the idea is that physics is very good at describing relationship among objects like\n\n21:09.920 --> 21:12.920\n charges or like gravity, right?\n\n21:12.920 --> 21:16.840\n You know, describe the relationship between curvature and mass distribution, okay?\n\n21:16.840 --> 21:18.480\n That's the relationship among things.\n\n21:18.480 --> 21:21.000\n Physics doesn't really describe the ultimate reality itself.\n\n21:21.000 --> 21:25.720\n It's just relationship among, you know, quarks or all these other stuff from like a third\n\n21:25.720 --> 21:27.280\n person observer.\n\n21:27.280 --> 21:28.280\n Yes.\n\n21:28.280 --> 21:29.280\n Yes.\n\n21:29.280 --> 21:30.280\n Yes.\n\n21:30.280 --> 21:31.880\n And consciousness is what physics feels from the inside.\n\n21:31.880 --> 21:36.760\n So my conscious experience, it's the way the physics of my brain, particularly my cortex\n\n21:36.760 --> 21:38.680\n feels from the inside.\n\n21:38.680 --> 21:42.720\n And so if you are paramecium, you got to remember, you say paramecium, well, that's a pretty\n\n21:42.720 --> 21:43.720\n dumb creature.\n\n21:43.720 --> 21:49.960\n It is, but it has already a billion different molecules, probably, you know, 5,000 different\n\n21:49.960 --> 21:54.880\n proteins assembled in a highly, highly complex system that no single person, no computer\n\n21:54.880 --> 21:59.280\n system so far on this planet has ever managed to accurately simulate.\n\n21:59.280 --> 22:01.040\n Its complexity vastly escapes us.\n\n22:01.040 --> 22:02.040\n Yes.\n\n22:02.040 --> 22:04.800\n And it may well be that that little thing feels like a tiny bit.\n\n22:04.800 --> 22:06.520\n Now, it doesn't have a voice in the head like me.\n\n22:06.520 --> 22:07.520\n It doesn't have expectations.\n\n22:07.520 --> 22:12.520\n You know, it doesn't have all that complex things, but it may well feel like something.\n\n22:12.520 --> 22:13.520\n Yeah.\n\n22:13.520 --> 22:14.520\n So this is really interesting.\n\n22:14.520 --> 22:20.920\n Can we draw some lines and maybe try to understand the difference between life, intelligence\n\n22:20.920 --> 22:23.360\n and consciousness?\n\n22:23.360 --> 22:25.480\n How do you see all of those?\n\n22:25.480 --> 22:31.320\n If you had to define what is a living thing, what is a conscious thing and what is an intelligent\n\n22:31.320 --> 22:32.320\n thing?\n\n22:32.320 --> 22:34.480\n Do those intermix for you or are they totally separate?\n\n22:34.480 --> 22:35.480\n Okay.\n\n22:35.480 --> 22:38.040\n So A, that's a question that we don't have a full answer to.\n\n22:38.040 --> 22:42.080\n A lot of the stuff we're talking about today is full of mysteries and fascinating ones,\n\n22:42.080 --> 22:43.080\n right?\n\n22:43.080 --> 22:46.880\n For example, you can go to Aristotle, who's probably the most important scientist and\n\n22:46.880 --> 22:49.760\n philosopher who's ever lived in, certainly in Western culture.\n\n22:49.760 --> 22:51.760\n He had this idea, it's called hylomorphism.\n\n22:51.760 --> 22:55.160\n It's quite popular these days, that there are different forms of soul.\n\n22:55.160 --> 22:57.400\n The soul is really the form of something.\n\n22:57.400 --> 23:00.760\n He says, all biological creatures have a vegetative soul.\n\n23:00.760 --> 23:01.760\n That's life principle.\n\n23:01.760 --> 23:07.400\n Today, we think we understand something more than it is biochemistry and nonlinear thermodynamics.\n\n23:07.400 --> 23:09.480\n Then he said they have a sensitive soul.\n\n23:09.480 --> 23:15.080\n Only animals and humans have also a sensitive soul or a petitive soul.\n\n23:15.080 --> 23:18.240\n They can see, they can smell, and they have drives.\n\n23:18.240 --> 23:21.080\n They want to reproduce, they want to eat, et cetera.\n\n23:21.080 --> 23:26.080\n And then only humans have what he called a rational soul, okay?\n\n23:26.080 --> 23:30.040\n And that idea then made it into Christendom and then the rational soul is the one that\n\n23:30.040 --> 23:31.040\n lives forever.\n\n23:31.040 --> 23:32.040\n He was very unclear.\n\n23:32.040 --> 23:35.640\n He wasn't really, I mean, different readings of Aristotle give different, whether did he\n\n23:35.640 --> 23:38.240\n believe that rational soul was immortal or not.\n\n23:38.240 --> 23:39.800\n I probably think he didn't.\n\n23:39.800 --> 23:43.040\n But then, of course, that made it through Plato into Christianity, and then this soul\n\n23:43.040 --> 23:48.440\n became immortal and then became the connection to God.\n\n23:48.440 --> 23:54.440\n So you ask me, essentially, what is our modern conception of these three, Aristotle would\n\n23:54.440 --> 23:56.200\n have called them different forms.\n\n23:56.200 --> 24:00.200\n Life, we think we know something about it, at least life on this planet, right?\n\n24:00.200 --> 24:04.040\n Although we don't understand how to originate it, but it's been difficult to rigorously\n\n24:04.040 --> 24:05.280\n pin down.\n\n24:05.280 --> 24:08.640\n You see this in modern definitions of death.\n\n24:08.640 --> 24:14.160\n In fact, right now, there's a conference ongoing, again, that tries to define legally and medically\n\n24:14.160 --> 24:15.400\n what is death.\n\n24:15.400 --> 24:16.400\n It used to be very simple.\n\n24:16.400 --> 24:21.780\n Death is you stop breathing, your heart stops beating, you're dead, totally uncontroversial.\n\n24:21.780 --> 24:23.480\n If you're unsure, you wait another 10 minutes.\n\n24:23.480 --> 24:25.320\n If the patient doesn't breathe, he's dead.\n\n24:25.320 --> 24:29.540\n Well, now we have ventilators, we have heart pacemakers, so it's much more difficult to\n\n24:29.540 --> 24:30.880\n define what death is.\n\n24:30.880 --> 24:35.840\n Typically, death is defined as the end of life and life is defined before death.\n\n24:35.840 --> 24:39.280\n Okay, so we don't have really very good definitions.\n\n24:39.280 --> 24:41.840\n Intelligence, we don't have a rigorous definition.\n\n24:41.840 --> 24:46.640\n We know something how to measure, it's called IQ or G factors, right?\n\n24:46.640 --> 24:50.360\n And we're beginning to build it in a narrow sense, right?\n\n24:50.360 --> 24:56.800\n Like go, AlphaGo and Watson and, you know, Google cars and Uber cars and all of that,\n\n24:56.800 --> 25:01.240\n it's still narrow AI and some people are thinking about artificial general intelligence.\n\n25:01.240 --> 25:05.320\n But roughly, as we said before, it's something to do with ability to learn and to adapt to\n\n25:05.320 --> 25:06.600\n new environments.\n\n25:06.600 --> 25:11.080\n But that is, as I said, also, it's radical difference from experience.\n\n25:11.080 --> 25:16.480\n And it's very unclear if you build a machine that has AGI, it's not at all a priori, it's\n\n25:16.480 --> 25:20.760\n not at all clear that this machine will have consciousness, it may or may not.\n\n25:20.760 --> 25:25.000\n So let's ask it the other way, do you think if you were to try to build an artificial\n\n25:25.000 --> 25:31.080\n general intelligence system, do you think figuring out how to build artificial consciousness\n\n25:31.080 --> 25:34.960\n would help you get to an AGI?\n\n25:34.960 --> 25:40.480\n So or put another way, do you think intelligent requires consciousness?\n\n25:40.480 --> 25:43.160\n In human, it goes hand in hand.\n\n25:43.160 --> 25:48.360\n In human, or I think in biology, consciousness, intelligence goes hand in hand, quay is illusion\n\n25:48.360 --> 25:54.480\n because the brain evolved to be highly complex, complexity via the theory integrated information\n\n25:54.480 --> 25:59.720\n theory is sort of ultimately is what is closely tied to consciousness.\n\n25:59.720 --> 26:01.680\n Ultimately it's causal power upon itself.\n\n26:01.680 --> 26:05.100\n And so in evolved systems, they go together.\n\n26:05.100 --> 26:09.440\n In artificial system, particularly in digital machines, they do not go together.\n\n26:09.440 --> 26:16.480\n And if you ask me point blank, is Alexa 20.0 in the year 2040, when she can easily pass\n\n26:16.480 --> 26:18.280\n every Turing test, is she conscious?\n\n26:18.280 --> 26:21.080\n No, even if she claims she's conscious.\n\n26:21.080 --> 26:24.180\n In fact, you could even do a more radical version of this thought experiment.\n\n26:24.180 --> 26:26.840\n You can build a computer simulation of the human brain.\n\n26:26.840 --> 26:31.240\n You know what Henry Markham in the Blue Brain Project or the Human Brain Project in Switzerland\n\n26:31.240 --> 26:32.240\n is trying to do.\n\n26:32.240 --> 26:33.640\n Let's grant them all the success.\n\n26:33.640 --> 26:36.720\n So in 10 years, we have this perfect simulation of the human brain.\n\n26:36.720 --> 26:40.440\n Every neuron is simulated and it has a larynx and it has motor neurons.\n\n26:40.440 --> 26:45.480\n It has a Broca's area and of course they'll talk and they'll say, hi, I just woke up.\n\n26:45.480 --> 26:46.480\n I feel great.\n\n26:46.480 --> 26:50.480\n OK, even that computer simulation that can in principle map onto your brain will not\n\n26:50.480 --> 26:51.480\n be conscious.\n\n26:51.480 --> 26:52.480\n Why?\n\n26:52.480 --> 26:56.000\n Because it simulates, it's a difference between the simulated and the real.\n\n26:56.000 --> 26:59.280\n So it simulates the behavior associated with consciousness.\n\n26:59.280 --> 27:04.000\n It might be, it will, if it's done properly, will have all the intelligence that that particular\n\n27:04.000 --> 27:06.080\n person they're simulating has.\n\n27:06.080 --> 27:10.800\n But simulating intelligence is not the same as having conscious experiences.\n\n27:10.800 --> 27:15.200\n And I give you a really nice metaphor that engineers and physicists typically get.\n\n27:15.200 --> 27:19.720\n I can write down Einstein's field equation, nine or ten equations that describe the link\n\n27:19.720 --> 27:23.400\n in general relativity between curvature and mass.\n\n27:23.400 --> 27:24.400\n I can do that.\n\n27:24.400 --> 27:29.920\n I can run this on my laptop to predict that the central, the black hole at the center\n\n27:29.920 --> 27:36.440\n of our galaxy will be so massive that it will twist space time around it so no light can\n\n27:36.440 --> 27:37.440\n escape.\n\n27:37.440 --> 27:38.580\n It's a black hole.\n\n27:38.580 --> 27:44.400\n But funny, have you ever wondered why doesn't this computer simulation suck me in?\n\n27:44.400 --> 27:49.020\n It simulates gravity, but it doesn't have the causal power of gravity.\n\n27:49.020 --> 27:50.760\n That's a huge difference.\n\n27:50.760 --> 27:55.520\n So it's a difference between the real and the simulator, just like it doesn't get wet\n\n27:55.520 --> 27:59.080\n inside a computer when the computer runs code that simulates a weather storm.\n\n27:59.080 --> 28:04.560\n And so in order to have, to have artificial consciousness, you have to give it the same\n\n28:04.560 --> 28:06.880\n causal power as the human brain.\n\n28:06.880 --> 28:11.560\n You have to build so called a neuromorphic machine that has hardware that is very similar\n\n28:11.560 --> 28:16.520\n to the human brain, not a digital clocked phenomenon computer.\n\n28:16.520 --> 28:24.000\n So that's, just to clarify though, you think that consciousness is not required to create\n\n28:24.000 --> 28:25.560\n human level intelligence.\n\n28:25.560 --> 28:30.360\n It seems to accompany in the human brain, but for machine not.\n\n28:30.360 --> 28:31.840\n That's correct.\n\n28:31.840 --> 28:39.220\n So maybe just because this is AGI, let's dig in a little bit about what we mean by intelligence.\n\n28:39.220 --> 28:44.280\n So one thing is the G factor, these kind of IQ tests of intelligence.\n\n28:44.280 --> 28:51.400\n But I think if you, maybe another way to say, so in 2040, 2050, people will have Siri that\n\n28:51.400 --> 28:54.840\n is just really impressive.\n\n28:54.840 --> 28:57.800\n Do you think people will say Siri is intelligent?\n\n28:57.800 --> 28:58.800\n Yes.\n\n28:58.800 --> 29:01.200\n Intelligence is this amorphous thing.\n\n29:01.200 --> 29:05.560\n So to be intelligent, it seems like you have to have some kind of connections with other\n\n29:05.560 --> 29:11.520\n human beings in a sense that you have to impress them with your intelligence.\n\n29:11.520 --> 29:17.480\n And there feels, you have to somehow operate in this world full of humans.\n\n29:17.480 --> 29:21.820\n And for that, there feels like there has to be something like consciousness.\n\n29:21.820 --> 29:26.600\n So you think you can have just the world's best natural NLP system, natural language\n\n29:26.600 --> 29:32.000\n understanding generation, and that will be, that will get us happy and say, you know what,\n\n29:32.000 --> 29:33.920\n we've created an AGI.\n\n29:33.920 --> 29:40.520\n I don't know happy, but yes, I do believe we can get what we call high level functional\n\n29:40.520 --> 29:46.760\n intelligence, particular sort of the G, you know, this fluid like intelligence that we\n\n29:46.760 --> 29:51.280\n cherish, particularly at a place like MIT, right, in machines.\n\n29:51.280 --> 29:54.920\n I see a priori no reasons, and I see a lot of reason to believe it's going to happen\n\n29:54.920 --> 29:58.360\n very, you know, over the next 50 years or 30 years.\n\n29:58.360 --> 30:06.360\n So for beneficial AI, for creating an AI system that's, so you mentioned ethics, that is exceptionally\n\n30:06.360 --> 30:11.880\n intelligent but also does not do, does, you know, aligns its values with our values as\n\n30:11.880 --> 30:12.880\n humanity.\n\n30:12.880 --> 30:14.880\n Do you think then it needs consciousness?\n\n30:14.880 --> 30:19.960\n Yes, I think that that is a very good argument that if we're concerned about AI and the threat\n\n30:19.960 --> 30:26.320\n of AI, a la Nick Bostrom, existentialist threat, I think having an intelligence that has empathy,\n\n30:26.320 --> 30:32.200\n right, why do we find abusing a dog, why do most of us find that abhorrent, abusing any\n\n30:32.200 --> 30:33.200\n animal, right?\n\n30:33.200 --> 30:37.840\n Why do we find that abhorrent because we have this thing called empathy, which if you look\n\n30:37.840 --> 30:42.560\n at the Greek really means feeling with, I feel a path of empathy, I have feeling with\n\n30:42.560 --> 30:43.560\n you.\n\n30:43.560 --> 30:48.760\n I see somebody else suffer that isn't even my conspecific, it's not a person, it's not\n\n30:48.760 --> 30:53.560\n my wife or my kids, it's a dog, but I feel naturally most of us, not all of us, most\n\n30:53.560 --> 30:55.840\n of us will feel emphatic.\n\n30:55.840 --> 31:02.200\n And so it may well be in the long term interest of survival of homo sapiens sapiens that if\n\n31:02.200 --> 31:08.320\n we do build AGI and it really becomes very powerful that it has an emphatic response\n\n31:08.320 --> 31:11.960\n and doesn't just exterminate humanity.\n\n31:11.960 --> 31:17.640\n So as part of the full conscious experience to create a consciousness, artificial or in\n\n31:17.640 --> 31:23.800\n our human consciousness, do you think fear, maybe we're going to get into the earlier\n\n31:23.800 --> 31:29.760\n days with Nietzsche and so on, but do you think fear and suffering are essential to\n\n31:29.760 --> 31:30.760\n have consciousness?\n\n31:30.760 --> 31:37.200\n Do you have to have the full range of experience to have a system that has experience or can\n\n31:37.200 --> 31:41.880\n you have a system that only has very particular kinds of very positive experiences?\n\n31:41.880 --> 31:46.180\n Look you can have in principle, people have done this in the rat where you implant an\n\n31:46.180 --> 31:51.040\n electrode in the hypothalamus, the pleasure center of the rat and the rat stimulates itself\n\n31:51.040 --> 31:52.960\n above and beyond anything else.\n\n31:52.960 --> 31:57.680\n It doesn't care about food or natural sex or drink anymore, it just stimulates itself\n\n31:57.680 --> 32:00.440\n because it's such a pleasurable feeling.\n\n32:00.440 --> 32:04.080\n I guess it's like an orgasm just you have all day long.\n\n32:04.080 --> 32:11.240\n And so a priori I see no reason why you need a great variety.\n\n32:11.240 --> 32:14.600\n Now clearly to survive that wouldn't work, right?\n\n32:14.600 --> 32:22.640\n But if I'd engineered artificially, I don't think you need a great variety of conscious\n\n32:22.640 --> 32:23.640\n experience.\n\n32:23.640 --> 32:25.440\n You could have just pleasure or just fear.\n\n32:25.440 --> 32:30.280\n It might be a terrible existence, but I think that's possible at least on conceptual logical\n\n32:30.280 --> 32:31.280\n ground.\n\n32:31.280 --> 32:35.400\n Because any real creature whether artificially engineered, you want to give it fear, the\n\n32:35.400 --> 32:38.480\n fear of extinction that we all have.\n\n32:38.480 --> 32:44.240\n And you also want to give it positive repetitive states, states that you want the machine encouraged\n\n32:44.240 --> 32:48.120\n to do because they give the machine positive feedback.\n\n32:48.120 --> 32:54.640\n So you mentioned panpsychism, to jump back a little bit, everything having some kind\n\n32:54.640 --> 32:57.520\n of mental property.\n\n32:57.520 --> 33:02.160\n How do you go from there to something like human consciousness?\n\n33:02.160 --> 33:08.840\n So everything having some elements of consciousness, is there something special about human consciousness?\n\n33:08.840 --> 33:10.720\n So it's not everything.\n\n33:10.720 --> 33:17.760\n Like a spoon, the form of panpsychism I think about doesn't ascribe consciousness to anything\n\n33:17.760 --> 33:20.040\n like this, the spoon on my liver.\n\n33:20.040 --> 33:26.800\n However, the theory, the integrated information theory does say that the system, even one\n\n33:26.800 --> 33:30.560\n that looks from the outside relatively simple, at least if they have this internal causal\n\n33:30.560 --> 33:35.320\n power, it does feel like something.\n\n33:35.320 --> 33:38.920\n The theory a priori doesn't say anything what's special about human.\n\n33:38.920 --> 33:44.240\n Biologically we know the one thing that's special about human is we speak and we have\n\n33:44.240 --> 33:48.360\n an overblown sense of our own importance.\n\n33:48.360 --> 33:54.360\n We believe we're exceptional and we're just God's gift to the universe.\n\n33:54.360 --> 33:58.660\n But behaviorally the main thing that we have, we can plan over the long term, we have language\n\n33:58.660 --> 34:03.640\n and that gives us an enormous amount of power and that's why we are the current dominant\n\n34:03.640 --> 34:05.840\n species on the planet.\n\n34:05.840 --> 34:15.400\n So you mentioned God, you grew up a devout Roman Catholic family, so with consciousness\n\n34:15.400 --> 34:21.240\n you're sort of exploring some really deeply fundamental human things that religion also\n\n34:21.240 --> 34:22.240\n touches on.\n\n34:22.240 --> 34:27.400\n Where does religion fit into your thinking about consciousness?\n\n34:27.400 --> 34:31.800\n You've grown throughout your life and changed your views on religion as far as I understand.\n\n34:31.800 --> 34:37.000\n Yeah, I mean I'm now much closer to, I'm not a Roman Catholic anymore, I don't believe\n\n34:37.000 --> 34:43.280\n there's sort of this God, the God I was educated to believe in, sits somewhere in the fullness\n\n34:43.280 --> 34:49.920\n of time, I'll be united in some sort of everlasting bliss, I just don't see any evidence for that.\n\n34:49.920 --> 34:55.200\n Look, the world, the night is large and full of wonders, there are many things that I don't\n\n34:55.200 --> 34:59.200\n understand, I think many things that we as a cult, look we don't even understand more\n\n34:59.200 --> 35:03.640\n than 4% of all the universe, dark matter, dark energy, we have no idea what it is, maybe\n\n35:03.640 --> 35:06.680\n it's lost socks, what do I know?\n\n35:06.680 --> 35:13.040\n So all I can tell you is it's sort of my current religious or spiritual sentiment is much closer\n\n35:13.040 --> 35:19.880\n to some form of Buddhism, without the reincarnation unfortunately, there's no evidence for it\n\n35:19.880 --> 35:20.880\n than reincarnation.\n\n35:20.880 --> 35:25.560\n So can you describe the way Buddhism sees the world a little bit?\n\n35:25.560 --> 35:32.240\n Well so they talk about, so when I spent several meetings with the Dalai Lama and what always\n\n35:32.240 --> 35:36.940\n impressed me about him, he really, unlike for example let's say the Pope or some Cardinal,\n\n35:36.940 --> 35:40.800\n he always emphasized minimizing the suffering of all creatures.\n\n35:40.800 --> 35:45.240\n So they have this, from the early beginning they look at suffering in all creatures, not\n\n35:45.240 --> 35:52.160\n just in people, but in everybody, this universal and of course by degrees, an animal in general\n\n35:52.160 --> 35:59.500\n is less capable of suffering than a well developed, normally developed human and they think consciousness\n\n35:59.500 --> 36:06.480\n pervades in this universe and they have these techniques, you can think of them like mindfulness\n\n36:06.480 --> 36:12.600\n etc. and meditation that tries to access what they claim of this more fundamental aspect\n\n36:12.600 --> 36:13.600\n of reality.\n\n36:13.600 --> 36:17.000\n I'm not sure it's more fundamental, I think about it, there's the physical and then there's\n\n36:17.000 --> 36:21.120\n this inside view, consciousness and those are the two aspects that's the only thing\n\n36:21.120 --> 36:25.520\n I have access to in my life and you've got to remember my conscious experience and your\n\n36:25.520 --> 36:29.680\n conscious experience comes prior to anything you know about physics, comes prior to knowledge\n\n36:29.680 --> 36:34.780\n about the universe and atoms and super strings and molecules and all of that.\n\n36:34.780 --> 36:39.080\n The only thing you directly are acquainted with is this world that's populated with things\n\n36:39.080 --> 36:43.120\n in images and sounds in your head and touches and all of that.\n\n36:43.120 --> 36:49.200\n I actually have a question, so it sounds like you kind of have a rich life, you talk about\n\n36:49.200 --> 36:55.120\n rock climbing and it seems like you really love literature and consciousness is all about\n\n36:55.120 --> 37:00.800\n experiencing things, so do you think that has helped your research on this topic?\n\n37:00.800 --> 37:05.260\n Yes, particularly if you think about it, the various states, so for example when you do\n\n37:05.260 --> 37:11.320\n rock climbing or now I do rowing, crew rowing and a bike every day, you can get into this\n\n37:11.320 --> 37:16.360\n thing called the zone and I've always wanted about it, particularly with respect to consciousness\n\n37:16.360 --> 37:20.960\n because it's a strangely addictive state.\n\n37:20.960 --> 37:24.680\n Once people have it once, they want to keep on going back to it and you wonder what is\n\n37:24.680 --> 37:30.840\n it so addicting about it and I think it's the experience of almost close to pure experience\n\n37:30.840 --> 37:35.620\n because in this zone, you're not conscious of inner voice anymore, there's always inner\n\n37:35.620 --> 37:39.200\n voice nagging you, you have to do this, you have to do that, you have to pay your taxes,\n\n37:39.200 --> 37:42.480\n you have to fight with your ex and all of those things, they're always there.\n\n37:42.480 --> 37:46.320\n But when you're in the zone, all of that is gone and you're just in this wonderful state\n\n37:46.320 --> 37:51.480\n where you're fully out in the world, you're climbing or you're rowing or biking or doing\n\n37:51.480 --> 37:57.500\n soccer or whatever you're doing and sort of consciousness is this, you're all action or\n\n37:57.500 --> 38:02.320\n in this case of pure experience, you're not action at all but in both cases, you experience\n\n38:02.320 --> 38:10.120\n some aspect of conscious, you touch some basic part of conscious existence that is so basic\n\n38:10.120 --> 38:12.720\n and so deeply satisfying.\n\n38:12.720 --> 38:16.480\n You I think you touch the root of being, that's really what you're touching there, you're\n\n38:16.480 --> 38:21.800\n getting close to the root of being and that's very different from intelligence.\n\n38:21.800 --> 38:25.920\n So what do you think about the simulation hypothesis, simulation theory, the idea that\n\n38:25.920 --> 38:28.040\n we all live in a computer simulation?\n\n38:28.040 --> 38:30.400\n Rapture for nerds.\n\n38:30.400 --> 38:31.400\n Rapture for nerds.\n\n38:31.400 --> 38:39.440\n I think it's as likely as the hypothesis had engaged hundreds of scholars for many centuries,\n\n38:39.440 --> 38:42.680\n are we all just existing in the mind of God?\n\n38:42.680 --> 38:47.680\n And this is just a modern version of it, it's equally plausible.\n\n38:47.680 --> 38:51.400\n People love talking about these sort of things, I know they're book written about this simulation\n\n38:51.400 --> 38:56.280\n hypothesis, if that's what people want to do, that's fine, it seems rather esoteric,\n\n38:56.280 --> 38:58.320\n it's never testable.\n\n38:58.320 --> 39:02.660\n But it's not useful for you to think of in those terms, so maybe connecting to the questions\n\n39:02.660 --> 39:07.840\n of free will which you've talked about, I vaguely remember you saying that the idea\n\n39:07.840 --> 39:13.480\n that there's no free will, it makes you very uncomfortable.\n\n39:13.480 --> 39:19.440\n So what do you think about free will from a physics perspective, from a conscious perspective,\n\n39:19.440 --> 39:20.440\n what does it all fit?\n\n39:20.440 --> 39:24.840\n Okay, so from the physics perspective, leaving aside quantum mechanics, we believe we live\n\n39:24.840 --> 39:27.160\n in a fully deterministic world, right?\n\n39:27.160 --> 39:30.400\n But then comes of course quantum mechanics, so now we know that certain things are in\n\n39:30.400 --> 39:36.700\n principle not predictable, which as you said I prefer, because the idea that the initial\n\n39:36.700 --> 39:40.640\n condition of the universe and then everything else, we're just acting out the initial condition\n\n39:40.640 --> 39:42.680\n of the universe, that doesn't…\n\n39:42.680 --> 39:45.320\n It's not a romantic notion.\n\n39:45.320 --> 39:47.160\n Certainly not.\n\n39:47.160 --> 39:50.780\n Now when it comes to consciousness, I think we do have certain freedom.\n\n39:50.780 --> 39:55.120\n We are much more constrained by physics of course and by our past and by our own conscious\n\n39:55.120 --> 39:59.160\n desires and what our parents told us and what our environment tells us.\n\n39:59.160 --> 40:00.160\n We all know that, right?\n\n40:00.160 --> 40:03.760\n There's hundreds of experiments that show how we can be influenced.\n\n40:03.760 --> 40:08.360\n But finally in the final analysis, when you make a life – and I'm talking really about\n\n40:08.360 --> 40:11.560\n critical decision where you really think, should I marry, should I go to this school\n\n40:11.560 --> 40:18.680\n or that school, should I take this job or that job, should I cheat on my taxes or not?\n\n40:18.680 --> 40:22.560\n These are things where you really deliberate and I think under those conditions, you are\n\n40:22.560 --> 40:24.720\n as free as you can be.\n\n40:24.720 --> 40:31.440\n When you bring your entire being, your entire conscious being to that question and try to\n\n40:31.440 --> 40:37.080\n analyze it under all the various conditions, then you make a decision, you are as free\n\n40:37.080 --> 40:38.880\n as you can ever be.\n\n40:38.880 --> 40:40.680\n That is I think what free will is.\n\n40:40.680 --> 40:44.560\n It's not a will that's totally free to do anything it wants.\n\n40:44.560 --> 40:45.920\n That's not possible.\n\n40:45.920 --> 40:46.920\n Right.\n\n40:46.920 --> 40:52.760\n So as Jack mentioned, you actually write a blog about books you've read, amazing books\n\n40:52.760 --> 41:01.080\n from, I'm Russian, from Bulgakov, Neil Gaiman, Carl Sagan, Murakami.\n\n41:01.080 --> 41:06.760\n So what is a book that early in your life transformed the way you saw the world, something\n\n41:06.760 --> 41:09.880\n that changed your life?\n\n41:09.880 --> 41:10.880\n Nietzsche I guess did.\n\n41:10.880 --> 41:14.520\n That's Brooks R. Truster because he talks about some of these problems.\n\n41:14.520 --> 41:17.920\n He was one of the first discoverer of the unconscious.\n\n41:17.920 --> 41:23.240\n This is a little bit before Freud when he was in the air.\n\n41:23.240 --> 41:29.040\n He makes all these claims that people sort of under the guise or under the mass of charity\n\n41:29.040 --> 41:32.360\n actually are very noncharitable.\n\n41:32.360 --> 41:39.840\n So he is sort of really the first discoverer of the great land of the unconscious and that\n\n41:39.840 --> 41:41.600\n really struck me.\n\n41:41.600 --> 41:45.480\n And what do you think about the unconscious, what do you think about Freud, what do you\n\n41:45.480 --> 41:47.880\n think about these ideas?\n\n41:47.880 --> 41:51.920\n Just like dark matter in the universe, what's over there in that unconscious?\n\n41:51.920 --> 41:52.920\n A lot.\n\n41:52.920 --> 41:53.920\n I mean much more than we think.\n\n41:53.920 --> 41:57.480\n This is what a lot of last 100 years of research has shown.\n\n41:57.480 --> 42:02.840\n So I think he was a genius, misguided towards the end, but he started out as a neuroscientist.\n\n42:02.840 --> 42:09.480\n He contributed, he did the studies on the lamprey, he contributed himself to the neuron\n\n42:09.480 --> 42:13.400\n hypothesis, the idea that there are discrete units that we call nerve cells now.\n\n42:13.400 --> 42:20.920\n And then he wrote about the unconscious and I think it's true, there's lots of stuff happening.\n\n42:20.920 --> 42:25.560\n You feel this particular when you're in a relationship and it breaks asunder, right?\n\n42:25.560 --> 42:29.880\n And then you have this terrible, you can have love and hate and lust and anger and all of\n\n42:29.880 --> 42:31.520\n it's mixed in.\n\n42:31.520 --> 42:35.080\n And when you try to analyze yourself, why am I so upset?\n\n42:35.080 --> 42:41.080\n It's very, very difficult to penetrate to those basements, those caverns in your mind\n\n42:41.080 --> 42:45.840\n because the prying eyes of conscious doesn't have access to those, but they're there in\n\n42:45.840 --> 42:48.560\n the amygdala or lots of other places.\n\n42:48.560 --> 42:53.720\n They make you upset or angry or sad or depressed and it's very difficult to try to actually\n\n42:53.720 --> 42:54.720\n uncover the reason.\n\n42:54.720 --> 42:58.360\n You can go to a shrink, you can talk with your friend endlessly, you construct finally\n\n42:58.360 --> 43:02.520\n a story why this happened, why you love her or don't love her or whatever, but you don't\n\n43:02.520 --> 43:07.640\n really know whether that actually happened because you simply don't have access to those\n\n43:07.640 --> 43:09.280\n parts of the brain and they're very powerful.\n\n43:09.280 --> 43:12.600\n Do you think that's a feature or a bug of our brain?\n\n43:12.600 --> 43:16.840\n The fact that we have this deep, difficult to dive into subconscious?\n\n43:16.840 --> 43:24.320\n I think it's a feature because otherwise, look, we are like any other brain or nervous\n\n43:24.320 --> 43:28.640\n system or computer, we are severely band limited.\n\n43:28.640 --> 43:34.480\n If everything I do, every emotion I feel, every eye movements I make, if all of that\n\n43:34.480 --> 43:42.720\n had to be under the control of consciousness, I wouldn't be here.\n\n43:42.720 --> 43:46.460\n What you do early on, your brain, you have to be conscious when you learn things like\n\n43:46.460 --> 43:52.320\n typing or like riding on a bike, but then what you do, you train up routes, I think\n\n43:52.320 --> 43:54.640\n that involve basal ganglia and striatum.\n\n43:54.640 --> 43:58.800\n You train up different parts of your brain and then once you do it automatically like\n\n43:58.800 --> 44:02.000\n typing, you can show you do it much faster without even thinking about it because you've\n\n44:02.000 --> 44:07.800\n got these highly specialized, what Frans Krik and I call zombie agents, they're taking care\n\n44:07.800 --> 44:11.320\n of that while your consciousness can sort of worry about the abstract sense of the text\n\n44:11.320 --> 44:12.320\n you want to write.\n\n44:12.320 --> 44:15.000\n I think that's true for many, many things.\n\n44:15.000 --> 44:21.240\n But for the things like all the fights you had with an ex girlfriend, things that you\n\n44:21.240 --> 44:25.280\n would think are not useful to still linger somewhere in the subconscious.\n\n44:25.280 --> 44:28.400\n So that seems like a bug that it would stick to there.\n\n44:28.400 --> 44:31.320\n You think it would be better if you can analyze it and then get it out of the system.\n\n44:31.320 --> 44:34.800\n Better to get it out of the system or just forget it ever happened.\n\n44:34.800 --> 44:37.400\n That seems a very buggy kind of.\n\n44:37.400 --> 44:41.620\n Well yeah, in general we don't have, and that's probably functional, we don't have an ability\n\n44:41.620 --> 44:45.240\n unless it's extreme, there are cases, clinical dissociations, right?\n\n44:45.240 --> 44:50.360\n When people are heavily abused, when they completely repress the memory, but that doesn't\n\n44:50.360 --> 44:53.560\n happen in normal people.\n\n44:53.560 --> 44:59.040\n We don't have an ability to remove traumatic memories and of course we suffer from that.\n\n44:59.040 --> 45:04.000\n On the other hand, probably if you had the ability to constantly wipe your memory, you'd\n\n45:04.000 --> 45:07.160\n probably do it to an extent that isn't useful to you.\n\n45:07.160 --> 45:11.000\n So yeah, it's a good question to balance.\n\n45:11.000 --> 45:18.440\n So on the books, as Jack mentioned, correct me if I'm wrong, but broadly speaking, academia\n\n45:18.440 --> 45:23.480\n and the different scientific disciplines, certainly in engineering, reading literature\n\n45:23.480 --> 45:26.680\n seems to be a rare pursuit.\n\n45:26.680 --> 45:30.680\n So I'm wrong on this, but that's in my experience, most people read much more technical text\n\n45:30.680 --> 45:36.760\n and do not sort of escape or seek truth in literature.\n\n45:36.760 --> 45:38.440\n It seems like you do.\n\n45:38.440 --> 45:42.340\n So what do you think is the value, what do you think literature adds to the pursuit of\n\n45:42.340 --> 45:43.880\n scientific truth?\n\n45:43.880 --> 45:46.640\n Do you think it's good, it's useful for everybody?\n\n45:46.640 --> 45:52.600\n Gives you access to a much wider array of human experiences.\n\n45:52.600 --> 45:54.320\n How valuable do you think it is?\n\n45:54.320 --> 45:58.560\n Well if you want to understand human nature and nature in general, then I think you have\n\n45:58.560 --> 46:04.720\n to better understand a wide variety of experiences, not just sitting in a lab staring at a screen\n\n46:04.720 --> 46:08.040\n and having a face flashed onto you for a hundred milliseconds and pushing a button.\n\n46:08.040 --> 46:10.680\n That's what I used to do, that's what most psychologists do.\n\n46:10.680 --> 46:16.880\n There's nothing wrong with that, but you need to consider lots of other strange states.\n\n46:16.880 --> 46:18.560\n And literature is a shortcut for this.\n\n46:18.560 --> 46:22.840\n Well yeah, because literature, that's what literature is all about, all sorts of interesting\n\n46:22.840 --> 46:28.680\n experiences that people have, the contingency of it, the fact that women experience the\n\n46:28.680 --> 46:32.320\n world different, black people experience the world different.\n\n46:32.320 --> 46:35.920\n The one way to experience that is reading all these different literature and try to\n\n46:35.920 --> 46:36.920\n find out.\n\n46:36.920 --> 46:37.920\n You see, everything is so relative.\n\n46:37.920 --> 46:41.600\n You read a book 300 years ago, they thought about certain problems very, very differently\n\n46:41.600 --> 46:43.320\n than us today.\n\n46:43.320 --> 46:46.120\n We today, like any culture, think we know it all.\n\n46:46.120 --> 46:47.440\n That's common to every culture.\n\n46:47.440 --> 46:50.100\n Every culture believes at its heyday they know it all.\n\n46:50.100 --> 46:53.400\n And then you realize, well, there's other ways of viewing the universe and some of them\n\n46:53.400 --> 46:56.800\n may have lots of things in their favor.\n\n46:56.800 --> 47:02.720\n So this is a question I wanted to ask about time scale or scale in general.\n\n47:02.720 --> 47:07.160\n When you, with IIT or in general, try to think about consciousness, try to think about these\n\n47:07.160 --> 47:17.640\n ideas, we kind of naturally think in human time scales, and also entities that are sized\n\n47:17.640 --> 47:18.640\n close to humans.\n\n47:18.640 --> 47:22.560\n Do you think of things that are much larger and much smaller as containing consciousness?\n\n47:22.560 --> 47:32.480\n And do you think of things that take, you know, eons to operate in their conscious cause\n\n47:32.480 --> 47:33.480\n effect?\n\n47:33.480 --> 47:35.560\n That's a very good question.\n\n47:35.560 --> 47:38.920\n So I think a lot about small creatures because experimentally, you know, a lot of people\n\n47:38.920 --> 47:41.380\n work on flies and bees, right?\n\n47:41.380 --> 47:45.360\n So most people just think they are automata, they're just bugs for heaven's sake, right?\n\n47:45.360 --> 47:48.840\n But if you look at their behavior, like bees, they can recognize individual humans.\n\n47:48.840 --> 47:52.520\n They have this very complicated way to communicate.\n\n47:52.520 --> 47:55.740\n If you've ever been involved or you know your parents when they bought a house, what sort\n\n47:55.740 --> 47:57.880\n of agonizing decision that is.\n\n47:57.880 --> 48:01.320\n And bees have to do that once a year, right, when they swarm in the spring.\n\n48:01.320 --> 48:04.880\n And then they have this very elaborate way, they have free and scouts, they go to the\n\n48:04.880 --> 48:08.080\n individual sites, they come back, they have this power, this dance, literally, where they\n\n48:08.080 --> 48:12.160\n dance for several days, they try to recruit other deets, this very complicated decision\n\n48:12.160 --> 48:16.440\n rate, when they finally, once they make a decision, the entire swarm, the scouts warm\n\n48:16.440 --> 48:18.480\n up the entire swarm and then go to one location.\n\n48:18.480 --> 48:21.960\n They don't go to 50 locations, they go to one location that the scouts have agreed upon\n\n48:21.960 --> 48:22.960\n by themselves.\n\n48:22.960 --> 48:23.960\n That's awesome.\n\n48:23.960 --> 48:27.040\n If we look at the circuit complexity, it's 10 times more denser than anything we have\n\n48:27.040 --> 48:28.040\n in our brain.\n\n48:28.040 --> 48:31.140\n Now they only have a million neurons, but the neurons are amazingly complex.\n\n48:31.140 --> 48:35.020\n Complex behavior, very complicated circuitry, so there's no question they experience something,\n\n48:35.020 --> 48:39.600\n their life is very different, they're tiny, they only live, you know, for, well, workers\n\n48:39.600 --> 48:42.160\n live maybe for two months.\n\n48:42.160 --> 48:47.980\n So I think, and IIT tells you this, in principle, the substrate of consciousness is the substrate\n\n48:47.980 --> 48:53.140\n that maximizes the cause effect power over all possible spatial temporal grains.\n\n48:53.140 --> 48:55.960\n So when I think about, for example, do you know the science fiction story, The Black\n\n48:55.960 --> 48:56.960\n Cloud?\n\n48:56.960 --> 49:00.040\n Okay, it's a classic by Fred Hoyle, the astronomer.\n\n49:00.040 --> 49:06.240\n He has this cloud intervening between the earth and the sun and leading to some sort\n\n49:06.240 --> 49:09.040\n of, to global cooling, this is written in the 50s.\n\n49:09.040 --> 49:14.440\n It turns out you can, using the radio dish, they communicate with actually an entity,\n\n49:14.440 --> 49:19.680\n it's actually an intelligent entity, and they sort of, they convince it to move away.\n\n49:19.680 --> 49:24.840\n So here you have a radical different entity, and in principle, IIT says, well, you can\n\n49:24.840 --> 49:30.200\n measure the integrated information, in principle at least, and yes, if the maximum of that\n\n49:30.200 --> 49:35.980\n occurs at a time scale of months, rather than in assets for a fraction of a second, yes,\n\n49:35.980 --> 49:41.600\n then they would experience life where each moment is a month rather than, or microsecond,\n\n49:41.600 --> 49:46.800\n right, rather than a fraction of a second in the human case.\n\n49:46.800 --> 49:50.500\n And so there may be forms of consciousness that we simply don't recognize for what they\n\n49:50.500 --> 49:55.480\n are because they are so radical different from anything you and I are used to.\n\n49:55.480 --> 49:59.720\n Again, that's why it's good to read or to watch science fiction movies, well, to think\n\n49:59.720 --> 50:00.720\n about this.\n\n50:00.720 --> 50:06.640\n Do you know Stanislav Lem, this Polish science fiction writer, he wrote Solaris and was turned\n\n50:06.640 --> 50:07.640\n into a Hollywood movie?\n\n50:07.640 --> 50:08.640\n Yes.\n\n50:08.640 --> 50:13.080\n His best novel is in the 60s, a very engineer, he's an engineer in background.\n\n50:13.080 --> 50:19.240\n His most interesting novel is called The Victorious, where human civilization, they have this\n\n50:19.240 --> 50:25.120\n mission to this planet and everything is destroyed and they discover machines, humans got killed\n\n50:25.120 --> 50:30.080\n and then these machines took over and there was this machine evolution, Darwinian evolution,\n\n50:30.080 --> 50:32.200\n he talks about this very vividly.\n\n50:32.200 --> 50:39.200\n And finally, the dominant machine intelligence organism that survived were gigantic clouds\n\n50:39.200 --> 50:42.520\n of little hexagonal universal cellular automata.\n\n50:42.520 --> 50:46.560\n This was written in the 60s, so typically they're all lying on the ground individual\n\n50:46.560 --> 50:50.920\n by themselves, but in times of crisis, they can communicate, they assemble into gigantic\n\n50:50.920 --> 50:55.840\n nets into clouds of trillions of these particles and then they become hyper intelligent and\n\n50:55.840 --> 51:00.000\n they can beat anything that humans can throw at it.\n\n51:00.000 --> 51:05.080\n It's very beautiful and compelling where you have an intelligence where finally the humans\n\n51:05.080 --> 51:09.440\n leave the planet, they're simply unable to understand and comprehend this creature.\n\n51:09.440 --> 51:13.160\n They can say, well, either we can nuke the entire planet and destroy it or we just have\n\n51:13.160 --> 51:18.480\n to leave because fundamentally it's an alien, it's so alien from us and our ideas that we\n\n51:18.480 --> 51:20.280\n cannot communicate with them.\n\n51:20.280 --> 51:25.960\n Yeah, actually in conversation, so you're talking to us, Steven Wolf from Brought Up\n\n51:25.960 --> 51:32.440\n is that there could be ideas that you already have these artificial general intelligence\n\n51:32.440 --> 51:36.240\n like super smart or maybe conscious beings in the cellular automata, we just don't know\n\n51:36.240 --> 51:37.240\n how to talk to them.\n\n51:37.240 --> 51:41.440\n So it's the language of communication, but you don't know what to do with it.\n\n51:41.440 --> 51:46.800\n So that's one sort of view is consciousness is only something you can measure.\n\n51:46.800 --> 51:50.160\n So it's not conscious if you can't measure it.\n\n51:50.160 --> 51:53.200\n So you're making an ontological and an epistemic statement.\n\n51:53.200 --> 51:59.240\n One is it's just like seeing the multiverses, that might be true, but I can't communicate\n\n51:59.240 --> 52:00.240\n with them.\n\n52:00.240 --> 52:01.640\n I can't have any knowledge of them.\n\n52:01.640 --> 52:02.640\n That's an epistemic argument.\n\n52:02.640 --> 52:03.640\n Right?\n\n52:03.640 --> 52:04.640\n So those are two different things.\n\n52:04.640 --> 52:05.640\n So it may well be possible.\n\n52:05.640 --> 52:09.320\n Look, in another case that's happening right now, people are building these mini organoids.\n\n52:09.320 --> 52:10.960\n Do you know what this is?\n\n52:10.960 --> 52:14.640\n So you can take stem cells from under your arm, put it in a dish, add four transcription\n\n52:14.640 --> 52:19.920\n factors and then you can induce them to grow into large, well, large, they're a few millimeters.\n\n52:19.920 --> 52:23.540\n They're like a half a million neurons that look like nerve cells in a dish called mini\n\n52:23.540 --> 52:27.300\n organoids at Harvard, at Stanford, everywhere they're building them.\n\n52:27.300 --> 52:31.920\n It may well be possible that they're beginning to feel like something, but we can't really\n\n52:31.920 --> 52:33.560\n communicate with them right now.\n\n52:33.560 --> 52:36.400\n So people are beginning to think about the ethics of this.\n\n52:36.400 --> 52:41.840\n So yes, he may be perfectly right, but it's one question, are they conscious or not?\n\n52:41.840 --> 52:43.040\n It's a totally separate question.\n\n52:43.040 --> 52:44.040\n How would I know?\n\n52:44.040 --> 52:45.800\n Those are two different things.\n\n52:45.800 --> 52:52.940\n If you could give advice to a young researcher, sort of dreaming of understanding or creating\n\n52:52.940 --> 52:59.120\n human level intelligence or consciousness, what would you say?\n\n52:59.120 --> 53:01.440\n Just follow your dreams.\n\n53:01.440 --> 53:02.440\n Read widely.\n\n53:02.440 --> 53:08.880\n No, I mean, I suppose with discipline, what is the pursuit that they should take on?\n\n53:08.880 --> 53:09.880\n Is it neuroscience?\n\n53:09.880 --> 53:11.700\n Is it computational cognitive science?\n\n53:11.700 --> 53:12.700\n Is it philosophy?\n\n53:12.700 --> 53:15.400\n Is it computer science or robotics?\n\n53:15.400 --> 53:22.840\n No, in a sense that, okay, so the only known system that have high level of intelligence\n\n53:22.840 --> 53:24.480\n is homo sapiens.\n\n53:24.480 --> 53:28.480\n So if you wanted to build it, it's probably good to continue to study closely what humans\n\n53:28.480 --> 53:29.480\n do.\n\n53:29.480 --> 53:32.920\n So cognitive neuroscience, you know, somewhere between cognitive neuroscience on the one hand\n\n53:32.920 --> 53:37.360\n and some philosophy of mind and then AI, AI computer science.\n\n53:37.360 --> 53:42.120\n You can look at all the original ideas in your network, they all came from neuroscience,\n\n53:42.120 --> 53:43.120\n right?\n\n53:43.120 --> 53:47.360\n Reinforce whether it's Snarky, Minsky building is Snarky or whether it's, you know, the early\n\n53:47.360 --> 53:50.960\n Hubel and Wiesel experiments at Harvard that then gave rise to networks and then multi\n\n53:50.960 --> 53:52.920\n layer networks.\n\n53:52.920 --> 53:57.240\n So it may well be possible, in fact, some people argue that to make the next big step\n\n53:57.240 --> 54:02.680\n in AI once we realize the limits of deep convolutional networks, they can do certain things, but\n\n54:02.680 --> 54:03.680\n they can't really understand.\n\n54:03.680 --> 54:08.800\n They don't, they can't really, I can't really show them one image.\n\n54:08.800 --> 54:14.880\n I can show you a single image of somebody, a pickpocket who steals a wallet from a purse.\n\n54:14.880 --> 54:17.040\n You immediately know that's a pickpocket.\n\n54:17.040 --> 54:21.200\n Now computer system would just say, well, it's a man, it's a woman, it's a purse, right?\n\n54:21.200 --> 54:24.520\n Unless you train this machine on showing it a hundred thousand pickpockets, right?\n\n54:24.520 --> 54:29.800\n So it doesn't have this easy understanding that you have, right?\n\n54:29.800 --> 54:33.000\n So some people make the argument in order to go to the next step or you really want\n\n54:33.000 --> 54:37.140\n to build machines that understand in a way you and I, we have to go to psychology.\n\n54:37.140 --> 54:40.440\n We need to understand how we do it and how our brains enable us to do it.\n\n54:40.440 --> 54:45.040\n And so therefore being on the cusp, it's also so exciting to try to understand better our\n\n54:45.040 --> 54:48.800\n nature and then to build, to take some of those inside and build them.\n\n54:48.800 --> 54:52.720\n So I think the most exciting thing is somewhere in the interface between cognitive science,\n\n54:52.720 --> 54:55.920\n neuroscience, AI, computer science and philosophy of mind.\n\n54:55.920 --> 54:56.920\n Beautiful.\n\n54:56.920 --> 54:57.920\n Yeah.\n\n54:57.920 --> 55:00.520\n I'd say if there is from the machine learning, from our, from the computer science, computer\n\n55:00.520 --> 55:05.800\n vision perspective, many of the researchers kind of ignore the way the human brain works\n\n55:05.800 --> 55:12.160\n or even psychology or literature or studying the brain, I would hope Josh Tenenbaum talks\n\n55:12.160 --> 55:14.760\n about bringing that in more and more.\n\n55:14.760 --> 55:20.120\n And that's, yeah, so you've worked on some amazing stuff throughout your life.\n\n55:20.120 --> 55:24.640\n What's the thing that you're really excited about?\n\n55:24.640 --> 55:30.560\n What's the mystery that you would love to uncover in the near term beyond, beyond all\n\n55:30.560 --> 55:32.400\n the mysteries that you're already surrounded by?\n\n55:32.400 --> 55:36.720\n Well, so there's a structure called the claustrum.\n\n55:36.720 --> 55:40.040\n This is a structure, it's underneath our cortex, it's yay big.\n\n55:40.040 --> 55:44.200\n You have one on the left, on the right, underneath this, underneath the insula, it's very thin,\n\n55:44.200 --> 55:48.280\n it's like one millimeter, it's embedded in, in wiring, in white matter, so it's very difficult\n\n55:48.280 --> 55:50.200\n to image.\n\n55:50.200 --> 55:55.080\n And it has, it has connection to every cortical region.\n\n55:55.080 --> 55:58.360\n And Francis Crick, the last paper he ever wrote, he dictated corrections the day he\n\n55:58.360 --> 56:00.840\n died in hospital on this paper.\n\n56:00.840 --> 56:05.920\n You know, we hypothesize, well, because it has this unique anatomy, it gets input from\n\n56:05.920 --> 56:10.800\n every cortical area and projects back to every, every cortical area.\n\n56:10.800 --> 56:16.760\n That the function of this structure is similar, it's just a metaphor to the role of a conductor\n\n56:16.760 --> 56:18.760\n in a symphony orchestra.\n\n56:18.760 --> 56:20.560\n You have all the different cortical players.\n\n56:20.560 --> 56:24.640\n You have some that do motion, some that do theory of mind, some that infer social interaction\n\n56:24.640 --> 56:28.160\n and color and hearing and all the different modules in cortex.\n\n56:28.160 --> 56:32.040\n But of course, what consciousness is, consciousness puts it all together into one package, right?\n\n56:32.040 --> 56:33.560\n The binding problem, all of that.\n\n56:33.560 --> 56:38.200\n And this is really the function because it has relatively few neurons compared to cortex,\n\n56:38.200 --> 56:43.720\n but it talks, it receives input from all of them and it projects back to all of them.\n\n56:43.720 --> 56:45.120\n And so we're testing that right now.\n\n56:45.120 --> 56:50.040\n We've got this beautiful neuronal reconstruction in the mouse called crown of thorns, crown\n\n56:50.040 --> 56:54.520\n of thorns neurons that are in the claustrum that have the most widespread connection of\n\n56:54.520 --> 56:56.360\n any neuron I've ever seen.\n\n56:56.360 --> 57:00.280\n They're very, you have individual neurons that sit in the claustrum tiny, but then they\n\n57:00.280 --> 57:05.480\n have this single neuron, they have this huge axonal tree that cover both ipsy and contralateral\n\n57:05.480 --> 57:11.000\n cortex and trying to turn using, you know, fancy tools like optogenetics, trying to turn\n\n57:11.000 --> 57:15.440\n those neurons on or off and study it, what happens in the, in the mouse.\n\n57:15.440 --> 57:20.520\n So this thing is perhaps where the parts become the whole.\n\n57:20.520 --> 57:25.440\n Perhaps it's one of the structures, it's a very good way of putting it, where the individual\n\n57:25.440 --> 57:30.080\n parts turn into the whole of the whole of the conscious experience.\n\n57:30.080 --> 57:35.400\n Well, with that, thank you very much for being here today.\n\n57:35.400 --> 57:36.400\n Thank you very much.\n\n57:36.400 --> 57:37.400\n Thank you very much.\n\n57:37.400 --> 57:55.640\n All right, thank you very much.\n\n"
}