{
  "title": "Avi Loeb: Aliens, Black Holes, and the Mystery of the Oumuamua | Lex Fridman Podcast #154",
  "id": "plcc6E-E1uU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.320\n The following is a conversation with Avi Loeb, an astrophysicist, astronomer,\n\n00:04.320 --> 00:10.640\n and cosmologist at Harvard. He has authored over 800 papers and written 8 books,\n\n00:10.640 --> 00:16.800\n including his latest, called Extraterrestrial, The First Sign of Intelligent Life Beyond Earth.\n\n00:16.800 --> 00:21.760\n It'll be released in a couple of weeks, so go preorder it now to show support for what I think\n\n00:21.760 --> 00:27.040\n is truly an important book in that it serves as a strong example of a scientist being both\n\n00:27.040 --> 00:33.520\n rigorous and open minded about the question of intelligent alien civilizations in our universe.\n\n00:34.080 --> 00:40.160\n Quick mention of our sponsors, Zero Fasting App for intermittent fasting, Element Electrolyte\n\n00:40.160 --> 00:45.680\n Drink, Sun Basket Meal Delivery Service, and Pessimist Archive History Podcast.\n\n00:46.240 --> 00:53.840\n So the choices, a fasting app, fasting fuel, fast breaking, delicious meals, and a history podcast\n\n00:53.840 --> 00:58.320\n that has very little to do with fasting. Choose wisely my friends, and if you wish,\n\n00:58.320 --> 01:02.240\n click the sponsor links below to get a discount and to support this podcast.\n\n01:02.240 --> 01:08.160\n As a side note, let me say a bit more about why Avi's work is so exciting to me and I think to\n\n01:08.160 --> 01:18.240\n a lot of people. In 2017, a strange interstellar object, now named Oumuamua, was detected traveling\n\n01:18.240 --> 01:22.640\n through our solar system. Based on the evidence we have, it had strange characteristics which\n\n01:22.640 --> 01:28.400\n made it not like any asteroid or comet that we've seen before. Avi was one of the only\n\n01:28.400 --> 01:33.440\n world class scientists who fearlessly suggested that we should be open minded about whether it\n\n01:33.440 --> 01:40.400\n is naturally made or in fact is an artifact of an intelligent alien civilization. In fact,\n\n01:40.400 --> 01:45.920\n he suggested that the more likely explanation given the evidence is the latter hypothesis.\n\n01:45.920 --> 01:50.960\n But we also talk about a lot of fascinating mysteries in our universe including black holes,\n\n01:50.960 --> 01:57.440\n dark matter, the big bang, and close to speed of light space travel. The theme throughout is that\n\n01:57.440 --> 02:03.360\n in scientific pursuits, the weird things, the anomalies, the ideas that right now are considered\n\n02:03.360 --> 02:08.960\n taboo should not be ignored if we are to have a chance at finding the next big breakthrough,\n\n02:08.960 --> 02:15.680\n the next big paradigm shift, and also if we are to inspire the world with the power and beauty\n\n02:15.680 --> 02:22.640\n of science. If you enjoy this thing, subscribe on YouTube, review on Apple Podcast, follow on Spotify,\n\n02:22.640 --> 02:28.880\n support on Patreon, or connect with me on Twitter at Lex Friedman. And now, here's my conversation\n\n02:28.880 --> 02:35.280\n with Avi Loeb. In the introduction to your new book, Extraterrestrial, you write,\n\n02:35.280 --> 02:41.760\n this book confronts one of the universe's most profound questions, are we alone? Over time,\n\n02:41.760 --> 02:47.440\n this question has been framed in different ways. Is life here on Earth the only life in the universe?\n\n02:47.440 --> 02:54.000\n Are humans the only sentient intelligence in the vastness of space and time? A better, more precise\n\n02:54.000 --> 02:59.760\n framing of this question would be this. Throughout the expanse of space and over the lifetime of the\n\n02:59.760 --> 03:07.440\n universe, are there now or have ever been other sentient civilizations that, like ours, explored\n\n03:07.440 --> 03:14.160\n the stars and left evidence of their efforts? So let me ask, are we alone? That's an excellent\n\n03:14.160 --> 03:21.280\n question. For me, the answer is sort of clear because I start from the principle of modesty.\n\n03:22.880 --> 03:28.800\n You know, if we believe that we are alone and special and unique, that shows arrogance. My\n\n03:28.800 --> 03:33.600\n daughters, when they were infants, they tended to think that they are special, unique, and then they\n\n03:33.600 --> 03:39.840\n went out to the street and realized that other kids are very much like them. And then they\n\n03:39.840 --> 03:45.920\n developed a sense of a better perspective about themselves. And I think the only reason that we\n\n03:45.920 --> 03:51.840\n are still thinking that we are special is because we haven't searched well enough to find others\n\n03:51.840 --> 03:57.920\n that might even be better than us. And, you know, I say that because I look at the newspaper every\n\n03:57.920 --> 04:02.880\n morning and I see that we do foolish things. We are not necessarily the most intelligent ones.\n\n04:02.880 --> 04:08.560\n And if you think about it, if you open a recipe book, you see that out of the same ingredients,\n\n04:08.560 --> 04:14.240\n you can make very different cakes, depending on how you put them together and how you heat them\n\n04:14.240 --> 04:21.840\n up. And what is the chance that by taking the soup of chemicals that existed on earth and cooking it\n\n04:21.840 --> 04:28.480\n one way to get our life, that you got the best cake possible? I mean, we are probably not the\n\n04:28.480 --> 04:34.240\n sharpest cookie in the jar. And my question is, I mean, it's pretty obvious to me that we are\n\n04:34.240 --> 04:40.000\n probably not alone because half of all the sun like stars we know now as astronomers, half of\n\n04:40.000 --> 04:47.760\n the sun like stars from the Kepler satellite data have a planet the size of the earth, roughly at\n\n04:47.760 --> 04:54.000\n the same distance that the earth is from the sun. And that means that they can have liquid water on\n\n04:54.000 --> 05:00.160\n their surface and the chemistry of life as we know it. So if you roll the dice billions of times,\n\n05:00.160 --> 05:07.280\n just within the Milky Way galaxy, and then you have tens of billions of galaxies like it within\n\n05:07.280 --> 05:11.520\n the observable volume of the universe, it would be extremely arrogant to think that we are special.\n\n05:11.520 --> 05:17.040\n I would think that we are sort of middle of the road, typical forms of life. And that's why\n\n05:17.040 --> 05:23.200\n nobody pays attention to us. If you go down the street on a sidewalk and you see an ant,\n\n05:23.200 --> 05:28.000\n you don't pay attention or a special respect to that ant, you just continue to walk. And\n\n05:28.000 --> 05:33.680\n so I think that we are sort of average, not very interesting, not exciting, so nobody cares about\n\n05:33.680 --> 05:39.200\n us. We tend to think that we are special, but that's a sign of immaturity. And we're very early\n\n05:39.200 --> 05:44.640\n on in our development. Yes, that's another thing that we have our technology only for 100 years,\n\n05:44.640 --> 05:50.320\n and it's evolving exponentially right now on a three year timescale. So imagine what would happen\n\n05:50.320 --> 05:56.000\n in a hundred years, in a thousand years, in a million years or in a billion years. Now, the Sun\n\n05:56.000 --> 06:02.320\n is actually relatively late in the star formation history of the universe. Most of the Sun like stars\n\n06:02.320 --> 06:09.840\n formed earlier, and some of them already died, you know, became white dwarfs. And so if you imagine\n\n06:09.840 --> 06:16.880\n that a civilization like ours existed around a typical Sun like star, by now, if they survived,\n\n06:16.880 --> 06:22.560\n they could be a billion years old. And then imagine a billion year technology, it would\n\n06:22.560 --> 06:27.920\n look like magic to us, you know, an approximation to God, we wouldn't be able to understand it.\n\n06:28.640 --> 06:35.440\n And so in my view, we should be humble. And by the way, we should probably just listen and not speak,\n\n06:36.080 --> 06:43.120\n because there is a risk, right? If you are inferior, there is a risk if you speak too loudly,\n\n06:43.120 --> 06:49.680\n something bad may happen to you. You mentioned, we should be humble also in the sense,\n\n06:50.240 --> 06:58.000\n with the analogy to ants, that they might be better than us. So there's a kind of scale that\n\n06:58.000 --> 07:03.920\n we're talking about. And in the question, you mentioned the word sentient. So sentience,\n\n07:03.920 --> 07:13.360\n or maybe the more basic formulation is consciousness. Do you think that this\n\n07:13.360 --> 07:20.320\n thing within us humans in terms of the typical life form of consciousness is the essential\n\n07:20.320 --> 07:25.840\n element that permeates other, if there's other alien civilizations out there, that they have\n\n07:25.840 --> 07:31.680\n something like consciousness as well? Or is this, I guess I'm asking, can you try to untangle the\n\n07:31.680 --> 07:38.720\n word sentient? Yeah, so that's a good question. I think what is most abundant, depending on how\n\n07:38.720 --> 07:46.480\n long it survives. So if you look at us, as an example, we are now, we do have consciousness\n\n07:46.480 --> 07:53.280\n and we do have technology. But the technologies that we are developing are also means for our\n\n07:53.280 --> 07:58.880\n own destruction, as we can tell. You know, we can change the climate if we are not careful enough.\n\n07:58.880 --> 08:05.920\n We can go into nuclear wars. So we are developing means for our own destruction through\n\n08:05.920 --> 08:13.760\n self inflicted wounds. And it might well be that creatures like us are not long lived, that\n\n08:13.760 --> 08:20.400\n crocodiles on other planets live for billions of years. They don't destroy themselves, they live\n\n08:20.400 --> 08:26.400\n naturally. And so if you look around, the most common thing would be dumb animals that live for\n\n08:26.400 --> 08:33.760\n long times, you know, not those that have conscious. But in terms of changing the environment, I think\n\n08:34.480 --> 08:42.880\n since, I mean, humans develop tools, they develop the ability to construct technologies that would\n\n08:44.080 --> 08:48.800\n lift us from this planet that we were born in. And that's something animals without a\n\n08:48.800 --> 08:57.920\n conscious, consciousness cannot really do. And so I, you know, in terms of looking for things\n\n08:57.920 --> 09:05.040\n that are new, that went beyond the circumstances they were born into, I would think that even if\n\n09:05.040 --> 09:10.480\n they're short lived, these are the creatures that made the biggest difference to their environment.\n\n09:10.480 --> 09:15.280\n And we can search for them, you know, even if they're short lived, and most of the civilizations\n\n09:15.280 --> 09:19.680\n are dead by now. Even if that's the case. That's sad to think about, by the way.\n\n09:19.680 --> 09:24.400\n Well, but if you look on Earth, that, you know, there are lots of cultures that existed throughout\n\n09:24.400 --> 09:30.400\n time, and they're dead by now. The Mayan culture was very sophisticated, died. But we can find\n\n09:30.400 --> 09:35.600\n evidence for it and learn about it just by archaeology, digging into the ground, looking.\n\n09:35.600 --> 09:41.680\n And so we can do the same thing in space, look for dead civilizations. And perhaps we can learn a\n\n09:41.680 --> 09:48.960\n lesson why they died and behave better so that we will not share the same fate. So I think, you know,\n\n09:48.960 --> 09:54.640\n there is a lesson to be learned from the sky. And by the way, I should also say, if we find\n\n09:54.640 --> 10:01.760\n a technology that we have not dreamed of, that we can import to Earth, that may be a better\n\n10:01.760 --> 10:07.680\n strategy for making a fortune than going to Silicon Valley or going to Wall Street. Because\n\n10:07.680 --> 10:13.520\n you make a jump start into something of the future. So that's one way to do the leap is\n\n10:13.520 --> 10:20.560\n actually to find, to literally discover versus come up with the idea in our own limited human\n\n10:20.560 --> 10:25.840\n capacity, like a cognitive capacity. It would look like, it would feel like cheating in an exam\n\n10:25.840 --> 10:30.960\n where you look over the shoulder of a student next to you. Yeah. But it's not good on an exam,\n\n10:30.960 --> 10:35.200\n but it is good when you're coming up with technology that could change the fabric of\n\n10:35.200 --> 10:41.760\n human civilization. But there is, you know, in my neck of the woods of artificial intelligence,\n\n10:42.320 --> 10:48.960\n there's a lot of trajectories one can imagine of creating very powerful beings,\n\n10:50.240 --> 10:56.160\n the technology that's essentially, you know, you can call super intelligence that could achieve\n\n10:57.040 --> 11:01.520\n space exploration, all those kinds of things without consciousness, without something that\n\n11:01.520 --> 11:09.680\n to us humans looks like consciousness. And there, you know, there is a sad feeling I have that\n\n11:09.680 --> 11:17.040\n consciousness too, in terms of us being humble, is a thing we humans take too seriously. That it's,\n\n11:17.040 --> 11:21.040\n we think it's special just because we have it. But it could be a thing that's actually holding\n\n11:21.040 --> 11:26.160\n us back in some kind of way. It may well be. It may well be. I should say something about AI,\n\n11:26.160 --> 11:33.600\n because I do think it offers a very important step into the future. If you look at the Old\n\n11:33.600 --> 11:40.320\n Testament, the Bible, there is this story about Noah's Ark that you might know about. Noah\n\n11:41.440 --> 11:48.880\n knew about a great flood that is about to endanger all life on earth. So he decided to build an ark.\n\n11:49.680 --> 11:55.440\n And the Bible actually talks about specifically what the size of this ark was, what the dimensions\n\n11:55.440 --> 12:02.480\n were. Turns out it was quite similar to Oumuamua that we will discuss in a few minutes. But at any\n\n12:02.480 --> 12:08.960\n event, he built this ark and he put animals on it so that they were saved from the great flood.\n\n12:08.960 --> 12:16.000\n Now, you can think about doing the same on earth, because there are risks for future catastrophes.\n\n12:16.000 --> 12:20.960\n You know, we could have the self inflicted wounds that we were talking about, like nuclear war,\n\n12:20.960 --> 12:26.720\n changing the climate. Or there could be an asteroid impacting us, just like the dinosaurs\n\n12:26.720 --> 12:32.400\n died. The dinosaurs didn't have science, astronomy. They couldn't have a warning system.\n\n12:32.400 --> 12:37.600\n But there was this big stone, big rock that approached them. It must have been a beautiful\n\n12:37.600 --> 12:43.360\n sight. Just when it was approaching, it got very big and then smashed them and killed them. So\n\n12:44.080 --> 12:48.640\n you could have a catastrophe like that. Or in a billion years, the sun will basically boil off\n\n12:48.640 --> 12:56.400\n all the oceans on earth. And currently all our eggs are in one basket, but we can spread them.\n\n12:57.040 --> 13:02.400\n It's sort of like the printing press, if you think about it. The revolution that Gutenberg\n\n13:02.400 --> 13:07.520\n brought is there were very few copies of the Bible at the time, and each of them was precious\n\n13:07.520 --> 13:13.040\n because it was handwritten. But once the printing press produced multiple copies, you know,\n\n13:13.040 --> 13:17.360\n if something bad happened to one of the copies, it wasn't a catastrophe. You know, it wasn't\n\n13:17.360 --> 13:25.520\n disaster because you had many more copies. And so if we have copies of life here on earth elsewhere,\n\n13:25.520 --> 13:32.960\n then we avoid the risk of it being eliminated by a single point breakdown, catastrophe.\n\n13:32.960 --> 13:39.680\n So the question is, can we build NOx spaceship that will carry life as we know it? Now,\n\n13:39.680 --> 13:45.840\n you might think we have to put elephants and whales and birds on a big spaceship, but that's\n\n13:45.840 --> 13:52.080\n not true because all you need to know is the DNA making, the genetic making of these animals,\n\n13:52.640 --> 14:02.720\n put it on a computer system that has AI plus a 3D printer so that this CubeSat, which is rather\n\n14:02.720 --> 14:09.600\n small, can go with this information to another planet and use the raw materials there to produce\n\n14:09.600 --> 14:16.400\n synthetic life. And that would be a way of producing copies, just like the Gutenberg printing press.\n\n14:16.400 --> 14:21.440\n Yeah, and it doesn't have to be exact copies of the humans, it could just contain some basic\n\n14:21.440 --> 14:29.040\n elements of life and then have enough life on board that it could reproduce the process of\n\n14:29.040 --> 14:34.800\n evolution on another place. So I mean, that also makes you sad, of course, because you confront\n\n14:34.800 --> 14:38.400\n the mortality of your own little precious consciousness and all your own memories and\n\n14:38.400 --> 14:44.400\n knowledge and all that stuff. But who cares? I care about mine, right? And you care about yours.\n\n14:44.400 --> 14:50.240\n No, no, I actually don't. If you're an astronomer, one thing that you learn from the universe\n\n14:50.240 --> 14:56.000\n is to be modest because you're not so significant. I mean, think about it, all these emperors and\n\n14:56.000 --> 15:01.280\n kings that conquered a piece of land on Earth and were extremely proud. You see these images\n\n15:01.280 --> 15:10.480\n of kings and emperors that usually are alpha males and they stand strong and they're very\n\n15:10.480 --> 15:15.600\n proud of themselves. But if you think about it, there are 10 to the power 20 planets like the\n\n15:15.600 --> 15:22.400\n Earth in the observable volume of the universe. And this view of conquering a piece of land and\n\n15:22.400 --> 15:29.120\n even conquering all of Earth is just like an ant hugging a single grain of sand on the landscape\n\n15:29.120 --> 15:35.840\n of a huge beach. That's not very impressive. So you can't be arrogant. If you see the big picture,\n\n15:35.840 --> 15:44.000\n you have to be humble. Also, we are short lived. Within 100 years, that's it. So what does it teach\n\n15:44.000 --> 15:49.760\n you? First to be humble, modest. You never have significant powers relative to the big scheme\n\n15:49.760 --> 15:56.160\n of things. And second, you should appreciate every day that you live and learn about the world.\n\n15:56.160 --> 16:07.040\n Humble and still grateful. Yes, exactly. Well, let's talk about probably the most interesting\n\n16:07.040 --> 16:13.840\n object I've heard about and also the most fun to pronounce. Oumuamua. Can you tell me the story\n\n16:13.840 --> 16:21.120\n of this object and why it may be an important event in human history? And is it possibly a piece\n\n16:21.120 --> 16:29.600\n of alien technology? Right. So this is the first object that was spotted close to Earth from\n\n16:29.600 --> 16:38.240\n outside the solar system. And it was found on October 19th, 2017. And at that time, it was\n\n16:38.240 --> 16:44.960\n receding away from us. And at first, astronomers thought it must be a piece of rock, you know,\n\n16:44.960 --> 16:49.440\n just like all the asteroids and comets that we have seen from within the solar system.\n\n16:49.440 --> 16:54.240\n And it just came from another star. I should say that the actual discovery of this object\n\n16:54.240 --> 16:59.600\n was surprising to me because a decade earlier, I wrote the first paper together with Ed Turner\n\n16:59.600 --> 17:06.240\n and Amaya Moro Martin that tried to predict whether the same telescope that was surveying\n\n17:06.240 --> 17:12.720\n the sky, PanSTARRS from Hawaii, would find anything from interstellar space, given what\n\n17:12.720 --> 17:17.760\n we know about the solar system. So if you assume that other planetary systems have similar\n\n17:17.760 --> 17:23.040\n abundance of rocks and you just calculate how many should be ejected into interstellar space,\n\n17:23.760 --> 17:30.560\n the conclusion is no, we shouldn't find anything with PanSTARRS. To me, I apologize for probably\n\n17:30.560 --> 17:36.320\n revealing my stupidity, but it was surprising to me that so few interstellar objects from outside\n\n17:36.320 --> 17:44.000\n this whole system have ever been detected. No, nothing. None has been. You do maybe talk about\n\n17:44.000 --> 17:50.240\n it that there has been one or two rocks since then. Well, since then, there was one called\n\n17:50.240 --> 17:57.440\n the Borisov. It was discovered by an amateur Russian astronomer, Gennady Borisov. And that one\n\n17:58.240 --> 18:05.200\n looked like a comet. And just like a comet from within the solar system. But this is a really\n\n18:05.200 --> 18:10.880\n important point. Sorry to interrupt it. You showed that it's unlikely that a rock from another solar\n\n18:10.880 --> 18:16.880\n system would arrive to ours. Right. And so the actual detection of this one was surprising by\n\n18:16.880 --> 18:24.480\n itself to me. Yes. But then, so at first they thought maybe it's a comet or an asteroid,\n\n18:24.480 --> 18:31.520\n but then it didn't look like anything we've seen before. Borisov did look like a comet. So people\n\n18:31.520 --> 18:38.400\n asked me afterwards and said, you know, doesn't it convince you if Borisov looks like a comet,\n\n18:38.400 --> 18:44.160\n doesn't it convince you that Oumuamua is also natural? And I said, you know, when I went on the\n\n18:44.160 --> 18:50.640\n first date with my wife, she looked special to me. And since then I met many women. That didn't\n\n18:50.640 --> 18:59.120\n change my opinion of my wife. So, you know, that's not an argument. Anyway, so why did the Oumuamua\n\n18:59.120 --> 19:05.200\n look weird? Let me explain. So first of all, astronomers monitored the amount of light,\n\n19:05.200 --> 19:13.120\n sunlight that it reflects. And it was tumbling, spinning every eight hours. And as it was spinning,\n\n19:13.120 --> 19:18.000\n the brightness that we saw from that direction, we couldn't resolve it because it's tiny. It's\n\n19:18.000 --> 19:24.080\n about a hundred meters, a few hundred feet, size of a football field. And we cannot, from Earth,\n\n19:24.080 --> 19:29.600\n with existing telescopes, we cannot resolve it. The only way to actually get a photograph of it\n\n19:29.600 --> 19:38.080\n is to send a camera close to it. And that was not possible at the time that Oumuamua was discovered\n\n19:38.080 --> 19:43.680\n because it was already moving away from us faster than any rocket we can send. It's sort of like a\n\n19:43.680 --> 19:49.440\n guest that appeared for dinner. And then by the time we realized that it's weird, the guest is\n\n19:49.440 --> 19:56.160\n already out the front door into the dark street. What we would like to find is an object like it\n\n19:56.160 --> 20:01.600\n approaching us, because then you can send the camera irrespective of how fast it moves. And\n\n20:01.600 --> 20:07.760\n if we were to find it in July 2017, that would have been possible because it was approaching us\n\n20:07.760 --> 20:14.240\n at that time. Actually, I was visiting Mount Haleakala in Maui, Hawaii with my family for\n\n20:14.240 --> 20:23.440\n vacation at that time in July 2017, but nobody knew at the observatory that the Oumuamua is\n\n20:23.440 --> 20:28.560\n very close. That's sad to think about that we had the opportunity at that time to send up a camera.\n\n20:28.560 --> 20:35.360\n But don't worry. I mean, there will be more. There will be more because I operate by the Copernican\n\n20:35.360 --> 20:42.000\n principle, which says we don't live at a special place and we don't live at a special time. And\n\n20:42.000 --> 20:48.960\n that means if we surveyed the sky for a few years and we had sensitivity to this region between us\n\n20:48.960 --> 20:55.280\n and the sun, and we found this object with PanStars, there should be many more that we\n\n20:55.280 --> 21:01.760\n will find in the future with surveys that might be even better. And actually, in three years\n\n21:01.760 --> 21:08.000\n timescale, there would be the so called LSST. That's a survey of the Vera Rubin Observatory\n\n21:08.000 --> 21:14.320\n that would be much more sensitive and could potentially find an Oumuamua like object\n\n21:14.320 --> 21:21.200\n every month. OK, so I'm just waiting for that. And the main reason for me to alert everyone\n\n21:22.160 --> 21:27.600\n to the unusual properties of Oumuamua is with the hope that next time around, when we see\n\n21:27.600 --> 21:32.560\n something as unusual, we would take a photograph or we would get as much evidence as possible\n\n21:32.560 --> 21:37.920\n because science is based on evidence, not on prejudice. And we will get back to that theme.\n\n21:37.920 --> 21:42.560\n So anyway, let me let me point out some of the properties, actually, the elongated nature,\n\n21:42.560 --> 21:48.160\n all those kinds of things. So the light curve, the amount of light, sunlight that was reflected\n\n21:48.160 --> 21:55.840\n from it was changing over eight hours by a factor of 10, meaning that the area of this\n\n21:55.840 --> 22:02.640\n object, even though we can't resolve it, the area on the sky that reflects sunlight was\n\n22:02.640 --> 22:09.280\n bigger by a factor of 10 in some phases as it was tumbling around than in other phases.\n\n22:09.280 --> 22:14.400\n So even if you take a piece of paper that is razor thin, you know, there is a very small\n\n22:14.400 --> 22:20.720\n likelihood that it's exactly edge on and getting a factor of 10 change in the area that you see\n\n22:20.720 --> 22:27.760\n on the sky is huge. It's much more than any. It means that the object has an unusual geometry.\n\n22:27.760 --> 22:32.640\n It's at least a factor of a few more than any of the comets or asteroids that we have seen before.\n\n22:32.640 --> 22:35.760\n You mentioned reflectivity. So it's not just the geometry, but\n\n22:35.760 --> 22:42.640\n the properties of the surface of that thing. Well, if you assume the reflectivity is the same,\n\n22:42.640 --> 22:47.680\n then it's just geometry. If you assume the reflectivity may change, then it could be\n\n22:47.680 --> 22:52.720\n a combination of the area that you see and the reflectivity because different directions may\n\n22:52.720 --> 23:00.000\n reflect differently. But the point is that it's very extreme. And actually the best fit\n\n23:00.000 --> 23:06.640\n to the light curve that we saw was of a flat object. Unlike all the cartoons that you have seen\n\n23:06.640 --> 23:13.360\n of a cigar shape, a flat object at the 90% confidence gives a better model for the way\n\n23:13.360 --> 23:17.680\n that the light varied. So like flat meaning like a pancake.\n\n23:17.680 --> 23:25.440\n Like a pancake. Exactly. And so that's, you know, the very first unusual property. But to me,\n\n23:25.440 --> 23:31.440\n it was not unusual enough to think that it might be artificial. It was not significant enough.\n\n23:32.000 --> 23:38.800\n Then there was no cometary tail, you know, no dust, no gas around this object. And the\n\n23:38.800 --> 23:45.120\n Spitzer Space Telescope really searched very deeply for carbon based molecules. There was nothing.\n\n23:45.680 --> 23:49.280\n So it's definitely not a comet the way people expected it to be.\n\n23:49.280 --> 23:55.760\n Can you maybe briefly mention what properties a comet that you're referring to usually has?\n\n23:55.760 --> 24:02.960\n Right. So a comet is a rock that has some water ice on the surface. So you can think of it as an\n\n24:02.960 --> 24:12.320\n icy rock. Actually comets were discovered a long time ago, but the first model that was developed\n\n24:12.320 --> 24:19.680\n for them was by Fred Whipple, who was at Harvard. And I think the legend goes that he got the idea\n\n24:19.680 --> 24:26.560\n from walking through Harvard Square and seeing during a winter day and seeing these icy rocks,\n\n24:26.560 --> 24:30.800\n you know. So a comet is icy and an asteroid is not.\n\n24:30.800 --> 24:32.400\n It's just a rock. It's just a rock.\n\n24:32.400 --> 24:38.320\n Yeah. So when you have ice on the surface, when the rock gets close to the sun,\n\n24:38.320 --> 24:46.480\n the sunlight warms it up and the ice sublimates, evaporates. Because the one thing about ice,\n\n24:46.480 --> 24:52.640\n water ice, is it doesn't become liquid if you warm it up in vacuum, you know, without\n\n24:53.280 --> 24:59.680\n an external pressure. It just goes straight into gas. And that's what you see as the tail of a\n\n24:59.680 --> 25:07.120\n comet. The only way to get liquid water is to have an atmosphere like on Earth that has an external\n\n25:07.120 --> 25:13.360\n pressure. Only then you get liquid. And that's why it's essential to have an atmosphere to a planet\n\n25:13.360 --> 25:19.200\n in order to have liquid water and the chemistry of life. So if you look at Mars, Mars lost its\n\n25:19.200 --> 25:25.120\n atmosphere and therefore no liquid water on the surface anymore. I mean, there may have been early\n\n25:25.120 --> 25:31.600\n and that's what the Perseverance survey, you know, the Perseverance mission will try to find out\n\n25:31.600 --> 25:37.600\n whether it had liquid water, whether there was life perhaps on it at the time, but at some point\n\n25:37.600 --> 25:44.000\n it lost its atmosphere and then the liquid water was gone. So the only reason that we can live on\n\n25:44.000 --> 25:51.680\n Earth is because of the atmosphere. But a comet is in vacuum pretty much. And then when it gets\n\n25:51.680 --> 25:58.160\n warmed up on the surface, the water becomes, the water ice becomes gas and then you see this\n\n25:58.160 --> 26:05.440\n cometary tail behind it. In addition to water, there are all kinds of carbon based molecules\n\n26:05.440 --> 26:11.600\n or dust that comes off the surface. And those are detectable. Yeah, it's easy to detect. It's very\n\n26:11.600 --> 26:16.400\n prominent. You see these cometary tails that look very prominent because they reflect sunlight\n\n26:16.400 --> 26:20.640\n and you can see them. In fact, it's sometimes difficult to see the nucleus of the comet\n\n26:20.640 --> 26:26.640\n because it's surrounded and shrouded with, and in this case, there was no trace of anything.\n\n26:26.640 --> 26:30.480\n That's fascinating. Now you might say, okay, it's not a comet. So that's what the community said.\n\n26:30.480 --> 26:34.080\n Okay, it's not a, no problem. It's still a rock, you know, it's not a comet,\n\n26:34.080 --> 26:40.320\n but it's just a rock, bare rock. You know, okay, no problem. Then, and that's the thing that\n\n26:40.320 --> 26:46.000\n convinced me to write about it. And then in June 2018, you know, significantly later,\n\n26:46.880 --> 26:55.200\n there was a report that in fact the object exhibited an excess push in addition to the\n\n26:55.200 --> 27:00.080\n force of gravity. So the sun acts on it by gravity, but then there was an extra push\n\n27:00.080 --> 27:06.400\n on this object that was figured out from the orbit that you can trace. And the question was,\n\n27:06.400 --> 27:12.000\n what is this excess push? So for comets, you get the rocket effect. When you evaporate gas,\n\n27:12.000 --> 27:18.000\n you know, just like a jet engine on an airplane, you throw, a jet engine is very simple. You throw\n\n27:18.000 --> 27:23.840\n the gas back and it pushes the airplane forward. That's all. That's how the jet. So in a case of\n\n27:23.840 --> 27:29.200\n a comet, you throw gas in the direction of the sun because it, and then you get a push.\n\n27:29.200 --> 27:34.800\n Okay. So in the case of comets, you can get a push, but there was no cometary tail. So then\n\n27:34.800 --> 27:40.240\n people say, oh, wait a second. Is it an asteroid? No, but it behaves like a comet, but it doesn't\n\n27:40.240 --> 27:45.520\n look like a comet. So what, well, forget about it. Business as usual. So that's what they mean\n\n27:45.520 --> 27:52.080\n by a non gravitation acceleration. So that's interesting. So like the primary force acting\n\n27:52.080 --> 27:57.360\n on something like just a rock, like an asteroid would be like, you can predict the trajectory\n\n27:57.360 --> 28:02.880\n based on the gravity, based on gravity. And so here there's detected movement that's not,\n\n28:02.880 --> 28:07.600\n cannot be accounted purely by the gravity of the sun. And if it was a comet, you would need about\n\n28:07.600 --> 28:14.080\n a 10th of the mass of this comet, the weight of this comet to be evaporated in order to give it.\n\n28:14.080 --> 28:19.760\n And there was no sign of that. No sign. 10% of the mass evaporating. It's huge. Think about it.\n\n28:19.760 --> 28:24.560\n A hundred meter size object losing 10% of its mass. You can't miss that.\n\n28:25.440 --> 28:27.600\n So that's super weird.\n\n28:27.600 --> 28:28.640\n It's super weird.\n\n28:28.640 --> 28:32.160\n Is there a good explanation, is there in your mind a possible explanation for this?\n\n28:32.160 --> 28:37.520\n So I operated just like Sherlock Holmes in a way. I said, okay, what are the possibilities? And\n\n28:37.520 --> 28:42.000\n the only thing I could think, so I ruled out everything else. And I said, it must be the\n\n28:42.000 --> 28:49.920\n sunlight reflected off it. Okay. So the sunlight reflects off the surface and gives it a push,\n\n28:49.920 --> 28:55.440\n just like you get a push on a sail on a boat, you know, from the wind reflecting off it.\n\n28:56.160 --> 29:01.600\n Now, in order for this to be effective, it turns out the object needs to be extremely thin.\n\n29:03.440 --> 29:08.640\n It turns out it needs to be less than a millimeter thick. Nature does not produce such things.\n\n29:08.640 --> 29:15.920\n But we produce it because it's called the technology of a light sail. So we are,\n\n29:15.920 --> 29:21.520\n for space exploration, we are exploring this technology because it has the benefit of\n\n29:21.520 --> 29:26.000\n not needing to carry the fuel with the spacecraft. So you don't have the fuel, you just have a\n\n29:28.480 --> 29:37.680\n sail and it's being pushed either by sunlight or by a laser beam or whatever. So perhaps this is\n\n29:37.680 --> 29:42.800\n the light sail. So this is actually the same technology with the Starshot project. Yes.\n\n29:42.800 --> 29:49.760\n So people afterwards say, okay, you work on this project, you imagine. No, that's a pretty good\n\n29:49.760 --> 29:55.920\n explanation, right? Obviously, my imagination is limited by what I know. So I would not deny that\n\n29:57.040 --> 30:03.280\n working on light sails expanded my ability to imagine this possibility. But let me offer another\n\n30:03.280 --> 30:12.960\n interesting anecdote. In September this year, 2020, there was another object found,\n\n30:13.840 --> 30:22.640\n and it was given the name 2020SO by the Minor Planet Center. This is an organization actually\n\n30:22.640 --> 30:28.800\n in Cambridge, Massachusetts, that gives names to astronomical objects found in the solar system.\n\n30:28.800 --> 30:35.360\n And they gave it that name 2020SO because, you know, it looked like an object in the solar system\n\n30:35.360 --> 30:41.840\n and it moved in an orbit that is similar to the orbit of the Earth, but not the same exactly.\n\n30:42.480 --> 30:49.440\n And therefore it was bound to the Sun, but it also exhibited a deviation from what you expect\n\n30:49.440 --> 30:55.680\n based on gravity. So the astronomers that found it extrapolated back in time and found that\n\n30:55.680 --> 31:03.360\n in 1966, it intercepted the Earth. And then they went to the history books and they realized,\n\n31:03.360 --> 31:12.000\n oh, there was a mission called Lunar Lander Surveyor 2 that had a rocket booster. It was\n\n31:12.000 --> 31:18.240\n a failed mission, but there was a rocket booster that was kicked into space. And presumably this\n\n31:18.240 --> 31:23.680\n is the rocket booster that we're seeing. Now, this rocket booster was sufficiently hollow and thin\n\n31:23.680 --> 31:30.400\n for us to recognize that it's pushed by sunlight. So here is my point. We can tell from the orbit\n\n31:30.400 --> 31:36.480\n of an object, obviously this object didn't have any cometary tail. It was artificially made. We\n\n31:36.480 --> 31:44.320\n know that it was made by us and it did deviate from an orbit of a rock. So just by seeing\n\n31:44.320 --> 31:49.520\n something that doesn't have cometary tail and deviates from an orbit shaped by gravity,\n\n31:49.520 --> 31:55.040\n we can tell that it's artificial. In the case of Oumuamua, it couldn't have been sent by humans\n\n31:55.040 --> 32:01.360\n because it just passed near us for a few months. We know exactly what we were doing at that time.\n\n32:01.360 --> 32:06.800\n And also it was moving faster than any object that we can launch. And so obviously it came from\n\n32:06.800 --> 32:13.600\n outside the solar system. And the question is who produced it? Now, I should say that when I walk\n\n32:13.600 --> 32:21.120\n on vacation on the beach, I often see natural objects like seashells that are beautiful and I\n\n32:21.120 --> 32:29.040\n look at them. And every now and then I stumble on a plastic bottle that was artificially produced.\n\n32:29.920 --> 32:37.440\n And my point is that maybe Oumuamua was a message in a bottle. And this is simply another window\n\n32:37.440 --> 32:43.840\n into searching for artifacts from other civilizations. Where do you think it could have\n\n32:43.840 --> 32:54.240\n come from? And if it's so, okay, from a scientific perspective, the narrow minded view, as we'll\n\n32:54.240 --> 32:59.920\n probably talk about throughout, is, you know, you kind of want to stick to the things that,\n\n33:00.640 --> 33:06.640\n to naturally originating objects like asteroids and comets. Okay, that's the space of possible\n\n33:06.640 --> 33:12.160\n hypotheses. And then if we expand beyond that, you start to think, okay, these are artificially\n\n33:12.160 --> 33:19.280\n constructed. Like you just said, it could be by humans. It could be by whatever that means,\n\n33:19.280 --> 33:26.640\n by some kind of extraterrestrial alien civilizations. If it's the alien civilization\n\n33:26.640 --> 33:34.400\n variety, what is this object then? That's an excellent question. And let me lay out,\n\n33:34.400 --> 33:38.400\n I mean, we don't have enough evidence to tell. If we had a photograph, perhaps we would have\n\n33:38.400 --> 33:47.440\n more information. But there is one other peculiar fact about Oumuamua. Well, other than it was very\n\n33:47.440 --> 33:53.120\n shiny, that I didn't mention, you know, we didn't detect any heat from it. And that implies that\n\n33:53.120 --> 34:00.880\n it's rather small and shiny. But the other peculiar fact is that it came from a very special frame of\n\n34:00.880 --> 34:08.480\n reference. So it's sort of like finding a car in a parking lot, in a public parking lot, that,\n\n34:08.480 --> 34:13.440\n you know, you can't really tell where it came from. So there is this frame of reference where\n\n34:13.440 --> 34:20.800\n you average over the motions of all the stars in the neighborhood of the Sun. So you find the\n\n34:20.800 --> 34:28.480\n so called local standard of rest of the galaxy. And that's a frame of reference that is obtained\n\n34:28.480 --> 34:34.080\n by averaging the random motions of all the stars. And the Sun is moving relative to that frame at\n\n34:34.080 --> 34:41.840\n some speed. But this object was at rest in that frame. And only one in 500 stars is so much at\n\n34:41.840 --> 34:46.480\n rest in that frame. And that's why I was saying it's like a parking lot. It was parked there,\n\n34:46.480 --> 34:52.560\n and we bumped into it. So the relative speed between the solar system and this object is just\n\n34:52.560 --> 34:59.840\n because we are moving. It was sitting still. Now you ask yourself, why is it so unusual in that\n\n34:59.840 --> 35:06.400\n context? You know why? Because if it was expelled from another planetary system, most likely it will\n\n35:06.400 --> 35:12.480\n carry the speed of the host star that it came from. Because it was, you know, the most loosely\n\n35:12.480 --> 35:19.680\n bound objects are in the periphery of the planetary system, and they move very slowly relative to the\n\n35:19.680 --> 35:24.480\n star. And so they carry the, when they are ripped apart from the planetary system, most of the\n\n35:24.480 --> 35:30.320\n objects will have the residual motion of the star roughly relative to the local star. But this one\n\n35:30.320 --> 35:37.840\n was at rest in the local star. Now, one thing I can think of, if there is a grid of road posts,\n\n35:37.840 --> 35:44.080\n you know, like for navigation system, so that you can find your way in the local frame, then that\n\n35:44.080 --> 35:48.800\n would be one possibility. These are like little sensors of, that's fascinating to think about. So\n\n35:48.800 --> 35:55.440\n there could be, I mean, not necessarily literally a grid, but just evenly, in some definition of\n\n35:55.440 --> 36:01.280\n evenly spread out set of objects like these that are just out there. A lot of them. Another\n\n36:01.280 --> 36:06.080\n possibility is that these are relay stations, you know, for communication. You might think,\n\n36:06.080 --> 36:12.640\n in order to communicate, you need a huge beacon, a very powerful beacon. But it's not true. Because\n\n36:12.640 --> 36:17.520\n even on Earth, you know, we have these relay stations. So you have a not so powerful beacon.\n\n36:17.520 --> 36:22.320\n So it can be heard only out to a limited distance, but then you relay the message.\n\n36:22.880 --> 36:28.080\n And it could be one of those. Now, after it collided with the solar system, of course,\n\n36:28.080 --> 36:33.760\n it got a kick. So it's just like a billiard ball, you know, we gave it a kick by colliding with,\n\n36:33.760 --> 36:38.560\n but most of them are not colliding with stars. And so that's one possibility. Okay. And there\n\n36:38.560 --> 36:46.240\n should be numerous, lots of them, if that's the case. The other possibility is that it's a probe,\n\n36:46.240 --> 36:54.960\n you know, that was sent in the direction of the habitable region around the Sun to find out if\n\n36:54.960 --> 37:00.480\n there is life. Now, it takes tens of thousands of years for such a probe to traverse the solar\n\n37:00.480 --> 37:06.160\n system from the outer edge of the Oort cloud, all the way to where we are. And, you know,\n\n37:06.160 --> 37:09.680\n it's a long journey. So when it started the journey from the edge of the solar system to\n\n37:09.680 --> 37:15.120\n get to us now, you know, we were rather primitive back then, you know, we still didn't have any\n\n37:15.120 --> 37:20.000\n technology, there was no reason to visit, you know, there was grass around and so forth. But,\n\n37:20.000 --> 37:25.440\n you know, maybe it is a probe. So you said 10,000 years, that's faster. So it takes that long.\n\n37:25.440 --> 37:30.560\n Tens of thousands, yes. Tens of thousands of years. Yeah. Yeah. And the other thing I should\n\n37:30.560 --> 37:38.160\n say is, you know, it could be just an outer layer of something else, like, you know, something that\n\n37:38.160 --> 37:45.280\n was ripped apart, like a surface of an instrument. And you can have lots of these pieces, you know,\n\n37:45.280 --> 37:51.040\n if something breaks, lots of these pieces spread out, like space junk. And, you know, that...\n\n37:51.040 --> 37:56.800\n It could be just space junk from an alien civilization.\n\n37:56.800 --> 37:59.120\n Yes. So it's kind of...\n\n37:59.120 --> 38:01.440\n I should tell you about space junk. Let me...\n\n38:01.440 --> 38:03.600\n Yes. What do you mean by space junk?\n\n38:03.600 --> 38:09.760\n So, I think, you know, you might ask, why aren't they looking for us? One possibility\n\n38:09.760 --> 38:14.000\n is that we are not interesting, like we were talking about ants. Another possibility,\n\n38:14.560 --> 38:21.760\n you know, if there are millions or billions of years into their technological development,\n\n38:21.760 --> 38:28.800\n they created their own habitat, their own cocoon, where they feel comfortable, they have everything\n\n38:28.800 --> 38:36.160\n they need. And it's risky for them to establish communication with other... So they have their\n\n38:36.160 --> 38:41.600\n own cocoon and they close off. They don't care about anything else. Now, in that case, you might\n\n38:41.600 --> 38:47.600\n say, oh, so how can we find about them if they are closed off? The answer is they still have to\n\n38:47.600 --> 38:53.600\n deposit trash, right? That is something from the law of thermodynamics. There must be some production\n\n38:53.600 --> 39:00.480\n of trash. And, you know, we can still find about them just like investigative journalists going\n\n39:00.480 --> 39:06.080\n through the trash cans of celebrities in Hollywood, you know. You can learn about the private lives\n\n39:06.640 --> 39:09.120\n of those celebrities by looking at the trash.\n\n39:09.120 --> 39:12.880\n It's fascinating to think, you know, if we are the ants in this picture,\n\n39:14.000 --> 39:21.040\n if this thing is a water bottle, or if it's like a smartphone, like where on the spectrum of\n\n39:21.040 --> 39:28.640\n possible objects of space, because there's a lot of interesting trash. How interesting is this trash?\n\n39:28.640 --> 39:34.720\n But imagine a caveman seeing a cell phone. The caveman would think, since the caveman played\n\n39:34.720 --> 39:39.680\n with rocks all of his life, he would say, it's a rock, just like my fellow astronomers said.\n\n39:39.680 --> 39:45.360\n Yes, exactly. That's brilliantly put. Actually, as a scientist, do you hope it's a water bottle\n\n39:45.360 --> 39:46.240\n or a smartphone?\n\n39:46.240 --> 39:51.360\n Because I hope it's even more than a smartphone. I hope that it's something that is really\n\n39:51.360 --> 39:52.240\n sophisticated.\n\n39:52.240 --> 39:56.960\n That's funny. See, I'm the opposite. I feel like I hope it's a water bottle because\n\n39:57.760 --> 40:03.280\n at least we have a hope with our current set of skills to understand it. A caveman has no way of\n\n40:03.280 --> 40:08.320\n understanding the smartphone. It's like, it will be like, I feel like a caveman has more to learn\n\n40:08.320 --> 40:11.360\n from the plastic water bottle than they do from the smartphone.\n\n40:11.360 --> 40:17.840\n But suppose we figure it out. If we, for example, come close to it and learn what it's made of.\n\n40:17.840 --> 40:22.640\n And I guess a smartphone is full of like thousands of different technologies that we could\n\n40:22.640 --> 40:32.800\n probably pick at. Do you have a sense of where a hypothesis of where is the cocoon that it\n\n40:32.800 --> 40:33.600\n might have come from?\n\n40:33.600 --> 40:40.400\n No, because, okay, so first of all, you know, the solar system, the outermost edge of the\n\n40:40.400 --> 40:49.840\n solar system is called the Oort cloud. It's a cloud of icy rocks of different sizes that were\n\n40:49.840 --> 40:57.520\n left over from the formation of the solar system. And it's thought to be roughly a ball or a\n\n40:57.520 --> 41:04.640\n sphere. And it's halfway, the extent of it is roughly halfway to the nearest star. Okay, so you\n\n41:04.640 --> 41:14.560\n can imagine each planetary system basically touching the Oort clouds of those stars that are\n\n41:14.560 --> 41:22.320\n near us are touching each other. Space is full of these billiard balls that are very densely\n\n41:22.320 --> 41:28.480\n packed. And what that means is any object that you see, irrespective of whether it came from\n\n41:28.480 --> 41:32.880\n the local standard. So we said that this object is special because it came from a local standard\n\n41:32.880 --> 41:38.880\n of rest. But even if it didn't, you would never be able to trace where it came from because all\n\n41:38.880 --> 41:46.080\n these Oort clouds overlap. So if you take some direction in the sky, you will cross as many\n\n41:46.080 --> 41:52.240\n stars as you have in that direction. Like, there is no way to tell which Oort cloud it came from.\n\n41:52.240 --> 41:57.120\n So yes, I didn't realize how densely packed everything was from the perspective of the Oort\n\n41:57.120 --> 42:01.920\n cloud. And that's really interesting. So yeah, it could be nearby, it could be very far away.\n\n42:01.920 --> 42:03.920\n Yeah, we have no clue.\n\n42:03.920 --> 42:13.200\n You said cocoon. And you kind of paint, I think in the book, I've read a lot of your articles too\n\n42:13.200 --> 42:16.720\n on the Scientific American, which are brilliant. So I'm kind of mixing things up in my head a\n\n42:16.720 --> 42:24.480\n little bit. But what does that cocoon look like? What does a civilization that's able to harness\n\n42:24.480 --> 42:31.680\n the power of multiple suns, for example, look like? When you imagine possible civilizations that are\n\n42:31.680 --> 42:36.160\n a million years more advanced than us, what do you think that actually looks like?\n\n42:36.800 --> 42:42.800\n I think it's very different than we can imagine. By the way, I should start from the point that\n\n42:42.800 --> 42:50.240\n even biological life, just without technology getting into the game, could look like something\n\n42:50.240 --> 42:55.920\n we have never seen before. Take, for example, the nearest star, which is Proxima Centauri.\n\n42:55.920 --> 43:03.040\n It's four and a quarter light years away. So they will know about the results of the 2016 elections\n\n43:03.040 --> 43:16.000\n only next month, in February 2021. It's very far away. But if you think about it, this star is a\n\n43:16.000 --> 43:26.560\n dwarf star, and it's twice as cold as the sun. And it emits mostly infrared radiation. So if there\n\n43:26.560 --> 43:34.400\n are any creatures on the planet close to it that is habitable, which is called Proxima B, there is\n\n43:34.400 --> 43:39.120\n a planet in the habitable zone, in the zone just at the right distance where, in principle, liquid\n\n43:39.120 --> 43:45.040\n water can be on the surface. If there are any animals there, they have infrared eyes because\n\n43:45.040 --> 43:51.440\n our eyes were designed to be sensitive to where most of the sunlight is in the visible range.\n\n43:51.440 --> 43:59.920\n But Proxima Centauri emits mostly infrared. So in the nearest star system, these animals would be\n\n44:00.800 --> 44:06.480\n quite strange. They would have eyes that are detectors of infrared, very different from ours.\n\n44:06.480 --> 44:12.880\n Moreover, this planet, Proxima B, faces the star always with the same side. So it has a permanent\n\n44:12.880 --> 44:19.360\n day side and a permanent night side. And obviously the creatures that would evolve on the permanent\n\n44:19.360 --> 44:24.560\n day side, which is much warmer, would be quite different than those on the permanent night side.\n\n44:24.560 --> 44:31.280\n Between them, there would be a permanent sunset strip. And my daughters said that that's the best\n\n44:31.280 --> 44:37.600\n opportunity for high value real estate because you will see the sunset throughout your life,\n\n44:37.600 --> 44:46.000\n right? The sun never sets on this trip. So these worlds are out of our imagination.\n\n44:46.000 --> 44:50.240\n Just even the individual creatures, the sensor suite that they're operating with\n\n44:50.240 --> 44:53.680\n might be very different. Very different. So I think when we see something like that,\n\n44:53.680 --> 44:59.760\n we would be shocked not to speak about seeing technology. So I don't even dare to imagine.\n\n45:01.440 --> 45:07.760\n And I think obviously we can bury our head in the sand and say, it's never aliens,\n\n45:07.760 --> 45:13.360\n like many of my colleagues say. And it's a self fulfilling prophecy. If you never look,\n\n45:13.360 --> 45:18.800\n you will never find. If you're not ready to find wonderful things, you will never discover them.\n\n45:19.360 --> 45:25.360\n And the other thing I would like to say is reality doesn't care whether you ignore it or not.\n\n45:25.360 --> 45:31.440\n You can ignore reality, but it's still there. So we can all agree, based on Twitter,\n\n45:32.560 --> 45:39.600\n that aliens don't exist. That Umuamua was a rock. We can all agree. And you will get a lot of likes,\n\n45:39.600 --> 45:44.480\n we will have a big crowd of supporters, and everyone will be happy and give each other\n\n45:44.480 --> 45:51.920\n awards and honors and so forth. But Umuamua might still be an alien artifact. Who cares\n\n45:51.920 --> 45:59.680\n what humans agree on? There is a reality out there. And we have to be modest enough to recognize\n\n45:59.680 --> 46:06.400\n that we should make our statements based on evidence. Science is not about ourselves. It's\n\n46:06.400 --> 46:14.160\n not about glorifying our image. It's not about getting honors, prizes. A lot of the academic\n\n46:14.160 --> 46:19.680\n activity is geared towards creating your echo chamber where you have students, postdocs,\n\n46:19.680 --> 46:25.120\n repeating your mantras so that your voice is heard loudly so that you can get more honors,\n\n46:25.120 --> 46:31.600\n prizes, recognition. That's not the purpose of science. The purpose is to figure out what nature\n\n46:31.600 --> 46:37.840\n is. And in the process of doing that, it's a learning experience. You make mistakes. Einstein\n\n46:37.840 --> 46:44.080\n made three mistakes at the end of his career. He argued that in the 1930s, he argued that black\n\n46:44.080 --> 46:52.400\n holes don't exist, gravitational waves don't exist, and quantum mechanics doesn't have spooky action\n\n46:52.400 --> 46:58.400\n at a distance. And all three turned out to be wrong. So the point is that if you work at the\n\n46:58.400 --> 47:04.000\n frontier, then you make mistakes. It's inevitable because you can't tell what is true or not.\n\n47:04.000 --> 47:10.640\n And avoiding making mistakes in order to preserve your image makes you extremely boring. You will\n\n47:10.640 --> 47:16.480\n get a prize, but you will be a boring scientist because you will keep repeating things we already\n\n47:16.480 --> 47:22.160\n know. If you want to make progress, if you want to innovate, you have to take risks and you have\n\n47:22.160 --> 47:28.480\n to look at the evidence. It's a dialogue with nature. You don't know the truth in advance. You\n\n47:28.480 --> 47:35.440\n let nature tell you, educate you, and then you realize that what you thought before is incorrect.\n\n47:35.440 --> 47:40.960\n And a lot of my colleagues prefer to be in a state where they have a monologue. You know,\n\n47:40.960 --> 47:46.160\n if you look at these people that work on string theory, they have a monologue. They know what,\n\n47:46.160 --> 47:52.480\n and in fact, their monologue is centered on anti de Sitter space, which we don't live in now.\n\n47:53.440 --> 47:57.840\n To me, it's just like the Olympics. You define a hundred meters and you say,\n\n47:57.840 --> 48:03.920\n whoever runs these hundred meters is the best athlete, the fastest. And it's completely\n\n48:03.920 --> 48:09.680\n arbitrary. You could have decided it would be 50 meters or 20 meters. Who cares? You just measure\n\n48:09.680 --> 48:14.560\n the ability of people this way. So you define anti de Sitter space as a space where you do your\n\n48:14.560 --> 48:19.680\n mathematical gymnastics, and then you find who can do it the best. And you give jobs based on that.\n\n48:19.680 --> 48:25.280\n You give prizes. But as we said before, you know, nature doesn't care about, you know,\n\n48:25.280 --> 48:32.160\n the prizes that you give to each other. It cares, you know, it has its own reality and we should\n\n48:32.160 --> 48:37.760\n figure it out. And it's not about us. The scientific activity is about figuring out nature. And\n\n48:37.760 --> 48:46.560\n sometimes we may be wrong. Our image will not be preserved. But that's the fun, you know. Kids\n\n48:46.560 --> 48:52.960\n explore the world out of curiosity. And I always want to maintain my childhood curiosity. And I\n\n48:52.960 --> 48:59.840\n don't care about the labels that I have. In fact, having tenure is exactly the opportunity to behave\n\n48:59.840 --> 49:05.360\n like a child because you can make mistakes. And I was asked by the Harvard Gazette, you know,\n\n49:05.360 --> 49:13.920\n the Pravda of Harvard, what is the one thing that you would like to change about the world?\n\n49:14.800 --> 49:21.120\n And I said, I would like my colleagues to behave more like kids. That's the one thing I would like\n\n49:21.120 --> 49:27.520\n them to do. Because something bad happens to these kids when they become tenured professors.\n\n49:27.520 --> 49:33.440\n They start to worry about their ego and about themselves more than about the purpose of science,\n\n49:33.440 --> 49:38.960\n which is, you know, curiosity driven, figuring out from evidence. Evidence is the key. So when\n\n49:38.960 --> 49:44.800\n an object shows anomalies like Oumuamua, what's the problem discussing, you know, whether it's\n\n49:44.800 --> 49:48.720\n artificial or not? You know, so there was, I should tell you, there was a mainstream\n\n49:49.280 --> 49:56.240\n paper in Nature published saying it must be natural. That's it. It's unusual, but it must\n\n49:56.240 --> 50:04.880\n be natural, period. And then at the same time, some other mainstream scientists tried to explain\n\n50:04.880 --> 50:09.920\n the properties. And they came up with interpretations like it's a dust bunny,\n\n50:09.920 --> 50:14.720\n you know, the kind that you find in a household, a collection of dust particles pushed by sunlight,\n\n50:16.240 --> 50:21.760\n something we have never seen before. Or it's a hydrogen iceberg. It actually evaporates like\n\n50:21.760 --> 50:26.560\n a comet, but hydrogen is transparent. You don't see it. And that's why we don't see the cometary\n\n50:26.560 --> 50:31.040\n tail. Again, we have never seen something like that. In both cases, the objects would not\n\n50:31.760 --> 50:37.920\n survive the long journey. We discussed it in a paper that I wrote afterwards. But my point is,\n\n50:37.920 --> 50:44.720\n those that tried to explain the unusual properties went into great length at discussing things that\n\n50:44.720 --> 50:50.480\n we have never seen before. Okay? So even when you think about a natural origin, you have to come up\n\n50:50.480 --> 50:57.120\n with scenarios of things that were never seen before. And by the way, they look less plausible\n\n50:57.120 --> 51:02.080\n to me personally. But my point is, if we discuss things that were never seen before,\n\n51:03.520 --> 51:07.840\n why not discuss, why not contemplate an artificial origin? What's the problem?\n\n51:07.840 --> 51:16.160\n Why do people have this pushback? You know, I worked on dark matter, and we don't know what\n\n51:16.160 --> 51:22.160\n most of the matter in the universe is. It's called dark matter. It's just an acronym because we have\n\n51:22.160 --> 51:26.800\n no clue. We simply don't know. So it could be all kinds of particles. And over the years, people\n\n51:26.800 --> 51:32.560\n suggested weakly interacting massive particles, axions, all kinds of particles. And experiments\n\n51:32.560 --> 51:38.880\n were made. They cost hundreds of millions of dollars. They put upper limits, constraints\n\n51:38.880 --> 51:44.560\n that ruled out many of the possibilities that were proposed as natural initially. The mainstream\n\n51:44.560 --> 51:49.360\n community regarded it as a mainstream activity to search the nature of the dark matter.\n\n51:50.400 --> 51:55.360\n And nobody complained that it's speculative to consider weakly interacting massive particles.\n\n51:56.160 --> 52:04.320\n Now, I ask you, why is it speculative to consider extraterrestrial technologies? We have a proof\n\n52:04.320 --> 52:10.720\n that it exists here on Earth. We also know that the conditions of Earth are reproduced\n\n52:10.720 --> 52:16.480\n in billions of systems throughout the Milky Way galaxy. So what's more conservative than to say,\n\n52:16.480 --> 52:22.320\n if you arrange for similar conditions, you get the same outcome. How can you imagine this to be\n\n52:22.320 --> 52:26.800\n speculative? It's not speculative at all. And nevertheless, it's regarded the periphery. And\n\n52:26.800 --> 52:32.320\n at the same time, you have physicists, theoretical physicists, working on extra dimensions, super\n\n52:32.320 --> 52:39.520\n symmetry, super string theory, the multiverse. Maybe we live in a simulation. All of these ideas\n\n52:39.520 --> 52:47.280\n that have no grounding in reality, some of which sound to me like, you know, just like what someone\n\n52:47.280 --> 52:54.880\n would say. Science fiction, basically. Because you have no way to test it, you know, through\n\n52:54.880 --> 52:59.920\n experiments. And experiments really are key. It's not just the nuance. You say, okay, forget about\n\n52:59.920 --> 53:04.640\n experiments. As some philosophers try to say, you know, if there is a consensus, what's the problem?\n\n53:04.640 --> 53:10.320\n The point is, it's key. Then that's what Galileo found. It's key to have feedback from reality.\n\n53:10.320 --> 53:15.440\n You know, you can think that you have a billion dollars or that you are more rich than, you know,\n\n53:16.240 --> 53:22.400\n Elon Musk. That's fine. You can feel very happy about it. You can talk about it with your friends\n\n53:22.400 --> 53:26.320\n and all of you will be happy and think about what you can do with the money. Then you go to\n\n53:26.320 --> 53:31.040\n an ATM machine and you make an experiment. You check how much money you have in your checking\n\n53:31.040 --> 53:39.200\n account. And if it turns out that, you know, you don't have much, you can't materialize your dreams.\n\n53:39.200 --> 53:44.480\n Okay. So you realize, you have a reality check. And my point is, without experiments giving you\n\n53:44.480 --> 53:49.520\n a reality check, without the ATM machine showing you whether your ideas are bankrupt or not,\n\n53:49.520 --> 53:55.200\n without putting skin in the game. And by skin in the game, I mean, don't just talk about\n\n53:55.200 --> 54:01.440\n theoretical ideas. Make them testable. If you don't make them testable, they're worthless.\n\n54:01.440 --> 54:08.320\n They're just like theology that is not testable. By the way, theology has some tests. Let me give you\n\n54:09.760 --> 54:17.760\n three examples. It turns out that my book already inspired a PhD student at Harvard in the English\n\n54:17.760 --> 54:25.920\n department to pursue a PhD in that direction. And she invited me to the PhD exam a couple of months\n\n54:25.920 --> 54:34.800\n ago. And in the exam, one of the examiners, a professor, asked her, do you know why Giordano\n\n54:34.800 --> 54:42.080\n Bruno was burnt at the stake? And she said, no, I think it's because he was an obnoxious\n\n54:42.080 --> 54:49.200\n guy and irritated a lot of people, which is true. But the professor said, no,\n\n54:50.000 --> 54:55.120\n it's because Giordano Bruno said that other stars are just like the sun,\n\n54:56.720 --> 55:03.840\n and they could have a planet like the Earth around them that could host life. And that\n\n55:03.840 --> 55:09.600\n was offensive to the church. Why was it offensive? Because there is the possibility that this life\n\n55:09.600 --> 55:18.720\n sinned. And if that life sinned on planets around other stars, it should have been saved by Christ.\n\n55:18.720 --> 55:25.440\n And then you need multiple copies of Christ. And that's unacceptable. How can you have duplicates\n\n55:25.440 --> 55:34.320\n of Christ? And so they burned the guy. I'm just like loading this all in because that's kind of\n\n55:34.320 --> 55:39.600\n brilliant. So he was actually already, it's not just about the stars, it's anticipating that there\n\n55:39.600 --> 55:46.080\n could be other life forms. Like why, if this star, if there's other stars, why would it be special?\n\n55:46.080 --> 55:51.040\n Why would our star be special? He was making the right argument. And he would just follow that\n\n55:51.040 --> 55:56.240\n all along to say like, there should be other Earth like places, there should be other life forms.\n\n55:56.240 --> 56:02.000\n And then there needs to be copies of Christ. Yeah, so that was offensive. So I said to that\n\n56:02.000 --> 56:08.800\n professor, I said, great, I wanted to introduce some scientific tone to the discussion. And I said,\n\n56:08.800 --> 56:13.680\n this is great because now you basically laid the foundation for an experimental test of this\n\n56:13.680 --> 56:20.000\n theology. What is the test? We now know that other stars are like the sun and we know they have\n\n56:20.000 --> 56:26.400\n planets like the Earth around them. So suppose we find life there and we figure out that they sinned,\n\n56:26.400 --> 56:33.920\n then we ask them, did you witness Christ? And if they say no, it means that this theology\n\n56:33.920 --> 56:38.880\n is ruled out. So there is an experimental test. So this is experimental test number one.\n\n56:38.880 --> 56:46.400\n Another experimental test, in the Bible, in the Old Testament, Abraham\n\n56:46.400 --> 56:56.000\n was heard the voice, the voice of God to sacrifice his son, right? Only son. And that's what the\n\n56:56.000 --> 57:04.960\n story says. Now, suppose Abraham, my name, by the way, had a voice memo up on his cell phone. He\n\n57:04.960 --> 57:10.320\n could have pressed this up and recorded the voice of God. And that would have been experimental\n\n57:10.320 --> 57:18.000\n evidence that God exists, right? Fortunately, he didn't, but it's an experimental test, right?\n\n57:18.000 --> 57:24.400\n There is a third example I should tell, and that is Elie Wiesel attributed this story to Martin\n\n57:24.400 --> 57:30.160\n Buber, but it's not clear whether it's true or not. At any event, the story goes that Martin\n\n57:30.160 --> 57:36.240\n Buber, you know, he was a philosopher and he said, you know, the Christians, you know,\n\n57:36.240 --> 57:44.880\n the Messiah arrived already and will come back again in the future. The Jews argue the Messiah\n\n57:44.880 --> 57:54.400\n never came and will arrive in the future. So he said, why argue? Both sides agree that the Messiah\n\n57:54.400 --> 58:01.360\n will arrive in the future. When the Messiah arrives, we can ask whether he or she will arrive\n\n58:01.360 --> 58:09.520\n in the future. When the Messiah arrives, we can ask whether he or she came before, you know, like\n\n58:09.520 --> 58:16.080\n visited us and then figure it out. And one side. So again, experimental test of a theology. So even\n\n58:16.080 --> 58:22.800\n theology, if it puts a skin in the game, you know, if it makes a prediction, could be tested, right?\n\n58:22.800 --> 58:28.880\n So why can't string theories test themselves? Or why can't, you know, even cosmic inflation? That's\n\n58:28.880 --> 58:34.000\n a model that, you know, one of the inventors from MIT, Alan Guth, argues that it's not falsifiable.\n\n58:35.840 --> 58:41.920\n My point is a theory that cannot be falsified is not helpful because it means that you can't\n\n58:41.920 --> 58:46.800\n make progress. You cannot improve your understanding of nature. The only way for us to\n\n58:46.800 --> 58:53.360\n learn about nature is by making hypotheses that are testable, doing the experiments and learning\n\n58:53.360 --> 58:59.440\n whether we are correct or not. So B, and coupled that with a curiosity and open mindedness that\n\n58:59.440 --> 59:05.440\n allows us to explore all kinds of possible hypotheses, but always the pursuit of those,\n\n59:06.880 --> 59:15.120\n the scientific rigor around those hypotheses is ultimately get evidence. Knowledge of what nature\n\n59:15.120 --> 59:20.400\n is should be a dialogue with nature. Yes. Rather than a monologue. Monologue, beautifully put.\n\n59:20.400 --> 59:25.760\n Can we talk a little bit about the Drake equation? Another framework from which to have this kind of\n\n59:25.760 --> 59:31.680\n discussion about possible civilizations out there. So let me ask, within the context of the Drake\n\n59:31.680 --> 59:36.400\n equation or maybe bigger, how many alien civilizations do you think are out there?\n\n59:37.200 --> 59:42.640\n Well, it's hard to tell because the Drake equation is again quantifying our ignorance. It's just a set\n\n59:42.640 --> 59:50.240\n of factors. The only one that we know, or actually two that we know quite well is the rate of star\n\n59:50.240 --> 59:56.880\n formation in the Milky Way galaxy, which we measured by now, and the frequency of planets\n\n59:56.880 --> 1:00:03.040\n like the Earth around stars and at the right distance to have life. But other than that,\n\n1:00:03.040 --> 1:00:08.640\n there are lots of implicit assumptions about all the other factors that will enable us to detect\n\n1:00:08.640 --> 1:00:15.760\n the signal. Now, I should say the Drake equation has a very limited validity just for signals from\n\n1:00:15.760 --> 1:00:22.640\n civilizations that are transmitting at the time that you're observing them. However, we can do\n\n1:00:22.640 --> 1:00:29.360\n much better than that. We can look for artifacts that they left behind. Even if they are dead,\n\n1:00:29.360 --> 1:00:35.200\n you can look for industrial pollution in the atmosphere of planets. Why do I bring this up?\n\n1:00:35.200 --> 1:00:40.320\n Why do I bring this up? Again, to show you the conservatism of the mainstream in astronomy.\n\n1:00:40.320 --> 1:00:45.360\n And by the way, I have leadership positions. I was chair of the astronomy department for nine\n\n1:00:45.360 --> 1:00:51.440\n years, the longest serving chair at Harvard. And I'm the chair of the board on physics and astronomy\n\n1:00:51.440 --> 1:00:59.600\n of the National Academies. It's a primary board. And I'm director of two centers at Harvard and so\n\n1:00:59.600 --> 1:01:06.800\n forth. So I do represent the community in various ways. But at the same time, I'm a little bit\n\n1:01:06.800 --> 1:01:11.920\n disappointed by the conservatism that people have. And so let me give you an illustration of that.\n\n1:01:11.920 --> 1:01:18.240\n So the astronomy community actually is going right now through the process of defining its goals for\n\n1:01:18.240 --> 1:01:25.280\n the next decade. And there are proposals for telescopes that would cost billions of dollars\n\n1:01:25.280 --> 1:01:33.360\n and whose goal is to find evidence for oxygen in the atmosphere of planets around other stars,\n\n1:01:33.360 --> 1:01:40.320\n with the idea that this would be a marker, a signature of life. Now, the problem with that\n\n1:01:40.320 --> 1:01:46.960\n is Earth didn't have much oxygen in its atmosphere for the first two billion years. Roughly half of\n\n1:01:47.840 --> 1:01:53.760\n its life, it didn't have much oxygen. But it had life. It had microbial life. It's not\n\n1:01:53.760 --> 1:02:00.880\n it's not clear yet as of yet what the origin is for the rise in the oxygen level after two\n\n1:02:01.920 --> 1:02:10.320\n billion years, about 2.4 billion years ago. But we know that a planet can have life without oxygen\n\n1:02:10.320 --> 1:02:16.720\n in the atmosphere because Earth did it. The second problem with this approach is that you can have\n\n1:02:16.720 --> 1:02:23.440\n oxygen from natural processes. You can break water molecules and make oxygen. So even if you find it,\n\n1:02:23.440 --> 1:02:30.080\n it will never tell you that for sure life exists there. And so even with these billions of dollars,\n\n1:02:30.080 --> 1:02:37.280\n the mainstream community will never be confident whether there is life. Now, how can it be\n\n1:02:37.280 --> 1:02:42.400\n confident? There is actually a way. If instead of looking with the same instruments, if you look for\n\n1:02:42.400 --> 1:02:50.000\n molecules that indicate industrial pollution, for example, CFCs that are produced by refrigerating\n\n1:02:50.000 --> 1:02:55.520\n systems or industries here on Earth, that they do the ozone layer, you can search for that. And\n\n1:02:55.520 --> 1:03:01.680\n I wrote a paper five years ago suggesting that. Now, what's the problem? You can just tell NASA,\n\n1:03:01.680 --> 1:03:08.240\n I want to build this telescope to search for oxygen, but also for industrial pollution.\n\n1:03:08.240 --> 1:03:16.560\n Nobody would say that because it sounds like on the periphery of the field. And I ask you,\n\n1:03:16.560 --> 1:03:22.240\n why would? Hilarious. Because that's exactly, I mean, that would be saying is quite brilliant. I\n\n1:03:22.240 --> 1:03:29.040\n mean, because it's a really strong signal. And if life, if there's alien civilizations out there,\n\n1:03:29.760 --> 1:03:34.480\n then they're probably going to be many of them. And they're probably going to be more advanced\n\n1:03:34.480 --> 1:03:37.840\n than us. And they're probably going to have something like industrial pollution, which would\n\n1:03:37.840 --> 1:03:44.160\n be a much stronger signal than some basic gas, which could have a lot of different explanations.\n\n1:03:44.160 --> 1:03:52.160\n So like something like oxygen or, I mean, we could talk about signs of life on Venus and so on.\n\n1:03:52.720 --> 1:03:57.760\n But if you want a strong signal, it would be pollution. I love how garbage is.\n\n1:03:58.400 --> 1:04:02.560\n No, but the pollution, you have to understand, we think of pollution as a problem,\n\n1:04:02.560 --> 1:04:09.600\n but on a planet that was too cold, for example, to have a comfortable life on it, you can imagine\n\n1:04:09.600 --> 1:04:16.800\n terraforming it and putting a blanket of polluting gases such that it will be warmer. And that would\n\n1:04:16.800 --> 1:04:25.200\n be a positive change. So if an industrial or a technological civilization wants to terraform a\n\n1:04:25.200 --> 1:04:31.200\n planet that otherwise is too cold for them, they will do it. So what's the problem of defining it\n\n1:04:31.200 --> 1:04:39.840\n as a search goal using the same technologies? The problem is that there is a taboo. We're not\n\n1:04:39.840 --> 1:04:45.280\n supposed to discuss extraterrestrial intelligence. There is no funding for this subject, not much,\n\n1:04:45.280 --> 1:04:51.760\n very little. And young people, because of the bullying on Twitter, you know, all the social\n\n1:04:51.760 --> 1:04:58.160\n media and elsewhere, young people with talent that are curious about these questions do not enter\n\n1:04:58.160 --> 1:05:05.840\n this field of study. And obviously, if you step on the grass, it will never grow, right? So if you\n\n1:05:05.840 --> 1:05:10.480\n don't give funding, obviously, you know, the mainstream community says, look, nothing was\n\n1:05:10.480 --> 1:05:15.760\n discovered so far. Obviously, nothing would be discovered. If talented people go to other\n\n1:05:15.760 --> 1:05:21.040\n districts, you never search for it well enough, you will never find anything. I mean, look at\n\n1:05:21.040 --> 1:05:26.000\n gravitational wave astrophysics. It's a completely new window into the universe, pioneered by Ray\n\n1:05:26.000 --> 1:05:34.400\n Weiss at MIT. And at first, it was ridiculed. And thanks to some administrators at the National\n\n1:05:34.400 --> 1:05:39.760\n Science Foundation, it received funding, despite the fact that the mainstream of the astronomy\n\n1:05:39.760 --> 1:05:47.280\n community was very resistant to it. And now it's considered a frontier. So all these people that\n\n1:05:47.280 --> 1:05:51.920\n I remember as a young postdoc, these people that bashed this field and said bad things about\n\n1:05:51.920 --> 1:05:57.840\n people, you know, said nothing will come out of it. Now they say, oh, yeah, of course, you know,\n\n1:05:57.840 --> 1:06:06.320\n the Nobel Prize was given to the LIGO collaboration. Of course, now they are supportive\n\n1:06:06.320 --> 1:06:14.720\n of it. But my point is, if you suppress innovation early on, there are lots of missed opportunities.\n\n1:06:15.920 --> 1:06:21.680\n The discovery of exoplanets is one example. You know, in 1952, there was an astronomer called\n\n1:06:21.680 --> 1:06:31.440\n the name Otto Struve. And he wrote a paper saying, why don't we search for Jupiter like planets\n\n1:06:31.440 --> 1:06:36.960\n close to their host star? Because if they're close enough, they would move the star back and forth,\n\n1:06:36.960 --> 1:06:44.480\n and we can detect the signal. And so astronomers on time allocation committees of telescopes\n\n1:06:44.480 --> 1:06:53.440\n for 40 years argued, this is not possible because we know why Jupiter resides so far from the Sun.\n\n1:06:53.440 --> 1:06:59.120\n You cannot have Jupiter so close because there is this region where ice forms far from the Sun.\n\n1:06:59.120 --> 1:07:03.600\n And beyond that region is where Jupiter like planets can form. There was a theory behind\n\n1:07:03.600 --> 1:07:09.680\n it which ended up being wrong by today's standards. But anyway, they did not give time\n\n1:07:09.680 --> 1:07:14.800\n on telescopes to search for such systems until the first system was discovered\n\n1:07:14.800 --> 1:07:19.360\n four decades after Otto Struve's paper. And the Nobel Prize was awarded to that\n\n1:07:20.080 --> 1:07:26.080\n just a couple of years ago. And then you ask yourself, okay, so science still made progress.\n\n1:07:26.080 --> 1:07:33.360\n What's the problem? The problem is that this baby came out barely, and there was a delay of\n\n1:07:33.360 --> 1:07:39.120\n four decades. So the progress was delayed. And I wonder how many babies were not born because of\n\n1:07:39.120 --> 1:07:44.080\n this resistance. So there must be ideas that are as good as this one that were suppressed because\n\n1:07:44.080 --> 1:07:51.920\n they were bullied, because people ridiculed them, that were actually good ideas. And these are missed\n\n1:07:51.920 --> 1:07:58.560\n opportunities, babies that were never born. And I'm willing to push this frontier of the search\n\n1:07:58.560 --> 1:08:04.000\n for technologies or technological signatures of other civilizations. Because when I was young,\n\n1:08:04.000 --> 1:08:10.960\n I was in the military in Israel. It's obligatory to serve. And there was this saying that one of\n\n1:08:10.960 --> 1:08:17.920\n the soldiers sometimes has to put his body on the barbed wire so that others can go through.\n\n1:08:18.560 --> 1:08:25.920\n And I'm willing to suffer the pain so that younger people in the future will be able to speak freely\n\n1:08:25.920 --> 1:08:30.960\n about the possibility that some of the anomalies we find in the sky are due to technological\n\n1:08:30.960 --> 1:08:35.840\n signatures. And it's quite obvious. This is why I like the folks in artificial intelligence space,\n\n1:08:35.840 --> 1:08:41.840\n Elon Musk and a few others speak about this. And they look at the long arc. They say like,\n\n1:08:41.840 --> 1:08:46.320\n what, you know, this kind of, you know, you can call it like first principles thinking,\n\n1:08:46.320 --> 1:08:53.360\n or you can call it anything really is like, if we just zoom out from our current bickering and our\n\n1:08:53.360 --> 1:08:59.280\n current, like discussions in the what science is doing, look at the long arc of the trajectory\n\n1:08:59.280 --> 1:09:07.680\n we're headed at. Which questions are obviously fundamental to science? And it should be asked,\n\n1:09:07.680 --> 1:09:12.080\n and which is the space of hypothesis we should be exploring? And like exoplanets is a really\n\n1:09:12.080 --> 1:09:18.320\n good example of one that was like an obvious one. I recently talked to Sarah Seager, and it was very\n\n1:09:18.320 --> 1:09:24.640\n taboo when she was starting out to work on an exoplanet. And that was even in the 90s. And like\n\n1:09:24.640 --> 1:09:30.480\n it's obvious should not be a taboo subject. And to me, I mean, I'm probably ignorant, but to me,\n\n1:09:30.480 --> 1:09:36.480\n exoplanets seems like it's ridiculous that that would ever be a taboo subject to not fund,\n\n1:09:36.480 --> 1:09:46.320\n to not explore. That's very, but even for her, it's now taboo to say, like what, you know, to look for\n\n1:09:46.320 --> 1:09:51.280\n industrial pollution, right? Right. And I find that ridiculous. I'll tell you why. She can't take\n\n1:09:51.280 --> 1:09:56.800\n the next step. It's ridiculous for another reason. Not because of just the scientific benefits that\n\n1:09:56.800 --> 1:10:03.280\n we might have by exploring it, but because the public cares about these questions. And the public\n\n1:10:03.280 --> 1:10:09.360\n funds science. So how dare the scientists shy away from addressing these questions,\n\n1:10:09.360 --> 1:10:14.880\n if they have the technology to do it. It's like saying, I don't want to look through\n\n1:10:14.880 --> 1:10:19.600\n Galileo's telescope. It's exactly the same. You have the technology to explore this question,\n\n1:10:19.600 --> 1:10:25.280\n to find the evidence and you shy away from it. You might ask, why do people shy away from it?\n\n1:10:25.840 --> 1:10:30.720\n And perhaps it's because of the fact that there is science fiction. I'm not a fan of science fiction,\n\n1:10:30.720 --> 1:10:36.320\n because it has an element to it that violates the laws of physics in many of the books and the\n\n1:10:36.320 --> 1:10:43.200\n films. And I cannot enjoy these things when I see the laws of physics violated. But who cares that\n\n1:10:43.200 --> 1:10:47.760\n the, you know, the fact that there is science fiction. I mean, if you have the scientific\n\n1:10:47.760 --> 1:10:53.760\n methodology to address the same subject, I don't care that other people, you know, spoke nonsense\n\n1:10:53.760 --> 1:10:59.200\n about this subject or said things that make no sense. Who cares? You do your scientific work,\n\n1:10:59.200 --> 1:11:05.120\n just like you explore the dark matter. You explore the possibility that umuamua is an\n\n1:11:05.120 --> 1:11:13.920\n artifact. You just look for evidence and try to deduce what it means. And I have no problem with\n\n1:11:13.920 --> 1:11:18.000\n doing that. To me, it sounds like any other scientific question that we have. And given\n\n1:11:18.000 --> 1:11:24.000\n the public's interest, we have an obligation to do that. By the way, science to me is not\n\n1:11:24.000 --> 1:11:29.200\n an occupation of the elite. It doesn't allow me to feel superior to other humans that are unable to\n\n1:11:29.200 --> 1:11:35.120\n understand the math. To me, it's a way of life. You know, if there is a problem in the faucet or\n\n1:11:35.120 --> 1:11:41.520\n in the pipe at home, I try to figure out what the problem is. And with a plumber, we figure it out\n\n1:11:41.520 --> 1:11:47.040\n and we look at the clues. And the same thing in science. You look at the evidence, you try to\n\n1:11:47.040 --> 1:11:54.720\n figure out what it means. It's common sense in a way. And it shouldn't be regarded as something\n\n1:11:54.720 --> 1:11:59.920\n removed from the public. It should be a reflection of the public's interest. And I think it's\n\n1:11:59.920 --> 1:12:05.600\n actually a crime to resist the public. If the public says, I care about this, and you say,\n\n1:12:05.600 --> 1:12:09.920\n no, no, no, that's not sophisticated enough for me. I want to do intellectual gymnastics on\n\n1:12:09.920 --> 1:12:17.040\n anti the sitter space. To me, that's a crime. Yes, I 100% agree. So it's hilarious that the very,\n\n1:12:18.400 --> 1:12:26.160\n not hilarious, it's sad, that people who are trained in the scientific community to have the\n\n1:12:26.160 --> 1:12:30.960\n tools to explore this world, to be children, to be the most effective at being children,\n\n1:12:31.680 --> 1:12:37.600\n are the ones that resist being children the most. But there is a large number of people\n\n1:12:37.600 --> 1:12:44.880\n that embrace the childlike wonder about the world and may not necessarily have the tools to do it.\n\n1:12:44.880 --> 1:12:51.680\n That's the more general public. And so, I wonder if I could ask you and talk to you a little bit\n\n1:12:51.680 --> 1:13:00.960\n about UFO sightings. That there's people, quote unquote believers, there's hundreds of thousands\n\n1:13:00.960 --> 1:13:12.320\n of UFO sightings. And I've consumed some of the things that people have said about it. And one\n\n1:13:12.320 --> 1:13:21.680\n thing I really like about it is how excited they are by the possibility. It's almost like this\n\n1:13:21.680 --> 1:13:28.480\n childlike wonder about the world out there. It's not a fear, it's an excitement. Do you think,\n\n1:13:28.480 --> 1:13:35.680\n because we're talking about this possibly extraterrestrial object that visited, that flew\n\n1:13:35.680 --> 1:13:41.760\n by Earth, do you think it's possible that out of those hundreds of thousands of UFO sightings,\n\n1:13:43.360 --> 1:13:52.560\n one is an actual, one or some number is an actual sighting of a nonhuman, some alien technology.\n\n1:13:52.560 --> 1:14:03.200\n And that we're not, we did not, we're too close minded to look and to see.\n\n1:14:04.080 --> 1:14:11.440\n I think to answer this question, we need better evidence. My starting point, as I said,\n\n1:14:11.440 --> 1:14:17.920\n out of modesty is that we are not particularly interesting. And therefore I would be hard pressed\n\n1:14:17.920 --> 1:14:25.040\n to imagine that someone wants to really spy on us. So I would think, as a starting point,\n\n1:14:25.040 --> 1:14:30.480\n that we don't deserve attention and we shouldn't expect someone, but who knows.\n\n1:14:30.480 --> 1:14:37.280\n Now, the problem that I have with UFO sighting reports is that 50 years ago, there were some\n\n1:14:37.280 --> 1:14:45.440\n reports of fuzzy images, saucer like things. By now, our technologies are much better. Our cameras\n\n1:14:45.440 --> 1:14:52.240\n are much more sensitive. These fuzzy images should have turned into crisp, clear images\n\n1:14:52.880 --> 1:14:58.720\n of things that we are confident about. And they haven't turned that way. It's always on the border\n\n1:14:58.720 --> 1:15:04.000\n line of believability. And because of that, I believe that it might be most likely artifacts\n\n1:15:04.000 --> 1:15:09.600\n of our instruments or some natural phenomena that we are unable to understand. Now, of course,\n\n1:15:09.600 --> 1:15:16.080\n the reason you must examine those, if, for example, pilots report about them or\n\n1:15:17.040 --> 1:15:23.120\n the military finds evidence for them, is because it may pose a national security threat. If another\n\n1:15:23.120 --> 1:15:28.320\n country has technologies that we don't know about and they're spying on us, we need to know about\n\n1:15:28.320 --> 1:15:33.600\n it. And therefore we should examine everything that looks unusual. But to associate it with an\n\n1:15:33.600 --> 1:15:43.200\n alien life is a little too far for me until we have evidence that stands up to the level of\n\n1:15:43.200 --> 1:15:53.120\n scientific credence, that we are 100% sure that from multiple detectors and through a scientific\n\n1:15:53.120 --> 1:15:58.720\n process. Now, again, if the scientific community shies away from these reports, we will never have\n\n1:15:58.720 --> 1:16:04.320\n that. It's like saying, I don't want to take photographs of something because I know what it is,\n\n1:16:04.960 --> 1:16:10.560\n then you will never know what it is. But I think if some scientist, if grants, let's put it this\n\n1:16:10.560 --> 1:16:17.840\n way, if funding will be given to scientists to follow on some of these reports and use scientific\n\n1:16:17.840 --> 1:16:24.160\n instruments that are capable of detecting those sightings with much better resolution, with much\n\n1:16:24.160 --> 1:16:28.960\n better information, that would be great because it will clarify the matter. These are not,\n\n1:16:29.520 --> 1:16:35.520\n as you said, hundreds of thousands, these are not once in a lifetime events. So it's possible to\n\n1:16:35.520 --> 1:16:42.480\n take scientific instrumentation and explore, go to the ocean where someone reported that there are\n\n1:16:42.480 --> 1:16:50.720\n frequent events that are unusual and check it out, do a scientific experiment. Why only do experiments\n\n1:16:50.720 --> 1:16:57.440\n deep into the ocean and look at the oceanography or do other things. We can do scientific\n\n1:16:57.440 --> 1:17:04.480\n investigation of these sightings and figure out what they mean. I'm very much in favor of that,\n\n1:17:04.480 --> 1:17:08.720\n but until we have the evidence, I would be doubtful as to what they actually mean.\n\n1:17:09.280 --> 1:17:14.880\n Yeah, we'll have to be humble and acknowledge that we're not that interesting. It's kind of,\n\n1:17:14.880 --> 1:17:19.040\n you're making me realize that because it's so taboo, that the people that have the equipment,\n\n1:17:19.040 --> 1:17:25.280\n uh, meaning, and we're not just talking, everybody has cameras now, but to have a large scale,\n\n1:17:25.280 --> 1:17:32.160\n like a sensor network that collects data that regularly collects, just like we look at the\n\n1:17:32.160 --> 1:17:36.560\n weather, we're collecting information and then we can then access that information when there is\n\n1:17:36.560 --> 1:17:42.080\n reports and like have it not be a taboo thing where there's like millions or billions of dollars\n\n1:17:42.080 --> 1:17:49.520\n or billions of dollars funding this effort that by the way, inspires millions of people.\n\n1:17:49.520 --> 1:17:55.200\n This is exactly what you're talking about. It's like the scientific community is afraid of a\n\n1:17:55.200 --> 1:18:00.640\n topic that inspires millions of people. It's absurd. But if you put blinders on your eyes,\n\n1:18:01.200 --> 1:18:08.080\n you don't see it. Right. I should say that we do have meteors that we see. These are rocks\n\n1:18:08.080 --> 1:18:14.240\n that by chance happen to collide with the earth and they, if they're small, they burn up in the\n\n1:18:14.240 --> 1:18:21.760\n atmosphere. But if they're big enough, tens of meters or more, hundreds of meters, the outer\n\n1:18:21.760 --> 1:18:29.040\n layer burns up, but then the core of the object makes it through. And this is our chance of putting\n\n1:18:29.040 --> 1:18:37.440\n our hands around an object if this meteor came from interstellar space. So one path of discovery\n\n1:18:37.440 --> 1:18:43.520\n is to search for interstellar meteors. And with a student of mine, we actually looked through the\n\n1:18:43.520 --> 1:18:50.000\n record and we thought that we found one example of a meteor that was reported that might have come\n\n1:18:50.000 --> 1:18:57.040\n from interstellar space. And then another approach is, for example, to look at the moon. The moon is\n\n1:18:57.040 --> 1:19:02.080\n different from the earth in the sense that it doesn't have an atmosphere. So objects do not\n\n1:19:02.080 --> 1:19:07.600\n burn up on their way to it. It's sort of like a museum. It collects everything. Of rocks from out\n\n1:19:07.600 --> 1:19:12.560\n there in deep space. Yeah. And there is no geological activity on the moon. So on earth,\n\n1:19:12.560 --> 1:19:17.520\n every hundred million years, you know, we could have had computer terminals on earth that could\n\n1:19:17.520 --> 1:19:23.200\n have been a civilization like ours with electronic equipment. Yes. More than a hundred million years\n\n1:19:23.200 --> 1:19:29.200\n ago. And it's completely lost. You cannot excavate and find it, evidence for it, because in\n\n1:19:29.200 --> 1:19:35.120\n archaeological digs, because the earth is being mixed on these timescales. And everything that\n\n1:19:35.120 --> 1:19:39.760\n was on the surface more than a hundred million years ago is buried deep inside the earth right\n\n1:19:39.760 --> 1:19:44.400\n now because of geological activity. Fascinating to think about, by the way. Yeah. But on the moon,\n\n1:19:44.400 --> 1:19:49.600\n this doesn't happen. The only thing that happens on the moon is you have objects impacting the moon\n\n1:19:49.600 --> 1:19:55.280\n and they go 10 meters deep. So they produce some dust, but the moon keeps everything. It's like a\n\n1:19:55.280 --> 1:20:01.440\n museum. It keeps everything on the surface. So if we go to the moon, I would highly recommend\n\n1:20:01.440 --> 1:20:07.920\n regarding it as an archaeological site. Yes. And looking for objects that are strange. Maybe it\n\n1:20:07.920 --> 1:20:13.280\n collected some trash, you know, from interstellar space. If we could just linger on the Drake\n\n1:20:13.280 --> 1:20:18.720\n equation for a little bit. We kind of talked about there's a lot of uncertainty in the parameters\n\n1:20:18.720 --> 1:20:26.320\n and the Drake equation itself is very limited. But I think the parameters are interesting in\n\n1:20:26.320 --> 1:20:31.120\n themselves, even if it's limited, because I think each one is within the reach of science,\n\n1:20:31.120 --> 1:20:36.400\n right? Did you get the evidence for it? I mean, a few I find really interesting,\n\n1:20:36.400 --> 1:20:43.440\n could be interesting to get your comment on. So the one with the most variance, I would say,\n\n1:20:43.440 --> 1:20:48.800\n from my perspective, is the length that civilizations last. However you define it. In the Drake\n\n1:20:48.800 --> 1:20:52.960\n equation, it's the length of how long you're communicating. Yeah, transmitting.\n\n1:20:52.960 --> 1:20:59.120\n Transmitting. Just like you said, that's a wrong way to think about it, because we can be detecting\n\n1:20:59.120 --> 1:21:04.240\n some other outputs of the civilizations, etc. But if we just define broadly how long those\n\n1:21:04.240 --> 1:21:12.160\n civilizations last, do you have a sense of how long they might last? Like what are the great\n\n1:21:12.160 --> 1:21:19.360\n filters that might destroy civilizations that we should be thinking about? And how can\n\n1:21:19.360 --> 1:21:25.120\n science give us more hints on this topic? So I, as I mentioned before, operate by the\n\n1:21:25.120 --> 1:21:30.400\n Copernican principle, meaning that we are not special. We don't live in a special place\n\n1:21:31.200 --> 1:21:38.480\n and not in a special time. And by the way, it's just modesty encapsulated in scientific terms,\n\n1:21:38.480 --> 1:21:43.040\n right? You're saying, I'm not special, you know, I find conditions here, they exist\n\n1:21:43.040 --> 1:21:50.720\n everywhere. So if you adopt the Copernican principle, you basically say, our civilization\n\n1:21:50.720 --> 1:21:57.920\n transmitted radio signals for a hundred years, roughly, so probably it would last another\n\n1:21:57.920 --> 1:22:02.160\n hundred or a few hundred and that's it. Because we don't live at a special time.\n\n1:22:02.160 --> 1:22:10.480\n So that's, you know, well, of course, if we get our act together and we somehow start\n\n1:22:10.480 --> 1:22:15.760\n to cooperate rather than fighting each other, killing each other, you know, wasting a lot\n\n1:22:15.760 --> 1:22:23.520\n of resources on things that would destroy our planet, maybe we can lengthen that period\n\n1:22:23.520 --> 1:22:31.040\n if we get smarter. But the most natural assumption is to say that we will live into the future as\n\n1:22:31.040 --> 1:22:35.840\n much as we lived from the time that we start to develop the means for our own destruction,\n\n1:22:35.840 --> 1:22:40.960\n the technologies we have, which is quite pessimistic, I must say. So several centuries,\n\n1:22:40.960 --> 1:22:45.680\n that's what I would give, unless we get our act, unless we become more intelligent\n\n1:22:45.680 --> 1:22:51.920\n than the newspapers report every day. Okay. Point number one. Second, and by the way,\n\n1:22:51.920 --> 1:22:58.480\n this is relevant, I should say, because there was a report about perhaps a radio signal detected\n\n1:22:58.480 --> 1:23:03.520\n from Proxima Centauri. What do you make of that signal? Oh, I think it's some Australian guy with\n\n1:23:03.520 --> 1:23:09.200\n a cell phone next to the observatory or something like that, because it was the Parkes Telescope in\n\n1:23:09.200 --> 1:23:17.120\n Australia. Okay. So it's human created noise. Yeah. Which is always the worry because actually\n\n1:23:17.120 --> 1:23:22.480\n the same observatory, the Parkes Observatory, detected a couple of years ago some signal\n\n1:23:22.480 --> 1:23:29.600\n and then they realized that it comes back at lunchtime. Yes. And they said, okay, what could\n\n1:23:29.600 --> 1:23:34.000\n it be? And then they figured out that it must be the microwave oven in the observatory because\n\n1:23:34.000 --> 1:23:40.000\n someone was opening it before it finished and it was creating this radio signal that they detected\n\n1:23:40.000 --> 1:23:47.680\n with a telescope every lunchtime. So just a cautionary remark. But the reason I think it's\n\n1:23:47.680 --> 1:23:54.000\n human made, without getting to the technical details, is because of this very short window\n\n1:23:54.000 --> 1:23:58.480\n by which we were transmitting radio signals out of the lifetime of the Earth. As I said,\n\n1:23:58.480 --> 1:24:04.320\n 100 years out of four and a half billion years that the Earth existed. So what's the chance\n\n1:24:04.320 --> 1:24:10.080\n that another civilization, a twin civilization of ours, is transmitting radio signals exactly\n\n1:24:10.080 --> 1:24:19.120\n at the time that we are looking with our radio telescopes? 10 to the minus 7. And the other\n\n1:24:19.120 --> 1:24:26.560\n argument I have is that they detected it in a very narrow band of frequencies and that makes it\n\n1:24:28.080 --> 1:24:34.880\n cannot be through natural processes, very narrow band, just like some radio transmissions that we\n\n1:24:34.880 --> 1:24:42.880\n produce. But if it were to come from the habitable zone, from a transmitter on the surface of Proxima\n\n1:24:42.880 --> 1:24:48.720\n b, this is the planet that orbits Proxima Centauri, then I calculated that the frequency\n\n1:24:48.720 --> 1:24:56.560\n would drift through the Doppler effect. Just like when you hear a siren on the street, when the car\n\n1:24:56.560 --> 1:25:02.000\n approaches you, it has a different pitch than when it recedes away from you, that's the Doppler\n\n1:25:02.000 --> 1:25:10.160\n effect. And when the planet orbits the star, Proxima Centauri, you would see or detect a\n\n1:25:10.160 --> 1:25:14.720\n different frequency when the planet approaches us as compared to when it recedes. So there should\n\n1:25:14.720 --> 1:25:22.800\n be a frequency drift just because of the motion of the planet. And I calculated that it must be\n\n1:25:22.800 --> 1:25:29.840\n much bigger than observed. So it cannot just be a transmitter sitting on the planet and sending in\n\n1:25:29.840 --> 1:25:36.560\n our direction a radio signal unless they want to cancel the Doppler effect. But then they need to\n\n1:25:36.560 --> 1:25:40.720\n know about us because in a different direction, it will not be cancelled. Only in our direction,\n\n1:25:40.720 --> 1:25:48.480\n they can cancel it perfectly. So there is this direction of Proxima Centauri, but I have a\n\n1:25:48.480 --> 1:25:53.840\n problem imagining a transmitter on the surface of a planet in the habitable zone emitting it.\n\n1:25:53.840 --> 1:26:00.880\n But my main issue is really with the likelihood, given what we know about ourselves.\n\n1:26:01.600 --> 1:26:03.760\n Right. In terms of the duration of the civilization.\n\n1:26:03.760 --> 1:26:05.120\n The Copernican principle. Yeah.\n\n1:26:06.880 --> 1:26:11.600\n So nevertheless, this particular signal is likely to be a human interference, perhaps. But\n\n1:26:12.400 --> 1:26:19.840\n do you find Proxima be interesting? Or the more general question is, do you think we humans\n\n1:26:19.840 --> 1:26:30.240\n will venture out into outside our solar system and potentially colonize other habitable planets?\n\n1:26:30.240 --> 1:26:35.600\n Actually, I am involved in a project whose goal is to develop the technology that would allow us\n\n1:26:35.600 --> 1:26:43.440\n to leave the solar system and visit the nearest stars. And that is called the Star Shot. In 2015,\n\n1:26:43.440 --> 1:26:50.560\n May 2015, an entrepreneur from Silicon Valley, Yuri Milner, came to my office at Harvard and said,\n\n1:26:51.680 --> 1:26:58.560\n would you be interested in leading a project that would do that in our lifetime? Because as we\n\n1:26:58.560 --> 1:27:05.040\n discussed before, to traverse those distances with existing rockets would take tens of thousands of\n\n1:27:05.040 --> 1:27:13.840\n years. And that's too long. For example, to get to Proxima Centauri with the kind of\n\n1:27:13.840 --> 1:27:22.480\n spacecrafts that we already sent, like New Horizons or Voyager 1, Voyager 2, you needed to\n\n1:27:22.480 --> 1:27:29.840\n send them when the first humans left Africa, so that they would arrive there now. And that's a\n\n1:27:29.840 --> 1:27:36.720\n long time to wait. So Yuri wanted to do it within a lifetime, 10, 20 years, meaning it has to move\n\n1:27:36.720 --> 1:27:42.000\n at a fraction of the speed of light. So can we send a spacecraft that would be moving at the\n\n1:27:42.000 --> 1:27:47.440\n fraction of the speed of light? And I said, let me look into that for six months. And with my\n\n1:27:47.440 --> 1:27:52.880\n students and postdocs, we arrived to the conclusion that the only technology that can do that is the\n\n1:27:52.880 --> 1:28:01.760\n light sail technology, where you basically produce a very powerful laser beam on Earth. So you can\n\n1:28:01.760 --> 1:28:13.120\n collect sunlight with photovoltaic cells or whatever and then convert it into stored energy\n\n1:28:13.120 --> 1:28:22.720\n and then produce a very powerful laser beam that is 100 gigawatts and focus it on a sail in space\n\n1:28:22.720 --> 1:28:30.880\n that is roughly the size of a person, a couple of meters or a few meters, that weighs only a gram\n\n1:28:30.880 --> 1:28:39.120\n or a few grams, very thin. And through the math, you can show that you can propel such a sail,\n\n1:28:39.120 --> 1:28:43.600\n if you shine on it for a few minutes, it will traverse the distance that is five times the\n\n1:28:43.600 --> 1:28:49.600\n distance to the moon, and it will get to a fifth of the speed of light. Sounds crazy. But I've\n\n1:28:49.600 --> 1:28:53.280\n talked to a bunch of people and they're like, I know it sounds crazy, but it's actually,\n\n1:28:54.480 --> 1:28:59.840\n it will work. This is one of those, it's beautiful. I mean, this is science.\n\n1:28:59.840 --> 1:29:08.960\n And the point is, people didn't get excited about space since the Apollo era. And it's about time,\n\n1:29:08.960 --> 1:29:15.280\n you know, for us to go into space. A couple of months ago, I was asked to participate in a debate\n\n1:29:15.280 --> 1:29:21.360\n organized by IBM and Bloomberg News. And the discussion centered on the question,\n\n1:29:22.160 --> 1:29:28.080\n is the space race between the US and China good for humanity? Oh, interesting. And all the other\n\n1:29:28.080 --> 1:29:35.360\n debaters were worried about the military threats. And I just couldn't understand what they're\n\n1:29:35.360 --> 1:29:41.760\n talking about, because military threats come from hovering above the surface of the Earth, right?\n\n1:29:41.760 --> 1:29:47.200\n And we live on a two dimensional surface, we live on the surface of the Earth. But space is\n\n1:29:47.200 --> 1:29:52.880\n all about the third dimension, getting far from Earth. So if you go to Mars, or you go to a star,\n\n1:29:52.880 --> 1:29:58.000\n another star, there is no military threat. What are we talking about? Space is all about,\n\n1:29:58.960 --> 1:30:04.560\n you know, feeling that, you know, we are one civilization, in fact, not fighting each other,\n\n1:30:04.560 --> 1:30:10.160\n just going far, and having aspirations for something that goes beyond military threats.\n\n1:30:10.160 --> 1:30:14.480\n So why would we be worried that the space race will lead?\n\n1:30:14.480 --> 1:30:18.960\n That's actually brilliant. I didn't, you know, there's something in our discourse about it,\n\n1:30:18.960 --> 1:30:23.680\n the space race is sometimes made synonymous with like the Cold War or something like that.\n\n1:30:23.680 --> 1:30:24.080\n Right.\n\n1:30:24.080 --> 1:30:28.880\n Or with wars. But really, yeah, there was a lot of ego tied up in that. I remember,\n\n1:30:28.880 --> 1:30:32.320\n I mean, it's still to this day, there's a lot of pride that Russians,\n\n1:30:32.880 --> 1:30:36.880\n Soviet Union was the first to space. And there's a lot of pride in the American side that was the\n\n1:30:36.880 --> 1:30:42.160\n first on the moon. But yeah, you're exactly right. Like, there's no aggression, there's no wars.\n\n1:30:42.160 --> 1:30:47.360\n And beyond that, if you think about the global economy, right now, there is a commercial\n\n1:30:47.360 --> 1:30:52.640\n interest. That's why Jeff Bezos and Elon Musk are interested about, you know, Mars and so on.\n\n1:30:52.640 --> 1:30:56.400\n There is a commercial interest, which is international. It's driven by money,\n\n1:30:57.040 --> 1:31:04.320\n not by pride. And, you know, nations can sign treaties. First of all, there are lots of treaties\n\n1:31:04.320 --> 1:31:08.560\n that were signed even before the First World War and the Second World War and the World War took\n\n1:31:08.560 --> 1:31:14.720\n place. So who cares, you know, like humans, treaties do not safeguard anything, you know.\n\n1:31:15.360 --> 1:31:21.440\n But beyond that, even if nations sign treaties about space exploration, you might still find\n\n1:31:21.440 --> 1:31:27.760\n commercial entities that will find a way to get their launches. And, you know, so I think we\n\n1:31:27.760 --> 1:31:33.360\n should rethink space. It has nothing to do with national pride. Once again, nothing to do with\n\n1:31:33.360 --> 1:31:42.720\n our egos. It's about exploration. And the biggest problem, I think, in human history is that humans\n\n1:31:42.720 --> 1:31:52.720\n tend to think about egos and about their own personal image rather than, look at the big\n\n1:31:53.280 --> 1:31:58.800\n picture, you know. We will not be around for long. We are just occupying a small space right now.\n\n1:31:58.800 --> 1:32:05.440\n Now, let's move out of this, you know, the way that Oscar Wilde said, I think is the best. He said,\n\n1:32:06.160 --> 1:32:10.800\n all of us are in the gutters, but some of us are looking at the stars.\n\n1:32:11.760 --> 1:32:18.480\n Yeah, and the more of us are looking at the stars, the likelier we are to, for this thing,\n\n1:32:18.480 --> 1:32:25.280\n this little experiment we have going on to last a while as opposed to end too quickly. I mean,\n\n1:32:25.280 --> 1:32:29.920\n it's not just about science of being humble. It's about the survival of the human species\n\n1:32:29.920 --> 1:32:35.520\n as being humble. To me, it's incredibly inspiring, the Starshot project of,\n\n1:32:36.720 --> 1:32:41.840\n I mean, there's something magical about being able to go to another habitable planet and take\n\n1:32:41.840 --> 1:32:49.680\n a picture even. I mean, within our lifetime, I mean, that, with crazy technology too, which is...\n\n1:32:49.680 --> 1:32:56.000\n I should tell you how it was conceived. So, I was at the time, so after six months passed,\n\n1:32:56.560 --> 1:33:02.880\n after the visit of Yuri Miller, I was, usually I go in December during the winter break,\n\n1:33:02.880 --> 1:33:11.280\n I go to Israel. I used to go to see my family and I get a phone call just before the weekend\n\n1:33:11.280 --> 1:33:19.440\n started. I get a phone call, Yuri would like you to present your concept in two weeks at his home.\n\n1:33:19.440 --> 1:33:25.280\n And I said, well, thank you for letting me know because I'm actually out of the door of the hotel\n\n1:33:25.280 --> 1:33:31.840\n to go to a goat farm in the Negev, in the southern part of Israel, because my wife wanted to have\n\n1:33:34.640 --> 1:33:37.920\n to go to a place that is removed from civilization, so to speak.\n\n1:33:39.040 --> 1:33:47.120\n So, we went to that goat farm and I need to make the presentation and there was no internet\n\n1:33:47.120 --> 1:33:53.520\n connectivity except in the office of the goat farm. So, the following morning at 6am, I sit\n\n1:33:53.520 --> 1:34:00.800\n with my back to the office of that goat farm, looking at goats that were newly born and typing\n\n1:34:00.800 --> 1:34:06.880\n into my laptop, the presentation, the PowerPoint presentation about our ambitions for visiting the\n\n1:34:06.880 --> 1:34:16.560\n nearest star. And that was very surreal to me. Like our origins in many ways,\n\n1:34:16.560 --> 1:34:23.280\n this very primitive origins and our dreams of looking out that is brilliant. So that is\n\n1:34:23.280 --> 1:34:30.880\n incredibly inspiring to me, but it's also inspiring of putting humans onto other\n\n1:34:32.960 --> 1:34:38.240\n moons or planets. I still find going to the moon really exciting. I don't know, maybe I'm just a\n\n1:34:38.240 --> 1:34:44.960\n sucker for it, but it's really exciting. And Mars, which is a new place, a new planet, another planet\n\n1:34:44.960 --> 1:34:49.840\n that might have life. I mean, there's something magical to that or some traces of previous life.\n\n1:34:49.840 --> 1:34:55.680\n You might think that humans cannot really survive and there are risks by going there. But my point\n\n1:34:55.680 --> 1:35:03.840\n is, we started from Africa and we got to apartment buildings in Manhattan, right? It's a very\n\n1:35:03.840 --> 1:35:09.120\n different environment from the jungles to live in an apartment building in a small cubicle.\n\n1:35:09.120 --> 1:35:13.440\n Yes. And it took tens of thousands of years,\n\n1:35:13.440 --> 1:35:20.240\n but humans adapted, right? So why couldn't humans also make the leap and adapt to a habitat in\n\n1:35:20.240 --> 1:35:26.800\n space? Now you can build a platform that would look like an apartment building in the Bronx\n\n1:35:26.800 --> 1:35:34.320\n or somewhere, but have inside of it everything that humans need. And just like the space station,\n\n1:35:34.320 --> 1:35:40.400\n but bigger. And it will be a platform in space. And the advantage of that is if something bad\n\n1:35:40.400 --> 1:35:47.360\n happens on Earth, you have that complex where humans live. And you can also move it back and\n\n1:35:47.360 --> 1:35:56.080\n forth depending on how bright the sun gets. Because within a billion years, the sun would be\n\n1:35:56.080 --> 1:36:01.520\n too hot and it will boil off all the oceans on Earth. So we cannot stay here for more than a\n\n1:36:01.520 --> 1:36:07.920\n billion years. That's for sure. Yes. So that's a billion years from now. I prefer shorter term\n\n1:36:07.920 --> 1:36:13.840\n deadlines. And so there's a lot of threats that we're facing currently. Do you find it exciting\n\n1:36:13.840 --> 1:36:22.880\n the possibility of landing on Mars and starting little like building a Manhattan style apartment\n\n1:36:22.880 --> 1:36:27.920\n building on Mars and humans occupying it? Do you think from a scientific or an engineering\n\n1:36:27.920 --> 1:36:34.480\n perspective, that's a worthy pursuit? I think it's worthy. But the real issue that is often\n\n1:36:35.920 --> 1:36:42.800\n underplayed is the risk to the human body from cosmic rays. These are energetic particles\n\n1:36:43.520 --> 1:36:51.040\n and we are protected from them by the magnetic field around the Earth that blocks them. But if\n\n1:36:51.040 --> 1:36:57.680\n you go to Mars, where there is no such magnetic field to block them, then, you know, a significant\n\n1:36:57.680 --> 1:37:04.480\n fraction of the brain cells in your head will be damaged within a year. And the consequences of\n\n1:37:04.480 --> 1:37:12.560\n that are not clear. I mean, it's quite possible that humans cannot really survive on the surface.\n\n1:37:12.560 --> 1:37:18.240\n Now, it may mean that we need to dig tunnels, go underground or create some protection.\n\n1:37:19.440 --> 1:37:23.760\n This is something that can be engineered. Yes. And, you know, we can start from the\n\n1:37:23.760 --> 1:37:29.600\n Moon and then move to Mars. That would be a natural progression. But it's a big issue\n\n1:37:29.600 --> 1:37:35.360\n that needs to be dealt with. I don't think, you know, it's a showstopper. I think we can overcome\n\n1:37:35.360 --> 1:37:40.080\n it. But, you know, just like anything in science and technology, you have to work on it for a while,\n\n1:37:40.080 --> 1:37:47.200\n figure out solutions. But it's not as rosy as Elon Musk talks about. I mean, Elon Musk can\n\n1:37:47.200 --> 1:37:53.360\n obviously be optimistic. I think eventually it will boil down to figuring out how to cope with\n\n1:37:53.360 --> 1:37:59.920\n this risk, the health risk. Yeah, I mean, in defense of optimism, I find that there's at\n\n1:37:59.920 --> 1:38:10.400\n least a correlation, if not their best friends, is optimism and open mindedness. It's a necessary\n\n1:38:10.400 --> 1:38:18.880\n precondition to try crazy things. And in that sense, the sense I have about going to Mars,\n\n1:38:18.880 --> 1:38:27.040\n if we use today's logic of what kind of benefits we'll get from that, we're never going to go.\n\n1:38:28.080 --> 1:38:33.680\n And like most decisions we make in life, most decisions we've made as a human species\n\n1:38:34.240 --> 1:38:41.680\n are irrational if you look at just today. But if you look at the long arc and the\n\n1:38:41.680 --> 1:38:51.120\n possibilities that it might bring, just like humans, Europe and destroyed everybody.\n\n1:38:51.120 --> 1:38:58.000\n But it was a commercial interest that drove that for trade. And, you know, it might happen again,\n\n1:38:58.000 --> 1:39:02.640\n in this context, you have people like Jeff Bezos and Elon Musk that are commercially driven to go\n\n1:39:02.640 --> 1:39:10.160\n to space. But it doesn't mean that what we will ultimately find is not new worlds that have\n\n1:39:10.160 --> 1:39:16.960\n nothing, you know, have much more to offer than just commercial interest. And as a side effect,\n\n1:39:16.960 --> 1:39:22.800\n almost. Yeah, yeah. And then that's why I think, you know, we should be open minded and explore.\n\n1:39:22.800 --> 1:39:28.960\n And, however, at the same time, because of the reasons you pointed out, I'm not optimistic that\n\n1:39:28.960 --> 1:39:34.240\n we will survive more than a few centuries into the future, because people do not think long term.\n\n1:39:34.240 --> 1:39:39.600\n And that means that we will only survive for the short term. I don't know if you have thoughts\n\n1:39:39.600 --> 1:39:45.360\n about this, but what are the things that worry you the most about, from the great perspective\n\n1:39:45.360 --> 1:39:49.840\n of the universe, which is the great filters that destroys intelligent civilizations,\n\n1:39:49.840 --> 1:39:55.440\n but for our own species here? Like, what are the things that worry you the most?\n\n1:39:55.440 --> 1:39:59.920\n Yeah, the thing that worries me the most is that people pay attention to how many likes they have\n\n1:39:59.920 --> 1:40:10.160\n on Twitter. And rather than, you know, basketball coaches tell the team players, keep your eyes on\n\n1:40:10.160 --> 1:40:16.000\n the ball, not on the audience. The problem is we keep our eyes on the audience most of the time.\n\n1:40:17.120 --> 1:40:21.600\n Let's keep our eyes on the ball. And what does that mean? First of all, in the context of science,\n\n1:40:21.600 --> 1:40:26.000\n it means pay attention to the evidence. When the evidence looks strange,\n\n1:40:26.000 --> 1:40:31.840\n then we should figure it out. You know, I went to a seminar about Umuamua at Harvard,\n\n1:40:32.320 --> 1:40:40.880\n and a colleague of mine that is mainstream, conservative, would never say anything that would\n\n1:40:40.880 --> 1:40:48.400\n deviate from what everyone else is thinking, said to me after the seminar, I wish this object never\n\n1:40:48.400 --> 1:40:56.240\n existed. Now, to me, I mean, I just couldn't hear that. What do you mean, nature is whatever it is,\n\n1:40:56.240 --> 1:41:01.680\n you have to pay attention to it. You cannot say, you know, you cannot bury your head in this. I\n\n1:41:01.680 --> 1:41:05.840\n mean, you should bless nature for giving you clues about things that you haven't expected.\n\n1:41:05.840 --> 1:41:06.400\n Yes.\n\n1:41:06.400 --> 1:41:12.800\n And I think that's the biggest fault that we are looking for confirmations of things we already\n\n1:41:12.800 --> 1:41:20.800\n know, so that we can maintain our pride that we already knew it, and maintain our image,\n\n1:41:20.800 --> 1:41:25.120\n not make mistakes, because we already knew it, therefore we expected the right thing.\n\n1:41:25.120 --> 1:41:25.600\n Yes.\n\n1:41:25.600 --> 1:41:30.800\n But science is a learning experience, and sometimes you're wrong. And let's learn from\n\n1:41:30.800 --> 1:41:36.480\n those mistakes. And what's the problem about that? Why do we have to get, you know, prizes,\n\n1:41:36.480 --> 1:41:42.320\n and why do we get to be honored and maintain our image, when the actual objective of science is\n\n1:41:42.320 --> 1:41:43.600\n learning about nature?\n\n1:41:43.600 --> 1:41:49.520\n And like you've talked about, anomalies in this case are actually are not things that\n\n1:41:49.520 --> 1:41:54.960\n are unfortunate and to be ignored are, in fact, gifts and should be the focus of science.\n\n1:41:54.960 --> 1:41:59.200\n Exactly, because that's the way for us to improve our understanding. If you look at quantum\n\n1:41:59.200 --> 1:42:05.200\n mechanics, nobody dreamed about it. And it was revolutionary, and we still don't fully understand\n\n1:42:05.200 --> 1:42:07.680\n it. It's a pain for us to figure out.\n\n1:42:07.680 --> 1:42:13.760\n So I understand from the perspective that's holding our science back, why do you have\n\n1:42:13.760 --> 1:42:20.960\n a sense that that's also something that might be a problem for us in terms of the survival\n\n1:42:20.960 --> 1:42:22.160\n of human civilization?\n\n1:42:22.160 --> 1:42:31.120\n Because when you look at society, it operates by the same principles. People look for affirmation\n\n1:42:31.120 --> 1:42:39.280\n by groups, and they, you know, people segregate into herds that think like them, especially\n\n1:42:39.280 --> 1:42:44.880\n these days when social media is so strong, you can find your support group. And if you\n\n1:42:44.880 --> 1:42:49.360\n don't look for evidence for what you're saying, you can say crazy things as long as there\n\n1:42:49.360 --> 1:42:54.560\n are enough people supporting what you say. You can even have your newspapers, you can\n\n1:42:54.560 --> 1:42:59.360\n have everything to support your view, and then, you know, bad things will happen to\n\n1:42:59.360 --> 1:43:04.480\n society. Because we're detaching ourselves from reality. And if we detach ourselves\n\n1:43:04.480 --> 1:43:09.120\n from reality, all the destructive things that naturally can occur in the real world, whether\n\n1:43:09.120 --> 1:43:13.840\n from nuclear weapons, all the kinds of threats that we're facing, even we're living through\n\n1:43:13.840 --> 1:43:19.840\n a pandemic, the supposed, you know, a much, much worse pandemic could happen. And then\n\n1:43:19.840 --> 1:43:25.600\n we could sadly, like we did this one, politicize it in some kind of way and have bickering\n\n1:43:25.600 --> 1:43:31.040\n in the space of Twitter and politics, as opposed to there's an actual thing that can destroy\n\n1:43:31.040 --> 1:43:32.000\n the human species.\n\n1:43:32.000 --> 1:43:37.600\n Exactly. So the only way for us to maintain, to stay modest and learn about what really\n\n1:43:37.600 --> 1:43:44.480\n happens is by looking for evidence. Again, I'm saying, it's not about ourself, you know,\n\n1:43:44.480 --> 1:43:49.360\n it's about figuring out what's around us. And if you close yourself by surrounding yourself\n\n1:43:49.360 --> 1:43:57.040\n with people that are like minded, that refuse to look at the evidence, you can do bad things.\n\n1:43:57.040 --> 1:44:02.800\n And throughout human history, that's the origin of all the bad things that happen.\n\n1:44:02.800 --> 1:44:03.280\n Yes.\n\n1:44:03.280 --> 1:44:07.920\n And I think it's a key. It's a key to be modest and to look at evidence. And it's\n\n1:44:07.920 --> 1:44:15.360\n not a nuance. Now, you might say, Oh, okay, the uneducated person might operate. No,\n\n1:44:15.360 --> 1:44:21.040\n it's the scientific community operates this way. My problem is not with people that don't\n\n1:44:21.040 --> 1:44:24.960\n have an academic pedigree. It's included everywhere in society.\n\n1:44:24.960 --> 1:44:30.880\n On the topic of the discovery of evidence of alien civilizations, which is something\n\n1:44:30.880 --> 1:44:38.960\n you touch on in your book, what that idea would do to societies, to the human psyche\n\n1:44:38.960 --> 1:44:46.400\n and in general, do you think, and you talk about the, I still have trouble pronouncing,\n\n1:44:46.400 --> 1:44:54.320\n but a Muamua wager, right? What do you think is, can you explain it? And what do you think\n\n1:44:54.320 --> 1:44:58.640\n in general is the effect that such knowledge might have on human civilization?\n\n1:44:58.640 --> 1:45:04.400\n Right. So Pascal had this wager about God. And by the way, there are interesting connections\n\n1:45:04.400 --> 1:45:11.040\n between theology and the search for extraterrestrial life. It's possible that we were planted on\n\n1:45:11.040 --> 1:45:19.040\n this planet by another civilization. We attribute to God powers that belong really to the technological\n\n1:45:19.040 --> 1:45:26.800\n civilization. But putting that aside, Pascal basically said, there are two possibilities,\n\n1:45:26.800 --> 1:45:34.560\n there are two possibilities, either God exists or not. And if God exists, the consequences\n\n1:45:34.560 --> 1:45:42.640\n are quite significant. And therefore, we should consider that possibility differently than\n\n1:45:42.640 --> 1:45:50.400\n equal weight to both possibilities. And I suggest that we do the same with Muamua or\n\n1:45:50.400 --> 1:45:58.960\n other technological signatures, that we keep in mind the consequences and therefore pay\n\n1:45:58.960 --> 1:46:05.600\n more attention to that possibility. Now, some people say extraordinary claims require extraordinary\n\n1:46:05.600 --> 1:46:14.720\n evidence. My point is that the term extraordinary is really subjective. For one person, a black hole\n\n1:46:14.720 --> 1:46:20.640\n is extraordinary. For another, it's just a consequence of Einstein's theory of gravity. It's\n\n1:46:20.640 --> 1:46:27.680\n nothing extraordinary. The same about the type of dark matter, anything. So we should leave the\n\n1:46:27.680 --> 1:46:34.960\n extraordinary part of that sentence. Just keep evidence, okay? So let's be guided by evidence.\n\n1:46:35.520 --> 1:46:42.080\n And even if we have extraordinary claims, let's not dismiss them because the evidence is not\n\n1:46:42.080 --> 1:46:47.360\n extraordinary enough. Because if we have an image of something and it looks really strange and we\n\n1:46:47.360 --> 1:46:51.920\n say, oh, the image is not sufficiently sharp, therefore, we should not even pay attention to\n\n1:46:51.920 --> 1:46:57.520\n this image or not even consider. I think that's a mistake. What we should do is say, look, there is\n\n1:46:57.520 --> 1:47:02.800\n some evidence for something unusual. Let's try and build instruments that will give us a better\n\n1:47:02.800 --> 1:47:09.680\n image. And if you just dismiss extraordinary claims, because you consider them extraordinary,\n\n1:47:09.680 --> 1:47:17.520\n you avoid discovering things that you haven't expected. And so I believe that along the history\n\n1:47:17.520 --> 1:47:21.920\n of astronomy, there are many missed opportunities. And I speak about astronomy, but I'm sure in other\n\n1:47:21.920 --> 1:47:27.360\n fields, it's also true. I mean, this is my expertise. For example, you know, the Astrophysical\n\n1:47:27.360 --> 1:47:35.600\n Journal, which is the main primary publication in astrophysics. If you go before the 1980s,\n\n1:47:35.600 --> 1:47:41.520\n there are images that were posted in the Astrophysical Journal of giant arcs, you know, arcs\n\n1:47:41.520 --> 1:47:49.680\n of light surrounding clusters of galaxies. And, you know, you can find it in printed versions of\n\n1:47:49.680 --> 1:47:54.320\n the Astrophysical Journal. People just ignore it. They put the image, they see the arc, they say,\n\n1:47:54.960 --> 1:48:00.960\n who knows what it is and just ignore it. And then in the 1980s, the subject of gravitational\n\n1:48:00.960 --> 1:48:10.160\n lensing became popular. And the idea is that you can deflect light by the force of gravity. And\n\n1:48:11.200 --> 1:48:16.160\n then you can put a source behind the cluster of galaxies, and then you will get these arcs. And\n\n1:48:16.160 --> 1:48:23.760\n actually, Einstein predicted it in 1940. And, you know, so these things were expected, but\n\n1:48:23.760 --> 1:48:28.320\n people just had them in the images, didn't pay attention. So I'm sure there are lost opportunities\n\n1:48:28.320 --> 1:48:36.160\n sometimes. Even in existing data, you have things that are unusual and exceptional and are not being\n\n1:48:36.160 --> 1:48:42.560\n addressed. Yeah, you actually, I think you have an article, the data is not enough from quite a few\n\n1:48:42.560 --> 1:48:48.240\n years ago, where you talk, you know, we can go back to the 70s and 80s, but we can go also to the\n\n1:48:48.240 --> 1:48:53.680\n Mayan civilization. Right, the Mayan civilization basically believed in astrology that you can\n\n1:48:53.680 --> 1:49:00.240\n forecast the outcome of a war based on the position of the planets. And they had, you know,\n\n1:49:00.240 --> 1:49:08.240\n astronomers in their culture had the highest social status. They were priests, they were elevated.\n\n1:49:08.240 --> 1:49:14.080\n And the reason was that they helped politicians decide when to go to war, because they would tell\n\n1:49:14.080 --> 1:49:18.560\n the politicians, you know, the planets would be in this configuration, it's a better chance for you\n\n1:49:18.560 --> 1:49:27.120\n to win the war, go to war. And in retrospect, they collected wonderful data, but misinterpreted it,\n\n1:49:27.120 --> 1:49:33.520\n because we now know that the position of Venus or Jupiter or whatever has nothing to do with the\n\n1:49:33.520 --> 1:49:40.480\n outcome of World War I, World War II, you know, has nothing to do. And so we can have a prejudice\n\n1:49:40.480 --> 1:49:47.200\n and collect data without actually doing the right thing with it. That's such a Pisces thing to say.\n\n1:49:47.200 --> 1:49:49.360\n I looked up what your astrological sign is.\n\n1:49:52.880 --> 1:49:58.560\n Well, so you mentioned Einstein predicted that black holes don't exist, or just didn't, or thought.\n\n1:49:58.560 --> 1:49:59.520\n Don't exist in nature.\n\n1:49:59.520 --> 1:50:00.880\n Don't exist in nature.\n\n1:50:00.880 --> 1:50:06.960\n When Einstein came up with his theory of gravity in 1915, November 1915, a few months later,\n\n1:50:07.520 --> 1:50:13.120\n another physicist, Karl Schwarzschild, he was the director of the Potsdam Observatory,\n\n1:50:13.120 --> 1:50:18.800\n but he was a patriot, a German patriot. So he went into the First World War fighting for Germany.\n\n1:50:18.800 --> 1:50:23.600\n But while he was at the front, he sent a postcard to Einstein saying, you know,\n\n1:50:23.600 --> 1:50:27.360\n a few months after the theory was developed, saying, actually, I found a solution to your\n\n1:50:27.360 --> 1:50:34.480\n equations. And that was a black hole solution. And then he died a few months later. And Einstein\n\n1:50:34.480 --> 1:50:40.080\n was a pacifist, and he survived. So the lesson from this story is that if you want to work out\n\n1:50:40.080 --> 1:50:47.840\n the consequences of a theory, you better be a pacifist. But the point is that this solution\n\n1:50:47.840 --> 1:50:55.280\n was known shortly after Einstein came up with his theory. But in 1939, Einstein wrote a paper\n\n1:50:55.920 --> 1:51:00.000\n in the Annals of Mathematics saying, even though the solution exists,\n\n1:51:00.000 --> 1:51:05.760\n I don't think it's realized in nature. And his argument was, if you imagine a star collapsing,\n\n1:51:05.760 --> 1:51:11.280\n stars often spin, and the spin will prevent them from making a black hole, collapsing to a point.\n\n1:51:11.280 --> 1:51:19.040\n So, I mean, can you maybe, one of the many things you have worked on, you're an expert in,\n\n1:51:20.000 --> 1:51:26.000\n is black holes. Can you first say, what are black holes? And second, how do we know that they exist?\n\n1:51:26.560 --> 1:51:32.800\n Right. So black holes are the ultimate prison. You know, you can check in, but you can never check out.\n\n1:51:32.800 --> 1:51:33.360\n It's romantic.\n\n1:51:33.360 --> 1:51:40.000\n You can never check out. Even light cannot escape from them. So there are extreme structures of\n\n1:51:40.000 --> 1:51:48.640\n space and time. And there is this so called Schwarzschild radius or the event horizon of\n\n1:51:48.640 --> 1:51:54.160\n a black hole. Once you enter into it with a spaceship, you would never be able to tweet\n\n1:51:54.160 --> 1:51:59.360\n back to your friends and tell them, by the way, I asked the students in my class, freshman seminar\n\n1:51:59.360 --> 1:52:06.800\n at Harvard, I said, let me give you two possible journeys that you can take. I said, suppose aliens\n\n1:52:06.800 --> 1:52:15.280\n come to Earth and suggest that you would board their spaceship, would you do it? And the second\n\n1:52:15.280 --> 1:52:19.360\n is, suppose you could board a spaceship that will take you into a black hole, would you do it?\n\n1:52:20.000 --> 1:52:28.080\n So all of them said to the first question, yes, under one condition, that I'll be able to maintain\n\n1:52:28.080 --> 1:52:34.960\n my social media contacts and report back, share the experience with them. Personally, I have no\n\n1:52:34.960 --> 1:52:36.240\n footprint on social media.\n\n1:52:36.240 --> 1:52:38.480\n Yeah, which is as a matter of principle.\n\n1:52:39.040 --> 1:52:44.560\n Yeah, my wife asked me when we got married, and I honor that.\n\n1:52:44.560 --> 1:52:49.280\n And I told you offline, I need to get married to such a woman. She truly is a special agent.\n\n1:52:49.280 --> 1:52:56.480\n Well, she was wise enough to recognize the risk. But it saves me time. And it also keeps me away\n\n1:52:56.480 --> 1:53:03.600\n from crowds. I don't have the notion of what a lot of other people think, so I can think\n\n1:53:03.600 --> 1:53:04.080\n independently.\n\n1:53:04.080 --> 1:53:04.720\n Crowd think, exactly.\n\n1:53:04.720 --> 1:53:11.840\n Yeah, exactly. So I was surprised to hear that for students, it's extremely important to share\n\n1:53:11.840 --> 1:53:17.600\n experiences. Even if they go on a spaceship with aliens, they still want to brag about it rather\n\n1:53:17.600 --> 1:53:19.680\n than look around and see what's going on.\n\n1:53:19.680 --> 1:53:22.960\n This is not an option when you go to the black hole, is exactly the point.\n\n1:53:22.960 --> 1:53:29.680\n So for the black hole, they said no, because obviously you can find your death after you get\n\n1:53:29.680 --> 1:53:35.680\n into it, you crash into singularity. There is this singularity in the center. So inside the event\n\n1:53:35.680 --> 1:53:44.560\n horizon, we know that all the matter collects at a point. Now, we can't really predict what happens\n\n1:53:44.560 --> 1:53:49.680\n at the singularity because Einstein's theory breaks down. And we know why it breaks down,\n\n1:53:49.680 --> 1:53:55.280\n because it doesn't have quantum mechanics that talks about small distances. We don't have a\n\n1:53:55.280 --> 1:54:02.240\n theory that unifies quantum mechanics and gravity so that it will predict what happens near a\n\n1:54:02.240 --> 1:54:12.720\n singularity. And in fact, a couple of years ago, I had a flood in my basement. And I invited a\n\n1:54:12.720 --> 1:54:19.680\n plumber to come over and figure out and we found that the sewer was clogged because of\n\n1:54:20.560 --> 1:54:28.080\n tree roots that got into it. And we solved the problem. But then I thought to myself,\n\n1:54:28.080 --> 1:54:33.600\n well, isn't that what happens at the singularity of a black hole? Because the question is,\n\n1:54:33.600 --> 1:54:39.920\n where does the matter go? In the case of a home, I never thought about it, but the water,\n\n1:54:39.920 --> 1:54:46.640\n all the water that we use, goes in through the sewer to some reservoir somewhere. And the question\n\n1:54:46.640 --> 1:54:51.440\n is, what happens inside a black hole? And one possibility is that there is an object in the\n\n1:54:51.440 --> 1:54:56.800\n middle, just like a star, and everything collects there. And the object has the maximum density that\n\n1:54:56.800 --> 1:55:03.600\n we can imagine, like Planck density. It's the ultimate density that you can have, where gravity\n\n1:55:03.600 --> 1:55:11.040\n is as strong as all the other forces. So you can imagine this object, very dense object at the\n\n1:55:11.040 --> 1:55:15.920\n center that collects all the matter. Another possibility is that there is some tunnel just\n\n1:55:15.920 --> 1:55:22.320\n like the sewer. It takes the matter into another place. And we don't know the answer. But I wrote\n\n1:55:22.320 --> 1:55:28.080\n a Scientific American essay about it, admitting our ignorance. It's a fascinating question. What\n\n1:55:28.080 --> 1:55:32.400\n happens to the matter that goes into a black hole? I actually recommend it to some of my colleagues\n\n1:55:32.400 --> 1:55:38.240\n that work on string theory. At the closing of a conference, I'm the founding director of the Black\n\n1:55:38.240 --> 1:55:42.960\n Hole Initiative at Harvard, which brings together astronomers, physicists, philosophers, and\n\n1:55:42.960 --> 1:55:49.040\n mathematicians. And we have a conference once a year. And at the end of one of them, since I'm the\n\n1:55:49.040 --> 1:55:56.480\n director, I had to summarize. And I said that I wish we could go on a field trip to a black hole\n\n1:55:56.480 --> 1:56:03.120\n nearby. And I highly recommend to my colleagues that work on string theory to enter into that\n\n1:56:03.120 --> 1:56:08.080\n black hole, because then they can test their theory when they get inside. But one of the\n\n1:56:08.880 --> 1:56:14.000\n string theorists in the audience, Nimar Khani Hamad, immediately raised his voice and said,\n\n1:56:14.000 --> 1:56:21.280\n you have an ulterior motive for sending us into a black hole, which I didn't deny, but at any event.\n\n1:56:21.280 --> 1:56:31.520\n Yeah, that's true. That's true. Can you say why we know that black holes exist?\n\n1:56:32.560 --> 1:56:38.800\n Right. So it's an interesting question because black holes were considered a theoretical\n\n1:56:38.800 --> 1:56:51.840\n construct. And Einstein even denied their existence in 1939. But then in the mid 1960s, quasars were\n\n1:56:51.840 --> 1:56:59.120\n discovered. These are very bright sources of light, 100 times brighter than their host galaxy,\n\n1:56:59.840 --> 1:57:06.800\n which are point like at the center of galaxies. And it was immediately suggested\n\n1:57:06.800 --> 1:57:16.560\n by Ed Salpeter in the West and by Yakov Zeldovich in the East, that these are black holes that\n\n1:57:16.560 --> 1:57:23.120\n accrete gas, collect gas from their host galaxy that are being fed with gas. And they shine very\n\n1:57:23.120 --> 1:57:32.240\n brightly because as the gas falls towards the black holes, just like water running down the sink,\n\n1:57:32.240 --> 1:57:41.440\n the gas swirls and then rubs against itself and heats up and shines very brightly because it's\n\n1:57:41.440 --> 1:57:49.440\n very hot close to the black hole. By viscosity, it heats up. And in the case of black holes,\n\n1:57:49.440 --> 1:57:56.320\n it's the turbulence, the turbulent viscosity that causes it to heat up. So we get these very bright\n\n1:57:56.320 --> 1:58:01.600\n sources of light just from black holes that are supposed to be dark, nothing but black holes.\n\n1:58:01.600 --> 1:58:07.680\n You know, nothing escapes from them, but they create a violent environment where gas moves\n\n1:58:07.680 --> 1:58:12.880\n close to the speed of light and therefore shines very brightly, much more than any other source\n\n1:58:12.880 --> 1:58:17.520\n in the sky. And we can see these quasars all the way to the edge of the universe.\n\n1:58:17.520 --> 1:58:24.000\n So we have evidence now that when the universe was, you know, about 7% of its present age,\n\n1:58:24.000 --> 1:58:30.240\n you know, infant, already back then you had black holes of a billion times the mass of the sun,\n\n1:58:30.240 --> 1:58:38.320\n which is quite remarkable. It's like finding giant babies in a nursery, you know, like how can these\n\n1:58:38.320 --> 1:58:43.040\n black holes grow so fast? You know, less than a billion years after the Big Bang, you already have\n\n1:58:43.040 --> 1:58:48.800\n a billion times the mass of the sun in these black holes. And the answer is presumably there are very\n\n1:58:48.800 --> 1:58:58.240\n quick processes that build them up. They build quickly. Very quickly. And so we see those black\n\n1:58:58.240 --> 1:59:08.480\n holes, and that was found in the mid 1960s. But in 2015, exactly 100 years after Einstein came up\n\n1:59:08.480 --> 1:59:16.400\n with his theory of gravity, the LIGO observatory detected gravitational waves. And these are just\n\n1:59:16.400 --> 1:59:21.600\n ripples in space and time. So according to Einstein's theory, the innovation, the ingenuity\n\n1:59:21.600 --> 1:59:29.920\n of Einstein's theory of gravity that was formulated in November 1915 was to say that space and time\n\n1:59:30.480 --> 1:59:40.240\n are not rigid. You know, they respond to matter. So, for example, if you have two black holes and\n\n1:59:40.240 --> 1:59:48.400\n they collide, it's just like a stone being thrown on the surface of a pond. They generate waves,\n\n1:59:48.400 --> 1:59:53.040\n disturbances in space and time that propagate out at the speed of light. These are gravitational\n\n1:59:53.040 --> 1:59:59.760\n waves. They create a space time storm around them, and then the waves go all the way through\n\n1:59:59.760 --> 2:00:05.840\n the universe and reach us. And if you have a sensitive enough detector like LIGO, you can\n\n2:00:05.840 --> 2:00:11.120\n detect these waves. And so it was not just the message that we received for the first time,\n\n2:00:11.120 --> 2:00:16.880\n gravitational waves, but it was the messenger. So there are two aspects to it. One is the messenger\n\n2:00:16.880 --> 2:00:21.120\n which is gravitational wave for the first time were detected directly. And the second was the\n\n2:00:21.120 --> 2:00:27.280\n message, which was a collision of two black holes, because we could see the pattern of the ripples\n\n2:00:27.280 --> 2:00:33.520\n in space and time. And it was fully consistent with the prediction that Schwarzschild made for\n\n2:00:33.520 --> 2:00:39.280\n how the space time around the black hole is, because when two black holes collide, you can sort\n\n2:00:39.280 --> 2:00:49.200\n of map from the message that you get, you can reconstruct what really happened and it's fully\n\n2:00:49.200 --> 2:01:00.560\n consistent. And in 2017 and 2020, there's two Nobel prizes. That's right. That had to do with the\n\n2:01:00.560 --> 2:01:07.200\n black holes. Can you maybe describe in the same masterful way that you've already been doing what\n\n2:01:07.200 --> 2:01:13.600\n the 2017 was given for the LIGO collaboration for discovering gravitation waves from collisions\n\n2:01:13.600 --> 2:01:24.800\n of black holes? And the 2020 Nobel prize in physics was given for two things. One was\n\n2:01:24.800 --> 2:01:32.080\n theoretical work that was done by Roger Penrose in the 1960s, demonstrating that black holes are\n\n2:01:32.080 --> 2:01:39.920\n inevitable when stars collapse. And it was mostly mathematical work. And actually, Stephen Hawking\n\n2:01:41.360 --> 2:01:48.000\n also contributed significantly to that frontier. And unfortunately, he is not alive, so he could\n\n2:01:48.000 --> 2:01:56.720\n not be honored. So Penrose received it on his own. And then two other astronomers received it as well,\n\n2:01:56.720 --> 2:02:03.360\n Andrea Ghez and Reinhard Genzel, and they provided conclusive evidence that there is a black hole at\n\n2:02:03.360 --> 2:02:10.720\n the center of the Milky Way galaxy that weighs about 4 million times the mass of the sun. And\n\n2:02:10.720 --> 2:02:15.920\n they found the evidence from the motion of stars very close to the black hole. Just like we see the\n\n2:02:15.920 --> 2:02:21.360\n planets moving around the sun, there are stars close to the center of the galaxy and they are\n\n2:02:21.360 --> 2:02:27.360\n orbiting at very high speeds of other thousands of kilometers per second or thousands of miles per\n\n2:02:27.360 --> 2:02:37.680\n second per second. Think about it. Which can only be induced at those distances if there is a 4\n\n2:02:37.680 --> 2:02:46.560\n million solar mass object that is extremely compact. And the only thing that is compatible\n\n2:02:46.560 --> 2:02:54.160\n with the constraints is a black hole. And they actually made a movie of the motion of these\n\n2:02:54.160 --> 2:03:00.800\n stars around the center. One of them moves around the center over a decade, over timescales that we\n\n2:03:00.800 --> 2:03:11.280\n can monitor. And it was a breakthrough in a way. So combining LIGO with the detection of a black\n\n2:03:11.280 --> 2:03:18.800\n hole at the center of the Milky Way and in many other galaxies like quasars, now I would say\n\n2:03:20.720 --> 2:03:28.240\n black hole research is vogue. It's very much in fashion. We saw it back in 2016 when we established\n\n2:03:28.240 --> 2:03:37.120\n the black hole initiative. You kind of saw that there's this excitement about in breakthroughs\n\n2:03:37.120 --> 2:03:42.000\n and discoveries around black holes which are probably one of the most fascinating objects\n\n2:03:42.000 --> 2:03:49.360\n in the universe. It's up there. They're both terrifying and beautiful and they capture the\n\n2:03:49.360 --> 2:03:53.760\n entirety of the physics that we know about this universe. I should say the question is where is\n\n2:03:53.760 --> 2:04:01.040\n the nearest black hole? Can we visit it? And I wrote a paper with my undergraduate student,\n\n2:04:01.040 --> 2:04:07.600\n Amir Siraj, suggesting that perhaps if there is one in the solar system, we can detect it.\n\n2:04:09.840 --> 2:04:12.720\n I don't know if you heard, but there is a claim that maybe there is a\n\n2:04:14.000 --> 2:04:20.960\n planet nine in the solar system because we see some anomalies at the outer parts of the solar\n\n2:04:20.960 --> 2:04:26.400\n system. So some people suggested maybe there is a planet out there that was not yet detected. So\n\n2:04:26.400 --> 2:04:32.240\n people searched for it, didn't find it. It weighs roughly five times the mass of the earth. And we\n\n2:04:32.240 --> 2:04:37.920\n said, okay, maybe you can't find it because it's a black hole that was formed early in the universe.\n\n2:04:39.680 --> 2:04:40.640\n Where do you stand on that?\n\n2:04:40.640 --> 2:04:44.480\n It could be that the dark matter is made of black holes of this mass. We don't know what\n\n2:04:44.480 --> 2:04:50.240\n the dark matter is made of. It could be the black holes. So we said, but there is an experimental\n\n2:04:50.240 --> 2:04:59.680\n way to test it. And the way to do it is because there is the Oort cloud of icy rocks in the outer\n\n2:04:59.680 --> 2:05:06.400\n solar system. And if you imagine a black hole there, every now and then a rock will pass close\n\n2:05:06.400 --> 2:05:12.400\n enough to the black hole to be disrupted by the very strong gravity close to the black hole. And\n\n2:05:12.400 --> 2:05:17.600\n that would produce a flare that you can observe. And we calculated how frequently these flares\n\n2:05:17.600 --> 2:05:23.120\n should occur. And with LSST on the Vera Rubin Observatory, we found that you can actually\n\n2:05:23.120 --> 2:05:29.440\n test this hypothesis. And if you don't see flares, then you can put limits on the existence of a\n\n2:05:29.440 --> 2:05:33.920\n black hole in the solar system. It would be extremely exciting if there was a black hole,\n\n2:05:33.920 --> 2:05:41.520\n if planet nine was a black hole, because we could visit it and we can examine it. And it will not\n\n2:05:41.520 --> 2:05:47.920\n be a matter of an object that is very removed from us. Another thing I should say is it's\n\n2:05:47.920 --> 2:05:53.920\n possible that the black hole affected life on Earth. The black hole at the center of the Milky\n\n2:05:53.920 --> 2:06:03.360\n Way. How? That black hole right now is dormant. It's very faint. But we know that it flares.\n\n2:06:04.080 --> 2:06:10.800\n When a star like the sun comes close to it, the star will be spaghettified, basically become a\n\n2:06:10.800 --> 2:06:16.640\n stream of gas, like a spaghetti. And then the gas would fall into the black hole and there would be\n\n2:06:16.640 --> 2:06:22.960\n a flare. And this process happens once every 10,000 years or so. So we expect that these flares to\n\n2:06:22.960 --> 2:06:31.120\n occur every 10,000 years. But we also see evidence for the possibility that gas clouds were disrupted\n\n2:06:31.120 --> 2:06:36.560\n by the black hole, because the stars that are close to the black hole are residing in a single\n\n2:06:36.560 --> 2:06:42.080\n or two planes. And the only way you can get that is if they formed out of a disk of gas,\n\n2:06:42.080 --> 2:06:48.320\n just like the planets in the solar system formed. So there is evidence that gas fell into the black\n\n2:06:48.320 --> 2:06:55.680\n hole and powered possibly a flare. And these flares produce x rays and ultraviolet radiation\n\n2:06:56.240 --> 2:07:02.640\n that could damage life if the Earth was close enough to the center of the galaxy.\n\n2:07:02.640 --> 2:07:10.960\n Where we are right now, it's not very risky for us. But there is a theoretical argument that says\n\n2:07:10.960 --> 2:07:17.120\n the solar system, the sun, was closer to the galactic center early on, and then it migrated\n\n2:07:17.120 --> 2:07:27.200\n outwards. So maybe in the early stage of the solar system, the conditions were affected,\n\n2:07:27.200 --> 2:07:31.440\n shaped by these flares of the black hole at the center of the galaxy. And that's why\n\n2:07:31.440 --> 2:07:36.400\n for the first two billion years, there wasn't any oxygen in the atmosphere, who knows. But\n\n2:07:37.440 --> 2:07:43.840\n it's just interesting to think that from a theoretical concept that Einstein resisted in 1939,\n\n2:07:44.640 --> 2:07:51.280\n it may well be that black holes have influence on our life. And that it's just like discovering that\n\n2:07:51.280 --> 2:08:04.560\n some stranger affected your family and in a way your life. And if that happens to be the case,\n\n2:08:04.560 --> 2:08:10.640\n a second Nobel Prize should be given, not for just the discovery of this black hole at the\n\n2:08:10.640 --> 2:08:15.200\n center of the galaxy, but perhaps for the Nobel Prize in chemistry, for the effect that it had.\n\n2:08:15.200 --> 2:08:23.680\n For the effect for the interplay that resulted in some kind of, yeah, the chemical effect,\n\n2:08:23.680 --> 2:08:30.320\n biology, I mean, all those kinds of things in terms of the emergence of life and the creation\n\n2:08:30.320 --> 2:08:35.360\n of a habitable environment. That's so fascinating. And of course, like you said, dark matter, like\n\n2:08:35.360 --> 2:08:41.440\n black holes have some... They could be the dark matter in principle, yes. We don't know what the\n\n2:08:41.440 --> 2:08:46.960\n dark matter is at the moment. Does it make you sad? So you've had an interaction and perhaps\n\n2:08:46.960 --> 2:08:52.000\n a bit of a friendship with Stephen Hawking. Does it make you sad that he didn't win the Nobel?\n\n2:08:52.000 --> 2:08:58.960\n Well, all together, I don't assign great importance to prizes because, you know,\n\n2:08:58.960 --> 2:09:04.880\n Jean Paul Sartre, who I admired as a teenager, because I was interested in philosophy. When I\n\n2:09:04.880 --> 2:09:11.520\n grew up on a farm in Israel, I used to collect eggs every afternoon and I would drive the tractor to\n\n2:09:11.520 --> 2:09:16.480\n the hills of our village and just think about philosophy, read philosophy books. And Jean Paul\n\n2:09:16.480 --> 2:09:22.080\n Sartre was one of my favorites. And he was honored with a Nobel Prize in literature. He was a\n\n2:09:22.080 --> 2:09:27.600\n philosopher primarily, existentialist. And he said, the hell with it. Why should I give\n\n2:09:27.600 --> 2:09:36.160\n special attention to this committee of people that get their self importance from awarding me\n\n2:09:36.160 --> 2:09:43.920\n the prize? Why does that merit my attention? So he gave up on the Nobel Prize. And\n\n2:09:44.480 --> 2:09:52.000\n you know, there are two benefits to that. One, that you're not working your entire life in the\n\n2:09:52.000 --> 2:09:57.440\n direction that would satisfy the will of other people. You work independently, you're not\n\n2:09:57.440 --> 2:10:04.960\n after these honors. Just for the same reason that if you're not living your life for making a profit\n\n2:10:04.960 --> 2:10:10.480\n or money, you can live a more fulfilling life because you're not being swayed by the wind,\n\n2:10:10.480 --> 2:10:17.120\n you know, of how to make money and so forth. The second aspect of it is, you know, that\n\n2:10:17.120 --> 2:10:29.520\n very often, you know, these prizes, they distort the way we do science because instead of people\n\n2:10:29.520 --> 2:10:36.400\n willing to take risks, and instead of having announcements only after a group of people\n\n2:10:36.400 --> 2:10:44.800\n converges with a definite result, you know, the natural progression of science is based on trial\n\n2:10:44.800 --> 2:10:50.320\n and error, you know, reporting some results, and perhaps they're wrong, but then other people find\n\n2:10:50.320 --> 2:10:54.800\n perhaps better evidence, and then you figure out what's going on. And that's the natural way that\n\n2:10:54.800 --> 2:11:00.800\n science is, you know, it's a learning experience. So if you give the public an image by which\n\n2:11:00.800 --> 2:11:06.080\n scientists are always right, you know, and you know, some of my colleagues say we must do that,\n\n2:11:06.080 --> 2:11:10.400\n because otherwise the public will never believe us that global warming is really taking place.\n\n2:11:10.400 --> 2:11:15.360\n But that's not true, because the public would really believe you if you show the evidence. So\n\n2:11:15.360 --> 2:11:19.920\n the point is, you should be sincere. When the evidence is not absolutely clear, or where there\n\n2:11:19.920 --> 2:11:23.600\n are disputes about the interpretation of the evidence, we should show ourselves. You know,\n\n2:11:23.600 --> 2:11:29.440\n the king is naked, okay? There is no point in pretending that the king is dressed,\n\n2:11:30.160 --> 2:11:36.480\n saying that scientists are always right. Scientists are wrong, frequently. And the only way to make\n\n2:11:36.480 --> 2:11:43.440\n progress is by evidence, giving us the support that we need to make airtight arguments. So when\n\n2:11:43.440 --> 2:11:49.760\n you say global warming is taking place, if the evidence is fully supportive, there are no holes\n\n2:11:49.760 --> 2:11:55.360\n in the argument, then people will be convinced, because you're not trying to fool them. When the\n\n2:11:55.360 --> 2:11:58.480\n evidence was not complete, you also show them that the evidence is not complete.\n\n2:11:58.480 --> 2:12:02.320\n And when there's holes, you show that there's holes, and here's the methodology we're using\n\n2:12:02.320 --> 2:12:06.800\n to try to close those holes. Exactly. Let's be sincere. Why pretend? So if there were no,\n\n2:12:06.800 --> 2:12:13.600\n in a world where there were no prizes, no honours, we would act like kids, as I said before.\n\n2:12:13.600 --> 2:12:19.120\n We would really be focusing on the ball and not on the audience. Yeah, the prizes get in the way,\n\n2:12:19.120 --> 2:12:25.600\n and it's so powerful. Do you think, in some sense, the few people that have turned down the prize\n\n2:12:26.240 --> 2:12:31.920\n made a much more powerful statement? I don't know if you're familiar in the space of mathematics\n\n2:12:31.920 --> 2:12:40.960\n with the Fields Medal and Google Perlman turned down the prize. One of the reasons I started\n\n2:12:40.960 --> 2:12:46.000\n this podcast is I'm going to definitely talk to Putin, I'm definitely talking to Perlman,\n\n2:12:46.000 --> 2:12:52.160\n and people keep telling me it's impossible. I love hearing that, because I'll talk to both.\n\n2:12:52.160 --> 2:13:00.480\n Anyway, but do you have a sense of why he turned down the prize,\n\n2:13:00.480 --> 2:13:10.960\n and is that a powerful statement to you? Well, what I read is that he was disappointed by the\n\n2:13:10.960 --> 2:13:16.960\n response of the community, the mainstream community, the mathematicians, to his earlier work,\n\n2:13:17.520 --> 2:13:24.480\n where they dismissed it, they didn't attend to the details, and didn't treat him with proper\n\n2:13:24.480 --> 2:13:32.640\n respect, because he was not considered one of them. And I think that speaks volumes about the\n\n2:13:32.640 --> 2:13:42.080\n current scientific culture, which is based on groupthink and on social interaction, rather\n\n2:13:42.080 --> 2:13:47.200\n than on the merit of the argument, and on the evidence in the context of physics. So in mathematics\n\n2:13:47.200 --> 2:13:54.160\n there is no empirical basis, you're exploring ideas that are logically consistent, but nevertheless\n\n2:13:54.160 --> 2:14:02.080\n there is this groupthink. And I think he was so frustrated with his past experience that he didn't\n\n2:14:02.080 --> 2:14:09.680\n even bother to publish his papers, he just posted them on the archive, and in a way saying, you know,\n\n2:14:09.680 --> 2:14:16.000\n I know what the answer is, go look at it. And then again, in the long arc of history,\n\n2:14:17.040 --> 2:14:23.280\n his work on archive will be remembered, and all the prizes, most of the prizes will be forgotten,\n\n2:14:23.280 --> 2:14:29.440\n that's what people don't kind of think about. When you look at Roger Penrose, for example,\n\n2:14:29.440 --> 2:14:35.280\n is another fascinating figure, you know, it's possible, and forgive me if this, I'm sure,\n\n2:14:35.280 --> 2:14:40.640\n my ignorance, but he's also did some work on consciousness. He's been one of the only people\n\n2:14:40.640 --> 2:14:47.040\n who spoke about consciousness, which for the longest time, and is still arguably outside\n\n2:14:47.040 --> 2:14:55.920\n the realm of the sciences. It's still seen as a taboo subject, and he was brave enough to explore\n\n2:14:55.920 --> 2:15:01.680\n it from a physics perspective, from just a philosophical perspective, but like with the rigor,\n\n2:15:01.680 --> 2:15:07.600\n like proposing different kind of hypotheses of how consciousness might be able to emerge in the brain,\n\n2:15:07.600 --> 2:15:11.840\n and it's possible that that is the thing he's remembered for if you look 100 years from now,\n\n2:15:11.840 --> 2:15:22.640\n right? As opposed to the work in the black holes, which fits into what the current scientific\n\n2:15:22.640 --> 2:15:30.160\n community allows to be the space of what is and isn't science. Yeah, it's really interesting to\n\n2:15:30.160 --> 2:15:37.600\n look at people that are innovators, where in some phases of their career, their ideas fit into the\n\n2:15:37.600 --> 2:15:44.240\n social structure that is around them, but in other phases, it doesn't. And when you look at them,\n\n2:15:44.240 --> 2:15:51.440\n they just operated the same way throughout, and it says more about their environment than about them.\n\n2:15:51.440 --> 2:15:55.360\n Well, yeah, and I don't know if you know who Max Tegmark is, I just recently talked to him.\n\n2:15:55.360 --> 2:15:56.400\n He's a friend of mine.\n\n2:15:56.400 --> 2:16:01.360\n I just recently talked to him again, and he, I mean, he was a little bit more explicit about\n\n2:16:01.360 --> 2:16:06.000\n saying, you know, being aware, which is something I also recommend, is like being aware where the\n\n2:16:06.000 --> 2:16:11.280\n scientific community stands, and doing enough to get, like move along into your career, in your\n\n2:16:11.280 --> 2:16:17.920\n career. And it's the necessary evil, I suppose, if you are one of those out of the box thinkers that\n\n2:16:17.920 --> 2:16:23.120\n just naturally have this childlike curiosity, which Max definitely is one of them, is sometimes\n\n2:16:23.120 --> 2:16:27.440\n you have to do some stuff that fits in, you publish and you get tenure and all those kinds of things.\n\n2:16:27.440 --> 2:16:32.560\n But the tenure is a great privilege because it allows you to, in principle, explore things that\n\n2:16:32.560 --> 2:16:40.240\n are not accepted by others. And unfortunately, it's not being taken advantage of by most people,\n\n2:16:40.240 --> 2:16:43.680\n and it's a waste of a very precious resource.\n\n2:16:43.680 --> 2:16:52.400\n Yeah, absolutely. The space that you kind of touched on that's full of theories and is perhaps\n\n2:16:52.400 --> 2:17:00.400\n detached from appreciation of empirical evidence, or longing for empirical evidence, or grounding\n\n2:17:00.400 --> 2:17:07.440\n in empirical evidence, is the theoretical physics community and the interest in unifying the laws\n\n2:17:07.440 --> 2:17:15.600\n of physics and with the theory of everything. I'm not sure from which direction to approach this\n\n2:17:15.600 --> 2:17:25.120\n question, but how far away are we from arriving at a theory of everything, do you think? And how\n\n2:17:25.120 --> 2:17:33.680\n would we, how important is it to try to arrive at it, at this kind of goal of this beautiful simple\n\n2:17:33.680 --> 2:17:42.640\n theory that unlocks the very, you know, fundamental basis of our nature as we know it? And, you know,\n\n2:17:45.280 --> 2:17:50.160\n and how, what are the kinds of approaches we need to take to get there?\n\n2:17:50.160 --> 2:17:55.440\n Yeah, so in physics, the biggest challenge is to unify quantum mechanics with gravity.\n\n2:17:56.240 --> 2:18:02.640\n And I believe that once we have experimental evidence for how this happens in nature,\n\n2:18:04.320 --> 2:18:09.120\n in systems that have quantum mechanical effects, but also gravity is important,\n\n2:18:09.920 --> 2:18:17.040\n then the theory will fall into our lap, okay? But the mistake that is made by the community\n\n2:18:17.040 --> 2:18:25.200\n right now is to come up with the right theory from scratch. And, you know, Einstein gave the\n\n2:18:25.200 --> 2:18:30.720\n illusion that you can just sit in your office and understand nature, you know, when he came up with\n\n2:18:30.720 --> 2:18:38.400\n his general theory of relativity. But, you know, first of all, perhaps he was lucky, but it's not\n\n2:18:38.400 --> 2:18:42.880\n a rule. The rule is that you need evidence to guide you, especially when dealing with quantum\n\n2:18:42.880 --> 2:18:51.760\n mechanics, which is really not intuitive. And so there are two places where the two theories meet.\n\n2:18:52.320 --> 2:18:57.440\n One is black holes, and there is a puzzle there. It's called the information paradox.\n\n2:18:58.480 --> 2:19:02.640\n In principle, you can throw the Encyclopedia Britannica into a black hole. It's a lot of\n\n2:19:02.640 --> 2:19:12.720\n information. And then it will be gone because a black hole carries only three properties or\n\n2:19:12.720 --> 2:19:19.600\n qualities, the mass, the charge, and the spin, according to Einstein. But then when Hawking\n\n2:19:19.600 --> 2:19:26.560\n tried to bring in quantum mechanics to the game, he realized that black holes have a temperature\n\n2:19:26.560 --> 2:19:32.640\n and they radiate. This is called Hawking radiation. It was sort of anticipated by\n\n2:19:35.440 --> 2:19:41.120\n Jacob Bekenstein before him, and Hawking wanted to prove Bekenstein wrong and then figure this out.\n\n2:19:42.240 --> 2:19:48.800\n And so what it means is black holes eventually evaporate. And they evaporate into radiation that\n\n2:19:48.800 --> 2:19:53.840\n doesn't carry this information, according to Hawking's calculation. And then the question is,\n\n2:19:53.840 --> 2:19:59.600\n according to quantum mechanics, information must be preserved. So where did the information go\n\n2:20:00.240 --> 2:20:06.640\n if a black hole is gone? And where is the information that was encoded in the Encyclopedia\n\n2:20:06.640 --> 2:20:12.640\n when it went into the black hole? And to that question, we don't have an answer yet. It's one\n\n2:20:12.640 --> 2:20:17.920\n of those puzzles about black holes. And it touches on the interplay between quantum mechanics and\n\n2:20:17.920 --> 2:20:23.840\n gravity. Another important question is what happened at the beginning of the universe?\n\n2:20:24.480 --> 2:20:30.240\n What happened before the Big Bang? And by the way, on that, I should say, you know, there are some\n\n2:20:31.280 --> 2:20:37.760\n conjectures. In principle, if we figure it out, if we have a theory of quantum gravity,\n\n2:20:37.760 --> 2:20:43.440\n it's possible to imagine that we will figure out how to create a universe in the laboratory.\n\n2:20:43.440 --> 2:20:49.840\n And by irritating the vacuum, you might create a baby universe. And if we do that,\n\n2:20:50.640 --> 2:20:55.600\n it will offer a solution to what happened before the Big Bang. Perhaps the Big Bang emerged from\n\n2:20:55.600 --> 2:21:01.840\n the laboratory of another civilization. So it's like baby universes are being born out of\n\n2:21:01.840 --> 2:21:07.520\n laboratories. And inside the baby universe, you have a civilization that brings to existence a\n\n2:21:07.520 --> 2:21:13.120\n new baby universe. So just like humans, right? We have babies and they make babies. So in principle,\n\n2:21:13.120 --> 2:21:19.760\n that would solve the problem of why there was a Big Bang and also what happened before the Big\n\n2:21:19.760 --> 2:21:26.960\n Bang. So we came, our umbilical cord is connected to a laboratory of a civilization that produced\n\n2:21:26.960 --> 2:21:33.360\n our universe once it figured out quantum gravity, you know. It's baby Big Bangs all the way down.\n\n2:21:36.160 --> 2:21:40.320\n So if we collect data about how the universe started, we could potentially test\n\n2:21:40.320 --> 2:21:45.520\n theories of, or it can educate us about how to unify quantum mechanics and gravity.\n\n2:21:45.520 --> 2:21:49.680\n If we get any information about what happens near the singularity of a black hole,\n\n2:21:50.400 --> 2:21:56.800\n you know, if we get a sense of, you know, somehow we learn what happens at the same,\n\n2:21:56.800 --> 2:22:03.120\n that would educate. So there are places where we can search for evidence, but it's very challenging,\n\n2:22:03.120 --> 2:22:08.640\n I should say. And my point is, you know, the string theorists, they decided that they know\n\n2:22:08.640 --> 2:22:15.440\n how to approach the problem, that they don't have a single theory. There is a multitude of theories\n\n2:22:15.440 --> 2:22:21.040\n and it's not tightly constrained and they cannot make predictions about black holes or about the\n\n2:22:21.040 --> 2:22:27.200\n beginning of the universe. So at the moment I say we're at a loss. And the way I feel about this\n\n2:22:27.200 --> 2:22:32.880\n concept of the theory of everything, we should wait until we get enough evidence to guide us.\n\n2:22:32.880 --> 2:22:36.320\n And until then, you know, there are many important problems that we can address,\n\n2:22:36.320 --> 2:22:43.200\n you know. Why bang our head against the wall on a problem for which we have no guidance?\n\n2:22:43.200 --> 2:22:46.640\n Right. We don't have a good dance partner in terms of evidence. There's not.\n\n2:22:46.640 --> 2:22:47.040\n Exactly.\n\n2:22:47.040 --> 2:22:51.760\n I mean, it'd be interesting, just like you said, I mean, the lab is one place to create\n\n2:22:53.760 --> 2:22:58.720\n universes or black holes, but it'd be fascinating if there is indeed a black hole in our solar\n\n2:22:58.720 --> 2:23:03.440\n system that you can interact with. So the problem with the origin of the universe\n\n2:23:03.440 --> 2:23:07.600\n is all you can do is collect data about it, right? You can't interact with it.\n\n2:23:07.600 --> 2:23:13.200\n Well, you can, for example, detect gravitational waves that emerged from that. And, you know,\n\n2:23:13.200 --> 2:23:18.160\n there is an effort to do that and that could potentially tell us something. But yeah,\n\n2:23:18.800 --> 2:23:25.840\n it's a challenge and that's why we're stuck. So I should say, despite what physicists portray,\n\n2:23:25.840 --> 2:23:31.360\n that, you know, we live through an exceptional growth in our understanding of the universe,\n\n2:23:31.360 --> 2:23:36.240\n we're actually pretty much stuck, I would say, because we don't know the nature of the dark\n\n2:23:36.240 --> 2:23:40.640\n matter. Most of the matter in the universe, we don't know what it is. And we don't know how\n\n2:23:40.640 --> 2:23:45.760\n the universe started. We don't know what happens in the interior of a black hole.\n\n2:23:45.760 --> 2:23:50.240\n Because you've thought quite a bit about dark matter as well. Do you have any kind of hypothesis,\n\n2:23:50.240 --> 2:23:55.680\n interesting hypothesis? We already mentioned a few about what is dark matter and what are the\n\n2:23:55.680 --> 2:24:01.440\n possible paths that we could take to unlock the mystery of dark? What is dark matter?\n\n2:24:01.440 --> 2:24:07.040\n Yeah. So what we need is some anomalies that would hint what the nature of the dark matter is,\n\n2:24:07.040 --> 2:24:11.040\n or to detect it in the laboratory. There are lots of laboratory experiments searching,\n\n2:24:11.040 --> 2:24:15.040\n but it's like searching for a needle in a haystack, because there are so many possibilities\n\n2:24:15.040 --> 2:24:21.520\n for the type of particle that it may be. But maybe at some point, you know, we'll find either\n\n2:24:21.520 --> 2:24:26.240\n a particle or black holes as the dark matter, or something else. But at the moment...\n\n2:24:26.240 --> 2:24:30.240\n Can you also maybe, sorry to interrupt, comment about what is dark matter?\n\n2:24:30.240 --> 2:24:32.800\n Like what, it's just a name we assign to what?\n\n2:24:33.520 --> 2:24:40.720\n So most of the community believes that it's a particle that we haven't yet detected. It doesn't\n\n2:24:40.720 --> 2:24:46.000\n interact with light, so it's dark. But the question is, what does it interact with,\n\n2:24:46.000 --> 2:24:52.240\n and how can we find it? And for many years, physicists were guided by the idea that\n\n2:24:52.240 --> 2:24:57.360\n it's some extension of the standard model of particle physics. But then they said,\n\n2:24:57.360 --> 2:25:03.120\n oh, we will find some clues from the Large Hadron Collider about its nature. Or maybe\n\n2:25:03.120 --> 2:25:07.680\n it's related to supersymmetry, which is a new symmetry that we haven't found any evidence for.\n\n2:25:07.680 --> 2:25:13.360\n In both cases, the Large Hadron Collider did not give us any clues. And other people search for\n\n2:25:13.360 --> 2:25:18.560\n specific types of particles in the laboratory and didn't find any. A couple of years ago,\n\n2:25:19.120 --> 2:25:25.200\n actually, around the time that I worked on Oumuamua, I also worked on the possibility that\n\n2:25:25.760 --> 2:25:31.760\n the dark matter particles may have a small electric charge, which is a speculation, but\n\n2:25:32.000 --> 2:25:38.160\n nobody complained about it. And, you know, it was published and I regarded it more as\n\n2:25:38.160 --> 2:25:44.960\n of a speculation than the artificial origin of Oumuamua. And to me, I apply, you know,\n\n2:25:44.960 --> 2:25:48.800\n as far as I'm concerned, I apply the same scientific tools in both cases. There is an\n\n2:25:48.800 --> 2:25:55.040\n anomaly that led me to that discussion, which has to do with hydrogen being cold in the early\n\n2:25:55.040 --> 2:25:59.520\n universe more than we expected. So we suggested maybe the dark matter particles have some small\n\n2:25:59.520 --> 2:26:05.360\n charge. But then you deal with anomalies by exploring possibilities. That's the only way to\n\n2:26:05.360 --> 2:26:14.080\n do it, and then collecting more data to check those. And searching for technological signatures\n\n2:26:14.960 --> 2:26:23.520\n is the same as any other part of our scientific endeavor. We make hypotheses and we collect data,\n\n2:26:23.520 --> 2:26:27.120\n and I don't see any reason for having a taboo on this subject.\n\n2:26:27.120 --> 2:26:33.600\n In your childlike, open minded excitement and approach to science, you're, I think,\n\n2:26:33.600 --> 2:26:38.800\n to anyone listening to this, truly inspiring. I mean, the question I think is useful to ask\n\n2:26:38.800 --> 2:26:45.200\n is by way of advice for young people. A lot of young people listen to this, whether from all\n\n2:26:45.200 --> 2:26:53.680\n over the world, and teenagers, undergraduate students, even graduate students, even young\n\n2:26:53.680 --> 2:26:58.320\n faculty, even older faculty, they're all young at heart. Like there's many of them young at heart.\n\n2:26:58.320 --> 2:27:04.160\n Do you have advice for, but let's focus on the traditionally defined sort of young folks that\n\n2:27:04.160 --> 2:27:10.080\n kind of graduate. Do you have advice to give to young people like that today about life,\n\n2:27:10.560 --> 2:27:14.960\n maybe in general, maybe a life of curiosity in the sciences?\n\n2:27:14.960 --> 2:27:20.160\n Definitely. Well, first, I should confess that I enjoy working with young people much more than\n\n2:27:20.160 --> 2:27:26.880\n with senior people. And the reason is they don't carry a baggage of prejudice. They're not so\n\n2:27:26.880 --> 2:27:34.000\n self centered. They're open to exploration. My advice, I mean, one of the lessons that\n\n2:27:34.000 --> 2:27:40.720\n took me a while to learn, and I should say I lost important opportunities as a result of that. So\n\n2:27:40.720 --> 2:27:50.640\n I would regard it as a mistake on my behalf, was to believe experts. So, quote unquote. So on a\n\n2:27:50.640 --> 2:27:57.760\n on a number of occasions, I would come up with an original idea and then suggest it to an expert,\n\n2:27:57.760 --> 2:28:04.480\n someone that works in the same field for a while. And the expert would dismiss it most of the time\n\n2:28:04.480 --> 2:28:11.840\n because it's new and was not explored, not because of the merit. And then what happened to me several\n\n2:28:11.840 --> 2:28:17.520\n times is that someone else would listen to the conversation or would hear me suggesting it.\n\n2:28:17.520 --> 2:28:25.680\n And I would give up because the expert said no. And then that someone else would develop it so\n\n2:28:25.680 --> 2:28:31.680\n that it becomes the hottest thing in this field. And once it happened to me multiple times,\n\n2:28:31.680 --> 2:28:36.880\n I then realized the hell with the experts. They don't know what they're doing. They're\n\n2:28:36.880 --> 2:28:45.200\n just repeating them. They don't think creatively. They are being threatened by innovation. And it's\n\n2:28:45.200 --> 2:28:51.200\n the natural reaction of someone that cares about their ego more than about the matter\n\n2:28:52.000 --> 2:28:57.760\n that we are discussing. And so I said, I don't care how many likes I have on Twitter. I don't\n\n2:28:57.760 --> 2:29:03.200\n care whether the experts say one thing or another. I will basically exercise my judgment and do the\n\n2:29:03.200 --> 2:29:10.720\n best I can. Turns out that I'm wrong. I made a mistake. That's part of the scientific endeavor.\n\n2:29:10.720 --> 2:29:16.800\n And it took me a while to recognize that. And it was a lot of wasted opportunities. So to the\n\n2:29:16.800 --> 2:29:24.400\n young people, I would recommend don't listen to experts. Carve your own path. Now, of course,\n\n2:29:24.400 --> 2:29:30.160\n you will be wrong. You should learn from experience, just like kids do. But do it yourself.\n\n2:29:30.160 --> 2:29:39.840\n Your father died in 2017. Your mother died in 2019. Do you miss them?\n\n2:29:40.400 --> 2:29:41.360\n Very much so.\n\n2:29:42.800 --> 2:29:50.800\n Is there a memory, that fond memory that stands out? Or maybe what have you learned from them?\n\n2:29:50.800 --> 2:30:00.160\n From my mother, I mean, she was very much my inspiration for pursuing intellectual work,\n\n2:30:00.160 --> 2:30:08.000\n because she studied at the university. And then because of the Second World War,\n\n2:30:08.000 --> 2:30:15.680\n after the Second World War, she was born in Bulgaria. They immigrated to Israel. And she\n\n2:30:15.680 --> 2:30:24.640\n and she left university to work on a farm. And later in life, when all the kids left home,\n\n2:30:24.640 --> 2:30:30.720\n she went back to the university and finished the PhD. But she planted in me the intellectual\n\n2:30:30.720 --> 2:30:41.040\n curiosity and valuing learning or acquiring knowledge as a very important element in life.\n\n2:30:41.040 --> 2:30:49.120\n And my love with philosophy came from attending classes that she took at the university.\n\n2:30:50.160 --> 2:30:58.080\n When I was a teenager, I was fortunate to go to some of these and they inspired me later on. And\n\n2:30:58.080 --> 2:31:03.920\n I'm very different than my colleagues, as you can tell, because my upbringing was quite different.\n\n2:31:03.920 --> 2:31:08.320\n And the only reason I'm doing physics or astrophysics is because of circumstances.\n\n2:31:08.320 --> 2:31:17.440\n At age 18, I was asked to serve in the military. And the only way for me to pursue intellectual\n\n2:31:17.440 --> 2:31:25.920\n work was to work on physics, because that was the closest to philosophy. And I was good at physics.\n\n2:31:25.920 --> 2:31:30.960\n So they admitted me to an elite program called LPO that allowed me to finish my PhD\n\n2:31:30.960 --> 2:31:38.560\n at age 24 and to actually propose the first international project that was funded by the\n\n2:31:38.560 --> 2:31:45.120\n Star Wars initiative of Ronald Reagan. And that brought me to the US to visit Washington, DC,\n\n2:31:45.120 --> 2:31:51.520\n where we were funded from. And then on one of the visits, I went to the Institute for Advanced\n\n2:31:51.520 --> 2:31:59.200\n Study at Princeton and met John Bacall that later offered me a five year fellowship there. Under the\n\n2:31:59.200 --> 2:32:03.920\n under the condition that I'll switch to astrophysics. At which point, you know, I said,\n\n2:32:03.920 --> 2:32:09.440\n OK, I cannot give up on this opportunity. I'll do it. Switch to astrophysics. It felt like a forced\n\n2:32:10.080 --> 2:32:15.920\n marriage, kind of arranged marriage. And then I was offered the position at Harvard because\n\n2:32:15.920 --> 2:32:22.320\n nobody wanted that. They first selected someone else. And that someone said, I don't want to\n\n2:32:22.320 --> 2:32:27.760\n become a junior faculty at the Harvard Astronomy Department because the chance for being promoted\n\n2:32:27.760 --> 2:32:33.120\n are very small. So he took another job. And then I was second in line. They gave it to me. I didn't\n\n2:32:33.120 --> 2:32:39.120\n care much because I could go back to the farm any day, you know. And after three years, I was\n\n2:32:39.120 --> 2:32:46.160\n tenured. And eventually, a decade later, became the chair of this department and served for nine years\n\n2:32:46.160 --> 2:32:51.360\n as the chair of the astronomy department at Harvard. But at that point, it became clear\n\n2:32:51.360 --> 2:32:56.480\n to me that I'm actually married to the love of my life, even though it was an arranged marriage.\n\n2:32:56.480 --> 2:33:01.360\n There are many philosophical questions in astrophysics that we can address. But I'm still\n\n2:33:01.360 --> 2:33:07.920\n very different than my colleagues, you know, that were focusing on technical skills in getting to\n\n2:33:07.920 --> 2:33:17.280\n this job. So my mother was really extremely instrumental in planting the seeds of thinking\n\n2:33:17.280 --> 2:33:24.240\n about the big picture in me. Then my father, he was, you know, he was working in the farm.\n\n2:33:24.240 --> 2:33:28.480\n And we didn't speak much because we sort of understood each other without speaking.\n\n2:33:30.480 --> 2:33:39.920\n But what he gave me is a sense of, you know, that it's more important to do things than to\n\n2:33:39.920 --> 2:33:47.600\n talk about them. I love the, I mean, my apologies, but MIT mind and hand. I love that there's\n\n2:33:47.600 --> 2:33:54.320\n that the root of philosophy that you gain from your mom and the hand, that action is all that\n\n2:33:54.320 --> 2:34:00.720\n ultimately in the end matters from your dad. That's really powerful. If we could take a small\n\n2:34:00.720 --> 2:34:10.000\n detour into philosophy, is there by chance any books, authors, whether philosophical or not,\n\n2:34:10.000 --> 2:34:15.040\n you mentioned Sartre, that stand out to you that were formative in some small or big way,\n\n2:34:15.040 --> 2:34:20.640\n that perhaps you would recommend to others, maybe when you were very young or maybe later on in life?\n\n2:34:20.640 --> 2:34:26.480\n Well, actually, yeah, I, you know, I read the number of existentialists that\n\n2:34:27.920 --> 2:34:32.800\n appealed to me because they were authentic. You know, Sartre, you know, he declined the Nobel\n\n2:34:32.800 --> 2:34:39.920\n Prize, as we discussed, but he also was mocking people that pretend to be something better than\n\n2:34:39.920 --> 2:34:45.760\n they are. You know, he was living an authentic life that is sincere. And that's what appealed to me.\n\n2:34:45.760 --> 2:34:53.840\n And Albert Camus was another French philosopher that advocated existentialism. You know, that\n\n2:34:53.840 --> 2:34:58.960\n really appealed to me. That's probably my favorite existentialist, Camus. Yeah. Yeah. And he died at\n\n2:34:58.960 --> 2:35:07.200\n a young age in an accident, unfortunately. And then, you know, people like Nietzsche that, you\n\n2:35:07.200 --> 2:35:16.880\n know, broke conventions. And I noticed that Nietzsche is still extremely popular. You know,\n\n2:35:16.880 --> 2:35:25.440\n that's quite surprising. He appeals to the young people of today. It's the childlike wonder\n\n2:35:25.440 --> 2:35:30.960\n about the world. And he was unapologetic. You know, it's like most philosophers have a very\n\n2:35:30.960 --> 2:35:36.160\n strict adherence to terminology and to the practices, academic philosophers. And Nietzsche was full of\n\n2:35:36.160 --> 2:35:44.640\n contradictions. And he just, I mean, he was just this big kid with opinions and thought deeply\n\n2:35:44.640 --> 2:35:49.040\n about this world. And people are really attracted to that. And surprisingly, there's not enough\n\n2:35:49.040 --> 2:35:55.600\n people like that throughout history of philosophy. And that's why I think he's still drawn to them.\n\n2:35:55.600 --> 2:36:03.280\n Yeah. To me, what stands out is his statement that the best way to corrupt the mind of young people\n\n2:36:03.280 --> 2:36:11.600\n is to tell them that they should agree with the common view, you know. And, you know, it goes back\n\n2:36:11.600 --> 2:36:18.400\n to the thread that went throughout discussion. Yes. You've kind of suggested that we ought to\n\n2:36:18.400 --> 2:36:25.520\n be humble about our very own existence and that our existence lasts only a short time. We talked\n\n2:36:25.520 --> 2:36:34.480\n about you losing your father and your mother. Do you think about your own mortality? Are you afraid\n\n2:36:34.480 --> 2:36:39.680\n of death? I'm not afraid. You know what, Epicurus, actually Epicurus was a very wise person.\n\n2:36:41.520 --> 2:36:48.000\n According to Lucretius, Epicurus didn't leave anything in writing. But he said that he's never\n\n2:36:48.000 --> 2:36:56.160\n afraid of death because as long as he's around, death is not around. And when death will be around,\n\n2:36:56.160 --> 2:37:01.520\n he will not be around. So he will never meet death. So why should you be worried about something\n\n2:37:01.520 --> 2:37:06.240\n you will never meet? You know, and it's an interesting philosophy of life. You know,\n\n2:37:06.240 --> 2:37:09.360\n you shouldn't be afraid of something that you will never encounter, right?\n\n2:37:09.360 --> 2:37:13.920\n But there's a finiteness to this experience. We live every day.\n\n2:37:13.920 --> 2:37:19.840\n I mean, I think if we're being honest, we live every day as if it's going to last forever.\n\n2:37:20.880 --> 2:37:26.880\n We often kind of don't contemplate the fact that it ends. You kind of have plans and goals and you\n\n2:37:26.880 --> 2:37:31.760\n have these possibilities. You have a kind of lingering thought, especially as you get older\n\n2:37:31.760 --> 2:37:38.160\n and older and older, that this is, especially when you lose friends, then you start to realize,\n\n2:37:38.720 --> 2:37:43.600\n you know, it does end. But I don't know if you really are cognizant of that. I mean,\n\n2:37:43.600 --> 2:37:48.800\n because... But you have to be careful not to be depressed by it, because otherwise you lose the\n\n2:37:48.800 --> 2:37:55.520\n vitality, right? So I think the most important thing to draw from knowing that you are short lived\n\n2:37:56.160 --> 2:38:02.320\n is a sense of appreciation that you're alive. That's the first thing. But more importantly,\n\n2:38:02.320 --> 2:38:09.760\n a sense of modesty, because how can anyone be arrogant if they kept at the same time this\n\n2:38:09.760 --> 2:38:14.080\n notion that they are short lived? I mean, you cannot be arrogant, because anything that you\n\n2:38:14.080 --> 2:38:19.920\n advocate for, you know, you will not be around to do that in a hundred years. So people will\n\n2:38:19.920 --> 2:38:26.800\n just forget and move on, you know. And if you keep that in mind, you know, the Caesars in ancient\n\n2:38:26.800 --> 2:38:32.880\n Rome, they had a person next to them telling them, don't forget that you are mortal. You know,\n\n2:38:32.880 --> 2:38:37.840\n there was a person with that duty because the Caesars thought that they are all powerful,\n\n2:38:37.840 --> 2:38:47.040\n you know. And they had, for a good reason, someone they hired to whisper in their ear,\n\n2:38:47.040 --> 2:38:54.080\n don't forget that you are mortal. Yeah. Well, you're somebody, one of the most respected,\n\n2:38:55.120 --> 2:39:00.160\n famous scientists in the world, sitting on a farm, gazing up at the stars. So you seem like\n\n2:39:00.160 --> 2:39:05.120\n an appropriate person to ask the completely inappropriate question of, what do you think\n\n2:39:05.120 --> 2:39:11.040\n is the meaning of it all? What's the meaning of life? That's an excellent question. And if we ever\n\n2:39:11.040 --> 2:39:16.560\n find an alien that we can converse with, I would like to answer this. I would like to ask for an\n\n2:39:16.560 --> 2:39:21.680\n answer to this question because... Would they have a different opinion, you think? Well, they might be\n\n2:39:21.680 --> 2:39:27.760\n wiser because they lived around for a while, but I'm afraid they will be silent. I'm afraid they\n\n2:39:27.760 --> 2:39:38.000\n will not have a good answer. And I think it's the process that you should get satisfied by,\n\n2:39:38.000 --> 2:39:44.560\n the process of learning you should enjoy. Okay, so it's not so much that there is a meaning.\n\n2:39:45.280 --> 2:39:55.120\n In fact, there is, as far as I can tell, things just exist, you know. And I think it's inappropriate\n\n2:39:55.120 --> 2:40:01.600\n for us to assign a meaning for our existence because, as a civilization, we will eventually\n\n2:40:01.600 --> 2:40:10.080\n perish and nothing will be... Just another planet on which life died. And if you look at the big\n\n2:40:10.080 --> 2:40:17.520\n scheme of things, who cares? Who cares? And how can we assign significance to what we are doing?\n\n2:40:17.520 --> 2:40:23.600\n So if you said the meaning of life is this, well, it will not be around in a billion years. So\n\n2:40:23.600 --> 2:40:31.040\n it cannot be the meaning of life because nothing will be around. So I think we should just enjoy\n\n2:40:31.040 --> 2:40:39.920\n the process. And it's like many other things in life, you enjoy good food, okay? And you can enjoy\n\n2:40:39.920 --> 2:40:47.600\n learning. Why? Because it makes you appreciate better the environment that you live in.\n\n2:40:47.600 --> 2:40:54.400\n And sometimes people think religion, for example, is in conflict with science, spirituality.\n\n2:40:55.760 --> 2:41:04.480\n That's not true. If you see a watch and you look at it from the outside, you might say,\n\n2:41:04.480 --> 2:41:08.800\n oh, that's interesting. But then if you start to open it up and learn about how it works,\n\n2:41:08.800 --> 2:41:14.320\n you appreciate it more. So science is the way to learn about how the world works. And\n\n2:41:14.320 --> 2:41:21.440\n it's not in conflict to the meaning that you assign to all of this, but it helps you appreciate the\n\n2:41:21.440 --> 2:41:27.120\n world better. So in fact, I would think that a religious person should promote science because\n\n2:41:27.120 --> 2:41:34.400\n it gives you a better appreciation of what's around you. It's like if you buy in a grocery,\n\n2:41:34.400 --> 2:41:42.240\n buy something, a bunch of fruits that are packed together, and you can't see from the outside\n\n2:41:42.240 --> 2:41:47.120\n exactly what kind of fruits are inside. But if you open it up and study, you appreciate better\n\n2:41:47.120 --> 2:41:51.600\n the merchandise that you get, right? So you pay the same amount of money, but at least you know\n\n2:41:51.600 --> 2:41:56.400\n what's inside. So why don't we figure out what the world is about, what the universe contains,\n\n2:41:56.400 --> 2:42:02.480\n what is the dark matter? It will help us appreciate the bigger picture. And then you can assign\n\n2:42:02.480 --> 2:42:11.520\n your own flavor to what it means. Ali, I think I'm truly grateful that a person like you,\n\n2:42:11.520 --> 2:42:19.440\n exists at the center of the scientific community, gives me faith and hope about this big journey\n\n2:42:19.440 --> 2:42:26.880\n that we call science. So thank you for writing the book you wrote recently. You have many other books\n\n2:42:26.880 --> 2:42:32.400\n and articles that I think people should definitely read. And thank you for wasting all this time with\n\n2:42:32.400 --> 2:42:36.480\n me. It's truly an honor. Thank you so much. It was not a waste at all. And thank you for having me.\n\n2:42:36.480 --> 2:42:43.120\n I learned a lot from your questions and your remarks. Thank you. Thank you. Thanks for listening to this\n\n2:42:43.120 --> 2:42:48.400\n conversation with Avi Loeb. And thank you to our sponsors, Zero Fasting App for intermittent\n\n2:42:48.400 --> 2:42:55.440\n fasting, Element Electro Light Drink, Sun Basket Meal Delivery Service, and Pessimist Archive\n\n2:42:55.440 --> 2:43:03.120\n History Podcast. So the choice is a fasting app, fasting fuel, fast breaking, delicious meals,\n\n2:43:03.120 --> 2:43:09.040\n and a history podcast that has very little, as far as I know, to do with fasting. Choose wisely,\n\n2:43:09.040 --> 2:43:14.320\n my friends. And if you wish, click the sponsor links below to get a discount and to support\n\n2:43:14.320 --> 2:43:20.480\n this podcast. And now let me leave you some words from Albert Einstein. The important thing is not\n\n2:43:20.480 --> 2:43:27.200\n to stop questioning. Curiosity has its own reason for existence. One cannot help but be in awe when\n\n2:43:27.200 --> 2:43:34.160\n he contemplates the mysteries of eternity, of life, of the marvelous structure of reality. It is enough\n\n2:43:34.160 --> 2:43:40.480\n if one tries merely to comprehend a little of this mystery every day. Thank you for listening\n\n2:43:40.480 --> 2:43:40.480\n and hope to see you next time.\n\n"
}