{
  "title": "Nationalism Debate: Yaron Brook and Yoram Hazony | Lex Fridman Podcast #256",
  "id": "Q24cpnHzx8I",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.640\n The following is a conversation with Yoram Brook and Yoram Hazoni.\n\n00:04.640 --> 00:09.840\n This is Yoram's third time on this podcast and Yoram's first time.\n\n00:09.840 --> 00:15.560\n Yoram Brook is an Objectivist Philosopher, Chairman of the Ayn Rand Institute, host of\n\n00:15.560 --> 00:21.920\n the Yoram Brook Show, and the coauthor of Free Market Revolution and Equal is Unfair.\n\n00:21.920 --> 00:28.960\n Yoram Hazoni is a National Conservatism thinker, Chairman of the Edmund Burke Foundation that\n\n00:28.960 --> 00:32.400\n hosted the National Conservatism Conference.\n\n00:32.400 --> 00:39.320\n He is also the host of the NatCon Talk and author of The Virtue of Nationalism and an\n\n00:39.320 --> 00:44.040\n upcoming book called Conservatism, A Rediscovery.\n\n00:44.040 --> 00:51.120\n Allow me to say a few words about each part of the two word title of this episode, Nationalism\n\n00:51.120 --> 00:52.760\n Debate.\n\n00:52.760 --> 00:58.720\n First Debate, I would like to have a few conversations this year that are a kind of debate with two\n\n00:58.720 --> 01:03.640\n or three people that hold differing views on a particular topic but come to the table\n\n01:03.640 --> 01:09.720\n with respect for each other and a desire to learn and discover something interesting together\n\n01:09.720 --> 01:14.400\n through the empathetic exploration of the tension between their ideas.\n\n01:14.400 --> 01:18.040\n This is not strictly a debate, it is simply a conversation.\n\n01:18.040 --> 01:23.200\n There is no structure, there is no winners, except of course just a bit of trash talking\n\n01:23.200 --> 01:24.860\n to keep it fun.\n\n01:24.860 --> 01:29.200\n Some of these topics will be very difficult and I hope you can keep an open mind and have\n\n01:29.200 --> 01:34.920\n patience with me as the kind of moderator who tries to bring out the best in each person\n\n01:34.920 --> 01:36.960\n and the ideas discussed.\n\n01:36.960 --> 01:39.640\n Okay that's my comment on the word Debate.\n\n01:39.640 --> 01:42.060\n Now onto the word Nationalism.\n\n01:42.060 --> 01:48.120\n This debate could have been called Nationalism versus Individualism or National Conservatism\n\n01:48.120 --> 01:54.080\n versus Individualism or just Conservatism versus Individualism.\n\n01:54.080 --> 01:58.200\n As we discussed in this episode, these words have slightly different meanings depending\n\n01:58.200 --> 01:59.660\n on who you ask.\n\n01:59.660 --> 02:04.140\n This is especially true, I think, for any word that ends in \"-ism\".\n\n02:04.140 --> 02:08.240\n I personally enjoy the discussion of the meaning of such philosophical words.\n\n02:08.240 --> 02:13.360\n I don't think it's possible to arrive at a perfect definition that everybody agrees with,\n\n02:13.360 --> 02:19.520\n but the process of trying to do so for a bit is interesting and productive, at least to\n\n02:19.520 --> 02:20.560\n me.\n\n02:20.560 --> 02:26.260\n As long as we don't get stuck there, as some folks sometimes do in these conversations.\n\n02:26.260 --> 02:31.320\n This is the Lex Readman Podcast, to support it please check out our sponsors in the description\n\n02:31.320 --> 02:37.320\n and now here's my conversation with Yoram Brooke and Yoram Hosoni.\n\n02:37.320 --> 02:41.520\n I attended the excellent debate between the two of you yesterday at UT Austin.\n\n02:41.520 --> 02:47.020\n The debate was between ideas of Conservatism, represented by Yoram Hosoni, and ideas of\n\n02:47.020 --> 02:51.080\n Individualism, represented by Yoram Brooke.\n\n02:51.080 --> 02:53.080\n Let's start with the topics of the debate.\n\n02:53.080 --> 02:58.320\n Yoram, how do you define Conservatism, maybe in the way you were thinking about it yesterday?\n\n02:58.320 --> 03:02.360\n What to you are some principles of Conservatism?\n\n03:02.360 --> 03:07.380\n Let me define it and then we can get into principles if you want.\n\n03:07.380 --> 03:14.040\n When I talk about political Conservatism, I'm talking about a political standpoint that\n\n03:14.040 --> 03:22.000\n regards the recovery, elaboration, and restoration of tradition as the key to maintaining a nation\n\n03:22.000 --> 03:24.780\n and strengthening it through time.\n\n03:24.780 --> 03:29.520\n This is something that if you have time to talk about it like we do on the show, it's\n\n03:29.520 --> 03:35.800\n worth emphasizing that Conservatism is not like Liberalism or Marxism.\n\n03:35.800 --> 03:42.200\n Liberalism and Marxism are both kind of universal theories and they claim to be able to tell\n\n03:42.200 --> 03:47.160\n you what's good for human beings at all times in all places.\n\n03:47.160 --> 03:52.520\n And Conservatism is a little bit different because it's going to carry different values\n\n03:52.520 --> 03:54.960\n in every nation, in every tribe.\n\n03:54.960 --> 04:01.400\n Even every family, you can say, has somewhat different values and these loyalty groups,\n\n04:01.400 --> 04:03.560\n they compete with one another.\n\n04:03.560 --> 04:04.720\n That's the way human beings work.\n\n04:04.720 --> 04:08.680\n So it's deeply rooted in history of that particular area of land.\n\n04:08.680 --> 04:14.320\n Well, I wouldn't necessarily say land, you're right that many forms of Conservatism are\n\n04:14.320 --> 04:16.340\n tied to a particular place.\n\n04:16.340 --> 04:22.200\n So how does the implementation of Conservatism to you differ from the ideal of Conservatism,\n\n04:22.200 --> 04:26.200\n the implementations you've seen of political Conservatism in the United States and the\n\n04:26.200 --> 04:27.200\n rest of the world?\n\n04:27.200 --> 04:32.600\n Just to give some context, because it's a loaded term, like most political terms.\n\n04:32.600 --> 04:36.320\n So when people think about conservative in the United States, they think about the Republican\n\n04:36.320 --> 04:41.920\n Party, what, can you kind of disambiguate some of this, what are we supposed to think\n\n04:41.920 --> 04:42.920\n about?\n\n04:42.920 --> 04:44.720\n Yeah, that's a really important question.\n\n04:44.720 --> 04:52.800\n Usually the word conservative is associated with Edmund Burke and with the English common\n\n04:52.800 --> 04:54.800\n law tradition.\n\n04:54.800 --> 05:00.560\n Going back centuries and centuries, there's kind of a classical English conservative tradition\n\n05:00.560 --> 05:11.160\n that goes Fortescue, Hooker, Coke, Seldon, Hale, Burke, Blackstone before Burke.\n\n05:11.160 --> 05:17.060\n If you take that kind of as a benchmark and you compare it, then you can compare it to\n\n05:17.060 --> 05:23.000\n things like the American Federalist Party at the time of the American founding is in\n\n05:23.000 --> 05:29.240\n many respects very much in keeping with that tradition.\n\n05:29.240 --> 05:36.360\n As you go forward, there's an increasing mix of liberalism into conservatism.\n\n05:36.360 --> 05:44.480\n I think by the time you get to the 1960s with William Buckley and Frank Meyer, the jargon\n\n05:44.480 --> 05:45.640\n term is fusionism.\n\n05:45.640 --> 05:52.120\n By the time you get there, it's arguable that their conservatism isn't very conservative\n\n05:52.120 --> 05:58.580\n anymore, that it's kind of a public liberalism mixed with a private conservatism.\n\n05:58.580 --> 06:04.240\n So a lot of the debate that we have today about what does the word conservatism actually\n\n06:04.240 --> 06:09.840\n mean, a lot of the confusion comes from that, comes from the fact that on the one hand,\n\n06:09.840 --> 06:17.640\n we have people who use the term, I think properly historically to refer to this common law tradition\n\n06:17.640 --> 06:22.480\n of which Burke was a spokesman, but there are lots of other people who when they say\n\n06:22.480 --> 06:27.280\n conservative, they just mean liberal.\n\n06:27.280 --> 06:30.600\n I think that's a big problem.\n\n06:30.600 --> 06:36.520\n It's a problem just to have an intelligent debate is difficult when people are using\n\n06:36.520 --> 06:39.560\n the word almost too antithetical.\n\n06:39.560 --> 06:42.400\n What would you say the essential idea of conservatism is time?\n\n06:42.400 --> 06:44.280\n You mentioned your father's a physicist.\n\n06:44.280 --> 06:50.480\n So a lot of physicists when they form models of the universe, they don't consider time.\n\n06:50.480 --> 06:53.280\n So everything is dealt with instantaneously.\n\n06:53.280 --> 06:58.880\n A particle is represented fully by its current state, velocity and position.\n\n06:58.880 --> 07:06.920\n You're saying, so you're arguing with all of physics and your father, as we always do,\n\n07:06.920 --> 07:10.200\n that their time matters in conservatism.\n\n07:10.200 --> 07:14.480\n That's the fundamental element is the full history matters and you cannot separate the\n\n07:14.480 --> 07:19.000\n individual from the history, from the roots that they come from.\n\n07:19.000 --> 07:25.320\n The parallel in political theory is what's called rationalism.\n\n07:25.320 --> 07:28.280\n I guess we'll probably talk about that some.\n\n07:28.280 --> 07:31.460\n Rationalism is kind of an instantaneous, timeless thing.\n\n07:31.460 --> 07:36.480\n Before I mentioned that liberalism and various enlightenment theories, they don't include\n\n07:36.480 --> 07:37.580\n time at all.\n\n07:37.580 --> 07:42.840\n Their goal is to say, look, there's such a thing as universal human reason.\n\n07:42.840 --> 07:47.840\n All human beings, if they reason properly, will come to the same conclusions.\n\n07:47.840 --> 07:51.600\n If that's true, then it removes the time consideration.\n\n07:51.600 --> 07:57.680\n It removes tradition and context because everywhere where you are at any time, you ought to be\n\n07:57.680 --> 08:03.580\n able to use reason and come to the same conclusions about politics or morals.\n\n08:03.580 --> 08:12.160\n So that's a theory like Immanuel Kant or John Locke is an example, Hobbes is an example.\n\n08:12.160 --> 08:19.340\n That kind of political theorizing really does say at a given instant, we can know pretty\n\n08:19.340 --> 08:23.560\n much everything that we need to know, at least the big things.\n\n08:23.560 --> 08:26.920\n And conservatism is the opposite.\n\n08:26.920 --> 08:33.400\n It's a traditionalist view, exactly as you say, that says that history is crucial.\n\n08:33.400 --> 08:41.120\n So you're on, you say that history is interesting, but perhaps not crucial if in the context\n\n08:41.120 --> 08:42.120\n of individualism.\n\n08:42.120 --> 08:47.120\n No, I mean, I think there's a false dichotomy he presented here, and that is that one view\n\n08:47.120 --> 08:53.180\n holds that you can derive anything from a particular historical path and kind of an\n\n08:53.180 --> 08:54.800\n empirical view.\n\n08:54.800 --> 08:57.360\n And if we know the history, we know where we should be tomorrow.\n\n08:57.360 --> 09:00.100\n We know where we should stand today.\n\n09:00.100 --> 09:04.640\n And the other path is we ignore history, we ignore facts, we ignore what's going on.\n\n09:04.640 --> 09:10.640\n We can derive from some a priori axioms, we can derive a truth right now.\n\n09:10.640 --> 09:11.640\n And both are false.\n\n09:11.640 --> 09:14.060\n Both of those views, in my view, are false.\n\n09:14.060 --> 09:19.520\n And you know, Ayn Rand and I reject both of those views.\n\n09:19.520 --> 09:23.440\n And I think the better thinkers of the Enlightenment did as well, although they sometimes fall\n\n09:23.440 --> 09:25.920\n into the trap of appearing like rationalists.\n\n09:25.920 --> 09:33.680\n And Jorm and I agree on one thing, and that is that Kant is one of, you know, we've talked\n\n09:33.680 --> 09:36.840\n about this in the past, Alex, but we both hate Kant.\n\n09:36.840 --> 09:44.520\n We both think Kant is, I at least think Kant is probably the most destructive philosopher\n\n09:44.520 --> 09:49.120\n since Plato, who was pretty destructive himself.\n\n09:49.120 --> 09:52.960\n And part of the problem is that Kant divorces reason from reality.\n\n09:52.960 --> 09:55.040\n That is, he divorces reason from history.\n\n09:55.040 --> 09:59.480\n He divorces reason from experience, because we don't have direct experience of reality\n\n09:59.480 --> 10:01.040\n according to Kant, right?\n\n10:01.040 --> 10:03.280\n We're removed from that direct experience.\n\n10:03.280 --> 10:09.880\n But I view Kant as the anti Enlightenment, that is, I view Kant as the destroyer of good\n\n10:09.880 --> 10:11.480\n Enlightenment thinking.\n\n10:11.480 --> 10:18.240\n And I acknowledge a lot of history of philosophy, people who do history of philosophy view Kant\n\n10:18.240 --> 10:21.800\n as the embodiment of the Enlightenment, that is the ultimate.\n\n10:21.800 --> 10:22.960\n But I think that's a mistake.\n\n10:22.960 --> 10:28.840\n I think both Rousseau and Kant are fundamentally the goal, the mission in life is to destroy\n\n10:28.840 --> 10:30.380\n the Enlightenment.\n\n10:30.380 --> 10:33.840\n So my view is neither of those options are the right option.\n\n10:33.840 --> 10:39.040\n That is, the true reason based, reason is not divorced from reality.\n\n10:39.040 --> 10:40.080\n It's quite the opposite.\n\n10:40.080 --> 10:41.080\n Reason is a tool.\n\n10:41.080 --> 10:45.740\n It's a faculty of identifying and integrating what?\n\n10:45.740 --> 10:52.360\n It's identifying and integrating the facts of reality as we know them through sense perception\n\n10:52.360 --> 10:55.860\n or through the study of history, through what actually happened.\n\n10:55.860 --> 10:58.140\n So it's the integration of those facts.\n\n10:58.140 --> 11:00.360\n It's the knowledge of that history.\n\n11:00.360 --> 11:06.080\n And then what we do is we abstract away principles based on what's worked in the past, what hasn't\n\n11:06.080 --> 11:10.920\n worked in the past, the consequences of different ideas, different past, different actions.\n\n11:10.920 --> 11:14.720\n We abstract away principles that then can be universal.\n\n11:14.720 --> 11:15.720\n Not always.\n\n11:15.720 --> 11:16.720\n We make mistakes, right?\n\n11:16.720 --> 11:19.640\n We can come up with a universal principle, it turns out it's not.\n\n11:19.640 --> 11:25.160\n But if we have the whole scope of human history, we can derive principles as we do in life,\n\n11:25.160 --> 11:30.600\n as individuals, we derive principles that are then truths that we can live by, but you\n\n11:30.600 --> 11:32.160\n don't do that by ignoring history.\n\n11:32.160 --> 11:36.960\n You do that by learning history, by understanding history, by understanding in a sense tradition\n\n11:36.960 --> 11:40.000\n and where it leads to, and then trying to do better.\n\n11:40.000 --> 11:44.200\n And I think good thinkers are constantly trying to do better based on what they know about\n\n11:44.200 --> 11:46.240\n the past and what they know about the present.\n\n11:46.240 --> 11:53.720\n What's the difference between studying history on a journey of reason and tradition?\n\n11:53.720 --> 11:57.680\n So you mentioned that Burke understood that reason begins with an inherited tradition\n\n11:57.680 --> 11:58.680\n yesterday.\n\n11:58.680 --> 12:03.620\n So what's the difference between studying history, but then being free to go any way\n\n12:03.620 --> 12:12.600\n you want and tradition where it feels more, I don't want to say a negative term like burden,\n\n12:12.600 --> 12:18.960\n but there's more of a momentum that forces you to go the same way as your ancestors.\n\n12:18.960 --> 12:23.640\n It's the recognition that people are wrong, often are wrong.\n\n12:23.640 --> 12:25.000\n Including parents?\n\n12:25.000 --> 12:28.640\n Including your parents, including your teachers, including everybody.\n\n12:28.640 --> 12:34.080\n Everybody is potentially wrong, and that you can't accept anybody just because they happen\n\n12:34.080 --> 12:35.880\n to come before you.\n\n12:35.880 --> 12:39.400\n That is, you have to evaluate and judge, and you have to have a standard by which to evaluate\n\n12:39.400 --> 12:44.120\n and judge the actions of those who came before you, whether they are your parents, whether\n\n12:44.120 --> 12:49.120\n they are the state in which you happen to be born, whether they are somebody on the\n\n12:49.120 --> 12:51.000\n other side of planet Earth.\n\n12:51.000 --> 12:52.960\n You can judge them if you have a standard.\n\n12:52.960 --> 12:57.560\n And my standard, and I think the right standard, is human well being.\n\n12:57.560 --> 13:03.600\n That which is good for human beings, qua human beings, is the standard by which we judge.\n\n13:03.600 --> 13:07.960\n I can say that certain periods of history were bad.\n\n13:07.960 --> 13:08.960\n They happened.\n\n13:08.960 --> 13:09.960\n It's important to study them.\n\n13:09.960 --> 13:14.460\n It's important to understand what they did that made them bad so we cannot do that again.\n\n13:14.460 --> 13:17.640\n And I can say certain cultures, certain periods in time were good.\n\n13:17.640 --> 13:18.640\n Why?\n\n13:18.640 --> 13:21.480\n Because they promoted human well being and human flourishing.\n\n13:21.480 --> 13:22.480\n That's the standard.\n\n13:22.480 --> 13:26.280\n To derive from that, okay, what is it that made a particular culture good?\n\n13:26.280 --> 13:30.160\n What is it that made that particular culture positive in terms of human well being and\n\n13:30.160 --> 13:31.400\n human flourishing?\n\n13:31.400 --> 13:32.400\n What made this bad?\n\n13:32.400 --> 13:35.000\n And hopefully from that, I can derive a principle.\n\n13:35.000 --> 13:39.400\n Okay, if I want human flourishing and human well being in the future, I want to be more\n\n13:39.400 --> 13:41.360\n like these guys and less like those guys.\n\n13:41.360 --> 13:45.400\n I want to derive what is the principle that will guide me in the future.\n\n13:45.400 --> 13:47.680\n That's I think how human knowledge ultimately develops.\n\n13:47.680 --> 13:53.440\n I think people often make a mistake, I'm not saying your own, but lots of people don't\n\n13:53.440 --> 13:58.620\n actually read the original sources and so what happens is people will attack conservatives\n\n13:58.620 --> 14:02.960\n assuming that conservatives think that whatever comes from the past is right.\n\n14:02.960 --> 14:07.520\n And actually, it's very difficult to find a thinker who actually says something like\n\n14:07.520 --> 14:08.520\n that.\n\n14:08.520 --> 14:15.580\n Seldon or Burke, the big conservative theorists hooker, they're all people who understand\n\n14:15.580 --> 14:21.880\n that the tradition carries with it mistakes that were made in the past.\n\n14:21.880 --> 14:27.120\n And this is actually I think an important part of their empiricism is that they see\n\n14:27.120 --> 14:31.240\n the search for truth as something a society does by trial and error.\n\n14:31.240 --> 14:36.600\n And what that means is that in any given moment, you have to be aware of the possibility that\n\n14:36.600 --> 14:39.840\n things that you've inherited are actually false.\n\n14:39.840 --> 14:46.400\n And the job of the political thinker or the jurist or the philosopher is not to dig in\n\n14:46.400 --> 14:50.080\n and say whatever it is that we've inherited is right.\n\n14:50.080 --> 14:57.120\n The job is to look at the society as a whole and say, look, we have this job of first of\n\n14:57.120 --> 15:01.280\n all conservation, just making sure that we don't lose good things that we've had.\n\n15:01.280 --> 15:06.080\n And second, seeing if we can repair things in order to improve them where it's necessary\n\n15:06.080 --> 15:07.920\n or where it's possible.\n\n15:07.920 --> 15:11.000\n And that process is actually a creative process.\n\n15:11.000 --> 15:15.160\n This is a way in which I think it is similar to Jeroen's philosophy that you take the\n\n15:15.160 --> 15:21.120\n inherited tradition and you look for a way that you can shape it in order to make it\n\n15:21.120 --> 15:25.760\n something better than it was.\n\n15:25.760 --> 15:28.120\n That's a baseline for what we call conservatism.\n\n15:28.120 --> 15:29.120\n It's not, yeah.\n\n15:29.120 --> 15:30.120\n Just a comment.\n\n15:30.120 --> 15:35.120\n So the trial and error, the errors is, you're proud of the errors.\n\n15:35.120 --> 15:37.000\n It's a feature, not a bug.\n\n15:37.000 --> 15:40.320\n So you mentioned trial and error a few times yesterday, it's a really interesting kind\n\n15:40.320 --> 15:41.600\n of idea.\n\n15:41.600 --> 15:48.120\n It's basically accepting that the journey is going to have flaws as opposed to saying,\n\n15:48.120 --> 15:55.640\n I mean, the conclusion there is the current system is flawed and it will always be flawed\n\n15:55.640 --> 15:57.440\n and you try to improve it.\n\n15:57.440 --> 16:06.060\n When you listen to your on talk, there's much more of an optimism for the system being perfect\n\n16:06.060 --> 16:09.640\n now or potentially soon, or it could be perfect.\n\n16:09.640 --> 16:15.580\n And to me, the way I heard it is almost like accepting that the system is flawed and through\n\n16:15.580 --> 16:25.980\n trial and error will improve and Jeroen says, no, we can have a perfection now.\n\n16:25.980 --> 16:27.240\n That's the way it sounds to me.\n\n16:27.240 --> 16:28.240\n Yeah.\n\n16:28.240 --> 16:29.240\n And I think that's right.\n\n16:29.240 --> 16:34.880\n I think the difference is that at some point, just like in science, I think one can stop\n\n16:34.880 --> 16:40.160\n the trial and error and say, I can now see a pattern here.\n\n16:40.160 --> 16:45.920\n I can see that certain actions lead to bad consequences, certain actions lead to good\n\n16:45.920 --> 16:47.240\n consequences.\n\n16:47.240 --> 16:54.000\n Let me try to abstract away what is it that is good and what is it that is bad and build\n\n16:54.000 --> 16:56.920\n a system around what is good and reject what is bad.\n\n16:56.920 --> 17:00.760\n I think ultimately, if you read the founding fathers and whether we call them conservatives\n\n17:00.760 --> 17:05.080\n or individuals, what the founding fathers actually did, all of them, I think, is study\n\n17:05.080 --> 17:06.080\n history.\n\n17:06.080 --> 17:07.080\n They all did.\n\n17:07.080 --> 17:08.080\n They all talk about history.\n\n17:08.080 --> 17:14.480\n They all talk about examples of other cultures, whether they go back to the Republic in Venice\n\n17:14.480 --> 17:17.840\n or back to the ancient Greeks.\n\n17:17.840 --> 17:18.840\n They studied these.\n\n17:18.840 --> 17:20.800\n They learned lessons from them.\n\n17:20.800 --> 17:24.560\n They try to figure out what has worked in the past and what hasn't and try to derive\n\n17:24.560 --> 17:25.560\n principles.\n\n17:25.560 --> 17:32.440\n They got pretty close to what I would consider kind of an ideal, but they didn't get it\n\n17:32.440 --> 17:33.720\n completely right.\n\n17:33.720 --> 17:38.360\n Here we sit 200 and something years after the Declaration and after the Constitution.\n\n17:38.360 --> 17:41.320\n I think we can look back and say, okay, well, what did they get right?\n\n17:41.320 --> 17:47.040\n What did they get wrong based on how is it done and where are the flaws and we can improve\n\n17:47.040 --> 17:48.320\n on it.\n\n17:48.320 --> 17:56.680\n I think we can get closer to perfection based on those kind of observations, based on that\n\n17:56.680 --> 18:00.640\n kind of abstraction, that kind of discovery of what is true.\n\n18:00.640 --> 18:05.120\n Just like at some point, you do the experiments, you do the trial and error, and now you come\n\n18:05.120 --> 18:07.160\n up with a scientific principle.\n\n18:07.160 --> 18:11.600\n It is true that 100 years later, you might discover that, hey, I missed something, there's\n\n18:11.600 --> 18:19.720\n something, but to not take the full lesson, to insist on incrementalism, to insist on\n\n18:19.720 --> 18:23.280\n we're just going to tinker with the system instead of saying, no, there's something really\n\n18:23.280 --> 18:30.400\n wrong with having a king, there's something really wrong with not having any representation,\n\n18:30.400 --> 18:36.920\n whatever the standard needs to be in the name of we don't want to move too fast, I think\n\n18:36.920 --> 18:37.920\n is a mistake.\n\n18:37.920 --> 18:45.120\n The problem with trial and error in politics is that we're talking about human life, right?\n\n18:45.120 --> 18:51.440\n So there was a big trial around communism, and 100 million people paid the price for\n\n18:51.440 --> 18:52.440\n the trial.\n\n18:52.440 --> 18:56.520\n I could have told them in advance, as did many people, that it would not work.\n\n18:56.520 --> 19:01.440\n There are principles of human nature, principles that we can study from history, principles\n\n19:01.440 --> 19:04.160\n about economics and other aspects.\n\n19:04.160 --> 19:05.160\n Well, we know it's not going to work.\n\n19:05.160 --> 19:06.680\n You don't need to try it again.\n\n19:06.680 --> 19:09.920\n We've had communal arrangements throughout history.\n\n19:09.920 --> 19:13.920\n There was an experiment with fascism, and there have been experiments with all kinds\n\n19:13.920 --> 19:15.560\n of political systems.\n\n19:15.560 --> 19:17.480\n Okay, we've done them.\n\n19:17.480 --> 19:20.700\n Sad that we did them, because many of us knew they wouldn't work.\n\n19:20.700 --> 19:26.560\n We should learn the lesson, and I think that all of history now converges on one lesson,\n\n19:26.560 --> 19:31.060\n and that is what we need to do is build systems that protect individual freedom.\n\n19:31.060 --> 19:32.100\n That is the core.\n\n19:32.100 --> 19:36.960\n That's what ultimately leads to human flourishing and human success and human achievement, and\n\n19:36.960 --> 19:41.040\n to the extent that we place anything above that individual, whether it's the state, whether\n\n19:41.040 --> 19:45.720\n it's the ethnicity, whether it's the race, whether it's the bourgeois, whatever it happens\n\n19:45.720 --> 19:49.960\n to be, class or whatever, whenever we place something above the individual, the consequence\n\n19:49.960 --> 19:50.960\n is negative.\n\n19:50.960 --> 19:57.760\n That's one of these principles that I think we can derive from studying 3,000 years of\n\n19:57.760 --> 20:00.760\n civilization.\n\n20:00.760 --> 20:03.680\n It's tragic, I think, because we're going to keep experimenting, sadly.\n\n20:03.680 --> 20:04.840\n I see it, right?\n\n20:04.840 --> 20:06.960\n I'm not winning this battle.\n\n20:06.960 --> 20:08.560\n I'm losing the battle.\n\n20:08.560 --> 20:11.400\n We're going to keep experimenting with different forms of collectivism, and we're going to\n\n20:11.400 --> 20:17.000\n keep paying the price in human life and in missed opportunities for human flourishing\n\n20:17.000 --> 20:21.040\n and human success and human wealth and prosperity.\n\n20:21.040 --> 20:23.480\n Let's take communism as a good example.\n\n20:23.480 --> 20:27.400\n None of the major conservative thinkers would say, you know what's a good idea?\n\n20:27.400 --> 20:33.760\n A good idea would be to experiment by raising everything that we've inherited and starting\n\n20:33.760 --> 20:34.760\n from scratch.\n\n20:34.760 --> 20:40.520\n I mean, that's the conservative complaint or accusation against rationalists as opposed\n\n20:40.520 --> 20:41.520\n to empiricists.\n\n20:41.520 --> 20:46.880\n I mean, using rationalism, let's take Descartes kind of as a benchmark.\n\n20:46.880 --> 20:49.280\n Can you also maybe define rationalism?\n\n20:49.280 --> 20:50.280\n Yeah.\n\n20:50.280 --> 20:54.920\n These are two terms that are in philosophy, especially in epistemology.\n\n20:54.920 --> 20:58.080\n They're often compared to one another.\n\n20:58.080 --> 21:04.000\n Jeroen said that it's a false dichotomy, and maybe it is a bit exaggerated, but that doesn't\n\n21:04.000 --> 21:08.000\n mean it's not useful for conceptualizing the domain.\n\n21:08.000 --> 21:15.880\n So a rationalist is somebody like Descartes who says, I'm going to set aside, I'm going\n\n21:15.880 --> 21:20.960\n to try to set aside everything I know, everything I've inherited, I'm going to start from scratch.\n\n21:20.960 --> 21:27.800\n And he explicitly says, in evaluating the inheritance of the past, he explicitly says,\n\n21:27.800 --> 21:30.600\n you take a look at the histories that we have, they're not reliable.\n\n21:30.600 --> 21:34.680\n You take a look at the moral and the scientific writings that we receive, they're not very\n\n21:34.680 --> 21:35.680\n good.\n\n21:35.680 --> 21:41.740\n His baseline is to look very critically at the past and say, look, I'm evaluating it.\n\n21:41.740 --> 21:44.660\n I think all in all, it's just not worth very much.\n\n21:44.660 --> 21:50.840\n And so whatever I do, beginning from scratch, is going to be better as long as, and here's\n\n21:50.840 --> 21:59.240\n his caveat, as long as I'm proceeding from self evident assumptions, from self evident\n\n21:59.240 --> 22:01.120\n premises, things that you can't argue against.\n\n22:01.120 --> 22:03.080\n I think, therefore, I am.\n\n22:03.080 --> 22:07.400\n And then from there, deducing what he calls infallible conclusions.\n\n22:07.400 --> 22:14.160\n So that model of self evident premises to infallible conclusions, I'm calling that rationalism,\n\n22:14.160 --> 22:19.440\n I think that's kind of a standard academic jargon term.\n\n22:19.440 --> 22:27.440\n And it's opposed to empiricism, which is a thinker, I think in universities, usually\n\n22:27.440 --> 22:30.240\n the empiricist is David Hume.\n\n22:30.240 --> 22:36.560\n And David Hume will say, we can't learn anything the way that Descartes said.\n\n22:36.560 --> 22:40.520\n There is nothing that's that self evident and that infallible.\n\n22:40.520 --> 22:50.040\n So Hume proposes, based on Newton and Boyle and the new physical sciences.\n\n22:50.040 --> 22:53.200\n So Hume proposes a science of man.\n\n22:53.200 --> 22:56.240\n And the science of man sounds an awful lot like what Yaron just said, which is we're\n\n22:56.240 --> 23:01.640\n going to take a look at human nature, at the nature of societies.\n\n23:01.640 --> 23:06.440\n Human nature, we're going to try to abstract towards fixed principles for describing it.\n\n23:06.440 --> 23:09.040\n Human societies, we're going to try to do the same thing.\n\n23:09.040 --> 23:13.720\n And from there, we get, for example, contemporary economics.\n\n23:13.720 --> 23:19.260\n But we also get sociology and anthropology, which cut in a different direction.\n\n23:19.260 --> 23:23.400\n So that's rationalism versus empiricism.\n\n23:23.400 --> 23:24.400\n Can I just say?\n\n23:24.400 --> 23:25.400\n Yeah, go ahead, please.\n\n23:25.400 --> 23:26.400\n Yeah, I agree with that.\n\n23:26.400 --> 23:33.560\n I think empiricism, the one thing I disagree is I think empiricism rarely comes to these\n\n23:33.560 --> 23:34.560\n abstractions.\n\n23:34.560 --> 23:36.440\n I mean, they want more facts.\n\n23:36.440 --> 23:39.840\n It's always about collecting more evidence.\n\n23:39.840 --> 23:48.120\n But this is where I think Ayn Rand is so unusual and where I think there's something new here.\n\n23:48.120 --> 23:50.360\n And that's a bold statement given the history of philosophy.\n\n23:50.360 --> 23:53.480\n But I think Ayn Rand is something new.\n\n23:53.480 --> 23:59.520\n And so she says, yes, we agree about rationalism and that it's inherently wrong.\n\n23:59.520 --> 24:03.340\n Empiricism has the problem of, OK, where does it lead?\n\n24:03.340 --> 24:04.400\n You never come to a conclusion.\n\n24:04.400 --> 24:06.280\n You're just accumulating evidence.\n\n24:06.280 --> 24:07.760\n There's something in addition.\n\n24:07.760 --> 24:14.400\n There's a third alternative, which she is positing, which is using empirical evidence,\n\n24:14.400 --> 24:18.800\n not denying empirical evidence, recognizing that there are some axioms, there are some\n\n24:18.800 --> 24:24.640\n axioms that we all, at the base of all of our knowledge, that are starting points.\n\n24:24.640 --> 24:27.340\n We're not rejecting axiomatic knowledge.\n\n24:27.340 --> 24:32.240\n And integrating those two and identifying the fact that based on these axioms and based\n\n24:32.240 --> 24:36.960\n on these empirical evidence, we can come to truths.\n\n24:36.960 --> 24:40.000\n Just again, like we do in science, we have certain axioms, scientific axioms, we have\n\n24:40.000 --> 24:44.660\n certain experiments that we run, and then we can come to some identification of a truth.\n\n24:44.660 --> 24:48.900\n And that truth is always going to be challenged by new information, by new knowledge.\n\n24:48.900 --> 24:52.760\n But as long as that's what we know, that is what truth is.\n\n24:52.760 --> 24:58.920\n So truth is contextual in the sense that it's contextual, it's based on that knowledge that\n\n24:58.920 --> 24:59.920\n surrounds it.\n\n24:59.920 --> 25:02.360\n It's always available to change if you get new facts.\n\n25:02.360 --> 25:03.360\n Absolutely.\n\n25:03.360 --> 25:07.160\n It's always available to change if the facts that you get, and they really are, I mean,\n\n25:07.160 --> 25:12.320\n the burden of changing what you've come to a conclusion of truth is high, so you'd have\n\n25:12.320 --> 25:16.260\n to have real evidence that it's not true, but that happens all the time.\n\n25:16.260 --> 25:17.680\n So it happens in science, right?\n\n25:17.680 --> 25:22.000\n We discovered that what we thought was true is not true, and it can happen in politics\n\n25:22.000 --> 25:27.400\n and ethics even more so than in science because they're much messier fields.\n\n25:27.400 --> 25:33.800\n But the idea is that you can come to a truth, but it's not just deductive.\n\n25:33.800 --> 25:36.200\n Most truths are inductive.\n\n25:36.200 --> 25:41.680\n We learn from observing reality and, again, coming to principles about what works and\n\n25:41.680 --> 25:42.680\n what's not.\n\n25:42.680 --> 25:46.080\n And here I think this is—Ayn Rand is different.\n\n25:46.080 --> 25:49.600\n She doesn't fall into the—and she's different in her politics, and she's different in\n\n25:49.600 --> 25:50.600\n her epistemology.\n\n25:50.600 --> 25:53.560\n She doesn't fall into the conventional view.\n\n25:53.560 --> 25:57.840\n She's an opponent of Hume, and she's an opponent of Descartes, and she's certainly\n\n25:57.840 --> 26:01.040\n an opponent of Kant.\n\n26:01.040 --> 26:03.600\n And I think she's right, right?\n\n26:03.600 --> 26:04.600\n So—\n\n26:04.600 --> 26:09.440\n If it's okay, can we walk back to criticism of communism?\n\n26:09.440 --> 26:12.520\n You're both critics of communism and socialism.\n\n26:12.520 --> 26:14.120\n Why did communism fail?\n\n26:14.120 --> 26:21.640\n You started to say that conservatives criticize it on the basis of rationalism, that you're\n\n26:21.640 --> 26:22.640\n throwing away the past.\n\n26:22.640 --> 26:24.640\n You're starting from scratch.\n\n26:24.640 --> 26:27.440\n Is that the fundamental description of why communism failed?\n\n26:27.440 --> 26:33.900\n I think the fundamental difference between rationalists and empiricists is the question\n\n26:33.900 --> 26:36.120\n of whether you're throwing away the past.\n\n26:36.120 --> 26:37.720\n That's the argument.\n\n26:37.720 --> 26:43.720\n And it cashes out as a distinction between abstract, universal, rationalist political\n\n26:43.720 --> 26:48.400\n theories and empirical political theories.\n\n26:48.400 --> 26:57.320\n Artificial political theories, they're always going to say something like, look, there are\n\n26:57.320 --> 26:59.420\n many different societies.\n\n26:59.420 --> 27:06.720\n We can say that some are better and some are worse, but the problem is that there are many\n\n27:06.720 --> 27:11.080\n different ways in which a society can be better or worse.\n\n27:11.080 --> 27:15.040\n There's an ongoing competition, and we're learning on an ongoing basis what are the\n\n27:15.040 --> 27:17.820\n ways in which societies can be better and worse.\n\n27:17.820 --> 27:24.520\n That creates a kind of, I'd say, a mild skepticism, a moderate skepticism among conservatives.\n\n27:24.520 --> 27:29.120\n I don't think too many conservatives have a problem looking at the Soviet Union, which\n\n27:29.120 --> 27:36.880\n is brutal and murderous, ineffective in its economics, totally ineffective spiritually,\n\n27:36.880 --> 27:38.680\n and then collapsed.\n\n27:38.680 --> 27:40.000\n Okay.\n\n27:40.000 --> 27:45.660\n So I think it's easier for us to look at a system like that and say, what on earth?\n\n27:45.660 --> 27:47.540\n What should we learn from that?\n\n27:47.540 --> 27:53.440\n But the main conservative tradition is pretty tolerant of a diversity of different kinds\n\n27:53.440 --> 28:00.080\n of society and is slow to insist that France is so tyrannical, it just needs a revolution\n\n28:00.080 --> 28:03.160\n because what's going to come after the revolution is going to be much better.\n\n28:03.160 --> 28:09.560\n The assumption is that there's lots of things that are good about most societies and that\n\n28:09.560 --> 28:16.560\n a clean slate leads you to throw out all of the inherited things that you don't even know\n\n28:16.560 --> 28:17.960\n how to notice until they're gone.\n\n28:17.960 --> 28:18.960\n LW.\n\n28:18.960 --> 28:23.080\n Could I actually play devil's advocate here and address something you also said?\n\n28:23.080 --> 28:29.280\n Can we, as opposed to knowing the empirical data of the 20th century that communism presented,\n\n28:29.280 --> 28:32.920\n can we go back to the beginning of the 20th century?\n\n28:32.920 --> 28:39.420\n Can you empathize or steel man or put yourself in a place of the Soviet Union where the workers\n\n28:39.420 --> 28:41.800\n are being disrespected?\n\n28:41.800 --> 28:48.040\n And can you not see that the conservatives could be pro communism?\n\n28:48.040 --> 28:53.640\n Communism is such a strongly negative word in modern day political discourse that you\n\n28:53.640 --> 29:05.240\n have to put yourself in the mind of people who like red colors, it's all about the branding,\n\n29:05.240 --> 29:15.440\n I think, but also like the ideas of solidarity, of nation, of togetherness, of respect for\n\n29:15.440 --> 29:16.440\n fellow man.\n\n29:16.440 --> 29:23.200\n I mean, all of these things that communism represents, can you not see that this idea\n\n29:23.200 --> 29:26.780\n is actually going along with conservatism?\n\n29:26.780 --> 29:34.600\n It is in some ways respecting the deep ideals of the past, but proposing a new way to raise\n\n29:34.600 --> 29:37.880\n those ideals, implement those ideals in the system.\n\n29:37.880 --> 29:43.000\n Yes, I'm going to try to do what you're suggesting, but historically we actually have a more\n\n29:43.000 --> 29:46.000\n useful option, I think, for both of our positions.\n\n29:46.000 --> 29:52.580\n Instead of pretending that we like the actual communists, we have conservative statesmen\n\n29:52.580 --> 30:01.680\n like Disraeli and Bismarck who initiated social legislation.\n\n30:01.680 --> 30:08.960\n The first step towards saying, look, we're one nation, we're undergoing industrialization,\n\n30:08.960 --> 30:15.120\n that industrialization is important and positive, but it's also doing a lot of damage to a lot\n\n30:15.120 --> 30:16.120\n of people.\n\n30:16.120 --> 30:20.640\n And in particular, it's doing damage not just to individuals and families, but it's doing\n\n30:20.640 --> 30:26.880\n damage to the social fabric, the capacity of Britain or German to remain cohesive societies\n\n30:26.880 --> 30:28.560\n is being harmed.\n\n30:28.560 --> 30:34.080\n And so it's these two conservative statesmen, Disraeli and Bismarck, who actually take the\n\n30:34.080 --> 30:40.800\n first steps in order to legislate for what today we would consider to be minimal social\n\n30:40.800 --> 30:45.040\n programs, pensions and disability insurance and those kinds of things.\n\n30:45.040 --> 30:53.320\n So for sure, conservatives do look at industrialization as a rapid change and they say, we do have\n\n30:53.320 --> 30:57.480\n to care about the nation as a whole and we have to care about it as a unit.\n\n30:57.480 --> 31:02.980\n And I assume that your own will say, look, that's the first step towards the catastrophe\n\n31:02.980 --> 31:04.560\n of communism.\n\n31:04.560 --> 31:11.320\n But before your own drives that nail into the coffin, let me try to make a distinction\n\n31:11.320 --> 31:17.320\n because when you read Marx, you're reading an intellectual descendant of Descartes.\n\n31:17.320 --> 31:27.120\n You're reading somebody who says, look, every society consists of oppressors and oppressed.\n\n31:27.120 --> 31:31.720\n And that's an improvement in some ways over liberal thinking because at least he's seeing\n\n31:31.720 --> 31:35.200\n groups as a real social phenomenon.\n\n31:35.200 --> 31:38.920\n But he says, every society has an oppressor class and oppressed class.\n\n31:38.920 --> 31:42.680\n They're different classes, they're different groups, and whenever one is stronger, it exploits\n\n31:42.680 --> 31:45.440\n the ones that are weaker.\n\n31:45.440 --> 31:50.920\n That is the foundation of a revolutionary political theory.\n\n31:50.920 --> 31:51.920\n Why?\n\n31:51.920 --> 31:56.120\n Because the moment that you say that the only relationship between the stronger and the\n\n31:56.120 --> 31:58.680\n weaker is exploitation.\n\n31:58.680 --> 32:02.840\n The moment that you say that, then you're pushed into the position and Marx and Engels\n\n32:02.840 --> 32:04.880\n say this explicitly, you're pushed into the position.\n\n32:04.880 --> 32:07.940\n We're saying, when will the exploitation end?\n\n32:07.940 --> 32:09.300\n Never until there's a revolution.\n\n32:09.300 --> 32:10.640\n What happens when there's a revolution?\n\n32:10.640 --> 32:12.920\n You eliminate the oppressor class.\n\n32:12.920 --> 32:13.920\n It's annihilationist.\n\n32:13.920 --> 32:20.400\n I mean, you can immediately when you read it, see why it's different from Descartes\n\n32:20.400 --> 32:25.300\n or Bismarck because they're trying to keep everybody somehow at peace with one another.\n\n32:25.300 --> 32:27.800\n And Marx is saying, there is no peace.\n\n32:27.800 --> 32:30.440\n That oppressor class has to be annihilated.\n\n32:30.440 --> 32:34.400\n And then they go ahead and do it, and they kill 100 million people.\n\n32:34.400 --> 32:40.320\n So I do think that despite the fact your question is good and right, there are certain similarities\n\n32:40.320 --> 32:43.320\n and concern, but still I think you can tell the difference.\n\n32:43.320 --> 32:48.040\n That extra step of revolution to you is where the problem comes.\n\n32:48.040 --> 32:52.880\n That extra step of let's kill all the oppressors, that's the problem.\n\n32:52.880 --> 32:56.520\n And then to you, the whole step one is the problem.\n\n32:56.520 --> 32:58.120\n Well, it's all a problem.\n\n32:58.120 --> 33:05.440\n First I don't view communism as something that radical in a sense that I think it comes\n\n33:05.440 --> 33:07.960\n from a tradition of collectivism.\n\n33:07.960 --> 33:12.160\n I think it comes from a tradition of looking at groups and measuring things in terms of\n\n33:12.160 --> 33:13.220\n groups.\n\n33:13.220 --> 33:17.200\n It comes from tradition where you expect some people to be sacrificed for the greater good\n\n33:17.200 --> 33:19.400\n of the whole.\n\n33:19.400 --> 33:28.760\n I think it comes from a tradition where mysticism or revelation as the source of truth is accepted.\n\n33:28.760 --> 33:31.800\n I view Marx as in some sense very Christian.\n\n33:31.800 --> 33:38.680\n I don't think he's this radical rejecting, I think he's just reformatting Christianity\n\n33:38.680 --> 33:39.680\n in a sense.\n\n33:39.680 --> 33:43.620\n In a sense he's replacing God with the proletarian.\n\n33:43.620 --> 33:48.400\n Knowledge you have to get knowledge from somewhere, so you need the dictatorship of the proletarian,\n\n33:48.400 --> 33:53.880\n you need somebody, the Stalin, the Lenin who somehow communes with the spirit, the spirit\n\n33:53.880 --> 33:54.880\n of the proletarian.\n\n33:54.880 --> 33:59.760\n There's no rationality, not rationalism, there's no rationality in Marx.\n\n33:59.760 --> 34:04.880\n There is a lot of mysticism and there is a lot of hand waving and there's a lot of sacrifice\n\n34:04.880 --> 34:08.160\n and a lot of original sin in the way he views humanity.\n\n34:08.160 --> 34:14.960\n So I view Marx as one more collectivist in a whole string of collectivists.\n\n34:14.960 --> 34:23.760\n And I think the Bismarckian response, I know less about Disraeli so I'll focus on Bismarck,\n\n34:23.760 --> 34:29.480\n and Bismarck is really responding to political pressures from the left and he's responding\n\n34:29.480 --> 34:36.520\n to the rise of communism, socialism, but what Bismarck is doing, he's putting something\n\n34:36.520 --> 34:42.280\n alternative, he's presenting an alternative to the proletarian as the standard by which\n\n34:42.280 --> 34:45.800\n we should measure the good.\n\n34:45.800 --> 34:50.120\n And what he's replacing it as the state, he's replacing the proletarian with the state,\n\n34:50.120 --> 34:52.380\n and that has exactly the same problems.\n\n34:52.380 --> 34:56.120\n That is first it requires sacrificing some to others, which is what the welfare state\n\n34:56.120 --> 34:59.240\n basically legitimizes.\n\n34:59.240 --> 35:03.280\n It places the state above all, so the state now becomes I think the biggest evil of Bismarck\n\n35:03.280 --> 35:08.520\n and I definitely view him as a negative force in history, is public education.\n\n35:08.520 --> 35:14.440\n I mean the Germans really dig in on public education, really develop it, and really the\n\n35:14.440 --> 35:20.940\n American model of public education is copying the German, the Prussian Bismarckian public\n\n35:20.940 --> 35:21.940\n education.\n\n35:21.940 --> 35:27.080\n Can you speak to that real quick, why the public education is such a root of moral evil\n\n35:27.080 --> 35:28.080\n for you?\n\n35:28.080 --> 35:33.520\n Well because it now says that there's one standard and that standard is determined by\n\n35:33.520 --> 35:39.760\n government, by a bureaucracy, by whatever the government deems is in the national interest,\n\n35:39.760 --> 35:41.200\n and Bismarck is very explicit about this.\n\n35:41.200 --> 35:47.440\n He's training the workers of the future, they need to catch up with England and other places\n\n35:47.440 --> 35:52.000\n and they need to train the workers and he's going to train some people to be the managerial\n\n35:52.000 --> 35:55.440\n classes, he's going to train other people to be – and he decides, right, the government,\n\n35:55.440 --> 35:58.400\n the bureaucracy is going to decide who's who and where they go.\n\n35:58.400 --> 36:03.920\n There's no individual choice, there's no individual showing an ability to break out of what the\n\n36:03.920 --> 36:08.520\n government has decided is their little box, there's very little freedom, there's very\n\n36:08.520 --> 36:12.760\n little – you know, ultimately there's very little competition, there's very little\n\n36:12.760 --> 36:16.240\n innovation, and this is the problem we have today in American education, which we can\n\n36:16.240 --> 36:18.760\n get to, is there's no competition and no innovation.\n\n36:18.760 --> 36:23.320\n We have one standard, fit all, and then we have conflicts about what should be taught,\n\n36:23.320 --> 36:28.680\n and the conflicts now are not pedagogical, they're not about what works and what doesn't.\n\n36:28.680 --> 36:29.680\n Nobody cares about that.\n\n36:29.680 --> 36:33.880\n It's about political agendas, right, it's about what my group wants to be taught and\n\n36:33.880 --> 36:38.400\n what that group wants to be taught, rather than actually discovering how do we get kids\n\n36:38.400 --> 36:39.400\n to read?\n\n36:39.400 --> 36:42.360\n I mean, we all know how to get kids to read, but there's a political agenda around not\n\n36:42.360 --> 36:44.160\n teaching phonics, for example.\n\n36:44.160 --> 36:48.080\n So a lot of schools don't teach phonics, even though the kids will never learn how\n\n36:48.080 --> 36:49.280\n to read properly.\n\n36:49.280 --> 36:53.440\n So it becomes politics, and I don't believe politics belongs in education.\n\n36:53.440 --> 36:58.080\n I think education is a product, it's a service, and we know how to deliver products and services\n\n36:58.080 --> 37:02.440\n really, really efficiently at a really, really low price at a really, really high quality,\n\n37:02.440 --> 37:04.760\n and that's leaving it to the market to do.\n\n37:04.760 --> 37:12.280\n But your fundamental criticism is that the state can use education to further its authoritarian\n\n37:12.280 --> 37:13.280\n aims.\n\n37:13.280 --> 37:17.880\n Well, or whatever the aims – I mean, think about the conservative today critique of American\n\n37:17.880 --> 37:20.320\n educational system, right, it's dominated by the left.\n\n37:20.320 --> 37:23.040\n Yeah, what did you expect, right?\n\n37:23.040 --> 37:28.640\n If you leave it up to the state to fund, they're going to fund the things that promote state\n\n37:28.640 --> 37:31.640\n growth and state intervention, and the left is better at that.\n\n37:31.640 --> 37:36.840\n It has been better at that than the right, and they now dominate our educational institutions.\n\n37:36.840 --> 37:41.640\n But look, if we go back to Bismarck, my problem is placing the state above the individual.\n\n37:41.640 --> 37:46.960\n So if communism places the class above the individual, what matters is class, individuals,\n\n37:46.960 --> 37:49.880\n and nothing, they're cogs in a machine.\n\n37:49.880 --> 37:53.720\n Bismarck, certainly the German tradition much more than the British tradition or the American\n\n37:53.720 --> 37:56.880\n tradition, the German tradition is to place the state above the individual.\n\n37:56.880 --> 38:01.040\n I think that's equally evil, and the outcome is fascism, and the outcome is the same.\n\n38:01.040 --> 38:06.040\n The outcome is the deaths of tens of millions of people when taken to its ultimate conclusion.\n\n38:06.040 --> 38:12.640\n Just like socialism, the ultimate conclusion of it is communism, you know, nationalism\n\n38:12.640 --> 38:18.300\n in that form, kind of the Bismarckian form, the ultimate conclusion is Nazism or some\n\n38:18.300 --> 38:20.680\n form of fascism.\n\n38:20.680 --> 38:23.840\n Because you don't care about the individual, the individual doesn't matter.\n\n38:23.840 --> 38:29.720\n I think this is one of the differences in the Anglo, you know, Anglo American tradition\n\n38:29.720 --> 38:35.080\n where the Anglo American tradition, even the conservatives, have always acknowledged and\n\n38:35.080 --> 38:36.080\n it goes back to...\n\n38:36.080 --> 38:37.080\n Especially the conservatives.\n\n38:37.080 --> 38:38.080\n Yes.\n\n38:38.080 --> 38:39.080\n Well...\n\n38:39.080 --> 38:40.080\n The conservatives were there first.\n\n38:40.080 --> 38:41.080\n They acknowledged.\n\n38:41.080 --> 38:45.360\n Well, you've defined conservatives to include all the good thinkers of the distant past,\n\n38:45.360 --> 38:46.680\n and they're all good thinkers.\n\n38:46.680 --> 38:47.680\n We agree on that.\n\n38:47.680 --> 38:51.360\n I'm defining conservatism the way that Burke does.\n\n38:51.360 --> 38:52.360\n I'm just...\n\n38:52.360 --> 38:55.080\n Look, this is a very simple observation.\n\n38:55.080 --> 38:58.760\n Burke thinks, when you open Burke and you actually read him, he starts naming all of\n\n38:58.760 --> 39:00.400\n these people who he's defending.\n\n39:00.400 --> 39:05.000\n And it's bizarre, I'm sorry, it's just intellectual sloppiness for people to be publishing books\n\n39:05.000 --> 39:08.840\n called Burke, The First Conservative, The Founding Conservative, The Found...\n\n39:08.840 --> 39:15.080\n I mean, this is nonstop, it's a view that says Burke reacts to the French Revolution,\n\n39:15.080 --> 39:18.880\n so conservatism has no prior tradition, it's just reacting to the French Revolution.\n\n39:18.880 --> 39:19.880\n And this is...\n\n39:19.880 --> 39:20.880\n I mean, this is just absurd.\n\n39:20.880 --> 39:23.640\n Can I ask a quick question on conservatism?\n\n39:23.640 --> 39:27.480\n Are there any conservatives that are embracing of revolutions?\n\n39:27.480 --> 39:30.880\n So are they ultimately against the concept of revolution?\n\n39:30.880 --> 39:36.480\n Yes, Burke himself embraces the Polish Revolution, which takes place almost exactly at the same\n\n39:36.480 --> 39:38.580\n time as the French Revolution.\n\n39:38.580 --> 39:42.800\n And the argument is really interesting because there's a common mistake is assuming that\n\n39:42.800 --> 39:46.760\n Burke and conservative thinkers are always in favor of slow change.\n\n39:46.760 --> 39:51.240\n I think that's also just factually mistaken.\n\n39:51.240 --> 39:57.320\n Burke is against the French Revolution because he thinks that there are actually tried and\n\n39:57.320 --> 40:04.400\n true things that work, things that work for human flourishing and freedom included as\n\n40:04.400 --> 40:07.900\n a very important part of human flourishing.\n\n40:07.900 --> 40:17.160\n He like many others takes the English constitution to be a model of something that works.\n\n40:17.160 --> 40:21.440\n So it has a king, it has various other things that maybe your own will say, well, that's\n\n40:21.440 --> 40:26.400\n a mistake, but still for centuries, it's the leader in many things that I think we can\n\n40:26.400 --> 40:29.320\n easily agree are human flourishing.\n\n40:29.320 --> 40:33.040\n And Burke says, look, what's wrong with the French Revolution?\n\n40:33.040 --> 40:37.540\n What's wrong with the French Revolution is that they have a system that has all sorts\n\n40:37.540 --> 40:40.960\n of problems, but they could be repairing it.\n\n40:40.960 --> 40:45.680\n And instead what they're doing by overthrowing everything is they're moving away from what\n\n40:45.680 --> 40:48.360\n we know is good for human beings.\n\n40:48.360 --> 40:52.120\n Then he looks at the Polish Revolution and he says, the Poles do the opposite.\n\n40:52.120 --> 40:55.520\n The Poles have a nonfunctioning traditional constitution.\n\n40:55.520 --> 40:57.280\n It's too democratic.\n\n40:57.280 --> 41:03.840\n It's impossible to raise armies and to defend the country because of the fact that every\n\n41:03.840 --> 41:05.760\n nobleman has a veto.\n\n41:05.760 --> 41:11.320\n So the Polish Revolution moves in the direction of the British constitution.\n\n41:11.320 --> 41:16.380\n They repair their constitution through a quick, a rapid revolution.\n\n41:16.380 --> 41:21.240\n They install a king along the model that looks a lot like Britain and Burke supports it.\n\n41:21.240 --> 41:23.960\n He says, this is a good revolution.\n\n41:23.960 --> 41:31.080\n So it's not the need to quickly make a change in order to save yourself.\n\n41:31.080 --> 41:33.240\n That's not what conservatives are objecting to.\n\n41:33.240 --> 41:40.400\n What they're objecting to is instead of looking at experience in order to try to make a slow\n\n41:40.400 --> 41:45.920\n or quick improvement, a measured improvement to achieve a particular goal, instead of doing\n\n41:45.920 --> 41:48.680\n that, you say, look, the whole thing has just been wrong.\n\n41:48.680 --> 41:51.960\n And what we've really got to do is annihilate a certain part of the population and then\n\n41:51.960 --> 41:55.280\n make completely new laws and a completely new theory.\n\n41:55.280 --> 41:56.560\n That's what he's objecting to.\n\n41:56.560 --> 41:57.560\n That's the French Revolution.\n\n41:57.560 --> 42:01.720\n And that then becomes the model for communist revolutions.\n\n42:01.720 --> 42:06.400\n And for me, I mean, the French Revolution is clearly a real evil and wrong, but it's\n\n42:06.400 --> 42:09.800\n not that it was a revolution and it's not that it tried to change everything.\n\n42:09.800 --> 42:13.640\n I mean, let's remember what was going on in France at the time and people were starving\n\n42:13.640 --> 42:18.540\n and the monarchy in particular was completely detached, completely detached from the suffering\n\n42:18.540 --> 42:22.120\n of the people and something needed to change.\n\n42:22.120 --> 42:30.320\n The unfortunate thing is that the change was motivated by an egalitarian philosophy, not\n\n42:30.320 --> 42:33.880\n egalitarian in the sense that I think the Fauny Fathers talked about, but egalitarian\n\n42:33.880 --> 42:40.080\n in the sense of real equality, equality of outcome, motivated by a philosophy, by Rousseau's\n\n42:40.080 --> 42:44.240\n philosophy, and inevitably led, you could tell that the ideas were going to lead to\n\n42:44.240 --> 42:48.920\n this, to massive destruction and death and the annihilation of a class.\n\n42:48.920 --> 42:51.560\n You can't, annihilation is never an option.\n\n42:51.560 --> 42:58.560\n That is, it's not true that a good revolution never leads to mass death of just whole groups\n\n42:58.560 --> 43:01.920\n of people because a good revolution is about the sanctity of the individual.\n\n43:01.920 --> 43:04.880\n It's about preservation, liberty of the individual.\n\n43:04.880 --> 43:10.300\n And again, that goes back to, and the French Revolution denies and Rousseau denies really\n\n43:10.300 --> 43:13.560\n that in civilization there is a value in a thing called the individual.\n\n43:13.560 --> 43:18.080\n I think this is a good place to have this discussion.\n\n43:18.080 --> 43:26.260\n The Fauny Fathers of the United States, are they individualists or are they conservatives?\n\n43:26.260 --> 43:31.240\n So in this particular revolution that founded this country, at the core of which are some\n\n43:31.240 --> 43:38.600\n fascinating, some powerful ideas, were those founding fathers, were those ideas coming\n\n43:38.600 --> 43:45.400\n from a place of conservatism or did they put primary value into the freedom and the power\n\n43:45.400 --> 43:46.400\n of the individual?\n\n43:46.400 --> 43:47.640\n What do you think?\n\n43:47.640 --> 43:48.640\n There were both.\n\n43:48.640 --> 43:54.400\n I mean, this is something that's a little bit difficult sometimes for Americans, I mean,\n\n43:54.400 --> 43:58.960\n very educated Americans, they talk about the founding fathers as though it's kind of like\n\n43:58.960 --> 44:06.560\n this collective entity with a single brain and a single value system.\n\n44:06.560 --> 44:12.480\n But I think at the time that's not the way any of them saw it.\n\n44:12.480 --> 44:18.520\n So roughly there's two camps and they map onto the rationalist versus traditionalist\n\n44:18.520 --> 44:23.520\n empiricist dichotomy that I proposed earlier.\n\n44:23.520 --> 44:29.000\n So on the one hand, you have real revolutionaries like Jefferson and Paine.\n\n44:29.000 --> 44:31.400\n These are the people who Burke was writing against.\n\n44:31.400 --> 44:33.700\n These are the people who supported the French Revolution.\n\n44:33.700 --> 44:38.640\n So when you say real, so when you say Paine, you're referring to revolutionaries in a bad\n\n44:38.640 --> 44:40.400\n way, like this is a problem.\n\n44:40.400 --> 44:48.080\n These are people who will say history up until now has been, with Descartes, but applied\n\n44:48.080 --> 44:49.080\n to politics.\n\n44:49.080 --> 44:56.600\n History up until now has been just a story of ugliness, foolishness, stupidity, and evil.\n\n44:56.600 --> 45:03.840\n And if you apply reason, we'll all come to the same conclusions.\n\n45:03.840 --> 45:10.360\n Paine writes a book called The Age of Reason, and The Age of Reason is a manifesto for here\n\n45:10.360 --> 45:14.200\n is the answer to political and moral problems throughout history.\n\n45:14.200 --> 45:15.720\n We have the answers.\n\n45:15.720 --> 45:19.680\n And it's in the same school as Rousseau's The Social Continent.\n\n45:19.680 --> 45:20.680\n You don't like that?\n\n45:20.680 --> 45:21.680\n Not at all.\n\n45:21.680 --> 45:22.680\n Well, I thought it was the opposite.\n\n45:22.680 --> 45:23.680\n I think they're the opposite.\n\n45:23.680 --> 45:24.680\n Okay, so let me...\n\n45:24.680 --> 45:30.280\n Just to throw in a quick question on Jefferson and Paine, do you think America would exist\n\n45:30.280 --> 45:32.720\n without those two figures?\n\n45:32.720 --> 45:38.840\n So like how important is spice in the flavor of the dish you're making?\n\n45:38.840 --> 45:43.360\n I don't want to try to run the counterfactual, I don't have confidence that I know the answer\n\n45:43.360 --> 45:44.360\n to the question.\n\n45:44.360 --> 45:45.360\n But it's so much fun.\n\n45:45.360 --> 45:46.360\n You know what?\n\n45:46.360 --> 45:49.200\n I'm going to offer something that I think is more fun.\n\n45:49.200 --> 45:55.440\n More fun than the counterfactual is America had two revolutions, not one, okay?\n\n45:55.440 --> 46:05.280\n At first, there is a revolution that is strongly spiced with this kind of rationalism.\n\n46:05.280 --> 46:09.440\n And then there's a 10 year period after the Declaration of Independence.\n\n46:09.440 --> 46:12.920\n There's a 10 year period under which America has a constitution.\n\n46:12.920 --> 46:16.400\n This first constitution, which today they call the Articles of the Confederation, but\n\n46:16.400 --> 46:19.420\n there's a constitution from 1777.\n\n46:19.420 --> 46:25.760\n And that constitution is based on, in a lot of ways, on the hottest new ideas.\n\n46:25.760 --> 46:31.640\n It has, instead of the traditional British system with a division of powers between an\n\n46:31.640 --> 46:38.480\n executive and a bicameral legislature, instead of that traditional English model, which most\n\n46:38.480 --> 46:42.640\n of the states had as their governments, instead of that, they say, no, we're going to have\n\n46:42.640 --> 46:50.400\n one elected body, okay, and that body, that Congress, it's going to be the executive,\n\n46:50.400 --> 46:54.400\n it's going to be the legislative, it's going to be everything, and it's going to run as\n\n46:54.400 --> 46:55.920\n a big committee.\n\n46:55.920 --> 46:57.520\n These are the ideas of the French Revolution.\n\n46:57.520 --> 47:04.360\n You get to actually see them implemented in Pennsylvania, in the Pennsylvania Constitution,\n\n47:04.360 --> 47:06.800\n and then later in the National Assembly in France.\n\n47:06.800 --> 47:07.840\n It's a disaster.\n\n47:07.840 --> 47:09.140\n The thing doesn't work.\n\n47:09.140 --> 47:10.240\n It's completely made up.\n\n47:10.240 --> 47:15.720\n It's neither based on historical experience, nor is it based on historical custom, on what\n\n47:15.720 --> 47:17.240\n people are used to.\n\n47:17.240 --> 47:23.320\n And what they succeed in creating with this first constitution is it's wonderfully rational,\n\n47:23.320 --> 47:24.840\n but it's a complete disaster.\n\n47:24.840 --> 47:27.440\n It doesn't allow the raising of taxes.\n\n47:27.440 --> 47:29.240\n It doesn't allow the mustering of troops.\n\n47:29.240 --> 47:33.640\n It doesn't allow giving orders to soldiers to fight a war.\n\n47:33.640 --> 47:41.240\n And if that had continued, if that had continued to be the American Constitution, America never\n\n47:41.240 --> 47:42.680\n would have been an independent country.\n\n47:42.680 --> 47:45.400\n There I'm willing to do that counterfactual.\n\n47:45.400 --> 47:55.880\n What happens during those years where Washington and Jay and Knox and Hamilton and Morris,\n\n47:55.880 --> 48:02.480\n there's like this group of conservatives, they're mostly soldiers and lawyers.\n\n48:02.480 --> 48:06.480\n This is in Washington, most of them are from northern cities.\n\n48:06.480 --> 48:17.080\n And this group is much more conservative than the Tom Paine and Jefferson School.\n\n48:17.080 --> 48:20.000\n Some historians call them the Nationalist Party.\n\n48:20.000 --> 48:24.360\n Historically, they give up the word nationalism and they call themselves the Federalists,\n\n48:24.360 --> 48:26.320\n but they're basically the Nationalist Party.\n\n48:26.320 --> 48:27.320\n What does that mean?\n\n48:27.320 --> 48:32.600\n It means on the one hand that their goal is to create an independent nation, independent\n\n48:32.600 --> 48:33.600\n from Britain.\n\n48:33.600 --> 48:41.000\n But on the other hand, they believe that they already have national legal traditions, the\n\n48:41.000 --> 48:46.680\n common law, the forms of government that have been imported from Britain, and of course\n\n48:46.680 --> 48:51.760\n Christianity, which they consider to be part of their inheritance.\n\n48:51.760 --> 48:56.720\n This Federalist Party is the conservative party.\n\n48:56.720 --> 49:00.320\n These are people who are extremely close in ideas to Burke.\n\n49:00.320 --> 49:04.400\n And these are people who wrote the Constitution of the United States, the second constitution,\n\n49:04.400 --> 49:11.720\n the second revolution in 1787, when Washington leads the establishment of a new constitution,\n\n49:11.720 --> 49:17.000\n which maybe technically legally, it wasn't even legal under the old constitution, but\n\n49:17.000 --> 49:18.540\n it was democratic.\n\n49:18.540 --> 49:24.160\n And what it did is it said, we're going to take what we know about English government,\n\n49:24.160 --> 49:28.560\n what we've learned by applying English government in the states, we're going to create a national\n\n49:28.560 --> 49:32.760\n government, a unified national government, that's going to muster power in its hands,\n\n49:32.760 --> 49:38.800\n enough power to be able to do things like fighting wars to defend a unified people.\n\n49:38.800 --> 49:40.220\n Those are conservatives.\n\n49:40.220 --> 49:46.160\n Now it's reasonable to say, well, look, there was no king, so how conservative could they\n\n49:46.160 --> 49:47.160\n be?\n\n49:47.160 --> 49:49.060\n But I think that's a reasonable question.\n\n49:49.060 --> 49:53.400\n But don't forget that the American colonies, the English colonies in America by that point\n\n49:53.400 --> 49:55.680\n had been around for 150 years.\n\n49:55.680 --> 50:01.200\n They had written constitutions, they had already adapted for an entire century, adapted the\n\n50:01.200 --> 50:06.120\n English constitution to local conditions where there's no aristocracy and there's no king.\n\n50:06.120 --> 50:08.760\n I think you can see that as a positive thing.\n\n50:08.760 --> 50:13.040\n On the other hand, they have slavery, that's an innovation, that's not English.\n\n50:13.040 --> 50:17.280\n So it's a little bit different from the English constitution, but those men are conservatives.\n\n50:17.280 --> 50:23.900\n They make the minimum changes that they need to the English constitution and they largely\n\n50:23.900 --> 50:28.680\n replicate it, which is why the Jeffersonians hated them so much.\n\n50:28.680 --> 50:30.220\n They call them apostates.\n\n50:30.220 --> 50:37.640\n They say they've betrayed equality and liberty and fraternity by adopting an English style\n\n50:37.640 --> 50:38.640\n constitution.\n\n50:38.640 --> 50:43.760\n So I would imagine, Yaron, you would put emphasis of the success of the key ideas at the founding\n\n50:43.760 --> 50:49.360\n of this country elsewhere, at the freedom of the individual as opposed to the tradition\n\n50:49.360 --> 50:51.000\n of the British empire.\n\n50:51.000 --> 50:55.040\n The one thing I agree with, Yaron, is the fact that yes, the founding fathers were not\n\n50:55.040 --> 50:56.040\n a monolith.\n\n50:56.040 --> 51:00.520\n They argued, they debated, they disagreed, they wrote against each other.\n\n51:00.520 --> 51:03.880\n Jefferson and Adams for decades didn't even speak to each other, though they did make\n\n51:03.880 --> 51:08.000\n up and had a fascinating relationship after.\n\n51:08.000 --> 51:09.000\n You and I are making up too.\n\n51:09.000 --> 51:10.000\n There you go.\n\n51:10.000 --> 51:13.000\n It's like the founding fathers.\n\n51:13.000 --> 51:19.140\n You know, there's this massive debate and discussion, but I don't agree with the characterization\n\n51:19.140 --> 51:20.800\n of Paine and Jefferson.\n\n51:20.800 --> 51:25.280\n I don't think it's just to call them rationalists because I don't think they're rationalists.\n\n51:25.280 --> 51:29.880\n People who've looked at history, at the problems in history, and remember this is the 18th\n\n51:29.880 --> 51:35.100\n century and they were coming out of a hundred years earlier, some of the bloodiest wars\n\n51:35.100 --> 51:42.060\n in all of human history were happening in Europe, many of them over religion.\n\n51:42.060 --> 51:46.840\n You know, they had seen what was going on in France and other countries where people\n\n51:46.840 --> 51:54.680\n were starving and where kings were frolicking in palaces in spite of that.\n\n51:54.680 --> 52:01.760\n They were very aware of the relative freedom that the British tradition had given Englishmen.\n\n52:01.760 --> 52:06.400\n I think they knew that, they understood that, and I think they were building on that.\n\n52:06.400 --> 52:12.120\n They were taking the observation of the past and trying to come up with a more perfect\n\n52:12.120 --> 52:13.960\n system, and I think they did.\n\n52:13.960 --> 52:16.440\n In that sense, I'm a huge fan of Jefferson.\n\n52:16.440 --> 52:20.120\n You know, there are two things that I think are unfortunate about Jefferson.\n\n52:20.120 --> 52:26.000\n One is that he continued to hold slaves, which is very unfortunate.\n\n52:26.000 --> 52:31.800\n The second is early support for the French Revolution, which I think is a massive mistake\n\n52:31.800 --> 52:36.760\n and I wouldn't be surprised if he regretted it later in life, given the consequences.\n\n52:36.760 --> 52:41.840\n But they were trying to derive principles by which they could establish a new state,\n\n52:41.840 --> 52:48.000\n and yes, there was pushback by some and there was disagreement, and the Constitution in\n\n52:48.000 --> 52:53.280\n the end is to some extent a form of compromise, it's still one of the great documents of\n\n52:53.280 --> 52:57.720\n all of human history, political documents, the Constitution, although I think it's\n\n52:57.720 --> 52:59.120\n inferior to the Declaration.\n\n52:59.120 --> 53:03.480\n I'm a huge fan of the Declaration and I think one of the mistakes the conservatives makes,\n\n53:03.480 --> 53:09.160\n one of the mistakes the Supreme Court makes and American judiciary makes is assuming the\n\n53:09.160 --> 53:10.360\n two documents are separate.\n\n53:10.360 --> 53:14.240\n I think Lincoln is absolutely right, you can't understand the Constitution without understanding\n\n53:14.240 --> 53:18.760\n the Declaration, the Declaration of what set the context and what sets everything up for\n\n53:18.760 --> 53:20.480\n the Constitution.\n\n53:20.480 --> 53:25.480\n Individual rights are the key concept there, and one of the challenges was that some of\n\n53:25.480 --> 53:30.760\n the compromises, and compromise is not necessarily between groups, but compromises that even\n\n53:30.760 --> 53:37.720\n Jefferson made and others made regarding individual rights, set America on a path that we're\n\n53:37.720 --> 53:39.880\n suffering from today.\n\n53:39.880 --> 53:46.760\n I mentioned three last night, one was slavery, obviously that was a horrific compromise,\n\n53:46.760 --> 53:53.920\n one that America not just paid for with the Civil War, 600,000 young men died because\n\n53:53.920 --> 53:58.080\n of it, but the suffering of black slaves for all those years.\n\n53:58.080 --> 54:04.760\n But then the whole issue of racial tensions in this country for a century and to this\n\n54:04.760 --> 54:10.320\n day really is a consequence of that initial compromise, who knows what the counterfactual\n\n54:10.320 --> 54:14.920\n is in America if there's a Civil War right at the founding, because there would have\n\n54:14.920 --> 54:19.320\n been a war no matter what, but if it had happened in the late 18th century, early 19th century,\n\n54:19.320 --> 54:29.000\n rather than waiting till 1860s, but then second was Jefferson's embrace of public education,\n\n54:29.000 --> 54:34.800\n his founding of the University of Virginia, which I think is a great tragedy, which nobody\n\n54:34.800 --> 54:39.120\n agrees with me on, so that's one of the areas where I'm pretty radical.\n\n54:39.120 --> 54:45.520\n And then they embrace, both by Jefferson and by Hamilton, for different reasons, but an\n\n54:45.520 --> 54:49.360\n embrace by both of them of government role in the economy.\n\n54:49.360 --> 54:54.080\n And I do finance, so I know a little bit about finance, and the debate between Jefferson\n\n54:54.080 --> 54:58.680\n and Hamilton about banking is fascinating, but at the end of the day, both wanted a role\n\n54:58.680 --> 55:04.760\n for government in banking, they both didn't trust, Jefferson didn't trust big financial\n\n55:04.760 --> 55:08.140\n interests, Hamilton wanted to capture some of those financial interests for the state,\n\n55:08.140 --> 55:13.960\n and as a consequence, we set America on a path where, in my view, regulation always\n\n55:13.960 --> 55:18.160\n leads to more regulation, there's never a case where regulation decreases, and we started\n\n55:18.160 --> 55:22.080\n out with a certain regulatory body around banks, and a recognition that it was okay\n\n55:22.080 --> 55:26.240\n to regulate the economy, so once we get into the late 19th century, it's fine to regulate\n\n55:26.240 --> 55:31.560\n the railroads, it's fine to pass antitrust laws, it's fine to then continue on the path\n\n55:31.560 --> 55:36.080\n of where we are today, which is heavy, heavy, heavy, massive involvement of government in\n\n55:36.080 --> 55:41.480\n every aspect of our economy, and really in every aspect of our life, because of education.\n\n55:41.480 --> 55:47.080\n So I think the country was founded on certain mistakes, and we haven't been willing to\n\n55:47.080 --> 55:52.280\n question those mistakes, and in a sense that we've only moved in the opposite direction,\n\n55:52.280 --> 55:57.840\n and now America's become, whereas I think it was founded on the idea of the primacy\n\n55:57.840 --> 56:02.920\n of the individual, the sanctity of the individual, at least as an idea, even if not fully implemented,\n\n56:02.920 --> 56:08.720\n I think now that's completely lost, I don't think anybody really is an advocate out there\n\n56:08.720 --> 56:13.040\n for individualism in politics, or for true freedom in politics.\n\n56:13.040 --> 56:16.680\n We'll get to individualism, but let me ask the Beatles and the Rolling Stones question\n\n56:16.680 --> 56:19.000\n about the Declaration of Independence and the Constitution.\n\n56:19.000 --> 56:20.000\n Rolling Stones.\n\n56:20.000 --> 56:23.960\n Well, because it's like which document, Beatles or Rolling Stones, which document is more\n\n56:23.960 --> 56:24.960\n important?\n\n56:24.960 --> 56:25.960\n It's obviously the Beatles, right?\n\n56:25.960 --> 56:26.960\n Okay.\n\n56:26.960 --> 56:27.960\n Is there a question here?\n\n56:27.960 --> 56:28.960\n Is there even a question?\n\n56:28.960 --> 56:33.120\n But let me then even zoom in further and ask you to pick your favorite song.\n\n56:33.120 --> 56:39.400\n So what ideas in the Constitution or the Declaration of Independence do you think are the most\n\n56:39.400 --> 56:43.040\n important to the success of the United States of America?\n\n56:43.040 --> 56:48.360\n I'll answer the question, but before answering the question, I want to register a dissent\n\n56:48.360 --> 56:49.360\n from your own.\n\n56:49.360 --> 56:50.640\n Is it the public education?\n\n56:50.640 --> 56:51.640\n Is it which?\n\n56:51.640 --> 56:52.640\n No, no, no.\n\n56:52.640 --> 56:57.760\n Actually, look, we're not so far apart on public education.\n\n56:57.760 --> 57:01.800\n I'm actually kind of surprised that you're so anti Bismarck because his public school\n\n57:01.800 --> 57:07.240\n system, his national public school system was created in order to stick it to the church.\n\n57:07.240 --> 57:11.080\n It was the church that ran the schools before then, and so that's a different...\n\n57:11.080 --> 57:15.320\n I'm all for sticking it to the church, any opportunity, but not when the alternative\n\n57:15.320 --> 57:16.320\n is the nation.\n\n57:16.320 --> 57:21.240\n I'd rather see a free educational system where freedom is in education.\n\n57:21.240 --> 57:22.240\n Okay.\n\n57:22.240 --> 57:25.400\n So I want to register a dissent about Lincoln.\n\n57:25.400 --> 57:30.800\n Look, Lincoln is an important figure and a great man, and he was presiding over a country,\n\n57:30.800 --> 57:35.880\n which at that point was pretty Jeffersonian in terms of its self perception.\n\n57:35.880 --> 57:37.080\n He said what he needed to say.\n\n57:37.080 --> 57:44.000\n I'm not going to criticize him, but I don't accept the idea that the Declaration of Independence,\n\n57:44.000 --> 57:51.160\n which starts one revolution, is of a piece with the second constitution, the constitution\n\n57:51.160 --> 57:57.940\n of 1787, the nationalist constitution, which is effectively a counter revolution.\n\n57:57.940 --> 58:00.360\n What happens is there is a revolution.\n\n58:00.360 --> 58:01.920\n It's based on certain principles.\n\n58:01.920 --> 58:03.040\n There are a lot...\n\n58:03.040 --> 58:09.160\n Not exactly, but in many ways resembles the later ideas of the French Revolution.\n\n58:09.160 --> 58:14.880\n And what the Federalist Party does, the Nationalist Conservative Party does, is a counter revolution\n\n58:14.880 --> 58:18.160\n to reinstate the Old English Constitution.\n\n58:18.160 --> 58:23.720\n So these documents are, if you're willing to accept the evidence of history, they are\n\n58:23.720 --> 58:27.300\n in many respects contrary to one another.\n\n58:27.300 --> 58:34.080\n And so if I'm asked what's the most important values that are handed down by these documents,\n\n58:34.080 --> 58:41.120\n I don't have an objection to life, liberty, and property, all of which are really important\n\n58:41.120 --> 58:42.120\n things.\n\n58:42.120 --> 58:50.120\n I do have an objection to the pompous overreach of these are self evident, which is absurd.\n\n58:50.120 --> 58:51.480\n They can't be self evident.\n\n58:51.480 --> 58:56.360\n If they were self evident, then somebody would have come up with them like 2,000 years before.\n\n58:56.360 --> 58:58.840\n It's not self evident.\n\n58:58.840 --> 58:59.840\n So that's damaging.\n\n58:59.840 --> 59:08.100\n I like the conservative preamble of the constitution, which describes the purposes of the national\n\n59:08.100 --> 59:10.560\n government that's being established.\n\n59:10.560 --> 59:19.360\n There are seven purposes, a more perfect union, which is the principle of cohesion, justice,\n\n59:19.360 --> 59:26.640\n domestic peace, common defense, the general welfare, which is the welfare of the public\n\n59:26.640 --> 59:31.440\n as a thing that's not only individuals, but there is such a thing as a general welfare,\n\n59:31.440 --> 59:37.880\n liberty, which we agree is absolutely crucial, and posterity, the idea that the purpose of\n\n59:37.880 --> 59:43.480\n the government is to be able to sustain and grow this independent nation, and not only\n\n59:43.480 --> 59:45.840\n to guarantee rights no matter what happens.\n\n59:45.840 --> 59:50.840\n You don't like the, we hold these truths to be self evident, so you're definitely a Beatles\n\n59:50.840 --> 59:51.840\n guy.\n\n59:51.840 --> 59:56.480\n You don't want the pompous, you don't need that revolutionary strength.\n\n59:56.480 --> 1:00:05.200\n Look, I think that that expression, self evident truths, it does tremendous damage because instead\n\n1:00:05.200 --> 1:00:11.680\n of a moderate skepticism, which says, look, we may not know everything, it says, look,\n\n1:00:11.680 --> 1:00:12.680\n we know everything.\n\n1:00:12.680 --> 1:00:13.680\n Here it is.\n\n1:00:13.680 --> 1:00:14.680\n Here's what we know.\n\n1:00:14.680 --> 1:00:15.680\n We know.\n\n1:00:15.680 --> 1:00:16.680\n Here's what we think.\n\n1:00:16.680 --> 1:00:19.280\n So, you know, I'll agree with you all.\n\n1:00:19.280 --> 1:00:20.520\n I don't like self evident.\n\n1:00:20.520 --> 1:00:22.820\n I don't like self evident because he's absolutely right.\n\n1:00:22.820 --> 1:00:24.200\n It's not self evident.\n\n1:00:24.200 --> 1:00:27.180\n These are massive achievements.\n\n1:00:27.180 --> 1:00:33.200\n These are massive achievements of enlightened thinking, of studying history, of understanding\n\n1:00:33.200 --> 1:00:40.440\n human nature, of deriving a truth from 3,000 years of historical knowledge and a better\n\n1:00:40.440 --> 1:00:43.480\n understanding of human nature and a capacity.\n\n1:00:43.480 --> 1:00:49.040\n It's using reason in some ways better than any human beings have.\n\n1:00:49.040 --> 1:00:54.160\n I mean, the founding fathers are giants historically, in my view, because they came up with these\n\n1:00:54.160 --> 1:00:55.160\n truths.\n\n1:00:55.160 --> 1:00:57.600\n I do think they're truths, but they're certainly not self evident.\n\n1:00:57.600 --> 1:00:59.880\n I mean, if they were, your arm is right.\n\n1:00:59.880 --> 1:01:03.200\n They would have discovered them thousands of years earlier or everybody would accept\n\n1:01:03.200 --> 1:01:04.200\n them, right?\n\n1:01:04.200 --> 1:01:09.040\n I mean, how many people today think that those, what they state in that document is true?\n\n1:01:09.040 --> 1:01:11.080\n Pretty much, you know, five people.\n\n1:01:11.080 --> 1:01:12.080\n I don't know.\n\n1:01:12.080 --> 1:01:16.600\n It's very, it's very, your criticism of modern society, yes, we'll get there.\n\n1:01:16.600 --> 1:01:21.380\n It's very, very few people recognize that if they were self evident, bam, everybody\n\n1:01:21.380 --> 1:01:26.600\n would have become, you know, would have accepted the American Revolution as truth and that\n\n1:01:26.600 --> 1:01:27.600\n was it.\n\n1:01:27.600 --> 1:01:32.400\n A lot of work has to go into understanding and describing and convincing people about\n\n1:01:32.400 --> 1:01:33.400\n those truths.\n\n1:01:33.400 --> 1:01:39.720\n But I completely disagree with your arm about this idea or I'll voice my dissent, as we\n\n1:01:39.720 --> 1:01:40.720\n said.\n\n1:01:40.720 --> 1:01:42.800\n I disagree with your official dissent.\n\n1:01:42.800 --> 1:01:47.560\n About A, that this being two different revolutions and B, that the American Revolution had any\n\n1:01:47.560 --> 1:01:50.200\n similarity to the French Revolution.\n\n1:01:50.200 --> 1:01:55.760\n You know that Jefferson and Payne, they were in France running a different revolution.\n\n1:01:55.760 --> 1:01:58.280\n I know, but they were waiting constantly.\n\n1:01:58.280 --> 1:02:01.800\n I mean, they were in communication with Madison, there was a lot of input going on.\n\n1:02:01.800 --> 1:02:06.480\n I know, and Jefferson's sitting there in Paris pulling his hair out because Madison has come\n\n1:02:06.480 --> 1:02:09.800\n under the influence of these nationalists and he can't believe it.\n\n1:02:09.800 --> 1:02:15.080\n The reality is that the difference between the French Revolution and the American Revolution\n\n1:02:15.080 --> 1:02:23.160\n is vast and it is a deep philosophical difference and it's a difference that expressed, I think,\n\n1:02:23.160 --> 1:02:24.160\n between the differences.\n\n1:02:24.160 --> 1:02:29.680\n You know, Joram, in his writings, lumps Rousseau with Locke and with Voltaire and with others\n\n1:02:29.680 --> 1:02:32.280\n and I think that's wrong.\n\n1:02:32.280 --> 1:02:34.280\n I think Rousseau is very different than the others.\n\n1:02:34.280 --> 1:02:40.360\n I think, again, Rousseau is an anti enlightenment figure, Rousseau is in many respects hearkening\n\n1:02:40.360 --> 1:02:47.680\n back to a past, an ancient past and I think a completely distorted view of human nature,\n\n1:02:47.680 --> 1:02:48.680\n of human mind.\n\n1:02:48.680 --> 1:02:49.680\n He rejects reason.\n\n1:02:49.680 --> 1:02:55.400\n I mean, Rousseau is on the premise that reason is the end of humanity, reason is the destruction\n\n1:02:55.400 --> 1:03:00.160\n of humanity, reason is how we get civilization and civilization is awful because –\n\n1:03:00.160 --> 1:03:01.960\n I don't disagree.\n\n1:03:01.960 --> 1:03:04.040\n We're only talking about different texts.\n\n1:03:04.040 --> 1:03:06.760\n When I say Rousseau, I'm just talking about the social contract.\n\n1:03:06.760 --> 1:03:11.000\n Yeah, but the social contract, there's similarity between others, but he takes it in a completely\n\n1:03:11.000 --> 1:03:16.720\n different direction and we agree social contract is a bad idea, but you can't have a contract\n\n1:03:16.720 --> 1:03:21.600\n that you don't actually voluntarily accept, but Rousseau is the French Revolution.\n\n1:03:21.600 --> 1:03:26.880\n Rousseau is about destruction and mayhem and chaos and anarchy.\n\n1:03:26.880 --> 1:03:29.000\n He is the spirit behind the French Revolution.\n\n1:03:29.000 --> 1:03:31.920\n I think the American Revolution is a complete rejection of Rousseau.\n\n1:03:31.920 --> 1:03:34.400\n I think Jefferson is a complete rejection of Rousseau.\n\n1:03:34.400 --> 1:03:36.040\n I don't think Jefferson is a fan of Rousseau.\n\n1:03:36.040 --> 1:03:38.800\n He is of Voltaire and he certainly is of Montesquieu.\n\n1:03:38.800 --> 1:03:43.160\n If you look at the Federalist Papers, the intellectual most cited in the Federalist\n\n1:03:43.160 --> 1:03:48.000\n Papers I think in terms of just the number of times it's cited is Montesquieu.\n\n1:03:48.000 --> 1:03:51.860\n So I think that the American Revolution is an individualistic revolution.\n\n1:03:51.860 --> 1:03:55.400\n It is a revolution about the rights of the individual.\n\n1:03:55.400 --> 1:03:58.280\n The French Revolution is a negation of the rights of the individual.\n\n1:03:58.280 --> 1:04:00.440\n It's a collectivistic revolution.\n\n1:04:00.440 --> 1:04:06.720\n It's not quite the Marxist revolution of the proletarian, but it's defining people in classes\n\n1:04:06.720 --> 1:04:12.200\n and it's a rebellion against a certain class and yeah, kill them all, right?\n\n1:04:12.200 --> 1:04:13.880\n Off with their heads.\n\n1:04:13.880 --> 1:04:15.380\n It is a negation.\n\n1:04:15.380 --> 1:04:19.760\n It's about egalitarianism in the sense of equality of outcome, not in a sense of equality\n\n1:04:19.760 --> 1:04:23.720\n before the law or equality of rights, which is the Jeffersonian sense.\n\n1:04:23.720 --> 1:04:33.280\n I think it's wrong to lump Jefferson in to the fraternity egalitarian notion of the French,\n\n1:04:33.280 --> 1:04:42.200\n which is far more similar to what ultimately became socialism and Marxism and that tradition.\n\n1:04:42.200 --> 1:04:46.360\n It's anti individualistic, the French Revolution is, whereas the American Revolution, the first\n\n1:04:46.360 --> 1:04:48.700\n one, is individualistic.\n\n1:04:48.700 --> 1:04:52.880\n It's all about individual rights and while there's certain phrases in the Declaration\n\n1:04:52.880 --> 1:04:58.240\n of Independence that I don't agree with, it's beautifully written and it's a magnificent\n\n1:04:58.240 --> 1:05:02.280\n document, so it's hard for me to say I don't agree, but who am I?\n\n1:05:02.280 --> 1:05:06.520\n These were giants, self evident is one of them.\n\n1:05:06.520 --> 1:05:13.180\n I'm not particularly crazy about Endowed by the Creator, but I like the fact that it's\n\n1:05:13.180 --> 1:05:18.080\n creator and not God or not a specific creator, but just a more general thing.\n\n1:05:18.080 --> 1:05:22.280\n But putting those two ashes aside, it's the greatest political document in all of human\n\n1:05:22.280 --> 1:05:24.160\n history in my view by far.\n\n1:05:24.160 --> 1:05:25.400\n Nothing comes close.\n\n1:05:25.400 --> 1:05:34.120\n It is a document that identifies the core principles of political truism, of truth.\n\n1:05:34.120 --> 1:05:38.560\n That is, the role of government is to preserve and to protect these rights, these inalienable\n\n1:05:38.560 --> 1:05:42.260\n rights and that is so crucial that these rights are inalienable.\n\n1:05:42.260 --> 1:05:48.100\n That is, a majority can't vote them out, a revelation can't vote them out.\n\n1:05:48.100 --> 1:05:55.080\n This is what is required for human liberty and human freedom, the right that is the sanction,\n\n1:05:55.080 --> 1:05:59.280\n the freedom to act on your own behalf, to act based on your own judgment and as long\n\n1:05:59.280 --> 1:06:04.480\n as you're not interfering with other people's rights, you are free to do so.\n\n1:06:04.480 --> 1:06:10.080\n That is such a profound truth and that to me is the essence of political philosophy.\n\n1:06:10.080 --> 1:06:17.280\n That's the beginning and it's based on, just not to fall into, Yolam's going to say it's\n\n1:06:17.280 --> 1:06:21.320\n a rationalist, it's based on a whole history of what happens when we negate that.\n\n1:06:21.320 --> 1:06:27.160\n It's based on looking at England and seeing to the extent that they practiced a respect\n\n1:06:27.160 --> 1:06:32.560\n for individual liberty, of property, of freedom, good things happened.\n\n1:06:32.560 --> 1:06:34.480\n So let's take that all the way.\n\n1:06:34.480 --> 1:06:36.140\n Let's not compromise on that.\n\n1:06:36.140 --> 1:06:42.720\n Let's be consistent with the good and reject the bad and when England goes away, distance\n\n1:06:42.720 --> 1:06:47.840\n itself from the rights of man, from the idea of a right to property and so on, bad things\n\n1:06:47.840 --> 1:06:54.120\n happen and when they go to it, let's go all in and I'm all in on the right to life, liberty,\n\n1:06:54.120 --> 1:06:55.640\n property and the pursuit of happiness.\n\n1:06:55.640 --> 1:06:59.920\n And I think the idea of pursuit of happiness is profound because it's a moral statement.\n\n1:06:59.920 --> 1:07:06.080\n It's a statement that says that sanctions and says that ultimately people should be\n\n1:07:06.080 --> 1:07:12.840\n allowed to make their own judgments and live their lives as they see fit based on how they\n\n1:07:12.840 --> 1:07:13.840\n view happiness.\n\n1:07:13.840 --> 1:07:16.840\n They might be right, they might be wrong, but we're not going to dictate what happiness\n\n1:07:16.840 --> 1:07:20.760\n entails and dictate to people how they should live their lives.\n\n1:07:20.760 --> 1:07:23.800\n We're going to let them figure that out.\n\n1:07:23.800 --> 1:07:29.440\n So it has this self interested moral code kind of embedded in it.\n\n1:07:29.440 --> 1:07:31.240\n So I think it's a beautiful statement.\n\n1:07:31.240 --> 1:07:35.280\n So I think the declaration is key and I think there was an experiment.\n\n1:07:35.280 --> 1:07:41.720\n An experiment was proposed in that period before the Constitution where the experiment\n\n1:07:41.720 --> 1:07:47.600\n was let's let the states, let's have a kind of a loose confederation, let's let the states\n\n1:07:47.600 --> 1:07:52.760\n experiment with setting up their own constitutions and rule of government and we won't have any\n\n1:07:52.760 --> 1:07:54.020\n kind of unity.\n\n1:07:54.020 --> 1:07:58.040\n And I think what they realized, and I think even Jefferson realized, is that that was\n\n1:07:58.040 --> 1:08:05.160\n not workable because many of the states were starting to significantly violate rights.\n\n1:08:05.160 --> 1:08:11.640\n There was nothing to unify, there was nothing to really protect the vision of the declaration.\n\n1:08:11.640 --> 1:08:16.000\n You needed to establish a nation, which is what the Constitution does, it establishes\n\n1:08:16.000 --> 1:08:17.180\n a nation.\n\n1:08:17.180 --> 1:08:25.880\n But the purpose of that was to put everybody under one set of laws that protected rights.\n\n1:08:25.880 --> 1:08:33.280\n The focus was still on the protection of rights and I agree with six of the seven of the principles.\n\n1:08:33.280 --> 1:08:34.360\n Which did this group?\n\n1:08:34.360 --> 1:08:37.560\n The common welfare, the general welfare, which I'm worried about, right?\n\n1:08:37.560 --> 1:08:42.120\n I think in the way the founders understood it, I think I probably agreed with it.\n\n1:08:42.120 --> 1:08:43.120\n But it's such an ambiguous—\n\n1:08:43.120 --> 1:08:44.640\n I'm sure you don't agree.\n\n1:08:44.640 --> 1:08:45.640\n Maybe I don't.\n\n1:08:45.640 --> 1:08:48.440\n Can you state the general welfare principle?\n\n1:08:48.440 --> 1:08:53.880\n Well the idea that part of the role of government is to secure the general welfare is something—\n\n1:08:53.880 --> 1:08:58.080\n This is something we didn't get to in the debate, we really should have, is the question\n\n1:08:58.080 --> 1:09:04.920\n of whether there is such a thing as a common good or a public interest or a national interest\n\n1:09:04.920 --> 1:09:11.280\n or a general welfare, do these words, do these terms mean anything other than the good of\n\n1:09:11.280 --> 1:09:13.320\n all of the individuals in the country?\n\n1:09:13.320 --> 1:09:14.320\n That's an important—\n\n1:09:14.320 --> 1:09:19.280\n Yeah, so that's right, so that's why I object to it because I think it's too easy\n\n1:09:19.280 --> 1:09:20.760\n to interpret it as.\n\n1:09:20.760 --> 1:09:27.200\n So I interpret it as, well, what's good for a general, a group, a common people, it's\n\n1:09:27.200 --> 1:09:29.800\n a good collection of individuals, so what's good for the individual is good for the common\n\n1:09:29.800 --> 1:09:35.920\n welfare, but I understand that that's something that is hard for people to grasp and not the\n\n1:09:35.920 --> 1:09:37.320\n common understanding.\n\n1:09:37.320 --> 1:09:42.440\n So I would have skipped the general welfare in order to avoid the fact that now the general\n\n1:09:42.440 --> 1:09:48.680\n welfare includes the government telling you what gender you should be assigned, so I would\n\n1:09:48.680 --> 1:09:51.160\n have wanted to have skipped that completely.\n\n1:09:51.160 --> 1:09:54.840\n So I think the Constitution is completely consistent with the Declaration with a few\n\n1:09:54.840 --> 1:10:01.120\n exceptions of general welfare, but perfection is a difficult thing to find, particularly\n\n1:10:01.120 --> 1:10:05.560\n for me politically, but it's a magnificent document, the Constitution.\n\n1:10:05.560 --> 1:10:08.720\n It doesn't quite rise to the level, I think, of the Declaration, but it's a magnificent\n\n1:10:08.720 --> 1:10:13.960\n document because—and this is the difference, I think, between the English Constitution.\n\n1:10:13.960 --> 1:10:17.320\n Here's what I see as the difference.\n\n1:10:17.320 --> 1:10:22.480\n The difference is that the Constitution is written in the context of why do we have a\n\n1:10:22.480 --> 1:10:24.580\n separation of powers, for example?\n\n1:10:24.580 --> 1:10:27.960\n We have a separation of powers in order to make sure that the government only does what\n\n1:10:27.960 --> 1:10:30.720\n the government is supposed to do, and what is the government supposed to do?\n\n1:10:30.720 --> 1:10:33.080\n Well, fundamentally, it's supposed to protect rights.\n\n1:10:33.080 --> 1:10:37.960\n I mean, all of those seven, or at least six of the seven, are about protecting rights.\n\n1:10:37.960 --> 1:10:39.680\n They're about protecting us from foreign invaders.\n\n1:10:39.680 --> 1:10:43.240\n They're about protecting peace within the country.\n\n1:10:43.240 --> 1:10:48.080\n They're about preserving this protection of rights, and why do we have this separation\n\n1:10:48.080 --> 1:10:53.240\n so that we make sure that no one of those entities, the executive or the legislature,\n\n1:10:53.240 --> 1:10:56.520\n the judicial, can violate rights because there's always somebody looking over their shoulder.\n\n1:10:56.520 --> 1:11:00.600\n There's always somebody who can veto their power, but there's a purpose to it, and that\n\n1:11:00.600 --> 1:11:05.440\n purpose is clearly signified and characterized, and that's why I think the Bill of Rights\n\n1:11:05.440 --> 1:11:09.960\n was written, in order to add to the clarification of what exactly we mean.\n\n1:11:09.960 --> 1:11:10.960\n What is the purpose?\n\n1:11:10.960 --> 1:11:16.040\n The purpose is to preserve rights, and that's why we need to elaborate what those rights\n\n1:11:16.040 --> 1:11:17.040\n are.\n\n1:11:17.040 --> 1:11:20.920\n And Madison's objection to the Bill of Rights was to say not that he objected to having\n\n1:11:20.920 --> 1:11:26.920\n protection of rights, but to listing them because he was worried that other rights that\n\n1:11:26.920 --> 1:11:30.560\n were not listed would not be, and his worry was completely justified because it's exactly\n\n1:11:30.560 --> 1:11:31.560\n what's happened.\n\n1:11:31.560 --> 1:11:34.840\n It's like, the only reason we have free speech in America is because we've got it in writing\n\n1:11:34.840 --> 1:11:35.840\n as a First Amendment.\n\n1:11:35.840 --> 1:11:39.480\n If we didn't have it in writing, it would have been gone a long time ago, and the reason\n\n1:11:39.480 --> 1:11:46.320\n we don't have, for example, the freedom to negotiate a contract, you know, independent\n\n1:11:46.320 --> 1:11:51.320\n government regulation, that was not listed as a right in the Bill, even though I think\n\n1:11:51.320 --> 1:11:54.720\n it's clearly covered under the Constitution and certainly under the Declaration.\n\n1:11:54.720 --> 1:11:57.080\n So there was a massive mistake done in the Bill of Rights.\n\n1:11:57.080 --> 1:12:03.720\n They tried to cover it with the Ninth Amendment, but it never really stuck, this idea that\n\n1:12:03.720 --> 1:12:06.960\n nonenumerated rights that are still in place.\n\n1:12:06.960 --> 1:12:08.640\n So I don't see it as a second revolution.\n\n1:12:08.640 --> 1:12:13.600\n I think it's a fix to a flaw that happened.\n\n1:12:13.600 --> 1:12:22.000\n It's a fix that allowed the expansion of the protection of rights to all states by creating\n\n1:12:22.000 --> 1:12:28.200\n a national entity to protect those rights, and that's what ultimately led to slavery\n\n1:12:28.200 --> 1:12:29.880\n going away.\n\n1:12:29.880 --> 1:12:36.120\n You know, under the initial agreement, slavery would have been there in perpetuity because\n\n1:12:36.120 --> 1:12:40.960\n states were sovereign in a way that under the new Constitution they were not, and in\n\n1:12:40.960 --> 1:12:44.920\n a sense, the Constitution sets in motion, the Declaration and then the Constitution\n\n1:12:44.920 --> 1:12:47.400\n set in motion, the Civil War.\n\n1:12:47.400 --> 1:12:51.520\n The Civil War has to happen because at the end of the day, you cannot have some states\n\n1:12:51.520 --> 1:12:55.760\n with a massive violation of rights, what's more of a violation of rights than slavery,\n\n1:12:55.760 --> 1:13:01.040\n and some states that recognize it's not, it inevitably leads to the Civil War.\n\n1:13:01.040 --> 1:13:05.240\n Yaron was just saying that, you know, other than the general welfare, these principles\n\n1:13:05.240 --> 1:13:07.440\n are about individual liberties.\n\n1:13:07.440 --> 1:13:09.560\n I just don't think you can read it that way.\n\n1:13:09.560 --> 1:13:15.240\n The first stated purpose of the Constitution of 1787 is in order to form a more perfect\n\n1:13:15.240 --> 1:13:16.240\n union.\n\n1:13:16.240 --> 1:13:22.840\n A more perfect union, it's describing a characteristic of the whole, it is not a characteristic of\n\n1:13:22.840 --> 1:13:24.520\n any individual.\n\n1:13:24.520 --> 1:13:28.960\n If you look at how the individuals are doing, you don't know whether their union is more\n\n1:13:28.960 --> 1:13:30.200\n or less perfect.\n\n1:13:30.200 --> 1:13:35.740\n So what they're doing is they're looking at the condition in which in order to be able\n\n1:13:35.740 --> 1:13:40.200\n to fight the battle of Yorktown, somebody has to write a personal check in order to\n\n1:13:40.200 --> 1:13:41.480\n be able to move armies.\n\n1:13:41.480 --> 1:13:47.320\n A more perfect union is a more cohesive union, it's the ability to get all of these different\n\n1:13:47.320 --> 1:13:52.720\n individuals to do one focused thing when it's necessary to do it.\n\n1:13:52.720 --> 1:13:57.880\n Well it's more than that, right, so I agree with that, but for what purpose?\n\n1:13:57.880 --> 1:14:02.560\n That is, and this is why, you know, this is why it's so hard with these historical documents\n\n1:14:02.560 --> 1:14:07.240\n because there's a context and there's a thinking that they can't write everything down, right,\n\n1:14:07.240 --> 1:14:09.360\n which is sad because I wish they had.\n\n1:14:09.360 --> 1:14:11.380\n What's the purpose of a more perfect union?\n\n1:14:11.380 --> 1:14:15.840\n The purpose of the more perfect union is to preserve the liberty of the individuals within\n\n1:14:15.840 --> 1:14:16.840\n that union.\n\n1:14:16.840 --> 1:14:18.320\n Well how do you know?\n\n1:14:18.320 --> 1:14:20.020\n Because if you look, what's the rest?\n\n1:14:20.020 --> 1:14:21.240\n So what is the common defense?\n\n1:14:21.240 --> 1:14:26.680\n The common defense is to protect us from foreign invaders who would now disrupt what the rest\n\n1:14:26.680 --> 1:14:28.160\n of the Constitution is all about.\n\n1:14:28.160 --> 1:14:33.880\n All of the Constitution is written in a way as to preserve, find ways to limit the ability\n\n1:14:33.880 --> 1:14:38.160\n of government to violate the rights of individuals.\n\n1:14:38.160 --> 1:14:43.200\n The beauty of this Constitution, and again, it's connection to the Declaration and tradition,\n\n1:14:43.200 --> 1:14:44.200\n right?\n\n1:14:44.200 --> 1:14:45.200\n What came before it?\n\n1:14:45.200 --> 1:14:49.280\n What came before it was a document, which they all respected, which was the Declaration,\n\n1:14:49.280 --> 1:14:50.800\n which set the context for this.\n\n1:14:50.800 --> 1:14:55.760\n And now the union is there in order to provide for the common defense, great, because we\n\n1:14:55.760 --> 1:14:59.880\n know that foreign invaders can violate our rights, that's what war is about.\n\n1:14:59.880 --> 1:15:04.340\n To protect us from peace, to establish peace and justice within the country, that's based\n\n1:15:04.340 --> 1:15:09.500\n on law, the rule of law, and again, individual liberty.\n\n1:15:09.500 --> 1:15:13.900\n So to me, when you read the Founders, when you read the Federalist Papers, when you read\n\n1:15:13.900 --> 1:15:19.200\n what they wrote, what they're trying to do is figure out the right kind of political\n\n1:15:19.200 --> 1:15:25.680\n system, the right kind of structure to be able to preserve these liberties, and not\n\n1:15:25.680 --> 1:15:30.640\n all of them had, from my perspective, a perfect understanding of what those liberties entailed,\n\n1:15:30.640 --> 1:15:35.240\n but they were all, even the conservatives that you call conservatives, were all in generally\n\n1:15:35.240 --> 1:15:39.400\n in agreement about the importance of individual liberty and the importance of individual liberty.\n\n1:15:39.400 --> 1:15:44.420\n Of course, because almost all of these rights are traditional English rights, they exist\n\n1:15:44.420 --> 1:15:49.000\n in the English Bill of Rights, in the English Petition of Rights, they exist in force.\n\n1:15:49.000 --> 1:15:50.000\n All of these are traditional.\n\n1:15:50.000 --> 1:15:51.000\n And what they're trying to do is perfect that.\n\n1:15:51.000 --> 1:15:54.040\n They're trying to take the British system and perfect it.\n\n1:15:54.040 --> 1:15:59.480\n But you keep leaving out that they want to be like England in that they want to have\n\n1:15:59.480 --> 1:16:01.160\n an independent nation.\n\n1:16:01.160 --> 1:16:04.640\n An independent nation is not a collection of individual liberties.\n\n1:16:04.640 --> 1:16:09.000\n An independent nation, the first sentence of the Declaration of Independence is the\n\n1:16:09.000 --> 1:16:13.120\n declaration that there is a collective right, that we as a people are breaking the bonds\n\n1:16:13.120 --> 1:16:17.820\n with another people, and we're going to take our place, our equal station, among the nations\n\n1:16:17.820 --> 1:16:18.820\n of the earth.\n\n1:16:18.820 --> 1:16:20.240\n But for what purpose?\n\n1:16:20.240 --> 1:16:22.200\n The purpose is to protect individual rights.\n\n1:16:22.200 --> 1:16:24.080\n And there's no collective right.\n\n1:16:24.080 --> 1:16:25.840\n Your argument is completely circular.\n\n1:16:25.840 --> 1:16:32.800\n You're not allowing the possibility that there could be great and decent men that you and\n\n1:16:32.800 --> 1:16:39.760\n I both admire who wanted the independence of their nation, not because that would give\n\n1:16:39.760 --> 1:16:45.200\n individuals liberty, but because the independence of their nation was itself a great good.\n\n1:16:45.200 --> 1:16:48.920\n So we clearly disagree on this, because I don't think the independence of the nation\n\n1:16:48.920 --> 1:16:50.920\n is a good in and of itself, because it's –\n\n1:16:50.920 --> 1:16:52.720\n But did they think it was?\n\n1:16:52.720 --> 1:16:54.200\n I don't think they did.\n\n1:16:54.200 --> 1:17:02.080\n And this is why they tried so hard not to break from England, and why many of them struggled,\n\n1:17:02.080 --> 1:17:07.240\n really, really struggled with having a revolution, because England was pretty good, right?\n\n1:17:07.240 --> 1:17:08.240\n England was the best.\n\n1:17:08.240 --> 1:17:12.600\n And this is where we should get to the universality of these things, because I do think England\n\n1:17:12.600 --> 1:17:18.080\n was the best, and universally and absolutely was the best system out there.\n\n1:17:18.080 --> 1:17:23.280\n And they struggled to break from England, because they didn't view the value of having\n\n1:17:23.280 --> 1:17:25.040\n a nation as the primary.\n\n1:17:25.040 --> 1:17:30.300\n But what they identified in England is certain flaws in the system that created situations\n\n1:17:30.300 --> 1:17:32.540\n in which their rights were being violated.\n\n1:17:32.540 --> 1:17:38.100\n So they figured the only option in order to secure these rights is to break away from\n\n1:17:38.100 --> 1:17:39.320\n England and secure a nation.\n\n1:17:39.320 --> 1:17:44.360\n Now, I am not an anarchist, as Michael Malice is, because we've discussed it.\n\n1:17:44.360 --> 1:17:46.440\n I believe you need nations.\n\n1:17:46.440 --> 1:17:48.980\n You need nations to secure those rights.\n\n1:17:48.980 --> 1:17:53.080\n That is, the rights are not – you can't secure those rights without having a nation.\n\n1:17:53.080 --> 1:17:55.160\n But the nation is just a means to an end.\n\n1:17:55.160 --> 1:17:58.920\n The end is the rights, and I think that's how the founders understood it, and that's\n\n1:17:58.920 --> 1:18:01.560\n why they created this kind of country.\n\n1:18:01.560 --> 1:18:07.400\n I think this is a good place to ask about common welfare and cohesion.\n\n1:18:07.400 --> 1:18:14.600\n Let me say what John Donne wrote that, quote, no man is an island entire of itself.\n\n1:18:14.600 --> 1:18:18.600\n Every man is a piece of the continent, a part of the main.\n\n1:18:18.600 --> 1:18:25.720\n He went on, any man's death diminishes me, because I am involved in mankind, and therefore\n\n1:18:25.720 --> 1:18:29.080\n never sent to know for whom the bell tolls.\n\n1:18:29.080 --> 1:18:32.120\n It tolls for thee.\n\n1:18:32.120 --> 1:18:40.040\n So let's talk about individualism and cohesion, not just at the political level, but at a\n\n1:18:40.040 --> 1:18:43.600\n philosophical level for the human condition.\n\n1:18:43.600 --> 1:18:45.140\n What is central?\n\n1:18:45.140 --> 1:18:49.760\n What is the role of other humans in our lives?\n\n1:18:49.760 --> 1:18:51.160\n What's the importance of cohesion?\n\n1:18:51.160 --> 1:18:53.080\n This is something you've talked about.\n\n1:18:53.080 --> 1:19:00.040\n So Aaron said that the beauty of the founding documents is that they create a cohesive union\n\n1:19:00.040 --> 1:19:07.600\n that protects the individual freedoms, but you have spoken about the value of the union,\n\n1:19:07.600 --> 1:19:13.240\n the common welfare, the cohesion in itself.\n\n1:19:13.240 --> 1:19:19.880\n So can you maybe elaborate on what is the role of cohesion and the collective, not to\n\n1:19:19.880 --> 1:19:25.040\n use that term, but multiple humans together connected in the human condition?\n\n1:19:25.040 --> 1:19:30.600\n Sure, I keep getting the feeling that Yaron and I are actually having a disagreement about\n\n1:19:30.600 --> 1:19:37.280\n empirical reality, because I think that enlightenment rationalist political thought features the\n\n1:19:37.280 --> 1:19:40.920\n individual, it features the state.\n\n1:19:40.920 --> 1:19:46.760\n There isn't really a nation other than the nation, the people as a collective is created\n\n1:19:46.760 --> 1:19:51.520\n by the state, and when the state disappears, then the collective disappears.\n\n1:19:51.520 --> 1:19:58.840\n Now, I think that when conservatives of all stripes look at this kind of thinking, that\n\n1:19:58.840 --> 1:20:04.000\n there's the individuals and then there's the state, and there really isn't anything else.\n\n1:20:04.000 --> 1:20:10.020\n When they look at that, they say, even before you get to consequences, it's a terrible theory\n\n1:20:10.020 --> 1:20:16.120\n because when we try to understand any field of inquiry, any domain, any subject area,\n\n1:20:16.120 --> 1:20:25.240\n when you try to understand it, we try to come up with a small number of concepts and of\n\n1:20:25.240 --> 1:20:33.000\n relations among the concepts, which is supposed to be able to explain, to illuminate as much\n\n1:20:33.000 --> 1:20:37.360\n as possible the important things that are taking place in the domain.\n\n1:20:37.360 --> 1:20:42.040\n And conservatives look at this, individuals and the state, and they say, you're missing\n\n1:20:42.040 --> 1:20:50.160\n most of what's going on in politics, also in personal human relations as well.\n\n1:20:50.160 --> 1:20:54.400\n But it just doesn't look like a description of human beings, it looks like a completely\n\n1:20:54.400 --> 1:20:55.720\n artificial thing.\n\n1:20:55.720 --> 1:20:59.160\n And then conservatives say, well, look, once you adopt this artificial thing, then the\n\n1:20:59.160 --> 1:21:02.780\n consequences are horrific because you're not describing reality.\n\n1:21:02.780 --> 1:21:12.000\n So a conservative reality begins with an empirical view of what are human beings like, and the\n\n1:21:12.000 --> 1:21:16.280\n first thing you notice about human beings, or at least the first thing I think conservatives\n\n1:21:16.280 --> 1:21:20.800\n notice is that they're sticky, is that they clump, they turn into groups.\n\n1:21:20.800 --> 1:21:27.200\n And you take any arbitrary collection of human beings and set them to a task, or even just\n\n1:21:27.200 --> 1:21:33.580\n leave them alone, and they quickly form into groups and those groups are always structured\n\n1:21:33.580 --> 1:21:34.580\n as hierarchies.\n\n1:21:34.580 --> 1:21:38.080\n This is this competition within the hierarchy, who's going to be the leader, who's going\n\n1:21:38.080 --> 1:21:39.400\n to be number two.\n\n1:21:39.400 --> 1:21:46.880\n But everywhere you look in human societies, universally, there are groups, the groups\n\n1:21:46.880 --> 1:21:51.080\n compete and they're structured internally as hierarchies, and then there are internal\n\n1:21:51.080 --> 1:21:55.040\n competitions for who leads the different groups.\n\n1:21:55.040 --> 1:22:00.360\n And when we think about scientific explanation, we allow that there are different levels of\n\n1:22:00.360 --> 1:22:07.560\n explanation that a macroscopic object like a table, it doesn't have properties that can\n\n1:22:07.560 --> 1:22:13.040\n be directly derived from the properties of the atoms or the molecules or the microfibers\n\n1:22:13.040 --> 1:22:15.480\n that make up the table.\n\n1:22:15.480 --> 1:22:21.040\n And that's understood, that there's what academic philosophers call emergent properties,\n\n1:22:21.040 --> 1:22:25.320\n that when you get up to the level of the table, it has properties like that you can't put\n\n1:22:25.320 --> 1:22:31.040\n your fist through it, which you can't necessarily know just by looking at the atoms alone.\n\n1:22:31.040 --> 1:22:36.140\n And I think conservatives say the same thing is true for political theory, for social theory,\n\n1:22:36.140 --> 1:22:41.080\n that looking at an individual human being and thinking about what does that individual\n\n1:22:41.080 --> 1:22:46.280\n human being need, which Jeroen does very eloquently in his writings.\n\n1:22:46.280 --> 1:22:53.320\n But that doesn't tell you what the characteristics are of this hierarchically structured group.\n\n1:22:53.320 --> 1:22:56.680\n As soon as you have that, it has its own qualities.\n\n1:22:56.680 --> 1:23:01.600\n So an example, the question of what holds these groups together, and we need to answer\n\n1:23:01.600 --> 1:23:03.400\n that question.\n\n1:23:03.400 --> 1:23:07.360\n I try to answer it by saying there's such a thing as mutual loyalty.\n\n1:23:07.360 --> 1:23:14.160\n Mutual loyalty is shorthand for human beings, individuals have the capacity to include another\n\n1:23:14.160 --> 1:23:19.240\n individual within their self, within their conception of their self.\n\n1:23:19.240 --> 1:23:27.680\n When two people do it, it creates a bond, like a bond between two atoms creates a molecule.\n\n1:23:27.680 --> 1:23:30.660\n That doesn't mean that they lose their individuality.\n\n1:23:30.660 --> 1:23:33.640\n Within the group, they may still continue competing with one another.\n\n1:23:33.640 --> 1:23:39.960\n But that doesn't mean that there isn't, in reality, a bond, and that real bond is the\n\n1:23:39.960 --> 1:23:46.420\n stuff of which political events and political history are made, is the coming together,\n\n1:23:46.420 --> 1:23:51.280\n the cohesion and the dissolution of these bonded loyalty groups.\n\n1:23:51.280 --> 1:23:54.600\n That's the reality of politics.\n\n1:23:54.600 --> 1:24:00.680\n And so when I hear these discussions about individuals in the state, I feel like we're\n\n1:24:00.680 --> 1:24:05.840\n missing most of the reality, and in order to understand the political reality, we need\n\n1:24:05.840 --> 1:24:12.000\n to understand what makes human beings coherent to groups, what makes them dissolve, what\n\n1:24:12.000 --> 1:24:16.400\n makes the groups come apart and end up creating civil wars and that kind of thing.\n\n1:24:16.400 --> 1:24:25.680\n I think we also need to know, in practice, rival groups do come together and bond.\n\n1:24:25.680 --> 1:24:33.560\n I mean, basically, when we think about democratic society, we're talking about different groups,\n\n1:24:33.560 --> 1:24:37.800\n we can call them tribes, or you can come up with a different name, but different tribal\n\n1:24:37.800 --> 1:24:43.560\n groupings with different views, they come together to form a nation, and they're able\n\n1:24:43.560 --> 1:24:48.800\n to do that, even though often they hate each other, like we were talking about the American\n\n1:24:48.800 --> 1:24:53.400\n Revolution, and often they hate each other, and nevertheless, they're able to come together.\n\n1:24:53.400 --> 1:24:54.400\n Why?\n\n1:24:54.400 --> 1:24:55.400\n How?\n\n1:24:55.400 --> 1:25:00.840\n And that leads us into questions like, how does honor, the giving of honor by one group\n\n1:25:00.840 --> 1:25:08.800\n to another, how does that increase the mutual loyalty between groups that are still competing\n\n1:25:08.800 --> 1:25:10.280\n with one another?\n\n1:25:10.280 --> 1:25:15.040\n All of these questions, I think we have to answer them in order to be able to talk about\n\n1:25:15.040 --> 1:25:17.920\n politics.\n\n1:25:17.920 --> 1:25:23.720\n And I think the reason, the first reason why one should approach politics as a conservative\n\n1:25:23.720 --> 1:25:29.000\n rather than as an individualist is because it gives us these theoretical tools to be\n\n1:25:29.000 --> 1:25:33.720\n able to talk about reality, which we don't have as long as we keep within the individualist\n\n1:25:33.720 --> 1:25:34.720\n framework.\n\n1:25:34.720 --> 1:25:40.120\n As we're talking, the metaphor that's popping up into my mind, and this is also something\n\n1:25:40.120 --> 1:25:46.440\n that bothers me with theoretical physics, the metaphor is there's some sense in which\n\n1:25:46.440 --> 1:25:51.640\n this thing's called theories of everything, where you try to describe the basic laws of\n\n1:25:51.640 --> 1:25:55.960\n physics, how they interact together, and once you do, you have a sense that you understand\n\n1:25:55.960 --> 1:25:57.960\n all of reality.\n\n1:25:57.960 --> 1:25:59.240\n In a sense, you do.\n\n1:25:59.240 --> 1:26:05.240\n And that to me, that to me is understanding the individual, like how the individual behaves\n\n1:26:05.240 --> 1:26:06.240\n in this world.\n\n1:26:06.240 --> 1:26:12.400\n But then you're saying that they're, hey, hey, you're also forgetting chemistry, biology,\n\n1:26:12.400 --> 1:26:17.880\n how all of that actually comes together, the stickiness, the stickiness of molecules and\n\n1:26:17.880 --> 1:26:22.080\n how they build different systems and they, some systems can kill each other, some systems\n\n1:26:22.080 --> 1:26:28.620\n can flourish, some can make pancakes and bananas and some can make poison and all those kinds\n\n1:26:28.620 --> 1:26:36.600\n of things that we need to be able to, we need to consider the full stack of things that\n\n1:26:36.600 --> 1:26:40.760\n are constructed from the fundamental basics.\n\n1:26:40.760 --> 1:26:47.480\n And I guess, Yaron, you're saying that, no, you're just like the theoretical physicist,\n\n1:26:47.480 --> 1:26:54.000\n it all starts at the bottom, like if you need to preserve the fundamentals of reality, which\n\n1:26:54.000 --> 1:27:01.320\n is the individual, like the basic atom of human society is the individual, do you?\n\n1:27:01.320 --> 1:27:07.280\n So yes, so the basic unit, the basic moral unit, the basic ethical unit in society is\n\n1:27:07.280 --> 1:27:08.280\n the individual.\n\n1:27:08.280 --> 1:27:13.160\n And yeah, of course we form groups and you can't understand history unless you understand\n\n1:27:13.160 --> 1:27:18.420\n group formation and group motivation and I have a view about what kind of groups should\n\n1:27:18.420 --> 1:27:25.400\n be formed and politically, from a political perspective, voluntary ones, ones in which\n\n1:27:25.400 --> 1:27:32.460\n we join when we want to join and we can leave when we want to leave and ones that help us\n\n1:27:32.460 --> 1:27:38.740\n and clearly groups help us pursue whatever it is a goal is ultimately.\n\n1:27:38.740 --> 1:27:43.600\n So in the pursuit of happiness, there are lots of groups that one wants to form, whether\n\n1:27:43.600 --> 1:27:49.460\n it's marriage, whether it's businesses, whether it's sports teams, there are lots of different\n\n1:27:49.460 --> 1:27:54.180\n groups one wants to form, but the question is what is the standard of well being?\n\n1:27:54.180 --> 1:28:01.060\n Is it the standard of well being some algorithm that maximizes the well being of a group,\n\n1:28:01.060 --> 1:28:03.560\n some utilitarian function?\n\n1:28:03.560 --> 1:28:11.320\n Is it something that's inherent in the group that we can measure as goodness and to help\n\n1:28:11.320 --> 1:28:16.200\n with individuals within as long as we can get the group to function well, we don't really\n\n1:28:16.200 --> 1:28:17.960\n care about where the individuals are.\n\n1:28:17.960 --> 1:28:23.680\n So to me, the goal of creating groups is the well being of the individual and that's why\n\n1:28:23.680 --> 1:28:27.680\n it needs to be voluntary and that's why there has to be a way out of those.\n\n1:28:27.680 --> 1:28:31.200\n Sometimes it's costly, it's not a cheap out, that's why you should really think about what\n\n1:28:31.200 --> 1:28:36.720\n groups you and this on an issue that's very controversial, maybe we can discuss, maybe\n\n1:28:36.720 --> 1:28:37.720\n not.\n\n1:28:37.720 --> 1:28:42.860\n To me, immigration is so important, open immigration or free immigration is because that's another\n\n1:28:42.860 --> 1:28:48.000\n group that I would like people to be able to voluntarily choose both in and out and\n\n1:28:48.000 --> 1:28:54.120\n I'd like to see people be able to go and join that group that they believe will allow for\n\n1:28:54.120 --> 1:28:55.120\n the pursuit of happiness.\n\n1:28:55.120 --> 1:29:00.200\n But let me say that that's a description of an ideal, what I'm just saying.\n\n1:29:00.200 --> 1:29:03.400\n I recognize that that's not the reality in which we live.\n\n1:29:03.400 --> 1:29:06.800\n I recognize that that's not the reality in which history.\n\n1:29:06.800 --> 1:29:15.560\n Recognizing that the individual exists in a sense, philosophically, is a massive achievement.\n\n1:29:15.560 --> 1:29:21.360\n Human beings, however they evolved, clearly we started out in a tribal context in which\n\n1:29:21.360 --> 1:29:23.000\n the individual didn't matter.\n\n1:29:23.000 --> 1:29:28.600\n We followed the leader, the competition was for power, power over the group and dictates\n\n1:29:28.600 --> 1:29:32.280\n how the group should work.\n\n1:29:32.280 --> 1:29:36.880\n The history of human beings is a history of gaining knowledge and part of the knowledge\n\n1:29:36.880 --> 1:29:39.640\n is the value of an individual.\n\n1:29:39.640 --> 1:29:44.400\n You can see that in religion, you can see that in philosophy, you can see that through\n\n1:29:44.400 --> 1:29:47.680\n the evolution.\n\n1:29:47.680 --> 1:29:52.420\n We evolved from tribes into nations and then empires and conflicts between nations and\n\n1:29:52.420 --> 1:29:54.200\n conflicts between empires.\n\n1:29:54.200 --> 1:29:56.080\n We tried a lot of different things, if you will.\n\n1:29:56.080 --> 1:30:01.040\n I don't think we always did it on purpose, but different philosophies, different sets\n\n1:30:01.040 --> 1:30:07.200\n of ideas drove us towards different collectives, different groupings, and different ways in\n\n1:30:07.200 --> 1:30:09.600\n which to structure.\n\n1:30:09.600 --> 1:30:14.840\n After 3,000 years of known history, there's history before that, but we don't know much\n\n1:30:14.840 --> 1:30:19.520\n about it, 3,000 years of known history, you can sit back and evaluate.\n\n1:30:19.520 --> 1:30:23.080\n I think that's what is done in the Enlightenment.\n\n1:30:23.080 --> 1:30:27.140\n You sit back, and certainly we can do it today, we can sit back and evaluate.\n\n1:30:27.140 --> 1:30:29.620\n What promotes human flourishing and what doesn't?\n\n1:30:29.620 --> 1:30:32.240\n What do we mean by human flourishing?\n\n1:30:32.240 --> 1:30:33.240\n Who's flourishing?\n\n1:30:33.240 --> 1:30:35.040\n Well, individual human beings.\n\n1:30:35.040 --> 1:30:39.440\n Now, since I don't believe in a zero sum world, and the world is not zero sum, we can see\n\n1:30:39.440 --> 1:30:44.440\n that, it's empirically possible to show that the world is not a zero sum game, my flourishing\n\n1:30:44.440 --> 1:30:49.400\n doesn't come at your expense, so I can show that a system that promotes my flourishing\n\n1:30:49.400 --> 1:30:53.280\n probably promotes your flourishing as well and promotes the general welfare in that sense\n\n1:30:53.280 --> 1:31:01.520\n because it promotes individuals flourishing, and we can look at all these examples of how\n\n1:31:01.520 --> 1:31:06.480\n we evolved and what leads to bloodshed and what doesn't and what promotes this ability\n\n1:31:06.480 --> 1:31:11.920\n to flourish as an individual, again, an achievement, the idea of individual flourishing, and then\n\n1:31:11.920 --> 1:31:17.300\n we can think about how to create a political system around that, a political system that\n\n1:31:17.300 --> 1:31:24.180\n recognizes and allows for the formation of groups, but just under the principle of voluntary.\n\n1:31:24.180 --> 1:31:29.580\n You can't be forced to join a group, you can't be coerced into forming a group other than\n\n1:31:29.580 --> 1:31:33.040\n the fact that you're born in a particular place, in a particular, you know, that in\n\n1:31:33.040 --> 1:31:37.560\n a sense, but that's not forced, there's a difference between metaphysics and between\n\n1:31:37.560 --> 1:31:38.560\n choices.\n\n1:31:38.560 --> 1:31:42.520\n So this is something that came up in the debate that Yoram said that not all human relations\n\n1:31:42.520 --> 1:31:48.400\n are voluntary, and you kind of emphasized that a lot of where we are is not voluntary.\n\n1:31:48.400 --> 1:31:51.880\n We're grounded, we're connected in so much.\n\n1:31:51.880 --> 1:32:00.000\n So how can a human be free in the way you're describing, individual be free if some part\n\n1:32:00.000 --> 1:32:04.440\n of who we are is not voluntary, some part of who we are is other people?\n\n1:32:04.440 --> 1:32:06.760\n Well because what do we mean by freedom?\n\n1:32:06.760 --> 1:32:10.940\n Freedom doesn't mean the negation of the laws of physics, right?\n\n1:32:10.940 --> 1:32:18.540\n Freedom doesn't mean ignoring, freedom means the ability within the scope of what's available\n\n1:32:18.540 --> 1:32:22.240\n for you to choose, being able to choose those things.\n\n1:32:22.240 --> 1:32:30.800\n So in a political context, freedom means, you know, the absence of coercion.\n\n1:32:30.800 --> 1:32:35.880\n So once you're an adult, you know, Yoram says you're born into a particular religious\n\n1:32:35.880 --> 1:32:39.400\n context, absolutely, but once you're an adult, I think it's incumbent on you to evaluate\n\n1:32:39.400 --> 1:32:45.640\n that religious context and look at different religions or nonreligion or whatever and choose\n\n1:32:45.640 --> 1:32:50.520\n your philosophy of life, choose your values, choose how you want to live your life.\n\n1:32:50.520 --> 1:32:51.520\n That's the freedom.\n\n1:32:51.520 --> 1:32:58.560\n The freedom is, one system says you're either coerced by the state or coerced by the group\n\n1:32:58.560 --> 1:33:06.200\n or coerced by society around you to follow a particular path, or the expectation is,\n\n1:33:06.200 --> 1:33:12.560\n the demand is, the pressure is to conform to a particular path, and my view is, no,\n\n1:33:12.560 --> 1:33:16.960\n you should be in a position to be able to choose your path, and that choice means you\n\n1:33:16.960 --> 1:33:23.480\n look around, you evaluate, you evaluate based on history, based on knowledge, based on all\n\n1:33:23.480 --> 1:33:26.040\n of these things, and you choose what that path would be.\n\n1:33:26.040 --> 1:33:28.800\n That's fundamentally what freedom means.\n\n1:33:28.800 --> 1:33:31.840\n Yes, you cannot choose your parents, but of course not.\n\n1:33:31.840 --> 1:33:34.760\n Nobody would claim that that's within the scope of what is possible.\n\n1:33:34.760 --> 1:33:43.600\n I think the coercion freedom dichotomy, these are too few concepts, coercion and freedom.\n\n1:33:43.600 --> 1:33:47.700\n It's too simplistic to be able to describe what we're actually dealing with.\n\n1:33:47.700 --> 1:33:56.720\n The traditional Anglo conservative view is that society has to be, it has to be ordered,\n\n1:33:56.720 --> 1:34:03.600\n it has to be disciplined, and there are two choices for how it can be ordered.\n\n1:34:03.600 --> 1:34:11.280\n One is that a people is, by its own traditions, you would say voluntarily, but these are mostly\n\n1:34:11.280 --> 1:34:16.640\n inherited traditions, by its own traditions, it is ordered.\n\n1:34:16.640 --> 1:34:23.440\n For example, people just in general will not go into somebody else's yard, because that's\n\n1:34:23.440 --> 1:34:27.600\n the custom here, is we don't go into somebody else's yard without their permission.\n\n1:34:27.600 --> 1:34:34.240\n Fortescue, we're talking about 500 years ago already, Fortescue says that the genius of\n\n1:34:34.240 --> 1:34:40.680\n the English people is that our government can be mild and apply very little coercion,\n\n1:34:40.680 --> 1:34:43.240\n because the people are so disciplined.\n\n1:34:43.240 --> 1:34:51.140\n When he says the people are so disciplined, what he's saying is that our nation, our tribes,\n\n1:34:51.140 --> 1:35:00.080\n we have strong traditions which channel people through tools of being honored and dishonored.\n\n1:35:00.080 --> 1:35:05.280\n That's a reality that exists in every society, and it's not captured by your distinction\n\n1:35:05.280 --> 1:35:08.840\n between coercion and lack of coercion.\n\n1:35:08.840 --> 1:35:16.520\n When I'm going to be dishonored if I don't care for my aging mother, I'm not being coerced\n\n1:35:16.520 --> 1:35:22.960\n like the state comes and puts a gun to my head, but I am being pressured and given guidelines.\n\n1:35:22.960 --> 1:35:31.320\n I'm saying that's wrong, and I'm saying that's dangerous, because that could easily be used\n\n1:35:31.320 --> 1:35:32.320\n for bad traditions.\n\n1:35:32.320 --> 1:35:34.320\n No, of course it is.\n\n1:35:34.320 --> 1:35:37.280\n What's the standard by which we evaluate what a good tradition is and what a bad tradition\n\n1:35:37.280 --> 1:35:38.280\n is?\n\n1:35:38.280 --> 1:35:39.280\n It's the English.\n\n1:35:39.280 --> 1:35:40.280\n You're getting to the standard too fast.\n\n1:35:40.280 --> 1:35:41.280\n Wait, wait.\n\n1:35:41.280 --> 1:35:42.280\n You're getting to the standard too fast.\n\n1:35:42.280 --> 1:35:47.160\n But first I want to know, factually, is it true that all societies work like this?\n\n1:35:47.160 --> 1:35:50.640\n Because if it's true that all societies work like this, then saying we should be free from\n\n1:35:50.640 --> 1:35:52.120\n it is just a fantasy.\n\n1:35:52.120 --> 1:35:53.120\n No.\n\n1:35:53.120 --> 1:35:54.700\n A, I don't think all societies work like this.\n\n1:35:54.700 --> 1:35:59.320\n I think much of what happened in America post founding in the 19th century didn't work like\n\n1:35:59.320 --> 1:36:00.320\n that.\n\n1:36:00.320 --> 1:36:03.320\n I think that's the genius of America, and I think what happened during the 19th century\n\n1:36:03.320 --> 1:36:08.360\n in the Industrial Revolution, what happened in the 19th century to some extent globally\n\n1:36:08.360 --> 1:36:11.000\n but certainly in the United States didn't work that way.\n\n1:36:11.000 --> 1:36:12.000\n It broke tradition.\n\n1:36:12.000 --> 1:36:16.920\n I think all innovation breaks tradition, and I think that's what the genius of this country\n\n1:36:16.920 --> 1:36:21.400\n is and the post enlightenment world is.\n\n1:36:21.400 --> 1:36:24.520\n I think pre that tradition, they work that way.\n\n1:36:24.520 --> 1:36:28.280\n And then the question is, do people understand why they do what they do?\n\n1:36:28.280 --> 1:36:35.060\n That is, I don't want people doing what I think is right just because I think it's right\n\n1:36:35.060 --> 1:36:42.920\n and I've created a society in which somebody founded this country in a particular way,\n\n1:36:42.920 --> 1:36:43.920\n so we're just going to follow.\n\n1:36:43.920 --> 1:36:45.420\n I want people to understand what they're doing.\n\n1:36:45.420 --> 1:36:48.960\n So I want people to have a respect for property, not because it's a tradition, but because\n\n1:36:48.960 --> 1:36:53.000\n they understand the value of a respect for property.\n\n1:36:53.000 --> 1:36:56.840\n I want people not to murder one another, not because there's a commandment, thou shall\n\n1:36:56.840 --> 1:37:03.240\n not murder, but because they have an understanding of why murdering is bad and wrong and bad\n\n1:37:03.240 --> 1:37:07.040\n for them and bad for the kind of world that they want to live in.\n\n1:37:07.040 --> 1:37:13.080\n And I think that's what we achieve through enlightenment, through education, and where\n\n1:37:13.080 --> 1:37:19.520\n we don't treat people just as a blob, a tribe that just follows orders, but we now treat\n\n1:37:19.520 --> 1:37:25.840\n individuals as capable of thinking for themselves, capable for discovering truth, capable of\n\n1:37:25.840 --> 1:37:30.840\n figuring out their own values, and that's the big break between.\n\n1:37:30.840 --> 1:37:36.720\n And this is the break, I think, that the Declaration represents, the break between society that\n\n1:37:36.720 --> 1:37:41.620\n is based on tradition, following commandments, following rules, because they are the rules,\n\n1:37:41.620 --> 1:37:46.480\n because they are the commandments, and a society where individuals understand those rules,\n\n1:37:46.480 --> 1:37:47.480\n understand.\n\n1:37:47.480 --> 1:37:51.360\n Yes, it's now become a tradition, let's say, to respect individual rights, to respect\n\n1:37:51.360 --> 1:37:54.840\n property rights, but they're not following it because it's a tradition.\n\n1:37:54.840 --> 1:38:00.080\n They're following it because they understand what it is about it that makes it good.\n\n1:38:00.080 --> 1:38:06.080\n So that's the world, I think, that we were on the process of evolving towards, and that\n\n1:38:06.080 --> 1:38:11.000\n is what got destroyed in the 20th century and has certainly disappeared today.\n\n1:38:11.000 --> 1:38:15.480\n And I think that's the great tragedy, is that we're evolving to a place where people understood\n\n1:38:15.480 --> 1:38:18.320\n the values that represent it.\n\n1:38:18.320 --> 1:38:23.360\n Of course, the danger with tradition is, I mean, we'll agree, right?\n\n1:38:23.360 --> 1:38:25.880\n Yeah, it's okay to kill the Jew, right?\n\n1:38:25.880 --> 1:38:30.080\n Or it's okay to steal people's property if they're of a certain color, or it's okay to\n\n1:38:30.080 --> 1:38:31.080\n enslave.\n\n1:38:31.080 --> 1:38:32.080\n Those are all traditions.\n\n1:38:32.080 --> 1:38:36.320\n And yet, once you stop and say, but what are they based on?\n\n1:38:36.320 --> 1:38:37.320\n Is this right?\n\n1:38:37.320 --> 1:38:40.840\n Is this just, based on some moral law?\n\n1:38:40.840 --> 1:38:42.440\n No, it's not.\n\n1:38:42.440 --> 1:38:43.600\n There's something wrong here.\n\n1:38:43.600 --> 1:38:46.440\n We can't achieve happiness and success if we follow these rules.\n\n1:38:46.440 --> 1:38:50.220\n You're talking about reason and tradition, but I think I would love to sort of linger\n\n1:38:50.220 --> 1:38:54.800\n on the stickiness of humans that you describe.\n\n1:38:54.800 --> 1:39:00.000\n So you kind of said this primary, the individuals, is primary and that was a great invention.\n\n1:39:00.000 --> 1:39:09.120\n But to me, it's not at all obvious that somehow, that the invention that humans have been practicing\n\n1:39:09.120 --> 1:39:20.600\n for a very long time of the stickiness of community, of family, of love, that's not\n\n1:39:20.600 --> 1:39:28.360\n obvious to me, that's not also fundamental to human flourishing and should be celebrated\n\n1:39:28.360 --> 1:39:29.360\n and protected.\n\n1:39:29.360 --> 1:39:30.360\n Of course it is.\n\n1:39:30.360 --> 1:39:38.640\n Now, I suppose the argument you're making is when you start to let the state define\n\n1:39:38.640 --> 1:39:42.760\n what the stickiness, how the stickiness looks between humans, so you're really like the\n\n1:39:42.760 --> 1:39:44.600\n voluntary aspect.\n\n1:39:44.600 --> 1:39:51.920\n But I just want to sort of, the observation is, humans seem to be pretty happy when they\n\n1:39:51.920 --> 1:39:56.680\n form communities, however you define that.\n\n1:39:56.680 --> 1:39:58.640\n So romantic partnership, family.\n\n1:39:58.640 --> 1:39:59.800\n Some communities.\n\n1:39:59.800 --> 1:40:01.320\n Some communities.\n\n1:40:01.320 --> 1:40:02.860\n People are miserable in other communities.\n\n1:40:02.860 --> 1:40:05.160\n So the nature of the community matters, right?\n\n1:40:05.160 --> 1:40:06.160\n We know this.\n\n1:40:06.160 --> 1:40:10.480\n We know that some bondings are not healthy and not good for the individuals involved\n\n1:40:10.480 --> 1:40:13.040\n and they don't thrive.\n\n1:40:13.040 --> 1:40:17.000\n So I absolutely, I mean, I'm a lover, not a fighter, right?\n\n1:40:17.000 --> 1:40:18.840\n I'm a huge believer in love.\n\n1:40:18.840 --> 1:40:22.040\n The whole philosophy I think is a love based philosophy.\n\n1:40:22.040 --> 1:40:23.920\n I fight in order to love, right?\n\n1:40:23.920 --> 1:40:30.200\n So love is at the core of all of this and it's a love of life.\n\n1:40:30.200 --> 1:40:34.960\n It's a love of the world out there and it's a love of other people because they represent\n\n1:40:34.960 --> 1:40:37.160\n a value to you.\n\n1:40:37.160 --> 1:40:43.320\n So the stickiness is there, it's, you know, my point is A, it should be chosen.\n\n1:40:43.320 --> 1:40:46.680\n It should be consciously chosen and this is, put aside the state.\n\n1:40:46.680 --> 1:40:48.240\n Forget the state for a minute.\n\n1:40:48.240 --> 1:40:49.360\n Forget coercion.\n\n1:40:49.360 --> 1:40:51.160\n Forget all that.\n\n1:40:51.160 --> 1:40:56.280\n What I would encourage individuals to do, and this is where, you know, I'm not primarily\n\n1:40:56.280 --> 1:41:01.400\n a political, you know, interested in politics, although I tend to talk most about that.\n\n1:41:01.400 --> 1:41:05.800\n I'm primarily interested in human beings and how they live in a sense in morality.\n\n1:41:05.800 --> 1:41:11.440\n And what I would urge individuals to do is to think about their relationships, to choose\n\n1:41:11.440 --> 1:41:16.920\n the best relationships possible, but to seek out great relationships because other human\n\n1:41:16.920 --> 1:41:20.240\n beings are an immense value to us.\n\n1:41:20.240 --> 1:41:25.320\n And you know, when I write, you know, maybe you won't quote this or not, but when I write\n\n1:41:25.320 --> 1:41:31.600\n that, you know, about the trade of principle and trading, you know, it's easy and obvious\n\n1:41:31.600 --> 1:41:34.080\n to think of it as a materialistic kind of thing.\n\n1:41:34.080 --> 1:41:38.240\n You know, I get, you know, I do the chores this day and my wife does the chores the other\n\n1:41:38.240 --> 1:41:39.520\n day and we're trading.\n\n1:41:39.520 --> 1:41:42.960\n But trading is much more subtle than that and much more, can be much more spiritual\n\n1:41:42.960 --> 1:41:43.960\n than that.\n\n1:41:43.960 --> 1:41:48.240\n It's about the trading in emotions.\n\n1:41:48.240 --> 1:41:53.720\n It's about the way one sees each other, it's what one gets from one another.\n\n1:41:53.720 --> 1:41:55.800\n I think friendship is a form of trade.\n\n1:41:55.800 --> 1:42:01.240\n Now I know that that seems to make it material, but I don't think of trade as a material\n\n1:42:01.240 --> 1:42:02.240\n thing.\n\n1:42:02.240 --> 1:42:04.360\n Friendship is incredibly important in life.\n\n1:42:04.360 --> 1:42:06.520\n Love is incredibly important in life.\n\n1:42:06.520 --> 1:42:10.280\n You know, having a group of friends is incredibly important in life.\n\n1:42:10.280 --> 1:42:11.880\n All of these are sticky and important.\n\n1:42:11.880 --> 1:42:12.880\n Okay.\n\n1:42:12.880 --> 1:42:14.820\n How can I try to be eloquent on this?\n\n1:42:14.820 --> 1:42:25.040\n So if you give people freedom, if you give people, well, not politics, relations, relationships.\n\n1:42:25.040 --> 1:42:28.960\n So this is interesting because we have an interesting dynamic going on here in terms\n\n1:42:28.960 --> 1:42:36.200\n of beliefs, they're differing and there was interesting overlaps, but there's a worry.\n\n1:42:36.200 --> 1:42:39.800\n If you look at human history and you study the lessons of history and you look at modern\n\n1:42:39.800 --> 1:42:45.560\n society, if you give people freedom in terms of stickiness and human relations and so on\n\n1:42:45.560 --> 1:42:53.680\n full, like if you not give people freedom, emphasize freedom as the highest ideal.\n\n1:42:53.680 --> 1:43:00.160\n You start getting more tender online dating, the stickiness dissolves just like in chemistry.\n\n1:43:00.160 --> 1:43:03.880\n You start to have a gas versus a liquid, right?\n\n1:43:03.880 --> 1:43:04.880\n That's the worry.\n\n1:43:04.880 --> 1:43:08.560\n So you have to study what actually happens.\n\n1:43:08.560 --> 1:43:17.680\n If you emphasize that the stickiness, the bonds of humans is holding you back, the exercise\n\n1:43:17.680 --> 1:43:25.680\n of voluntary choice is the highest ideal, the danger of that is for that to be implemented\n\n1:43:25.680 --> 1:43:31.720\n or interpreted in certain kinds of ways by us flawed humans that are not, I mean, you\n\n1:43:31.720 --> 1:43:35.640\n could say we're perfectly reasonable and rational, we can think through all of our decisions,\n\n1:43:35.640 --> 1:43:41.120\n but really, I mean, especially you're young, you get horny, you make decisions that are\n\n1:43:41.120 --> 1:43:42.640\n suboptimal perhaps.\n\n1:43:42.640 --> 1:43:49.400\n So the point is you have to look at reality of when you emphasize different things.\n\n1:43:49.400 --> 1:43:55.560\n So when you talk about what is the ideal life, what is the ideal relations, you have to also\n\n1:43:55.560 --> 1:43:57.320\n think like, what are you emphasizing?\n\n1:43:57.320 --> 1:44:02.520\n I think you both agree on what's important, that community can be important, that freedom\n\n1:44:02.520 --> 1:44:06.920\n is important, but what are you emphasizing and you're really emphasizing the individual\n\n1:44:06.920 --> 1:44:16.720\n and you're emphasizing, Yoram, you're emphasizing more of the community, of the family, of the\n\n1:44:16.720 --> 1:44:18.040\n stickiness of the nation.\n\n1:44:18.040 --> 1:44:22.520\n Well, look, I don't want to deny the place of the individual.\n\n1:44:22.520 --> 1:44:33.160\n I think that there really is a very great change in civilization when the books of Moses\n\n1:44:33.160 --> 1:44:39.080\n announce that the individual is created in the image of God.\n\n1:44:39.080 --> 1:44:46.320\n That's a step that's, as far as we know, without precedent before that in history, and to a\n\n1:44:46.320 --> 1:44:53.280\n very large degree, I mean, one of the kind of unspoken things going on is that Yoram\n\n1:44:53.280 --> 1:45:00.400\n and I really do agree on all sorts of things, I think in part because we're both Jewish.\n\n1:45:00.400 --> 1:45:04.200\n You did say Yoram is basically Moses, yes sir.\n\n1:45:04.200 --> 1:45:10.200\n No, I said he was channeling Moses, but that's still, in my book, that's still pretty impressive.\n\n1:45:10.200 --> 1:45:13.720\n No, that's a compliment, I took it as one.\n\n1:45:13.720 --> 1:45:14.720\n For me, that's a compliment.\n\n1:45:14.720 --> 1:45:19.840\n And we'll talk about this a little bit just for the listeners, just so they know, Yoram,\n\n1:45:19.840 --> 1:45:25.700\n amongst many things, we'll talk about the virtue of nationalism, but you're also a religious\n\n1:45:25.700 --> 1:45:32.000\n scholar of sorts, or at least leverage the Bible for much, not much, but some of the\n\n1:45:32.000 --> 1:45:33.520\n wisdom in your life.\n\n1:45:33.520 --> 1:45:40.040\n Look, the way that Yoram looks at enlightenment, or maybe at Ayn Rand, that's the way that\n\n1:45:40.040 --> 1:45:45.720\n I see the Hebrew scripture and the tradition that comes from it.\n\n1:45:45.720 --> 1:45:51.600\n It has the same kind of place in my life, and I just, I don't know how much we want\n\n1:45:51.600 --> 1:46:01.320\n to explore it, but I think that the agreement that we do have about the positive value of\n\n1:46:01.320 --> 1:46:08.120\n the creative individual, the positive value of the individual's desire to improve the\n\n1:46:08.120 --> 1:46:17.640\n world, and in my book that means including his or her desire to improve his family, his\n\n1:46:17.640 --> 1:46:24.240\n tribe, his congregation, his nation, but it still comes from this kind of, what Yoram\n\n1:46:24.240 --> 1:46:29.200\n calls selfishness, the desire to make things better for yourself.\n\n1:46:29.200 --> 1:46:34.460\n In Hebrew Bible and in Judaism, that just is a positive thing.\n\n1:46:34.460 --> 1:46:39.300\n Of course, it can be taken too far, but it just is positive, and it doesn't carry these\n\n1:46:39.300 --> 1:46:44.180\n kinds of, you should turn the other cheek, you should give away your cloak, you should\n\n1:46:44.180 --> 1:46:49.280\n love your enemy, these kinds of Christian tropes do not exist in Judaism, and so it\n\n1:46:49.280 --> 1:46:55.120\n just, I like listening to Yoram, I do feel like he goes too far on various things, but\n\n1:46:55.120 --> 1:47:04.520\n I also hear underneath it, I can sort of hear the Jewish current and the resistance to things\n\n1:47:04.520 --> 1:47:06.520\n about Christianity that Jews often find.\n\n1:47:06.520 --> 1:47:09.560\n Okay, I'll ask you a question there.\n\n1:47:09.560 --> 1:47:12.720\n Can you make an argument for turn the other cheek?\n\n1:47:12.720 --> 1:47:13.720\n No.\n\n1:47:13.720 --> 1:47:18.760\n I tend to, I guess you would equate that with altruism.\n\n1:47:18.760 --> 1:47:19.760\n I tend to.\n\n1:47:19.760 --> 1:47:20.760\n Unjustice.\n\n1:47:20.760 --> 1:47:23.760\n It's unjust to turn the other cheek.\n\n1:47:23.760 --> 1:47:24.760\n I agree.\n\n1:47:24.760 --> 1:47:25.760\n Okay.\n\n1:47:25.760 --> 1:47:29.320\n You don't love yourself if you're turning the other cheek, it's a lack of love, lack\n\n1:47:29.320 --> 1:47:30.320\n of self respect.\n\n1:47:30.320 --> 1:47:38.520\n Well, let me push back on that, because I like turn the other cheek, especially on Twitter.\n\n1:47:38.520 --> 1:47:42.720\n So I like block the offender on Twitter.\n\n1:47:42.720 --> 1:47:54.240\n No, so Twitter aside is more like you're investing in the long term version of yourself versus\n\n1:47:54.240 --> 1:47:55.800\n the short term.\n\n1:47:55.800 --> 1:47:59.840\n So that's the way I think about it, is like the energy you put onto the world.\n\n1:47:59.840 --> 1:48:05.520\n The turn the other cheek philosophy allows you to walk through the fire gracefully.\n\n1:48:05.520 --> 1:48:06.520\n It's some sense.\n\n1:48:06.520 --> 1:48:13.040\n I mean, perhaps you would reframe that as not, then that's not being altruistic or whatever,\n\n1:48:13.040 --> 1:48:19.040\n but there is something pragmatic about that kind of approach to life.\n\n1:48:19.040 --> 1:48:22.200\n Disciplining yourself so that you become a better version of yourself.\n\n1:48:22.200 --> 1:48:28.960\n I mean, not only do we agree, but I think every religious and philosophical tradition\n\n1:48:28.960 --> 1:48:35.320\n probably has a version of that, even Kant, who we joined together in finding to be terrible.\n\n1:48:35.320 --> 1:48:39.240\n Even Kant makes that distinction between the short term interest and the long term interest.\n\n1:48:39.240 --> 1:48:41.680\n So I think that's universal.\n\n1:48:41.680 --> 1:48:44.380\n I don't know of anybody who's really disagreeing about that.\n\n1:48:44.380 --> 1:48:49.280\n The thing that we were talking about a couple of minutes ago before we got onto this tangent\n\n1:48:49.280 --> 1:48:59.280\n is the relationship between the individual who is in the image of God and is of value\n\n1:48:59.280 --> 1:49:00.840\n as an individual.\n\n1:49:00.840 --> 1:49:07.880\n Nevertheless, there's this question about what is good for that person and also what\n\n1:49:07.880 --> 1:49:08.880\n makes him happy.\n\n1:49:08.880 --> 1:49:13.160\n I'm not sure that those are exactly the same things, but they're both certainly relevant\n\n1:49:13.160 --> 1:49:15.520\n and important.\n\n1:49:15.520 --> 1:49:22.640\n And I feel like, I mean, I think we're beginning to uncover this empirical disagreement about\n\n1:49:22.640 --> 1:49:25.240\n what it is that's good for the individual and what it is that makes them happy.\n\n1:49:25.240 --> 1:49:32.400\n And I'll go back to something I raised in the debate, which is this theory of Durkheim\n\n1:49:32.400 --> 1:49:40.280\n that now has been popularized by Jordan Peterson.\n\n1:49:40.280 --> 1:49:48.200\n Durkheim argues that he's writing a book on suicide, he's trying to understand what\n\n1:49:48.200 --> 1:49:54.840\n brings individuals to suicide, and he coins this term, anomie, lack of law.\n\n1:49:54.840 --> 1:50:04.080\n And the argument is that individuals basically are healthy and happy when they find their\n\n1:50:04.080 --> 1:50:06.920\n place in a hierarchy.\n\n1:50:06.920 --> 1:50:11.680\n Within a loyalty group in a certain place in a hierarchy, they compete and struggle\n\n1:50:11.680 --> 1:50:15.280\n in order to rise in the hierarchy, but they know where they are.\n\n1:50:15.280 --> 1:50:16.400\n They know who they are.\n\n1:50:16.400 --> 1:50:22.600\n The kids today like to say they know what their identity is because they associate themselves.\n\n1:50:22.600 --> 1:50:27.920\n Their self expands to take on the leadership, the different layers, the past and the future\n\n1:50:27.920 --> 1:50:29.920\n of this particular hierarchy.\n\n1:50:29.920 --> 1:50:35.880\n And I completely agree with you, Ron, that some of these hierarchies are pernicious and\n\n1:50:35.880 --> 1:50:40.800\n oppressive and terrible, and some of them are better.\n\n1:50:40.800 --> 1:50:49.980\n What we might disagree about is that you can find human beings who are capable of becoming\n\n1:50:49.980 --> 1:50:55.880\n healthy and happy off by themselves without participating in this kind of structure.\n\n1:50:55.880 --> 1:51:01.760\n The minute that you accept, if you accept, that this is empirical reality about human\n\n1:51:01.760 --> 1:51:06.920\n beings, it's an iron law, you can't do anything.\n\n1:51:06.920 --> 1:51:11.680\n You can tell human beings that they can be free of all constraints, all you want, and\n\n1:51:11.680 --> 1:51:19.480\n you can get them to do things that, as you say, they can have contempt for hierarchies.\n\n1:51:19.480 --> 1:51:25.120\n They can say, I'm not going to serve the man, I'm just going to burn them all down.\n\n1:51:25.120 --> 1:51:29.200\n You can get kids to say all of these things.\n\n1:51:29.200 --> 1:51:34.880\n You can get them either to be Marxists who are actively trying to overthrow and destroy\n\n1:51:34.880 --> 1:51:38.680\n the existing hierarchies, or you can make them some kind of liberal where they basically\n\n1:51:38.680 --> 1:51:43.640\n pretend the hierarchies don't exist, they just act like they're not there.\n\n1:51:43.640 --> 1:51:47.960\n In both cases, and it's not a coincidence that that's what universities teach is your\n\n1:51:47.960 --> 1:51:53.680\n choice is either Marxist revolution or liberal ignoring of the hierarchies.\n\n1:51:53.680 --> 1:51:58.980\n In both cases, what you've done is you've eliminated the possibility that the young\n\n1:51:58.980 --> 1:52:08.120\n person will be able to find his or her place in a way that allows them to grow and exercise\n\n1:52:08.120 --> 1:52:13.680\n their love, their drive, their creativity in order to advance something constructive.\n\n1:52:13.680 --> 1:52:21.760\n You've eliminated it and you've put the burden on them, a kind of a Nietzschean burden, to\n\n1:52:21.760 --> 1:52:29.360\n just be the fountain of all values yourself, which maybe some people can do it, but almost\n\n1:52:29.360 --> 1:52:30.360\n no one can do it.\n\n1:52:30.360 --> 1:52:32.440\n And I think that's empirically true.\n\n1:52:32.440 --> 1:52:39.720\n And so I think by telling them about their freedom rather than telling them about the\n\n1:52:39.720 --> 1:52:46.160\n need to join into some traditionalist hierarchy that can be good and healthy for them, I think\n\n1:52:46.160 --> 1:52:47.160\n we're destroying them.\n\n1:52:47.160 --> 1:52:51.320\n I think we're destroying this generation and the last one and the next.\n\n1:52:51.320 --> 1:52:57.680\n Yaron, is the burden of freedom destroying mankind?\n\n1:52:57.680 --> 1:52:58.680\n What freedom?\n\n1:52:58.680 --> 1:53:01.640\n I mean, how many people are indeed free?\n\n1:53:01.640 --> 1:53:09.920\n Look, the problem is that we're caught up on political concepts and we're moving into\n\n1:53:09.920 --> 1:53:11.160\n ethical issues.\n\n1:53:11.160 --> 1:53:17.880\n And I don't think it's right to tell people, you're free, go do whatever the hell you want.\n\n1:53:17.880 --> 1:53:20.480\n Just use your emotions.\n\n1:53:20.480 --> 1:53:23.520\n Just go where you want to go in the spur of the moment.\n\n1:53:23.520 --> 1:53:24.520\n Think short term.\n\n1:53:24.520 --> 1:53:25.520\n Don't think long term.\n\n1:53:25.520 --> 1:53:26.520\n Well, don't think.\n\n1:53:26.520 --> 1:53:27.600\n Why think?\n\n1:53:27.600 --> 1:53:34.520\n One has to provide moral guidance and morality here is crucial and crucially important.\n\n1:53:34.520 --> 1:53:40.360\n And part of taking responsibility for your own life is establishing a moral framework\n\n1:53:40.360 --> 1:53:42.080\n for your life.\n\n1:53:42.080 --> 1:53:44.480\n And what does it mean to live a good life?\n\n1:53:44.480 --> 1:53:47.800\n I mean, that's much more important in a sense of a question.\n\n1:53:47.800 --> 1:53:51.560\n And it is my belief that people can do that.\n\n1:53:51.560 --> 1:53:57.400\n They can find and choose the values necessary to achieve a good life, but they need guidance.\n\n1:53:57.400 --> 1:53:58.680\n They need guidance.\n\n1:53:58.680 --> 1:54:01.680\n This is why religion evolved in my view, because people need guidance.\n\n1:54:01.680 --> 1:54:06.160\n So I had called religion a primitive form of philosophy.\n\n1:54:06.160 --> 1:54:10.440\n It was the original philosophy that provided people with some guidance about what to do\n\n1:54:10.440 --> 1:54:11.600\n and what not to do.\n\n1:54:11.600 --> 1:54:14.440\n And secular philosophy is supposed to do the same.\n\n1:54:14.440 --> 1:54:21.560\n And the problem is that I think religion and 99% of secular philosophy give people bad\n\n1:54:21.560 --> 1:54:25.840\n advice about what to do, and therefore they do bad stuff.\n\n1:54:25.840 --> 1:54:33.880\n And sometimes because when they do good stuff, it gets reinforced, we survive in spite of\n\n1:54:33.880 --> 1:54:34.880\n that.\n\n1:54:34.880 --> 1:54:40.280\n But ideas like Kant and Hegel and Marx and so on give young people awful advice about\n\n1:54:40.280 --> 1:54:43.880\n how to live and what to do, and as a consequence, really bad stuff happens.\n\n1:54:43.880 --> 1:54:50.000\n And the world in which we exist today, which we agree there are a lot of pathologies to\n\n1:54:50.000 --> 1:54:53.320\n it, a lot of bad stuff going on, in my view is going the wrong way.\n\n1:54:53.320 --> 1:55:02.080\n In my view, a product of a set of ideas, on the one hand I think Christian ideas, on the\n\n1:55:02.080 --> 1:55:06.920\n other hand I think secular philosophical ideas that have driven this country and the world\n\n1:55:06.920 --> 1:55:09.760\n more generally in a really, really bad direction.\n\n1:55:09.760 --> 1:55:16.040\n And this is why I do what I do, because I think at the core of it, the only way to change\n\n1:55:16.040 --> 1:55:21.220\n it is not to impose a new set of ideas from the top, because I worry about who's going\n\n1:55:21.220 --> 1:55:22.220\n to be doing the imposition.\n\n1:55:22.220 --> 1:55:26.080\n Plus, I don't believe you can force people to be good.\n\n1:55:26.080 --> 1:55:30.740\n It's to challenge the ideas, it's to question the ideas, it's to present an alternative\n\n1:55:30.740 --> 1:55:36.760\n view of morality, an alternative set of moral principles, ultimately an alternative view\n\n1:55:36.760 --> 1:55:37.760\n of political principles.\n\n1:55:37.760 --> 1:55:40.120\n But it has to start with morality.\n\n1:55:40.120 --> 1:55:43.720\n If you don't – and my morality is centered on the individual and what the individual\n\n1:55:43.720 --> 1:55:49.920\n should do with his life in order to attain a good life, I believe that leads to happiness,\n\n1:55:49.920 --> 1:55:53.400\n the good life, that's why it's good, right?\n\n1:55:53.400 --> 1:55:58.960\n The goal is survival and thriving and flourishing and happiness, ultimately.\n\n1:55:58.960 --> 1:56:02.080\n But politics is a servant of that in the end.\n\n1:56:02.080 --> 1:56:04.360\n It's not an end in itself.\n\n1:56:04.360 --> 1:56:08.120\n So the real issue is, you know, you asked before what is the value of relationship.\n\n1:56:08.120 --> 1:56:11.200\n There's an enormous value in relationship because we get values from other people.\n\n1:56:11.200 --> 1:56:12.600\n We don't produce all our values.\n\n1:56:12.600 --> 1:56:17.040\n We don't produce all our spiritual values, and we don't produce all our material values.\n\n1:56:17.040 --> 1:56:22.240\n Other people are a massive benefit to us because they produce values we can't – there's\n\n1:56:22.240 --> 1:56:27.520\n a massive division of labor in terms of values, not just in economics, but also in philosophy\n\n1:56:27.520 --> 1:56:28.520\n and elsewhere.\n\n1:56:28.520 --> 1:56:29.520\n It's why we have teachers.\n\n1:56:29.520 --> 1:56:31.080\n It's why we have moral teachers.\n\n1:56:31.080 --> 1:56:34.560\n Moral teachers are important to help guide us towards a good life.\n\n1:56:34.560 --> 1:56:36.140\n Not all of us are philosophers.\n\n1:56:36.140 --> 1:56:41.840\n But what I do demand, if you all are individuals – this is where I put a burden on people,\n\n1:56:41.840 --> 1:56:42.840\n right?\n\n1:56:42.840 --> 1:56:45.180\n Understand what you're doing, right?\n\n1:56:45.180 --> 1:56:49.680\n You know, don't embrace a moral teaching because it was tradition.\n\n1:56:49.680 --> 1:56:53.080\n Don't embrace a moral teaching because your parents embraced it.\n\n1:56:53.080 --> 1:56:57.680\n Don't embrace a moral teaching just because your teachers are teaching it.\n\n1:56:57.680 --> 1:56:58.680\n Challenge it.\n\n1:56:58.680 --> 1:56:59.680\n Think about it.\n\n1:56:59.680 --> 1:57:01.840\n Embrace it because you – embrace it.\n\n1:57:01.840 --> 1:57:02.960\n You might be wrong.\n\n1:57:02.960 --> 1:57:06.440\n You might embrace the wrong one, but take moral responsibility.\n\n1:57:06.440 --> 1:57:13.920\n Take responsibility over your life by evaluating, testing, challenging what you have received\n\n1:57:13.920 --> 1:57:18.600\n and choosing what you're going to pursue.\n\n1:57:18.600 --> 1:57:25.520\n And I acknowledge empirically that most people don't do that, and this is why intellectual\n\n1:57:25.520 --> 1:57:28.040\n leadership is so important.\n\n1:57:28.040 --> 1:57:33.440\n This is why you want to get – you want the voices in a culture to be good voices so that\n\n1:57:33.440 --> 1:57:38.080\n those people who don't think for themselves end up being followers, but they end up being\n\n1:57:38.080 --> 1:57:41.520\n followers of somebody good versus followers of somebody bad.\n\n1:57:41.520 --> 1:57:45.680\n But for the thinkers in the world out there, who I think are the people who count, who\n\n1:57:45.680 --> 1:57:46.680\n are the people who shape society –\n\n1:57:46.680 --> 1:57:47.680\n Oh, boy.\n\n1:57:47.680 --> 1:57:48.680\n No, no.\n\n1:57:48.680 --> 1:57:49.680\n Shape society.\n\n1:57:49.680 --> 1:57:50.680\n Wait a minute.\n\n1:57:50.680 --> 1:57:53.840\n Not count in a sense that you can dismiss the lives of others and, you know, because\n\n1:57:53.840 --> 1:57:56.200\n I'm – you know, obviously I'm anti coercion and anti violence, but –\n\n1:57:56.200 --> 1:57:57.200\n They sound like Plato.\n\n1:57:57.200 --> 1:57:58.200\n But – yes.\n\n1:57:58.200 --> 1:58:00.440\n I don't want to sound like Plato.\n\n1:58:00.440 --> 1:58:03.840\n But in a sense that they're the ones who shape – who end up shaping the world.\n\n1:58:03.840 --> 1:58:06.640\n They're the ones who end up shaping how the world is.\n\n1:58:06.640 --> 1:58:12.200\n I want those people to make choices about their values and not to just accept them based\n\n1:58:12.200 --> 1:58:16.880\n on tradition or based on the commandment or based on where they happen to grow up.\n\n1:58:16.880 --> 1:58:24.120\n And in that sense, again, you know, I do – and this is an interesting point where we disagree,\n\n1:58:24.120 --> 1:58:26.320\n but I'm not exactly sure what Jerome's position is.\n\n1:58:26.320 --> 1:58:28.040\n I do believe in universal values.\n\n1:58:28.040 --> 1:58:31.560\n That is, there are things that are good, and there are things that are evil.\n\n1:58:31.560 --> 1:58:32.960\n And I think we'd agree on that.\n\n1:58:32.960 --> 1:58:36.880\n When there are systems, we agree that communism and fascism are evil.\n\n1:58:36.880 --> 1:58:40.400\n Well, I think we should be able to agree that some things – some political systems are\n\n1:58:40.400 --> 1:58:41.400\n good.\n\n1:58:41.400 --> 1:58:46.680\n And maybe there's this middle ground where we both think that they're not particularly\n\n1:58:46.680 --> 1:58:49.880\n bad but not particularly good, and you all might think they're better than I think\n\n1:58:49.880 --> 1:58:50.880\n they are.\n\n1:58:50.880 --> 1:58:55.800\n But if we can agree on this is good and this is evil, right, then the systems that tend\n\n1:58:55.800 --> 1:59:00.240\n towards the good are good, and the systems that tend towards the evil are evil.\n\n1:59:00.240 --> 1:59:02.120\n But that's universal, right?\n\n1:59:02.120 --> 1:59:07.960\n You know, I look at places like South Korea, Japan, Asia – you know, cultures that are\n\n1:59:07.960 --> 1:59:10.720\n very, very different in many respects in the West.\n\n1:59:10.720 --> 1:59:19.040\n And yet when they adopt certain Western ideas about freedom, about liberty, about individualism\n\n1:59:19.040 --> 1:59:22.520\n – I mean, the Japanese Constitution, because MacArthur forced it in there, has the pursuit\n\n1:59:22.520 --> 1:59:26.360\n of happiness in the Constitution, not because they chose it because he put it in there.\n\n1:59:26.360 --> 1:59:32.920\n But they, to some extent, adopted that, and they're successful places today.\n\n1:59:32.920 --> 1:59:37.060\n Those societies in Asia that didn't adopt these values are not successful societies\n\n1:59:37.060 --> 1:59:38.060\n today.\n\n1:59:38.060 --> 1:59:47.280\n Yaron, Japan has a birth rate of, what is it, 1.1, 1.2 children per woman?\n\n1:59:47.280 --> 1:59:54.960\n I mean, look, there are some things – there are some places where you give people freedom\n\n1:59:54.960 --> 1:59:57.520\n – this is also biblical, right?\n\n1:59:57.520 --> 2:00:01.880\n The idea that everyone did what's right in his own eyes, okay?\n\n2:00:01.880 --> 2:00:06.560\n This is a refrain in the Book of Judges.\n\n2:00:06.560 --> 2:00:08.720\n And the Bible is not an anti–freedom book.\n\n2:00:08.720 --> 2:00:10.720\n I mean, there's many, many – look, I –\n\n2:00:10.720 --> 2:00:11.720\n Well, let's talk –\n\n2:00:11.720 --> 2:00:12.720\n No, we're not – fine.\n\n2:00:12.720 --> 2:00:13.720\n Well, we –\n\n2:00:13.720 --> 2:00:14.720\n Oh, we'll get there.\n\n2:00:14.720 --> 2:00:15.720\n Okay.\n\n2:00:15.720 --> 2:00:16.720\n Oh, he's going to guide us.\n\n2:00:16.720 --> 2:00:21.440\n Okay, look, just as an asterisk, I'm not asking you because the Bible is such a great\n\n2:00:21.440 --> 2:00:24.600\n authoritarian book – it's not that at all.\n\n2:00:24.600 --> 2:00:33.160\n In my view, if you want to know where this – what you call the sanctity of property,\n\n2:00:33.160 --> 2:00:35.280\n where does the sanctity of property comes from?\n\n2:00:35.280 --> 2:00:36.520\n It comes from the Ten Commandments.\n\n2:00:36.520 --> 2:00:40.160\n It comes from Moses saying, I haven't taken anything from anyone.\n\n2:00:40.160 --> 2:00:42.800\n It comes from Samuel saying, I haven't taken anything from anyone.\n\n2:00:42.800 --> 2:00:49.400\n It's the condemnation of Ahab, of the unjust kings who steal the property of their subjects.\n\n2:00:49.400 --> 2:00:57.160\n So, property and freedom, I think there's a great basis for it in the Bible.\n\n2:00:57.160 --> 2:01:03.960\n But right now, I'm focusing on this other question, which is what happens when everyone\n\n2:01:03.960 --> 2:01:05.640\n does what's right in his own eyes?\n\n2:01:05.640 --> 2:01:12.600\n That's the Book of Judges, and that's this civil war, moral corruption, theft, idolatry,\n\n2:01:12.600 --> 2:01:18.120\n murder, rape – I mean, that's what happens when everyone does whatever is right in his\n\n2:01:18.120 --> 2:01:19.120\n own eyes.\n\n2:01:19.120 --> 2:01:22.160\n Well, no, that's what it says in the text.\n\n2:01:22.160 --> 2:01:28.280\n Okay, so when I look at – you're right, there are things that I think are objectively\n\n2:01:28.280 --> 2:01:29.280\n true.\n\n2:01:29.280 --> 2:01:33.960\n I think it's really hard to get people to agree to them, almost impossible.\n\n2:01:33.960 --> 2:01:44.640\n But when I look at a country which is approaching one birth per woman – in other words, half\n\n2:01:44.640 --> 2:01:50.040\n of the minimum necessary for replacement – you can say whatever you want.\n\n2:01:50.040 --> 2:01:52.960\n Whatever you want about immigration, we can have that discussion.\n\n2:01:52.960 --> 2:02:00.160\n But the point is that when your values are such that you're not even capable of doing\n\n2:02:00.160 --> 2:02:04.800\n the most basic techniques that human beings need in order to be able to propagate themselves\n\n2:02:04.800 --> 2:02:09.880\n and their values and the way they see things, then I – look, you're finished.\n\n2:02:09.880 --> 2:02:10.880\n You can't say that –\n\n2:02:10.880 --> 2:02:15.600\n So if I implied that Japan is an ideal society, I take that back.\n\n2:02:15.600 --> 2:02:17.920\n But let's think about Japan for a minute.\n\n2:02:17.920 --> 2:02:20.480\n I just think we're in trouble, and we're in trouble –\n\n2:02:20.480 --> 2:02:21.480\n I agree with –\n\n2:02:21.480 --> 2:02:22.480\n All right, all right.\n\n2:02:22.480 --> 2:02:23.480\n Give me a second.\n\n2:02:23.480 --> 2:02:24.480\n I'll hold you to that.\n\n2:02:24.480 --> 2:02:25.480\n It's being a tutorial.\n\n2:02:25.480 --> 2:02:26.480\n No, I'm sorry.\n\n2:02:26.480 --> 2:02:27.480\n It's his show, man.\n\n2:02:27.480 --> 2:02:28.480\n It is his show.\n\n2:02:28.480 --> 2:02:31.040\n We enter into his hierarchy and that's it.\n\n2:02:31.040 --> 2:02:35.120\n We should talk about hierarchy.\n\n2:02:35.120 --> 2:02:39.440\n Just to clarify, how do you explain the situation in Japan?\n\n2:02:39.440 --> 2:02:45.000\n Is it the decrease in value in family, like some of the – just expand on that.\n\n2:02:45.000 --> 2:02:47.160\n How do you explain that situation?\n\n2:02:47.160 --> 2:02:50.440\n You're saying that that society is in trouble in a certain way.\n\n2:02:50.440 --> 2:02:53.320\n Can you kind of describe the nature of that trouble?\n\n2:02:53.320 --> 2:03:02.000\n I'm saying that when the individual is part of a social group – this can be a family,\n\n2:03:02.000 --> 2:03:08.640\n a congregation, a community, a tribe, a nation – when the individual feels that the things\n\n2:03:08.640 --> 2:03:13.640\n that are happening to the society are things that are happening to him or to her.\n\n2:03:13.640 --> 2:03:21.840\n And I want to emphasize, this is not the standard view of collectivism that Mussolini will say,\n\n2:03:21.840 --> 2:03:27.400\n the glory of the individual is in totally immersing himself in the organic whole.\n\n2:03:27.400 --> 2:03:28.400\n That's not what I'm saying.\n\n2:03:28.400 --> 2:03:32.360\n I'm saying that human beings have and are both.\n\n2:03:32.360 --> 2:03:41.240\n They enter into a society to which they are loyal and they compete with one another in\n\n2:03:41.240 --> 2:03:45.320\n the terms that that society allows competition, but also sometimes by bending the rules and\n\n2:03:45.320 --> 2:03:49.000\n by shaping them and by changing them.\n\n2:03:49.000 --> 2:03:55.080\n What you see in many societies, certainly throughout the liberal West, but also in countries\n\n2:03:55.080 --> 2:04:00.740\n that have been affected by the liberal West, by industrialization and ideas of individualism,\n\n2:04:00.740 --> 2:04:08.980\n what you see is a collapse of a willingness of the individual to look at what is needed\n\n2:04:08.980 --> 2:04:18.360\n by the whole and to make choices that are, as Jorn would call them, selfish because the\n\n2:04:18.360 --> 2:04:26.760\n purpose of them is self expression, competition, self assertion, moving up in the hierarchy,\n\n2:04:26.760 --> 2:04:31.720\n achieving honor or wealth in order to do those things.\n\n2:04:31.720 --> 2:04:38.260\n But when you stop being able to look at the framework of a particular society and identify\n\n2:04:38.260 --> 2:04:46.240\n with it, you cease to understand what it is that you need to do, not every single person,\n\n2:04:46.240 --> 2:04:48.080\n but I'm talking about society wide.\n\n2:04:48.080 --> 2:04:51.500\n So there are a few individuals who are just going to have a fantastic time and live the\n\n2:04:51.500 --> 2:04:56.880\n kind of life that Jorn is describing, and the great majority, they stop being willing\n\n2:04:56.880 --> 2:04:58.080\n to take risks.\n\n2:04:58.080 --> 2:04:59.780\n They stop being willing to get married.\n\n2:04:59.780 --> 2:05:01.400\n They stop being willing to have children.\n\n2:05:01.400 --> 2:05:03.280\n They stop being willing to start companies.\n\n2:05:03.280 --> 2:05:09.440\n They stop being willing to put themselves out to do great things because the guide rails\n\n2:05:09.440 --> 2:05:15.060\n that told them what kinds of things and the social feedback that honored them when they\n\n2:05:15.060 --> 2:05:19.020\n did things like getting married and having children, they've been crushed.\n\n2:05:19.020 --> 2:05:20.360\n And what have they been crushed by?\n\n2:05:20.360 --> 2:05:25.840\n They've been crushed by the false view that if you tell the individual, be free, make\n\n2:05:25.840 --> 2:05:29.360\n all your own decisions, that they will then be free and make all their own decisions.\n\n2:05:29.360 --> 2:05:30.360\n They don't.\n\n2:05:30.360 --> 2:05:31.360\n They just stop.\n\n2:05:31.360 --> 2:05:33.760\n They stop being human.\n\n2:05:33.760 --> 2:05:34.760\n That's powerful.\n\n2:05:34.760 --> 2:05:36.760\n So do you want to respond to that?\n\n2:05:36.760 --> 2:05:38.260\n Yes.\n\n2:05:38.260 --> 2:05:40.320\n So I don't think anybody should have children.\n\n2:05:40.320 --> 2:05:50.000\n If the goal, there's a good tweet clip that you can make.\n\n2:05:50.000 --> 2:05:55.960\n I don't think anybody should have children for the goal of perpetuating their nation\n\n2:05:55.960 --> 2:06:03.320\n or expanding their society or for some, I think they'd make horrible parents if that\n\n2:06:03.320 --> 2:06:06.400\n was the goal, the purpose of doing it.\n\n2:06:06.400 --> 2:06:10.120\n I think people should have children because they want to embrace that challenge, that\n\n2:06:10.120 --> 2:06:18.640\n beauty, that experience, that amazing, very, very hard, very, very difficult experience\n\n2:06:18.640 --> 2:06:19.640\n in life.\n\n2:06:19.640 --> 2:06:24.680\n And it's about being able to project a long term, but also being able to enjoy and love\n\n2:06:24.680 --> 2:06:28.040\n the creation of another human being, that process of creation.\n\n2:06:28.040 --> 2:06:30.220\n It is a beautiful, self interested thing.\n\n2:06:30.220 --> 2:06:32.160\n And by the way, not everybody should have children.\n\n2:06:32.160 --> 2:06:34.800\n I think way too many people have children.\n\n2:06:34.800 --> 2:06:38.360\n There's some awful parents out there that I wish would stop.\n\n2:06:38.360 --> 2:06:39.720\n I mean, there are.\n\n2:06:39.720 --> 2:06:43.760\n Life is precious and life of suffering is sad.\n\n2:06:43.760 --> 2:06:47.920\n It's sad to see people suffer and a lot of people are born into situations and are born\n\n2:06:47.920 --> 2:06:52.320\n into parents that destroy their capacity to ever live a good life.\n\n2:06:52.320 --> 2:06:57.880\n And that's a tragic and sad thing.\n\n2:06:57.880 --> 2:07:04.240\n So I don't measure the health of a society in how many children they're having or health\n\n2:07:04.240 --> 2:07:06.700\n of a couple of whether they have children or not.\n\n2:07:06.700 --> 2:07:07.800\n Those are individual choices.\n\n2:07:07.800 --> 2:07:12.380\n Some people make a choice not to have children, which is completely rational and consistent\n\n2:07:12.380 --> 2:07:13.920\n with their values.\n\n2:07:13.920 --> 2:07:18.400\n Now when you look at a society overall, I do think having children and not having children\n\n2:07:18.400 --> 2:07:20.160\n is a reflection of something.\n\n2:07:20.160 --> 2:07:22.920\n I think it's a reflection of a certain optimism about the future.\n\n2:07:22.920 --> 2:07:26.200\n I think it's a reflection of thinking long term versus short term.\n\n2:07:26.200 --> 2:07:28.400\n I think a short term society doesn't have children.\n\n2:07:28.400 --> 2:07:32.880\n People don't have children there because children are a long term investment.\n\n2:07:32.880 --> 2:07:38.000\n They require real planning and real effort and real thinking about the long term.\n\n2:07:38.000 --> 2:07:39.720\n But those are moral issues.\n\n2:07:39.720 --> 2:07:43.440\n And again, we're confusing or mixing.\n\n2:07:43.440 --> 2:07:45.960\n When I say Japan, look how well Japan has done.\n\n2:07:45.960 --> 2:07:49.720\n I don't mean the specific Japanese people and how many kids they're having and what\n\n2:07:49.720 --> 2:07:53.920\n kind of life they're having in terms of these kind of particulars.\n\n2:07:53.920 --> 2:08:01.020\n But think about the alternatives Japan faces if you look around the options that they face.\n\n2:08:01.020 --> 2:08:02.640\n They tried empire.\n\n2:08:02.640 --> 2:08:04.120\n They tried nationalistic empire.\n\n2:08:04.120 --> 2:08:08.320\n It didn't turn out too well for them or anybody who they interacted with.\n\n2:08:08.320 --> 2:08:11.020\n They could have become North Korea.\n\n2:08:11.020 --> 2:08:12.100\n We know how that turned out.\n\n2:08:12.100 --> 2:08:13.100\n We know what that is.\n\n2:08:13.100 --> 2:08:16.600\n We've seen Cambodia, if you've ever been to Cambodia and seen the kind of poverty.\n\n2:08:16.600 --> 2:08:22.400\n And yes, maybe Cambodians have lots of children, but God, I'd rather be in Japan any day than\n\n2:08:22.400 --> 2:08:27.240\n have children in the kind of poverty and horrific circumstances they have.\n\n2:08:27.240 --> 2:08:34.760\n But in the context of the available regimes that were possible post World War II for the\n\n2:08:34.760 --> 2:08:39.920\n Japanese to embrace, they embraced one that generally led to prosperity, to freedom, to\n\n2:08:39.920 --> 2:08:45.320\n individuals pursuing values, not perfectly because they didn't implement the philosophical\n\n2:08:45.320 --> 2:08:48.680\n foundation, the moral foundation that I would like them to have.\n\n2:08:48.680 --> 2:08:54.680\n They're still being impacted by Kantian, Hegelian, whatever philosophy that's out there in the\n\n2:08:54.680 --> 2:08:57.520\n West that's destroying the better part.\n\n2:08:57.520 --> 2:09:00.800\n So you give people freedom, now what do they do with it?\n\n2:09:00.800 --> 2:09:05.720\n And if they have a bad philosophy, they're going to do bad things with that freedom.\n\n2:09:05.720 --> 2:09:08.660\n You tell people to do whatever they choose to do.\n\n2:09:08.660 --> 2:09:12.980\n But if they have bad ideas, they will choose to do bad things.\n\n2:09:12.980 --> 2:09:19.720\n So it is true that the primacy of morality and the primacy of philosophy has to be recognized.\n\n2:09:19.720 --> 2:09:21.660\n It's not the primacy of politics.\n\n2:09:21.660 --> 2:09:29.220\n And indeed, you don't get free societies unless you have some elements of decent philosophy.\n\n2:09:29.220 --> 2:09:33.720\n But you can get free societies with a rotten philosophy, but they don't stay free for very\n\n2:09:33.720 --> 2:09:34.720\n long.\n\n2:09:34.720 --> 2:09:39.720\n So how can it be a decent philosophy if it doesn't care about posterity?\n\n2:09:39.720 --> 2:09:46.820\n If you're willing to say, I'm offering guidance, I think you should live as a traitor, all\n\n2:09:46.820 --> 2:09:50.520\n relationships should be voluntary, those are interesting things.\n\n2:09:50.520 --> 2:09:55.800\n But the moment that it comes to posterity, to the future, to there being a future, let's\n\n2:09:55.800 --> 2:10:00.120\n say that there were a society that lived the way, in general, according to your view.\n\n2:10:00.120 --> 2:10:02.000\n Let's say there was such a society.\n\n2:10:02.000 --> 2:10:06.440\n How can you not care whether that society is capable of passing it on to the next generation\n\n2:10:06.440 --> 2:10:07.440\n or not?\n\n2:10:07.440 --> 2:10:11.880\n But the way to pass it on to the next generation is through ideas and not through having children.\n\n2:10:11.880 --> 2:10:15.280\n Having children is an individual choice that some people are going to make and some people\n\n2:10:15.280 --> 2:10:19.880\n are not, but the fundamental that preserves the good life.\n\n2:10:19.880 --> 2:10:23.000\n What does that even mean?\n\n2:10:23.000 --> 2:10:28.500\n If every generation from now on, your society that was good at a certain point has half\n\n2:10:28.500 --> 2:10:33.120\n as many people in it, it's going to very quickly, it's just going to be overrun.\n\n2:10:33.120 --> 2:10:35.080\n Overrun by whom?\n\n2:10:35.080 --> 2:10:36.240\n What do you mean overrun by whom?\n\n2:10:36.240 --> 2:10:38.360\n Are we just totally ahistorical?\n\n2:10:38.360 --> 2:10:43.880\n If you're the Spartans and you have all of these warrior values, but you stop having\n\n2:10:43.880 --> 2:10:45.840\n children, you get overrun, you get defeated.\n\n2:10:45.840 --> 2:10:47.960\n Well, in the case of Sparta, that's a good thing, not a bad thing.\n\n2:10:47.960 --> 2:10:48.960\n But I get it.\n\n2:10:48.960 --> 2:10:49.960\n That's not my point.\n\n2:10:49.960 --> 2:10:54.720\n You have to have the ability to have enough children to create enough wealth and enough\n\n2:10:54.720 --> 2:10:56.040\n power, enough strength.\n\n2:10:56.040 --> 2:11:01.160\n Who makes these kind of conclusions, the decisions about how many you make it as an individual\n\n2:11:01.160 --> 2:11:03.440\n and you decide that in order to...\n\n2:11:03.440 --> 2:11:04.880\n No, we're not talking about...\n\n2:11:04.880 --> 2:11:10.040\n We're talking about what kind of intellectual, cultural, religious inheritance you give your\n\n2:11:10.040 --> 2:11:11.040\n children.\n\n2:11:11.040 --> 2:11:12.040\n Yes.\n\n2:11:12.040 --> 2:11:15.440\n And those are the ideas that I give my children and those ideas are going to perpetuate because\n\n2:11:15.440 --> 2:11:16.440\n they're good ideas.\n\n2:11:16.440 --> 2:11:17.440\n If they're bad ideas...\n\n2:11:17.440 --> 2:11:18.440\n No, they're not going to perpetuate.\n\n2:11:18.440 --> 2:11:23.160\n They can't be good ideas if they don't produce future generations.\n\n2:11:23.160 --> 2:11:24.160\n What are you talking about?\n\n2:11:24.160 --> 2:11:26.160\n Why would they not produce future generations?\n\n2:11:26.160 --> 2:11:32.040\n Because look at every liberal society on earth is in democratic collapse.\n\n2:11:32.040 --> 2:11:36.920\n There's not a single liberal society on earth today that I'm willing to defend.\n\n2:11:36.920 --> 2:11:40.800\n Because they're not living by my philosophy, they've not accepted my ideas.\n\n2:11:40.800 --> 2:11:46.240\n They have a semblance, they have a semblance of a political system that is a little bit\n\n2:11:46.240 --> 2:11:50.920\n like what I would like, far from what I would ideal, but they certainly don't have a moral\n\n2:11:50.920 --> 2:11:51.920\n foundation.\n\n2:11:51.920 --> 2:11:55.840\n I believe that people who have the right moral foundation, most of them, not all of them,\n\n2:11:55.840 --> 2:12:00.240\n but most of them will have children, most of them will continue into the future, most\n\n2:12:00.240 --> 2:12:06.640\n of them will fight for a future, but not because they care what happens in 200 years, but because\n\n2:12:06.640 --> 2:12:11.240\n they care about their lifetime and part of having fun and enjoying one's lifetime is\n\n2:12:11.240 --> 2:12:14.720\n having kids, is projecting into the future.\n\n2:12:14.720 --> 2:12:19.120\n Are you really going to tell me that people have children because it's fun?\n\n2:12:19.120 --> 2:12:20.560\n They're fun when they're four years old.\n\n2:12:20.560 --> 2:12:23.280\n They're not fun when they're 15.\n\n2:12:23.280 --> 2:12:24.280\n When they're 15, they're not fun.\n\n2:12:24.280 --> 2:12:25.280\n I agree with that.\n\n2:12:25.280 --> 2:12:26.280\n No, they're just not fun.\n\n2:12:26.280 --> 2:12:27.280\n Look, you don't do this.\n\n2:12:27.280 --> 2:12:28.820\n I'm learning so much today.\n\n2:12:28.820 --> 2:12:31.360\n You don't do this for fun.\n\n2:12:31.360 --> 2:12:32.640\n Marriage also you don't do for fun.\n\n2:12:32.640 --> 2:12:35.400\n There are times that are fun and there are times that are not fun.\n\n2:12:35.400 --> 2:12:40.320\n Fun is not exactly the right word, but you certainly do it for happiness.\n\n2:12:40.320 --> 2:12:42.040\n You do it for fulfillment.\n\n2:12:42.040 --> 2:12:43.760\n You do it as a challenge.\n\n2:12:43.760 --> 2:12:49.960\n You do it for making your life better, for making your life interesting, for making your\n\n2:12:49.960 --> 2:12:53.840\n life challenging, for embracing.\n\n2:12:53.840 --> 2:13:01.000\n Part of it is fun, part of it is hard work, but you do it because it makes your life a\n\n2:13:01.000 --> 2:13:02.000\n better life.\n\n2:13:02.000 --> 2:13:07.240\n It's very interesting, empirically speaking, if you dissolve the cultural backbone where\n\n2:13:07.240 --> 2:13:12.360\n everybody comes up, like the background, the moral ideas that everybody is raised with,\n\n2:13:12.360 --> 2:13:19.560\n if you dissolve that and if you truly emphasize the individual, I think Yoram is saying it's\n\n2:13:19.560 --> 2:13:24.160\n going to naturally lead to the dissolution of marriage and all of these concepts.\n\n2:13:24.160 --> 2:13:30.200\n So basically saying you're not going to choose some of these things.\n\n2:13:30.200 --> 2:13:37.560\n You're going to more and more choose the short term optimization versus the long term optimization\n\n2:13:37.560 --> 2:13:40.720\n beyond your own life, like posterity.\n\n2:13:40.720 --> 2:13:42.040\n So I don't think about posterity.\n\n2:13:42.040 --> 2:13:43.640\n I don't know what posterity means.\n\n2:13:43.640 --> 2:13:46.520\n I can project into my children's life.\n\n2:13:46.520 --> 2:13:49.280\n Maybe when I have grandchildren, it's the grandchildren's life, but it ends there.\n\n2:13:49.280 --> 2:13:52.120\n I can't project 300 years into the future.\n\n2:13:52.120 --> 2:13:54.820\n It's ridiculous to try to think about 300 years into the future.\n\n2:13:54.820 --> 2:13:56.320\n Things change so much.\n\n2:13:56.320 --> 2:13:58.640\n But that's the founding fathers.\n\n2:13:58.640 --> 2:13:59.920\n That's the conservative founding fathers.\n\n2:13:59.920 --> 2:14:01.200\n Well, no, I don't think.\n\n2:14:01.200 --> 2:14:02.520\n I think they set up a system.\n\n2:14:02.520 --> 2:14:09.080\n I think the whole idea was to set up a system that was self perpetuating that would if people\n\n2:14:09.080 --> 2:14:10.320\n lived up to it, right?\n\n2:14:10.320 --> 2:14:11.320\n No, no.\n\n2:14:11.320 --> 2:14:12.320\n Would perpetuate itself into 300 years.\n\n2:14:12.320 --> 2:14:14.200\n No systems are self perpetuating.\n\n2:14:14.200 --> 2:14:15.720\n Things rise and fall and it's the...\n\n2:14:15.720 --> 2:14:16.720\n They don't necessarily rise and fall.\n\n2:14:16.720 --> 2:14:17.720\n I don't believe in that.\n\n2:14:17.720 --> 2:14:21.520\n Let me speak to your heart for a second.\n\n2:14:21.520 --> 2:14:27.480\n The great individuals in societies are the people who have seen the decline, understood\n\n2:14:27.480 --> 2:14:32.160\n it and provided resources in order to redirect and bring it back up.\n\n2:14:32.160 --> 2:14:34.240\n You can't agree to that?\n\n2:14:34.240 --> 2:14:36.360\n I don't see it that way at all.\n\n2:14:36.360 --> 2:14:41.480\n Yes, I want people out there to rebel against conventional morality.\n\n2:14:41.480 --> 2:14:46.000\n I think conventional morality is destructive to their own lives and broadly to posterity\n\n2:14:46.000 --> 2:14:48.920\n because I think it's unsustainable, it's not good and this goes to...\n\n2:14:48.920 --> 2:14:51.520\n I think conventional morality is Christian morality.\n\n2:14:51.520 --> 2:14:55.880\n It's a morality that's been secularized through Christian lens and I think it's destructive,\n\n2:14:55.880 --> 2:14:59.520\n but I don't want them to dump that and not replace it with something.\n\n2:14:59.520 --> 2:15:05.480\n I want and I think it's necessary and essential for people to have a moral code and to have\n\n2:15:05.480 --> 2:15:08.160\n a moral code.\n\n2:15:08.160 --> 2:15:11.040\n Morality is a set of guidelines to live your life.\n\n2:15:11.040 --> 2:15:15.840\n It is a set of values to guide you, to help you identify what is good for you and what\n\n2:15:15.840 --> 2:15:16.840\n is bad for you.\n\n2:15:16.840 --> 2:15:17.840\n Here's the thing.\n\n2:15:17.840 --> 2:15:18.840\n Let me argue against it.\n\n2:15:18.840 --> 2:15:19.840\n Let me...\n\n2:15:19.840 --> 2:15:20.840\n Hold on a second.\n\n2:15:20.840 --> 2:15:25.680\n You're saying central to this morality that people should have is reason.\n\n2:15:25.680 --> 2:15:26.680\n Yes.\n\n2:15:26.680 --> 2:15:27.680\n Okay.\n\n2:15:27.680 --> 2:15:28.680\n You're not saying other things.\n\n2:15:28.680 --> 2:15:32.720\n You're basically saying reason will arrive a lot of things.\n\n2:15:32.720 --> 2:15:36.040\n Why are you so sure that reason is so important?\n\n2:15:36.040 --> 2:15:37.040\n There's nothing else.\n\n2:15:37.040 --> 2:15:38.040\n No.\n\n2:15:38.040 --> 2:15:39.040\n Hold on a second.\n\n2:15:39.040 --> 2:15:40.760\n But it seems like obvious to you.\n\n2:15:40.760 --> 2:15:43.440\n So first of all, humans have limited cognitive capacity.\n\n2:15:43.440 --> 2:15:50.040\n So even to assume the reason could actually function that well from an artificial intelligence\n\n2:15:50.040 --> 2:15:51.040\n researcher perspective.\n\n2:15:51.040 --> 2:15:52.040\n It seems...\n\n2:15:52.040 --> 2:15:57.000\n The whole discussion about whether there is such a thing as artificial intelligence, whether\n\n2:15:57.000 --> 2:15:58.000\n that is what it is.\n\n2:15:58.000 --> 2:15:59.000\n But...\n\n2:15:59.000 --> 2:16:00.000\n But see, here's the thing.\n\n2:16:00.000 --> 2:16:03.940\n I mean, you're very confident about this particular thing, but not about other aspects of human\n\n2:16:03.940 --> 2:16:06.360\n nature that seems to be obviously present.\n\n2:16:06.360 --> 2:16:12.920\n So yes, human relations, love, connection between us.\n\n2:16:12.920 --> 2:16:17.800\n So it's very possible to argue that all of the accomplishments of reason would not exist\n\n2:16:17.800 --> 2:16:19.800\n without the connection of other humans.\n\n2:16:19.800 --> 2:16:21.080\n But of course that's true.\n\n2:16:21.080 --> 2:16:22.480\n It's not obvious though.\n\n2:16:22.480 --> 2:16:28.200\n It's possible that reason is a property of the collective of multiple people interacting\n\n2:16:28.200 --> 2:16:29.200\n with each other.\n\n2:16:29.200 --> 2:16:32.860\n When you look at the greatest inventions of human history, some people tell that story\n\n2:16:32.860 --> 2:16:35.040\n by individual inventors.\n\n2:16:35.040 --> 2:16:36.520\n You could argue that's true.\n\n2:16:36.520 --> 2:16:41.240\n Some people say that it's a bunch of people in a room together.\n\n2:16:41.240 --> 2:16:42.560\n The idea is bubbling.\n\n2:16:42.560 --> 2:16:48.720\n And if you're saying individual is primary and they have the full power and the capacity\n\n2:16:48.720 --> 2:16:52.840\n to make choices, I don't know if that's necessarily obviously true.\n\n2:16:52.840 --> 2:16:56.880\n So there's a straw manning going on here of my position, right?\n\n2:16:56.880 --> 2:16:57.880\n Of course.\n\n2:16:57.880 --> 2:17:00.520\n My favorite thing to do.\n\n2:17:00.520 --> 2:17:04.160\n You don't do it and you do it more politely than anybody else I know when you do it.\n\n2:17:04.160 --> 2:17:06.480\n Of course we all stand on the shoulders of giants.\n\n2:17:06.480 --> 2:17:10.780\n Of course, invention and science is collaborative.\n\n2:17:10.780 --> 2:17:13.880\n Not always, not a hundred percent.\n\n2:17:13.880 --> 2:17:16.040\n Newton stood on the shoulders of giants.\n\n2:17:16.040 --> 2:17:17.720\n I don't know how collaborative he was.\n\n2:17:17.720 --> 2:17:22.960\n He wasn't exactly known as a bubbling up and testing ideas out with other people.\n\n2:17:22.960 --> 2:17:25.000\n But this is a metaphysical fact.\n\n2:17:25.000 --> 2:17:26.520\n You can't eat for me.\n\n2:17:26.520 --> 2:17:28.360\n There's no collective stomach.\n\n2:17:28.360 --> 2:17:30.160\n You can't eat for me.\n\n2:17:30.160 --> 2:17:33.420\n You know, you can provide me with food, but I need to do the eating.\n\n2:17:33.420 --> 2:17:35.240\n You can't think for me.\n\n2:17:35.240 --> 2:17:37.400\n You can help stimulate my thought.\n\n2:17:37.400 --> 2:17:39.200\n You can challenge my thinking.\n\n2:17:39.200 --> 2:17:41.040\n You can add to it.\n\n2:17:41.040 --> 2:17:44.480\n But in the end of the day, only I can either do my thinking or not do my thinking, but\n\n2:17:44.480 --> 2:17:45.480\n I need to think.\n\n2:17:45.480 --> 2:17:48.160\n But you can think all by yourself alone.\n\n2:17:48.160 --> 2:17:49.160\n What does that mean?\n\n2:17:49.160 --> 2:17:50.160\n All by yourself.\n\n2:17:50.160 --> 2:17:51.160\n Right?\n\n2:17:51.160 --> 2:17:52.160\n Can I think on a desert island?\n\n2:17:52.160 --> 2:17:54.540\n Yes, I can think on a desert island.\n\n2:17:54.540 --> 2:18:03.520\n Can I think as big and as broad and as deep as I can in Aristotle's Lyceum?\n\n2:18:03.520 --> 2:18:04.520\n Of course not.\n\n2:18:04.520 --> 2:18:09.360\n I'm a much better thinker in Aristotle's Lyceum or in any kind of situation like this\n\n2:18:09.360 --> 2:18:13.440\n where you're going to challenge me and I have to come back and I have to think deeply about\n\n2:18:13.440 --> 2:18:17.960\n what it is you said and why I'm not communicating very effectively and why you're not understanding\n\n2:18:17.960 --> 2:18:18.960\n me.\n\n2:18:18.960 --> 2:18:22.480\n Of course, now you're causing me to think much more deeply and to challenge me.\n\n2:18:22.480 --> 2:18:24.200\n But it's still true that I have to think.\n\n2:18:24.200 --> 2:18:28.000\n And if I don't think for myself, who's going to think for me?\n\n2:18:28.000 --> 2:18:29.000\n Right?\n\n2:18:29.000 --> 2:18:32.280\n So this is why I'm not a philosopher.\n\n2:18:32.280 --> 2:18:36.440\n I'm certainly not an original thinker in that sense.\n\n2:18:36.440 --> 2:18:40.360\n I recognize the fact that there are geniuses that are much smarter than me, whether it's\n\n2:18:40.360 --> 2:18:43.400\n Aristotle or Ayn Rand or people that inspire me.\n\n2:18:43.400 --> 2:18:44.680\n I study their work.\n\n2:18:44.680 --> 2:18:46.840\n I try to understand it to the best of my ability.\n\n2:18:46.840 --> 2:18:49.280\n But I don't take it as gospel.\n\n2:18:49.280 --> 2:18:53.200\n I take it as this is something I need to figure out.\n\n2:18:53.200 --> 2:18:54.240\n I need to learn it.\n\n2:18:54.240 --> 2:18:56.720\n I need to understand it because it's good for my life.\n\n2:18:56.720 --> 2:18:58.140\n It's important to me.\n\n2:18:58.140 --> 2:18:59.920\n But I have to do the thinking.\n\n2:18:59.920 --> 2:19:01.640\n It won't be mine.\n\n2:19:01.640 --> 2:19:02.640\n It'll be Ayn Rand's.\n\n2:19:02.640 --> 2:19:07.320\n But it won't be mine unless I've done the thinking to integrate it into my soul, into\n\n2:19:07.320 --> 2:19:10.320\n my consciousness, into my mind.\n\n2:19:10.320 --> 2:19:15.280\n But it's still true that I have to think for myself, not on a desert island.\n\n2:19:15.280 --> 2:19:20.000\n I now regret ever using a desert island in the book as an example, because …\n\n2:19:20.000 --> 2:19:21.000\n We've achieved something.\n\n2:19:21.000 --> 2:19:22.000\n There is progress.\n\n2:19:22.000 --> 2:19:23.000\n We're moving …\n\n2:19:23.000 --> 2:19:24.000\n Progress towards truth is taking place.\n\n2:19:24.000 --> 2:19:25.000\n Because clearly, it was misunderstood.\n\n2:19:25.000 --> 2:19:26.000\n I didn't make myself clear.\n\n2:19:26.000 --> 2:19:34.000\n I didn't make myself clear enough in the book in terms of what I meant.\n\n2:19:34.000 --> 2:19:42.600\n But I do not advocate for thinking alone in a dark room, not engaging with reality, not\n\n2:19:42.600 --> 2:19:46.600\n studying history, not knowing about the world, or on a desert island, not interacting with\n\n2:19:46.600 --> 2:19:47.600\n other people.\n\n2:19:47.600 --> 2:19:48.600\n So you're a collectivist?\n\n2:19:48.600 --> 2:19:49.600\n No.\n\n2:19:49.600 --> 2:19:50.600\n I'm a trader.\n\n2:19:50.600 --> 2:19:53.360\n So I enjoy what we're doing right now because you're challenging me.\n\n2:19:53.360 --> 2:19:55.480\n You make me a better thinker.\n\n2:19:55.480 --> 2:19:56.880\n It's interesting.\n\n2:19:56.880 --> 2:20:01.440\n The fact that a lot of people are going to watch this plays into it as well.\n\n2:20:01.440 --> 2:20:04.240\n But I would probably enjoy engaging with you in conversation.\n\n2:20:04.240 --> 2:20:05.240\n It's not even recording, so …\n\n2:20:05.240 --> 2:20:06.240\n Yeah.\n\n2:20:06.240 --> 2:20:07.240\n There you go.\n\n2:20:07.240 --> 2:20:11.800\n I would enjoy engaging with you in conversation even if it wasn't being recorded, and even\n\n2:20:11.800 --> 2:20:16.320\n if it was because that kind of conversation makes me a better … There are some people\n\n2:20:16.320 --> 2:20:17.320\n who I wouldn't.\n\n2:20:17.320 --> 2:20:22.920\n There are some people who make it worse, that you walk away from the conversation because\n\n2:20:22.920 --> 2:20:23.920\n they're harmful to you.\n\n2:20:23.920 --> 2:20:24.920\n And this is where choice comes in.\n\n2:20:24.920 --> 2:20:28.520\n I want to be able to choose who I engage with.\n\n2:20:28.520 --> 2:20:32.120\n I don't always have that choice because, as a public intellectual, you go in front\n\n2:20:32.120 --> 2:20:33.120\n of audiences.\n\n2:20:33.120 --> 2:20:36.640\n You don't always choose who it is, but you want to choose who you engage with and who\n\n2:20:36.640 --> 2:20:37.640\n you don't.\n\n2:20:37.640 --> 2:20:41.480\n You want to choose the forum in which you engage and how you engage.\n\n2:20:41.480 --> 2:20:43.240\n And the standard for me is reason.\n\n2:20:43.240 --> 2:20:44.240\n There is no other standard.\n\n2:20:44.240 --> 2:20:46.360\n So you asked a deep question to start off.\n\n2:20:46.360 --> 2:20:48.080\n Why reason?\n\n2:20:48.080 --> 2:20:50.680\n Because that's where the values come from.\n\n2:20:50.680 --> 2:20:53.440\n That's the only tool we have to discover truth.\n\n2:20:53.440 --> 2:20:57.680\n Yes, you know, reason is something that it doesn't guarantee truth.\n\n2:20:57.680 --> 2:21:01.120\n It doesn't guarantee the world is right, it's fallible.\n\n2:21:01.120 --> 2:21:02.120\n But it's all we have.\n\n2:21:02.120 --> 2:21:06.920\n It's the tool in which we evaluate the world around us and we come to conclusions about\n\n2:21:06.920 --> 2:21:07.920\n it.\n\n2:21:07.920 --> 2:21:09.720\n There just isn't other tools.\n\n2:21:09.720 --> 2:21:14.800\n Emotions are not tools of cognition.\n\n2:21:14.800 --> 2:21:16.840\n Consciousness is a tool.\n\n2:21:16.840 --> 2:21:22.520\n Emotion like love, all of these things are ways to experience the world to say that reason\n\n2:21:22.520 --> 2:21:23.920\n is the best tool.\n\n2:21:23.920 --> 2:21:28.840\n But there's a difference between experiencing the world and evaluating the world in terms\n\n2:21:28.840 --> 2:21:30.400\n of what is truth or what is not.\n\n2:21:30.400 --> 2:21:32.880\n As a scientist, I appreciate the value of reason.\n\n2:21:32.880 --> 2:21:36.200\n And emotions and love are consequences.\n\n2:21:36.200 --> 2:21:38.160\n They're not primary.\n\n2:21:38.160 --> 2:21:40.760\n Emotions are consequences of conclusions you've come to.\n\n2:21:40.760 --> 2:21:46.600\n Your emotions will change very quickly, relatively speaking, when your evaluations of a situation\n\n2:21:46.600 --> 2:21:47.840\n will change.\n\n2:21:47.840 --> 2:21:51.920\n Different people can see exactly the same scene and have completely different emotions\n\n2:21:51.920 --> 2:21:55.640\n because they're bringing different value systems and they're bringing different thoughts to\n\n2:21:55.640 --> 2:21:56.680\n the process.\n\n2:21:56.680 --> 2:21:57.680\n Maybe love is primary.\n\n2:21:57.680 --> 2:21:58.680\n But let me ask.\n\n2:21:58.680 --> 2:21:59.880\n Love is the same thing.\n\n2:21:59.880 --> 2:22:01.240\n You can fall out of love with somebody.\n\n2:22:01.240 --> 2:22:02.240\n Why?\n\n2:22:02.240 --> 2:22:03.240\n Because you learn something new.\n\n2:22:03.240 --> 2:22:05.280\n Because you've discovered something new about the person.\n\n2:22:05.280 --> 2:22:06.280\n Now you don't love them anymore.\n\n2:22:06.280 --> 2:22:07.680\n This is the wrong podcast to bring up love.\n\n2:22:07.680 --> 2:22:09.720\n We'll talk forever about it.\n\n2:22:09.720 --> 2:22:15.600\n So, Yoram, you wrote the book, The Virtue of Nationalism, contrasting nation states with\n\n2:22:15.600 --> 2:22:19.000\n empires and with global governance like United Nations and so on.\n\n2:22:19.000 --> 2:22:26.160\n So you argue that nationalism uniquely provides the, quote, the collective right of a free\n\n2:22:26.160 --> 2:22:28.120\n people to rule themselves.\n\n2:22:28.120 --> 2:22:35.680\n So continuing our conversation, why is this particular collection of humans we call a\n\n2:22:35.680 --> 2:22:42.120\n nation a uniquely powerful way to preserve the freedom of a people, to have people rule\n\n2:22:42.120 --> 2:22:43.120\n themselves?\n\n2:22:43.120 --> 2:22:49.000\n Before I say anything on the subject, I should emphasize that I'm not a rationalist.\n\n2:22:49.000 --> 2:22:58.320\n I'm an empiricist and I'm offering what I think is a valid observation of human history.\n\n2:22:58.320 --> 2:23:03.520\n I don't have some kind of deductive framework for proving that the nation is the best.\n\n2:23:03.520 --> 2:23:07.720\n And empirically, we know something about the way systems of national states work and about\n\n2:23:07.720 --> 2:23:11.640\n the way empires work and the way tribal societies work.\n\n2:23:11.640 --> 2:23:16.240\n What we don't know is, you know, is it possible to invent something else?\n\n2:23:16.240 --> 2:23:18.760\n I mean, there's a lot of things we don't know here.\n\n2:23:18.760 --> 2:23:25.400\n So with the caveat that I'm making an empirical observation, the basic argument is human beings\n\n2:23:25.400 --> 2:23:32.860\n form collectives naturally, loyalty groups, and for most of human history and prehistory,\n\n2:23:32.860 --> 2:23:36.780\n as far as we know, human beings lived in tribal societies.\n\n2:23:36.780 --> 2:23:46.120\n Tribal societies are societies in which there's constant friction and constant warfare among\n\n2:23:46.120 --> 2:23:50.020\n very small groups, among families and clans.\n\n2:23:50.020 --> 2:23:55.280\n And we reach a turning point in human history with the invention of large scale agriculture,\n\n2:23:55.280 --> 2:23:57.240\n which allows the creation of vast wealth.\n\n2:23:57.240 --> 2:24:01.640\n It allows the establishment of standing armies instead of militias.\n\n2:24:01.640 --> 2:24:08.400\n You know, Sargon of Akkad says, I can pay 5,000 men to do nothing other than to drill\n\n2:24:08.400 --> 2:24:12.000\n in the arts of war and then I'm gonna send them out to conquer the neighboring city states\n\n2:24:12.000 --> 2:24:13.920\n and there you have empire.\n\n2:24:13.920 --> 2:24:22.000\n The Bible, which is the source of our image, our conception of a world of independent nations\n\n2:24:22.000 --> 2:24:27.380\n that are not constantly trying to conquer one another, the source of that is the Bible.\n\n2:24:27.380 --> 2:24:38.800\n And the biblical world is one in which Israel and various other small nations are trying\n\n2:24:38.800 --> 2:24:46.480\n to fight for their independence against world empires, against empires Babylonian, Assyrian,\n\n2:24:46.480 --> 2:24:51.440\n Persian, Egyptian, which aspire to rule the world.\n\n2:24:51.440 --> 2:25:00.280\n My claim is fundamentally twofold, it's moral that whenever you conquer a foreign nation,\n\n2:25:00.280 --> 2:25:04.000\n you're murdering and you're stealing, you're destroying.\n\n2:25:04.000 --> 2:25:10.680\n As your own would say, you're using force to cause people to submit.\n\n2:25:10.680 --> 2:25:18.960\n So there is something in the prophets that rebels against this ongoing atrocity and carnage\n\n2:25:18.960 --> 2:25:23.600\n of trying to take over the whole world.\n\n2:25:23.600 --> 2:25:30.160\n And there's a prudential practical argument, which is that the world is governed best when\n\n2:25:30.160 --> 2:25:34.960\n there are multiple nations, when they're free to experiment and chart their own courses.\n\n2:25:34.960 --> 2:25:41.560\n That means they have their own route to God, they have their own moralities, they have\n\n2:25:41.560 --> 2:25:44.680\n their own forms of economy and government.\n\n2:25:44.680 --> 2:25:49.960\n And what tends to happen in history is that when something is successful, when something\n\n2:25:49.960 --> 2:25:54.800\n looks like, when a different nation looks at it and say, well, those people are flourishing,\n\n2:25:54.800 --> 2:26:01.360\n they're succeeding, then it's imitated in the way that the Dutch invented the stock\n\n2:26:01.360 --> 2:26:06.840\n market and the English said, look, that makes them powerful, so we'll adopt it.\n\n2:26:06.840 --> 2:26:09.760\n So there's endless examples of that.\n\n2:26:09.760 --> 2:26:10.840\n So that's the argument for it.\n\n2:26:10.840 --> 2:26:20.320\n The argument is since we don't know a priori deductively from self evident principles what\n\n2:26:20.320 --> 2:26:25.160\n is best, it's best to have a world in which people are trying different things.\n\n2:26:25.160 --> 2:26:30.760\n So quick question, because the word nationalism sometimes is presented in negative light in\n\n2:26:30.760 --> 2:26:37.040\n connection to the nationalism of Nazi Germany, for example.\n\n2:26:37.040 --> 2:26:43.800\n So you're looking empirically at a world of nations that respect each other.\n\n2:26:43.800 --> 2:26:49.560\n I use the word nationalism the way that I inherited it in my tradition, which is it's\n\n2:26:49.560 --> 2:26:56.120\n a principled standpoint that says that the world is governed best when many nations are\n\n2:26:56.120 --> 2:26:59.000\n able to be independent and chart their own course.\n\n2:26:59.000 --> 2:27:00.000\n That's nationalism.\n\n2:27:00.000 --> 2:27:02.780\n As far as the Nazis, Hitler's an imperialist.\n\n2:27:02.780 --> 2:27:04.340\n He hated nation states.\n\n2:27:04.340 --> 2:27:08.800\n His whole theory, if you pick up, I don't recommend doing this, but if you do...\n\n2:27:08.800 --> 2:27:10.440\n I'm actually reading it right now, Mein Kampf?\n\n2:27:10.440 --> 2:27:11.440\n Right.\n\n2:27:11.440 --> 2:27:15.520\n If you do read Mein Kampf, then you'll see that he says explicitly that the goal is for\n\n2:27:15.520 --> 2:27:23.040\n Germany to be the lord of the earth and mistress of the globe, and he detests the idea of the\n\n2:27:23.040 --> 2:27:27.160\n independent nation state because he sees it as weak and defeat.\n\n2:27:27.160 --> 2:27:28.640\n He might as well have said it's Jewish.\n\n2:27:28.640 --> 2:27:35.440\n So let me ask from the individual perspective, for nationalism, what do you make of the value\n\n2:27:35.440 --> 2:27:38.640\n of the love of country?\n\n2:27:38.640 --> 2:27:45.680\n The reason I connect that... So I personally, what would you say, a patriot?\n\n2:27:45.680 --> 2:27:48.400\n I love the love of country.\n\n2:27:48.400 --> 2:27:56.920\n Or I am susceptible... Or how should... In a Randian way, I enjoy... I in a self interest\n\n2:27:56.920 --> 2:27:57.920\n...\n\n2:27:57.920 --> 2:27:58.920\n That's good.\n\n2:27:58.920 --> 2:27:59.920\n Don't run away from it.\n\n2:27:59.920 --> 2:28:04.160\n Well, I love a lot of things, but I'm saying this particular love is a little bit contentious,\n\n2:28:04.160 --> 2:28:06.640\n which is loving your country.\n\n2:28:06.640 --> 2:28:11.960\n That's an interesting love that some people are a little uncomfortable with, especially\n\n2:28:11.960 --> 2:28:18.120\n when that love... I grew up in the Soviet Union to say you just love the country.\n\n2:28:18.120 --> 2:28:22.640\n It represents a certain thing to you, and you don't think philosophically like I was\n\n2:28:22.640 --> 2:28:26.840\n marching around with marks under my arm or something like that.\n\n2:28:26.840 --> 2:28:33.280\n It's just loving community at the level of nation.\n\n2:28:33.280 --> 2:28:34.280\n It's very interesting.\n\n2:28:34.280 --> 2:28:39.400\n I don't know if that's an artifact of the past that we're going to have to strip away.\n\n2:28:39.400 --> 2:28:44.480\n I don't know if I was just raised in that kind of community, but I appreciate that.\n\n2:28:44.480 --> 2:28:51.480\n I guess the thing I'm torn about is that love of country that I have in my heart that I\n\n2:28:51.480 --> 2:28:57.000\n now love America and I consider myself an American, that would have easily, if I was\n\n2:28:57.000 --> 2:29:03.240\n born earlier, been used by Stalin, and I would have proudly died on the battlefield.\n\n2:29:03.240 --> 2:29:08.480\n I would have proudly died if I was in Nazi Germany as a German, and I would proudly die\n\n2:29:08.480 --> 2:29:09.480\n as an American.\n\n2:29:09.480 --> 2:29:11.480\n Are you sure about these things?\n\n2:29:11.480 --> 2:29:12.480\n Yes.\n\n2:29:12.480 --> 2:29:13.480\n That's interesting.\n\n2:29:13.480 --> 2:29:14.800\n I think about this a lot.\n\n2:29:14.800 --> 2:29:18.880\n It's interesting to run a radical counterfactual and be sure of the answer.\n\n2:29:18.880 --> 2:29:19.880\n I mean...\n\n2:29:19.880 --> 2:29:20.880\n I'm not sure.\n\n2:29:20.880 --> 2:29:25.720\n I think about this a lot because, obviously, I'm really interested in history.\n\n2:29:25.720 --> 2:29:29.680\n This is the way I think about most situations is I empathize.\n\n2:29:29.680 --> 2:29:35.120\n I really try to do hard work of placing myself in that moment and thinking through it.\n\n2:29:35.120 --> 2:29:39.800\n I'm just... Okay, I just know myself psychologically.\n\n2:29:39.800 --> 2:29:46.080\n What I'm susceptible to, that's a negative way to phrase it, but what I would love doing.\n\n2:29:46.080 --> 2:29:57.640\n I'm just saying, my question is, is the love of nation a useful or a powerful moral, from\n\n2:29:57.640 --> 2:30:01.080\n a moral philosophy perspective, a good thing?\n\n2:30:01.080 --> 2:30:04.840\n I think it is a good thing, but before we ask whether it's a good thing, I think it's\n\n2:30:04.840 --> 2:30:08.020\n worth asking whether there's any way to live without it.\n\n2:30:08.020 --> 2:30:14.240\n The idea of national independence of a world or a continent which politically is governed\n\n2:30:14.240 --> 2:30:19.400\n by multiple independent national states, that is a political theory.\n\n2:30:19.400 --> 2:30:23.880\n Somebody came up with that in the Bible or elsewhere.\n\n2:30:23.880 --> 2:30:29.200\n Someone came up with this idea and sold it, and a lot of people like it, but the nation\n\n2:30:29.200 --> 2:30:32.920\n is not an invention.\n\n2:30:32.920 --> 2:30:41.640\n Every place in human history that we have any record of, there are nations.\n\n2:30:41.640 --> 2:30:51.320\n The fact of people creating families, families creating an alliance of clans, clans creating\n\n2:30:51.320 --> 2:31:00.440\n alliances of tribes, tribes creating an alliance that becomes the nation, we see that everywhere\n\n2:31:00.440 --> 2:31:03.800\n in human history, everywhere we look.\n\n2:31:03.800 --> 2:31:10.200\n The love of a group of tribes that have come together in order to fight opponents that\n\n2:31:10.200 --> 2:31:19.000\n are trying to destroy your way of life and steal your land and harm your women and children,\n\n2:31:19.000 --> 2:31:24.160\n the love of the leadership that brings it together.\n\n2:31:24.160 --> 2:31:32.680\n This is a George Washington type figure or an Alfred the Great type figure or Saul, the\n\n2:31:32.680 --> 2:31:39.520\n biblical Saul, somebody who has the wisdom, the daring to unite the tribes, overcome their\n\n2:31:39.520 --> 2:31:48.760\n internal, mutual hatreds and grievances and rally them around a set of ideas, a language,\n\n2:31:48.760 --> 2:31:53.920\n a tradition, an identity as people say today.\n\n2:31:53.920 --> 2:31:57.280\n That love is irradicable from human beings.\n\n2:31:57.280 --> 2:32:00.040\n Maybe we'll have a brave new world, people will take drugs in order to get rid of it.\n\n2:32:00.040 --> 2:32:03.560\n The problem is that could be leveraged by authoritarian regimes.\n\n2:32:03.560 --> 2:32:05.240\n Yes, but that's true of everything.\n\n2:32:05.240 --> 2:32:08.960\n It's like saying you can have children and you can teach them to be evil.\n\n2:32:08.960 --> 2:32:11.200\n You can make a lot of money, you can use it for evil.\n\n2:32:11.200 --> 2:32:14.320\n You can have a gun for self defense, but you can use it for evil.\n\n2:32:14.320 --> 2:32:16.240\n Come on, that's human.\n\n2:32:16.240 --> 2:32:17.240\n That's being human.\n\n2:32:17.240 --> 2:32:20.520\n You guys are making love this primary, which I don't think it is.\n\n2:32:20.520 --> 2:32:22.320\n How dare you, your honor.\n\n2:32:22.320 --> 2:32:23.320\n I know.\n\n2:32:23.320 --> 2:32:25.680\n There are lots of people in the world out there who don't love their nation because\n\n2:32:25.680 --> 2:32:27.520\n the nation is not worth loving.\n\n2:32:27.520 --> 2:32:29.160\n That is love is conditional.\n\n2:32:29.160 --> 2:32:30.520\n It's not unconditional.\n\n2:32:30.520 --> 2:32:34.960\n Love is conditioned on the value that's presented to you.\n\n2:32:34.960 --> 2:32:37.720\n I lived through this experience in my own life.\n\n2:32:37.720 --> 2:32:48.120\n I grew up in Israel at a time of everything was geared towards patriotism and the state.\n\n2:32:48.120 --> 2:32:54.960\n I would say I was trained to, when I saw a grenade, to jump on it because that was every\n\n2:32:54.960 --> 2:33:03.320\n song and every story and everything was about the state is everything and you should sacrifice.\n\n2:33:03.320 --> 2:33:06.840\n When the flag went up, I got teary eyed.\n\n2:33:06.840 --> 2:33:13.400\n I bought into it completely and at some point, I rejected that and I changed and I changed\n\n2:33:13.400 --> 2:33:16.320\n my alliance and I rejected my love of Israel.\n\n2:33:16.320 --> 2:33:20.280\n It's not that I don't love it anymore, but it's certainly not my top love and I'm certainly\n\n2:33:20.280 --> 2:33:25.360\n not looking for the grenade to jump on and I'm not volunteering to go fight the war there.\n\n2:33:25.360 --> 2:33:30.240\n I fell in love from a distance with the idea of America.\n\n2:33:30.240 --> 2:33:33.840\n I love the idea of America more than I love America.\n\n2:33:33.840 --> 2:33:38.120\n I could see myself falling out of love with America given where it's heading.\n\n2:33:38.120 --> 2:33:39.800\n It's not automatic.\n\n2:33:39.800 --> 2:33:47.920\n It's conditioned on what it is that it represents and what value it represents for me.\n\n2:33:47.920 --> 2:33:51.040\n I think that's always the case with love.\n\n2:33:51.040 --> 2:33:55.760\n It's not true that children have to love their parents.\n\n2:33:55.760 --> 2:34:00.520\n That's the ideal and hopefully most children love their parents, but some children fall\n\n2:34:00.520 --> 2:34:04.960\n out of love with their parents because their parents don't deserve their love.\n\n2:34:04.960 --> 2:34:07.320\n The same with the other way around.\n\n2:34:07.320 --> 2:34:11.140\n I think parents are capable of not loving their children.\n\n2:34:11.140 --> 2:34:12.720\n Love is a conditional thing.\n\n2:34:12.720 --> 2:34:13.720\n It's not automatic.\n\n2:34:13.720 --> 2:34:14.720\n Let me point out an agreement.\n\n2:34:14.720 --> 2:34:15.720\n Let me say something about an agreement.\n\n2:34:15.720 --> 2:34:18.720\n You're trying to bribe me with an agreement.\n\n2:34:18.720 --> 2:34:25.280\n To soften the blow, mostly I like to talk to Yaron about his ideas and I don't want\n\n2:34:25.280 --> 2:34:28.760\n to talk about Ayn Rand, but I want to say something.\n\n2:34:28.760 --> 2:34:32.240\n Just one thing about Ayn Rand.\n\n2:34:32.240 --> 2:34:34.800\n All my kids read Ayn Rand's books.\n\n2:34:34.800 --> 2:34:39.280\n My father read The Fountainhead.\n\n2:34:39.280 --> 2:34:42.920\n We know Ayn Rand.\n\n2:34:42.920 --> 2:34:47.520\n I'll tell you it is incredibly difficult reading for me.\n\n2:34:47.520 --> 2:34:48.520\n It's painful.\n\n2:34:48.520 --> 2:34:49.860\n It's painful to read.\n\n2:34:49.860 --> 2:34:51.600\n Why is it painful?\n\n2:34:51.600 --> 2:35:00.160\n Not because I disagree with the view of trading and business and the creativity of it and\n\n2:35:00.160 --> 2:35:01.840\n Reardon Metal.\n\n2:35:01.840 --> 2:35:12.480\n That stuff moves me and I do admire it, but to read a book that's a thousand pages long\n\n2:35:12.480 --> 2:35:21.040\n in which nobody is having children, nobody is having a stable marriage, no one is running\n\n2:35:21.040 --> 2:35:29.280\n an admirable government that's fighting for a just cause, anywhere, anywhere.\n\n2:35:29.280 --> 2:35:36.960\n I feel like it's focusing on one aspect of what it is to be human and to flourish and\n\n2:35:36.960 --> 2:35:42.000\n that everything else is just erased and thrown out as though it's just not part of reality\n\n2:35:42.000 --> 2:35:43.000\n and I'm scared.\n\n2:35:43.000 --> 2:35:48.720\n I'm scared of what happens to teenagers who hormonally are in any case.\n\n2:35:48.720 --> 2:35:55.720\n They're programmed to pull away from their parents and experiment with things.\n\n2:35:55.720 --> 2:36:03.160\n They're biologically programmed to do that and you give them a book which says, look,\n\n2:36:03.160 --> 2:36:04.320\n you don't have to have a family.\n\n2:36:04.320 --> 2:36:05.440\n You don't have to raise children.\n\n2:36:05.440 --> 2:36:06.580\n You don't have to have a country.\n\n2:36:06.580 --> 2:36:08.300\n You don't have to fight for anything.\n\n2:36:08.300 --> 2:36:13.080\n All you have to do is assert yourself and trade.\n\n2:36:13.080 --> 2:36:16.320\n I think it's destructive because it's not realistic.\n\n2:36:16.320 --> 2:36:17.320\n It's just not real.\n\n2:36:17.320 --> 2:36:19.680\n But I got none of that from Ayn Rand.\n\n2:36:19.680 --> 2:36:23.120\n I got none of that from Ayn Rand.\n\n2:36:23.120 --> 2:36:24.980\n The books were not about a family.\n\n2:36:24.980 --> 2:36:32.800\n You could write a book in Ayn Rand style where people have a family, but the goal, the purpose,\n\n2:36:32.800 --> 2:36:33.800\n it's a novel.\n\n2:36:33.800 --> 2:36:34.800\n It's not.\n\n2:36:34.800 --> 2:36:37.560\n It's a novel which is delimited with a particular story.\n\n2:36:37.560 --> 2:36:41.840\n There's one family in Gulch Gulch and there's a little passage about raising children and\n\n2:36:41.840 --> 2:36:47.880\n the value of that because it's not core to what she is writing about, but that doesn't\n\n2:36:47.880 --> 2:36:49.240\n exclude it.\n\n2:36:49.240 --> 2:36:53.600\n When I read Ayn Rand, I read Atlas Shrugged when I was 16, and I read it over the years\n\n2:36:53.600 --> 2:36:54.600\n several times more.\n\n2:36:54.600 --> 2:36:59.320\n It never occurred to me, oh, Ayn Rand's anti family, I shouldn't have a family.\n\n2:36:59.320 --> 2:37:01.160\n That thought never came into my mind.\n\n2:37:01.160 --> 2:37:02.640\n I always wanted to have children.\n\n2:37:02.640 --> 2:37:04.760\n I continue to want to have children.\n\n2:37:04.760 --> 2:37:06.760\n I thought of it a little differently.\n\n2:37:06.760 --> 2:37:09.360\n I thought of how I would find a partner a little bit differently.\n\n2:37:09.360 --> 2:37:14.600\n I thought about what I would look for in a partner differently, but not that I wouldn't\n\n2:37:14.600 --> 2:37:15.720\n want to get married.\n\n2:37:15.720 --> 2:37:21.000\n One question I have is what effect it has on society, so outside of you.\n\n2:37:21.000 --> 2:37:23.160\n So for example, you mentioned love should be conditional.\n\n2:37:23.160 --> 2:37:24.160\n I think...\n\n2:37:24.160 --> 2:37:25.160\n Well, it is.\n\n2:37:25.160 --> 2:37:26.160\n Whether you like it or not, it is.\n\n2:37:26.160 --> 2:37:27.880\n You might pretend that it isn't, but it's always conditional.\n\n2:37:27.880 --> 2:37:31.500\n Well, let me try to say something and see if it makes any sense.\n\n2:37:31.500 --> 2:37:38.440\n So could there be things that are true, like love is conditional, is always conditional,\n\n2:37:38.440 --> 2:37:43.220\n but if you say it often, it has a negative effect on society.\n\n2:37:43.220 --> 2:37:50.000\n So for example, I mean, so maybe I'm just a romantic, but good luck saying love is conditional\n\n2:37:50.000 --> 2:37:52.160\n to a romantic partner.\n\n2:37:52.160 --> 2:38:01.220\n I mean, you could, I would argue, en masse, that would deteriorate the quality of relationships.\n\n2:38:01.220 --> 2:38:10.780\n If you remind the partner of that truth that is universal, like you have to, I mean, okay,\n\n2:38:10.780 --> 2:38:11.780\n maybe it's just me.\n\n2:38:11.780 --> 2:38:12.780\n I'll just speak to myself.\n\n2:38:12.780 --> 2:38:16.020\n It's like there is a certain romantic notion of unconditional love.\n\n2:38:16.020 --> 2:38:20.360\n It's part of why you have so many destructive marriages.\n\n2:38:20.360 --> 2:38:21.360\n It's part of why...\n\n2:38:21.360 --> 2:38:22.360\n So you would say that's a problem.\n\n2:38:22.360 --> 2:38:29.480\n Yes, it's a real problem because, yes, there is a, you talked about honoring your spouse\n\n2:38:29.480 --> 2:38:33.020\n and there's a real truth there and I respect that.\n\n2:38:33.020 --> 2:38:35.560\n Yes, you have to do certain things.\n\n2:38:35.560 --> 2:38:39.260\n Love is not, you marry somebody and there's a real attitude out there in the culture.\n\n2:38:39.260 --> 2:38:42.540\n You marry somebody and okay, now we're going to, we're just going to cruise.\n\n2:38:42.540 --> 2:38:43.540\n It's just...\n\n2:38:43.540 --> 2:38:44.540\n Right.\n\n2:38:44.540 --> 2:38:45.540\n Hollywood.\n\n2:38:45.540 --> 2:38:46.540\n That's the Hollywood marriage.\n\n2:38:46.540 --> 2:38:47.740\n You know, marriage is work.\n\n2:38:47.740 --> 2:38:49.900\n Like all values, it's work.\n\n2:38:49.900 --> 2:38:51.800\n It's something you have to reignite every day.\n\n2:38:51.800 --> 2:38:59.460\n You have to, the challenges, the real disagreements, the things you fight about, you disagree\n\n2:38:59.460 --> 2:39:07.220\n about and there's real, if it's a value, you work it out, you struggle through it.\n\n2:39:07.220 --> 2:39:10.780\n And sometimes you struggle through it and you come to a conclusion, no, this is not\n\n2:39:10.780 --> 2:39:16.220\n going to work and you dissolve a marriage and I'm all for dissolving after really, really\n\n2:39:16.220 --> 2:39:20.460\n fighting for it because if it's an important value and if you fell in love with this person\n\n2:39:20.460 --> 2:39:23.460\n for a reason, then that's something worth fighting for.\n\n2:39:23.460 --> 2:39:27.700\n I have a feeling that Hollywood goes the other way, but it's not this cruising along and\n\n2:39:27.700 --> 2:39:30.700\n everything is easy, no human relationship is like that.\n\n2:39:30.700 --> 2:39:36.620\n Not friendship, not love, not raising children, not being a child.\n\n2:39:36.620 --> 2:39:43.100\n You know, they require work and they require thinking and they require creating the conditions\n\n2:39:43.100 --> 2:39:46.540\n to thrive and that's the sense in which it's conditional.\n\n2:39:46.540 --> 2:39:55.560\n You have to work at it and it's very easy not to do the work and it's very easy to drift\n\n2:39:55.560 --> 2:39:59.180\n away and I think most people don't do the work, most people take it and generally in\n\n2:39:59.180 --> 2:40:00.180\n life.\n\n2:40:00.180 --> 2:40:05.140\n The only place people seem to work is at work and then they take the rest of their life\n\n2:40:05.140 --> 2:40:10.780\n as I'm going to cruise and yet every aspect of your life, the art you choose, the friends\n\n2:40:10.780 --> 2:40:17.900\n you choose, the lovers you choose, all require real thinking and real work to be successful\n\n2:40:17.900 --> 2:40:18.900\n at them.\n\n2:40:18.900 --> 2:40:23.940\n None of them are just there because there is no such thing as just the intrinsic.\n\n2:40:23.940 --> 2:40:25.820\n Right, I agree with all of that.\n\n2:40:25.820 --> 2:40:32.940\n I was going to say before that the rabbis have this sort of shocking expression, tzargidul\n\n2:40:32.940 --> 2:40:38.780\n banim, the pain of raising children.\n\n2:40:38.780 --> 2:40:45.780\n And I find when I speak to audiences about relationships, I find that in general and\n\n2:40:45.780 --> 2:40:52.220\n this is cross cultural, it's different countries, different religious backgrounds, that in general\n\n2:40:52.220 --> 2:40:58.900\n young people do not know that the only way to make a marriage work is through a lot of\n\n2:40:58.900 --> 2:41:00.700\n pain and overcoming.\n\n2:41:00.700 --> 2:41:05.100\n They don't know that raising children involves a great deal of pain.\n\n2:41:05.100 --> 2:41:11.360\n They don't know that caring for and helping your parents approach the end of their lives\n\n2:41:11.360 --> 2:41:17.980\n causes a great deal of pain and everything is kind of this sketchy, very sketchy, glimpsy\n\n2:41:17.980 --> 2:41:24.580\n kind of, and I mentioned Hollywood just because everything is made to look easy except there's\n\n2:41:24.580 --> 2:41:29.340\n kind of a funny breakdown of something but then maybe there's a divorce, they shoot\n\n2:41:29.340 --> 2:41:32.500\n one another so then they should get divorced.\n\n2:41:32.500 --> 2:41:42.860\n But the reality of how hard it is to do and how heroic it is to do it and then overcome\n\n2:41:42.860 --> 2:41:51.460\n and then actually in the end achieve something, create something that was really, it's almost\n\n2:41:51.460 --> 2:41:58.900\n not discussed and so to me it's just not surprising that if there's no parallel to\n\n2:41:58.900 --> 2:42:05.060\n Ayn Rand about the heroic saving of a marriage that was on the rocks, how does it actually\n\n2:42:05.060 --> 2:42:06.060\n happen?\n\n2:42:06.060 --> 2:42:07.060\n So…\n\n2:42:07.060 --> 2:42:12.020\n So it's a good point you're making but something just came to me that I've never\n\n2:42:12.020 --> 2:42:14.060\n thought of before so that's always good.\n\n2:42:14.060 --> 2:42:16.540\n This is where conversation is good.\n\n2:42:16.540 --> 2:42:22.540\n Look, take the Talmud and I can't remember how many years after the Bible the Talmud\n\n2:42:22.540 --> 2:42:27.300\n is written, over how long of a period it's written, how many people participating in\n\n2:42:27.300 --> 2:42:28.300\n writing it.\n\n2:42:28.300 --> 2:42:30.540\n Ayn Rand was one individual.\n\n2:42:30.540 --> 2:42:36.580\n She wrote a series of books on philosophy which I think are true but they're the beginning.\n\n2:42:36.580 --> 2:42:40.020\n There is a lot of work to be done to apply this.\n\n2:42:40.020 --> 2:42:45.820\n So hopefully there will be one of her students who writes a book on relationships and there'll\n\n2:42:45.820 --> 2:42:51.500\n be somebody who writes a book on developing a political theory in greater detail and develop\n\n2:42:51.500 --> 2:42:52.500\n her ethics.\n\n2:42:52.500 --> 2:42:57.660\n She's got a few writings on ethics and it's in the novels but there's a lot of work\n\n2:42:57.660 --> 2:43:00.900\n to be done, fleshing it out, what does it mean, how do you…\n\n2:43:00.900 --> 2:43:04.940\n So to say Ayn Rand didn't do everything is a truism.\n\n2:43:04.940 --> 2:43:05.940\n She didn't do everything.\n\n2:43:05.940 --> 2:43:07.260\n Okay, so what?\n\n2:43:07.260 --> 2:43:13.020\n But she laid this amazing philosophical foundation that allows us to take those principles and\n\n2:43:13.020 --> 2:43:18.580\n to apply them to all these realms of human life and she does it on a scope that few philosophers\n\n2:43:18.580 --> 2:43:22.780\n in human history have done because she goes from metaphysics all the way to aesthetics,\n\n2:43:22.780 --> 2:43:26.860\n hitting the key, and she's an original thinker on each one of those things.\n\n2:43:26.860 --> 2:43:31.600\n And she might be right, she might be wrong on certain aspects of it, always happy to\n\n2:43:31.600 --> 2:43:35.820\n have a debate about where she's wrong or where she's not, but there's a lot of\n\n2:43:35.820 --> 2:43:37.500\n work to be done, right?\n\n2:43:37.500 --> 2:43:42.620\n It's not like – and if there were objectivists out there who present it as, okay, human knowledge\n\n2:43:42.620 --> 2:43:45.740\n is over because Ayn Rand wrote these books, that's absurd, right?\n\n2:43:45.740 --> 2:43:50.700\n This huge amount of work to be done in applying these particular ideas just like there was\n\n2:43:50.700 --> 2:43:56.460\n for any philosophy, take these ideas and now apply them to all these realms in human experience\n\n2:43:56.460 --> 2:44:00.420\n that flesh it out and make it – and one of the reasons I don't think objectivism\n\n2:44:00.420 --> 2:44:05.180\n is taken off is because there's all this work still to be done that allows it to be\n\n2:44:05.180 --> 2:44:08.380\n relatable to people in every aspect of them.\n\n2:44:08.380 --> 2:44:10.260\n Let me ask a hard question here.\n\n2:44:10.260 --> 2:44:11.260\n We've got –\n\n2:44:11.260 --> 2:44:12.940\n Can I say what I agreed with you, Omar?\n\n2:44:12.940 --> 2:44:13.940\n Sure, sure.\n\n2:44:13.940 --> 2:44:14.940\n This is good.\n\n2:44:14.940 --> 2:44:15.940\n This will be a good transition.\n\n2:44:15.940 --> 2:44:17.620\n Here, this is the clip.\n\n2:44:17.620 --> 2:44:19.460\n This is the clip.\n\n2:44:19.460 --> 2:44:20.860\n I agree about nations.\n\n2:44:20.860 --> 2:44:25.980\n So I don't like the term nationalism because I fear what happens when you put an ism at\n\n2:44:25.980 --> 2:44:27.620\n the end of any word.\n\n2:44:27.620 --> 2:44:28.740\n Anything, yes.\n\n2:44:28.740 --> 2:44:32.420\n But the nation is a good thing.\n\n2:44:32.420 --> 2:44:35.620\n And having a diversity of nations in a sense is a good thing.\n\n2:44:35.620 --> 2:44:42.540\n And in this sense, I don't think one can come up – so look, I said and I hold that\n\n2:44:42.540 --> 2:44:46.740\n the ideal nation is a nation that protects individual rights.\n\n2:44:46.740 --> 2:44:48.380\n How do you do that?\n\n2:44:48.380 --> 2:44:49.420\n What are the details?\n\n2:44:49.420 --> 2:44:52.380\n How do we define property rights exactly in an internet world?\n\n2:44:52.380 --> 2:44:56.140\n There's going to be disagreement, rational, reasonable disagreement.\n\n2:44:56.140 --> 2:45:02.460\n They're going to be – in my future, in the 300 years from now, in my ideas of one\n\n2:45:02.460 --> 2:45:06.500\n finally, right, there will be multiple nations trying to apply the principle of applying\n\n2:45:06.500 --> 2:45:09.620\n individual rights, and they'll do it differently.\n\n2:45:09.620 --> 2:45:13.820\n One of the benefits of federalism is that while you have a national government, there\n\n2:45:13.820 --> 2:45:19.100\n are certain issues that you relegate to states, and they can try different things and learn\n\n2:45:19.100 --> 2:45:23.460\n because there is a huge value in empirical knowledge comes there.\n\n2:45:23.460 --> 2:45:26.120\n You can't just deduce it all and figure it all out.\n\n2:45:26.120 --> 2:45:27.560\n You have to experiment.\n\n2:45:27.560 --> 2:45:34.560\n So I do – I hate the idea of a one world government because experimentation is gone,\n\n2:45:34.560 --> 2:45:37.300\n and if you make a mistake, everybody suffers.\n\n2:45:37.300 --> 2:45:42.140\n I like the idea, and then I like the idea of people being able to choose where they\n\n2:45:42.140 --> 2:45:43.140\n live.\n\n2:45:43.140 --> 2:45:50.380\n But this notion of experimentation I think is crucial, but you need a principle.\n\n2:45:50.380 --> 2:45:54.940\n So I don't like the idea of nations if all the nations are going to be bad, right?\n\n2:45:54.940 --> 2:45:58.140\n If all the nations are going to be horrible, then I don't like it.\n\n2:45:58.140 --> 2:46:04.620\n What I like is a variety of nations all practicing basically good ideas, and then we try to\n\n2:46:04.620 --> 2:46:09.020\n figure out, okay, what works better than other things, and what is sustainable and what is\n\n2:46:09.020 --> 2:46:10.020\n not.\n\n2:46:10.020 --> 2:46:15.660\n Given how many difficult aspects of history and society we talked about, let me ask a\n\n2:46:15.660 --> 2:46:17.660\n hard question of both of you.\n\n2:46:17.660 --> 2:46:22.020\n I'm going to breeze up until now.\n\n2:46:22.020 --> 2:46:25.420\n What gives you hope about the future?\n\n2:46:25.420 --> 2:46:31.700\n So we've been describing reasons to maybe not have hope.\n\n2:46:31.700 --> 2:46:33.100\n What gives you hope?\n\n2:46:33.100 --> 2:46:39.060\n When you look at the world, what gives you hope that in 200 years, in 300 years, in 500\n\n2:46:39.060 --> 2:46:45.820\n years, like the founders look into the future, that human civilization will be all right,\n\n2:46:45.820 --> 2:46:47.860\n and more than that, it will flourish?\n\n2:46:47.860 --> 2:46:49.700\n Two things for me.\n\n2:46:49.700 --> 2:46:50.900\n One is history.\n\n2:46:50.900 --> 2:46:54.740\n So in the very long run, good ideas win out.\n\n2:46:54.740 --> 2:47:03.140\n I think in the very long run, you can go through a dark ages, but you come out of a dark ages.\n\n2:47:03.140 --> 2:47:08.860\n The good and the just does win in the end, even if it is bloody and difficult and hard\n\n2:47:08.860 --> 2:47:10.000\n to get there.\n\n2:47:10.000 --> 2:47:14.800\n So while I am quite pessimistic, unfortunately, about the short run, I'm ultimately optimistic\n\n2:47:14.800 --> 2:47:19.580\n that in the long run, good ideas win and they're justified.\n\n2:47:19.580 --> 2:47:26.740\n And I think the fundamental behind that is I think is that I'm fundamentally positive\n\n2:47:26.740 --> 2:47:27.980\n about human nature.\n\n2:47:27.980 --> 2:47:35.380\n I think human beings can think, they're capable of reasoning, they're capable of figuring\n\n2:47:35.380 --> 2:47:38.620\n out the truth, they're capable of learning from experience.\n\n2:47:38.620 --> 2:47:40.140\n They don't always do it.\n\n2:47:40.140 --> 2:47:45.580\n It's an achievement to do it, but over time, they do.\n\n2:47:45.580 --> 2:47:50.220\n If you create the right circumstances, they will, and when things get bad enough, they\n\n2:47:50.220 --> 2:47:52.060\n look for a way out.\n\n2:47:52.060 --> 2:47:57.940\n They look maybe at history, if the history is available to them, maybe at just learning\n\n2:47:57.940 --> 2:48:05.020\n from what's around them to find better ways of doing things, and that reinforces itself.\n\n2:48:05.020 --> 2:48:10.180\n But human beings are an amazing creature.\n\n2:48:10.180 --> 2:48:14.660\n We're just amazing in our capacity to be creative, in our capacity to think, in our capacity\n\n2:48:14.660 --> 2:48:19.020\n to love, in our capacity to change our environment to fit our needs and to fit our requirements\n\n2:48:19.020 --> 2:48:26.700\n for survival and to learn and to grow and to progress.\n\n2:48:26.700 --> 2:48:29.540\n So again, long term, I think all that wins out.\n\n2:48:29.540 --> 2:48:36.700\n Short term, in any point in history, short term, right now, it doesn't look too good.\n\n2:48:36.700 --> 2:48:48.860\n What about you, Yaron?\n\n2:48:48.860 --> 2:48:58.900\n The source for Yaron's hope is the book of Exodus, which is the first place in human\n\n2:48:58.900 --> 2:49:07.220\n history where we are presented with the possibility that an enslaved people that's being persecuted\n\n2:49:07.220 --> 2:49:14.500\n and murdered and living under the worst possible regime can free itself and have a shot at\n\n2:49:14.500 --> 2:49:24.220\n a life of independence and worth, and it's another inherited Jewish idea in the tradition.\n\n2:49:24.220 --> 2:49:32.140\n The way that we express this is by saying that there is a God who judges.\n\n2:49:32.140 --> 2:49:38.460\n The Israelis in Egypt were enslaved for hundreds of years, according to the Exodus story, hundreds\n\n2:49:38.460 --> 2:49:42.420\n of years before God wakes up and hears them.\n\n2:49:42.420 --> 2:49:51.340\n And he doesn't do anything until Moses kills the oppressor and goes out into the desert.\n\n2:49:51.340 --> 2:49:59.820\n So I think it's pretty realistic that there is a God that God judges and acts, but probably\n\n2:49:59.820 --> 2:50:05.340\n often not for a very, very long time and not until there's a human being who gets up and\n\n2:50:05.340 --> 2:50:06.780\n says enough.\n\n2:50:06.780 --> 2:50:09.320\n I know that today people don't want to read the Bible.\n\n2:50:09.320 --> 2:50:11.240\n They don't like reading the Bible.\n\n2:50:11.240 --> 2:50:21.740\n But I always hear in my ear this cry of the prophet Jeremiah who saw his nation destroyed\n\n2:50:21.740 --> 2:50:24.580\n and his people exiled.\n\n2:50:24.580 --> 2:50:33.220\n And he says, in God's name, he says, he's not my word like fire, like the hammer that\n\n2:50:33.220 --> 2:50:38.140\n shatters rock, a petition, a petzela.\n\n2:50:38.140 --> 2:50:41.900\n My word is like fire, like the hammer that shatters rock.\n\n2:50:41.900 --> 2:50:46.060\n And this is actually the traditional way of saying something like what Yaron is saying\n\n2:50:46.060 --> 2:50:53.100\n that it may take a long, long time, but there is a truth and it has its own strength and\n\n2:50:53.100 --> 2:50:59.600\n it will, in the end, shatter the things that are opposing it.\n\n2:50:59.600 --> 2:51:01.380\n That's our traditional hope.\n\n2:51:01.380 --> 2:51:05.980\n We grow up like that.\n\n2:51:05.980 --> 2:51:07.780\n So I do have hope.\n\n2:51:07.780 --> 2:51:08.780\n I see the trends.\n\n2:51:08.780 --> 2:51:16.220\n The trends are terrible right now and it's frightening and it's hard, but we are terrible\n\n2:51:16.220 --> 2:51:17.460\n at seeing the future.\n\n2:51:17.460 --> 2:51:25.300\n And it is very possible that an unexpected turn of events is going to appear maybe soon,\n\n2:51:25.300 --> 2:51:33.680\n maybe much later, and the possibility of a redemption is there.\n\n2:51:33.680 --> 2:51:40.900\n Let me ask, given that long arc of history, given that you do study the Bible, what is\n\n2:51:40.900 --> 2:51:42.780\n the meaning of this whole thing?\n\n2:51:42.780 --> 2:51:44.180\n What's the meaning of life?\n\n2:51:44.180 --> 2:51:46.300\n Wow, that's beautiful.\n\n2:51:46.300 --> 2:51:59.060\n I think that the meaning of life is in part what Yaron touches on when he says that productive\n\n2:51:59.060 --> 2:52:03.380\n work, labor, creativity is at the heart of what it is to be human.\n\n2:52:03.380 --> 2:52:12.540\n I just think that there are some more arenas and maybe we even agree on a lot of them.\n\n2:52:12.540 --> 2:52:20.700\n To be human is to inherit a world which is imperfect, terribly imperfect, imperfect in\n\n2:52:20.700 --> 2:52:23.860\n many ways.\n\n2:52:23.860 --> 2:52:26.960\n And God created it that way.\n\n2:52:26.960 --> 2:52:34.220\n He created a world which is terribly lacking and he created us with the ability to stand\n\n2:52:34.220 --> 2:52:38.620\n up and to say, I can change the direction of this.\n\n2:52:38.620 --> 2:52:41.020\n I can do something to change the direction of this.\n\n2:52:41.020 --> 2:52:46.100\n I can take the time and the abilities that are given to me to be a partner with God in\n\n2:52:46.100 --> 2:52:47.500\n creating the world.\n\n2:52:47.500 --> 2:52:50.660\n It's not going to stay the way it was before me.\n\n2:52:50.660 --> 2:52:56.560\n It'll be something different, maybe a little bit, maybe a lot.\n\n2:52:56.560 --> 2:52:59.340\n But that is the heart.\n\n2:52:59.340 --> 2:53:00.340\n That is the key.\n\n2:53:00.340 --> 2:53:06.140\n That is the meaningful life is to be a partner with God in creating the world so that it\n\n2:53:06.140 --> 2:53:12.180\n is moving that much more in the right direction rather than the way we found it.\n\n2:53:12.180 --> 2:53:16.540\n So nudge, even if a little bit, the direction of the world.\n\n2:53:16.540 --> 2:53:24.860\n Well, Yaron, you've actually been talking in your program about life quite a bit.\n\n2:53:24.860 --> 2:53:32.620\n So let me ask the same question and I never tire you of asking this question.\n\n2:53:32.620 --> 2:53:34.900\n What do you think is the meaning of this whole thing?\n\n2:53:34.900 --> 2:53:41.260\n Well, I mean, I don't believe in God, so God doesn't play a role in my view of the meaning\n\n2:53:41.260 --> 2:53:42.260\n of life.\n\n2:53:42.260 --> 2:53:44.780\n I think the meaning of life is to live.\n\n2:53:44.780 --> 2:53:52.100\n I like to say to live with a capital L. It's to embrace it and I agree with you on in a\n\n2:53:52.100 --> 2:53:57.580\n sense we're born into a world and as human beings, one of the things that makes us very\n\n2:53:57.580 --> 2:54:01.340\n different than other animals is our capacity to change that world.\n\n2:54:01.340 --> 2:54:04.140\n We can actually go out there and change the world around us.\n\n2:54:04.140 --> 2:54:09.660\n We can change it materially through production and through, we can change it spiritually\n\n2:54:09.660 --> 2:54:12.300\n through changing the ideas of people.\n\n2:54:12.300 --> 2:54:17.260\n We can change the direction to which humanity works.\n\n2:54:17.260 --> 2:54:20.060\n We can create a little universe.\n\n2:54:20.060 --> 2:54:23.780\n I think part of the joy of creating a family is to create a little universe.\n\n2:54:23.780 --> 2:54:29.020\n We're creating a little world around us that's part of the joy.\n\n2:54:29.020 --> 2:54:32.820\n And there is joy in family, let's not make it all about difficulty and hard work.\n\n2:54:32.820 --> 2:54:33.820\n I agree.\n\n2:54:33.820 --> 2:54:34.820\n I agree.\n\n2:54:34.820 --> 2:54:39.580\n Part of the idea of getting married is to create a little world in which you and your\n\n2:54:39.580 --> 2:54:45.180\n spouse are creating something that didn't exist before and building something, building\n\n2:54:45.180 --> 2:54:46.180\n a universe.\n\n2:54:46.180 --> 2:54:47.180\n But it's really to live.\n\n2:54:47.180 --> 2:54:55.140\n And one of the things that I see and it saddens me is wasted lives, is people who just cruise\n\n2:54:55.140 --> 2:54:56.140\n through life.\n\n2:54:56.140 --> 2:55:01.860\n They get born in a particular place, they never challenge it, they never question.\n\n2:55:01.860 --> 2:55:05.860\n They just, you know, they live, die and nothing really happened.\n\n2:55:05.860 --> 2:55:06.860\n Nothing really changed.\n\n2:55:06.860 --> 2:55:09.060\n They didn't produce, they didn't make anything of their life.\n\n2:55:09.060 --> 2:55:12.700\n And produce here, again, in the largest sense.\n\n2:55:12.700 --> 2:55:17.100\n So to me it's, in every aspect of life, as you know because you've listened to my show,\n\n2:55:17.100 --> 2:55:22.020\n I love art, I love aesthetics, I love the experience of great art.\n\n2:55:22.020 --> 2:55:31.060\n I love relationships, I love producing, I like business, I like that aspect of it.\n\n2:55:31.060 --> 2:55:38.340\n And I think people are shallow in so many parts of their lives, which saddens me.\n\n2:55:38.340 --> 2:55:42.940\n If you had eight billion people on this planet, even if it never grew, even if we just stayed\n\n2:55:42.940 --> 2:55:47.580\n at eight billion, but the eight billion all lived fully, wow.\n\n2:55:47.580 --> 2:55:52.620\n I mean, what an amazing place this would be, what an amazing experience we would have.\n\n2:55:52.620 --> 2:55:57.140\n So to me that is, the meaning is just make the most that you have a short period of time\n\n2:55:57.140 --> 2:55:58.980\n on earth.\n\n2:55:58.980 --> 2:55:59.980\n And that's it.\n\n2:55:59.980 --> 2:56:00.980\n This is it.\n\n2:56:00.980 --> 2:56:05.060\n And live it, experience it fully and challenge yourself and push yourself.\n\n2:56:05.060 --> 2:56:08.260\n And let me just say something about optimism.\n\n2:56:08.260 --> 2:56:13.020\n One source of hope for me in the world in which we live right now is that there are\n\n2:56:13.020 --> 2:56:18.020\n people who do that, at least in certain realms of their lives.\n\n2:56:18.020 --> 2:56:23.220\n And I'm inspired, and I know a lot of people don't like me for this, but I'm inspired for\n\n2:56:23.220 --> 2:56:26.820\n example by Silicon Valley, in spite of all the political disagreements I have with them\n\n2:56:26.820 --> 2:56:27.820\n and all of that.\n\n2:56:27.820 --> 2:56:33.060\n I'm inspired by people inventing new technologies and building, I'm inspired by the people you\n\n2:56:33.060 --> 2:56:38.020\n talk to about artificial intelligence and about new ideas and about pushing the boundaries\n\n2:56:38.020 --> 2:56:39.260\n of science.\n\n2:56:39.260 --> 2:56:43.460\n Those things are exciting and it's terrific to see a world that I think generally is in\n\n2:56:43.460 --> 2:56:44.460\n decline.\n\n2:56:44.460 --> 2:56:50.260\n Yet there are these pockets in which people are still creating new ventures and new ideas\n\n2:56:50.260 --> 2:56:52.420\n and new things.\n\n2:56:52.420 --> 2:56:56.620\n That inspires me and it gives me hope that that is not dead, that in spite of the decay\n\n2:56:56.620 --> 2:57:02.180\n that's in our culture, there's still pockets where that spirit of being human is still\n\n2:57:02.180 --> 2:57:03.180\n alive and well.\n\n2:57:03.180 --> 2:57:05.220\n Yeah, they inspire me as well.\n\n2:57:05.220 --> 2:57:12.260\n Yeah, and they truly live with a capital L, and maybe I can do a star, maybe you can also\n\n2:57:12.260 --> 2:57:17.140\n put a little bit of love with a capital L out there as well.\n\n2:57:17.140 --> 2:57:21.220\n Yaron, you knew I would end it that way, wouldn't you?\n\n2:57:21.220 --> 2:57:23.780\n Yaron, thank you so much, this is a huge honor.\n\n2:57:23.780 --> 2:57:28.260\n I really enjoyed the debate yesterday, I really enjoyed the conversation today that you spent\n\n2:57:28.260 --> 2:57:30.580\n your valuable time with me, it just means a lot.\n\n2:57:30.580 --> 2:57:33.420\n Thank you so much, this was amazing.\n\n2:57:33.420 --> 2:57:37.500\n Thanks for listening to this conversation with Yaron Brook and Yaron Hosoni.\n\n2:57:37.500 --> 2:57:42.180\n To support this podcast, please check out our sponsors in the description.\n\n2:57:42.180 --> 2:57:46.420\n And now, let me leave you with some words from Edmund Burke.\n\n2:57:46.420 --> 2:57:53.220\n The only thing necessary for the triumph of evil is for good men to do nothing.\n\n2:57:53.220 --> 2:58:04.900\n Thank you for listening, and hope to see you next time.\n\n"
}