{
  "title": "Sheldon Solomon: Death and Meaning | Lex Fridman Podcast #117",
  "id": "qfKyNxfyWbo",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.760\n The following is a conversation with Sheldon Solomon, a social psychologist, a philosopher,\n\n00:05.760 --> 00:12.560\n co developer of terror management theory, and co author of The Warm at the Core on the role of\n\n00:12.560 --> 00:18.480\n death in life. He further carried the ideas of Ernest Becker that can crudely summarize as the\n\n00:18.480 --> 00:25.040\n idea that our fear of death is at the core of the human condition and the driver of most of the\n\n00:25.040 --> 00:32.480\n creations of human civilization. Quick summary of the sponsors Blinkist, ExpressVPN, and Cash App.\n\n00:32.480 --> 00:36.800\n Click the links in the description to get a discount. It really is the best way to support\n\n00:36.800 --> 00:43.120\n this podcast. Let me say as a side note that Ernest Becker's book, Denial of Death, had a\n\n00:43.120 --> 00:49.360\n big impact on my thinking about human cognition, consciousness, and the deep ocean currents of our\n\n00:49.360 --> 00:55.280\n mind that are behind the surface behaviors we observe. Many people have told me that they think\n\n00:55.280 --> 01:00.960\n about death, or don't think about death, fear death, or don't fear death, but I think not many\n\n01:00.960 --> 01:08.320\n people think about this topic deeply, rigorously, in the way that Nietzsche suggested. This topic,\n\n01:08.320 --> 01:15.360\n like many that lead to deep personal self reflection, frankly is dangerous for the mind.\n\n01:15.360 --> 01:20.560\n As all first principles thinking about the human condition is, if you gaze long into the abyss,\n\n01:20.560 --> 01:26.240\n like Nietzsche said, the abyss will gaze back into you. I have been recently reading a lot\n\n01:26.240 --> 01:32.160\n about World War II, Stalin, and Hitler. It feels to me that there is some fundamental truth there\n\n01:32.160 --> 01:38.800\n to be discovered, in the moments of history that changed everything, the suffering, the triumphs.\n\n01:39.520 --> 01:43.760\n If I bring up Donald Trump or Vladimir Putin in these conversations, it is never through\n\n01:43.760 --> 01:52.080\n a political lens. I'm not left nor right. I think for myself, deeply, and often question everything,\n\n01:52.080 --> 01:58.320\n changing my mind as often as is needed. I ask for your patience, empathy, and rigorous thinking.\n\n01:58.320 --> 02:04.160\n If you arrived to this podcast from a place of partisanship, if you hate Trump, or love Trump,\n\n02:04.160 --> 02:09.760\n or any other political leader, no matter what he or they do, and see everyone who disagrees with\n\n02:09.760 --> 02:16.000\n you as delusional, I ask that you unsubscribe, and don't listen to these conversations, because my\n\n02:16.000 --> 02:21.920\n hope is to go beyond that kind of divisive thinking. I think we can only make progress\n\n02:21.920 --> 02:27.680\n toward truth through deep, empathetic thinking and conversation, and as always, love.\n\n02:28.960 --> 02:33.360\n If you enjoy this thing, subscribe on YouTube, review it with 5 Stars and Apple Podcasts,\n\n02:33.360 --> 02:38.400\n follow on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n02:38.400 --> 02:44.400\n As usual, I'll do a few minutes of ads now, and no ads in the middle. I try to make these\n\n02:44.400 --> 02:49.840\n interesting, but I give you timestamps so you can skip. But please do check out the sponsors\n\n02:49.840 --> 02:53.520\n by clicking the links in the description. It's the best way to support this podcast.\n\n02:54.480 --> 02:59.760\n This episode is supported by Blinkist, my favorite app for learning new things.\n\n02:59.760 --> 03:05.760\n Get it at blinkist.com slash lex for a 7 day free trial and 25% off after.\n\n03:05.760 --> 03:10.560\n Blinkist takes the key ideas from thousands of nonfiction books and condenses them down into\n\n03:10.560 --> 03:16.480\n just 15 minutes that you can read or listen to. I'm a big believer in reading at least an hour a\n\n03:16.480 --> 03:22.240\n day. As part of that, I use Blinkist every day, and in general, it's a great way to broaden your\n\n03:22.240 --> 03:27.120\n view of the ideal landscape out there, and find books that you may want to read more deeply.\n\n03:27.680 --> 03:32.640\n With Blinkist, you get unlimited access to read or listen to a massive library of condensed\n\n03:32.640 --> 03:38.880\n nonfiction books. Right now, for a limited time, Blinkist has a special offer just for our audience.\n\n03:38.880 --> 03:45.920\n Go to blinkist.com slash lex to try it free for 7 days and save 25% off your new subscription.\n\n03:45.920 --> 03:52.720\n That's blinkist.com slash lex. Blinkist spelled B L I N K I S T.\n\n03:53.440 --> 04:00.160\n This show is sponsored by ExpressVPN. Get it at expressvpn.com slash lex pod to get a discount\n\n04:00.160 --> 04:05.680\n and to support this podcast. Have you ever watched The Office? If you have, you probably know it's\n\n04:05.680 --> 04:11.840\n based on a UK series also called The Office. Not to stir up trouble, but I think the British version\n\n04:11.840 --> 04:16.960\n is actually more brilliant than the American one, but both are pretty amazing. Anyway, there are\n\n04:16.960 --> 04:21.840\n actually nine other countries with their own version of The Office. You can get access to them\n\n04:21.840 --> 04:28.160\n with no geo restrictions when you use ExpressVPN. It lets you control where you want sites to think\n\n04:28.160 --> 04:33.360\n you're located. You can choose from nearly 100 countries giving you access to content that isn't\n\n04:33.360 --> 04:40.320\n available in your region. So again, get it on any device at expressvpn.com slash lex pod to get extra\n\n04:40.320 --> 04:46.880\n three months free and to support this podcast. This show is presented by the great, the powerful\n\n04:46.880 --> 04:53.520\n Cash App, the number one finance app in the app store. When you get it, use code LEX PODCAST. Cash\n\n04:53.520 --> 04:58.640\n App lets you send money to friends, buy Bitcoin, and invest in the stock market with as little as\n\n04:58.640 --> 05:04.080\n one dollar. Since Cash App allows you to send and receive money digitally, let me mention a surprising\n\n05:04.080 --> 05:10.640\n fact about physical money. It costs 2.4 cents to produce a single penny. In fact, I think it costs\n\n05:10.640 --> 05:16.000\n 85 million dollars annually to produce them. So again, if you get Cash App from the app store\n\n05:16.000 --> 05:22.080\n Google Play and use the code LEX PODCAST, you get 10 dollars and Cash App will also donate 10 dollars\n\n05:22.080 --> 05:27.520\n to First, an organization that is helping to advance robotics and STEM education for young\n\n05:27.520 --> 05:33.440\n people around the world. And now, here's my conversation with Sheldon Solomon.\n\n05:34.720 --> 05:37.520\n What is the role of death and fear of death in life?\n\n05:38.320 --> 05:48.960\n Well, from our perspective, the uniquely human awareness of death and our unwillingness to accept\n\n05:48.960 --> 05:56.160\n that fact, we would argue, is the primary motivational impetus for almost everything\n\n05:56.160 --> 05:59.920\n that people do, whether they're aware of it or not.\n\n05:59.920 --> 06:06.080\n So that's kind of been your life work. Your view of the human condition is that death,\n\n06:06.080 --> 06:09.280\n you've written the book Warm at the Core, that death is at the core of our\n\n06:09.840 --> 06:14.560\n consciousness of everything, of how we see the world, of what drives us. Maybe can you,\n\n06:14.560 --> 06:22.400\n can you elaborate how you see death fitting in? What does it mean to be at the core of our being?\n\n06:22.400 --> 06:29.360\n So I think that's a great question. And, you know, to be pedantic, I usually start,\n\n06:29.360 --> 06:35.760\n you know, my psychology classes and I say to the students, okay, you know, let's define our terms.\n\n06:35.760 --> 06:42.240\n And the ology part, they get right away. You know, it's the study of, and then we get to the psyche\n\n06:42.240 --> 06:49.440\n part. And understandably, you know, the students are like, oh, that means mind. And I'm like,\n\n06:49.440 --> 06:59.360\n well, no, that's a modern interpretation. But in ancient Greek, it means soul, but not in the\n\n06:59.360 --> 07:05.760\n Cartesian dualistic sense that most of us in the West think when that word comes to mind.\n\n07:05.760 --> 07:14.000\n And so you hear the word soul and you're like, well, all right, that's the nonphysical part of\n\n07:14.000 --> 07:21.760\n me that's potentially detachable from my corporal container when I'm no longer here. But Aristotle's\n\n07:22.320 --> 07:31.840\n who coined the word psyche, I think, he was not a dualist. He was a monist. He thought that the soul\n\n07:31.840 --> 07:39.760\n was inextricably connected to the body. And he defined soul as the essence of a natural body\n\n07:40.320 --> 07:50.000\n that is alive. And then he goes on and he says, all right, let me give you an example. If an\n\n07:50.560 --> 07:58.400\n axe was alive, the soul of an axe would be to chop. And if you can pluck your eyeball out of\n\n07:58.400 --> 08:07.040\n your head and it was still functioning, then the soul of the eyeball would be to see, you know,\n\n08:07.040 --> 08:12.640\n and then he's like, all right, the soul of a grasshopper is to hop. The soul of a woodpecker\n\n08:12.640 --> 08:20.080\n is to pack, which raises the question, of course, what is the essence of what it means to be human?\n\n08:20.080 --> 08:29.440\n And here, of course, there is no one universally accepted conception of the essence of our humanity.\n\n08:29.440 --> 08:34.880\n All right, Aristotle, you know, gives us the idea of humans as rational animals. You know, we're\n\n08:34.880 --> 08:42.800\n homo sapiens. But not the only game in town got Joseph Heusinger, an anthropologist in the 20th\n\n08:42.800 --> 08:50.000\n century. He called us homo ludens that were basically fundamentally playful creatures. And\n\n08:50.000 --> 08:57.200\n I think it was Hannah Arendt, homo faber, were tool making creatures. Another woman,\n\n08:57.200 --> 09:03.200\n Ellen Dizanayake, wrote a book called Homo Aestheticus. And following Aristotle and his\n\n09:03.200 --> 09:08.880\n poetics, she's like, well, we're not only rational animals, we're also aesthetic creatures that\n\n09:08.880 --> 09:15.760\n appreciate beauty. There's another take on humans. I think they call us homo narratans.\n\n09:16.480 --> 09:24.320\n We're storytelling creatures. And I think all of those designations of what it means to be human\n\n09:24.880 --> 09:30.720\n are quite useful heuristically and certainly worthy of our collective cogitation. But what\n\n09:30.720 --> 09:39.200\n garnered my attention when I was a young punk was just a single line in an essay by a Scottish guy,\n\n09:39.200 --> 09:47.680\n who was Alexander Smith, in a book called Dreamthwarp. I think it's written in the 1860s.\n\n09:47.680 --> 09:53.360\n He just says right in the middle of an essay, it is our knowledge that we have to die that makes\n\n09:53.360 --> 10:01.920\n us human. And I remember reading that. And in my gut, I was like, oh, man, I don't like that. But\n\n10:01.920 --> 10:08.720\n I think you're onto something. And then William James, the great Harvard philosopher and arguably\n\n10:08.720 --> 10:16.880\n the first academic psychologist, he referred to death as the worm at the core of the human\n\n10:16.880 --> 10:23.120\n condition. So that's where the worm at the core idea comes in. And that's just an allusion to\n\n10:24.000 --> 10:32.240\n the story of Genesis back in the proverbial old days in the Garden of Eden. Everything was going\n\n10:32.240 --> 10:39.200\n tremendously well until the serpent tempts Eve to take a chop out of the apple of the tree of\n\n10:39.200 --> 10:47.680\n knowledge, and Adam partakes also. And this is, according to the Bible, what brings death into\n\n10:47.680 --> 10:58.320\n the world. And from our vantage point, the story of Genesis is a remarkable allegorical recount of\n\n10:58.320 --> 11:05.920\n the origin of consciousness, where we get to the point where, by virtue of our vast intelligence,\n\n11:05.920 --> 11:12.640\n we come to realize the inevitability of death. And so, you know, the apple is beautiful and it's\n\n11:12.640 --> 11:19.280\n tasty. But when you get right into the middle of it, there's that ugly reality, which is our\n\n11:19.280 --> 11:27.040\n finitude. And then fast forward a bit, and I was a young professor at Skidmore College in 1980.\n\n11:28.000 --> 11:34.560\n My PhD is in experimental social psychology, and I mainly did studies for the study of the\n\n11:34.560 --> 11:41.360\n world. I mainly did studies with clinical psychologists evaluating the efficacy of\n\n11:41.360 --> 11:47.200\n nonpharmacological interventions to reduce stress. And that was good work, and I found it\n\n11:47.200 --> 11:54.080\n interesting. But in my first week as a professor at Skidmore, I'm just walking up and down the\n\n11:54.080 --> 12:01.600\n shelves of the library, saw some books by a guy I had never heard of, Ernest Becker, a cultural\n\n12:01.600 --> 12:11.920\n scientist, recently deceased. He died in 1974. After weeks before, actually, he was posthumously\n\n12:12.480 --> 12:16.800\n awarded the Pulitzer Prize in Nonfiction for his book, The Denial of Death.\n\n12:17.680 --> 12:19.760\n And that was his last book?\n\n12:19.760 --> 12:24.640\n It's actually his next to last book. I don't know how you pull this off, but he had one more\n\n12:24.640 --> 12:30.640\n after he died called Escape from Evil. And evidently, it was supposed to... Originally,\n\n12:30.640 --> 12:35.760\n The Denial of Death was supposed to be this giant thousand page book that was both,\n\n12:36.560 --> 12:44.160\n and they split it up, and what became Escape from Evil, his wife, Marie Becker, finished.\n\n12:45.120 --> 12:53.520\n Well, be that as it may, it is in The Denial of Death where Becker just says in the first paragraph,\n\n12:53.520 --> 13:02.880\n I believe that the terror of death and the way that human beings respond to it or decline\n\n13:02.880 --> 13:10.080\n to respond to it is primarily responsible for almost everything we do, whether we're aware of\n\n13:10.080 --> 13:19.120\n it or not, and mostly we're not. And so I read that first paragraph, Lex, and I was like, wow,\n\n13:19.680 --> 13:20.480\n okay, this dude's...\n\n13:20.480 --> 13:21.280\n You're onto something.\n\n13:21.280 --> 13:22.240\n You're onto something.\n\n13:22.240 --> 13:23.120\n It's the same thing here.\n\n13:23.120 --> 13:31.120\n It's the same thing. And then it reminded me, I think, not to play psychologist, but\n\n13:31.920 --> 13:40.080\n let's face it, I believe there's a reason why we end up drifting where we ultimately come to. So\n\n13:40.080 --> 13:47.360\n I'm in my mid 20s. I got Ernest Becker's book in my hand. And the next thing I know, I'm remembering\n\n13:47.360 --> 13:55.760\n that when I'm eight years old, the day that my grandmother died. And the day before, my mom said,\n\n13:55.760 --> 14:04.320\n oh, say goodbye to grandma. She's not well. And so I was like, okay, grandma. And I knew she wasn't\n\n14:04.320 --> 14:10.000\n well, but I didn't really appreciate the magnitude of her illness. Well, she dies the next day.\n\n14:10.800 --> 14:17.200\n And it's in the evening and I'm just sitting there looking at my stamp collection. And I'm\n\n14:17.200 --> 14:22.640\n like, wow, I'm going to miss my grandmother. And then I'm like, no, wait a minute. That means my\n\n14:22.640 --> 14:29.040\n mother's going to die after she gets old. And that's even worse. After all, who's going to make\n\n14:29.040 --> 14:34.800\n me dinner? And that bothered me for a while. But then I'm looking at the stamps, all the dead\n\n14:34.800 --> 14:39.840\n American presidents. And I'm like, there's George Washington. He's dead. There's Thomas Jefferson.\n\n14:39.840 --> 14:48.240\n He's dead. My mom's going to be dead. Oh, I'm going to get old and be dead someday. And at\n\n14:48.240 --> 14:54.240\n eight years old, that was my first explicit existential crisis. I remember it being,\n\n14:54.240 --> 15:03.280\n you know, one of these blood curdling realizations that I tried my best to ignore for the most of the\n\n15:03.280 --> 15:10.160\n time I was subsequently growing up. But fast forward back to Skidmore College, mid twenties,\n\n15:10.160 --> 15:18.160\n you know, reading Becker's book in the 1980s, thinking to myself, wow, one of the reasons\n\n15:18.160 --> 15:23.520\n why I'm finding this so compelling is that it squares with my own personal experience.\n\n15:23.520 --> 15:31.360\n And then to make a short story long, and I'll shut up, Lex, but what grabbed me about Becker,\n\n15:31.360 --> 15:37.680\n and this is in part because I read a lot of his other books, there's another book, The Birth and\n\n15:37.680 --> 15:45.280\n Death of Meaning, which is framed in from an evolutionary perspective. And then The Denial\n\n15:45.280 --> 15:54.480\n of Death is really more framed from an existential psychodynamic vantage point. And as a young\n\n15:54.480 --> 16:06.240\n academic, I was really taken by what I found to be a very potent juxtaposition that you really don't\n\n16:06.240 --> 16:14.720\n see that often. Yet usually evolutionary types are eager to dismiss the psychodynamic types\n\n16:14.720 --> 16:20.160\n and vice versa. And maybe only John Bowlby, you know, there's there's other folks. But\n\n16:20.160 --> 16:27.280\n the attachment theorist, John Bowlby, was really one of the first serious academics to say these\n\n16:27.920 --> 16:33.440\n these ways of thinking about things are quite compatible.\n\n16:33.440 --> 16:39.200\n And can you comment on what's what a psychodynamics view of the world is versus an evolutionary view\n\n16:39.200 --> 16:40.640\n of the world, just in case people are not?\n\n16:40.640 --> 16:45.520\n Oh, yeah, absolutely. That's that's a fine question. Well, for the evolutionary types\n\n16:45.520 --> 16:59.440\n in general are interested in how it is and why it is that we have adapted to our surroundings\n\n16:59.440 --> 17:06.000\n in the service of persisting over time and being represented in the gene pool thereafter.\n\n17:06.640 --> 17:13.280\n You used to be a fish. Yeah, we used to be a fish. And I'll end up talking on a podcast.\n\n17:13.280 --> 17:16.160\n Yeah. How we came to be that way.\n\n17:16.160 --> 17:22.560\n How we came to be that way. And so whereas the existential psychodynamic types, I would say,\n\n17:22.560 --> 17:30.960\n are more interested in development across a single lifespan. And but but the evolutionary\n\n17:30.960 --> 17:38.400\n types dismiss the psychodynamic types as overly speculative and devoid of empirical support for\n\n17:38.400 --> 17:44.880\n their views. They, you know, they'll just say these guys are talking shit, if you'll pardon\n\n17:44.880 --> 17:51.680\n the expression. And of course, you can turn right around and say the same about the evolutionary\n\n17:51.680 --> 17:58.480\n types that they are often and rightfully criticized evolutionary psychologists for what are called the\n\n17:58.480 --> 18:07.760\n just so stories that where it's like, oh, this is probably why fill in the blank is potentially\n\n18:07.760 --> 18:20.000\n adaptive. And my thought again early on was I didn't see any intrinsic antithesis between\n\n18:20.000 --> 18:27.200\n these viewpoints. I just found them dialectically compatible and very powerful when combined.\n\n18:27.200 --> 18:33.680\n So one question I would ask here is about a science being speculative. You know,\n\n18:33.680 --> 18:38.800\n we understand a little about the human mind. You said you picked up Becker's book and, you know,\n\n18:38.800 --> 18:44.480\n it felt like it was onto something. That's the same thing I felt when I picked up Becker's book,\n\n18:45.120 --> 18:50.960\n probably also in my early 20s. You know, I read a lot of philosophy, but it felt like the question\n\n18:50.960 --> 18:58.480\n of the meaning of life kind of, you know, this seemed to be the most the closest to the truth\n\n18:58.480 --> 19:06.240\n somehow. It was onto something. So I guess the question I want to ask also is like how speculative\n\n19:06.240 --> 19:14.960\n is psychology? How like all of your life's work? How do you feel? How confident do you feel about\n\n19:14.960 --> 19:25.680\n the whole thing? About understanding our mind? I feel confidently unconfident to have both ways.\n\n19:25.680 --> 19:30.000\n Like what do we make of psychology? What do we make starting with Freud, you know,\n\n19:30.000 --> 19:40.640\n starting just our, or even just philosophy, even the aspects of the sciences, like, you know,\n\n19:40.640 --> 19:47.200\n my field of artificial intelligence, but also physics, you know, it often feels like, man,\n\n19:47.200 --> 19:53.520\n we don't really understand most of what's going on here. And certainly that's true with the human\n\n19:53.520 --> 19:58.640\n mind. Yeah. Well, to me, that's the proper epistemological stance. I don't know anything.\n\n19:59.200 --> 20:08.400\n Well, it's the Socratic I know that I don't know, which is the first step on the path to wisdom.\n\n20:08.400 --> 20:20.240\n I would argue forcefully that we know a lot more than we used to. I would argue equally forcefully,\n\n20:20.240 --> 20:26.400\n but not that I have a PhD in the philosophy of science, but I believe that the Thomas\n\n20:26.400 --> 20:33.920\n Kuhns of the world are right when they point out that change is not necessarily progress.\n\n20:34.960 --> 20:42.320\n And so on the one hand, I do think we know a lot more than we did back in the day when if you\n\n20:42.320 --> 20:49.120\n wanted to fly, you put on some wax wings and jumped off a mountain. On the other hand, I think\n\n20:49.120 --> 20:59.280\n it's quite arrogant when scientists, I'll just speak about psychological scientists, when they\n\n20:59.280 --> 21:11.200\n have the audacity to mistake statistical precision for knowledge and insight. And when they make the\n\n21:11.200 --> 21:19.280\n mistake, in my estimation, that Einstein bemoaned, and that's this idea that the mere accumulation\n\n21:19.840 --> 21:29.520\n of data will necessarily result in conceptual breakthroughs. And so I like the, well, we're all,\n\n21:29.520 --> 21:35.200\n I hope, appreciative of the people who trained us. But I remember my first day in graduate school at\n\n21:35.200 --> 21:40.560\n the University of Kansas, they brought us into a room and on one side of the board was a quote by\n\n21:40.560 --> 21:48.080\n Kurt Lewin or Levine, famous German social psychologist. And the quote is,\n\n21:48.080 --> 21:53.280\n there's nothing more useful than a good theory. And then on the other side was another quote by\n\n21:53.280 --> 21:59.200\n a German physicist, his name eludes me, and it was all theories are wrong. And I'm like,\n\n22:00.640 --> 22:09.760\n which is it? And of course, the point is that it's both. Our theories are, I believe,\n\n22:09.760 --> 22:21.440\n powerful ways to direct our attention to aspects of human affairs that might render us better able\n\n22:21.440 --> 22:29.440\n to understand ourselves in the world around us. Now, I also, as an experimental psychologist,\n\n22:30.000 --> 22:38.000\n I adhere to the view that theories are essentially hypothesis generating devices.\n\n22:38.000 --> 22:44.080\n And that at its best, science is a dialectical interplay where you have theoretical assertions\n\n22:44.080 --> 22:52.160\n that yield testable hypotheses and that either results in the corroboration of the theory,\n\n22:52.160 --> 22:59.680\n the rejection of it or the modification thereafter. If we look at the existentialists\n\n23:01.280 --> 23:07.200\n or even like modern philosopher, psychologist types like Jordan Peterson, I'm not sure if\n\n23:07.200 --> 23:14.000\n you're familiar with Jordan pretty well. We go way back. Actually, if he were here with us today,\n\n23:14.000 --> 23:22.080\n we would he would be jumping in and I believe very interesting and important ways. But yeah,\n\n23:22.080 --> 23:30.480\n we go back 30 years ago. He was basically saying our work is nonsense. Let's get into this. I'll\n\n23:30.480 --> 23:35.600\n talk to Jordan eventually on this thing. Yeah, there's some rough times right now. Oh, absolutely.\n\n23:35.600 --> 23:44.160\n And I and I wish him well. Jordan was working on his maps of meaning and we were publishing our\n\n23:44.160 --> 23:56.080\n work. And I think Jordan at the time was concerned about our vague claims to the effect that all\n\n23:56.080 --> 24:05.120\n meaning is arbitrary. He takes a more Jungian as well as evolutionary view that I don't think is\n\n24:05.120 --> 24:16.320\n wrong, by the way, which is that there are certain kinds of meanings that are more important,\n\n24:16.320 --> 24:25.840\n let's say religious types, and that we didn't pay sufficient attention to that in our early days.\n\n24:25.840 --> 24:31.600\n So can you try to elucidate like what his worldview is? Because he's also a religious man.\n\n24:31.600 --> 24:37.680\n And so what what was this? What was some of the interesting aspects of the disagreements\n\n24:37.680 --> 24:42.480\n that then? Yeah, well, back in the day, I just said, you know, Jordan was a young punk. We were\n\n24:42.480 --> 24:47.920\n young punks. He was just kind of flailing in an animated way at some conferences saying that\n\n24:49.200 --> 24:53.840\n we you're still both kind of punks. Yeah, we are kind of punk. So I saw him three or four years\n\n24:53.840 --> 25:00.160\n ago. We spoke on a it was an awesome day. We're in Canada at the Ontario Shakespeare Festival,\n\n25:00.160 --> 25:06.800\n where we were asked to be on a Canadian broadcast system program. I think we were talking about\n\n25:06.800 --> 25:14.880\n Macbeth from a psychodynamic perspective. And I hadn't seen him in a ton of years. And we spent\n\n25:14.880 --> 25:20.880\n two days together, had a great time. You know, we had just written our book, The Worm at the Core.\n\n25:20.880 --> 25:26.720\n And he's like, you know, you're you're missing a big opportunity. Every time you say something,\n\n25:26.720 --> 25:32.720\n you have to have your phone and you have to film yourself and then you have to put it on YouTube.\n\n25:32.720 --> 25:40.000\n Yeah, he was onto something that, you know, that just as a small tangent. Yeah. It's it's almost\n\n25:40.000 --> 25:44.960\n sad to look at Jordan Peterson and somebody like yourself. After having done this podcast,\n\n25:44.960 --> 25:51.520\n I've realized that there is really brilliant people in this world. And oftentimes, especially\n\n25:51.520 --> 25:58.320\n like when they're, I mean, it would love are a little bit like punks. That's right. They kind\n\n25:58.320 --> 26:03.840\n of do their own thing and make the world doesn't know they exist as much as they should. And it's\n\n26:03.840 --> 26:11.360\n so interesting because most people are kind of boring. Yes. And then the interesting ones kind\n\n26:11.360 --> 26:16.240\n of go on their own. And there's not a smartphone. No, that's that's so interesting. He was onto\n\n26:16.240 --> 26:22.240\n something that I mean, it's interesting that I don't think he was thinking from a money perspective,\n\n26:22.880 --> 26:27.040\n but he was probably thinking of like connecting with people or sharing his knowledge.\n\n26:27.600 --> 26:33.760\n But people don't often think that way. That's right. So maybe we can try to get back to you're\n\n26:33.760 --> 26:39.840\n both brilliant people. And I'd love to get some interesting disagreements earlier and later about\n\n26:39.840 --> 26:46.960\n in your psychological work and your world views. Well, our disagreements today would be\n\n26:50.000 --> 26:59.520\n along two dimensions. One is he is and again, I wish he was here to correct me. Yes. When I say\n\n26:59.520 --> 27:09.680\n that he is more committed to the virtues of the Judeo Christian tradition, I see particularly\n\n27:09.680 --> 27:17.840\n Christianity and in a sense is a contemporary Kierkegaard of sorts when he's saying there's only\n\n27:17.840 --> 27:26.320\n one way to leap into faith. And I would take ardent issue with that claim on the grounds that\n\n27:26.320 --> 27:37.600\n that is one, but by no means not the only way to find meaning and value in life. And so and I see\n\n27:37.600 --> 27:43.840\n his. What's his warm at the core? What is like? So we're talking about a little bit of a higher\n\n27:43.840 --> 27:49.840\n level of discovering meaning. Yeah. What's his? What does he make of death? Oh, I don't know.\n\n27:49.840 --> 27:59.280\n And this is where it would be nice to have him here. He has, you know, from a distance criticized\n\n27:59.280 --> 28:06.240\n our work as misguided. Having said that, though, when we were together, he said something along\n\n28:06.240 --> 28:15.280\n the lines that there is no theoretical body of work in academic psychology right now for which\n\n28:15.280 --> 28:22.160\n there is more empirical evidence. And so I appreciated that. He's a great researcher. He's\n\n28:22.160 --> 28:30.240\n a good clinician. The other thing that we will agree to disagree about rather vociferously is\n\n28:30.240 --> 28:39.040\n his ultimately political slash economic. So I remember being at dinner with him,\n\n28:39.040 --> 28:44.480\n telling him that the next book that I wanted to write was going to be called Why Left and Right\n\n28:44.480 --> 28:50.960\n are Both Beside the Point. And my argument was going to be and it is going to be that both\n\n28:50.960 --> 28:59.040\n liberal and political liberal and conservative political philosophy are each intellectually and\n\n28:59.040 --> 29:05.040\n morally bankrupt because they're both framed in terms of assumptions about human nature that are\n\n29:05.040 --> 29:14.000\n demonstrably false. And Jordan didn't mind me knocking liberal political philosophy on those\n\n29:14.000 --> 29:21.120\n grounds. That would basically be like Steven Pinker's blank slate. But he took issue when\n\n29:21.120 --> 29:29.200\n I pointed out that actually it's conservative political philosophy, which starts with John\n\n29:29.200 --> 29:35.200\n Locke's assumption that in a state of nature, there are no societies, just autonomous individuals\n\n29:36.080 --> 29:45.760\n who are striving for survival. That's one of the most obviously patently wrong assertions in the\n\n29:45.760 --> 29:55.040\n history of intellectual thought. And Locke uses that to justify his claims about the individual\n\n29:55.040 --> 30:03.280\n right to acquire unlimited amounts of property, which is ultimately the justification for\n\n30:03.280 --> 30:11.680\n neoliberal economics. Can you linger on that a little bit? Can you describe his philosophy\n\n30:11.680 --> 30:19.120\n again as view of the world and what neoliberal economics is? Yeah, let me translate it in\n\n30:19.120 --> 30:29.040\n English. So basically on all these days, anybody who says I'm a conservative free market type,\n\n30:30.400 --> 30:35.520\n you're following John Locke and Adam Smith, whether you're aware of it or not. So here's\n\n30:35.520 --> 30:42.000\n John Locke, who, by the way, all of these guys are great. So for me to appear to criticize any\n\n30:42.000 --> 30:48.480\n of these folks, it is with the highest regard. And also, we need to understand in my estimation\n\n30:49.280 --> 30:57.520\n how important their ideas are. Locke is working in a time where all rule was top down by divine\n\n30:57.520 --> 31:05.680\n right. And he's trying desperately to come up with a philosophical justification to shift power\n\n31:06.320 --> 31:14.880\n and autonomy to individuals. And he starts in his second treatise on government, 1690 or so,\n\n31:16.240 --> 31:22.320\n he says, okay, let's start with a state of nature. And he's like, in a state of nature,\n\n31:22.320 --> 31:29.760\n there's no societies, there's just individuals. And in a perfect universe,\n\n31:29.760 --> 31:37.920\n there wouldn't be any societies, there would just be individuals who by the law of nature have a\n\n31:37.920 --> 31:48.800\n right to survive. And in the service of survival, they have the right to acquire and preserve the\n\n31:48.800 --> 31:56.080\n fruits of their own labor. But his point is, and it's actually a good one, he's following Hobbes\n\n31:56.080 --> 32:02.480\n here. He's like, well, the problem with that is that people are assholes. And if they would\n\n32:02.480 --> 32:08.000\n let each other alone, then we would still be living in a state of nature, everybody just\n\n32:08.000 --> 32:16.400\n doing what they did to get by each day. But it's a whole lot easier if I see like an apple tree\n\n32:16.400 --> 32:23.280\n a mile away. Well, I can go over and pick an apple. But if you're 10 meters away with an apple\n\n32:23.280 --> 32:28.720\n in your hand, it's a lot easier if I pick up a rock and crack your head and take the apple.\n\n32:29.360 --> 32:38.880\n And his point was that the problem is that people can't be counted on to behave. They will take each\n\n32:38.880 --> 32:51.120\n other's property. Moreover, he argued, if someone takes your property, you have the right to retribution\n\n32:52.000 --> 32:57.120\n in proportion to the degree of the magnitude of the transgression. English translation,\n\n32:57.920 --> 33:04.480\n if I take your apple, you have the right to take an apple back. You don't have the right to kill\n\n33:04.480 --> 33:13.440\n my firstborn. But people being people, they're apt to escalate retaliatory behavior, thus creating\n\n33:13.440 --> 33:20.080\n what Locke called a state of war. So he said, in order to avoid a state of war, people reluctantly\n\n33:20.080 --> 33:28.480\n give up their freedom in exchange for security. They agree to obey the law and that the sole\n\n33:28.480 --> 33:34.400\n function of government is to keep domestic tranquility and to ward off foreign invasion in\n\n33:34.400 --> 33:41.600\n order to protect our right to property. All right. So now here's the property thing. All right. So\n\n33:42.960 --> 33:48.480\n Locke says, if you look in the Bible and in nature, there is no private property.\n\n33:48.480 --> 33:58.480\n But Locke says, well, surely if there's anything that you own, it's your body. And surely you have\n\n33:58.480 --> 34:07.680\n a right by nature to stay alive. And then by extension, anything that you do where you exert\n\n34:07.680 --> 34:14.560\n effort or labor, that becomes your private property. So back to the apple tree. If I walk\n\n34:14.560 --> 34:21.840\n over to an apple tree, that's everybody's apples until I pick one. And the minute I do,\n\n34:21.840 --> 34:30.160\n that is my apple. And then he says, you can have as many apples as you want, as long as you don't\n\n34:30.160 --> 34:39.600\n waste them. And as long as you don't impinge on somebody else's right to get apples. So far,\n\n34:39.600 --> 34:54.320\n so good. Yep. And then he says, well, okay. In the early days, you could only eat so many apples\n\n34:55.520 --> 35:01.920\n or you could only trade so many apples with somebody else. So he was like, well, if you put\n\n35:01.920 --> 35:07.600\n a fence around a bunch of apple trees, those become your apples. That's your property.\n\n35:07.600 --> 35:13.920\n Those become your apples. That's your property. If somebody else wants to put a fence around\n\n35:13.920 --> 35:22.960\n Nebraska, that's their property. And everybody can have as much property as they want because\n\n35:22.960 --> 35:33.680\n the world is so big that there is no limit to what you can have if you pursue it by virtue of\n\n35:33.680 --> 35:41.040\n your own effort. But then he says money came into the picture. And this is important because he\n\n35:41.040 --> 35:48.240\n noticed long before anybody, before the Freud's of the world, that money is funky because it has no\n\n35:48.240 --> 35:55.440\n intrinsic value. He's like, ooh, look at that shiny piece of metal that actually has, if you're\n\n35:55.440 --> 36:00.960\n hungry and you have a choice between a carrot and a lump of gold in the desert, most people are\n\n36:00.960 --> 36:10.560\n going to go for the carrot. But his point is that the allure of money is that it's basically a\n\n36:10.560 --> 36:18.000\n concentrated symbol of wealth, but because it doesn't spoil, Locke said, you're entitled to\n\n36:18.000 --> 36:29.520\n have as much money as you're able to garner. Then he says, well, the reality is that some people\n\n36:29.520 --> 36:36.160\n are more, the word that he used was industrious. He said some people more industrious than others.\n\n36:36.640 --> 36:43.440\n All right, today we would say smarter, less lazy, more ambitious. He just said that's natural. It's\n\n36:43.440 --> 36:52.640\n also true. Therefore, he argued, over time, some people are going to have a whole lot of property\n\n36:52.640 --> 37:03.760\n and other people not much at all. Inequality for Locke is natural and beneficial for everyone.\n\n37:04.400 --> 37:12.960\n His argument was that the rising tide lifts all boats and that the truly creative and innovative\n\n37:13.760 --> 37:19.920\n are entitled to relatively unlimited worth because we're all better off as a result.\n\n37:19.920 --> 37:29.520\n So the point very simply is that, and then you have Adam Smith in the next century with the\n\n37:29.520 --> 37:36.320\n invisible hand where Adam Smith says, everyone pursuing their own selfish, that's not necessarily\n\n37:36.320 --> 37:44.720\n pejorative, if everyone pursues their own selfish interests, we will all be better off as a result.\n\n37:44.720 --> 37:47.040\n And what do you think is the flaw in that way of thinking?\n\n37:47.040 --> 37:57.920\n Well, there's two flaws. One flaw is, first of all, that it is based on an erroneous assumption\n\n37:57.920 --> 38:03.120\n to begin with, which is that there never was a time in human history when we were an asocial\n\n38:03.920 --> 38:05.040\n species.\n\n38:05.040 --> 38:12.160\n In a sense, you don't feel like there's this emphasis of individual autonomy is a flawed\n\n38:12.160 --> 38:18.400\n promise. There's something fundamentally deeply interconnected between us.\n\n38:18.400 --> 38:27.440\n I do. I think that Plato and Socrates in the Crito were closer to the truth when they started\n\n38:27.440 --> 38:33.680\n with the assumption that we were interdependent, then they derived individual autonomy as a\n\n38:33.680 --> 38:37.200\n manifestation of a functional social system.\n\n38:37.200 --> 38:38.000\n That's fascinating.\n\n38:38.000 --> 38:44.480\n So when Margaret Thatcher, you're too young, in the 1980s, she said, societies? There's\n\n38:44.480 --> 38:51.040\n no such thing as societies. There's just individuals pursuing their self interest.\n\n38:53.120 --> 38:57.360\n So that's one point where I would take issue respectfully with John Locke.\n\n38:57.360 --> 39:06.400\n Point number two is when Locke says in 1690, well, England's filled up, so if you want\n\n39:06.400 --> 39:11.840\n some land, just go to America, it's empty. Or maybe there's a few savages there, just\n\n39:11.840 --> 39:12.480\n kill them.\n\n39:13.120 --> 39:20.400\n So Melville does the same thing in Moby Dick where he thinks about, will there ever come\n\n39:20.400 --> 39:26.720\n a time where we run out of whales? And he says, no, but we have run out of whales.\n\n39:26.720 --> 39:36.000\n And so Locke was right maybe in 1690 that the world was large and had infinite resources.\n\n39:36.640 --> 39:47.360\n He's certainly wrong today, in my opinion. Also wrong is the claim that the unlimited\n\n39:47.360 --> 39:54.320\n pursuit of personal wealth does not harm those around us. There is no doubt that radical\n\n39:54.320 --> 40:02.480\n inequality is tragic psychologically and physically. Poverty is not that terrible.\n\n40:02.480 --> 40:07.360\n It's easy for me to say because I have a place to stay and something to eat. But as\n\n40:07.360 --> 40:15.680\n long as you're not starving and have a place to be, poverty is not as challenging as having\n\n40:15.680 --> 40:20.800\n the impoverished in close proximity to those who are obscenely wealthy.\n\n40:20.800 --> 40:24.800\n LW So it's not the absolute measure of your\n\n40:24.800 --> 40:29.120\n well being, it's the inequality of that well being is the penalty painful.\n\n40:29.120 --> 40:37.040\n So maybe just to linger on the Jordan Peterson thing, in terms of your disagreement in his\n\n40:37.040 --> 40:45.840\n world view. So he went through quite a bit, there's been quite a bit of fire in his defense\n\n40:45.840 --> 40:52.240\n or maybe his opposition of the idea of equality of outcomes. So looking at the inequality\n\n40:52.240 --> 40:59.440\n that's in our world, looking at, you know, certain groups, measurably having an outcome\n\n40:59.440 --> 41:04.400\n that's different than other groups, and then drawing conclusions about fundamental\n\n41:06.080 --> 41:13.360\n unfairness, injustice, inequality in the system. So like systematic racism, systematic sexism,\n\n41:13.360 --> 41:20.320\n systematic anything else that creates inequality. And he's been kind of saying pretty simple\n\n41:20.320 --> 41:28.240\n things to say that, you know, the system for the most part is not broken or flawed,\n\n41:28.880 --> 41:34.880\n that the inequalities part, the inequality of outcomes is part of our world. What we\n\n41:34.880 --> 41:39.120\n should strive for is the, you know, equality of opportunity.\n\n41:39.120 --> 41:47.040\n Yeah, and I do not dispute that as an abstraction. But again, to back up for a second, I do take\n\n41:47.040 --> 41:55.920\n issue with Jordan's fervent devotion to the free market and his cavalier dismissal of\n\n41:55.920 --> 42:06.400\n Marxist ideas, which he has, in my estimation, mischaracterized in his public depictions.\n\n42:06.400 --> 42:12.960\n Let's get into it. So he just seems to really not like socialism, Marxism, communism.\n\n42:13.680 --> 42:19.440\n Historically speaking, sort of, I mean, how would I characterize it? I'm not exactly sure.\n\n42:19.440 --> 42:24.000\n I don't want to, again, he'll eventually be here to defend himself. John Locke, unfortunately,\n\n42:24.000 --> 42:34.960\n not here to defend himself. But what's your sense about Marxism and the way Jordan talks\n\n42:34.960 --> 42:39.280\n about it, the way you think about it, from the economics, from the philosophical perspective?\n\n42:39.280 --> 42:45.600\n Yeah, well, if we were all here together, I'd say we need to start with Marx's economic and\n\n42:45.600 --> 42:54.560\n philosophical manuscripts of 1844, before Marx became more of a polemicist. And I would argue\n\n42:54.560 --> 43:02.560\n that Marx's political philosophy, he's a crappy economist, I don't dispute that. But his arguments\n\n43:02.560 --> 43:10.160\n about human nature, his arguments about the inevitably catastrophic psychological\n\n43:10.160 --> 43:17.120\n and environmental and economic effects of capitalism, I would argue every one of those\n\n43:17.120 --> 43:28.400\n has proven quite right. Marx maybe did not have the answer, but he saw in the 18, whenever he\n\n43:28.400 --> 43:40.560\n was writing, that inevitably, capitalism would lead to massive inequity, that it was ultimately\n\n43:41.280 --> 43:49.040\n based on the need to denigrate and dehumanize labor, to render them, in his language, a fleshy\n\n43:49.040 --> 43:59.360\n cog in a giant machine. And it would create a tension and conflict between those who own things\n\n43:59.360 --> 44:07.760\n and those who made things, that over time would always, the Thomas Pickardy guy who writes about\n\n44:07.760 --> 44:17.360\n capital, and just makes the point that return on investment will always be greater than wages. That\n\n44:17.360 --> 44:23.200\n means the people with money are gonna have a lot more. That means there's gonna come a point where\n\n44:23.200 --> 44:29.280\n the economic house of cards falls apart. Now, the Joseph Schumpeters of the world, they're like,\n\n44:29.280 --> 44:35.200\n that's creative destruction, bring it, that's great. So I think it's Niles Ferguson, he's a\n\n44:35.200 --> 44:40.400\n historian, he may be at Stanford now, he was at Harvard. He writes about the history of money,\n\n44:40.400 --> 44:48.320\n and he's like, yeah, there's been 20 or whatever depressions and big recessions in the last several\n\n44:48.320 --> 44:56.560\n hundred years. And when that happens, half of the population or whatever is catastrophically\n\n44:56.560 --> 45:05.920\n inconvenienced. But that's the price that we pay for progress. Other people would argue, and I\n\n45:05.920 --> 45:16.720\n would agree with them that I will happily sacrifice the rate of progress in order to flatten\n\n45:16.720 --> 45:28.560\n the curve of economic destruction. To put that in plainer English, I would direct our attention\n\n45:28.560 --> 45:35.760\n to the social democracies that forgetting for the moment of whether it's possible to do this on a\n\n45:35.760 --> 45:44.800\n scale in a country as big as ours, on all of the things that really matter, gross, domestic GDP\n\n45:44.800 --> 45:50.960\n or whatever, that's just an abstraction. But when you look at whatever the United Nations says,\n\n45:50.960 --> 46:00.720\n how we measure quality of life, life expectancy, education, rates of alcoholism, suicide, and so on,\n\n46:00.720 --> 46:06.720\n the countries that do better are the mixed economies. They're market economies\n\n46:07.520 --> 46:16.560\n that have high tax rates in exchange for the provision of services that come as a right\n\n46:16.560 --> 46:22.800\n for citizens. Yeah, so I mean, I guess the question is, you've kind of mentioned that, you know,\n\n46:24.000 --> 46:30.400\n as Marx described, capitalism with a slippery slope, eventually things go awry in some kind\n\n46:30.400 --> 46:35.760\n of way. So that's the question is, when you have, when you implement a system, how does it go wrong\n\n46:35.760 --> 46:43.360\n eventually? You know, eventually we'll all be dead. That's exactly right. No, that's right.\n\n46:43.360 --> 46:50.320\n So, and then the criticism, I mean, I think these days, unfortunately, Marxism is a dirty word.\n\n46:50.320 --> 46:58.240\n I say unfortunately, because even if you disagree with a philosophy, you should, like calling\n\n46:58.240 --> 47:05.520\n somebody a Marxist should not be a thing that shuts down all conversation. No, that's right.\n\n47:05.520 --> 47:13.840\n And the fact is, I'm sympathetic with Jordan's dismissal of the folks, the talking heads these\n\n47:13.840 --> 47:22.320\n days who spew Marxist words. To me, it's like fashionable nonsense. Do you know that book that\n\n47:22.320 --> 47:28.640\n the physicists wrote mocking? You're too young. So in the 20 or so years, we're all pretty young.\n\n47:28.640 --> 47:33.760\n Well, yeah, that's right. But I think there were these NYU physicists, they wrote a paper just\n\n47:33.760 --> 47:41.600\n mocking the kind of literary postmodern types. And it was, oh, those kinds of, yeah, it was just\n\n47:41.600 --> 47:48.160\n nonsense. And of course it was made the lead article. And you know, my point is Marx wouldn't\n\n47:48.160 --> 47:56.480\n be a Marxist. True. I have read and listened to some of the work of Richard Wolff. He speaks\n\n47:56.480 --> 48:03.760\n pretty eloquently about Marxism. I like him. He's one of the only, you know, one of the only people\n\n48:03.760 --> 48:10.480\n speaking about a lot about Marxism and the way we are now in a serious way, in a sort of saying,\n\n48:10.480 --> 48:16.800\n you know, what are the flaws of capitalism? Not saying like, yeah, basically sounding very\n\n48:16.800 --> 48:21.840\n different. People should check out his work. Because all this kind of work, this kind of\n\n48:21.840 --> 48:30.720\n outrage mob culture of sort of demanding equality of outcome, that's not Marxism.\n\n48:30.720 --> 48:37.120\n It is not Marxism. He didn't say that. You know, he literally said each, what was it like,\n\n48:37.120 --> 48:42.240\n each according to their needs and each according to their abilities or something like that.\n\n48:42.240 --> 48:47.600\n So the question is the implementation, like, humans are messy. So how does it go wrong?\n\n48:47.600 --> 48:54.320\n Like, it is, there you go, Lex. Brilliant. It's messy. And this gets back to my rant about\n\n48:54.880 --> 49:00.560\n the book that I want to try if I don't stroke out, why left and right are both beside the point.\n\n49:01.120 --> 49:11.120\n You know, the people, the conservatives are right when they condemn liberals for being simple minded.\n\n49:11.120 --> 49:19.840\n By assuming that a modification of external conditions will yield changes in human nature.\n\n49:20.560 --> 49:27.360\n You know, again, that's where Marx and Skinner are odd bedfellows. You know, here they are just\n\n49:27.360 --> 49:34.480\n saying, oh, let's change the surroundings and things will inevitably get better. On the other\n\n49:34.480 --> 49:45.280\n hand, when conservatives say that people are innately selfish and they use that as the\n\n49:45.280 --> 49:53.040\n justification for glorifying the unbridled pursuit of wealth, well, they're only half right because\n\n49:53.040 --> 50:02.560\n it turns out that we can be innately selfish, but we are also innately generous and reciprocating\n\n50:02.560 --> 50:08.880\n creatures. There's remarkable studies, I think they've been done at Yale, of, you know, babies,\n\n50:08.880 --> 50:18.240\n 14 month old babies. If someone hands them a toy and then wants something in return,\n\n50:19.040 --> 50:23.600\n babies before they can walk and talk will reciprocate. All right, fine.\n\n50:23.600 --> 50:30.000\n If someone, if they want a toy, let's say, or a bottle of water, baby wants a bottle of water,\n\n50:30.800 --> 50:39.200\n and I look like I'm trying to give it to the baby, but I drop the bottle so the baby doesn't get\n\n50:39.200 --> 50:47.440\n what she or he wanted. When given a chance to reciprocate, little babies will reciprocate\n\n50:47.440 --> 50:54.480\n because they're aware of and are responding to intention. Similarly, if they see somebody\n\n50:55.360 --> 51:04.400\n behaving unfairly to someone, they will not help that person in return. So my point is,\n\n51:04.400 --> 51:14.560\n yeah, we are selfish creatures at times, but we are also simultaneously ubersocial creatures\n\n51:14.560 --> 51:21.840\n who are eager to reciprocate, and in fact, we're congenitally prepared to be reciprocators to the\n\n51:21.840 --> 51:28.960\n point where we will reciprocate on the basis of intentions above and beyond what actually happens.\n\n51:28.960 --> 51:37.680\n How close, so, I mean, your work is on the fundamental role of the fear of mortality in\n\n51:37.680 --> 51:44.400\n ourselves. How fundamental is this reciprocation, this human connection to other humans?\n\n51:44.400 --> 51:50.800\n Oh, I think it's really innate. Yeah, I think it's because, yeah, bats reciprocate, not by intention,\n\n51:50.800 --> 51:58.560\n but, you know, this, I'm going here from Richard Dawkins, The Selfish Gene, you know, to, I love\n\n51:58.560 --> 52:02.880\n the early Dawkins, I'm less enamored. I like the early Beatles.\n\n52:02.880 --> 52:13.520\n Yeah, no, no, no. And again, I say this with great respect, but, you know, Dawkins just points out\n\n52:13.520 --> 52:22.880\n that, you know, reciprocation is just fundamental, cooperation is fundamental. You know, it's a\n\n52:22.880 --> 52:30.560\n one sided view of evolutionary takes on things when we see it solely in terms of individual\n\n52:30.560 --> 52:36.560\n competition. It's almost, from a game theoretic perspective too, it's just easier to see the world\n\n52:36.560 --> 52:43.600\n that way. It's easier to, I don't know, I mean, you see this in physics, there's a whole field of\n\n52:43.600 --> 52:50.320\n folks, like complexity, that kind of embrace the fact that it's all an intricately connected mess,\n\n52:50.320 --> 52:56.000\n and it's just very difficult to do anything with that kind of science. But it seems to be much\n\n52:56.000 --> 52:58.800\n closer to actually representing what the world is like.\n\n52:58.800 --> 53:02.480\n So like you put it earlier, Lex, it's messy.\n\n53:02.480 --> 53:07.120\n So left and right, you mentioned, you're thinking of maybe actually putting it down on paper\n\n53:07.120 --> 53:07.440\n or something?\n\n53:07.440 --> 53:14.320\n Yeah, I would like to, because what I would like to point out, again, in admiration of all the\n\n53:14.320 --> 53:19.680\n people that I will then try and have the gall to criticize is, look, these are all geniuses.\n\n53:19.680 --> 53:28.800\n Locke, genius. Adam Smith, genius, when he uses the notion that we're bartering creatures. So he uses\n\n53:28.800 --> 53:33.760\n that reciprocation idea as the basis of his way of thinking about things.\n\n53:33.760 --> 53:37.200\n But that's not at the core. The bartering is not at the core of human nature.\n\n53:37.200 --> 53:42.240\n It's not at, well, he says it is. He says we're fundamentally bartering creatures.\n\n53:42.240 --> 53:48.320\n Well, that doesn't even make sense then, because then how can we then be autonomous individuals\n\n53:48.320 --> 53:50.080\n autonomous individuals?\n\n53:50.080 --> 53:52.320\n Well, because we're going to barter with an eye on\n\n53:53.440 --> 53:55.600\n for ourselves, self interest.\n\n53:55.600 --> 54:00.480\n Yeah. But all right. So, but back to Adam Smith for a second, Lex. He's like,\n\n54:00.480 --> 54:05.360\n Adam Smith, here's, he's got the invisible hand and my conservative friends. I'm like,\n\n54:05.360 --> 54:15.360\n you need to read his books because he is a big fan of the free market. And this is my other gripe\n\n54:15.360 --> 54:23.600\n with folks who support just unbridled markets. Adam Smith understood that there was a role\n\n54:23.600 --> 54:30.400\n for government for two reasons. One is, is that just like Locke, people are not going to behave\n\n54:30.400 --> 54:38.320\n with integrity. And he understood that one role of government is to maintain a proverbial,\n\n54:38.320 --> 54:44.960\n you know, even playing field. And then the other thing Smith said was that there's some things that\n\n54:44.960 --> 54:51.600\n can't be done well for a profit. And I believe he talked about education and public health and\n\n54:51.600 --> 55:01.520\n infrastructure as things that are best done by governments because you can't, you can make a\n\n55:01.520 --> 55:06.720\n profit, but that doesn't mean that the institutions themselves will be maximally beneficial.\n\n55:06.720 --> 55:16.800\n Yeah. So I would, I'm just eager to engage people by saying, let's start with our most\n\n55:16.800 --> 55:27.200\n contemporary understanding of human nature, which is that we are both selfish and tend\n\n55:27.200 --> 55:42.400\n to cooperate. And we also can be heroically helpful to folks in our own tribe. And of course,\n\n55:42.400 --> 55:49.520\n how you define one's tribe becomes critically important. But what some people say is, look,\n\n55:49.520 --> 55:58.080\n look, what would then be, what kind of political institutions and what kind of economic organization\n\n55:59.600 --> 56:06.160\n can we think about to kind of hit that sweet spot? And that would be, in my opinion,\n\n56:07.200 --> 56:16.640\n how do we maximize individual autonomy in a way that fosters creativity and innovation and the\n\n56:16.640 --> 56:26.480\n self regard that comes from creative expression while engaging our more cooperative and reciprocal\n\n56:27.120 --> 56:35.280\n tendencies in order to come up with a system that is potentially stable over time? Because\n\n56:35.280 --> 56:41.280\n the other thing about all capital based systems is the stability. It's fundamentally unstable.\n\n56:41.280 --> 56:47.200\n Yeah, because it's based on infinite growth. And it's a positive feedback loop. To be silly,\n\n56:47.200 --> 56:53.040\n infinite growth is only good for malignant cancer cells and compound interest. But otherwise,\n\n56:54.640 --> 57:03.040\n we want to seek a steady state. So when Steven Pinker writes, for example, again,\n\n57:03.040 --> 57:08.800\n great scholar, but I'm going to disagree when he says the world has never been better,\n\n57:08.800 --> 57:14.000\n and all we need to do is keep making stuff and buying stuff.\n\n57:14.000 --> 57:21.280\n So your sense is the world sort of in disagreement with Steven Pinker, that the world is\n\n57:23.120 --> 57:27.760\n like facing a potential catastrophic collapse in multiple directions.\n\n57:27.760 --> 57:28.400\n Yes.\n\n57:28.400 --> 57:33.760\n And the fact that there are certain like the rate of violence and aggregate is decreasing,\n\n57:33.760 --> 57:40.240\n the death, you know, the quality of life, all those kinds of measures that you can plot across\n\n57:40.240 --> 57:44.960\n centuries that it's improving. That doesn't capture the fact that our world might be this,\n\n57:44.960 --> 57:51.200\n we might destroy ourselves in very painful ways in the in the in the next century.\n\n57:51.200 --> 57:56.560\n So I'm with Jared Diamond, you know, in the book Collapse, where he points out studying\n\n57:56.560 --> 58:03.440\n the collapse of major civilizations, that it often happens right after things appear to never\n\n58:03.440 --> 58:11.440\n have been better. And in that regard, I mean, there are more known voices that have taken issue\n\n58:12.640 --> 58:21.280\n with Dr. Pinker. I'm thinking of John Gray, who's a British philosopher and here in the States. I\n\n58:21.280 --> 58:26.560\n don't know where he is these days, but Robert J. Lifton, the psycho historian. Yeah, they're both\n\n58:26.560 --> 58:31.360\n of my view and which I hope is, by the way, wrong.\n\n58:31.360 --> 58:32.880\n Me too.\n\n58:32.880 --> 58:42.960\n Yeah, no, but you know, between, you know, ongoing ethnic tensions, environmental degradation,\n\n58:42.960 --> 58:49.120\n economic instability, and the fact that, you know, the world has become a Petri dish of\n\n58:49.120 --> 58:56.160\n psychopathology. Like what really worries me is the the quiet economic pain that people are going\n\n58:56.160 --> 59:01.280\n through, the businesses that are closed, dreams that are broken, because you can no longer do the\n\n59:01.280 --> 59:08.480\n thing that you've wanted to do and how I mentioned to you off camera that I've been reading The Rise\n\n59:08.480 --> 59:21.120\n and Fall of the Third Reich. And I mean, the amount of anger and hatred and on the flip side of that,\n\n59:21.120 --> 59:27.520\n sort of a nationalist pride that can arise from deep economic pain. Like what happens with that\n\n59:27.520 --> 59:34.320\n economic pain is you become bitter. You start to find the other, whether it's other European\n\n59:34.320 --> 59:39.200\n nations that mistreated you, whether it's other groups that mistreated you, it always ends up\n\n59:39.200 --> 59:51.760\n being the Jews somehow or fault here. That's what worries me is where this quiet anger and pain goes\n\n59:51.760 --> 59:59.920\n in 2021, 2022, 2030. If you look, sorry to see the parallels. No, no, no. Rise and fall of the\n\n59:59.920 --> 1:00:05.760\n Third Reich, but you know what happens 10, 15 years from now from what's because of the COVID\n\n1:00:05.760 --> 1:00:12.400\n pandemic that's happening now. And Lex, you make a, I think a really profoundly important point,\n\n1:00:12.400 --> 1:00:18.480\n you know, back to our work for a bit or Ernest Becker rather, you know, his point is, is that\n\n1:00:18.480 --> 1:00:25.680\n the way that we manage existential terror is to embrace culturally constructed belief systems\n\n1:00:25.680 --> 1:00:33.920\n that give us a sense that life has meaning and we have value. And in the form of self esteem,\n\n1:00:34.400 --> 1:00:40.800\n which we get from perceiving that we meet or exceed the expectations associated with the role\n\n1:00:40.800 --> 1:00:47.600\n that we play in society. Well, here we are right now in a world where first of all, if you have\n\n1:00:47.600 --> 1:00:53.440\n nothing, you are nothing. And secondly, as you were saying before we got started today,\n\n1:00:53.440 --> 1:01:00.560\n a lot of jobs are gone and they're not coming back. And that's the, where the self esteem,\n\n1:01:00.560 --> 1:01:04.800\n that's where the self esteem and identity come in with people. It's not only that you don't have\n\n1:01:04.800 --> 1:01:11.440\n anything to eat. You don't even have a self anymore to speak of because the, we typically\n\n1:01:11.440 --> 1:01:20.160\n define ourselves, you know, as Marx put it, you are what you do. And now who are you when your way\n\n1:01:20.160 --> 1:01:24.720\n of life, as well as your way of earning a living is no longer available?\n\n1:01:24.720 --> 1:01:29.520\n Yeah. And it feels like that yearning for self esteem that we could talk a little bit more,\n\n1:01:29.520 --> 1:01:36.800\n because you about defining self esteem is quite interesting. The more I've read Warm at the Core\n\n1:01:36.800 --> 1:01:43.360\n and just in general, your thinking, it made me realize I haven't thought enough about the idea\n\n1:01:43.360 --> 1:01:49.200\n of self esteem. But the thing I want to say is, it feels like when you lose your self esteem,\n\n1:01:49.200 --> 1:01:58.320\n it feels like when you lose your job, then it's easy to find, it's tempting to find that self\n\n1:01:58.320 --> 1:02:07.600\n esteem in a tribe that's not somehow often positive. It's like a tribe that defines itself\n\n1:02:07.600 --> 1:02:09.360\n on the hatred of somebody else.\n\n1:02:09.360 --> 1:02:15.680\n So that's brilliant. And this is what John Gray, the philosopher in the 1990s,\n\n1:02:15.680 --> 1:02:22.800\n predicted what's happening today. He wrote a book about globalism. And actually Hannah Arendt in\n\n1:02:22.800 --> 1:02:31.040\n the 1950s said the same thing in her book about totalitarianism. When she said that, you know,\n\n1:02:31.040 --> 1:02:39.040\n that economics has reached the point where most money is made, not by actually making stuff,\n\n1:02:39.040 --> 1:02:48.640\n you know, you use money to make money. And therefore, what happens is money chases money\n\n1:02:48.640 --> 1:02:57.680\n across national boundaries. Ultimately, governments become subordinate to the corporate\n\n1:02:57.680 --> 1:03:06.080\n entities whose sole function is to generate money. And what John Gray said is that that will\n\n1:03:06.080 --> 1:03:17.360\n inevitably produce economic upheaval in local areas, which will not be attributed to the\n\n1:03:17.360 --> 1:03:26.320\n economic order. It will be misattributed to whoever the scapegoat du jour is, and the anger\n\n1:03:26.320 --> 1:03:37.840\n and the distress associated with that uncertainty will be picked up on by ideological demagogues\n\n1:03:37.840 --> 1:03:46.240\n who will transform that into rage. So both Hannah Arendt as well as John Gray, they just said,\n\n1:03:46.240 --> 1:03:57.040\n watch out, we're gonna have right wingish populist movements where demagogues who are the alchemists\n\n1:03:57.040 --> 1:04:06.480\n of hate, what makes them brilliant is they don't, the hate's already there, but they take the fears\n\n1:04:07.360 --> 1:04:15.520\n and they expertly redirect them to who it is that I need to hate and kill in order to feel\n\n1:04:15.520 --> 1:04:22.640\n good about myself. So back to your point, Lex, that's right. So the self regard that used to come\n\n1:04:23.520 --> 1:04:30.720\n from having a job and doing it well, and as a result of that, having adequate resources to\n\n1:04:30.720 --> 1:04:39.200\n provide a decent life for your family, well, those opportunities are gone. And yeah, what's left?\n\n1:04:39.200 --> 1:04:47.200\n So Max Weber, German sociologist at the beginning of the 20th century, he said in times of historical\n\n1:04:47.200 --> 1:04:54.320\n upheaval, we are apt to embrace, he was the one who coined the term charismatic leader, seemingly\n\n1:04:54.320 --> 1:05:02.720\n larger than life individuals who often believe or their followers believe are divinely ordained to\n\n1:05:02.720 --> 1:05:11.680\n rid the world of evil. All right, now, Ernest Becker, he used Weber's ideas in order to account\n\n1:05:11.680 --> 1:05:19.600\n for the rise of Hitler. Hitler was elected, and he was elected when Germans were in an extraordinary\n\n1:05:19.600 --> 1:05:28.000\n state of existential distress, and he said, I'm gonna make Germany great again. All right, now,\n\n1:05:28.000 --> 1:05:37.520\n what Becker adds to the equation is his claim that what underlies our affection for charismatic\n\n1:05:37.520 --> 1:05:45.520\n populist leaders, good and bad, is death anxiety. All right, now, here's where we come in,\n\n1:05:45.520 --> 1:05:52.480\n we're egghead experimental researchers. Becker wrote this book, The Denial of Death, and he\n\n1:05:52.480 --> 1:06:00.000\n couldn't get a job. People just dismiss these ideas as fanciful speculation for which there's\n\n1:06:00.000 --> 1:06:07.440\n no evidence. And you've done some good experiments. Yeah, here's where I can be more cavalier,\n\n1:06:07.440 --> 1:06:15.040\n and where what I would urge people, like what you said, Lex, is ignore my histrionic and polemic\n\n1:06:15.040 --> 1:06:23.360\n language, if possible, and step back, if you can, myself included, and let's just consider\n\n1:06:23.360 --> 1:06:34.000\n the research findings. Because in September 11, 2001, people that are old enough to remember that\n\n1:06:34.000 --> 1:06:42.800\n horrible day, two days before, George W. Bush had the lowest approval rating in the history of\n\n1:06:42.800 --> 1:06:48.560\n presidential polling. All right, three weeks later, after he said, we will rid the world of the\n\n1:06:48.560 --> 1:06:55.440\n evildoers, and then a week or two after that, he said in a cover story on Time magazine that he\n\n1:06:55.440 --> 1:07:01.200\n believed that God had chosen him to lead the world during this, to lead the country, rather, during\n\n1:07:01.200 --> 1:07:07.600\n this perilous time, he had the highest approval rating. And so we're like, well, what happened?\n\n1:07:07.600 --> 1:07:16.400\n You know, what happened to Americans that their approval of President Bush got so high so fast?\n\n1:07:16.400 --> 1:07:25.440\n Well, our view, following Becker, is that 2001 was like a giant death reminder. The people dying,\n\n1:07:25.440 --> 1:07:33.120\n plus the symbols of American greatness, World Trade Center and the Pentagon. So we did a bunch\n\n1:07:33.120 --> 1:07:37.440\n of experiments, and most of our experiments are disarmingly simple. We have one group of\n\n1:07:37.440 --> 1:07:42.800\n people, and we just remind them that they're going to die. We say, hey, write your thoughts\n\n1:07:42.800 --> 1:07:48.320\n and feelings about dying. Or in other cases, we stop them outside, either in front of a funeral\n\n1:07:48.320 --> 1:07:55.120\n home or 100 meters to either side. Our thought being that if we stop you in front of a funeral\n\n1:07:55.120 --> 1:07:59.760\n home, then death is on your mind, even if you don't know it. And then there's other studies,\n\n1:07:59.760 --> 1:08:05.920\n they're even more subtle, where we bring people into the lab, and they read stuff on a computer,\n\n1:08:05.920 --> 1:08:11.920\n and while they're doing that, we flash the word death for 28 milliseconds. It's so fast,\n\n1:08:11.920 --> 1:08:19.760\n you don't see anything. And then we just measure people's reactions or behavior thereafter. So what\n\n1:08:19.760 --> 1:08:29.280\n we found in 2003, leading up to the election of 2004, was that Americans did not care for President\n\n1:08:29.280 --> 1:08:37.440\n Bush or his policies in Iraq in controlled conditions. But if we reminded them of their\n\n1:08:37.440 --> 1:08:45.120\n mortality first, they liked Bush a lot more. So in every study that we did, Americans liked John\n\n1:08:45.120 --> 1:08:49.760\n Kerry, who was running against Bush, they liked Kerry more than Bush.\n\n1:08:49.760 --> 1:08:52.240\n Policy wise, in a controlled...\n\n1:08:52.240 --> 1:09:00.880\n In a controlled condition. But if they were reminded of death first, then they liked Bush\n\n1:09:00.880 --> 1:09:01.760\n a lot more.\n\n1:09:01.760 --> 1:09:06.080\n So by the way, just a small pause, you said they're discerningly simple experiments.\n\n1:09:06.080 --> 1:09:11.040\n I think that's, and people should read Warm at the Core for some other description,\n\n1:09:11.040 --> 1:09:16.320\n you have a lot of different experiments of this nature. I think it's a brilliant experiment\n\n1:09:16.320 --> 1:09:22.640\n connected to the Stoics, perhaps, of how your worldview on anything and how delicious that\n\n1:09:22.640 --> 1:09:28.560\n water tastes after you're reminded of your own mortality. It's such a fascinating experiment\n\n1:09:28.560 --> 1:09:36.720\n that you could probably keep doing like millions of them to draw insight about the way we see the\n\n1:09:36.720 --> 1:09:37.040\n world.\n\n1:09:37.040 --> 1:09:42.320\n No, that's right, Lex. And I appreciate the compliment, not because we did anything,\n\n1:09:42.320 --> 1:09:49.600\n but because what these studies, many of which are now done by other people around the world\n\n1:09:49.600 --> 1:09:54.000\n in labs that we're not connected with, what I'm most proud about our work. I am proud\n\n1:09:54.000 --> 1:09:59.680\n of the experiments that we've done. But it's not science until somebody else can replicate\n\n1:09:59.680 --> 1:10:05.280\n your findings and independent researchers are interested in pursuing them.\n\n1:10:05.280 --> 1:10:08.880\n It's such a fascinating idea. I don't... I have to think about\n\n1:10:08.880 --> 1:10:14.160\n a lot about the experiments you've done and that you've inspired, about the fact that death\n\n1:10:14.160 --> 1:10:20.880\n changes the way you see a bunch of different things. I think the Stoics talked about the,\n\n1:10:21.680 --> 1:10:28.400\n I mean, in general, just memento mori, like just thinking about death and meditating on death is a\n\n1:10:28.400 --> 1:10:37.040\n really positive, not a positive, it's an enlightening way to live life. So what do you\n\n1:10:37.040 --> 1:10:45.040\n think about that at the individual level? Like, what is the role about being, bringing that terror\n\n1:10:45.040 --> 1:10:48.960\n of death, fear of death to the surface and being cognizant of it?\n\n1:10:48.960 --> 1:10:56.960\n For us, that's the ball game. So what I'm trying to say is that\n\n1:10:56.960 --> 1:11:06.480\n so what we write in our book and here we're just paying homage to the philosophers and\n\n1:11:06.480 --> 1:11:17.520\n theologians that come before us is to point out that literally since antiquity, there has been\n\n1:11:17.520 --> 1:11:28.320\n a consensus that to lead a full life requires, Albert Camus said, come to terms with death,\n\n1:11:28.320 --> 1:11:37.920\n thereafter anything is possible. And so you've got the Stoics and you've got the Epicureans and\n\n1:11:37.920 --> 1:11:43.760\n then you've got the Tibetan Book of the Dead and then you've got like the medieval monks that,\n\n1:11:43.760 --> 1:11:52.720\n you know, worked with like a skull on their desk. And the whole idea, I should back up a bit because\n\n1:11:52.720 --> 1:11:58.720\n and just remind folks that our studies, you know, when we remind people that they're going to die\n\n1:11:59.280 --> 1:12:08.720\n and we find that, yeah, they drink more water if a famous person is, you know, advertising it,\n\n1:12:08.720 --> 1:12:16.720\n but they eat more cookies. They want more fancy clothes. They sit closer to people that look like\n\n1:12:16.720 --> 1:12:23.120\n them. It changes who they vote for. But all of those things, those are very subtle death reminders.\n\n1:12:23.120 --> 1:12:29.520\n You don't even know that death is on your mind. And so our point is that, and this is kind of\n\n1:12:29.520 --> 1:12:38.480\n counterintuitive, and that is that the most problematic and unsavory human reactions to death\n\n1:12:38.480 --> 1:12:45.760\n anxiety are malignant manifestations of repressed death anxiety. You know, we try and bury it under\n\n1:12:45.760 --> 1:12:52.560\n the psychological bushes and then it comes back to bear bitter fruit. But what the theologians and\n\n1:12:52.560 --> 1:13:02.480\n the philosophers of the world are saying is it behooves each of us to spend considerable time.\n\n1:13:02.480 --> 1:13:11.600\n You don't have to be a goth death rocker, you know, wallowing in death imagery to spend enough\n\n1:13:11.600 --> 1:13:18.720\n time entertaining the reality of the human condition, which is that you too will pass\n\n1:13:18.720 --> 1:13:30.400\n to get to the point where there is, to lapse into a cliche, the capacity for personal transformation\n\n1:13:31.520 --> 1:13:41.280\n and growth. Let's go personal for a second. Are you yourself afraid of death? Yeah.\n\n1:13:41.280 --> 1:13:49.200\n And how much do you meditate on that thought? Like, maybe your own study of it is a kind of\n\n1:13:49.200 --> 1:13:55.520\n escape from your own mortality. Absolutely. So you got it. And like, if you figure out death,\n\n1:13:55.520 --> 1:14:01.120\n somehow you won't die. So no, no. So my my colleagues and good friends, Jeff Greenberg\n\n1:14:01.120 --> 1:14:06.480\n and Tom Posinski, you know, we met in graduate school in the 1970s. We've been doing this work\n\n1:14:06.480 --> 1:14:15.280\n for 40 years. And we cheerfully admit, even though it doesn't reflect well on us as humans,\n\n1:14:16.000 --> 1:14:23.360\n that I should just speak for myself. But I feel like there's a real sense in which doing these\n\n1:14:23.360 --> 1:14:34.000\n studies and writing books and lecturing has been my way of avoiding directly confronting my anxiety.\n\n1:14:34.000 --> 1:14:43.280\n Directly confronting my anxieties by turning it into an intellectual exercise. And every once\n\n1:14:43.280 --> 1:14:48.880\n in a while, therefore, when I think that I'm making some progress as a human, I have to remind\n\n1:14:48.880 --> 1:14:59.680\n myself that that is probably not the case. And I have at times, like all humans, been more\n\n1:14:59.680 --> 1:15:05.600\n preoccupied with the implications of these ideas for my self esteem as like, oh, we're going to\n\n1:15:05.600 --> 1:15:15.200\n write a book and maybe we'll get to go on TV or something. Well, no, that's not the same as to\n\n1:15:15.200 --> 1:15:23.120\n actually think about it in a way that you feel it rather than just think it.\n\n1:15:23.120 --> 1:15:29.680\n Yeah, like you did when you were eight. Exactly right. So when I first read The Denial of Death,\n\n1:15:30.240 --> 1:15:36.800\n I was so literally flabbergasted by it that I took a leave of absence for a year\n\n1:15:37.520 --> 1:15:43.920\n and just like did what would be considered menial jobs. I did construction work. I worked in a\n\n1:15:43.920 --> 1:15:53.760\n restaurant. And I was just like, well, wait a minute. If I understand what this guy is saying,\n\n1:15:54.720 --> 1:16:03.200\n then I'm just a culturally constructed meat puppet doing things for reasons that I know not\n\n1:16:04.080 --> 1:16:10.560\n in order to assuage death anxiety. And I was like, that's not acceptable.\n\n1:16:10.560 --> 1:16:15.440\n Maybe another interesting person to talk about is Ernest Becker himself.\n\n1:16:16.480 --> 1:16:24.960\n So how did he face his death? Is there something interesting, personal?\n\n1:16:24.960 --> 1:16:35.200\n I think so. So interesting to me is Becker also from a Jewish family, claimed to be\n\n1:16:35.200 --> 1:16:47.040\n the atheistic, did not identify ultimately as Jewish. I believe he converted to Christianity,\n\n1:16:47.840 --> 1:16:55.760\n but was himself a religious person. And he said he became religious when his first child was born.\n\n1:16:55.760 --> 1:17:03.360\n Now religious, what does that mean? Does he have a faith? Well, let's talk more. Most importantly,\n\n1:17:03.360 --> 1:17:10.160\n is the afterlife. What's his view on the afterlife? He was agnostic on that, but he did.\n\n1:17:11.120 --> 1:17:21.840\n Now the denial of death is, there's a chapter devoted to Kierkegaard. And he talks about\n\n1:17:23.040 --> 1:17:30.080\n for Kierkegaard, if you want to become a mature individual, if you want to learn something,\n\n1:17:30.080 --> 1:17:36.560\n you go to the university. If you want to become a more mature individual, according to Kierkegaard,\n\n1:17:36.560 --> 1:17:44.560\n you got to go to the school of anxiety. And what Kierkegaard said is that we have to let this vague\n\n1:17:45.120 --> 1:17:54.400\n dis ease, put a hyphen between dis and ease about death. Kierkegaard's point is you have to really\n\n1:17:54.400 --> 1:18:02.480\n think about that. You have to think about it and feel it. You got to let it seek in or seep into\n\n1:18:03.760 --> 1:18:14.160\n your mind. At which point, according to Kierkegaard, basically you realize that your\n\n1:18:14.160 --> 1:18:19.760\n present identity is fundamentally a cultural construction. You didn't choose the time and\n\n1:18:19.760 --> 1:18:27.200\n place of your birth. You didn't choose your name. You didn't choose necessarily even the social\n\n1:18:27.200 --> 1:18:32.800\n role that you occupy. You might've chosen from what's available in your culture, but not from\n\n1:18:32.800 --> 1:18:40.240\n the full palette of human opportunities. And so what Kierkegaard said is that we need to realize\n\n1:18:40.240 --> 1:18:51.040\n that we've been living a lie of sorts. Becker calls it a necessary lie. And we have to momentarily\n\n1:18:51.920 --> 1:19:00.640\n dispose of that. And so now Kierkegaard says, well, here I am. I have shrugged off all of the\n\n1:19:00.640 --> 1:19:11.120\n all of the cultural accoutrements that I have used to define myself. And now what am I or who am I?\n\n1:19:11.120 --> 1:19:19.840\n This is like the ancient Greek tragedy where the worst thing was to be no one or no thing. At this\n\n1:19:19.840 --> 1:19:26.880\n point, Kierkegaard said, you're really dangling on the precipice of oblivion. And some people\n\n1:19:26.880 --> 1:19:34.240\n tumble into that abyss and never come out. On the other hand, Kierkegaard said that\n\n1:19:34.240 --> 1:19:40.640\n what you can now do metaphorically and literally is to rebuild yourself from the ground up. And\n\n1:19:40.640 --> 1:19:46.160\n there's a, in the new Testament, there's something you have to die in order to be reborn. And\n\n1:19:46.160 --> 1:19:51.920\n Kierkegaard's view though, is that there's only one way to do that. This is his proverbial leap\n\n1:19:51.920 --> 1:20:01.600\n into faith. And in Kierkegaard's case, it was faith in Christianity, that you can't have unbridled\n\n1:20:01.600 --> 1:20:09.680\n faith in cultural constructions. The only thing that you can have unequivocal faith in is some\n\n1:20:09.680 --> 1:20:17.600\n kind of transcendent power. All right. But of course, this raises the question of, well, is that\n\n1:20:17.600 --> 1:20:25.600\n just another death denying belief system? And at the end of the denial of death, Becker admits\n\n1:20:26.160 --> 1:20:35.840\n that there's no way to tell while still advocating for what is ultimately a religious stance. Now,\n\n1:20:35.840 --> 1:20:41.760\n one of the things that I don't understand, and Becker has been the most singularly potent\n\n1:20:41.760 --> 1:20:50.560\n influence in my academic and personal life, but a year or two ago, I started reading Martin\n\n1:20:50.560 --> 1:21:02.560\n Heidegger. I'm reading Being and Time. And what I now wonder is why Becker, who refers to Heidegger\n\n1:21:02.560 --> 1:21:08.000\n from time to time in his work, why he didn't take Heidegger more seriously. Because Heidegger\n\n1:21:08.000 --> 1:21:16.800\n is like a secular Kierkegaard. He has the same thing, which is death anxiety. Oh, and I should\n\n1:21:16.800 --> 1:21:22.800\n have pointed out that what Kierkegaard says is that death anxiety, most people don't go to the\n\n1:21:22.800 --> 1:21:32.800\n school of anxiety. They flee from death anxiety by embracing their cultural beliefs. Kierkegaard\n\n1:21:32.800 --> 1:21:39.360\n says they then tranquilize themselves with the trivial. And I love that phrase. It's a beautiful\n\n1:21:39.360 --> 1:21:44.160\n phrase because at the end of the denial of death, Becker's like, look, the average American is\n\n1:21:44.160 --> 1:21:50.400\n either drinking or shopping or watching television, and they're all the same thing, right? Heidegger\n\n1:21:50.400 --> 1:21:56.480\n says the same thing. He says, look, and he acknowledges Kierkegaard. He says, what makes us\n\n1:21:56.480 --> 1:22:06.080\n feel unsettled? And evidently, that's an English translation of angst, that we don't feel at home\n\n1:22:06.080 --> 1:22:14.240\n in the world. Heidegger says that's death anxiety. And one direction is the Kierkegaard one.\n\n1:22:14.880 --> 1:22:21.520\n Heidegger calls it a flight from death. You just unself reflexively cling to your cultural\n\n1:22:21.520 --> 1:22:30.720\n constructions. And Heidegger borrows the term tranquilized, but he points out that he doesn't\n\n1:22:30.720 --> 1:22:38.000\n care for that term because tranquilized sounds like you're subdued. When in fact, what most\n\n1:22:38.000 --> 1:22:44.240\n culturally constructed meat puppets do is to be frenetically engaged with their surroundings to\n\n1:22:44.240 --> 1:22:49.840\n ensure that they never sit still long enough to actually think about anything consequential.\n\n1:22:49.840 --> 1:22:57.360\n Heidegger says there's another way, though. He's like, yo, what you can do is to come to terms with\n\n1:22:57.360 --> 1:23:06.400\n that death anxiety in the following way. Thing number one is to realize that not only are you\n\n1:23:06.400 --> 1:23:15.840\n going to die, but your death can happen at any given moment. So for Heidegger, if you say, I know\n\n1:23:15.840 --> 1:23:22.320\n I'm going to die in some vaguely unspecified future moment, that's still death denial because you're\n\n1:23:22.320 --> 1:23:31.600\n saying, yeah, not me, not now. Heidegger's point is you need to get to the point where you need to\n\n1:23:31.600 --> 1:23:41.760\n realize that I need to realize that I can walk outside and get smote by a comet, or I can stop\n\n1:23:41.760 --> 1:23:48.640\n for gas on the way home and catch the virus and be dead in two days, or any number of potentially\n\n1:23:48.640 --> 1:23:51.840\n unanticipated and uncontrollable fatal outcomes.\n\n1:23:51.840 --> 1:23:57.440\n That's brilliant, by the way. Sorry. To bring it to the now.\n\n1:23:57.440 --> 1:24:03.040\n Yeah, it is brilliant. I agree, Lex, and that's just why I'm wondering why didn't Becker notice\n\n1:24:03.040 --> 1:24:09.600\n this? Because that's the being and time thing, is it's got to be now. And then he says, so okay,\n\n1:24:09.600 --> 1:24:20.240\n so now I've dealt somewhat with the death part. And now he says, now you've got to deal with what he\n\n1:24:20.240 --> 1:24:30.720\n calls existential guilt. And he says, well, all right, you have to realize that like it or not,\n\n1:24:31.280 --> 1:24:37.840\n you have to make choices. This is Jean Paul Sartre, we are condemned by virtue of consciousness to\n\n1:24:37.840 --> 1:24:45.520\n choosing. But Heidegger is a little bit more precise. He's like, look, as I was saying earlier,\n\n1:24:45.520 --> 1:24:55.120\n you're in reality, you're an insignificant speck of respiring carbon based dust born into a time\n\n1:24:55.120 --> 1:25:02.240\n and place not of your choosing when you're here for a microscopic amount of time after which you\n\n1:25:02.240 --> 1:25:13.920\n are not. And for Heidegger, you have to realize that, like I said, I didn't choose to be born a\n\n1:25:13.920 --> 1:25:24.480\n male or Jewish or in America, the offspring of working class people. And Heidegger, what he says\n\n1:25:24.480 --> 1:25:33.120\n is, yeah, but you still have to make choices and accept responsibility for those choices,\n\n1:25:34.080 --> 1:25:39.280\n even though you didn't choose any of the parameters that ultimately limit what's available\n\n1:25:39.280 --> 1:25:51.520\n to you. And moreover, you're going to not always make good choices. So now you're guilty for your\n\n1:25:51.520 --> 1:26:03.680\n choices. And then he uses the poet Rilke, he has a phrase, Becker uses it in The Denial of Death,\n\n1:26:03.680 --> 1:26:14.400\n the guilt of unlived life. I just love that. You have to accept that you have already diminished\n\n1:26:14.400 --> 1:26:23.120\n and in many ways amputated your own possibilities by virtue of choices that you've made or just as\n\n1:26:23.120 --> 1:26:33.920\n often have declined to make because you are reluctant to accept responsibility for the\n\n1:26:33.920 --> 1:26:42.960\n opportunities that you are now able to create by virtue of seeing the possibilities that lay before\n\n1:26:42.960 --> 1:26:51.600\n you. So anyway, Heidegger then says, look, OK, so, you know, I'm a professor and I live in America\n\n1:26:52.320 --> 1:27:00.640\n in the 21st century. Well, if I was in the third century living in a year in Mongolia, I'm not\n\n1:27:00.640 --> 1:27:10.160\n going to have an opportunity to be a professor. But what he submits is that there is some aspects\n\n1:27:10.160 --> 1:27:19.120\n of whatever I am that are independent of my cultural and historical circumstances. In other\n\n1:27:19.120 --> 1:27:23.760\n words, there is a me of sorts. Heidegger would take vigorous issue and so would Heidegger's\n\n1:27:23.760 --> 1:27:28.640\n scholars because I'm not claiming to understand him. This is my classic comic book rendering.\n\n1:27:29.200 --> 1:27:34.560\n But Heidegger's point is that you get to the point where you're able to say, OK,\n\n1:27:34.560 --> 1:27:44.480\n I am a contingent historical and cultural artifact. But so what? You know, if I was,\n\n1:27:44.480 --> 1:27:52.160\n you know, if I was transported a thousand years in the past in Asia, I'd be in the same situation.\n\n1:27:52.160 --> 1:27:58.640\n I would still be conditioned by time and place. I would still have choices that I could make\n\n1:27:58.640 --> 1:28:06.160\n within the confines of what opportunities are afforded to me. And then Heidegger says,\n\n1:28:06.160 --> 1:28:14.640\n if I can get that far in this is his language. He says that there is a transformation and he\n\n1:28:14.640 --> 1:28:22.000\n literally he calls it a turning. You're turning away from a flight from death and you are allowed\n\n1:28:22.000 --> 1:28:33.040\n you therefore you see a horizon is his word of opportunity that makes you in a state of\n\n1:28:33.040 --> 1:28:44.000\n anticipatory resoluteness with solicitous regard for others that makes your life seem like an\n\n1:28:44.000 --> 1:28:54.240\n adventure perfused with unshakable joy. Let me unpack those things. It is beautiful. It is. I\n\n1:28:54.240 --> 1:28:59.440\n love, Lex, that you're resonating to the time thing. So he's like, OK, we already talked about\n\n1:28:59.440 --> 1:29:09.360\n now. Anticipatory is is already hopeful because it's looking forward to be resolute. It means to\n\n1:29:09.360 --> 1:29:19.680\n trust and to just have confidence in what you're doing moving forward. All right. Solicitous. I\n\n1:29:19.680 --> 1:29:25.840\n had to look up all these words, by the way. It just means that you are concerned about your\n\n1:29:25.840 --> 1:29:34.720\n fellow human beings. And but I love the idea, even if it seems allegorical, I don't mind that\n\n1:29:34.720 --> 1:29:41.520\n at all. This idea you said love earlier. And I think that when Heidegger is talking about being\n\n1:29:41.520 --> 1:29:49.920\n solicitous, that's as close as he can get. There's an Italian. Yes. So what was that line again with\n\n1:29:49.920 --> 1:29:56.000\n the solicitous of the whole thing of turning away from death? And all the words you said are just\n\n1:29:56.000 --> 1:30:02.880\n beautiful. I love those words. Yeah. Anticipatory resoluteness that is accompanied with solicitous\n\n1:30:02.880 --> 1:30:12.560\n regard to our fellow humans, which makes life appear to us to be an ongoing adventure that is\n\n1:30:12.560 --> 1:30:20.640\n permeated by unshakable joy. Now, again, Heidegger is not Mary Poppins. This I just got a tattoo.\n\n1:30:20.640 --> 1:30:28.080\n I know. This is great. I just love that exact quote. No, I'm piecing together. These are his\n\n1:30:28.080 --> 1:30:35.200\n exact words that and I spent the last two years reading almost everything that I can find because\n\n1:30:35.200 --> 1:30:42.240\n I want to. I'm sick of death. You said it. So I want to second what you say, Lex. So it's not\n\n1:30:42.240 --> 1:30:49.920\n about death. It's the Sherwood Anderson guy. He's a novelist that I like about. He wrote a book\n\n1:30:49.920 --> 1:30:57.920\n in Lyonsburg, Ohio. And now I'm going to forget what he said on his tombstone. But, you know, it\n\n1:30:57.920 --> 1:31:05.360\n was something to the effect. Oh, he said life, not death is the great adventure. The point being is\n\n1:31:05.360 --> 1:31:15.200\n that, you know, to consider that we must die and the existential implications of that, really,\n\n1:31:15.200 --> 1:31:25.440\n the goal, the way I see it is getting from hate to love. And I feel like Heidegger has\n\n1:31:26.720 --> 1:31:33.840\n a way of thinking about things that moves us more in that direction. And so that's kind of my\n\n1:31:34.480 --> 1:31:44.560\n current preoccupation is to take what I just said to you and to talk about it with my colleagues\n\n1:31:44.560 --> 1:31:49.760\n and other academic psychologists, because the way we started with Ernest Becker,\n\n1:31:50.400 --> 1:31:55.440\n remember I said earlier, I wasn't trained in any of these things. I'm an egghead\n\n1:31:56.160 --> 1:32:02.880\n researcher that was doing experiments about biofeedback. And, you know, then we read these\n\n1:32:02.880 --> 1:32:08.480\n Becker books, and I thought they were so interesting that for the first few years,\n\n1:32:08.480 --> 1:32:13.600\n we didn't have any studies. I just would travel around and I'd be like, here's what this Becker\n\n1:32:13.600 --> 1:32:20.480\n guy says. I think this is cool. Well, my present view is I'm like, here's what this Heidegger guy\n\n1:32:20.480 --> 1:32:30.240\n says. I think these ideas are consistent with what Becker is saying because they are anchored in\n\n1:32:30.240 --> 1:32:41.600\n death anxiety. But I like that direction as an alternative to the Kierkegaardian insistence that\n\n1:32:41.600 --> 1:32:51.600\n the only psychologically tenable way to extricate ourselves from maladaptive reactions to death\n\n1:32:51.600 --> 1:33:00.640\n anxiety is through faith in the traditional sense. Yeah, I always kind of saw Kierkegaard unfairly,\n\n1:33:00.640 --> 1:33:06.560\n like you said, in a comic book sense of the word faith as a non traditional sense. I kind of like\n\n1:33:06.560 --> 1:33:11.600\n the idea of leap of faith. Oh, I love that idea. And so what I've been babbling about with, you\n\n1:33:11.600 --> 1:33:21.280\n know, Heidegger, I'm like, yeah, Kierkegaard is a leap of faith in God. Heidegger is a leap of faith\n\n1:33:21.280 --> 1:33:29.600\n in life. And I just like it. I found the leap of faith really interesting in the technological\n\n1:33:29.600 --> 1:33:37.280\n space. So I've talked to on this thing with Elon Musk, but I think he's also just in general for\n\n1:33:37.280 --> 1:33:43.040\n our culture, a really important figure. Oh, absolutely. That takes, I mean, sometimes a\n\n1:33:43.040 --> 1:33:49.760\n little bit insane on social media and just in life. When I met him, it was kind of interesting\n\n1:33:51.280 --> 1:33:56.720\n that, of course, there's, I mean, he's a legit engineer, so he's fun to talk to about the\n\n1:33:56.720 --> 1:34:05.200\n technical things, but he also just the way the humor and the way he sees life, it just like\n\n1:34:05.200 --> 1:34:13.920\n refuses to be conventional. So it's a constant leap into the unknown. And one of the things\n\n1:34:14.480 --> 1:34:20.800\n that he does, and this isn't even like fake. A lot of people say, cause he's a CEO,\n\n1:34:20.800 --> 1:34:27.680\n there's a business owner. So he's trying to make money. No, I think I looked him in his eyes. I\n\n1:34:27.680 --> 1:34:33.840\n mean, this is real, is a lot of the things he believes that are going to be accomplished that\n\n1:34:33.840 --> 1:34:39.520\n a lot of others are saying are impossible, like autonomous vehicles. He truly believes it. To me,\n\n1:34:39.520 --> 1:34:45.440\n that is the leap of faith of I'm almost going like, we're like the entirety of our experience\n\n1:34:45.440 --> 1:34:50.240\n is shrouded in mystery. We don't know what the hell's going to happen. We don't know what we're\n\n1:34:50.240 --> 1:34:56.160\n actually capable of as human beings. And he just takes the leap. He fully believes that we can,\n\n1:34:56.160 --> 1:35:04.480\n you know, we can go to, we can colonize Mars. I mean, how, how crazy is it to just believe and\n\n1:35:04.480 --> 1:35:10.720\n dream and actually be taking steps towards it to colonizing Mars when most people are like,\n\n1:35:10.720 --> 1:35:16.000\n that's the stupidest idea ever. Yeah. Well, I'm, I'm in agreement with you on that. You know,\n\n1:35:16.000 --> 1:35:20.720\n two things, you know, one is it reminds me of Ben Franklin who in his autobiography,\n\n1:35:21.440 --> 1:35:31.120\n you know, has a similarly childish in the best sense of the word, unbridled imagination for what\n\n1:35:31.120 --> 1:35:37.760\n might become, you know, Ben Franklin's like, yeah, I got electricity. That's cool, but we'll be\n\n1:35:37.760 --> 1:35:45.200\n levitating soon. And I, we can't even begin to imagine what we are capable of. And of course,\n\n1:35:45.200 --> 1:35:53.120\n people are like, dude, that's crazy. And there's a guy with it's FCS Schiller, some humanistic guy\n\n1:35:53.120 --> 1:36:04.640\n at the beginning of the 20th century. He's like, you know, lots of things that people think about\n\n1:36:05.760 --> 1:36:13.280\n may appear to be absurd to the point of obscene. But the reality is historically\n\n1:36:13.280 --> 1:36:21.600\n every fantastic innovation has generally been initiated by someone who was condemned\n\n1:36:22.320 --> 1:36:31.360\n for being a lunatic. And it's not that anything is possible, but surely things that we don't try\n\n1:36:31.360 --> 1:36:38.800\n will never manifest as possibilities. Yeah. And that's, that's that there's something beautiful\n\n1:36:38.800 --> 1:36:46.160\n to that. That's the embracing the abyss. And again, it's like the, it's the embracing the\n\n1:36:46.160 --> 1:36:53.360\n fear of death, the reality of death and then turning and to look at all the opportunities.\n\n1:36:54.160 --> 1:36:59.680\n That's right. Let me ask you, whenever I bring up Ernest Becker's work, which I do and yours\n\n1:36:59.680 --> 1:37:10.320\n is quite a bit, I find it surprising how that it's not a lot more popular in a sense that,\n\n1:37:11.680 --> 1:37:16.560\n no, we're not, I don't mean just your book. That's well written. People should read it,\n\n1:37:16.560 --> 1:37:23.360\n should buy it, whatever. I think it has the same kind of qualities that are useful to think about\n\n1:37:23.360 --> 1:37:32.400\n as like Jordan Peterson's work and stuff like that. But I just mean like why people are not,\n\n1:37:32.400 --> 1:37:41.200\n don't think of that as a compelling description of the core of the human condition. Like,\n\n1:37:42.000 --> 1:37:46.320\n I think what you mentioned about Heidegger is quite, connects with me quite well. So I ask\n\n1:37:47.520 --> 1:37:52.720\n on this podcast, I often ask people if they're afraid of death. That's like almost every single\n\n1:37:52.720 --> 1:38:00.080\n part. I almost always get criticized for asking world class people, scientists and technologists\n\n1:38:00.080 --> 1:38:07.280\n about fear of death and the meaning of life. And on the fear of death, they often\n\n1:38:09.040 --> 1:38:16.480\n like don't say anything interesting. What I mean by that is they haven't thought deeply about it.\n\n1:38:16.480 --> 1:38:22.240\n Like you kind of brought this up a few times of really letting it sink in. They kind of say this\n\n1:38:22.240 --> 1:38:29.120\n thing about what exactly you said, which is like, it's something that happens not today. Like I'm\n\n1:38:29.120 --> 1:38:34.160\n aware that it's something that happens. And I'm not, the thing they usually say is I'm not afraid\n\n1:38:34.160 --> 1:38:42.320\n of death. I just want to live a good life kind of thing. And what I'm trying to express is like when\n\n1:38:42.320 --> 1:38:47.360\n I look in their eyes and the kind of the core of the conversation, it looks like they haven't\n\n1:38:47.360 --> 1:38:54.800\n really become, like they haven't really meditated on death. I guess the question is, what do I say\n\n1:38:54.800 --> 1:39:04.160\n to people that there's something to really think about here? Like there's some demons, some realities\n\n1:39:04.160 --> 1:39:10.400\n that need to be faced by more people. Well, that's a tough one. You know, I could tell you what not to\n\n1:39:10.400 --> 1:39:19.840\n do. So when we are young and annoying, a lot of famous people, mostly psychologists because that's\n\n1:39:19.840 --> 1:39:29.440\n who we intersected with, we would lay out these ideas and they would be, well, I don't think\n\n1:39:29.440 --> 1:39:37.840\n about death like that. So these ideas must be wrong. And we would say, well, you don't think\n\n1:39:37.840 --> 1:39:44.080\n about death because you're lucky enough to be comfortably ensconced in a cultural worldview\n\n1:39:44.080 --> 1:39:50.880\n from which you derive self esteem. And that has spared you the existential excruciations that\n\n1:39:50.880 --> 1:39:57.680\n would otherwise arise. But that's like Freud. You know, you're repressing, so you either agree with\n\n1:39:57.680 --> 1:40:04.480\n me in which case I'm right, or you disagree with me in which case you're repressing and I'm right.\n\n1:40:04.480 --> 1:40:11.840\n Well, so that's the Nietzsche thing. What I felt when I've, there've been moments in my life\n\n1:40:11.840 --> 1:40:17.200\n when I really thought about death. I mean, there's not too many. Like really, really thought about it\n\n1:40:17.200 --> 1:40:22.160\n and feel the thing when you felt that eight, maybe I'm traumatizing or romanticizing it. But\n\n1:40:23.920 --> 1:40:31.360\n I feel like it's, the conservatives call it popularly like, or the movie Matrix call it the\n\n1:40:31.360 --> 1:40:39.920\n red pill moment. I feel like it's a dangerous thought because I feel like I'm taking a step\n\n1:40:39.920 --> 1:40:45.520\n out of a society. Like there's a nice narrative that we've all constructed and I'm taking a step\n\n1:40:45.520 --> 1:40:55.040\n out. And it feels, there's this feeling like you're basically drowning. I mean, it's not a\n\n1:40:55.040 --> 1:41:00.480\n good feeling. It is not. But this gets back to the Heidegger Kierkegaard school of anxiety. You are\n\n1:41:00.480 --> 1:41:09.120\n stepping out and you are momentarily shrugging off, again, the culturally constructed psychological\n\n1:41:09.120 --> 1:41:18.240\n accoutrements that allow you to stand up in the morning. And so, I mean, in that sense, it feels\n\n1:41:18.240 --> 1:41:29.760\n like, I mean, how do you have that conversation? Because I guess I'm dancing around a set of\n\n1:41:29.760 --> 1:41:37.680\n questions, which is like, I guess I'm disappointed that people don't, are not as willing to step\n\n1:41:37.680 --> 1:41:46.160\n outside. Like even just, even any kind of thought experiment. Forget denial of death. Like\n\n1:41:48.320 --> 1:41:53.680\n there's not a community of people. Let's take an easy one that I think is scientifically\n\n1:41:53.680 --> 1:41:59.840\n ridiculous, which is, there's a community of people that believe that the earth is flat. Or\n\n1:41:59.840 --> 1:42:09.760\n actually even better, the space is fake. Like what I find surprising is that a lot of people I talk\n\n1:42:09.760 --> 1:42:18.640\n to are not willing to be like, imagine if it is, like imagine the earth is flat. Like think about\n\n1:42:18.640 --> 1:42:25.520\n it. Like a lot of people are just like, no, the earth is round. They're like scientists too. They're\n\n1:42:25.520 --> 1:42:31.760\n like, yeah, well actually, wait, have you actually like thought about it? Like imagine like a thought\n\n1:42:31.760 --> 1:42:38.800\n experiment that like basically step outside the little narrative that we are comfortable with. Now\n\n1:42:38.800 --> 1:42:48.240\n that one in particular is, has really strong evidence and scientific validation. So it's\n\n1:42:48.240 --> 1:42:56.800\n pretty simple thing to show that it at least is not flat. But just the willingness to take a step\n\n1:42:56.800 --> 1:43:03.440\n outside of the stories that bring us comfort, it's been disappointing that people are not willing to\n\n1:43:03.440 --> 1:43:09.040\n do that. And I think the philosophy that you've constructed and that Ernest Becker is constructing,\n\n1:43:09.040 --> 1:43:14.800\n you've tested, I think is really compelling. And the fact that people aren't often willing to take\n\n1:43:14.800 --> 1:43:21.200\n that step. It's disappointing. Well, yes, but perhaps understandable. I mean, one of this is\n\n1:43:21.200 --> 1:43:29.360\n an anecdote, of course, but when we were trying to get a publisher for our book, we had a meeting\n\n1:43:30.000 --> 1:43:41.520\n with a publisher who published some Malcolm Gladwell books. And she said, I'm very interested\n\n1:43:41.520 --> 1:43:47.840\n in your book, but can you write it without mentioning death? Because people don't like death.\n\n1:43:47.840 --> 1:43:56.960\n And we're like, no, it's really kind of central. And I think that's part of it. I think, again,\n\n1:43:56.960 --> 1:44:06.320\n if these ideas have merit, and I actually like the way that you put it, Lex, it's that to step away\n\n1:44:06.320 --> 1:44:19.840\n is to momentarily expose yourself to all of the anxiety that our identity and our beliefs\n\n1:44:20.960 --> 1:44:24.160\n typically enable us to manage. I think it's as simple as that.\n\n1:44:24.160 --> 1:44:36.880\n Yeah, I had this experience in college with my best friend who got really high. And he forgot,\n\n1:44:36.880 --> 1:44:41.440\n it was in the winter, it was really freezing. It was memorable to me. I think it's an analogy,\n\n1:44:41.440 --> 1:44:53.200\n it's very useful. So he went to get some pizza. And he left me outside and said,\n\n1:44:53.200 --> 1:44:59.280\n I'll be back in five minutes. And he forgot that he left me outside. And I remember it was,\n\n1:44:59.280 --> 1:45:05.840\n I was in shorts, it was freezing winter. And I remember standing outside, it's a dorm,\n\n1:45:05.840 --> 1:45:12.480\n and I'm looking from the outside in, it's a light and it's warm. And I'm just standing there frozen,\n\n1:45:12.480 --> 1:45:19.600\n I think for an hour or more. And that's how I think about it. I don't give a damn about the\n\n1:45:19.600 --> 1:45:28.880\n stupid winter. I'm drawn to be back to the warm. And that's how I feel about thinking about death.\n\n1:45:29.760 --> 1:45:36.560\n At a certain point, it's too much. It's like that cold. I wanna be back into the warm.\n\n1:45:37.760 --> 1:45:46.880\n Getting back to Heidegger for a moment. He uses a lot the idea of feeling at home,\n\n1:45:46.880 --> 1:45:52.240\n not as like in your house, but just feeling like you're comfortably situated.\n\n1:45:52.240 --> 1:45:56.560\n Maybe you could talk about, like I had a conversation about this with my dad a little bit.\n\n1:45:58.320 --> 1:46:01.520\n How does religion relate to this?\n\n1:46:01.520 --> 1:46:18.640\n I see it as the disease and the cure. In a sense, a few things. One is that I think a case could be\n\n1:46:18.640 --> 1:46:26.720\n made that humans are innately religious. So now we're gonna get into territory where there's gonna\n\n1:46:26.720 --> 1:46:33.120\n be a lot of disputes. And what do you mean by religious?\n\n1:46:33.120 --> 1:46:36.560\n Religion is an evolutionary adaptation.\n\n1:46:36.560 --> 1:46:42.080\n And religion is like a belief in something outside of yourself kind of thing?\n\n1:46:42.080 --> 1:46:50.160\n Not necessarily. So here we gotta be a little bit more careful. And again, I'm not a scholar.\n\n1:46:50.160 --> 1:46:59.520\n How about I'm a well intentioned dilettante in this regard? Because what I have read is that\n\n1:47:00.240 --> 1:47:11.520\n religion evolved very early on, long before our ancestors were conscious and the issue of death\n\n1:47:11.520 --> 1:47:22.880\n arose. And the word religion evidently is from a Latin word, regatear. We can look it up. And it\n\n1:47:22.880 --> 1:47:31.200\n means to bind. And Emile Durkheim, the dead French sociologist, he said, you know, originally\n\n1:47:31.200 --> 1:47:40.320\n religion is Darce Lassing, who's a dead novelist. She calls it the substance of we feeling that it's\n\n1:47:40.320 --> 1:47:51.040\n literally that it arose because we're uber social creatures who from time to time took comfort in\n\n1:47:51.040 --> 1:48:02.160\n just being in physical proximity with our fellow humans. And that there is this kind of sense of\n\n1:48:03.200 --> 1:48:11.280\n transcendent exuberance, just back to the unshakable joy that Heidegger alludes to.\n\n1:48:11.280 --> 1:48:21.760\n And that the original function of religion was to foster social cohesion and coordination. And that\n\n1:48:21.760 --> 1:48:30.720\n it was only subsequently some claim that a burgeoning level of consciousness made it such that\n\n1:48:30.720 --> 1:48:37.340\n religious belief systems that included the hope of some kind of\n\n1:48:37.340 --> 1:48:44.760\n immortality were just naturally selected thereafter. So there are some people. So\n\n1:48:46.760 --> 1:48:53.560\n it's David Sloan Wilson wrote a book called Darwin's Cathedral. And he said,\n\n1:48:53.560 --> 1:49:00.200\n religion has nothing to do with death. It's evolved to make groups viable. He's actually\n\n1:49:00.200 --> 1:49:07.480\n a group selection guy. What's group selection? The idea that it's the group that is selected\n\n1:49:07.480 --> 1:49:12.360\n for rather than the individual. Yeah, so people have vigorous disagreements about that. But I\n\n1:49:12.360 --> 1:49:21.640\n guess our point would be, we see religion as being inextricably connected, ultimately, to assuaging\n\n1:49:21.640 --> 1:49:30.200\n concerns about death. Well, I guess another question to ask around this, like, what does\n\n1:49:30.200 --> 1:49:41.000\n the world look like without religion? Will we, if it's inextricably connected to our fears of death,\n\n1:49:41.000 --> 1:49:47.160\n do you think it always returns in some kind of shape? Maybe it's not called religion, but whatever,\n\n1:49:47.160 --> 1:49:51.880\n it just keeps returning? Yeah, who knows? So that's a great question, Lex. So there's a woman named\n\n1:49:51.880 --> 1:50:01.960\n Karen Armstrong. She was a nun turned historian. And she's, I can't remember the name of the book,\n\n1:50:02.920 --> 1:50:08.520\n but no matter. She, we could look that up, but... If you want, I can look it up, but I can also,\n\n1:50:08.520 --> 1:50:13.400\n I'll just add it in post. Yeah, her point, it says God in the title, of course.\n\n1:50:13.400 --> 1:50:23.560\n But she's like, look, all religions are generally fairly right minded in that they advocate the\n\n1:50:23.560 --> 1:50:35.880\n golden rule. And all religions, at their best, do seem to foster pro social behavior towards the\n\n1:50:35.880 --> 1:50:43.400\n in group. And that confers both psychological as well as physical benefits. That's the good news.\n\n1:50:44.200 --> 1:50:53.000\n And the bad news is historically all religions are subject to being hijacked by a lunatic fringe\n\n1:50:54.520 --> 1:51:02.760\n who declares that, you know, they're the ones in sole possession of the world.\n\n1:51:02.760 --> 1:51:09.080\n Sole possession of the liturgical practices or whatever they call them.\n\n1:51:10.280 --> 1:51:19.480\n And they're the ones that turn, you know, religion at its best into your crusades and holocausts.\n\n1:51:19.480 --> 1:51:31.960\n Yeah. My view, not that it should matter for much, but I grew up just skeptical of religion\n\n1:51:32.920 --> 1:51:39.160\n because I'm like, as a kid, I'm like, well, if we didn't have these beliefs,\n\n1:51:39.160 --> 1:51:45.240\n we wouldn't be killing each other because of them. And I'd be like to my parents,\n\n1:51:45.240 --> 1:51:50.760\n well, you're telling me that all people should be judged on the merits of their character,\n\n1:51:51.560 --> 1:51:58.120\n but don't come home if you don't marry a Jewish woman. Right. Which is implying that if you're\n\n1:51:58.120 --> 1:52:02.280\n not Jewish, you're an inferior form of life. Yeah. That's what tribes always do.\n\n1:52:02.280 --> 1:52:08.200\n And there's the tribal thing. And so there's a guy named Amin Malouf, a Lebanese guy who writes\n\n1:52:08.200 --> 1:52:17.720\n in French in the 1990s, I think wrote a book called In the Name of Identity, Violence and\n\n1:52:17.720 --> 1:52:28.280\n the Need to Belong. And that was his point is unless we can overcome this tribal mentality,\n\n1:52:29.800 --> 1:52:35.640\n this will not end well. But you said earlier something, Lex, that I think is profound and\n\n1:52:35.640 --> 1:52:44.520\n profoundly important. And that is you did not recoil in horror when I mentioned Kierkegaard's\n\n1:52:44.520 --> 1:52:53.960\n use of the term faith. And so I'm a big fan of faith and I'm not sure what that implies.\n\n1:52:56.440 --> 1:53:04.360\n And by the way, this is just a peripheral comment, but I find less resistance to Becker's ideas in\n\n1:53:04.360 --> 1:53:13.640\n our work when I'm in Jesuit schools. It's the Americans, the secular humanists who\n\n1:53:14.440 --> 1:53:21.240\n are most disinclined to accept these ideas. It's an important side comment because I think it's\n\n1:53:21.240 --> 1:53:27.640\n mostly because they don't think philosophically. I speak with a lot of scientists and I think that's\n\n1:53:27.640 --> 1:53:37.080\n my main criticism. I mean, that's the problem with science is it's so comforting to focus in\n\n1:53:37.080 --> 1:53:43.480\n on the details that you can escape thinking about the mystery of it all, the big picture things,\n\n1:53:43.480 --> 1:53:52.600\n the philosophical, like the fact that you don't actually know shit at all. So in terms of Jesuit,\n\n1:53:52.600 --> 1:54:01.000\n like that's the beauty of the experience of faith and so on is like, wherever that journey takes you\n\n1:54:01.000 --> 1:54:07.160\n is you actually explore the biggest questions of our world. So I don't see religion going away\n\n1:54:07.160 --> 1:54:19.240\n because I don't see humans as capable of surviving without faith and hope. And\n\n1:54:19.240 --> 1:54:29.640\n then everyone from the Pope to Elon Musk will acknowledge that it is a world that is unfathomably\n\n1:54:29.640 --> 1:54:38.680\n mysterious. And like it or not, in the absence of beliefs, here I'm Charles Peirce, the pragmatic\n\n1:54:38.680 --> 1:54:44.200\n philosopher, he just said beliefs are the basis of action. If you don't have any beliefs, you're\n\n1:54:44.200 --> 1:54:50.600\n paralyzed with indecision, whether we're aware of it or not, whether we like it or not, in order to\n\n1:54:50.600 --> 1:54:58.680\n stand up in the morning, you have to subscribe to beliefs that can never be unequivocally proven\n\n1:54:59.480 --> 1:55:07.080\n right or wrong. Well, then why do you maintain them? Well, ultimately it's because of some form\n\n1:55:07.080 --> 1:55:16.280\n of faith. But also faith shouldn't be a dogmatic thing that you should always be leaping.\n\n1:55:17.400 --> 1:55:25.240\n I guess the problem with science or with religion is you can sort of all of a sudden\n\n1:55:25.240 --> 1:55:30.680\n take a step into a place where you're super confident that you know the absolute truth of\n\n1:55:30.680 --> 1:55:37.800\n things. There you go. And again, back to Socrates, Plato, back in the cave. At Skidmore, where I\n\n1:55:37.800 --> 1:55:44.120\n work, that's what I have the students read in their first week. And Plato's like, oh, look at\n\n1:55:44.120 --> 1:55:51.560\n all those poor bastards. They're in the cave, but they don't know it. And then they are freed from\n\n1:55:51.560 --> 1:55:56.200\n their chains. And they have to be dragged out of the cave, by the way, which is another interesting\n\n1:55:56.200 --> 1:56:02.840\n point. They don't run out. But that gets back to why people don't like to be divested of their\n\n1:56:02.840 --> 1:56:07.000\n comfortable illusions. But anyway, they get dragged out of the cave into the sunlight,\n\n1:56:07.000 --> 1:56:13.080\n which he claims is a representation of truth and beauty. And I say to the students, well,\n\n1:56:13.080 --> 1:56:21.400\n what's wrong with that? And they're like, nothing. That's like awesome. And then I'm like, yo, dudes,\n\n1:56:21.400 --> 1:56:29.320\n you're out of the cave, but how do you know that you're not in another cave? The illumination may\n\n1:56:29.320 --> 1:56:40.200\n be better. But the minute you think you're at the end of the proverbial intellectual slash\n\n1:56:41.560 --> 1:56:50.840\n epistemological trail, then you have already succumbed to either laziness or dogmatism or\n\n1:56:50.840 --> 1:56:57.000\n both. That's really well put. That's both terrifying and exciting that there's always\n\n1:56:57.000 --> 1:57:03.000\n a bigger cave. A little bit of an out there question, but I think some of the interesting\n\n1:57:03.000 --> 1:57:11.640\n qualities of the human mind is the ideas of intelligence and consciousness. So what do you\n\n1:57:11.640 --> 1:57:19.560\n make of consciousness? So do you think death creates consciousness, like the fear of death,\n\n1:57:19.560 --> 1:57:29.320\n the terror of death creates consciousness and consciousness in turn magnifies the terror of\n\n1:57:29.320 --> 1:57:37.480\n death? I do. Like what is consciousness to you? Don't ask me that. So now if I could answer that,\n\n1:57:37.480 --> 1:57:43.960\n you know, I'd be chugging rum out of a coconut with my Nobel prize that, you know, it's literally,\n\n1:57:43.960 --> 1:57:50.280\n you know, Steven Pinker, I do agree with his claim and I think how the mind works, that it is the\n\n1:57:51.400 --> 1:58:01.320\n key question for the psychological sciences broadly defined in the 21st century.\n\n1:58:01.320 --> 1:58:02.040\n What is consciousness?\n\n1:58:02.040 --> 1:58:09.800\n Yeah, what is consciousness? And I don't think it's an epiphenomenological afterthought. So a\n\n1:58:09.800 --> 1:58:19.000\n lot of people, I think Dan Wagner at Harvard, a lot of folks consider it just the ass end of a\n\n1:58:19.000 --> 1:58:30.520\n process that by the time we are aware of what it is, it's just basically an integrated rendering\n\n1:58:30.520 --> 1:58:37.480\n of something that's already happened. You know, evidently there's a half second delay between\n\n1:58:37.480 --> 1:58:41.560\n when something happens, you know, those studies and our awareness of it.\n\n1:58:43.320 --> 1:58:47.960\n And that's where like ideas of free will will step in. You can explain away a lot of stuff.\n\n1:58:47.960 --> 1:58:54.200\n And I think those are all important and interesting questions. I'm of the persuasion.\n\n1:58:55.160 --> 1:59:05.960\n I mean, even, not even, but Dawkins and the selfish gene is very thoughtful. Actually,\n\n1:59:05.960 --> 1:59:11.880\n in a lot of, it's actually more in notes than in the text of the book, but he's just like,\n\n1:59:11.880 --> 1:59:23.000\n it's hard for me to imagine that consciousness doesn't have some sort of important and highly\n\n1:59:23.000 --> 1:59:30.680\n adaptive function. And what Dawkins says is he thought about it in terms of just that we could\n\n1:59:30.680 --> 1:59:39.560\n do mental simulations, that one possibly extraordinary product of consciousness is to\n\n1:59:40.120 --> 1:59:50.280\n rather than find out often by adverse consequences through trying something would be to run mental\n\n1:59:50.280 --> 1:59:55.800\n simulations. And so one possibility is that consciousness is highly adaptive.\n\n1:59:55.800 --> 2:00:01.960\n Another possibility is Nicholas Humphrey, a British dude who wrote a book about, I think it's\n\n2:00:01.960 --> 2:00:09.000\n called Regaining Consciousness. And he hypothesized, I think this is 1980s, maybe even earlier,\n\n2:00:09.560 --> 2:00:18.840\n that consciousness arose as a way to better predict the behavior of others in social settings,\n\n2:00:18.840 --> 2:00:27.320\n that by knowing how I feel makes me better able to know how you may be feeling. This is like the\n\n2:00:27.320 --> 2:00:35.160\n rudiments of a theory of mind. And it really may not have had anything to do with intelligence,\n\n2:00:35.960 --> 2:00:37.880\n so much as social intelligence.\n\n2:00:37.880 --> 2:00:46.680\n So in that sense, consciousness is a social construct. It's just a useful thing for interacting\n\n2:00:46.680 --> 2:00:56.280\n with other humans. I don't know, but there seems to be something about realizing your own mortality\n\n2:00:56.280 --> 2:00:59.480\n that's somehow intricately connected to the idea of consciousness.\n\n2:00:59.480 --> 2:01:08.120\n Well, I think so also. So this is where, and Nietzsche, he said a solitary creature would not\n\n2:01:08.120 --> 2:01:10.120\n need consciousness.\n\n2:01:10.120 --> 2:01:12.120\n What do you think?\n\n2:01:12.120 --> 2:01:18.200\n Well, I don't know what I think about that. And then he goes on to say that consciousness\n\n2:01:18.200 --> 2:01:23.960\n is the most calamitous stupidity by which we shall someday perish. And wow, I was like, dude.\n\n2:01:25.720 --> 2:01:26.220\n Relax.\n\n2:01:31.160 --> 2:01:37.160\n Say you were on an island alone, and you saw a reflection of yourself in the water.\n\n2:01:39.560 --> 2:01:40.840\n If you were alone your whole life.\n\n2:01:40.840 --> 2:01:48.200\n Yeah, great question. Nietzsche's view would be that your thoughts of yourself would never\n\n2:01:48.200 --> 2:01:51.800\n come to mind. I don't know how I feel about that, though.\n\n2:01:52.520 --> 2:02:00.680\n In a sense, this sounds weird, but in a sense, I feel like my mental conversation has always\n\n2:02:00.680 --> 2:02:12.040\n been with death. It's almost like another notion, like these visualizations of a death\n\n2:02:12.040 --> 2:02:19.560\n in the cloak. I always felt like I am a living thing, and then there's an other thing that\n\n2:02:19.560 --> 2:02:27.720\n is the end of me. And I'm having a conversation with that. So in a sense, that's the way I\n\n2:02:27.720 --> 2:02:36.280\n construct the fact that I am a thing is because there's somebody else that tells me, well,\n\n2:02:36.280 --> 2:02:44.360\n you won't be a thing eventually. So this feels like a conversation, perhaps, but that might\n\n2:02:44.360 --> 2:02:51.640\n be kind of this mental stimulation kind of idea. It's a conversation with yourself, essentially.\n\n2:02:51.640 --> 2:02:52.140\n Sure.\n\n2:02:52.140 --> 2:03:00.620\n Yeah, I don't know how I feel about that, but I tend to be in agreement with you when\n\n2:03:00.620 --> 2:03:11.820\n we're talking about economics more so that we're deeply social beings. It just feels\n\n2:03:11.820 --> 2:03:20.220\n like we're humans. I'm with Harari with the sapiens. We seem to construct ideas on top\n\n2:03:20.220 --> 2:03:23.420\n of each other, and that's fundamentally a social process.\n\n2:03:23.420 --> 2:03:30.860\n Absolutely. I think that's a fine book. It overlaps considerably with our take on these\n\n2:03:30.860 --> 2:03:37.260\n matters, and the fact that we get to these points, drawing on different sources, I think\n\n2:03:37.260 --> 2:03:38.300\n makes me more confident.\n\n2:03:39.020 --> 2:03:46.220\n It's so fascinating, just like reading your book, sorry, on a small tangent, that Sapiens\n\n2:03:46.220 --> 2:03:54.940\n is one of the most popular books in the world. And just reading your book is like, well,\n\n2:03:54.940 --> 2:04:01.580\n this sounds... I don't know what makes a popular book.\n\n2:04:01.580 --> 2:04:07.740\n Well, if you want me to be petty and stupid, I will tell you that from time to time, we\n\n2:04:07.740 --> 2:04:20.060\n also wonder why our book... Like all books, people can take issue with it, but we thought\n\n2:04:20.060 --> 2:04:24.220\n it would be a bigger hit, that it would be more widely read.\n\n2:04:24.220 --> 2:04:31.020\n It's funny because I've... I don't know if I have good examples because I forgot already,\n\n2:04:31.020 --> 2:04:37.660\n but I'm often saddened by Franz Kafka. I think he wasn't known in his life, but I\n\n2:04:37.660 --> 2:04:46.220\n always wonder these great... Some of the greatest books ever written are completely unknown\n\n2:04:46.220 --> 2:04:53.100\n during the author's lifetime. And it's like, man, for some reason, it's again, it's that\n\n2:04:53.100 --> 2:04:56.220\n identity thing. I think, man, that sucks.\n\n2:04:56.220 --> 2:05:04.060\n Well, I'm comforted by that. So Van Gogh sold one painting in his life, and evidently Thoreau\n\n2:05:04.060 --> 2:05:12.700\n sold like 75 copies of Walden. Nietzsche's books did not sell well.\n\n2:05:12.700 --> 2:05:19.340\n And how did Ernest Becker sell? His books are published by the free press\n\n2:05:19.340 --> 2:05:26.060\n and have sold more than any other books that they have published.\n\n2:05:26.060 --> 2:05:30.300\n So what does that mean? It's a lot? I don't know if it's like Jordan Peterson\n\n2:05:30.300 --> 2:05:36.460\n Millions, but it's hundreds of thousands. Was he respected? I just don't see him...\n\n2:05:37.180 --> 2:05:43.740\n Okay. I don't see him brought up as like in the top 10 philosophers of...\n\n2:05:43.740 --> 2:05:49.660\n No, not at all. So how far away is he? Is he in the top 100\n\n2:05:49.660 --> 2:05:51.180\n for people? I don't think so.\n\n2:05:51.180 --> 2:05:53.740\n He's not brought up that often. Because again...\n\n2:05:53.740 --> 2:05:55.980\n Like your work is brought up more often. Yeah.\n\n2:05:55.980 --> 2:06:03.420\n I think he's one of the great philosophers of the 20th century.\n\n2:06:03.420 --> 2:06:09.980\n So what we say, Lex, is that our goal, certainly when we first started and now\n\n2:06:10.540 --> 2:06:16.140\n just as much actually, but what I say at all my talks is, look, if these ideas have\n\n2:06:16.140 --> 2:06:22.460\n interest you enough to go read Ernest Becker, then this has been good. I consider him to be\n\n2:06:22.460 --> 2:06:30.940\n one of the most important voices of the 20th century who does not get the attention that\n\n2:06:30.940 --> 2:06:40.380\n he deserves. Similarly, our work I believe to be important because point by point we provide\n\n2:06:40.380 --> 2:06:51.900\n empirical corroboration for all of the claims. So that's literally the students that read\n\n2:06:51.900 --> 2:06:57.660\n The Denial of Death and then Escape from Evil. They're like, yeah, wow, every chapter of the\n\n2:06:57.660 --> 2:07:04.220\n book, you have studies. And I'm like, yeah, because for 40 years, if a Skidmore student said,\n\n2:07:04.220 --> 2:07:08.700\n oh, that's gotta be bullshit. I'm like, well, let's do a study.\n\n2:07:08.700 --> 2:07:12.460\n Let's do a study. And my own dreams are in creating\n\n2:07:14.140 --> 2:07:20.700\n robots and artificial intelligence systems that a human can love. And I think there's something\n\n2:07:20.700 --> 2:07:26.620\n about mortality and fear mortality that is essential for implementing in our AI systems.\n\n2:07:26.620 --> 2:07:38.780\n And so maybe can you comment on that? So this is a different perspective on your work,\n\n2:07:38.780 --> 2:07:41.340\n which is like, how do we engineer a human?\n\n2:07:41.340 --> 2:07:45.580\n Yeah, so, no, this is awesome, Lex. I'm delighted that you said that. First of all,\n\n2:07:45.580 --> 2:07:50.700\n and I may have mentioned this to you, and I can't remember because I am seeing now, when you first\n\n2:07:50.700 --> 2:07:59.900\n contacted me, I had just been told I have to learn more about your work because I'm working with some\n\n2:07:59.900 --> 2:08:12.860\n very talented people in New York and they're writing a screenplay for a movie about an artificial\n\n2:08:12.860 --> 2:08:24.220\n intelligence. It's a female AI set in like 30 years in the future. And basically the little\n\n2:08:24.220 --> 2:08:29.980\n twist, this is how I had to read Heidegger. So these people call me and they're like,\n\n2:08:29.980 --> 2:08:38.380\n we're making a movie. It's based on Becker and your work and Heidegger and this other\n\n2:08:38.380 --> 2:08:44.540\n philosopher, Levinas, and then another philosopher, Silvia Benzo, who's an Italian philosopher.\n\n2:08:45.420 --> 2:08:53.260\n And the long short story is the movie is about supposedly the most advanced artificial\n\n2:08:53.260 --> 2:09:02.060\n intelligence entity, an embodied one, and who…\n\n2:09:02.060 --> 2:09:03.020\n Human form?\n\n2:09:03.020 --> 2:09:15.100\n Human form, who finds out, who is having essentially existential anxieties. And I think\n\n2:09:15.100 --> 2:09:19.740\n the project is called A Dinner with Her or something, and it doesn't really matter, but the\n\n2:09:19.740 --> 2:09:34.460\n punchline is that she finds out that her creator has made her mortal. And so the question is what\n\n2:09:34.460 --> 2:09:47.580\n happens phenomenologically and behaviorally to an artificial intelligence who now knows that it's\n\n2:09:47.580 --> 2:09:55.420\n mortal? And it's actually the same question that you're posing. And that is, is that necessary\n\n2:09:57.420 --> 2:10:03.340\n in order for an AI to approximate humanity?\n\n2:10:03.340 --> 2:10:08.780\n Yeah, I think, yeah. So the intuition, again, it's unknown, but I think it's absolutely,\n\n2:10:08.780 --> 2:10:17.580\n I think it's absolutely necessary. A lot of people, the same kind of shallow thinking that people\n\n2:10:17.580 --> 2:10:23.420\n have about our own end of life, our own death, is the same way people think of, I think, about\n\n2:10:23.420 --> 2:10:30.380\n artificial intelligence. It's like, well, okay, so yeah, so within the system, there's a terminal\n\n2:10:30.380 --> 2:10:38.700\n position where there's a point at which it ends, the program ends, there's a goal state, there's a,\n\n2:10:38.700 --> 2:10:49.180\n you reached an end point. But the thing is, making that end a thing that's also within the program,\n\n2:10:49.900 --> 2:10:57.500\n like making the thing, and then it's also the mystery of it. So the thing is, we don't know\n\n2:10:57.500 --> 2:11:06.140\n what the hell this death thing is. I mean, it's not like we, I mean, the program doesn't give\n\n2:11:06.140 --> 2:11:13.740\n us information about the meaning of it all. And that's where the terror is. And it feels like,\n\n2:11:13.740 --> 2:11:21.020\n I mean, in the language that you would think about is the terror of this death, or like\n\n2:11:21.020 --> 2:11:24.860\n anticipation of it, or thinking about it, is the creative force that builds everything.\n\n2:11:24.860 --> 2:11:32.380\n Right. And that feels like, you know, that feels really important to implement. Again,\n\n2:11:32.380 --> 2:11:37.820\n it's very difficult to know how to do technically, currently, but it's important to think about.\n\n2:11:37.820 --> 2:11:45.340\n What I find is, you mentioned like screenplays and so on, is sci fi folks and philosophers are the\n\n2:11:45.980 --> 2:11:50.700\n the only ones thinking about it currently. And that's what these folks have convinced me.\n\n2:11:50.700 --> 2:12:00.220\n Yeah. And engineers aren't, which is, I get, yeah, most of the things I talk about, I get kind of\n\n2:12:01.740 --> 2:12:03.980\n people roll their eyes from the engineer perspective.\n\n2:12:03.980 --> 2:12:08.620\n Not these folks. They're like, because again, I saw your name and they're like,\n\n2:12:08.620 --> 2:12:11.980\n wait a minute, I've just seen that. They're like, here's someone.\n\n2:12:13.020 --> 2:12:14.220\n You should check out.\n\n2:12:14.220 --> 2:12:17.420\n Yeah. So this was a delightful conference.\n\n2:12:17.420 --> 2:12:17.980\n Yeah.\n\n2:12:17.980 --> 2:12:26.220\n I was a huge fan of your work and Ernest Becker. And it's funny that not enough people are\n\n2:12:27.900 --> 2:12:33.340\n talking about it. I don't know what to do with that. I think that there's a possibility to create\n\n2:12:33.340 --> 2:12:37.500\n real deep, meaningful connections between AI systems and humans.\n\n2:12:37.500 --> 2:12:38.060\n Absolutely.\n\n2:12:38.060 --> 2:12:44.300\n And I think some of these things of fear mortality are essential, are essential for\n\n2:12:44.300 --> 2:12:49.820\n the element of human experience. I don't, I don't think it might be essential to create\n\n2:12:49.820 --> 2:12:55.500\n general intelligence, like very intelligent machines, but to create a machine that connects\n\n2:12:55.500 --> 2:12:57.580\n to human in some deep way.\n\n2:12:57.580 --> 2:13:07.340\n What's your view, not to make me the interviewer, but what's your view about machine ethics? Can\n\n2:13:07.340 --> 2:13:16.940\n you imagine an ethical AI without some semblance of finitude, let's say?\n\n2:13:16.940 --> 2:13:26.220\n Well, I think ethics is a, there's a trolley problem that's often used in the work that\n\n2:13:26.220 --> 2:13:30.540\n I've done at MIT with autonomous vehicles in particular.\n\n2:13:30.540 --> 2:13:31.740\n Oh, yeah, yeah.\n\n2:13:31.740 --> 2:13:38.860\n That people, I think they offload, they ask, like, how would a machine deal with an ethical\n\n2:13:38.860 --> 2:13:43.740\n situation that they themselves, the humans don't know how to deal with?\n\n2:13:43.740 --> 2:13:44.380\n Exactly.\n\n2:13:44.380 --> 2:13:53.820\n And so I don't know if a machine is able to do a better job on difficult ethical questions,\n\n2:13:53.820 --> 2:14:00.300\n but I certainly think to behave properly and effectively in this world is a very important\n\n2:14:00.300 --> 2:14:06.140\n thing. Effectively in this world, it needs to be, have a fear of mortality and like be\n\n2:14:06.140 --> 2:14:10.940\n able to even dance. Because I don't think you can solve ethical problems, but you have\n\n2:14:10.940 --> 2:14:17.740\n to, I think like ethics is like a dance floor. You have to just, you have to dance properly\n\n2:14:17.740 --> 2:14:21.180\n with the rest of the humans. Like if people are dancing tango, you have to dance in the\n\n2:14:21.180 --> 2:14:27.180\n same kind of way. And for that, you have to have a fear of mortality. Like I think of,\n\n2:14:27.180 --> 2:14:32.620\n more practically speaking, as I said, autonomous vehicles, like the way you interact with pedestrians\n\n2:14:33.820 --> 2:14:40.860\n fundamentally has to have a sense of mortality. So when pedestrians cross the road,\n\n2:14:42.940 --> 2:14:48.780\n now I've watched, well, certainly 100 plus hours of pedestrian videos.\n\n2:14:48.780 --> 2:14:56.780\n There's a kind of social contract where you walk in front of a car and you're putting\n\n2:14:56.780 --> 2:14:58.860\n your life in the hands of another human being.\n\n2:14:58.860 --> 2:14:59.820\n Yes, that's right.\n\n2:14:59.820 --> 2:15:06.220\n And like death is in the car, in the game that's being played, death is right there.\n\n2:15:07.180 --> 2:15:11.820\n It's part of the calculus. It's not, but it's not like a simple calculus. It's not a simple\n\n2:15:11.820 --> 2:15:20.780\n equation. I mean, I don't know what it is, but it's in there and it has to be part of\n\n2:15:20.780 --> 2:15:25.900\n the optimization problem. Like it's not as simple as, so from the computer vision, from\n\n2:15:25.900 --> 2:15:34.060\n the artificial intelligence perspective, it's detecting there's a human estimating the trajectory,\n\n2:15:34.060 --> 2:15:40.780\n like treating everything like it's a billiard balls, as opposed to like being able to calculate\n\n2:15:40.780 --> 2:15:47.580\n it, being able to construct an effective model, the world model of what the person's thinking,\n\n2:15:47.580 --> 2:15:52.300\n what they're going to do, what are the different possibilities of how the scene might evolve,\n\n2:15:52.300 --> 2:16:00.060\n I think requires having some sense of, yeah, fear of fear of mortality, of mortality.\n\n2:16:00.060 --> 2:16:05.820\n I don't see the, the thing is, I think it's really important to think about, I can be\n\n2:16:05.820 --> 2:16:12.620\n honest enough to say that it's, I haven't been able to figure out how to engineer any\n\n2:16:12.620 --> 2:16:17.660\n of these things. But I do think it's really, really important. Like I have, so I have a\n\n2:16:17.660 --> 2:16:24.060\n bunch of Roombas here. I can show it to you after that. Roombas is a robot that does\n\n2:16:25.740 --> 2:16:32.540\n vacuums the floor and I've had them make different sounds. Like I had them scream in pain\n\n2:16:32.540 --> 2:16:45.980\n and it, you immediately anthropomorphize and it creates, I don't know, knowing that they\n\n2:16:45.980 --> 2:16:52.860\n can feel pain. See, I'm speaking, like knowing that I immediately imagine that they can feel\n\n2:16:52.860 --> 2:16:59.660\n pain and it immediately draws me closer to them, the human experience. And that there's\n\n2:16:59.660 --> 2:17:06.380\n something in that that should be engineered in our systems, it feels like. I believe,\n\n2:17:06.380 --> 2:17:11.500\n personally, I don't know what you think, but I believe it's possible for a robot and a\n\n2:17:11.500 --> 2:17:14.380\n human to fall in love, for example, in the future.\n\n2:17:14.380 --> 2:17:17.100\n Oh, I think it's, yeah, it's already there.\n\n2:17:18.780 --> 2:17:23.740\n No, there's a certain kind of deep connection with technology. I mean, a real, like you\n\n2:17:23.740 --> 2:17:24.700\n would choose to marry.\n\n2:17:24.700 --> 2:17:30.140\n I mean, again, it sounds, I'll find a book title and I'll send it to you. And it's a\n\n2:17:30.140 --> 2:17:41.820\n serious consideration of people who started out with these sex dolls, but it turned into\n\n2:17:41.820 --> 2:17:48.220\n a relationship of enduring significance that the woman who wrote the book is not willing\n\n2:17:48.220 --> 2:17:50.220\n to dismiss as a perversion.\n\n2:17:50.220 --> 2:17:56.860\n Yeah, that's what, you know, people kind of joke about sex robots, which is funny. Like,\n\n2:17:56.860 --> 2:18:00.460\n it's a funny, I mean, there's a lot of stuff about robots. It's just kind of fun to talk\n\n2:18:00.460 --> 2:18:06.700\n about that is not necessarily connected to reality. People joke about sex robots, but\n\n2:18:06.700 --> 2:18:12.220\n if you actually look how sex robots, which are pretty rare these days, are used, they're\n\n2:18:12.220 --> 2:18:16.060\n not used by people who want sex.\n\n2:18:16.060 --> 2:18:16.860\n Precisely.\n\n2:18:16.860 --> 2:18:17.820\n They're actually,\n\n2:18:17.820 --> 2:18:18.780\n They're kind of,\n\n2:18:18.780 --> 2:18:20.460\n They're actually,\n\n2:18:20.460 --> 2:18:21.420\n They're companions.\n\n2:18:21.420 --> 2:18:22.620\n They become companions.\n\n2:18:22.620 --> 2:18:22.860\n Yeah.\n\n2:18:24.380 --> 2:18:29.340\n It's, yeah, it's fascinating. And they're just, we're not even talking about any kind\n\n2:18:29.340 --> 2:18:33.500\n of intelligence. We're talking about just, I mean, human beings seek companionships.\n\n2:18:33.500 --> 2:18:37.740\n We're deeply lonely. I mean, that was the other sense I have that I don't know if I\n\n2:18:37.740 --> 2:18:42.380\n can articulate clearly. You can probably do a better job, but I have a sense that there's\n\n2:18:42.380 --> 2:18:44.620\n a deep loneliness within all of us.\n\n2:18:44.620 --> 2:18:45.100\n Absolutely.\n\n2:18:45.740 --> 2:18:48.540\n In the face of death, it feels like we're alone.\n\n2:18:48.540 --> 2:18:56.700\n So, you know, the, what drew me to the existential take on things, Lex, was the,\n\n2:19:00.460 --> 2:19:08.380\n who is it, Rollo May and Erwin Yallem write about existentialism and they're like, look,\n\n2:19:09.820 --> 2:19:16.380\n what, there's different flavors of existentialism, but they all have in common, what is it,\n\n2:19:16.380 --> 2:19:26.620\n four universal concerns. The overriding one is about death. And that next is choice and\n\n2:19:26.620 --> 2:19:33.980\n responsibility. The next one is existential isolation. And they're like, that's one of the\n\n2:19:35.420 --> 2:19:41.020\n things about consciousness that, and the last one is meaninglessness, but the existential\n\n2:19:41.020 --> 2:19:55.100\n isolation point is, you know, we are by virtue of consciousness able to apprehend that unless\n\n2:19:55.100 --> 2:20:03.660\n you're a Siamese twin, you are fundamentally alone. And because it is claimed, it's Eric\n\n2:20:03.660 --> 2:20:11.900\n Fromm in a book called Escape from Freedom. He's like, look, you're smart enough to know that the\n\n2:20:11.900 --> 2:20:17.020\n most direct way that we typically communicate with our fellow human beings is through language.\n\n2:20:18.140 --> 2:20:25.900\n But you also know that language is a pale shadow of the totality of our interior\n\n2:20:25.900 --> 2:20:33.980\n phenomenological existence. Therefore, there's always going to be times in our lives where even\n\n2:20:33.980 --> 2:20:40.620\n under the best of circumstances, you could be trying desperately to convey your thoughts and\n\n2:20:40.620 --> 2:20:47.100\n feelings and somebody listening could be like, yeah, I get it, I get it, I get it. And you're\n\n2:20:47.100 --> 2:20:55.420\n like, you have no fucking idea what I'm talking about. So you can be desperately lonely in a house\n\n2:20:55.420 --> 2:21:00.300\n where you live with 10 people in the middle of Tokyo where there's millions.\n\n2:21:02.940 --> 2:21:06.540\n Yeah, it's the Great Gatsby. You could be alone in a big party.\n\n2:21:06.540 --> 2:21:07.180\n Exactly.\n\n2:21:07.820 --> 2:21:12.620\n Maybe this is a small tangent, but let me ask you on the topic of academia,\n\n2:21:13.900 --> 2:21:20.860\n you're kind of, we talked about Jordan Peterson, there's a lot of sort of renegade type of thinkers,\n\n2:21:20.860 --> 2:21:29.580\n certainly in psychology, but it applies in all disciplines. What are your thoughts about academia\n\n2:21:29.580 --> 2:21:40.940\n being a place to harbor people like yourself? People who think deeply about things, who are\n\n2:21:40.940 --> 2:21:46.780\n not constrained by sort of the, I don't think you're quite controversial.\n\n2:21:46.780 --> 2:21:47.580\n No, not really.\n\n2:21:47.580 --> 2:21:55.660\n But you are a person who thinks deeply about things and it feels like academia can sometimes\n\n2:21:55.660 --> 2:21:56.700\n stifle that.\n\n2:21:56.700 --> 2:22:09.420\n I think so. So my concern right now, Lex, for young scholars is that the restrictions and\n\n2:22:09.420 --> 2:22:17.020\n expectations are such that it's highly unlikely that anybody will do anything\n\n2:22:18.860 --> 2:22:29.740\n of great value or innovation except for, and this is not a bad thing, but stepwise improvement\n\n2:22:29.740 --> 2:22:38.300\n of existing paradigms. So in simple English, I went to Princeton for a job interview 40 years\n\n2:22:38.300 --> 2:22:42.940\n ago and they're like, what are you going to do if we give you a job? And I'm like, I don't know,\n\n2:22:42.940 --> 2:22:52.380\n I want to think about it and read. And I saw that that interview was over, the window of\n\n2:22:52.380 --> 2:22:59.660\n opportunity shut in my face and they actually called my mentors and they're like, what are\n\n2:22:59.660 --> 2:23:03.740\n you doing? Tell this guy to buy some pants. I had hair down to my waist also. He's like,\n\n2:23:03.740 --> 2:23:12.620\n this guy looks like Charles Manson in Jesus. But the expectation is that you come to a\n\n2:23:12.620 --> 2:23:18.780\n post, you start publishing so that you can get grants.\n\n2:23:20.060 --> 2:23:24.060\n That's certainly true. But there's also kind of a behavioral thing. You said like long hair.\n\n2:23:24.060 --> 2:23:30.220\n There's a certain style of the way you're supposed to behave. For example, I'm wearing\n\n2:23:30.220 --> 2:23:38.300\n a suit. It sounds weird, but I feel comfortable in this. I wore it when I was teaching at MIT,\n\n2:23:38.300 --> 2:23:47.500\n I wore it to meetings and so on, the different, sometimes a blue and red tie, but that was an\n\n2:23:47.500 --> 2:23:52.220\n outsider thing to do at MIT. So there was a strong pressure to not wear a suit.\n\n2:23:52.220 --> 2:23:53.020\n No, that's right.\n\n2:23:53.020 --> 2:23:57.900\n And there's a pressure to behave, to have a hair thing, the way you wear your hair,\n\n2:23:57.900 --> 2:24:04.140\n the way you, this isn't like a liberal or a left or anything. It's just in tribes.\n\n2:24:04.140 --> 2:24:04.780\n That's right.\n\n2:24:04.780 --> 2:24:12.780\n And academia to me or a place, any place that dreams of having like renegade free thinkers,\n\n2:24:12.780 --> 2:24:20.620\n like really deep thinkers should in fact, like glorify the outsider. Should welcome\n\n2:24:20.620 --> 2:24:25.500\n just, should welcome people that don't fit in.\n\n2:24:25.500 --> 2:24:26.060\n Yeah.\n\n2:24:26.060 --> 2:24:30.860\n No, that sounds weird, but I can just imagine an interview with at Princeton,\n\n2:24:32.540 --> 2:24:38.460\n I can imagine why aren't people, why aren't you at Harvard, for example, or MIT?\n\n2:24:40.300 --> 2:24:48.300\n Yeah. Well, so that, look, I would love to, I haven't lectured at MIT, but I've lectured at\n\n2:24:48.300 --> 2:24:54.540\n Harvard. I've gotten to lecture at almost every place that wouldn't consider me for a job.\n\n2:24:55.500 --> 2:25:04.780\n And I, well, a few things. I'm lucky because I go to Princeton, I'm like, I don't know what I\n\n2:25:04.780 --> 2:25:08.780\n want to do. And then two days later I go to Skidmore and I'm like, I don't know what I want\n\n2:25:08.780 --> 2:25:15.340\n to do. And they offer me a job later that day, which I declined for months because of the\n\n2:25:15.340 --> 2:25:22.860\n extraordinary pressure of my mentors who right mindedly felt that I wouldn't get much done there.\n\n2:25:24.140 --> 2:25:31.020\n But what they told me at Skidmore was take your time, show up for your classes and don't molest\n\n2:25:31.020 --> 2:25:35.580\n barnyard animals and you'll probably get tenure. And I'm like, I'll show up for my classes.\n\n2:25:35.580 --> 2:25:37.580\n We'll talk about it.\n\n2:25:37.580 --> 2:25:39.180\n That was the negotiation.\n\n2:25:39.180 --> 2:25:47.820\n Yeah, I negotiated, I drove a hard bargain. But honestly, Lex, that's, I feel I'm very committed\n\n2:25:47.820 --> 2:25:57.100\n to Skidmore because I was given tenure when our first terror management paper wasn't published.\n\n2:25:57.100 --> 2:26:03.420\n It took eight years to publish. It was rejected at every journal. And I submitted it as like a\n\n2:26:03.420 --> 2:26:09.900\n purple ditto sheet thing. I'm like, here's what I've been doing. Here's the reviews. Here's why\n\n2:26:09.900 --> 2:26:15.100\n I think this is still a pretty good idea. And I don't know that this would happen even at Skidmore\n\n2:26:15.100 --> 2:26:23.020\n anymore. But I was very lucky to be given the latitude and to be encouraged. I took classes\n\n2:26:23.020 --> 2:26:29.180\n at Skidmore. That's how I learned all this stuff. I graduated, I got a PhD unscathed by knowledge.\n\n2:26:29.180 --> 2:26:39.420\n We were great statisticians and methodologists, but we didn't have any substance. And I don't\n\n2:26:39.420 --> 2:26:45.980\n mean this cynically, but we were trained in a method in search of a question. So I appreciate\n\n2:26:46.940 --> 2:26:54.700\n having five years at Skidmore basically to read books. And I also appreciate that I look like\n\n2:26:54.700 --> 2:27:10.300\n this 40 years ago. And my view is that this is how I comported myself. Other people, the guy I learned\n\n2:27:10.300 --> 2:27:18.060\n the most from at Skidmore is now dead, a history professor, Ted Kuroda. He wore a bow tie. And\n\n2:27:18.060 --> 2:27:25.660\n there's another guy, Darnell Rucker, who taught me about philosophy. And he was very proper. And\n\n2:27:25.660 --> 2:27:34.620\n he had his jacket with the leather patches. But these guys weren't pompous at all. They were,\n\n2:27:34.620 --> 2:27:44.860\n this is the way I am. And I always felt that that's important that somebody who looks at you\n\n2:27:44.860 --> 2:27:52.220\n and says, oh, what a stiff, he's probably an MBA. Well, they're wrong. And someone who looks at me,\n\n2:27:52.860 --> 2:27:58.620\n when I first got to Skidmore, other professors would ask when I'd be coming to their office to\n\n2:27:58.620 --> 2:28:03.740\n empty the garbage. They just assumed, as in my twenties, they assumed I was housekeeping.\n\n2:28:04.540 --> 2:28:10.940\n I always felt that was important that the students learn not to judge an idea by the appearance of\n\n2:28:10.940 --> 2:28:21.660\n the person who pervades it. I guess this is such a high concern now because I personally still\n\n2:28:22.220 --> 2:28:27.580\n have faith that academia is where the great geniuses will come from and great ideas.\n\n2:28:27.580 --> 2:28:35.340\n I love hearing you say that. I still, and it's one of the reasons why I'm really\n\n2:28:35.340 --> 2:28:44.540\n apprehensive about the future of education right now in the context of the pandemic is that a lot\n\n2:28:44.540 --> 2:28:53.100\n of folks, a lot of these are Google type people who I don't, they're geniuses also, but I don't\n\n2:28:53.100 --> 2:29:00.220\n like this idea that all learning can be virtual and that much could happen. I'm big on embodied\n\n2:29:00.220 --> 2:29:08.060\n environments with actual humans interacting. I mean, there's so much to the university education,\n\n2:29:08.060 --> 2:29:16.540\n but I think the key part is the mentorship that occurs somehow at the human level. Like I've\n\n2:29:16.540 --> 2:29:25.740\n gotten a lot of flack, like this conversation where in person now, and I've even with Edward\n\n2:29:25.740 --> 2:29:33.660\n Snowden who done all interviews remote, I'm a stickler to in person. It has to be in person\n\n2:29:33.660 --> 2:29:38.300\n like, and a lot of people just don't get it. They're like, well, why can't, this is so much\n\n2:29:38.300 --> 2:29:45.420\n easier. Like why go through the pain? Like I've traveled, I'm traveling in the next month to Paris\n\n2:29:46.300 --> 2:29:52.220\n for a single stupid conversation. Nobody cares about just to be in person. Well, it's important\n\n2:29:52.220 --> 2:30:01.100\n to me. I honestly, I was like this, and thank you for coming down to it. It's my pleasure,\n\n2:30:01.100 --> 2:30:05.660\n but again, it's very self serving. I've enjoyed this. I knew I was going to, but\n\n2:30:06.620 --> 2:30:13.020\n it's not about our enjoyment per se. Again, at the risk of sounding cavalier,\n\n2:30:13.020 --> 2:30:24.140\n there are a host of factors beyond verbal that I don't believe can be adequately captured. I don't\n\n2:30:24.140 --> 2:30:35.260\n care how much the acuity is decent on a zoom conversation. I feel again, I felt within five\n\n2:30:35.260 --> 2:30:45.340\n minutes that this was going to be for me easy in the sense that I could speak freely. I just don't\n\n2:30:45.340 --> 2:30:52.540\n see that happening so easily from a distance. Yeah, I tend to, well, I'm hopeful. I agree with\n\n2:30:52.540 --> 2:30:58.140\n you on the current technology, but I am hopeful on like some others on the technology eventually\n\n2:30:58.140 --> 2:31:03.740\n being able to create that kind of experience or quite far away from that, but it might be\n\n2:31:03.740 --> 2:31:12.460\n able to, my hope is, you know, I'm hopeful. I was at Microsoft in Seattle and I can't remember why.\n\n2:31:13.260 --> 2:31:24.220\n And no, I can't. I, that's how I'm in my early Mr. Magoo phase. And somebody there was showing us\n\n2:31:24.220 --> 2:31:35.260\n like a virtual wall where the entire wall, you know, when you're talking to somebody, so it's\n\n2:31:35.260 --> 2:31:43.500\n life size and they were beginning the, get the appearance of motion and stuff. It looked pretty.\n\n2:31:44.300 --> 2:31:47.820\n Yeah. With virtual reality too, I don't know if you've ever been inside a virtual world.\n\n2:31:47.820 --> 2:31:56.940\n It's to me, it's I can just see the future. It's quite real in terms of like a terror of death.\n\n2:31:57.500 --> 2:32:03.580\n I'm afraid of heights. Me too. And there's, I don't know if you've ever tried, you should,\n\n2:32:03.580 --> 2:32:07.500\n if you haven't, there's a virtual reality experience where you can walk a plank. Yeah.\n\n2:32:07.500 --> 2:32:15.340\n You can look down and man, I was on the ground like, I was like, I was afraid. I was deeply afraid.\n\n2:32:15.340 --> 2:32:23.100\n I was, it was, it was as real as, as anything else could be. And I mean, these are very early days\n\n2:32:23.100 --> 2:32:30.460\n of that technology, relatively speaking. So yeah. I mean, I don't know what to do with that. Same\n\n2:32:30.460 --> 2:32:35.820\n with like crossing the street, we did these experiments across the street in front of a car\n\n2:32:35.820 --> 2:32:45.900\n and, you know, it's being run over by a car. It's terrifying. Yeah. It's just that, yeah. So there's\n\n2:32:45.900 --> 2:32:53.340\n a rich experience to be created there. We're not there yet, but, yeah. And I've seen a lot of people\n\n2:32:53.340 --> 2:32:59.020\n try, like you said, the Google folks, Silicon Valley folks try to create a virtual online\n\n2:32:59.020 --> 2:33:04.380\n education. I don't know. I think they've raised really important questions. Absolutely. Like what\n\n2:33:04.380 --> 2:33:12.940\n makes the education experience fulfilling? What makes it effective? Yeah. These are important\n\n2:33:12.940 --> 2:33:22.460\n questions. And I think what they highlight is we have no clue. Like, there's, Thomas Sowell\n\n2:33:24.460 --> 2:33:31.900\n wrote a book about, a recent book on charter schools. Yeah. I would like to talk to him. Yeah,\n\n2:33:31.900 --> 2:33:37.900\n he's an interesting guy. We will disagree about a lot, but respectfully. Yeah. Such a powerful mind.\n\n2:33:37.900 --> 2:33:46.220\n Yeah. But he, I need to read, I've only heard him talk about the book, but he argues quite\n\n2:33:46.780 --> 2:33:57.020\n seemingly effectively that the public education system is broken. That we blame, he basically says\n\n2:33:57.020 --> 2:34:05.820\n that we kind of blame, like the conditions or the environment, but the upbringing of people,\n\n2:34:05.820 --> 2:34:13.100\n like parenting, blah, blah, blah, like the set of opportunities. But okay, putting that aside,\n\n2:34:13.100 --> 2:34:20.620\n it seems like charter schools, no matter who it is that attends them, does much better than in\n\n2:34:20.620 --> 2:34:27.900\n public schools. And he puts a bunch of data behind it. And in his usual way, as you know, just is\n\n2:34:27.900 --> 2:34:34.300\n very eloquent in arguing his points. Yeah. So that to me just highlights, man, we don't, education\n\n2:34:34.300 --> 2:34:39.660\n is like one of the most important, it's probably the most important thing in our civilization,\n\n2:34:39.660 --> 2:34:49.260\n and we're doing a shitty job of it. Yeah. In academia, in university education and, you know,\n\n2:34:49.260 --> 2:34:55.340\n younger education, the whole thing. The whole thing. And yet, we value\n\n2:34:59.580 --> 2:35:05.820\n just about anyone or anything more than educators. You know, part of it is just the\n\n2:35:07.420 --> 2:35:18.380\n relatively low regard that Americans have for teachers. Also similarly, like just people\n\n2:35:18.380 --> 2:35:26.620\n of service. I think great teachers are the greatest thing in our society. And I would say,\n\n2:35:26.620 --> 2:35:33.100\n now on a controversial note, like Black Lives Matter, you know, great police officers is the\n\n2:35:33.100 --> 2:35:40.620\n greatest thing in our society. Also, like all people that do service, we undervalue cops severe,\n\n2:35:40.620 --> 2:35:47.260\n like this whole defund the police is missing the point. And it's a stupid word. I'm with you on\n\n2:35:47.260 --> 2:35:54.940\n that, Lex. Our neighbors to one side of our house are three generations of police, our neighbors\n\n2:35:54.940 --> 2:36:08.940\n across the street are police. They know my, you know, political predilections. And we've gotten\n\n2:36:08.940 --> 2:36:14.940\n along fine for 30 years. And I go out and tell them every day, you know, when you go in today,\n\n2:36:14.940 --> 2:36:23.980\n you tell the people on the force that I appreciate what they're doing. I think it's\n\n2:36:25.500 --> 2:36:36.620\n really important to not tribalize those concerns. I mean, we mentioned so many brilliant books and\n\n2:36:36.620 --> 2:36:45.900\n philosophers, but it'd be nice to sort of in a focused way, try to see if we can get some\n\n2:36:45.900 --> 2:36:54.140\n recommendations from you. So what three books, technical or fiction or philosophical had a big\n\n2:36:54.140 --> 2:37:02.300\n impact in your life and you would recommend. Spent four hours driving here, perseverating about\n\n2:37:02.300 --> 2:37:08.540\n that. I didn't, I, everything else you sent me as fine. And I actually, I skimmed it and I'm like,\n\n2:37:08.540 --> 2:37:14.460\n I don't want to look at it because I want, I want us to talk. The ones in blue. I'm like, all right.\n\n2:37:15.340 --> 2:37:24.060\n And you know, I've already said that I've found backers work and I put the denial of death out\n\n2:37:24.060 --> 2:37:31.260\n there. Um, is that his best, sorry, a small tangent. Is there other books that of his?\n\n2:37:31.260 --> 2:37:35.740\n Yes. If I could have this count as one that the, the birth and death of meaning,\n\n2:37:36.380 --> 2:37:44.220\n the denial of death and escape from evil are three books of Ernest Becker's that I believe to\n\n2:37:44.220 --> 2:37:53.340\n all be profound in a, in a little sort of brief dance around topics. Um, I've only read denial\n\n2:37:53.340 --> 2:37:57.980\n of death. Like, well, how do those books connect in here? Yeah. Nice. So the, the birth and death\n\n2:37:57.980 --> 2:38:07.180\n of meaning is where Becker situates his thinking in more of an evolutionary foundation. So I like\n\n2:38:07.180 --> 2:38:16.060\n that for that reason. Escape from evil is where he applies the ideas in the denial of death\n\n2:38:17.100 --> 2:38:27.260\n more directly, um, to economic matters and to inequality and also to our inability to\n\n2:38:27.260 --> 2:38:32.620\n peacefully coexist with other folks who don't share our beliefs. So I would put Ernest Becker\n\n2:38:32.620 --> 2:38:42.060\n out there as one. Um, I also like novels a lot. And here I was like, God damn it. No matter what\n\n2:38:42.060 --> 2:38:48.540\n I say, I'm going to be like, yes, but, but the existentialists, do you like all those folks?\n\n2:38:48.540 --> 2:38:56.540\n Come on. You like that literary existential? I do. But I mean, you know, I, I've read all those\n\n2:38:56.540 --> 2:39:03.100\n books. I will tell you the last line of the plague. We learn in times of pestilence that there's more\n\n2:39:03.100 --> 2:39:10.620\n to admire in men than to despise. And I love that. Yeah. Plagues such a, I don't know. I,\n\n2:39:10.620 --> 2:39:17.260\n I find the plague is a brilliant before, before, uh, the plague has come to us in 2020.\n\n2:39:17.260 --> 2:39:25.420\n I, it was just a book about love about, but I'll toss a one that may be less known to folks. I'm\n\n2:39:25.420 --> 2:39:32.540\n enamored with a novel by a woman named Carson McCullers written in 1953 called clock without\n\n2:39:32.540 --> 2:39:41.420\n hands. And I find it a brilliant literary depiction of many of the ideas that we have spoken about.\n\n2:39:41.420 --> 2:39:42.060\n Fiction?\n\n2:39:42.060 --> 2:39:43.100\n Fiction. Yeah.\n\n2:39:43.100 --> 2:39:45.100\n What's, uh, what kind of ideas are we talking about?\n\n2:39:45.100 --> 2:39:51.100\n Oh, it, it, all of the existential ideas that we have encountered today,\n\n2:39:51.100 --> 2:39:57.980\n but in the context of a story of someone who finds out that he is terminally ill,\n\n2:39:59.020 --> 2:40:06.300\n it's set in the South and the, um, heyday of like segregation. So there's a lot of social issues,\n\n2:40:06.300 --> 2:40:14.060\n a lot of existential issues, but it's basically a novel, a fictional account of someone who finds\n\n2:40:14.060 --> 2:40:23.500\n out that they're terminally ill and who reacts originally as, um, uh, you might expect anyone,\n\n2:40:23.500 --> 2:40:31.580\n uh, becomes more, um, hostile to people who are different, like petty and stupid denies that\n\n2:40:32.220 --> 2:40:41.020\n anything's happening. But, uh, as the book goes on and he comes more to terms, um, with his own\n\n2:40:41.020 --> 2:40:50.700\n mortality, um, it ends lovingly. And then, uh, back to your idea about, you know, love being\n\n2:40:51.900 --> 2:40:53.660\n incredibly potent.\n\n2:40:53.660 --> 2:40:57.980\n That's the, the nice thing, as you mentioned, uh, before with, with Heidegger,\n\n2:40:59.340 --> 2:41:06.780\n I really liked that idea. And I've seen that in people who are terminally ill is they bring,\n\n2:41:06.780 --> 2:41:14.380\n you know, the idea of death becomes, uh, current. It becomes like a thing, you know, I could die.\n\n2:41:14.380 --> 2:41:20.860\n I really liked that idea. I, I can die. Not just tomorrow, but like now, now, now.\n\n2:41:20.860 --> 2:41:21.340\n Yeah.\n\n2:41:21.340 --> 2:41:28.140\n Uh, that's a really useful, I don't even know. I think I've been too afraid to even think about\n\n2:41:28.140 --> 2:41:34.380\n that. Like, like, like sit here and think like in five minutes,\n\n2:41:34.380 --> 2:41:37.660\n in five minutes, it's over.\n\n2:41:39.660 --> 2:41:41.660\n This is it. This is five minutes. It's over.\n\n2:41:41.660 --> 2:41:49.020\n Yeah. So that would be my most recent addition as I really am struck by Heidegger.\n\n2:41:50.300 --> 2:41:51.660\n Would you recommend that?\n\n2:41:51.660 --> 2:41:53.420\n Well, okay. Well, if you have a few years,\n\n2:41:53.420 --> 2:41:57.500\n I remember I tuned out being in time. I was like, I tried to read it. I was like, that's it.\n\n2:41:57.500 --> 2:42:05.740\n It took me 40 years to read Ulysses that could not get past the first five pages. And it took\n\n2:42:05.740 --> 2:42:09.660\n me 40 years to read being in time. It's a slog.\n\n2:42:10.780 --> 2:42:18.700\n And I took a James Joyce course in college. So I've, uh, I, I even, uh, I, I guess read parts\n\n2:42:18.700 --> 2:42:19.580\n of Finnegan's Wake.\n\n2:42:19.580 --> 2:42:19.980\n No way.\n\n2:42:20.620 --> 2:42:27.180\n But like, there's a difference between reading and like, I don't think I understood anything.\n\n2:42:27.180 --> 2:42:30.780\n I like his, uh, short stories on the dead, the dead. Yeah.\n\n2:42:30.780 --> 2:42:37.580\n Yeah. I love that. And, um, I like Faulkner, Absalom. Absalom is a, is a fine book.\n\n2:42:37.580 --> 2:42:43.340\n But would you, uh, is there something Heidegger connected in a book you would recommend or no?\n\n2:42:43.980 --> 2:42:50.540\n No. So maybe I got to abandon him. I mean, I mean, being in time is, is awesome. Um,\n\n2:42:51.260 --> 2:42:55.420\n but here's an interesting thing and not to get all academic, but, you know, it's,\n\n2:42:55.420 --> 2:43:01.900\n there's two parts to it. And most of the, most philosophers are preoccupied with the first part.\n\n2:43:02.540 --> 2:43:09.820\n It's in the second part where he gets into all the flight from death stuff and this idea of,\n\n2:43:09.820 --> 2:43:13.260\n you know, a turning and philosophers don't like that.\n\n2:43:14.220 --> 2:43:19.420\n And I'm like, this is where he's starting to really shine, to really shine for me.\n\n2:43:19.420 --> 2:43:27.820\n So, yeah. Yeah. All right. That's a beautiful set of books. So what, um, advice would you give to\n\n2:43:27.820 --> 2:43:36.460\n a young person today about their career, about life, about, uh, how to survive in this world\n\n2:43:36.460 --> 2:43:45.420\n full of suffering? Yeah. Great. Um, my advice is to get competent advice. That's what I tell my\n\n2:43:45.420 --> 2:43:51.340\n students that don't listen to me. Don't listen to me. Well, you know, I think, um,\n\n2:43:53.420 --> 2:44:01.020\n my, my big piece of advice these days is, you know, again, it's at the risk of sounding\n\n2:44:01.660 --> 2:44:12.860\n like a simpleton, but it's to emphasize a few things. One is, um, you know,\n\n2:44:12.860 --> 2:44:17.260\n so, uh, one of your questions I think was, you know, what's the meaning of life. And of course,\n\n2:44:17.260 --> 2:44:24.060\n the existentialists say life has no meaning, but it doesn't follow from that, that it's intrinsic,\n\n2:44:24.060 --> 2:44:29.820\n that it's meaningless. You know what the existential point is not that life is\n\n2:44:30.620 --> 2:44:38.460\n meaningless so much as it doesn't have one inevitable and intrinsic meaning, you know,\n\n2:44:38.460 --> 2:44:44.700\n which then it opens up, uh, you know, I think it was Kierkegaard who said consciousness gives us\n\n2:44:44.700 --> 2:44:52.140\n the possibility of possibilities. And, but there's another lunatic Oswald Spangler who wrote a book\n\n2:44:52.140 --> 2:44:59.100\n called, uh, decline of the West. And he says that the philosopher, the German philosopher Gerta,\n\n2:44:59.820 --> 2:45:07.100\n he says, the purpose of life is to live. And I let that's, so that's one of my pieces of advice.\n\n2:45:07.100 --> 2:45:12.060\n So the possibility of possibilities, it's interesting. So what do you do with this\n\n2:45:12.060 --> 2:45:17.980\n kind of sea of possibilities? Like, well, this is one of the, when, when young folks\n\n2:45:18.860 --> 2:45:24.940\n talk to me, especially these days, uh, is there swimming in a sea of possibilities?\n\n2:45:24.940 --> 2:45:30.860\n Yeah. Well, so this is great. And so that's another existential point, which is that\n\n2:45:30.860 --> 2:45:39.420\n we yearn for freedom. We react vigorously when we perceive that our choices have been curtailed\n\n2:45:40.220 --> 2:45:46.380\n and then we're paralyzed by indecision in the wake of seemingly unlimited possibilities,\n\n2:45:46.380 --> 2:45:53.980\n because we're not choking on choice. And, and I'm not sure if this is helpful advice or not,\n\n2:45:53.980 --> 2:46:03.260\n but what I say to folks is that the fact of the matter is, is the, you know, for most people,\n\n2:46:03.260 --> 2:46:16.220\n choice is a first world problem. And sometimes the best option is to do something as silly as\n\n2:46:16.220 --> 2:46:21.500\n it sounds. And then if that doesn't work, do something else, which just sounds like my mom\n\n2:46:21.500 --> 2:46:28.620\n torturing me, uh, when I was young. But you know, part of the thing that I find myself singularly\n\n2:46:28.620 --> 2:46:37.980\n ill equipped is that we're at the, I may be at the tail end of the last generation of Americans\n\n2:46:38.940 --> 2:46:44.220\n where you like picked something and that's what you did. Like I've been at a job for 40 years\n\n2:46:45.100 --> 2:46:49.580\n where you can expect to do better than your parents cause those days are gone.\n\n2:46:49.580 --> 2:46:50.780\n Yeah.\n\n2:46:50.780 --> 2:46:59.500\n And where you can make a comfortable inference that the world in a decade or two will have any\n\n2:46:59.500 --> 2:47:05.820\n remote similarity to the one that we now inhabit. And so.\n\n2:47:05.820 --> 2:47:07.900\n But still you recommend just do.\n\n2:47:08.620 --> 2:47:15.580\n Yeah. And to do so I'm again, I'm, this is, I'm so back to the Heidegger guy because,\n\n2:47:15.580 --> 2:47:22.380\n all right, I may, you know, I consider myself a professor, but what happens if most of the\n\n2:47:22.380 --> 2:47:28.860\n schools go out of business? Somebody else may consider themselves a restaurant tour,\n\n2:47:28.860 --> 2:47:36.460\n but what happens if there's no more restaurants? So what I, this is negative advice, but I tell\n\n2:47:36.460 --> 2:47:50.380\n folks, don't define yourself as a social caricature. Don't, don't limit how you feel about yourself by,\n\n2:47:51.660 --> 2:48:01.180\n through identification with a host of variables that may be uncertain.\n\n2:48:01.180 --> 2:48:02.220\n Maybe temporary.\n\n2:48:02.220 --> 2:48:03.420\n And temporary.\n\n2:48:03.420 --> 2:48:04.220\n What,\n\n2:48:04.220 --> 2:48:08.380\n let's say. No, but of course that gets back to your point earlier, Lex, where you're like, yeah,\n\n2:48:08.380 --> 2:48:13.980\n but when you step out of that, it's extraordinarily discombobulating.\n\n2:48:15.420 --> 2:48:23.740\n So what, I think you talked about an ax of chopping wood and soul from Socrates.\n\n2:48:23.740 --> 2:48:24.380\n Yeah.\n\n2:48:24.380 --> 2:48:32.060\n What is your soul? What is the, the essence of Schellen?\n\n2:48:33.260 --> 2:48:36.380\n Wow. That was like, awesome.\n\n2:48:36.380 --> 2:48:41.500\n Like when God, when you, when you show up at the end of this thing, he kind of looks at you,\n\n2:48:41.500 --> 2:48:45.180\n he's like, oh yeah, yeah, I remember you.\n\n2:48:45.180 --> 2:48:51.500\n Yeah. Well, you know, I, to be honest, what I muse about,\n\n2:48:51.500 --> 2:49:04.380\n is to me, the, when, when people are, I told you, I have to, we have two kids, late 20s, early 30s.\n\n2:49:05.580 --> 2:49:13.660\n And over the years, when people, when we meet people that know our kids and they're like, oh,\n\n2:49:13.660 --> 2:49:21.580\n your kids are kind and decent. And I'd be like, that's what I would like to be.\n\n2:49:22.620 --> 2:49:27.740\n Because I think intelligence is vastly overrated. You know, the Unabomber was a smart guy.\n\n2:49:27.740 --> 2:49:28.380\n Yeah.\n\n2:49:28.380 --> 2:49:35.340\n And I do admire intelligence and I do venerate education and I find that to be\n\n2:49:35.340 --> 2:49:42.140\n tremendously important. But if I had to pay the ultimate homage to myself,\n\n2:49:43.340 --> 2:49:49.900\n it would be to be known as somebody who takes himself too seriously to take myself too seriously.\n\n2:49:51.660 --> 2:50:01.020\n Again, as corny as it sounds, I'd like to leave the world a time when I can be known as somebody\n\n2:50:01.020 --> 2:50:07.740\n who takes himself too seriously. Again, as corny as it sounds, I'd like to leave the world\n\n2:50:09.020 --> 2:50:12.620\n a tad better than I found it, or at least do no harm.\n\n2:50:14.300 --> 2:50:20.860\n And, I think you, I think you did all right in that, in that regard.\n\n2:50:20.860 --> 2:50:24.620\n I love that question, Alex. That's a good one. I think everyone should be asked that.\n\n2:50:25.260 --> 2:50:26.540\n What is your soul?\n\n2:50:26.540 --> 2:50:30.300\n I think there's a lot of lingering questions around it.\n\n2:50:33.420 --> 2:50:40.380\n So, I mean, on the point of the soul, you've talked about the meaning of life. Do you have,\n\n2:50:45.100 --> 2:50:54.060\n on a personal level, do you have an answer to the meaning of your life, of something that brought you\n\n2:50:54.060 --> 2:51:05.340\n meaning, happiness, some sense of sense?\n\n2:51:09.100 --> 2:51:16.700\n No, I mean, yes and no. I mean, I'm 66, so I'm in the kind of\n\n2:51:16.700 --> 2:51:25.500\n and not ready to wrap it up, literally or metaphorically, but you look, I look back and\n\n2:51:27.420 --> 2:51:35.100\n just really with a sense of awe and wonder, gratitude, and\n\n2:51:35.100 --> 2:51:39.580\n Is there memories that stand out to you from childhood, from earlier, that like,\n\n2:51:39.580 --> 2:51:48.220\n it's like, you know, stand out as something you're really proud of or just happy to have been on this\n\n2:51:48.220 --> 2:51:50.300\n earth, because that stuff happened.\n\n2:51:50.300 --> 2:51:59.420\n Yeah, that. I mean, you know, my family, also a chunk, my folks, my grandparents are from Eastern\n\n2:51:59.420 --> 2:52:08.620\n Europe, you know, Russia, Austria. As far as we know, some of them never made it out. I consider\n\n2:52:08.620 --> 2:52:22.380\n myself very fortunate to have been a so called product of the American dream. You know, my\n\n2:52:22.380 --> 2:52:32.700\n grandparents were basically peasants. My parents, my dad worked two full time jobs when I was growing\n\n2:52:32.700 --> 2:52:37.100\n up, and I would see him on the weekends. I'd be like, why are you working all the time? He'd be\n\n2:52:37.100 --> 2:52:45.900\n like, so you won't have to. And he said, Look, the world does not owe you a living. And so your first\n\n2:52:45.900 --> 2:52:54.940\n responsibility is to take care of yourself. And then your next responsibility is to take care of\n\n2:52:54.940 --> 2:53:03.100\n other people. And I think you did a pretty good job with that. I don't know. But I so that those\n\n2:53:03.100 --> 2:53:07.740\n are the things that I'm proud of.\n\n2:53:07.740 --> 2:53:16.540\n Well, it's funny. You've been, you've talked about just yourself as a human being. But you've\n\n2:53:16.540 --> 2:53:27.980\n also contributed some really important ideas for your ideas and also kind of integrating and maybe\n\n2:53:27.980 --> 2:53:34.380\n even popularizing the work of Ernest Becker of connecting it of making it legitimate scientifically.\n\n2:53:34.380 --> 2:53:43.020\n I mean, you know, as a human, of course, you want to be you want your ripple to be one that makes the\n\n2:53:43.020 --> 2:53:51.340\n world a better place. But also, I think, in the span of time, I think it's of great value. You've\n\n2:53:51.340 --> 2:53:57.500\n contributed in terms of how we think about the human condition, how we think about ourselves,\n\n2:53:57.500 --> 2:54:04.300\n assuming as finite beings in this world. And I hope also in our technology of engineering\n\n2:54:04.300 --> 2:54:11.180\n intelligence, I think, at least, at least for me, and I'm sure there's a lot of other people\n\n2:54:11.820 --> 2:54:15.580\n like me that your work has been a gift for so well, thank you.\n\n2:54:15.580 --> 2:54:22.380\n Oh, I like that. And we have described ourselves as giant interneurons. I'm like,\n\n2:54:22.380 --> 2:54:29.580\n we have had no original ideas. And maybe that's the only thing that's original about our work is\n\n2:54:29.580 --> 2:54:37.820\n we don't claim to be original. What we claim to have done is to integrate and to connect\n\n2:54:38.940 --> 2:54:45.180\n these disparate and superficially unconnected discourses, you know, so existentialists,\n\n2:54:45.180 --> 2:54:52.780\n they'd be like, evidence? What's that? And yeah, there's now a branch of psychology, experimental,\n\n2:54:52.780 --> 2:55:01.100\n existential psychology that I think we could take credit for having encouraged the formation of.\n\n2:55:02.380 --> 2:55:10.060\n And that, in turn, has gotten these ideas in circulation and academic communities where they\n\n2:55:10.060 --> 2:55:17.500\n may not have otherwise gotten. So I think that's good. Well, Sheldon, it's a huge honor. I can't\n\n2:55:17.500 --> 2:55:25.020\n believe you came down here. I've been a fan of your work. I hope we get to talk again. Huge honor\n\n2:55:25.020 --> 2:55:28.140\n to talk to you. Thank you so much for talking today. Thanks, Lex. We'll do it again soon, I hope.\n\n2:55:29.340 --> 2:55:34.060\n Thanks for listening to this conversation with Sheldon Solomon. And thank you to our sponsors,\n\n2:55:34.060 --> 2:55:40.140\n Blinkist, ExpressVPN, and CashApp. Click the links in the description to get a discount. It's the\n\n2:55:40.140 --> 2:55:45.420\n best way to support this podcast. If you enjoy this thing, subscribe on YouTube, review it with\n\n2:55:45.420 --> 2:55:50.940\n Five Star Snapper Podcast, follow on Spotify, support on Patreon, or connect with me on Twitter\n\n2:55:50.940 --> 2:55:56.780\n at Lex Friedman. And now let me leave you with some words from Vladimir Nabokov that Sheldon\n\n2:55:56.780 --> 2:56:04.380\n uses in his book, Warm at the Core. The cradle rocks above an abyss, and common sense tells us\n\n2:56:04.380 --> 2:56:09.980\n that our existence is but a brief crack of light between two eternities of darkness.\n\n2:56:09.980 --> 2:56:26.940\n Thanks for listening, and hope to see you next time.\n\n"
}