{
  "title": "Michael Malice: Totalitarianism and Anarchy | Lex Fridman Podcast #200",
  "id": "R5rNoV1Qy_Q",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.880\n The following is a conversation between me and Michael Malus.\n\n00:04.880 --> 00:12.120\n Michael is an author, anarchist, and simpleton, and I'm proud to call him my friend.\n\n00:12.120 --> 00:19.120\n He makes me smile, he makes me think, and he makes me wonder why I sound so sleepy all\n\n00:19.120 --> 00:20.560\n the time.\n\n00:20.560 --> 00:27.800\n And now, enjoy this conversation with Michael Malus in the Tupagalovi language that I'm\n\n00:27.800 --> 00:32.160\n increasingly certain I'll never quite able to get the hang of.\n\n00:32.160 --> 00:36.440\n Hello, comrade.\n\n00:36.440 --> 00:40.880\n So Animal Farm by George Orwell is one of my favorite books.\n\n00:40.880 --> 00:46.600\n It's an allegory about, at least I think, about the Soviet Union and the Russian Revolution\n\n00:46.600 --> 00:48.840\n of 1917.\n\n00:48.840 --> 00:54.360\n So for people who haven't read it, it's animals overthrow the humans and then slowly become\n\n00:54.360 --> 00:57.680\n as bad or worse than the humans.\n\n00:57.680 --> 01:04.280\n So comrade, if we lived on this farm, in the book Animal Farm, which animal would you most\n\n01:04.280 --> 01:06.480\n rather be?\n\n01:06.480 --> 01:13.840\n Would it be the pigs, the horses, the donkey Benjamin, the raven Moses, the humans, Mr.\n\n01:13.840 --> 01:17.120\n and Mrs. Jones, the dogs, or the sheep?\n\n01:17.120 --> 01:22.960\n I'm gonna go with the Milton answer, which is it's better to rule in hell than serve\n\n01:22.960 --> 01:24.360\n in heaven, right?\n\n01:24.360 --> 01:27.000\n It's better to rule in hell than serve in heaven.\n\n01:27.000 --> 01:29.800\n Yeah, so I would have to go with the pigs.\n\n01:29.800 --> 01:32.280\n So I guess I'd be a cop.\n\n01:32.280 --> 01:33.280\n At the very top.\n\n01:33.280 --> 01:37.200\n So the leader, the main pig, Napoleon versus like the others.\n\n01:37.200 --> 01:42.640\n I would say it's not, it's sure it's an allegory about the Russian Revolution, but I think\n\n01:42.640 --> 01:46.280\n Orwell's point was this is broader towards most totalitarian dictatorships.\n\n01:46.280 --> 01:50.720\n I mean, it could very easily be read as an indictment of Mussolini or Hitler, or many\n\n01:50.720 --> 01:51.720\n of these others.\n\n01:51.720 --> 01:55.340\n I'm a huge George Orwell fan.\n\n01:55.340 --> 02:01.560\n One of the things that I think people on the right need to appreciate is the courage of\n\n02:01.560 --> 02:09.360\n many of these undisputably left wing voices who were the strongest ones to take on totalitarian\n\n02:09.360 --> 02:10.360\n communism.\n\n02:10.360 --> 02:15.020\n And the three I could think of top of my head who are all in my top 10 heroes of all time\n\n02:15.020 --> 02:20.600\n are Emma Goldman, Albert Camus, and Orwell being the third.\n\n02:20.600 --> 02:25.160\n Something that leftists like to throw in the face of people on the right who constantly\n\n02:25.160 --> 02:29.200\n invoke Orwell is that Orwell said, and I don't have the exact quote off the top of my head,\n\n02:29.200 --> 02:34.440\n but something to the effect of every word I have written should be taken as a defense\n\n02:34.440 --> 02:37.360\n of democratic socialism against totalitarianism.\n\n02:37.360 --> 02:44.280\n So people like Truman was obviously very hardcore, in many ways anti communist.\n\n02:44.280 --> 02:51.920\n We like to parse things out, you're going to laugh, into binary fashions that left good,\n\n02:51.920 --> 02:53.760\n right bad, or right good, left bad.\n\n02:53.760 --> 02:58.720\n But historically speaking, it would just not fall away into these camps as easily as people\n\n02:58.720 --> 03:00.560\n would like.\n\n03:00.560 --> 03:06.680\n And I think it is important for those of us, it takes a lot more courage to fight the right\n\n03:06.680 --> 03:12.120\n from the right or to fight the left from the left, because in a sense, a lot of your countrymen\n\n03:12.120 --> 03:15.700\n or your fellow travelers are going to regard you as a traitor to the cause.\n\n03:15.700 --> 03:21.880\n So every chance I get, I will sing the praises of these three figures, among others, who\n\n03:21.880 --> 03:27.320\n not all even if they hadn't done what they had done, just lived just amazing lives that\n\n03:27.320 --> 03:34.440\n all of us can learn from and admire and regard as somewhat a role model.\n\n03:34.440 --> 03:35.440\n So\n\n03:35.440 --> 03:38.760\n what was the nature of their opposition to totalitarianism?\n\n03:38.760 --> 03:42.560\n Is it basically freedom, the value of freedom?\n\n03:42.560 --> 03:43.840\n Let's go through the three of them.\n\n03:43.840 --> 03:47.720\n So Emma Goldman, she was an early anarchist figure, you know, we'll talk about her later,\n\n03:47.720 --> 03:52.840\n I'm sure she got deported from the United States with her partner in crime, Alexander\n\n03:52.840 --> 03:58.560\n Birkman, literal crime, he tried to assassinate Frick, who was Andrew Carnegie's main man\n\n03:58.560 --> 04:00.900\n in the Pittsburgh steel mill strike.\n\n04:00.900 --> 04:03.600\n She got deported to the Soviet Union.\n\n04:03.600 --> 04:05.580\n And they're like, oh, you want socialism?\n\n04:05.580 --> 04:09.260\n Because at the time, the anarchists were regarded as socialist, you know, go choke on it.\n\n04:09.260 --> 04:10.620\n And she's there.\n\n04:10.620 --> 04:13.600\n And she was watching in great horror what was going on.\n\n04:13.600 --> 04:16.880\n And she actually went to Lenin's office and she goes, this isn't what we're about.\n\n04:16.880 --> 04:21.080\n The revolution is about the individual and free speech and everyone working together\n\n04:21.080 --> 04:23.000\n to further society.\n\n04:23.000 --> 04:26.780\n And he told her that, you know, you know, free speech is a bourgeois contrivance.\n\n04:26.780 --> 04:30.760\n And regardless, you can't have these circumstances in the midst of a revolution.\n\n04:30.760 --> 04:34.240\n And when she left the Soviet Union, and you know, she went to Britain.\n\n04:34.240 --> 04:40.400\n And at the time, before the 1917, there was a lot of discussion among socialist circles\n\n04:40.400 --> 04:42.760\n about what would the revolution look like, right?\n\n04:42.760 --> 04:44.640\n Would there be the Bakunin anarchist model?\n\n04:44.640 --> 04:46.120\n Would there be the Marxist model?\n\n04:46.120 --> 04:48.260\n Obviously, the Bolsheviks ended up winning.\n\n04:48.260 --> 04:51.640\n But even then, it wasn't obvious because there was the Bolsheviks and the Mensheviks.\n\n04:51.640 --> 04:54.500\n And what people, you know, you and I know what those words mean.\n\n04:54.500 --> 04:59.160\n But Bolsheviks were kind of funny because Bolsheviks means bigger and Mensheviks means\n\n04:59.160 --> 05:00.160\n smaller.\n\n05:00.160 --> 05:01.480\n The Mensheviks had the numbers.\n\n05:01.480 --> 05:06.260\n It was sarcastic that they were called Mensheviks and the Bolsheviks were called Bolsheviks.\n\n05:06.260 --> 05:11.560\n And Lenin, you know, destroyed all his foes in a very merciless way, obviously.\n\n05:11.560 --> 05:15.520\n Beforehand, you know, there was the idea like, okay, with all these cockamamie ideas, we\n\n05:15.520 --> 05:17.100\n have to work together.\n\n05:17.100 --> 05:19.000\n You know, we don't know what's going to look like for the cause.\n\n05:19.000 --> 05:22.360\n Then as soon as he sees power, he's like, yeah, yeah, we're not doing that kind of pluralism\n\n05:22.360 --> 05:23.360\n anymore.\n\n05:23.360 --> 05:25.840\n This is going to be the right approach.\n\n05:25.840 --> 05:29.040\n So she left the Soviet Union, as did Berkman.\n\n05:29.040 --> 05:32.480\n She wrote a book that they titled, My Disillusion with Russia.\n\n05:32.480 --> 05:36.280\n And I remember this one anecdote, which I'm going to discuss in the forthcoming book,\n\n05:36.280 --> 05:40.940\n where she goes to Britain and the British were very red at the time, they really had\n\n05:40.940 --> 05:44.040\n something called the Fabian Society, which was the predecessor to the British Labour\n\n05:44.040 --> 05:49.080\n Party, which were like, all right, we're going to get rid of liberalism and have a socialist\n\n05:49.080 --> 05:50.900\n kind of nation.\n\n05:50.900 --> 05:55.320\n And she gave talks, and there was this one time where she gave a talk and she started,\n\n05:55.320 --> 05:58.860\n and there was a standing ovation, by the time she was done, you could hear a pin drop, because\n\n05:58.860 --> 06:03.720\n she dared to look at these people in the face, something they'd been fighting for all their\n\n06:03.720 --> 06:07.060\n lives and saying, you know, we've been to the future and it works.\n\n06:07.060 --> 06:10.220\n And she's like, guys, this is worse than the czar.\n\n06:10.220 --> 06:13.740\n You know, people are under house arrest, you're not allowed to have, you know, newspapers\n\n06:13.740 --> 06:16.920\n are being shut down if they have heretical views, so on and so forth.\n\n06:16.920 --> 06:20.560\n And you know, she was just even more of a pariah than she had been previously.\n\n06:20.560 --> 06:24.600\n So she is, you know, deserves huge accolades in that regard.\n\n06:24.600 --> 06:28.960\n I brought her up and we were talking about with our conversation with Yaron Orwell, I\n\n06:28.960 --> 06:34.280\n think you don't need me to explain what he has done and continues to do to use fiction\n\n06:34.280 --> 06:39.900\n to demonstrate the horrors of a totalitarian state.\n\n06:39.900 --> 06:44.840\n And Camus, who might be my all time great lighthouse, so to speak, in terms of being\n\n06:44.840 --> 06:48.560\n a man of conscience, you know, he joined the Communist Party and for a lot of people in\n\n06:48.560 --> 06:51.680\n the States, you hear, oh, you joined the Communist Party, so I need to hear, it's all you need\n\n06:51.680 --> 06:53.340\n to, he was a communist, all you need to know.\n\n06:53.340 --> 06:56.840\n He joined the Communist Party because they were the main ones fighting the fascists in\n\n06:56.840 --> 06:58.840\n France and other locations.\n\n06:58.840 --> 07:03.240\n And he took Nazism, as did many others, of course, very, very, very seriously.\n\n07:03.240 --> 07:08.780\n He wasn't some committed communist, but this was just his mechanism to take on, you know,\n\n07:08.780 --> 07:11.720\n be part of the underground in Vichy France, and so on and so forth.\n\n07:11.720 --> 07:17.360\n So he had the quote, which is ascribed to him, which is kind of a misquote, Howard Zinn\n\n07:17.360 --> 07:21.080\n is the one who actually said it, that it is a job of thinking people not to be on the\n\n07:21.080 --> 07:23.040\n side of the executioners.\n\n07:23.040 --> 07:27.720\n And he very much felt, if you read his speech when he won the Nobel Prize, I forget, in\n\n07:27.720 --> 07:33.840\n the 50s, where he goes, it's basically the job of writers to keep civilization from destroying\n\n07:33.840 --> 07:34.840\n himself.\n\n07:34.840 --> 07:39.160\n I don't think I'm ever going to be a man on the level of Camus and what he's accomplished,\n\n07:39.160 --> 07:46.280\n but I think that vision of it is the job of writers to be the conscience and to point\n\n07:46.280 --> 07:51.960\n out, you know, this is the leftism at its best when, you know, giving voice to the voiceless,\n\n07:51.960 --> 07:56.660\n when you have the machine of the state crushing and marginalizing people, and they might not\n\n07:56.660 --> 08:00.540\n be educated, literate, or have any power at all.\n\n08:00.540 --> 08:06.400\n He's the guy who's like, you are ruining humans, these humans matter, and I'm not going to\n\n08:06.400 --> 08:10.060\n let you look the other way and act like you don't know what you're doing.\n\n08:10.060 --> 08:14.960\n So in this time, whether we look at the time of fascism, or we look at the fictional Animal\n\n08:14.960 --> 08:17.940\n Farm, what's the heroic action then?\n\n08:17.940 --> 08:23.560\n So Camus joined the Communist Party, there's a bunch of different heroic actions, some\n\n08:23.560 --> 08:29.280\n more heroic than others, not just for the, you know, hero is the wrong word, in terms\n\n08:29.280 --> 08:33.520\n of like effectiveness, what's the effective action, I guess is what I want to ask.\n\n08:33.520 --> 08:38.400\n As a writer, as a thinker, as somebody with a mind, what's the heroic action?\n\n08:38.400 --> 08:42.980\n That's a tricky question, because a lot of times in the West, heroism is regardless intertwined\n\n08:42.980 --> 08:44.300\n with martyrdom, right?\n\n08:44.300 --> 08:47.760\n So it's kind of this idea of like, you have to speak to, you know, Camus always talked\n\n08:47.760 --> 08:50.540\n about justice, let justice be done though the heavens fall.\n\n08:50.540 --> 08:55.080\n This is a common kind of motto among people with conscience, and that you have to do the\n\n08:55.080 --> 08:58.100\n right thing, even the consequences might not be what you like.\n\n08:58.100 --> 09:01.500\n And I think that is a good loose definition of heroism.\n\n09:01.500 --> 09:03.960\n So if you meet, I'll give you one example of heroism.\n\n09:03.960 --> 09:09.820\n This was on Twitter, and I really feel bad that I don't remember the guy's name.\n\n09:09.820 --> 09:13.840\n This was the line to Auschwitz, I believe it was, and you know, there's the Nazi guards\n\n09:13.840 --> 09:16.020\n keeping everyone along.\n\n09:16.020 --> 09:19.820\n And if you were certain, I think if you were under 12, they killed you or something, there\n\n09:19.820 --> 09:24.200\n was some age limit where some kids were killed or some were not, there was some circumstances.\n\n09:24.200 --> 09:28.540\n And he asked the mom how old this kid was, and she's like, he's 14, and she's like,\n\n09:28.540 --> 09:29.540\n no, he's 12.\n\n09:29.540 --> 09:30.540\n And she's like, no, he's 14.\n\n09:30.540 --> 09:32.060\n She goes, he's 12.\n\n09:32.060 --> 09:36.540\n And she realized what this Nazi was telling her even in that circumstance, and it ended\n\n09:36.540 --> 09:37.840\n up saving the kid's life.\n\n09:37.840 --> 09:47.820\n So I think heroism in this context is defiance and standing true to values of liberalism,\n\n09:47.820 --> 09:51.640\n humanism and venerating the sanctity of human life.\n\n09:51.640 --> 09:56.940\n I think that, and I think it's also important to pick your battles.\n\n09:56.940 --> 10:02.740\n I don't think if, you know, he got, that Nazi over there got in a bullhorn and said, hey,\n\n10:02.740 --> 10:06.300\n this is the rules, blah, blah, blah, blah, blah, that's not going to help anyone do anything.\n\n10:06.300 --> 10:11.080\n So I do think, you know, people a lot of times attack me for my anarchist views, like, oh,\n\n10:11.080 --> 10:12.400\n you know, would you call the police?\n\n10:12.400 --> 10:13.400\n Would you use the roads?\n\n10:13.400 --> 10:15.840\n Would you pay your income taxes?\n\n10:15.840 --> 10:19.900\n You know, I got in an argument with Tim Pool, because there was that couple, I think it\n\n10:19.900 --> 10:24.900\n was at Missouri or Illinois when they had their guns and they were being arrested and\n\n10:24.900 --> 10:27.780\n they basically took a plea deal and he said, you should have fought.\n\n10:27.780 --> 10:32.320\n I go, it's a lot easier to say you should fight, but we don't know what circumstance\n\n10:32.320 --> 10:33.360\n someone is under.\n\n10:33.360 --> 10:40.140\n And what these totalitarian regimes did very, very well, as you know, is if you were a target\n\n10:40.140 --> 10:43.540\n and they can't get through to you, that's fine, you have a family.\n\n10:43.540 --> 10:49.380\n So you can sit there, Lex, and gird your jaw and you can stand up to all the torture, cool,\n\n10:49.380 --> 10:50.760\n what are we going to do about your wife?\n\n10:50.760 --> 10:51.760\n What about your mom?\n\n10:51.760 --> 10:57.780\n One thing Stalin did, he made it a law that kids up to 14 and up could get the death penalty\n\n10:57.780 --> 10:59.240\n for certain crimes.\n\n10:59.240 --> 11:05.040\n So after that, the rule was from the NKVD, if you were interrogating someone, they would\n\n11:05.040 --> 11:09.440\n have death warrants for the kid's child on the desk visible.\n\n11:09.440 --> 11:14.940\n So I'm interrogating you asking you to commit to, I'm sorry, to admit to some crime that\n\n11:14.940 --> 11:16.080\n you're not committed.\n\n11:16.080 --> 11:19.960\n And those piece of paper, it's Svitlana, she's got a death warrant.\n\n11:19.960 --> 11:22.080\n You're going to admit to any crime you want.\n\n11:22.080 --> 11:26.720\n So this is something Americans, this is even the case right now in North Korea, which I\n\n11:26.720 --> 11:29.360\n know you had Yonmi Park on, it's something I talk about a lot.\n\n11:29.360 --> 11:33.740\n Let's talk about it instead of the hypothetical, but this is happening right now on earth.\n\n11:33.740 --> 11:35.920\n You can look at the map on Google.\n\n11:35.920 --> 11:39.620\n The great leader, Kim Il Sung, the founder of North Korea said, class enemies must be\n\n11:39.620 --> 11:41.720\n exterminated three generations.\n\n11:41.720 --> 11:46.540\n So North, when people talk about individualism versus collectivism, Rick Santorum from Ascender\n\n11:46.540 --> 11:50.440\n says the family is the basic unit of society, unit.\n\n11:50.440 --> 11:52.080\n North Korea takes that seriously.\n\n11:52.080 --> 11:54.400\n The family is punished as a unit.\n\n11:54.400 --> 11:58.540\n So if someone does something wrong, three generations have to pay the price and you\n\n11:58.540 --> 12:01.880\n often don't know who it is that got you all in trouble.\n\n12:01.880 --> 12:03.160\n There's not a trial.\n\n12:03.160 --> 12:07.020\n This to Western minds is something almost incomprehensible.\n\n12:07.020 --> 12:10.640\n It's a lot easier to be brave when it's just your skin.\n\n12:10.640 --> 12:17.920\n It's something when it's your child, your loved ones, every man becomes a coward.\n\n12:17.920 --> 12:21.960\n But also what bravery is there for me to write an essay for The Guardian to say, I don't\n\n12:21.960 --> 12:22.960\n vote.\n\n12:22.960 --> 12:23.960\n There's no consequences to me.\n\n12:23.960 --> 12:25.620\n There's no possibility of consequences to me.\n\n12:25.620 --> 12:29.120\n This is the wonderful thing about living in a free country.\n\n12:29.120 --> 12:35.120\n It would take a lot of courage to be in the Soviet Union and say, I'm not going to vote.\n\n12:35.120 --> 12:37.480\n And what would that courage accomplish?\n\n12:37.480 --> 12:38.480\n Very little.\n\n12:38.480 --> 12:43.400\n Heroism in the sense of kind of the suicidal stuff and taking a stance with no consequences\n\n12:43.400 --> 12:45.560\n is a bit overrated.\n\n12:45.560 --> 12:50.680\n There is some aspect, like the way I think about heroism is something like you said about\n\n12:50.680 --> 12:58.800\n the Nazi soldier, which is quietly privately in your own life, live the virtues that you\n\n12:58.800 --> 13:01.160\n want the rest of the world to live by.\n\n13:01.160 --> 13:02.160\n Yes.\n\n13:02.160 --> 13:08.000\n So like without writing about it is not as heroic as living it quietly.\n\n13:08.000 --> 13:10.840\n I'll give you a great example of this.\n\n13:10.840 --> 13:17.180\n I sometimes give talks on networking and I tell the kids, if you know someone's in town\n\n13:17.180 --> 13:19.600\n and it's their birthday with nothing to do, take them out.\n\n13:19.600 --> 13:24.160\n And I say, I do this for selfish reasons and everyone laughs and I go, think about it this\n\n13:24.160 --> 13:25.160\n way.\n\n13:25.160 --> 13:29.180\n The guy who takes people out for their birthday is awesome.\n\n13:29.180 --> 13:30.280\n That could be you.\n\n13:30.280 --> 13:34.820\n Like you have that capacity to be that person and you're making that day feel special.\n\n13:34.820 --> 13:36.480\n They're going to remember for a long time.\n\n13:36.480 --> 13:37.480\n What's the cost?\n\n13:37.480 --> 13:39.320\n 30 bucks, 25 bucks.\n\n13:39.320 --> 13:48.160\n So it's very disturbing to me how often people have opportunities to slightly move the needle\n\n13:48.160 --> 13:51.900\n and make things a bit better at almost no cost.\n\n13:51.900 --> 13:54.680\n And they just literally don't think in those terms.\n\n13:54.680 --> 14:00.000\n And one of the things Camus talked about, he's often described as an existentialist,\n\n14:00.000 --> 14:01.240\n which he did not like that term.\n\n14:01.240 --> 14:06.040\n He regarded himself as an absurdist, is the idea that we're basically blank canvases.\n\n14:06.040 --> 14:07.760\n And this isn't something that is dangerous.\n\n14:07.760 --> 14:09.640\n This is an enormous opportunity.\n\n14:09.640 --> 14:14.760\n And you have the ability to become the kind of man or woman that you admire and want to\n\n14:14.760 --> 14:15.760\n be.\n\n14:15.760 --> 14:18.840\n You don't have to be, I don't know, George Washington or one of these great heroes of\n\n14:18.840 --> 14:19.960\n all time.\n\n14:19.960 --> 14:26.060\n But everyone out there has the capacity to be, excuse me, to be a hero to their kids\n\n14:26.060 --> 14:30.840\n or to be a hero to maybe some, there's nursing homes and there's old people who are lonely.\n\n14:30.840 --> 14:35.980\n I think that you take in a dog that's on its last legs.\n\n14:35.980 --> 14:41.060\n These are little things, Terry Shepherd does that a lot, I regarded him as a hero.\n\n14:41.060 --> 14:43.040\n These are not Terry Shepherd, I'm blanking his name.\n\n14:43.040 --> 14:48.600\n These are things that people do that aren't heroic in the sense of Superman, but that\n\n14:48.600 --> 14:53.280\n I find admirable extremely and I think are very underrated because these people aren't\n\n14:53.280 --> 14:54.720\n championed.\n\n14:54.720 --> 15:00.800\n Is this some kind of weird, passive, aggressive and direct way for you to tell me that I should\n\n15:00.800 --> 15:03.120\n take you off for your birthday on Monday?\n\n15:03.120 --> 15:05.320\n Is that why you gave that whole speech?\n\n15:05.320 --> 15:06.320\n That wasn't it at all.\n\n15:06.320 --> 15:07.320\n That was a joke, Michael.\n\n15:07.320 --> 15:09.320\n No, it was a failed joke.\n\n15:09.320 --> 15:10.320\n Nevertheless.\n\n15:10.320 --> 15:12.840\n There was no punchline.\n\n15:12.840 --> 15:15.000\n Without failure, we would not have triumph.\n\n15:15.000 --> 15:19.920\n Can we stick on the Camus absurdism versus existentialism?\n\n15:19.920 --> 15:20.920\n Sure.\n\n15:20.920 --> 15:24.360\n What do you think is the difference?\n\n15:24.360 --> 15:33.120\n In your ideas about anarchism too, it seems like those are somehow intricately connected\n\n15:33.120 --> 15:40.320\n because existentialism is connected to freedom and freedom is connected to anarchism.\n\n15:40.320 --> 15:41.320\n Sure.\n\n15:41.320 --> 15:46.200\n But I mean, Sartre was a defender of the Soviet Union.\n\n15:46.200 --> 15:50.340\n He said explicitly about things like gulags, like even if it's true, we shouldn't talk\n\n15:50.340 --> 15:53.420\n about it.\n\n15:53.420 --> 15:57.920\n What people don't appreciate is how human beings can have contradictory ideas in their\n\n15:57.920 --> 15:59.560\n minds at the same time.\n\n15:59.560 --> 16:04.320\n One would think, okay, someone's a Democrat, they think ABC, therefore they think DEF.\n\n16:04.320 --> 16:08.200\n People would have all sorts of contradictions and it's not at all clear and they'll have\n\n16:08.200 --> 16:12.240\n a clean conscience because the human mind is very sophisticated and is capable of doing\n\n16:12.240 --> 16:13.240\n this.\n\n16:13.240 --> 16:19.060\n So Sartre, you would think he's this radical individualist, this sense of ultimate freedom,\n\n16:19.060 --> 16:20.720\n but he's defending the Soviet Union.\n\n16:20.720 --> 16:25.600\n Camus, on the other hand, would probably be, was very much like a social Democrat.\n\n16:25.600 --> 16:29.920\n He didn't really talk about what politics should be so much as it shouldn't be.\n\n16:29.920 --> 16:35.220\n His essay, Reflections on the Guillotine, is one of the great masterpieces of all time,\n\n16:35.220 --> 16:41.680\n an attack on the death penalty, not in terms of no one's evil or it's wrong to kill murderers,\n\n16:41.680 --> 16:44.640\n but in terms of what does it do for a society?\n\n16:44.640 --> 16:51.040\n If you have someone who takes a person and locks them in a room and says, in two years,\n\n16:51.040 --> 16:53.360\n I'm going to murder you and you lock them for that.\n\n16:53.360 --> 16:57.960\n This is not someone we regard as moral, we regard this as someone who's a complete monster,\n\n16:57.960 --> 17:01.480\n but that's what the state does with the death penalty.\n\n17:01.480 --> 17:07.440\n And he challenges us to think, is this the kind of people we want to be?\n\n17:07.440 --> 17:11.060\n And again, he's saying, I'm not saying killing a murderer is wrong.\n\n17:11.060 --> 17:12.640\n I'm not saying evil is wrong.\n\n17:12.640 --> 17:17.120\n His entire career was dedicated to fighting the concept of evil.\n\n17:17.120 --> 17:22.600\n But are we the kind of people who want to be doing these things that in any other context\n\n17:22.600 --> 17:25.000\n we regard as torture or depraved?\n\n17:25.000 --> 17:28.800\n So I'm much more of a Camus person than a Sartre person.\n\n17:28.800 --> 17:31.000\n So he was probably against war in that same way.\n\n17:31.000 --> 17:36.000\n So I don't, I have to admit, I don't know much about the political side of Camus.\n\n17:36.000 --> 17:38.820\n Well, and I don't think his political side is that interesting or relevant.\n\n17:38.820 --> 17:42.760\n What I find, sorry to interrupt you, what I find fascinating about Camus and what I\n\n17:42.760 --> 17:48.760\n think about on a daily basis from him is his insistence that you have to live a life based\n\n17:48.760 --> 17:53.000\n on conscience, that you have to be accountable to yourself when you put your head on the\n\n17:53.000 --> 17:59.080\n pelt at the end of the day and ask yourself, did I live a righteous life with integrity\n\n17:59.080 --> 18:00.840\n true to my values?\n\n18:00.840 --> 18:06.320\n Did I not needlessly cause harm to innocent people?\n\n18:06.320 --> 18:11.160\n That kind of mindset, did I, if someone is weak, am I using that as an opportunity to\n\n18:11.160 --> 18:13.020\n exploit them or to harm them?\n\n18:13.020 --> 18:17.880\n Or do I feel a bit of sympathy or empathy for this person because maybe they didn't\n\n18:17.880 --> 18:23.040\n have circumstances that were as beneficial as other people had.\n\n18:23.040 --> 18:29.720\n Well, how does that fit absurdism where everything is absurd, nothing has meaning, it really\n\n18:29.720 --> 18:31.520\n borders on nihilism.\n\n18:31.520 --> 18:39.960\n So he regards, his philosophy explicitly said is a response to nihilism and a attack on\n\n18:39.960 --> 18:41.320\n nihilism.\n\n18:41.320 --> 18:46.140\n He regards cynicism as the worst value people can have.\n\n18:46.140 --> 18:48.160\n And I agree with him 100%.\n\n18:48.160 --> 18:53.360\n A lot of times people call me cynical online and I push back very, very hard because to\n\n18:53.360 --> 18:57.240\n be a, you know, I had this quote in the new write where I said, I'd rather be naive than\n\n18:57.240 --> 19:01.840\n a cynic because a cynic is a hopeless man who projects his hopelessness to the world\n\n19:01.840 --> 19:03.400\n at large.\n\n19:03.400 --> 19:07.520\n Camus, this is the metaphor I use and I find it very inspirational.\n\n19:07.520 --> 19:11.200\n I thought it was in his work, but I guess I thought if it described it to him.\n\n19:11.200 --> 19:17.840\n There's two types of people, you imagine you go to a mountainside and you see a blank canvas\n\n19:17.840 --> 19:21.160\n on an easel standing in front of this mountainside.\n\n19:21.160 --> 19:25.880\n One people be like, why is this blank canvas here, you know, what was this, what's going\n\n19:25.880 --> 19:26.880\n on here?\n\n19:26.880 --> 19:28.260\n And just be confused.\n\n19:28.260 --> 19:33.040\n Whereas the other type of person will be like, there's a blank canvas here in this beautiful\n\n19:33.040 --> 19:35.640\n countryside, what a great opportunity.\n\n19:35.640 --> 19:40.360\n I can paint this river, I could paint that bird, I could paint my friends or myself in\n\n19:40.360 --> 19:42.920\n the background, infinite choices.\n\n19:42.920 --> 19:45.240\n And this is a gift that I have been given.\n\n19:45.240 --> 19:49.140\n And I think that also ties very heavily into what I was, I went to yeshiva as a kid, which\n\n19:49.140 --> 19:50.380\n is Jewish school.\n\n19:50.380 --> 19:56.840\n What we were taught incessantly how to look at life is this beautiful gift that God has\n\n19:56.840 --> 19:59.960\n given you and that God wants you to be happy.\n\n19:59.960 --> 20:03.400\n He wants you to live to the fullest in a moral way.\n\n20:03.400 --> 20:08.160\n I remember the first time I went into a church and they were asking questions about the Jewish\n\n20:08.160 --> 20:09.200\n concept, the afterlife.\n\n20:09.200 --> 20:11.000\n They weren't familiar with Jewish thought.\n\n20:11.000 --> 20:13.200\n And it took me a second because I didn't really have answers.\n\n20:13.200 --> 20:18.300\n And then I remembered what we were taught, which is, let's suppose you're at this banquet,\n\n20:18.300 --> 20:22.340\n the best chef on earth, and the table is so heavy because you've got steaks and you've\n\n20:22.340 --> 20:29.120\n got chicken and you've got sushi and the wine's flowing and you've got your Dr. Pepper and\n\n20:29.120 --> 20:31.780\n Mr. Pibb and the store brand, everything you want.\n\n20:31.780 --> 20:34.860\n And you're looking around at this amazing bounty, right?\n\n20:34.860 --> 20:39.000\n And then you turn to this best chef on earth and you're like, oh, so what's for dessert?\n\n20:39.000 --> 20:44.400\n I mean, the offensiveness of that is just so insane.\n\n20:44.400 --> 20:45.800\n You have this, eat the meal.\n\n20:45.800 --> 20:50.140\n I promise you, if I could deliver this meal, the dessert's going to be okay.\n\n20:50.140 --> 20:56.760\n So this focus on the afterlife when we've been given this amazing gift on this earth\n\n20:56.760 --> 21:01.640\n is a very kind of different mindset from both the Jewish tradition as I'd been taught and\n\n21:01.640 --> 21:02.640\n the Camus mindset.\n\n21:02.640 --> 21:05.440\n Obviously, Camus was an atheist, didn't believe in an afterlife.\n\n21:05.440 --> 21:13.720\n This concept that life is meaningless, but that means you have that opportunity to find\n\n21:13.720 --> 21:17.540\n value, to seek for truth, to seek for happiness.\n\n21:17.540 --> 21:20.080\n And Camus has this quote, it's ascribed to him, it's like a meme.\n\n21:20.080 --> 21:24.080\n I've never found the source, so maybe he doesn't really say it, but he says, maybe it's not\n\n21:24.080 --> 21:26.740\n about happy endings, maybe it's about the journey.\n\n21:26.740 --> 21:30.240\n And I think when you have that mindset, and as you and I, I think you and I both found\n\n21:30.240 --> 21:34.640\n this because neither of us, when we were kids, thought we'd be doing this, right?\n\n21:34.640 --> 21:37.320\n But now that we are really fortunate.\n\n21:37.320 --> 21:38.320\n Definitely this.\n\n21:38.320 --> 21:39.320\n Yeah.\n\n21:39.320 --> 21:40.320\n And definitely that.\n\n21:40.320 --> 21:41.320\n Yeah.\n\n21:41.320 --> 21:43.160\n But now that we're fortunate enough to do this, and that we're blessed enough that there's\n\n21:43.160 --> 21:47.240\n people who find this of value and interest, and we could pay the rent doing this, there's\n\n21:47.240 --> 21:53.320\n not a day that goes by where I don't think you and I think, this is pretty absurd, but\n\n21:53.320 --> 21:54.780\n it's also pretty wonderful.\n\n21:54.780 --> 22:00.640\n And as a consequence of us thriving, it also shows other people that happiness is possible\n\n22:00.640 --> 22:01.920\n on this earth.\n\n22:01.920 --> 22:05.080\n And I think cynicism is the lie.\n\n22:05.080 --> 22:10.120\n It's not just the worldview, it's a lie that happiness is not possible on this earth.\n\n22:10.120 --> 22:16.240\n Or it's only possible if you sell your soul and you're a bad person, you screw other people\n\n22:16.240 --> 22:17.240\n over.\n\n22:17.240 --> 22:20.200\n I reject that in every aspect.\n\n22:20.200 --> 22:21.880\n As you said, my birthday is coming up.\n\n22:21.880 --> 22:27.300\n I've been feeling just a lot of really great things have been happening very, very recently.\n\n22:27.300 --> 22:33.200\n So it affects me very heavily emotionally, especially when I see the response it gives\n\n22:33.200 --> 22:36.120\n to the kids.\n\n22:36.120 --> 22:38.800\n So it's one thing to say, this is what I'm for.\n\n22:38.800 --> 22:43.760\n But when you can provide proof of concept that what you've been advocating does result\n\n22:43.760 --> 22:45.160\n in positive responses.\n\n22:45.160 --> 22:50.300\n I got a message from this kid who had tried to kill himself a year ago.\n\n22:50.300 --> 22:54.000\n And then he was like, look, I found your work, I found some other stuff.\n\n22:54.000 --> 22:56.560\n And now I realized I'm going to make something of myself.\n\n22:56.560 --> 23:02.240\n I was born in a meth house, you know, whatever, 19, 20 years old, I should be in the garbage.\n\n23:02.240 --> 23:06.600\n But I'm going to try to be a stand up because I have opportunity on this earth.\n\n23:06.600 --> 23:11.600\n Even if he fails as a stand up, you know, he's still such whatever he does, washing\n\n23:11.600 --> 23:13.640\n dishes, there's no shame in that.\n\n23:13.640 --> 23:18.380\n Is it so bad to have a crappy job and a girlfriend who you don't really like?\n\n23:18.380 --> 23:20.960\n But as compared to the alternative of like, I'm going to kill myself.\n\n23:20.960 --> 23:21.960\n This is heaven.\n\n23:21.960 --> 23:27.600\n Well, I think there's beauty to be discovered in all of it and all of those experiences.\n\n23:27.600 --> 23:28.600\n Yes.\n\n23:28.600 --> 23:34.920\n So, but at the same time, so I often think about I just recently reread The Idiot by\n\n23:34.920 --> 23:35.920\n Dostoevsky.\n\n23:35.920 --> 23:38.120\n I often feel like the idiot.\n\n23:38.120 --> 23:43.280\n That's why when I say I'm an idiot, I often think about Prince Mishkin, that kind of idiot,\n\n23:43.280 --> 23:45.200\n which the world sees you as naive.\n\n23:45.200 --> 23:46.200\n I don't think he's naive.\n\n23:46.200 --> 23:53.800\n I don't think I'm naive, but I tend to see the good in people and the good in every moment.\n\n23:53.800 --> 23:57.440\n And the world often is cynical.\n\n23:57.440 --> 24:04.320\n And in fact, especially in what we do, often the intellectual is supposed to be cynical.\n\n24:04.320 --> 24:11.000\n This is very much an urban, elite, educated mindset, where if you write a book about someone\n\n24:11.000 --> 24:15.600\n who's, let's suppose, a drug addict or a prostitute, that has heft and that's valid.\n\n24:15.600 --> 24:19.120\n But if you're writing a book about like a love story, you know, two people fall in love\n\n24:19.120 --> 24:22.960\n and they're in roller coasters or carousels, that's less legitimate.\n\n24:22.960 --> 24:23.960\n I hate that.\n\n24:23.960 --> 24:24.960\n I hate that.\n\n24:24.960 --> 24:29.840\n I hate that so much because the message it gives to people is you have to choose between\n\n24:29.840 --> 24:34.400\n thriving and happiness and silliness and seriousness and depravity.\n\n24:34.400 --> 24:38.200\n And I'm not saying a drug addict or prostitute is depraved, but they're basically their worldviews.\n\n24:38.200 --> 24:40.960\n Unless it's dark and twisted, it doesn't really count as art.\n\n24:40.960 --> 24:43.960\n And I despise that mindset, that subtext.\n\n24:43.960 --> 24:47.440\n So the internet and people around me often will call me naive.\n\n24:47.440 --> 24:48.440\n Because I don't know.\n\n24:48.440 --> 24:49.440\n I think the word they want is innocent.\n\n24:49.440 --> 24:50.440\n Don't you think?\n\n24:50.440 --> 24:51.440\n It's a better word.\n\n24:51.440 --> 24:52.440\n But it's not that innocent.\n\n24:52.440 --> 24:56.800\n No, but innocent in that you genuinely in your heart, I know you fairly well at this\n\n24:56.800 --> 25:02.440\n point, believe that goodness is possible and that people can, if not be good, at least\n\n25:02.440 --> 25:04.040\n be better than they were yesterday.\n\n25:04.040 --> 25:09.880\n See, even the word naive or the word innocent presumes that there's not wisdom in that.\n\n25:09.880 --> 25:16.200\n Presumes that somehow that's, oh, isn't that beautiful to live that life of a child who\n\n25:16.200 --> 25:21.280\n sees the world with these bright eyes and is hopeful about the future, but just wait\n\n25:21.280 --> 25:26.080\n until they grow up and realize that reality is much harsher than they think.\n\n25:26.080 --> 25:31.360\n But that child might be wiser than all of the adults in the room.\n\n25:31.360 --> 25:36.200\n And don't you want to be, if the world is like that, don't you want to be the guy who\n\n25:36.200 --> 25:39.120\n takes it on and changes it for the better?\n\n25:39.120 --> 25:42.360\n So it's like saying, well, you know, cancer is everywhere.\n\n25:42.360 --> 25:43.360\n It's inevitable.\n\n25:43.360 --> 25:45.920\n Well, don't you want to be the one who says, not anymore.\n\n25:45.920 --> 25:51.280\n I'm here and I'm going to make that change and I can see it being better than it is now.\n\n25:51.280 --> 25:58.200\n So I think you and I have the same analysis of your worldview and I don't think that there\n\n25:58.200 --> 25:59.900\n is a good word for it.\n\n25:59.900 --> 26:05.480\n So I guess it's this idea of inherent benevolence might be wordy, but I think that's more accurate\n\n26:05.480 --> 26:11.260\n because, you know, you and I did not have such easy lives growing up, to put it mildly.\n\n26:11.260 --> 26:15.960\n You constantly talk about just horrific aspects of life.\n\n26:15.960 --> 26:20.040\n So to claim that you kind of don't know that they exist or you sleep under the rug is completely\n\n26:20.040 --> 26:25.120\n not accurate to your work and your mindset.\n\n26:25.120 --> 26:30.320\n Can we talk about World War II and the Soviet Union?\n\n26:30.320 --> 26:31.720\n Sure.\n\n26:31.720 --> 26:41.140\n So on Sunday, June 22nd, 1941, Hitler launched Operation Barbarossa, which was the surprise\n\n26:41.140 --> 26:43.960\n invasion of the Soviet Union.\n\n26:43.960 --> 26:49.920\n If I could read to you a few lyrics from a song that for some reason is stuck throughout\n\n26:49.920 --> 26:50.920\n my childhood.\n\n26:50.920 --> 26:54.240\n It was a famous song during that time.\n\n26:54.240 --> 27:02.000\n Двадцать второго июня ровно в четыре часа Киев бомбили, нам объявили, что\n\n27:02.000 --> 27:09.640\n началась война, война началась на рассвете, чтобы больше народу убить, спали родители,\n\n27:09.640 --> 27:14.120\n спали их дети, когда стали Киев бомбить.\n\n27:14.120 --> 27:21.280\n The song talks about Kiev, like that moment as part of that operation that Kiev was first\n\n27:21.280 --> 27:24.520\n bombed and it was announced on June 22nd.\n\n27:24.520 --> 27:28.880\n The song says at exactly four o clock that the war has begun.\n\n27:28.880 --> 27:39.760\n For some reason this song haunts me because the exactness of that time and this realization\n\n27:39.760 --> 27:46.360\n that at any moment you can have this thing happen to you in your own personal life.\n\n27:46.360 --> 27:52.840\n Maybe we had something like 9 11 happen where everything changes and it's just like haunting\n\n27:52.840 --> 27:57.960\n because it makes me think that at any moment something like that could happen that changes\n\n27:57.960 --> 28:05.800\n everything and I just think about like normal life going on in Kiev at the time and then\n\n28:05.800 --> 28:10.880\n all of a sudden the bombs are dropping and they announce that the war has begun and you\n\n28:10.880 --> 28:23.000\n thought you were going to stay out of the war.\n\n28:23.000 --> 28:28.720\n This is something that is very intensely emotional for me because you and I are both Russian\n\n28:28.720 --> 28:37.940\n Jewish so to know that my grandparents and my great grandma were told that the Nazis\n\n28:37.940 --> 28:45.160\n are coming and this wasn't a dress rehearsal and that if they get here, which they do,\n\n28:45.160 --> 28:50.680\n they did, Lvov is very western Ukraine, that 100% you and all your relatives are going\n\n28:50.680 --> 28:56.600\n to be murdered.\n\n28:56.600 --> 29:02.920\n There's a monument now in Lvov where I'm from about this but I don't think either of us\n\n29:02.920 --> 29:13.720\n can imagine what it's like to think that we're about minutes or whatever hours or there's\n\n29:13.720 --> 29:20.600\n just the Russian army standing between us and everyone we are related to are going to\n\n29:20.600 --> 29:29.560\n be murdered for no reason and what's the closure here?\n\n29:29.560 --> 29:35.720\n They evacuated a lot of people but they didn't evacuate enough and to know that there is\n\n29:35.720 --> 29:45.920\n this force coming to 100% murder you, this isn't some kind of the TV news being hyperbolic,\n\n29:45.920 --> 29:52.280\n they're coming to kill you and if they get you, they will kill you.\n\n29:52.280 --> 29:57.960\n We all think about war like, oh, we hope America wins in Iraq, but if America got their ass\n\n29:57.960 --> 30:03.640\n get kind of in Vietnam, it's not really going to affect America in the sense that you're\n\n30:03.640 --> 30:06.560\n going to have the body bags and all the kids being killed and that's something that I'm\n\n30:06.560 --> 30:11.360\n not super in the rug, but no one in America thought the Vietnamese are going to come here\n\n30:11.360 --> 30:12.360\n and kill them, right?\n\n30:12.360 --> 30:13.960\n They were secure in their person.\n\n30:13.960 --> 30:23.800\n So to have that sense of we really need to win because if we don't win, we are 100% if\n\n30:23.800 --> 30:30.280\n we, they, the Russian army doesn't win, we are 100% all going to be slaughtered and often\n\n30:30.280 --> 30:36.460\n in not just a bullet to the head and in sadistic ways is something that to know that people\n\n30:36.460 --> 30:45.480\n who share my blood saw and went through is very hard for me to kind of wrap my head around.\n\n30:45.480 --> 30:48.600\n And there's no possibility to delude yourself.\n\n30:48.600 --> 30:49.960\n Yeah, yeah, yeah.\n\n30:49.960 --> 30:55.040\n Because I mean, they, they would, as the song also talks about, but that they would burn\n\n30:55.040 --> 30:56.640\n the factories.\n\n30:56.640 --> 31:00.120\n So it's basically saying we're in the war now.\n\n31:00.120 --> 31:02.480\n This is like, this is your life.\n\n31:02.480 --> 31:03.480\n Yeah.\n\n31:03.480 --> 31:04.480\n Like this is our life now.\n\n31:04.480 --> 31:07.560\n You know how you, yesterday you worried about like, oh, I misplaced my pen.\n\n31:07.560 --> 31:08.560\n Where is it?\n\n31:08.560 --> 31:11.760\n Like, it's like, yeah, this was paradise.\n\n31:11.760 --> 31:17.680\n Most of us are going to just, our life now is that most of us are going to die.\n\n31:17.680 --> 31:23.840\n And if we want to prevent all of us from dying, we, we have to fight.\n\n31:23.840 --> 31:30.040\n And we also can't sit down in some kind of weird, like, desert island or, you know, plane\n\n31:30.040 --> 31:33.880\n crash situation and be like, let's decide between us who's going to be the first to\n\n31:33.880 --> 31:34.880\n die.\n\n31:34.880 --> 31:36.880\n Maybe the like Titanic, the Titanic, right?\n\n31:36.880 --> 31:40.020\n They sat down and there were like women and children in the lifeboats.\n\n31:40.020 --> 31:41.800\n You know, they had this rational agreement.\n\n31:41.800 --> 31:44.560\n You don't have those choices in a war.\n\n31:44.560 --> 31:52.280\n So it's, it's something that I, it's, it's just very chilling and it's something I don't\n\n31:52.280 --> 31:58.400\n really have the emotional space to understand or grapple with.\n\n31:58.400 --> 32:04.440\n Even, you know, obviously I've been to North Korea, you can see it and so on and so forth.\n\n32:04.440 --> 32:10.100\n You and I can't, or anyone listening to this, except for maybe on me and people like that,\n\n32:10.100 --> 32:13.080\n you can't imagine what that's like to live it.\n\n32:13.080 --> 32:18.400\n We can't, I, we can't imagine what it's like to live in those situations where it's not\n\n32:18.400 --> 32:23.200\n like before Hitler came, everyone's, you know, dancing around and having a great time.\n\n32:23.200 --> 32:29.360\n I mean, imagine how, what that life is like where your preference to Hitler is starving\n\n32:29.360 --> 32:33.640\n and waiting on line for hours for bread and to have the secret police and your friend's\n\n32:33.640 --> 32:36.600\n attorney went and your phones are all tapped and you're a prisoner.\n\n32:36.600 --> 32:40.520\n But to you, this is infinitely better than the alternative.\n\n32:40.520 --> 32:45.200\n Like these are the choices that, you know, our family had to deal with.\n\n32:45.200 --> 32:50.440\n It's something that no matter how much you, it's like a, let me put it in terms of people\n\n32:50.440 --> 32:51.440\n can understand, you know what I mean?\n\n32:51.440 --> 32:53.720\n It's like your first bad breakup, right?\n\n32:53.720 --> 32:57.920\n Like that's a much simpler thing to wrap your head around because it's like, if you've never\n\n32:57.920 --> 33:02.160\n had it, you can't really, but when you feel it, it's just so intense, but you can't tell\n\n33:02.160 --> 33:07.400\n someone what's like, we could sit down for days and hours and have people tell us, but\n\n33:07.400 --> 33:13.440\n until it's the totality of your environment and your life and your mindset, I remember\n\n33:13.440 --> 33:30.240\n my grandma, she would talk about it like, when you're that hungry, all you're thinking\n\n33:30.240 --> 33:36.440\n about is bread because your brain won't like, you know, human beings, you know, we're evolved,\n\n33:36.440 --> 33:42.720\n we have instincts, whatever, and the mind is telling you food, food, food, food, food,\n\n33:42.720 --> 33:48.960\n and that there's kids thinking this and that they're not going to get the food.\n\n33:48.960 --> 33:54.320\n And imagine being a parent and you're watching your kids without food and knowing they're\n\n33:54.320 --> 33:56.600\n not going to get the food.\n\n33:56.600 --> 34:04.960\n And the fact that this happened in North Korea in the nineties, I met a refugee and he had\n\n34:04.960 --> 34:07.560\n to watch his dad starve to death.\n\n34:07.560 --> 34:11.320\n And thank you.\n\n34:11.320 --> 34:19.520\n And we have no concept of what it's like.\n\n34:19.520 --> 34:25.480\n I mean, we kind of, you know, it's just like last night here in Austin, all the places\n\n34:25.480 --> 34:28.640\n were closed and I couldn't get my protein powder.\n\n34:28.640 --> 34:34.580\n And this is the extent of my suffering when it comes to food, you know, or if I couldn't,\n\n34:34.580 --> 34:40.240\n there was a restaurant that I went to in Brooklyn where for some faqaqta reason, they weren't\n\n34:40.240 --> 34:44.760\n serving sashimi, they only had sushi, so I had to have the rice and the carbs.\n\n34:44.760 --> 34:51.160\n To live a life where that is the extent of your food problems as opposed to the choice\n\n34:51.160 --> 34:55.240\n is either Hitler killing you or being hungry 24 seven.\n\n34:55.240 --> 35:00.200\n You know, my grandma told this story of how they had a close call, it was her and her\n\n35:00.200 --> 35:05.040\n brother and her mom, my great grandma who passed, and I think there was like either\n\n35:05.040 --> 35:11.680\n helicopter overhead or something, and my great grandma jumped on top of my grandma's brother\n\n35:11.680 --> 35:12.680\n and not my grandma.\n\n35:12.680 --> 35:18.920\n So she basically did a Sophie's Choice, my grandma's name is Sophia, and chose the brother.\n\n35:18.920 --> 35:23.280\n And this is something that she felt, you know, all her life that her mom had chosen her brother\n\n35:23.280 --> 35:24.480\n over her.\n\n35:24.480 --> 35:29.720\n But these little things that happen, these little kind of decisions we have to make in\n\n35:29.720 --> 35:30.720\n life.\n\n35:30.720 --> 35:37.080\n Or there's a book I read called Five Chimneys, I think, this woman who was an Auschwitz survivor.\n\n35:37.080 --> 35:42.640\n And what she talked about what people don't appreciate, it's not necessarily the slaughter\n\n35:42.640 --> 35:46.200\n and the torture, it's that there's no rhyme or reason to it.\n\n35:46.200 --> 35:51.560\n Like she talked about how they had a camp just for people from Czechoslovakia, and they\n\n35:51.560 --> 35:55.680\n were treated better than the Jews, and then one day they just killed them all, right?\n\n35:55.680 --> 36:00.320\n And she's like, I still don't understand why they're giving them food and treating them\n\n36:00.320 --> 36:04.960\n well, and then the next day they're all killed, and we will never get answers, you know.\n\n36:04.960 --> 36:12.440\n And things like she talks about how they decided to kill all the kids, and they didn't really\n\n36:12.440 --> 36:16.480\n either for some reason they didn't have the courage to or they wanted to be cruel, so\n\n36:16.480 --> 36:20.200\n instead of shooting them, they just kept walking them in the snow until they all died.\n\n36:20.200 --> 36:26.280\n So it's things like this, that the fact that you and I dodged these bullets, and that we\n\n36:26.280 --> 36:33.120\n can be here and be doing this and, you know, running our mouths for a living, I think about\n\n36:33.120 --> 36:43.320\n it all the time, and it's just very disturbing to know, and I know you know this as well,\n\n36:43.320 --> 36:46.960\n that there's lots of places on earth where if people had a choice, they would kill us\n\n36:46.960 --> 36:49.200\n on sight and be proud of themselves for it.\n\n36:49.200 --> 36:54.760\n Yeah, there, I don't know what to make of the contrast, you were talking about the fact\n\n36:54.760 --> 37:00.920\n that you've been truly happy the last few weeks and months, there's been a lot of moments\n\n37:00.920 --> 37:08.000\n of happiness and joy, and that joy is built on a history of human suffering.\n\n37:08.000 --> 37:13.260\n Like in your roots, in your blood, is a lot of people that were tortured that suffered,\n\n37:13.260 --> 37:18.160\n so that you could have this joy, and you have both the, you have the responsibility to truly\n\n37:18.160 --> 37:20.020\n be grateful for that joy.\n\n37:20.020 --> 37:24.080\n But it also shows that there's the happy ending, that it does end, and a good note that it\n\n37:24.080 --> 37:27.880\n does get infinitely, infinitely better.\n\n37:27.880 --> 37:34.520\n And that I think there's a, I don't like using the word responsibility, but there is an opportunity\n\n37:34.520 --> 37:41.160\n for those of us who did dodge that bullet, to give testimony to these people.\n\n37:41.160 --> 37:46.340\n And more importantly, to give testimony to the people who are going through this now.\n\n37:46.340 --> 37:51.780\n So one of the reasons I talk about North Korea so much, why I wrote Dear Reader, is because\n\n37:51.780 --> 37:57.160\n it's very easy, and this is human nature, I'm not condemning people, I think that's\n\n37:57.160 --> 37:58.620\n just how people are wired.\n\n37:58.620 --> 38:04.360\n When you see an Asian country with Asian people, and things are bad over there, I think in\n\n38:04.360 --> 38:08.600\n the West it's like, oh, Asia, they're all crazy, they're wacky, they eat dogs or so\n\n38:08.600 --> 38:12.900\n on and so forth, some weird stereotype, and they think of them as kind of Martians.\n\n38:12.900 --> 38:18.840\n So it's important for people who aren't of that kind of ancestry to kind of speak on\n\n38:18.840 --> 38:22.740\n behalf of these people, because it's very different how just people just naturally react\n\n38:22.740 --> 38:25.480\n when you have a Westerner talking about this.\n\n38:25.480 --> 38:31.080\n Instead of it becoming them over there, it becomes, you know, this could have been us\n\n38:31.080 --> 38:32.080\n very easily.\n\n38:32.080 --> 38:36.520\n I have a friend, Peter Vahansky, great dude, and I was showing him photos when I was in\n\n38:36.520 --> 38:40.320\n Pyongyang, and he goes, this looks like a Russian city with Asian people.\n\n38:40.320 --> 38:42.640\n It completely disturbed him.\n\n38:42.640 --> 38:46.560\n So that was one of the reasons I did go to North Korea, because that was as close as\n\n38:46.560 --> 38:50.800\n I would get to see what your family went through, to see what my family went through, and they're\n\n38:50.800 --> 38:54.680\n still living under this regime.\n\n38:54.680 --> 38:58.600\n And one of the things I fought very hard to do with Dear Reader, which I was successful\n\n38:58.600 --> 39:02.920\n in amazingly, and I said, I could die now.\n\n39:02.920 --> 39:08.100\n I feel like if you just move the needle a little bit, then you've kind of paid your\n\n39:08.100 --> 39:14.560\n due for your time here on this earth, to have it change from being a laughing stock.\n\n39:14.560 --> 39:17.200\n And I think Team America did a good job.\n\n39:17.200 --> 39:22.240\n They made Kim Jong Il into a clown and they made a joke of it, but you're going from nothing\n\n39:22.240 --> 39:23.240\n to joke.\n\n39:23.240 --> 39:26.100\n So at least now people are aware of it that it exists, right?\n\n39:26.100 --> 39:32.040\n And then I and many others took it from a joke to like, guys, this is really, really,\n\n39:32.040 --> 39:35.560\n really bad, and none of us can even appreciate how bad it is.\n\n39:35.560 --> 39:38.920\n And I think now there is an understanding, other than a few people who are just looking\n\n39:38.920 --> 39:41.800\n at it through a Trump lens and wanting Trump to fail because Trump's an asshole and that's\n\n39:41.800 --> 39:45.160\n fine, to be like these poor people.\n\n39:45.160 --> 39:50.680\n And it's really unfortunate because there's a segment of Western culture who thinks that\n\n39:50.680 --> 39:58.040\n correctly, often when you're complaining about or discussing the plight of another country,\n\n39:58.040 --> 40:01.120\n that's just your prelude to war and an excuse to invade.\n\n40:01.120 --> 40:04.360\n Like the Kurds in Syria, you know, we're talked about, if we don't in Syria tomorrow, it's\n\n40:04.360 --> 40:06.360\n going to be another genocide, blah, blah.\n\n40:06.360 --> 40:09.240\n I'm not saying let's invade North Korea and things like that.\n\n40:09.240 --> 40:14.440\n All I'm saying is, you know, thank God that this isn't your life.\n\n40:14.440 --> 40:15.960\n I bring this up all the time.\n\n40:15.960 --> 40:22.160\n The woman who was my guide when I was there, I'm aware of what she's up to now.\n\n40:22.160 --> 40:28.680\n She's extremely rich by North Korean standards, but she'll never be in a position to buy medicine.\n\n40:28.680 --> 40:31.580\n She'll never be in a position to go on a vacation.\n\n40:31.580 --> 40:36.440\n Things that you and I just, you know, whatever, she can't go on the internet.\n\n40:36.440 --> 40:39.260\n She can't get an encyclopedia.\n\n40:39.260 --> 40:44.000\n She can't better herself as a person other than through what the state allows and meaning\n\n40:44.000 --> 40:47.240\n better yourself as a person in service to the state.\n\n40:47.240 --> 40:54.520\n So I mean, it's also frustrating because there's only so much that I can do as an individual.\n\n40:54.520 --> 40:59.240\n What's your takeaway about human nature from looking at North Korea and looking at how\n\n40:59.240 --> 41:02.880\n the rest of the world is looking at North Korea?\n\n41:02.880 --> 41:03.880\n This is a great question.\n\n41:03.880 --> 41:05.400\n I think about it fairly often.\n\n41:05.400 --> 41:08.040\n I always say human beings are animals, right?\n\n41:08.040 --> 41:12.440\n When you say someone's an animal, it's like a slur, like he's like a beast.\n\n41:12.440 --> 41:16.840\n Animals are capable of enormous kindness, empathy, sympathy.\n\n41:16.840 --> 41:19.920\n You know, they look out for one another, groom one another.\n\n41:19.920 --> 41:24.560\n There's a thing with apes where they groom each other for parasites and even if there\n\n41:24.560 --> 41:28.620\n are no parasites, they pretend there's parasites just to have that kind of bonding.\n\n41:28.620 --> 41:34.880\n You see infinite photos online of like cats raising puppies because the puppies, mom died,\n\n41:34.880 --> 41:35.940\n things like this.\n\n41:35.940 --> 41:37.360\n That's part of being an animal.\n\n41:37.360 --> 41:42.480\n Part of being an animal is also just the most monstrous cruelty.\n\n41:42.480 --> 41:46.320\n Killer whales, you know, there's this big PC move to not call them killer whales and\n\n41:46.320 --> 41:47.720\n just call them orcas.\n\n41:47.720 --> 41:53.840\n They will murder blue whale pups, calves, excuse me, and play with them and not even\n\n41:53.840 --> 41:54.840\n eat them.\n\n41:54.840 --> 41:58.160\n So they just murder for the sake of fun.\n\n41:58.160 --> 42:00.740\n Even cats, you know, kill birds all the time, things like this.\n\n42:00.740 --> 42:03.280\n So it runs the whole gamut.\n\n42:03.280 --> 42:07.840\n And I think it's, you know, when Yaron and I were on your show, I don't think Lord of\n\n42:07.840 --> 42:08.840\n the Flies is accurate.\n\n42:08.840 --> 42:14.140\n I don't think Hobbs is how reality works when you're in that kind of state.\n\n42:14.140 --> 42:21.240\n But I think we've seen countless examples of human beings, especially when human beings\n\n42:21.240 --> 42:28.040\n have power over someone who's powerless, of allowing themselves to engage in not just\n\n42:28.040 --> 42:31.340\n harm, but cruelty.\n\n42:31.340 --> 42:35.560\n And that is something as Soviets, you and I are very painfully aware of.\n\n42:35.560 --> 42:40.680\n It's not just about the oppression, which as bad enough as it is, it's that mediocre\n\n42:40.680 --> 42:43.800\n person with that little bit of power.\n\n42:43.800 --> 42:50.000\n And now they're standing between you and your daughter having medicine, and they love it\n\n42:50.000 --> 42:54.340\n to make you dance, to be like, oh, you need me to get this medicine?\n\n42:54.340 --> 42:56.160\n Make you go through hoops?\n\n42:56.160 --> 42:59.280\n Because now they feel like for the first time in their life, they're in a position of strength\n\n42:59.280 --> 43:00.280\n and power.\n\n43:00.280 --> 43:05.400\n I think that is, in many ways, the more common nature of evil that what Hannah Arendt talks\n\n43:05.400 --> 43:09.440\n about the banality of evil, then someone who's like an SS guard, you're shooting someone\n\n43:09.440 --> 43:10.440\n in the head.\n\n43:10.440 --> 43:14.800\n Like that, I think we could all wrap our heads around to some extent, like, okay, I'm a military.\n\n43:14.800 --> 43:15.800\n It's not easy.\n\n43:15.800 --> 43:18.900\n I have to execute people pulling a trigger, you could kind of have this mental disconnect\n\n43:18.900 --> 43:20.880\n between the finger and the victim.\n\n43:20.880 --> 43:24.280\n But like that little day to day stuff, like, are you doing the right thing on a day to\n\n43:24.280 --> 43:29.100\n day basis that I think is far more common, and far more disturbing aspect in certain\n\n43:29.100 --> 43:30.920\n senses of the human psyche.\n\n43:30.920 --> 43:43.320\n Yeah, there's something especially disturbing about a weak man, given power, and just abusing\n\n43:43.320 --> 43:44.320\n that power.\n\n43:44.320 --> 43:49.480\n There's something about not just weak, but like, mediocre at everything it does, or less\n\n43:49.480 --> 43:50.480\n than mediocre.\n\n43:50.480 --> 43:55.000\n A great example of this, which I'm also talking about in the next book is Ceausescu, who was\n\n43:55.000 --> 43:56.420\n the dictator of Romania.\n\n43:56.420 --> 44:02.900\n So you know, the Cold War is still somewhat poorly understood in, you know, popular culture.\n\n44:02.900 --> 44:06.980\n But the different countries in the second world, the Soviet bloc, some are more liberal\n\n44:06.980 --> 44:08.800\n than others, some are more sane than others.\n\n44:08.800 --> 44:13.400\n And Ceausescu, at first was one of the, you know, more Western friendly, more the free\n\n44:13.400 --> 44:14.400\n ones.\n\n44:14.400 --> 44:17.760\n Then he met the great leader Kim Il Sung from North Korea, and he had the idea to impose\n\n44:17.760 --> 44:22.360\n a personality cult on Romania, and it's the kind of things like forcing people to breed\n\n44:22.360 --> 44:24.440\n because he wanted to make people taller.\n\n44:24.440 --> 44:28.200\n I think he made like the biggest building in all of Europe, the People's Palace, but\n\n44:28.200 --> 44:31.900\n it was just for him, while there's no electricity, you know, elsewhere.\n\n44:31.900 --> 44:34.680\n But you look at this guy, you know, Stalin's a badass, right?\n\n44:34.680 --> 44:35.680\n He was a bank robber.\n\n44:35.680 --> 44:37.920\n If you look at photos of him as a kid, he was a hunk.\n\n44:37.920 --> 44:39.920\n Lenin was clearly intellectual.\n\n44:39.920 --> 44:46.120\n These were powerful Trotsky, these were powerful men with huge egos, huge force of personality.\n\n44:46.120 --> 44:52.240\n But you look at this Ceausescu guy, and you could, like for example, on my driver's license,\n\n44:52.240 --> 44:56.640\n instead of my address, I'm not giving my real address, being like 1, 2, 3, 4, 5th Avenue,\n\n44:56.640 --> 44:59.800\n by mistake it says 1, 2, 3, 4, 5th Street, right?\n\n44:59.800 --> 45:04.000\n So you can imagine him being in the post office and me giving him my ID to get my package\n\n45:04.000 --> 45:08.240\n and him being baffled because this says street, this says Avenue instead of understanding.\n\n45:08.240 --> 45:12.620\n And this, the look on his face, this dullard, that you can see how, you know how sometimes\n\n45:12.620 --> 45:15.160\n I'm going to, can I curse?\n\n45:15.160 --> 45:16.160\n Fuck yes.\n\n45:16.160 --> 45:17.160\n Yeah.\n\n45:17.160 --> 45:18.280\n So if you know, like how if you're in the airport and you see someone and you look at\n\n45:18.280 --> 45:21.960\n them and an adult and you think, okay, this person was born fucked up, just like on sight,\n\n45:21.960 --> 45:22.960\n like something's wrong with them.\n\n45:22.960 --> 45:24.060\n How are they traveling alone?\n\n45:24.060 --> 45:28.040\n You look at Ceausescu, you look at him, you're like, something's not right with this guy.\n\n45:28.040 --> 45:31.340\n Not in the sense of like evil, but in the sense of he's a simpleton, right?\n\n45:31.340 --> 45:35.160\n And now he's in charge of this whole country and everyone's taught to regard him as one\n\n45:35.160 --> 45:37.440\n of the great geniuses of all time.\n\n45:37.440 --> 45:43.400\n And it's this, the idea, this mediocre nobody, this guy would have in any other culture been\n\n45:43.400 --> 45:49.280\n accomplished nothing or would have had an honest job where he's like, okay, he works\n\n45:49.280 --> 45:52.780\n at the mail service and he's bad at it, okay, fine, he's not hurting anyone.\n\n45:52.780 --> 45:58.380\n And now as a result of this, he's responsible for mass death, secret police, and incarceration.\n\n45:58.380 --> 46:03.440\n And you know, one of the greatest things I've ever seen, which I'm sure many people see\n\n46:03.440 --> 46:08.480\n as well, if you go on YouTube, it's his speech, and it's the first time the crowd turns and\n\n46:08.480 --> 46:11.880\n his head kind of like, because they start booing him, which was unheard of.\n\n46:11.880 --> 46:16.700\n And he was shot with his dog faced wife not that long after, it was just a great moment.\n\n46:16.700 --> 46:22.220\n But it's things like this, I agree with you, that mediocre, weak person is now in a position\n\n46:22.220 --> 46:24.120\n of power over somebody else.\n\n46:24.120 --> 46:29.160\n And that sense of vindictiveness, like I'm going to feel strong for once in my life,\n\n46:29.160 --> 46:31.000\n but it's going to be at your expense.\n\n46:31.000 --> 46:34.640\n That I think is, you know, human nature, it's most primal.\n\n46:34.640 --> 46:39.040\n And every time I meet a person in this world, you're the first person to get me to cry on\n\n46:39.040 --> 46:40.040\n a fucking podcast.\n\n46:40.040 --> 46:41.840\n Fucking the robot gets me to cry.\n\n46:41.840 --> 46:43.400\n What the fuck is going on?\n\n46:43.400 --> 46:52.240\n Every time I meet a weird person, somebody, to me, heroism is also taking a risk to rebel\n\n46:52.240 --> 46:55.640\n against mediocrity.\n\n46:55.640 --> 47:02.240\n Like in the most simplest of ways, like the license address, like taking a risk to break\n\n47:02.240 --> 47:07.720\n the little bit of rule that nobody will know about, to take that little bit of a leap of\n\n47:07.720 --> 47:11.080\n like that little protest against the bureaucracy.\n\n47:11.080 --> 47:14.400\n Like that Nazi guard where he just spoke out, he's like, hey lady.\n\n47:14.400 --> 47:15.400\n That's a big one.\n\n47:15.400 --> 47:16.400\n Oh, that's a big, sure.\n\n47:16.400 --> 47:19.600\n I mean, like literally at the line at Starbucks or something like that.\n\n47:19.600 --> 47:26.280\n Like even in the tiniest of ways, when I see people just like, it's almost like that little\n\n47:26.280 --> 47:32.040\n like glimmer in their eye, a wink, like we're in this together, there's all this conformity\n\n47:32.040 --> 47:33.640\n all around us.\n\n47:33.640 --> 47:38.920\n That's at a different time could have been Nazi Germany, could have been a Stalinist\n\n47:38.920 --> 47:39.920\n Soviet union.\n\n47:39.920 --> 47:40.920\n Sure.\n\n47:40.920 --> 47:41.920\n We're in this together.\n\n47:41.920 --> 47:47.080\n We're going to rebel against that conformity by just taking the risk, that little bit of\n\n47:47.080 --> 47:48.920\n risk against mediocrity.\n\n47:48.920 --> 47:50.400\n I don't know.\n\n47:50.400 --> 47:55.200\n And then once again, I see this in companies too.\n\n47:55.200 --> 48:00.960\n When I see the mediocrity, I see this, I used to work at Google, I see it in Google and\n\n48:00.960 --> 48:04.600\n when the companies grow, that mediocrity is overwhelming.\n\n48:04.600 --> 48:05.780\n The Peter principle, right?\n\n48:05.780 --> 48:06.780\n The Peter principle.\n\n48:06.780 --> 48:07.780\n Yeah.\n\n48:07.780 --> 48:16.120\n My hope is that all of us have the possibility for that glimmer, that risk taking, the leap\n\n48:16.120 --> 48:21.120\n of faith, whatever the heck that is, the leap out of the ordinary, out of the conformity,\n\n48:21.120 --> 48:22.540\n out of the mediocrity.\n\n48:22.540 --> 48:24.860\n So this is where you and I disagree.\n\n48:24.860 --> 48:28.960\n I think most, a lot of people are not capable of that.\n\n48:28.960 --> 48:30.760\n They're accustomed to it.\n\n48:30.760 --> 48:32.680\n I don't know if they're not capable.\n\n48:32.680 --> 48:34.400\n I understand your position.\n\n48:34.400 --> 48:35.400\n I'm disagreeing with it.\n\n48:35.400 --> 48:36.840\n I'm saying I do not think they're capable.\n\n48:36.840 --> 48:40.720\n I think a lot of people effectively don't have souls.\n\n48:40.720 --> 48:45.680\n They do not have a conscience in this sense where they're going to look at an issue, bring\n\n48:45.680 --> 48:51.720\n their critical thinking and say, all right, I am going to do the right thing, although\n\n48:51.720 --> 48:52.720\n I'm taking a risk.\n\n48:52.720 --> 48:56.120\n Do you think thinking is involved or is it just taking that leap?\n\n48:56.120 --> 48:58.760\n There's something about that basic human spirit.\n\n48:58.760 --> 49:00.720\n Forget the thinking part.\n\n49:00.720 --> 49:06.740\n It's just saying, I'll take that risk, taking that adventure, the same thing that got people\n\n49:06.740 --> 49:18.400\n to explore the seas throughout human civilization, explore land, explore the oceans, that exploration.\n\n49:18.400 --> 49:21.920\n We've done stuff this way all this time.\n\n49:21.920 --> 49:25.040\n I'm going to take a leap and that comes out of nowhere seemingly.\n\n49:25.040 --> 49:30.760\n But those people are the heroes, but I don't think that's universal.\n\n49:30.760 --> 49:33.420\n I'm going to use a very gauche example.\n\n49:33.420 --> 49:37.240\n There was a show called Scare Tactics, which was basically a candid camera, but they would\n\n49:37.240 --> 49:38.240\n scare people.\n\n49:38.240 --> 49:45.240\n They'd have vampires, whatever, a hidden camera and people's reactions.\n\n49:45.240 --> 49:48.920\n Sometimes the prank didn't work out like they expected.\n\n49:48.920 --> 49:54.200\n There was one where they were hiring the people who were the marks, the contestants so to speak,\n\n49:54.200 --> 49:56.560\n was hired to be a security guard.\n\n49:56.560 --> 50:00.720\n You have to watch this factory overnight and you get paid.\n\n50:00.720 --> 50:05.840\n But the setup was some people were breaking out of the factory in the middle of the night\n\n50:05.840 --> 50:10.360\n like in rags and they were saying they were keeping us prisoner here, blah, blah, and\n\n50:10.360 --> 50:12.600\n just watch the person reaction to this.\n\n50:12.600 --> 50:19.000\n There was one security guard where he basically forced them back into the building and they're\n\n50:19.000 --> 50:20.960\n working us 24 seven, we're getting beaten.\n\n50:20.960 --> 50:24.500\n He's like, I'm here to do a job, get back in there.\n\n50:24.500 --> 50:30.080\n You watch this and it never even enters his head to be like, something's wrong here.\n\n50:30.080 --> 50:37.600\n He was given his orders, he's following his orders and to me, that is not uncommon and\n\n50:37.600 --> 50:43.200\n that person, although they look like you and I, there's something essentially human missing\n\n50:43.200 --> 50:44.200\n with them.\n\n50:44.200 --> 50:49.920\n Now, very quickly, the reaction is, well, it's one step from there to Nazism.\n\n50:49.920 --> 50:54.560\n I don't think it's something that, I'm not saying this person should be killed, but I'm\n\n50:54.560 --> 51:02.640\n just saying to expect that every human being has the capacity to have that defiance, especially\n\n51:02.640 --> 51:07.440\n at a cost to their own life, that I think is not realistic.\n\n51:07.440 --> 51:13.680\n But at the same time, I feel like an octopus on the eighth hand, it is those few of us,\n\n51:13.680 --> 51:20.640\n or if you want to include me in this, who do make these tiny little protests, who look\n\n51:20.640 --> 51:25.480\n the other way when someone is hungry, who's stealing food from the supermarket, right?\n\n51:25.480 --> 51:30.040\n It's like, all right, I'm going to pretend I didn't see anything.\n\n51:30.040 --> 51:37.420\n Those little elements of heroism are what move humanity forward and demonstrate the\n\n51:37.420 --> 51:42.260\n validity of the human experience, whereas everyone else is kind of like scenery.\n\n51:42.260 --> 51:48.560\n I think almost everybody in the world can derive deep meaning and pleasure from having\n\n51:48.560 --> 51:54.280\n done those courageous acts, and I also think they have the capacity to do them, to discover\n\n51:54.280 --> 51:55.480\n that meaning and happiness.\n\n51:55.480 --> 51:57.560\n So you're the cynic, then why aren't they doing it?\n\n51:57.560 --> 52:05.340\n They haven't gotten a chance to, like I've never tried LSD or DMT, you haven't gotten\n\n52:05.340 --> 52:09.760\n the chance to try this amazing journey, which is taking the risk.\n\n52:09.760 --> 52:15.320\n That's nonsense, because as you just said two minutes ago, everyone has that chance\n\n52:15.320 --> 52:17.800\n every day to do the right thing.\n\n52:17.800 --> 52:20.760\n We have the chance to do a lot of things and we don't realize.\n\n52:20.760 --> 52:24.960\n There's a lot of stuff right in front of our nose that we don't realize, because you have\n\n52:24.960 --> 52:26.680\n to kind of wake up to it.\n\n52:26.680 --> 52:33.040\n Sometimes you need the catalyst, there needs to be some kind of thing that happens that\n\n52:33.040 --> 52:36.000\n wakes you up.\n\n52:36.000 --> 52:42.440\n The fact that most people don't take the small acts of rebellion doesn't mean they don't\n\n52:42.440 --> 52:49.000\n have the capacity to both do so and to derive a lot of meaning from it.\n\n52:49.000 --> 52:55.120\n Then it's a discussion about how to create societies that get more and more people to\n\n52:55.120 --> 52:59.280\n be free actors and free thinkers.\n\n52:59.280 --> 53:00.720\n That's the question.\n\n53:00.720 --> 53:04.940\n That probably leads us into a discussion of anarchism and so on, but I just think we are\n\n53:04.940 --> 53:07.440\n very young as a species.\n\n53:07.440 --> 53:14.440\n We're trying to figure out how to get ourselves to first be collaborative, but at the same\n\n53:14.440 --> 53:16.480\n time be free spirits.\n\n53:16.480 --> 53:19.440\n I think both of those are within human nature for most of us.\n\n53:19.440 --> 53:25.880\n I think another big concern is that there's enormous disincentives, and this is Michael\n\n53:25.880 --> 53:31.960\n Malus speaking, for human beings to be kind and for tenderness.\n\n53:31.960 --> 53:36.400\n I think, especially when you're young, you know what I mean, when you're immature, a\n\n53:36.400 --> 53:40.840\n lot of times someone will reach out to you with kindness or vulnerability and you think\n\n53:40.840 --> 53:44.920\n it's funny to kind of dunk their head in the water in a pool or something like that.\n\n53:44.920 --> 53:50.440\n When you get older, there's this one example of this.\n\n53:50.440 --> 53:53.600\n This was in the 90s, and there was a woman.\n\n53:53.600 --> 53:58.880\n She became a stripper or something like that or whatever it was, but she had this amazing\n\n53:58.880 --> 53:59.880\n body.\n\n53:59.880 --> 54:01.240\n She was just gorgeous.\n\n54:01.240 --> 54:04.680\n The show was, she was talking about how when she was in high school, she was bullied a\n\n54:04.680 --> 54:07.240\n lot and that there was this football player.\n\n54:07.240 --> 54:10.160\n He messed with her every single day.\n\n54:10.160 --> 54:13.120\n One day, she even threw pickles in her hair and her hair smelled like pickles and it was\n\n54:13.120 --> 54:14.640\n laughing at her.\n\n54:14.640 --> 54:17.520\n This really screwed her up, I mean, up to that show.\n\n54:17.520 --> 54:21.280\n They took her backstage and they brought out the football player, and now he's a dad and\n\n54:21.280 --> 54:22.280\n a regular dude.\n\n54:22.280 --> 54:26.880\n He's like, do you know why you're here, and he's like, no, and they're like, oh, what\n\n54:26.880 --> 54:27.880\n were you like in high school?\n\n54:27.880 --> 54:30.200\n He's like, I was kind of a jock, bully, whatever.\n\n54:30.200 --> 54:34.640\n They brought her out, and he didn't even remember her really, and she just starts crying about\n\n54:34.640 --> 54:38.680\n the pickles and whatever, and this is something that affected her for 20 years, and I've never\n\n54:38.680 --> 54:43.560\n seen a clearer example of someone who wanted to kill themselves than this guy.\n\n54:43.560 --> 54:48.580\n The guilt on his face, and he's looking at her, and he's desperate to be like, what can\n\n54:48.580 --> 54:54.160\n I do to take your pain away, to make it better?\n\n54:54.160 --> 54:57.080\n He was just crippled by it because he knew there's nothing he could do.\n\n54:57.080 --> 54:59.640\n He knew he 100% did the wrong thing.\n\n54:59.640 --> 55:02.260\n He knew he did the wrong thing unthinkingly.\n\n55:02.260 --> 55:08.480\n You can imagine, I got to screw over this lady to feed my family, that's fine.\n\n55:08.480 --> 55:11.840\n At the time, it meant nothing to him, so of course he didn't remember, and he was just\n\n55:11.840 --> 55:14.560\n paralyzed by this sense of crippling guilt.\n\n55:14.560 --> 55:19.240\n One of the reasons I always try to do the right thing isn't because I'm an inherently\n\n55:19.240 --> 55:23.240\n good person, which I do not think I am, I don't think anyone is inherently good, but\n\n55:23.240 --> 55:29.020\n because I will feel guilty about it for a very, very long time because if you do the\n\n55:29.020 --> 55:35.760\n wrong thing, this is a very Camus idea, if you do the wrong thing to a good person, that's\n\n55:35.760 --> 55:39.120\n really, really bad because what kind of person are you?\n\n55:39.120 --> 55:44.180\n In the same way that everyone can be that guy who takes someone out for their birthday,\n\n55:44.180 --> 55:48.600\n everyone has that ability for someone who did the wrong thing to someone who's a normal\n\n55:48.600 --> 55:52.080\n person and do you want to be that guy as well?\n\n55:52.080 --> 56:00.920\n My friend, Bittstein, he's a big Bitcoin person, my biography ego in hubris is like $500 now\n\n56:00.920 --> 56:04.480\n on eBay, it's hard to find, came out in 2006.\n\n56:04.480 --> 56:11.100\n He had told me that you can get it on torrent, it's downloadable, and I'm like, oh, I thought\n\n56:11.100 --> 56:13.380\n if you're my friend, you'd want to buy it.\n\n56:13.380 --> 56:18.000\n At the time, it was not $500, I assure you, and he goes, I did buy it, I'm just telling\n\n56:18.000 --> 56:22.600\n you that you could also get it for free, this information that you might want to use.\n\n56:22.600 --> 56:30.840\n And I snapped at this kid who was doing right by me and I felt, it just stuck in my head,\n\n56:30.840 --> 56:32.780\n I'm like, you're an ass.\n\n56:32.780 --> 56:36.420\n And then years later, I apologize, he had no memory of this at all and I'm glad to be\n\n56:36.420 --> 56:38.320\n able to reiterate the apology again.\n\n56:38.320 --> 56:45.860\n But a lot of times I'm extremely aggressive on Twitter and in other venues, I always try\n\n56:45.860 --> 56:51.580\n to and maybe I fail and that's my moral failing, always do it as a counter attack.\n\n56:51.580 --> 56:55.400\n If you're going to start going personal, if you're going to start being aggressive against\n\n56:55.400 --> 57:00.360\n an individual, I'm not going to necessarily hold back when I reciprocate.\n\n57:00.360 --> 57:05.680\n And it's something that is very common on social media, but I don't think it is normal.\n\n57:05.680 --> 57:09.680\n Just because a lot of this, you're talking about the quiet little rebellion, just because\n\n57:09.680 --> 57:14.120\n everyone else around you thinks it's okay to just go up to people and attack them in\n\n57:14.120 --> 57:19.400\n the most personal ways, impromptu because of their views, really just take a step back\n\n57:19.400 --> 57:21.000\n and realize what you're engaging with.\n\n57:21.000 --> 57:26.800\n Now, if that's the fight they want, then my Soviet cruelty could come out and that's kind\n\n57:26.800 --> 57:32.200\n of why I don't drink because I do enjoy it, but at the same time, be aware of what you're\n\n57:32.200 --> 57:33.200\n doing.\n\n57:33.200 --> 57:39.520\n And again, this goes back to Camus's sense that conscience really is what makes us human\n\n57:39.520 --> 57:40.520\n beings.\n\n57:40.520 --> 57:44.440\n That's the thing I was saying, I don't think most people think in terms of conscience.\n\n57:44.440 --> 57:51.240\n They don't think it, we are taught, this is that creeping cynicism that, oh, grow up.\n\n57:51.240 --> 57:55.520\n When you're an adult, you have to make sacrifices, blah, blah, blah.\n\n57:55.520 --> 58:00.080\n And even if I buy that for a second, which I don't, but if I have to make sacrifices\n\n58:00.080 --> 58:05.680\n sometimes, that doesn't mean it's okay for me to make a sacrifice of my values in this\n\n58:05.680 --> 58:06.680\n moment.\n\n58:06.680 --> 58:10.800\n If I have to maybe be at work and my boss is a jerk to me and calls me names, I have\n\n58:10.800 --> 58:13.800\n to be humiliated, but I got to put food on the plate.\n\n58:13.800 --> 58:18.600\n That doesn't mean it's okay later if I'm at a party and I'm just extremely offensive to\n\n58:18.600 --> 58:21.720\n someone for no reason.\n\n58:21.720 --> 58:26.160\n My own flavor of a little bit of rebellion.\n\n58:26.160 --> 58:28.680\n Sometimes I use the number two.\n\n58:28.680 --> 58:45.560\n You know, you're very witty on Twitter and Twitter likes mockery and wit and a counter\n\n58:45.560 --> 58:51.200\n attack is, Twitter loves that, somebody who's skilled at it.\n\n58:51.200 --> 59:03.080\n My own flavor of a bit of rebellion is to say things very simply, bordering on cliche\n\n59:03.080 --> 59:09.800\n with authenticity and like genuinely meaning the words I say, but knowing that those words\n\n59:09.800 --> 59:13.720\n would be, are easy to attack.\n\n59:13.720 --> 59:20.400\n And that sometimes those attacks can hurt because people would just mock me.\n\n59:20.400 --> 59:24.800\n People don't like earnestness because they've been taught to be too cool for school.\n\n59:24.800 --> 59:29.440\n So there's this pressure for me to be sound way more sophisticated.\n\n59:29.440 --> 59:38.840\n Use bigger words, sometimes throw in a criticism of institutions or something like that, almost\n\n59:38.840 --> 59:42.800\n as if I have a deep wisdom about the way the world is broken.\n\n59:42.800 --> 59:50.040\n But when you speak very simply about beautiful things in life, it's very easy to sound like\n\n59:50.040 --> 59:52.800\n you don't know what the hell you're talking about.\n\n59:52.800 --> 59:55.480\n And I kind of, I stick by that.\n\n59:55.480 --> 59:59.480\n I don't know where that's going to end up, but it's like the idiot from Dostoevsky.\n\n59:59.480 --> 1:00:05.320\n It feels like that's the right thing, even if it hurts when I'm attacked for it.\n\n1:00:05.320 --> 1:00:09.940\n I do something similar sometimes, which is I'll have some innocuous comment about like\n\n1:00:09.940 --> 1:00:10.940\n bubblegum.\n\n1:00:10.940 --> 1:00:12.960\n I mean, just it's not to be in political.\n\n1:00:12.960 --> 1:00:18.960\n And a lot of times people will respond to this paragraph of just invective about like\n\n1:00:18.960 --> 1:00:22.520\n blah, blah, blah, and then this, and you say this, and you're an ass, and just really trying\n\n1:00:22.520 --> 1:00:24.280\n to get at me.\n\n1:00:24.280 --> 1:00:29.540\n And in those situations, there are very specific circumstances, I will respond and I mean it\n\n1:00:29.540 --> 1:00:31.040\n every single time.\n\n1:00:31.040 --> 1:00:36.240\n I will say, I wish your parents had been kinder to you or your mom or your dad.\n\n1:00:36.240 --> 1:00:40.840\n Because even if I'm some idiot on Twitter, who's just talking about bubblegum, and this\n\n1:00:40.840 --> 1:00:44.200\n is your, I'm not talking about politics where I can see how people get emotional, COVID,\n\n1:00:44.200 --> 1:00:46.600\n my grandma died, now you're talking about her.\n\n1:00:46.600 --> 1:00:50.260\n And I realize this isn't about me.\n\n1:00:50.260 --> 1:00:55.520\n Like I'm someone you've never met making some inane point about nothing, and you're getting\n\n1:00:55.520 --> 1:00:57.100\n agitated about this.\n\n1:00:57.100 --> 1:00:59.680\n It's clearly something else that's going on here.\n\n1:00:59.680 --> 1:01:04.880\n And someone taught you, someone had to teach you that this is how to respond in this kind\n\n1:01:04.880 --> 1:01:07.120\n of very kind of harsh way.\n\n1:01:07.120 --> 1:01:11.340\n And a lot of times they won't say anything or get deleted.\n\n1:01:11.340 --> 1:01:19.560\n And I hope every single time, there's no asterisk here, that they take a second, and they realize\n\n1:01:19.560 --> 1:01:25.560\n that the way that they were talked to growing up was not acceptable, that they don't have\n\n1:01:25.560 --> 1:01:27.680\n to carry this forward.\n\n1:01:27.680 --> 1:01:31.040\n And that they don't have to be kind to me, I'm nobody to them.\n\n1:01:31.040 --> 1:01:36.080\n But take a second and ask if this is the kind of mindset you want to be your norm, as opposed\n\n1:01:36.080 --> 1:01:39.280\n to a weapon you pull out of your pocket sometimes where it's warranted or even when it's not\n\n1:01:39.280 --> 1:01:40.280\n warranted.\n\n1:01:40.280 --> 1:01:50.080\n I think there's a lot of those people out there, and we forget how hard it is for a\n\n1:01:50.080 --> 1:01:55.360\n lot of people to grow up, how they're trained from their parents or the single parent, that\n\n1:01:55.360 --> 1:01:59.640\n the only way they're going to get attention is by acting out, that when they do good things,\n\n1:01:59.640 --> 1:02:01.080\n it doesn't get comment.\n\n1:02:01.080 --> 1:02:04.240\n But if they do bad things, they get a smack upside their head.\n\n1:02:04.240 --> 1:02:07.240\n That I think is far more common than we realize.\n\n1:02:07.240 --> 1:02:12.840\n And it's not hitting the kid that's going to last, the pain is going to give five seconds.\n\n1:02:12.840 --> 1:02:17.480\n But when you're training this child, helpless child, is something that's really, really\n\n1:02:17.480 --> 1:02:18.480\n bad.\n\n1:02:18.480 --> 1:02:20.440\n I don't know if it always can be mapped to that.\n\n1:02:20.440 --> 1:02:24.800\n I always wonder about them, what their motivations are.\n\n1:02:24.800 --> 1:02:28.920\n And I just kind of, whenever I think about them, I think only positively.\n\n1:02:28.920 --> 1:02:31.080\n And I don't even think about the childhood thing.\n\n1:02:31.080 --> 1:02:35.840\n I think, I don't know.\n\n1:02:35.840 --> 1:02:42.080\n I kind of imagine that all of us can go through that stage where we enjoy the derision of\n\n1:02:42.080 --> 1:02:43.080\n others.\n\n1:02:43.080 --> 1:02:44.280\n We go through stages of being...\n\n1:02:44.280 --> 1:02:48.200\n I enjoy the derision of others, but it has to be, you know, Billy Eide had that quote,\n\n1:02:48.200 --> 1:02:51.540\n like, I like it when people are mean to me, I stop pretending to be nice.\n\n1:02:51.540 --> 1:02:53.760\n But like, what's the worst thing someone can say about you?\n\n1:02:53.760 --> 1:02:56.560\n You're not, what harm are you doing?\n\n1:02:56.560 --> 1:02:59.660\n Maybe your podcast is garbage and the people are, the conversations suck and the people\n\n1:02:59.660 --> 1:03:00.660\n are losers.\n\n1:03:00.660 --> 1:03:01.660\n Okay.\n\n1:03:01.660 --> 1:03:05.540\n No, the main thing I would say is I'm way more popular than I deserve to be.\n\n1:03:05.540 --> 1:03:07.080\n What does deserve mean?\n\n1:03:07.080 --> 1:03:17.000\n The reality is there's people out there that just enjoy hating on others and I don't fault\n\n1:03:17.000 --> 1:03:18.000\n them for it.\n\n1:03:18.000 --> 1:03:21.240\n Like, I don't even think of them as haters.\n\n1:03:21.240 --> 1:03:25.000\n I think of them as just people that in this particular part of their life are enjoying\n\n1:03:25.000 --> 1:03:32.040\n this activity of deriding others on the internet.\n\n1:03:32.040 --> 1:03:34.240\n I'm not sure what to do with that.\n\n1:03:34.240 --> 1:03:38.520\n I just don't want to, I don't want to allow myself to think badly of them, I guess is\n\n1:03:38.520 --> 1:03:39.520\n the thing.\n\n1:03:39.520 --> 1:03:41.160\n I'm the one saying don't think badly of them.\n\n1:03:41.160 --> 1:03:43.640\n I'm saying that I don't think they're inherently bad people.\n\n1:03:43.640 --> 1:03:48.000\n I think that their thinking is screwed and that I'm steel mounting them.\n\n1:03:48.000 --> 1:03:51.400\n I'm saying, let's assume everything you're saying about Lex is true.\n\n1:03:51.400 --> 1:03:53.560\n This is an opportunity for you to outdo Lex.\n\n1:03:53.560 --> 1:03:54.560\n Like it's...\n\n1:03:54.560 --> 1:03:59.420\n No, but are you saying they should stop hating because I'm saying like, maybe they shouldn't\n\n1:03:59.420 --> 1:04:00.420\n just keep...\n\n1:04:00.420 --> 1:04:01.760\n I don't believe in should, right?\n\n1:04:01.760 --> 1:04:07.480\n I'm an anarchist, but I'm saying if this is your belief about Lex, you know what it is?\n\n1:04:07.480 --> 1:04:11.900\n I made this comment in my book, The New Right, when people make fun of Andy Warhol and they're\n\n1:04:11.900 --> 1:04:15.360\n like, oh my God, he painted a soup can and now he became a millionaire.\n\n1:04:15.360 --> 1:04:16.360\n I could do this.\n\n1:04:16.360 --> 1:04:17.960\n Well, why don't you?\n\n1:04:17.960 --> 1:04:22.920\n So basically if I go up to you with a check and I say, I will give you a million dollars,\n\n1:04:22.920 --> 1:04:27.260\n you could see the check, you got to paint a soup can, what am I waiting for?\n\n1:04:27.260 --> 1:04:32.720\n So clearly there's a disconnect in their thinking between what they're perceiving and the reality.\n\n1:04:32.720 --> 1:04:38.060\n Because if it was as simple or as, maybe not simple, but as possible for them as they perceive\n\n1:04:38.060 --> 1:04:42.400\n it to be, why are they leaving comments instead of outdoing you?\n\n1:04:42.400 --> 1:04:46.320\n How great would it be for them to have your bigger audience and drive you into the ground?\n\n1:04:46.320 --> 1:04:48.280\n I don't know how that would work because it's not the NBA, but...\n\n1:04:48.280 --> 1:04:50.600\n No, but you want to point out, you do this too on Twitter.\n\n1:04:50.600 --> 1:04:57.880\n You want to point out the hypocrisy, the fraudulence of others, right?\n\n1:04:57.880 --> 1:05:01.760\n Sure, but what are you, you're not claiming anything other than this is, the following\n\n1:05:01.760 --> 1:05:06.820\n is the conversation between me and Machique, whatever his name is, right?\n\n1:05:06.820 --> 1:05:07.980\n I got the voice down, dude.\n\n1:05:07.980 --> 1:05:08.980\n I got it down.\n\n1:05:08.980 --> 1:05:11.160\n I've been walking around my house doing my Lex impression.\n\n1:05:11.160 --> 1:05:13.160\n I've been leaking motor oil everywhere.\n\n1:05:13.160 --> 1:05:16.280\n Yeah, but yeah, I don't know.\n\n1:05:16.280 --> 1:05:17.280\n I don't know.\n\n1:05:17.280 --> 1:05:21.000\n I don't know what to make of it because I think there's a more general statement to\n\n1:05:21.000 --> 1:05:22.000\n be made.\n\n1:05:22.000 --> 1:05:23.640\n Like I see Twitter this way too.\n\n1:05:23.640 --> 1:05:30.080\n When I read a tweet, I try to read it with like the best possible interpretation, meaning\n\n1:05:30.080 --> 1:05:33.360\n like what is the wisdom in this tweet, right?\n\n1:05:33.360 --> 1:05:40.040\n As opposed to what I think a large number of people, not a large number, but some fraction\n\n1:05:40.040 --> 1:05:43.960\n try to see what is the worst possible interpretation of this tweet.\n\n1:05:43.960 --> 1:05:49.440\n And they want to, they want to destroy you for that worst interpretation.\n\n1:05:49.440 --> 1:05:54.480\n Like they want to, there's people, I'm already aware of this with me and certainly with a\n\n1:05:54.480 --> 1:05:57.040\n lot of people, they're waiting for me to fail.\n\n1:05:57.040 --> 1:06:01.160\n They want me to be like, this guy talks about love all the time.\n\n1:06:01.160 --> 1:06:04.880\n They want me to be some dark, like a Bill Cosby type character.\n\n1:06:04.880 --> 1:06:05.880\n They want you to be in pain.\n\n1:06:05.880 --> 1:06:06.880\n Yeah.\n\n1:06:06.880 --> 1:06:07.880\n They want you to be in pain because they don't.\n\n1:06:07.880 --> 1:06:08.880\n Why?\n\n1:06:08.880 --> 1:06:09.880\n I'll tell you exactly why.\n\n1:06:09.880 --> 1:06:13.180\n Because this is why I'm so for being white pilled and being for hope.\n\n1:06:13.180 --> 1:06:18.160\n Because if you are black pilled, meaning if you think it's pointless, we're all done.\n\n1:06:18.160 --> 1:06:19.760\n You're just wasting your breath.\n\n1:06:19.760 --> 1:06:25.060\n If you have any counter examples to this thesis, if there's even a little bit of hope, your\n\n1:06:25.060 --> 1:06:27.200\n entire hypothesis falls through, right?\n\n1:06:27.200 --> 1:06:32.360\n So it's kind of how like you have all these stories of people who are like painting swastikas\n\n1:06:32.360 --> 1:06:35.800\n who aren't Nazis, but just to show that, oh, there's all this Nazism.\n\n1:06:35.800 --> 1:06:38.840\n So I'm going to kind of force the conclusion.\n\n1:06:38.840 --> 1:06:45.000\n So for them, when they see you thriving, you are as a mediocre person with a crappy show,\n\n1:06:45.000 --> 1:06:47.300\n but you're demonstrating that people can succeed.\n\n1:06:47.300 --> 1:06:48.480\n This bothers them.\n\n1:06:48.480 --> 1:06:49.480\n So you are.\n\n1:06:49.480 --> 1:06:51.200\n Anyone can succeed.\n\n1:06:51.200 --> 1:06:52.200\n That bothers them.\n\n1:06:52.200 --> 1:06:53.200\n Yeah.\n\n1:06:53.200 --> 1:06:54.200\n So because that, why haven't they?\n\n1:06:54.200 --> 1:06:58.040\n So now you're a counter to their worldview and that is going to cause anxiety when you\n\n1:06:58.040 --> 1:07:01.760\n have data that contradicts other data in your, in your worldview.\n\n1:07:01.760 --> 1:07:04.360\n This is the, in your mindset, this is a big issue for them.\n\n1:07:04.360 --> 1:07:05.360\n Yeah.\n\n1:07:05.360 --> 1:07:09.720\n So to anyone listening to this, they're annoyed by the look of my face.\n\n1:07:09.720 --> 1:07:12.980\n Remember that you could probably do way better than me and you should.\n\n1:07:12.980 --> 1:07:15.720\n But also what would you failing look like?\n\n1:07:15.720 --> 1:07:21.240\n Like let's suppose this podcast went from whatever views you had to 100 views an episode.\n\n1:07:21.240 --> 1:07:22.740\n That's still success.\n\n1:07:22.740 --> 1:07:26.920\n You are talking to people you like, having conversations about important issues.\n\n1:07:26.920 --> 1:07:28.280\n You're having a good time.\n\n1:07:28.280 --> 1:07:29.280\n They're having a good time.\n\n1:07:29.280 --> 1:07:30.280\n How is that a failure?\n\n1:07:30.280 --> 1:07:35.660\n If I have dinner with a friend of mine, there's zero viewers and we enjoy that time.\n\n1:07:35.660 --> 1:07:38.940\n That is the height of human success.\n\n1:07:38.940 --> 1:07:43.780\n When you are sharing happiness, joy, joy over love.\n\n1:07:43.780 --> 1:07:46.600\n So what's the difference between joy and love, Michael Malus?\n\n1:07:46.600 --> 1:07:49.940\n Uh, I think joy is easier to attain.\n\n1:07:49.940 --> 1:07:50.980\n It's more common.\n\n1:07:50.980 --> 1:07:53.300\n You could share it with everyone.\n\n1:07:53.300 --> 1:07:55.320\n Give me an example of joy.\n\n1:07:55.320 --> 1:07:58.160\n Like what was the moment of joy for you recently?\n\n1:07:58.160 --> 1:08:02.540\n I could give you a great example of joy and this is part in the absurdist mindset.\n\n1:08:02.540 --> 1:08:03.540\n Okay.\n\n1:08:03.540 --> 1:08:09.320\n I love having a bad meal at a restaurant and I'll give you, you can see why.\n\n1:08:09.320 --> 1:08:10.980\n You go with your friend.\n\n1:08:10.980 --> 1:08:13.260\n It takes you 45 minutes to get seated.\n\n1:08:13.260 --> 1:08:14.260\n Okay.\n\n1:08:14.260 --> 1:08:15.780\n I'm starving.\n\n1:08:15.780 --> 1:08:17.420\n Waiter's not paying attention to you.\n\n1:08:17.420 --> 1:08:18.420\n They bring your water.\n\n1:08:18.420 --> 1:08:19.420\n It's got a hair in it.\n\n1:08:19.420 --> 1:08:20.420\n They get the food wrong.\n\n1:08:20.420 --> 1:08:21.420\n Yeah.\n\n1:08:21.420 --> 1:08:22.420\n It comes out again.\n\n1:08:22.420 --> 1:08:23.420\n It's ripe, but it's cold.\n\n1:08:23.420 --> 1:08:26.020\n At a certain point you're like, okay, I'm hungry.\n\n1:08:26.020 --> 1:08:28.340\n I'm living an anecdote.\n\n1:08:28.340 --> 1:08:31.800\n This is something that you, if you were at dinner, we could talk about this for years\n\n1:08:31.800 --> 1:08:37.700\n because how great is it that the worst thing that's happening to me is I got to wait an\n\n1:08:37.700 --> 1:08:40.700\n hour for this meal that's going to be cooked wrong, right?\n\n1:08:40.700 --> 1:08:48.460\n That to me is joy is a holding on to that idea that happiness and thriving are possible\n\n1:08:48.460 --> 1:08:53.060\n even when in the moment it's, uh, everything's going the wrong way.\n\n1:08:53.060 --> 1:08:57.540\n Doesn't every moment have the capacity to, uh, fill you with joy then?\n\n1:08:57.540 --> 1:08:58.540\n Yes.\n\n1:08:58.540 --> 1:08:59.540\n Yes.\n\n1:08:59.540 --> 1:09:00.540\n So it's both the shitty moments and the good moments.\n\n1:09:00.540 --> 1:09:01.540\n Yes.\n\n1:09:01.540 --> 1:09:07.060\n But that, see, that's the way I usually talk about love is like, I love life.\n\n1:09:07.060 --> 1:09:08.060\n Yes.\n\n1:09:08.060 --> 1:09:15.180\n And in that, because life can generate every, everything, the pain, the loss, but also just\n\n1:09:15.180 --> 1:09:20.900\n like simple or complicated bliss, all of that, I just love all of that.\n\n1:09:20.900 --> 1:09:26.740\n And that, because it fills me with a kind of, I guess, joy, but joy has a connotation\n\n1:09:26.740 --> 1:09:30.580\n that it's supposed to be somehow positive, like you're supposed to be smiling.\n\n1:09:30.580 --> 1:09:38.060\n To me, you know, man's search for meaning with Viktor Frankl, you know, just it's, you're\n\n1:09:38.060 --> 1:09:42.780\n in the Holocaust, you're in a concentration camp, just having a little bit of food that\n\n1:09:42.780 --> 1:09:45.140\n you didn't expect you will have.\n\n1:09:45.140 --> 1:09:47.740\n Or even just thinking about food.\n\n1:09:47.740 --> 1:09:51.100\n Or what about there's a kid there, you tell them a funny story and you crack them up.\n\n1:09:51.100 --> 1:09:52.100\n Yeah.\n\n1:09:52.100 --> 1:09:54.420\n Like you take away this child's pain for like five minutes.\n\n1:09:54.420 --> 1:09:55.900\n That is the height of joy.\n\n1:09:55.900 --> 1:09:56.900\n Yeah.\n\n1:09:56.900 --> 1:10:01.300\n So to me, like all of like life is like infinitely full of possibility for joy.\n\n1:10:01.300 --> 1:10:02.300\n Yes.\n\n1:10:02.300 --> 1:10:07.460\n And that's what I mean by love, because oftentimes like romantic love is what people think about\n\n1:10:07.460 --> 1:10:08.460\n when they think love.\n\n1:10:08.460 --> 1:10:11.180\n But to me, it's all like part of the same thing.\n\n1:10:11.180 --> 1:10:17.740\n And it's almost like love, romantic love, or love with a friend, friendship is like\n\n1:10:17.740 --> 1:10:20.020\n you both notice each other.\n\n1:10:20.020 --> 1:10:23.380\n It's like dogs, they look at each other and then they look at the thing they're interested\n\n1:10:23.380 --> 1:10:24.380\n in.\n\n1:10:24.380 --> 1:10:27.340\n You both notice each other and that moment of joy.\n\n1:10:27.340 --> 1:10:28.780\n You share that moment of joy together.\n\n1:10:28.780 --> 1:10:29.780\n Yeah.\n\n1:10:29.780 --> 1:10:30.780\n Like the restaurant.\n\n1:10:30.780 --> 1:10:31.780\n The restaurant.\n\n1:10:31.780 --> 1:10:32.780\n Yeah.\n\n1:10:32.780 --> 1:10:39.460\n If you're both almost without conspiring, notice the absurdity of how shitty this meal\n\n1:10:39.460 --> 1:10:40.460\n is.\n\n1:10:40.460 --> 1:10:46.620\n And like that, again, that little glimmer of realization, that's what makes life beautiful.\n\n1:10:46.620 --> 1:10:49.980\n You mentioned your grandmother in Lvov.\n\n1:10:49.980 --> 1:10:52.060\n You were thinking of returning there.\n\n1:10:52.060 --> 1:10:58.440\n The plans got a little bit delayed, but what are you hoping from that trip of going back\n\n1:10:58.440 --> 1:11:01.420\n to Russia, going back to Ukraine?\n\n1:11:01.420 --> 1:11:07.540\n What do you hope to get out of it, but what do you think you will feel?\n\n1:11:07.540 --> 1:11:08.540\n A lot of things.\n\n1:11:08.540 --> 1:11:11.500\n First of all, I'm going with my buddy, Chris Williamson.\n\n1:11:11.500 --> 1:11:13.420\n He hosts the Modern Wisdom Podcast.\n\n1:11:13.420 --> 1:11:15.720\n He is one of my closest friends.\n\n1:11:15.720 --> 1:11:16.720\n We've never met.\n\n1:11:16.720 --> 1:11:17.720\n Oh, really?\n\n1:11:17.720 --> 1:11:18.720\n We've never met.\n\n1:11:18.720 --> 1:11:19.720\n He's in Britain.\n\n1:11:19.720 --> 1:11:23.000\n He's trying to get his ass over here to Austin.\n\n1:11:23.000 --> 1:11:24.540\n He's filling out his form right now.\n\n1:11:24.540 --> 1:11:25.540\n He's too good looking.\n\n1:11:25.540 --> 1:11:26.540\n It's a crime.\n\n1:11:26.540 --> 1:11:29.600\n I call him Apollo and I'm Loki.\n\n1:11:29.600 --> 1:11:32.220\n So right away you have a buddy comedy because we're going to film it, right?\n\n1:11:32.220 --> 1:11:36.940\n You have these two guys who on paper are very dissimilar, but we're very, very close.\n\n1:11:36.940 --> 1:11:40.380\n In which way are you similar and close?\n\n1:11:40.380 --> 1:11:47.500\n I think we're both very intense people, very strong emotionally.\n\n1:11:47.500 --> 1:11:52.500\n We're both very ambitious in the sense that, not in terms of career, but we want to grab\n\n1:11:52.500 --> 1:11:55.260\n life by the short hairs kind of thing.\n\n1:11:55.260 --> 1:11:58.820\n We are just both good experiences.\n\n1:11:58.820 --> 1:12:02.420\n Did he bench more than you or like in the gym?\n\n1:12:02.420 --> 1:12:03.420\n Of course.\n\n1:12:03.420 --> 1:12:04.420\n The guy's jacked.\n\n1:12:04.420 --> 1:12:05.420\n He's just...\n\n1:12:05.420 --> 1:12:06.420\n Because he's so good looking.\n\n1:12:06.420 --> 1:12:09.260\n I think he'd be one of those guys who's mostly biceps.\n\n1:12:09.260 --> 1:12:10.620\n Oh no, no, no.\n\n1:12:10.620 --> 1:12:14.240\n If you go to his Instagram, Chris Will X is the handle.\n\n1:12:14.240 --> 1:12:15.240\n It's head to toe.\n\n1:12:15.240 --> 1:12:16.240\n It's just sculpted.\n\n1:12:16.240 --> 1:12:17.240\n Oh, wow.\n\n1:12:17.240 --> 1:12:18.240\n So he's perfect in every way.\n\n1:12:18.240 --> 1:12:19.240\n That's great.\n\n1:12:19.240 --> 1:12:20.240\n He...\n\n1:12:20.240 --> 1:12:21.900\n What flaws does he have?\n\n1:12:21.900 --> 1:12:22.900\n Because I need...\n\n1:12:22.900 --> 1:12:29.560\n He has bad taste in friends and his accent is all crazy.\n\n1:12:29.560 --> 1:12:30.560\n He pronounces it...\n\n1:12:30.560 --> 1:12:35.880\n He's an underwear muddle, so now I spell it M U D L.\n\n1:12:35.880 --> 1:12:39.540\n Just us two, British and American, and just two different dudes, it's going to be a lot\n\n1:12:39.540 --> 1:12:40.540\n of fun.\n\n1:12:40.540 --> 1:12:43.540\n Although, to be fair, as you know, I'm an underwear model now as well, so...\n\n1:12:43.540 --> 1:12:44.540\n Yeah.\n\n1:12:44.540 --> 1:12:49.100\n We're going to talk that in a second, maybe, but yeah, sheathunderwear.com.\n\n1:12:49.100 --> 1:12:52.100\n Yeah, this episode is brought to you by Sheath Underwear.\n\n1:12:52.100 --> 1:12:53.940\n Are we going to get some pictures eventually?\n\n1:12:53.940 --> 1:12:54.940\n I think we might.\n\n1:12:54.940 --> 1:12:55.940\n Yeah.\n\n1:12:55.940 --> 1:12:56.940\n Yes, I have them on my phone.\n\n1:12:56.940 --> 1:12:57.940\n We'll have them.\n\n1:12:57.940 --> 1:12:59.260\n We could share them right...\n\n1:12:59.260 --> 1:13:01.020\n You could slice it in right here.\n\n1:13:01.020 --> 1:13:05.860\n So to be able to go with someone who is a very close...\n\n1:13:05.860 --> 1:13:08.020\n I mean, we meet and talk like every day, right?\n\n1:13:08.020 --> 1:13:12.620\n So to someone who generally cares about you, who's...\n\n1:13:12.620 --> 1:13:15.320\n He's very, very grounded, right?\n\n1:13:15.320 --> 1:13:19.900\n So like a lot of times I'll have like some concern and he's really good, and if you listen\n\n1:13:19.900 --> 1:13:23.780\n to his show, at slicing through the noise and being like, hold on a second, I can't\n\n1:13:23.780 --> 1:13:24.980\n do the accent yet.\n\n1:13:24.980 --> 1:13:28.820\n Have you considered A, B, and C because, you know, whenever I had this situation, this\n\n1:13:28.820 --> 1:13:29.820\n is what I did.\n\n1:13:29.820 --> 1:13:32.780\n He was really good with that.\n\n1:13:32.780 --> 1:13:34.060\n So to have a...\n\n1:13:34.060 --> 1:13:37.760\n First of all, just like two buddies on a trip is really a lot of fun.\n\n1:13:37.760 --> 1:13:41.660\n Second of all, I know that it's going to be very intense.\n\n1:13:41.660 --> 1:13:44.660\n So for you, you left Russia much later than I did.\n\n1:13:44.660 --> 1:13:45.660\n How old were you?\n\n1:13:45.660 --> 1:13:46.660\n Thirteen.\n\n1:13:46.660 --> 1:13:47.660\n Thirteen, right.\n\n1:13:47.660 --> 1:13:48.660\n So you remember it, I'm sure, very, very well.\n\n1:13:48.660 --> 1:13:49.660\n I left when I was one and a half too.\n\n1:13:49.660 --> 1:13:50.660\n I don't remember it all.\n\n1:13:50.660 --> 1:13:57.820\n To go to the streets where, you know, my family had to go through this stuff to see the...\n\n1:13:57.820 --> 1:13:59.860\n They came to Lviv, they slaughtered all the Jews.\n\n1:13:59.860 --> 1:14:04.020\n I mean, to have that little memorial there that's there now, and to just look around\n\n1:14:04.020 --> 1:14:08.580\n and know, yesterday, basically, they came here, they rounded everyone up.\n\n1:14:08.580 --> 1:14:12.260\n And also, from the other side, you had the Stalinists coming in and starving all the\n\n1:14:12.260 --> 1:14:13.260\n people.\n\n1:14:13.260 --> 1:14:16.420\n It's just to know that so much horror and death.\n\n1:14:16.420 --> 1:14:21.500\n There's this quote I saw once about a woman who went to Auschwitz and she just made the\n\n1:14:21.500 --> 1:14:23.560\n comment like, grass grows here.\n\n1:14:23.560 --> 1:14:27.100\n Because we think, you know, that when it comes to the nature of evil, that you're going to\n\n1:14:27.100 --> 1:14:29.820\n go there, there's going to be this pits of hell or whatever.\n\n1:14:29.820 --> 1:14:34.100\n There's birds, you know, there's, you know, robins hopping around looking for the worms\n\n1:14:34.100 --> 1:14:35.100\n or whatever.\n\n1:14:35.100 --> 1:14:39.140\n They think it's perfectly nice and you stand there to understand that so much suffering\n\n1:14:39.140 --> 1:14:43.020\n happened here or there is going to be very jarring.\n\n1:14:43.020 --> 1:14:47.500\n I know that it's going to be an issue because I speak Russian and not Ukrainian.\n\n1:14:47.500 --> 1:14:50.260\n And to speak Russian to Ukrainians is like a big deal.\n\n1:14:50.260 --> 1:14:51.780\n So that's going to be a concern.\n\n1:14:51.780 --> 1:14:56.420\n I'm also worried about going to Russia because every Russian has this idea that even though\n\n1:14:56.420 --> 1:15:00.580\n they've just met you, they feel that they're in a position to tell you what you're doing\n\n1:15:00.580 --> 1:15:04.320\n wrong with your life, what you should be doing, if they're a cab driver, I have no tolerance\n\n1:15:04.320 --> 1:15:07.180\n for unsolicited advice on it based at all.\n\n1:15:07.180 --> 1:15:08.220\n That's going to be horrible.\n\n1:15:08.220 --> 1:15:10.740\n They're going to be telling me I need to speak Russian better because ты говоришь по\n\n1:15:10.740 --> 1:15:12.300\n русски как даунчик.\n\n1:15:12.300 --> 1:15:13.420\n I'm not hearing it.\n\n1:15:13.420 --> 1:15:15.380\n I'm not interested in hearing it.\n\n1:15:15.380 --> 1:15:21.080\n So that I think, and also, you know, given my upcoming book, The White Pill and covering\n\n1:15:21.080 --> 1:15:26.660\n what happened back in the day under Stalinism and later to see this was the Ljubljanka,\n\n1:15:26.660 --> 1:15:30.260\n this was the basement where they would, you know, this is something that people might\n\n1:15:30.260 --> 1:15:31.260\n not realize.\n\n1:15:31.260 --> 1:15:35.340\n There's a superb film, The Death of Stalin, which is kind of, that's what I do with North\n\n1:15:35.340 --> 1:15:37.500\n Korea, you know, puts a humorous spin on it.\n\n1:15:37.500 --> 1:15:40.180\n Then when you take a step back and you realize what they're actually saying, it's just like\n\n1:15:40.180 --> 1:15:45.360\n it's very, very disturbing how when Stalin was dying, he had a stroke, he's laying there\n\n1:15:45.360 --> 1:15:48.660\n in a pile of his own piss, he's unconscious.\n\n1:15:48.660 --> 1:15:52.340\n Right before he died, he thought the doctors were all plotting against him.\n\n1:15:52.340 --> 1:15:56.380\n So they were being tortured to confess that they were trying to murder him.\n\n1:15:56.380 --> 1:16:01.840\n They had to get the doctors out of the torture chambers to attend to him and they did it.\n\n1:16:01.840 --> 1:16:07.420\n So this kind of thing to like go there, like Red Square and see this is where it happened,\n\n1:16:07.420 --> 1:16:11.740\n to see Lenin's body, like this is the guy who Emma Goldman yelled at.\n\n1:16:11.740 --> 1:16:17.980\n It's going to be really, because I've worked so much in this space, jarring and intense\n\n1:16:17.980 --> 1:16:19.100\n and emotional.\n\n1:16:19.100 --> 1:16:22.700\n And as intense as it is for me sitting here talking to you about it, to see it and to\n\n1:16:22.700 --> 1:16:28.020\n see the faces and to see Cyrillic everywhere, you know, other than Brighton Beach in Brooklyn,\n\n1:16:28.020 --> 1:16:34.380\n it's going to, I'm sure it's going to do a huge number on me because as Western and as\n\n1:16:34.380 --> 1:16:39.380\n a Tupoi Mirikanyets as the Russians will say I am, this is still where I came from.\n\n1:16:39.380 --> 1:16:43.380\n So no matter, to see it face to face, I don't know how I'm going to react, but I don't think\n\n1:16:43.380 --> 1:16:45.860\n it's going to be like, meh.\n\n1:16:45.860 --> 1:16:51.260\n You've assembled a number of essays from anarchist thinkers in a new book called The Anarchist\n\n1:16:51.260 --> 1:16:52.800\n Handbook.\n\n1:16:52.800 --> 1:16:55.740\n You mentioned Emma Goldman.\n\n1:16:55.740 --> 1:17:00.780\n What interesting things do these thinkers agree on and what do they disagree on?\n\n1:17:00.780 --> 1:17:03.180\n The Anarchist Handbook.com is the website.\n\n1:17:03.180 --> 1:17:09.060\n It covers from the 1790s to, I think my essay is the last one from 2014, which a friend\n\n1:17:09.060 --> 1:17:14.020\n of mine who's kind of a mediocre scientist is going to be reading for the audio book.\n\n1:17:14.020 --> 1:17:15.020\n Also podcast.\n\n1:17:15.020 --> 1:17:16.020\n Podcast.\n\n1:17:16.020 --> 1:17:19.180\n I never had, but it's not a podcast anyone would have heard of.\n\n1:17:19.180 --> 1:17:20.900\n It's like Tom Woods but even worse.\n\n1:17:20.900 --> 1:17:29.460\n So what they all agreed on was the illegitimacy of government and also the malevolence of\n\n1:17:29.460 --> 1:17:34.180\n state actors and the consequences of governments.\n\n1:17:34.180 --> 1:17:41.840\n So they range in terms that most people would easily regard as either left or right wing.\n\n1:17:41.840 --> 1:17:48.620\n But it tackles the nature of government and also creates positive non state alternatives\n\n1:17:48.620 --> 1:17:50.620\n from really many different angles.\n\n1:17:50.620 --> 1:17:54.300\n The slogan I have is the black flag, which is the traditional flag of anarchism.\n\n1:17:54.300 --> 1:17:56.580\n The black flag comes in many colors.\n\n1:17:56.580 --> 1:18:01.000\n So they were really all over the map in terms of what they're for, but their disagreement\n\n1:18:01.000 --> 1:18:04.700\n is about the nature of state and the nature of power.\n\n1:18:04.700 --> 1:18:09.180\n And it's very edifying because this is an ideology that's been in many ways swept under\n\n1:18:09.180 --> 1:18:10.180\n the rug.\n\n1:18:10.180 --> 1:18:16.780\n I want to seriously grow up that I can allow people to sit down and read these essays and\n\n1:18:16.780 --> 1:18:22.180\n see for themselves just how beautiful this tapestry over the decades and centuries has\n\n1:18:22.180 --> 1:18:28.440\n been woven about people who genuinely believed in freedom as the most important and how to\n\n1:18:28.440 --> 1:18:32.500\n maximize that for society.\n\n1:18:32.500 --> 1:18:36.220\n So maybe it's useful to talk about a few contrasting thinkers in there.\n\n1:18:36.220 --> 1:18:39.100\n So one is Leo Tolstoy.\n\n1:18:39.100 --> 1:18:40.260\n Oh yeah.\n\n1:18:40.260 --> 1:18:46.060\n Who I think not many people know is an anarchist.\n\n1:18:46.060 --> 1:18:47.060\n Yes.\n\n1:18:47.060 --> 1:18:48.060\n A Christian anarchist.\n\n1:18:48.060 --> 1:18:49.060\n An anarchist.\n\n1:18:49.060 --> 1:18:50.060\n Yeah.\n\n1:18:50.060 --> 1:18:56.180\n So he came to despise government for his deceit and his violence.\n\n1:18:56.180 --> 1:19:00.220\n But to him, the Christian principles of nonviolence, I think are important.\n\n1:19:00.220 --> 1:19:01.220\n Oh yeah.\n\n1:19:01.220 --> 1:19:06.220\n And it's kind of pacifist kind of mindset of, you know, it's better to someone to punch\n\n1:19:06.220 --> 1:19:07.800\n you than to punch them back.\n\n1:19:07.800 --> 1:19:12.500\n So he's in that way, at least I've read he influenced MLK and Gandhi.\n\n1:19:12.500 --> 1:19:19.300\n What do you think about this flavor, color of the anarchist flag of nonviolence, nonviolent\n\n1:19:19.300 --> 1:19:20.300\n opposition?\n\n1:19:20.300 --> 1:19:26.140\n I will put the caveat that it bothers me when people bring up MLK because he's become so\n\n1:19:26.140 --> 1:19:29.540\n corporate and everyone just brings him up without knowing about him.\n\n1:19:29.540 --> 1:19:35.100\n One of the things that Martin Luther King did so very well was that he forced people\n\n1:19:35.100 --> 1:19:40.300\n to face the consequences of what they were putting forward.\n\n1:19:40.300 --> 1:19:41.380\n You want to be racist.\n\n1:19:41.380 --> 1:19:42.500\n You want to be for Jim Crow.\n\n1:19:42.500 --> 1:19:43.780\n You want to be for segregation.\n\n1:19:43.780 --> 1:19:44.780\n Okay.\n\n1:19:44.780 --> 1:19:46.660\n It's easy for you to do that from your living room.\n\n1:19:46.660 --> 1:19:52.980\n Now turn on your news and you see men and women in suits being attacked by dogs, being\n\n1:19:52.980 --> 1:19:58.140\n attacked by fire hoses and beaten by cops just so they could sit on the front of the\n\n1:19:58.140 --> 1:19:59.140\n bus.\n\n1:19:59.140 --> 1:20:03.180\n And now for a lot of people who were still racist, who were still had animus toward black\n\n1:20:03.180 --> 1:20:09.420\n people are watching this and it's going to be a lot harder to be like, I'm okay with\n\n1:20:09.420 --> 1:20:10.420\n this.\n\n1:20:10.420 --> 1:20:15.420\n I'm okay with human beings, even ones I regard as somehow bad or inferior to be beaten and\n\n1:20:15.420 --> 1:20:20.380\n attacked by trained dogs and they're not doing anything in response.\n\n1:20:20.380 --> 1:20:26.060\n That strikes to, I think, a very basic nature of, especially American, like, okay, whatever\n\n1:20:26.060 --> 1:20:30.700\n you're for, I'm not for people getting beaten and attacked when they're not really doing\n\n1:20:30.700 --> 1:20:31.700\n anything.\n\n1:20:31.700 --> 1:20:38.340\n I think pacifism is something that's very easy to make fun of, but people don't underestimate\n\n1:20:38.340 --> 1:20:43.780\n how powerful it is for someone to say, you can do what you want to me.\n\n1:20:43.780 --> 1:20:45.420\n I'm not going to fight you back.\n\n1:20:45.420 --> 1:20:49.260\n I just want to live peacefully and have the same rights as you.\n\n1:20:49.260 --> 1:20:52.620\n And to say, screw you, you should get beaten.\n\n1:20:52.620 --> 1:20:55.180\n That's a hard pill for a lot of people to swallow.\n\n1:20:55.180 --> 1:21:00.260\n So I think he was really, and Gandhi, of course, as well, were excellent in that regard.\n\n1:21:00.260 --> 1:21:02.140\n There's a little bit of Machiavellianism to it.\n\n1:21:02.140 --> 1:21:08.220\n They've both been beatified in regard to saints, but their strategy worked very, very well\n\n1:21:08.220 --> 1:21:09.340\n for their purposes.\n\n1:21:09.340 --> 1:21:16.020\n So I think just all of us, when you see someone in this kind of Christian, I know you're wrong,\n\n1:21:16.020 --> 1:21:21.820\n obviously, it's nothing very highly Christianity, but if he's someone who's willing to take\n\n1:21:21.820 --> 1:21:26.700\n a punch and to say, you could do whatever you want to me, I'm not going to hurt somebody\n\n1:21:26.700 --> 1:21:32.180\n else instinctively, and maybe this is kind of a hack.\n\n1:21:32.180 --> 1:21:35.980\n Most people want to side with that guy, step in between and be like, oh, okay, let's take\n\n1:21:35.980 --> 1:21:39.500\n a step back, because whatever led to this is not tenable.\n\n1:21:39.500 --> 1:21:43.500\n We need to go back to the drawing board if the consequence is people are having these\n\n1:21:43.500 --> 1:21:45.940\n as a result of my decisions and actions.\n\n1:21:45.940 --> 1:21:53.780\n So I think that aspect of anarchism is very, very, in certain contexts, healthy, and much\n\n1:21:53.780 --> 1:21:57.660\n smarter and more sophisticated than people give it credit for.\n\n1:21:57.660 --> 1:22:03.380\n And let's also point out that Tolstoy wrote War and Peace, and he wrote Anna Karenina.\n\n1:22:03.380 --> 1:22:07.200\n So this was not some naive or innocent, whatever word you want to use.\n\n1:22:07.200 --> 1:22:08.980\n He knew the nature of evil.\n\n1:22:08.980 --> 1:22:10.820\n He knew how bad things get.\n\n1:22:10.820 --> 1:22:15.180\n So he wasn't saying at all that human beings are inherently nice and kind.\n\n1:22:15.180 --> 1:22:21.500\n He was saying it's much more effective to not fight back and to force them to face that.\n\n1:22:21.500 --> 1:22:22.500\n I'll give you another example.\n\n1:22:22.500 --> 1:22:28.220\n I was on the show Trigonometry, and I was talking to the host, and one of them talked\n\n1:22:28.220 --> 1:22:35.060\n about how someone he knew had been the Gulag, or his mom was born the Gulag grandma.\n\n1:22:35.060 --> 1:22:39.180\n And after Stalin died and the Soviet Union liberalized and lots of the people in the\n\n1:22:39.180 --> 1:22:44.140\n Gulags were freed by Khrushchev and so on and so forth, I didn't know this, many of\n\n1:22:44.140 --> 1:22:49.020\n the, or some, let's say some, of the guards of the Gulags killed themselves because they\n\n1:22:49.020 --> 1:22:54.420\n had genuinely believed that everyone in these camps was there for a reason.\n\n1:22:54.420 --> 1:22:58.540\n And when they found out that these people were completely innocent, didn't even have\n\n1:22:58.540 --> 1:23:02.980\n trials, and that they were the ones forcing them to work themselves to death and starve,\n\n1:23:02.980 --> 1:23:05.240\n they couldn't deal with that guilt.\n\n1:23:05.240 --> 1:23:13.020\n So when you are a pacifist or non retaliatory and you're forcing someone who's using force,\n\n1:23:13.020 --> 1:23:15.860\n like look what you're doing, look what you've become.\n\n1:23:15.860 --> 1:23:19.820\n For some people, some people don't care, like the guy in Scare Tactics, like I mentioned\n\n1:23:19.820 --> 1:23:24.180\n earlier, where for a lot of others, they're going to be like, okay, is this who I wanted\n\n1:23:24.180 --> 1:23:25.180\n to grow up to be?\n\n1:23:25.180 --> 1:23:27.820\n They will have that little flame of conscience that you and I talked about earlier.\n\n1:23:27.820 --> 1:23:32.860\n They will be like, how did I get to the point where there's this lady who wants to ride\n\n1:23:32.860 --> 1:23:39.200\n the bus and she's lovely dressed, put together, and I have a, sending a dog on her?\n\n1:23:39.200 --> 1:23:40.460\n What kind of person am I?\n\n1:23:40.460 --> 1:23:45.020\n For some of those people, they're going to be like, okay, I can't be a part of this.\n\n1:23:45.020 --> 1:23:46.620\n I don't even understand the politics.\n\n1:23:46.620 --> 1:23:51.540\n I still am racist, but I'm not going to take part in this atrocity.\n\n1:23:51.540 --> 1:23:58.260\n Well, that was for him from the individual perspective, perhaps he calls that Christian,\n\n1:23:58.260 --> 1:24:04.420\n but listening to that voice of conscience, like whatever that is in you.\n\n1:24:04.420 --> 1:24:13.800\n So for Tolstoy, it seems like anarchism from the individual perspective is silencing the\n\n1:24:13.800 --> 1:24:20.180\n rest of the world and listening to the, for him, probably God given voice of conscience.\n\n1:24:20.180 --> 1:24:25.340\n And so that's what it means to live, embody anarchism for him.\n\n1:24:25.340 --> 1:24:27.460\n And to embody Christianity, I would think he would say.\n\n1:24:27.460 --> 1:24:29.220\n But he would see those as basic.\n\n1:24:29.220 --> 1:24:30.220\n Yes, correct.\n\n1:24:30.220 --> 1:24:31.220\n Yeah.\n\n1:24:31.220 --> 1:24:37.860\n So in terms of forms of government, the Christian government is one that's no government.\n\n1:24:37.860 --> 1:24:40.860\n Yeah, correct.\n\n1:24:40.860 --> 1:24:45.500\n What do you think about that as advice for an individual?\n\n1:24:45.500 --> 1:24:46.500\n Turn the other cheek.\n\n1:24:46.500 --> 1:24:50.340\n Do you think, I tend to believe that that's a really good way to live.\n\n1:24:50.340 --> 1:24:52.180\n I think it's very underrated.\n\n1:24:52.180 --> 1:24:53.740\n And this is me talking.\n\n1:24:53.740 --> 1:24:59.540\n I think a lot of times when someone, let's suppose you're having an argument and, but\n\n1:24:59.540 --> 1:25:01.180\n you have to pick your battles, right?\n\n1:25:01.180 --> 1:25:04.540\n Let's suppose you're having a heated argument and someone says something very cruel to you,\n\n1:25:04.540 --> 1:25:07.860\n where you have attempted to double down and hit back twice as hard.\n\n1:25:07.860 --> 1:25:11.020\n But if it's someone who at all cares about you, where they're just in the moment and\n\n1:25:11.020 --> 1:25:14.880\n you just stop and you just say, did you hear what you just said to me?\n\n1:25:14.880 --> 1:25:19.180\n For some cases, that person will take a step back and be like, just like when I snapped\n\n1:25:19.180 --> 1:25:24.420\n at Michael at Bitstein years ago, I'd be like, wow, okay, this is bad.\n\n1:25:24.420 --> 1:25:25.420\n This is bad.\n\n1:25:25.420 --> 1:25:26.420\n I'm sorry.\n\n1:25:26.420 --> 1:25:31.060\n And they kind of, it's kind of like they have to get to 10 before they control delete to\n\n1:25:31.060 --> 1:25:32.060\n use your language.\n\n1:25:32.060 --> 1:25:33.060\n Thank you.\n\n1:25:33.060 --> 1:25:34.060\n Yeah.\n\n1:25:34.060 --> 1:25:35.060\n Buffer overflow.\n\n1:25:35.060 --> 1:25:36.060\n I appreciate that.\n\n1:25:36.060 --> 1:25:39.160\n And for some, they're going to, they're going to just twist the knife.\n\n1:25:39.160 --> 1:25:41.820\n But I think this is a very useful technique.\n\n1:25:41.820 --> 1:25:47.280\n And also you can also sleep well at night cause you could be like as much as this person\n\n1:25:47.280 --> 1:25:51.080\n tried to hurt me, I still didn't reciprocate.\n\n1:25:51.080 --> 1:25:56.580\n And yeah, I, I took that punch and it sucks, but at least I never said anything that I\n\n1:25:56.580 --> 1:25:58.340\n could feel guilty about.\n\n1:25:58.340 --> 1:25:59.620\n Exactly.\n\n1:25:59.620 --> 1:26:05.620\n Do you think that's ultimately a good way to implement anarchy in your personal life?\n\n1:26:05.620 --> 1:26:12.500\n Anarchy, implementing anarchy in your personal life just means respecting people's boundaries.\n\n1:26:12.500 --> 1:26:18.420\n It means not forcing people to do things they otherwise wouldn't want to do.\n\n1:26:18.420 --> 1:26:25.160\n I think you then have to take a case by case, like there's so many human interactions that\n\n1:26:25.160 --> 1:26:29.620\n are required for life and there's tension and all those kinds of things.\n\n1:26:29.620 --> 1:26:30.620\n It's not always.\n\n1:26:30.620 --> 1:26:31.620\n Am I being naive?\n\n1:26:31.620 --> 1:26:32.620\n Are you innocent?\n\n1:26:32.620 --> 1:26:33.620\n You're being so naive.\n\n1:26:33.620 --> 1:26:34.620\n No.\n\n1:26:34.620 --> 1:26:35.620\n Did you put the hat on?\n\n1:26:35.620 --> 1:26:36.620\n The hat's on the other head now.\n\n1:26:36.620 --> 1:26:41.100\n Well, I had to take off the hat cause it's like Frodo with the ring.\n\n1:26:41.100 --> 1:26:43.700\n I was starting to feel like powerful.\n\n1:26:43.700 --> 1:26:49.940\n I wanted to give you orders and I'm like, no, I just, I think there's a ways of dealing\n\n1:26:49.940 --> 1:26:58.760\n with the tensions that are natural to human interactions that can't be simply, you know,\n\n1:26:58.760 --> 1:27:05.780\n it's not as simple as saying you want to respect the freedom of others and the boundaries of\n\n1:27:05.780 --> 1:27:06.780\n others.\n\n1:27:06.780 --> 1:27:10.900\n It's like you both have to agree on stuff and work something out.\n\n1:27:10.900 --> 1:27:15.220\n And the mechanisms of that agreement, the game theory of that agreement requires different\n\n1:27:15.220 --> 1:27:16.820\n hacks and strategies.\n\n1:27:16.820 --> 1:27:27.780\n And the question is for an anarchist collective that's well functioning, what kind of hacks,\n\n1:27:27.780 --> 1:27:33.960\n what kind of ways of behavior are more likely to be productive and not, you know, that that's\n\n1:27:33.960 --> 1:27:37.420\n almost like the question, do you want to turn the other cheek or do you want to stand your\n\n1:27:37.420 --> 1:27:39.160\n ground really firmly?\n\n1:27:39.160 --> 1:27:42.780\n When somebody is an asshole to you, you walk away.\n\n1:27:42.780 --> 1:27:46.480\n Or when somebody is an asshole to you, you turn the other cheek and give them a chance\n\n1:27:46.480 --> 1:27:52.060\n to rise to the best version of themselves and then find a common ground kind of thing.\n\n1:27:52.060 --> 1:27:56.940\n It's an open question of how to form those collectives when there's people with difficult\n\n1:27:56.940 --> 1:27:59.780\n childhoods and all that kind of stuff.\n\n1:27:59.780 --> 1:28:03.300\n Well, this also comes down to what is your relationship with this person?\n\n1:28:03.300 --> 1:28:04.300\n Is this out of character?\n\n1:28:04.300 --> 1:28:08.100\n If you and I got into a disagreement, all of a sudden, you started getting very personal.\n\n1:28:08.100 --> 1:28:09.100\n First of all, I'd be very hurt.\n\n1:28:09.100 --> 1:28:11.240\n But then I'd be like, this is out of character for Lex.\n\n1:28:11.240 --> 1:28:13.620\n I'm sure I could be like, whoa, let's take a pause here.\n\n1:28:13.620 --> 1:28:14.780\n Like you're getting heated.\n\n1:28:14.780 --> 1:28:16.420\n I'm trying to work this out.\n\n1:28:16.420 --> 1:28:17.420\n What's going on here?\n\n1:28:17.420 --> 1:28:19.220\n And you get a kind of a meta conversation.\n\n1:28:19.220 --> 1:28:21.880\n But again, you and I have a relationship of mutual respect.\n\n1:28:21.880 --> 1:28:28.300\n So as opposed to if it was a stranger who just wants a piece of you, it's just like\n\n1:28:28.300 --> 1:28:29.780\n you are coming at me not correct.\n\n1:28:29.780 --> 1:28:31.740\n I don't have to reciprocate in kind.\n\n1:28:31.740 --> 1:28:36.220\n I'm not going to shoot you, but I'm not going to pretend that you deserve respect when you're\n\n1:28:36.220 --> 1:28:39.020\n treating me with such contempt.\n\n1:28:39.020 --> 1:28:44.480\n I do defer, especially with people I know, because this is smart long term game theory\n\n1:28:44.480 --> 1:28:46.180\n as well as the right thing to do.\n\n1:28:46.180 --> 1:28:48.840\n I do try to give them the benefit of the doubt at first, right?\n\n1:28:48.840 --> 1:28:51.140\n Because if you're going to go aggro, you can't go back.\n\n1:28:51.140 --> 1:28:54.940\n You could always go from like, let me hear them out and then then I could go aggro.\n\n1:28:54.940 --> 1:28:56.980\n So there's a big asymmetry there.\n\n1:28:56.980 --> 1:28:57.980\n Yeah.\n\n1:28:57.980 --> 1:29:02.340\n And that's, I mean, I don't think anyone has the answer to this question is, is that the\n\n1:29:02.340 --> 1:29:03.460\n right strategy?\n\n1:29:03.460 --> 1:29:06.660\n To me, game theoretically, it seems the right strategy is to...\n\n1:29:06.660 --> 1:29:09.420\n With reciprocity is what game theory says is the right strategy.\n\n1:29:09.420 --> 1:29:13.720\n They did the prisoner's dilemma and they found tit for tat is the one that's the most advantageous.\n\n1:29:13.720 --> 1:29:16.180\n So that's for when it's perfectly rational actors.\n\n1:29:16.180 --> 1:29:23.620\n But when you have, I mean, there's noise that there's a, I think, benefit to just, even\n\n1:29:23.620 --> 1:29:27.860\n if they keep being shitty to you, still being nice to them.\n\n1:29:27.860 --> 1:29:30.060\n Well then there's the inverse where girls are turned off.\n\n1:29:30.060 --> 1:29:34.380\n Some people are like, if you're in a relationship and not just girls, but like some people,\n\n1:29:34.380 --> 1:29:37.940\n when you're kind to them, they find you less attractive, right?\n\n1:29:37.940 --> 1:29:40.620\n That is kind of this weird, what am I supposed to do?\n\n1:29:40.620 --> 1:29:43.380\n Like you're only into me if I'm mean to you.\n\n1:29:43.380 --> 1:29:46.840\n I don't want to be mean, but then I'm getting punished for doing the right thing.\n\n1:29:46.840 --> 1:29:48.340\n That's another tricky one.\n\n1:29:48.340 --> 1:29:52.540\n And I mean, this is nothing that necessarily do with anarchism so much as like, you know,\n\n1:29:52.540 --> 1:29:54.320\n human beings are infinitely complex.\n\n1:29:54.320 --> 1:29:55.820\n We don't often know the backstory.\n\n1:29:55.820 --> 1:30:00.320\n Like for example, just yesterday, Jay, who's here is one of my closest friends.\n\n1:30:00.320 --> 1:30:02.260\n I had a dinner with a bunch of people.\n\n1:30:02.260 --> 1:30:06.340\n I couldn't bring a plus four, so he wasn't invited.\n\n1:30:06.340 --> 1:30:07.700\n He didn't know the circumstances.\n\n1:30:07.700 --> 1:30:09.220\n He just thought we were having dinner without him.\n\n1:30:09.220 --> 1:30:10.320\n He was hurt.\n\n1:30:10.320 --> 1:30:14.660\n Once I spelled it out, he completely understood and I felt horrible because for me to have\n\n1:30:14.660 --> 1:30:19.380\n any of my friends feel left out is just a very, very cruel thing.\n\n1:30:19.380 --> 1:30:23.580\n And I felt bad and I'm glad to apologize again publicly that that's ended up being the circumstances.\n\n1:30:23.580 --> 1:30:27.460\n But yeah, a lot of times we're also in Plato's cave.\n\n1:30:27.460 --> 1:30:30.780\n When you're dealing with somebody else, you have very, very limited information about\n\n1:30:30.780 --> 1:30:32.660\n their background and circumstances.\n\n1:30:32.660 --> 1:30:37.220\n And that's why I will always, if it's someone I even have a little bit of a relationship\n\n1:30:37.220 --> 1:30:41.860\n with, try to give them the benefit of the doubt because I found, especially this comes\n\n1:30:41.860 --> 1:30:45.380\n from being a coauthor, when you coauthor books and you're walking in other people's shoes,\n\n1:30:45.380 --> 1:30:47.560\n you don't know a lot of the information.\n\n1:30:47.560 --> 1:30:51.180\n So a lot of times it's just a misunderstanding.\n\n1:30:51.180 --> 1:30:56.260\n But isn't that a fundamentally anarchist question of how we figure out this puzzle\n\n1:30:56.260 --> 1:30:59.620\n of human complexities in order to form voluntary collectives?\n\n1:30:59.620 --> 1:31:04.140\n Like when you have to figure that out, how to make people feel good, how to make people...\n\n1:31:04.140 --> 1:31:05.140\n I agree.\n\n1:31:05.140 --> 1:31:06.140\n That's fair.\n\n1:31:06.140 --> 1:31:10.820\n I think not only anarchists have to think about this as my point, of course.\n\n1:31:10.820 --> 1:31:11.820\n Well...\n\n1:31:11.820 --> 1:31:13.780\n But we have to think about it more than others do.\n\n1:31:13.780 --> 1:31:14.780\n Right.\n\n1:31:14.780 --> 1:31:19.180\n I feel like I should try to argue against anarchism at some point, out of love, out\n\n1:31:19.180 --> 1:31:20.180\n of love.\n\n1:31:20.180 --> 1:31:21.180\n Okay.\n\n1:31:21.180 --> 1:31:22.180\n And so because people...\n\n1:31:22.180 --> 1:31:23.180\n Out of joy.\n\n1:31:23.180 --> 1:31:29.340\n People enjoy seeing me, what is it, when like Ben Shapiro argues against like a 20 year\n\n1:31:29.340 --> 1:31:30.340\n old feminist.\n\n1:31:30.340 --> 1:31:32.540\n Ben Shapiro destroys high school students with facts and legends.\n\n1:31:32.540 --> 1:31:40.440\n This is this video of Michael Miles destroys a Marxist, Russian, communist pig.\n\n1:31:40.440 --> 1:31:43.540\n So anarchism is opposed to hierarchies.\n\n1:31:43.540 --> 1:31:45.980\n Well that's left anarchism, anarcho communism, yeah.\n\n1:31:45.980 --> 1:31:46.980\n The state.\n\n1:31:46.980 --> 1:31:48.740\n But there are many hierarchies that are not the state.\n\n1:31:48.740 --> 1:31:49.740\n We have a hierarchy here.\n\n1:31:49.740 --> 1:31:50.740\n This is your show.\n\n1:31:50.740 --> 1:31:51.740\n I'm differential to you.\n\n1:31:51.740 --> 1:31:52.740\n Right.\n\n1:31:52.740 --> 1:31:53.740\n But they're...\n\n1:31:53.740 --> 1:31:54.740\n Okay.\n\n1:31:54.740 --> 1:31:55.740\n Rigid hierarchies.\n\n1:31:55.740 --> 1:31:56.740\n Forced hierarchies is the...\n\n1:31:56.740 --> 1:31:57.740\n Forced hierarchies.\n\n1:31:57.740 --> 1:31:58.740\n Forced hierarchies.\n\n1:31:58.740 --> 1:31:59.740\n Okay.\n\n1:31:59.740 --> 1:32:04.940\n So humans, when left on their own accord, they form hierarchies naturally.\n\n1:32:04.940 --> 1:32:06.620\n Yes, inevitably in my opinion.\n\n1:32:06.620 --> 1:32:07.620\n Inevitably.\n\n1:32:07.620 --> 1:32:08.620\n Which is why I disagree with the left anarchists.\n\n1:32:08.620 --> 1:32:14.380\n I think it's not a coherent thing to argue for nonhierarchical relationships, even in\n\n1:32:14.380 --> 1:32:15.380\n theory.\n\n1:32:15.380 --> 1:32:16.380\n It doesn't make sense to me.\n\n1:32:16.380 --> 1:32:22.140\n And I know the old school anarchists will call me stupid or uninformed, but I've never\n\n1:32:22.140 --> 1:32:25.940\n been able to even wrap my head around this claim that you could have relationships without\n\n1:32:25.940 --> 1:32:26.940\n hierarchy.\n\n1:32:26.940 --> 1:32:27.940\n Right.\n\n1:32:27.940 --> 1:32:30.980\n So this is a certain sense in which we're living in an anarchism now.\n\n1:32:30.980 --> 1:32:36.780\n And I don't mean just like, because the nations, as you've said, are in anarchism relative\n\n1:32:36.780 --> 1:32:42.700\n to each other, but isn't the United States just a collective that was formed in anarchy?\n\n1:32:42.700 --> 1:32:47.180\n And this is just the collective that we're operating under, this hierarchy that was naturally\n\n1:32:47.180 --> 1:32:48.180\n formed.\n\n1:32:48.180 --> 1:32:49.180\n It wasn't...\n\n1:32:49.180 --> 1:32:50.180\n Well, the United States was not naturally formed.\n\n1:32:50.180 --> 1:32:51.820\n It was formed by force and by fiat.\n\n1:32:51.820 --> 1:32:56.780\n But to your point, I stress this throughout the book.\n\n1:32:56.780 --> 1:33:00.500\n I always say this anarchism is not a location, it's a relationship.\n\n1:33:00.500 --> 1:33:05.020\n So yeah, you and I do have a hierarchy and this is your show, but neither of us really\n\n1:33:05.020 --> 1:33:06.620\n has an authority over the other.\n\n1:33:06.620 --> 1:33:08.140\n Like I'm here voluntarily.\n\n1:33:08.140 --> 1:33:09.340\n You can kick me out if you want.\n\n1:33:09.340 --> 1:33:10.780\n I can leave it anyone.\n\n1:33:10.780 --> 1:33:13.920\n Neither of us has the power to force the other to be in this relationship we've chosen.\n\n1:33:13.920 --> 1:33:17.420\n My lawyer, I defer to his judgment.\n\n1:33:17.420 --> 1:33:18.580\n He's not forcing me to do it.\n\n1:33:18.580 --> 1:33:20.940\n He gives me his advice and I could take it or leave it.\n\n1:33:20.940 --> 1:33:21.940\n Same with the doctor.\n\n1:33:21.940 --> 1:33:25.300\n So there is a clearly like who's in charge and who's not in charge, but they're not in\n\n1:33:25.300 --> 1:33:27.620\n a position to impose their will on everybody else.\n\n1:33:27.620 --> 1:33:33.900\n And you could very easily see John is Stephanie's lawyer and Stephanie is John's doctor.\n\n1:33:33.900 --> 1:33:37.980\n And in each of those contexts, one has this position of ostensible authority over the\n\n1:33:37.980 --> 1:33:38.980\n other.\n\n1:33:38.980 --> 1:33:42.140\n So anarchism is in fact not some utopian crazy thing.\n\n1:33:42.140 --> 1:33:46.660\n It is the norm of human relationships where you meet people.\n\n1:33:46.660 --> 1:33:48.100\n You're not necessarily equal.\n\n1:33:48.100 --> 1:33:50.980\n Someone's going to be taller, someone's going to be stronger, someone's smarter, wealthier\n\n1:33:50.980 --> 1:33:51.980\n with others.\n\n1:33:51.980 --> 1:33:57.860\n So you're not at all thinking I am here and I could tell you what to do and you are legally\n\n1:33:57.860 --> 1:34:01.460\n or morally obligated to follow my wishes.\n\n1:34:01.460 --> 1:34:03.260\n That is the basis of anarchism.\n\n1:34:03.260 --> 1:34:09.480\n So in what way is the United States imposing by force something on you, do you think?\n\n1:34:09.480 --> 1:34:12.820\n If you leave your house, you will go to jail.\n\n1:34:12.820 --> 1:34:15.720\n My money being taken from me via taxation.\n\n1:34:15.720 --> 1:34:19.180\n But don't you have the freedom to not operate under that?\n\n1:34:19.180 --> 1:34:22.820\n No, but that's like, yeah, like technically if someone comes up to you and mugs you and\n\n1:34:22.820 --> 1:34:26.120\n says your money or your life, you are making a choice.\n\n1:34:26.120 --> 1:34:30.380\n But what the anarchist argument is, they're not in a position to force you to make that\n\n1:34:30.380 --> 1:34:31.380\n choice.\n\n1:34:31.380 --> 1:34:35.900\n That is not morally binding, even though they have practically the power to force you into\n\n1:34:35.900 --> 1:34:37.260\n that dilemma.\n\n1:34:37.260 --> 1:34:41.300\n But you have the freedom to live under the United States or not.\n\n1:34:41.300 --> 1:34:42.300\n So even...\n\n1:34:42.300 --> 1:34:46.680\n Yeah, the argument is if you don't like it, leave, right?\n\n1:34:46.680 --> 1:34:53.940\n Not necessarily leave like geographically, but there's ways to live outside the force\n\n1:34:53.940 --> 1:34:55.300\n of the United States.\n\n1:34:55.300 --> 1:34:57.400\n There's ways, it's just very difficult to operate that way.\n\n1:34:57.400 --> 1:35:01.320\n But that's like saying you could outrun the mugger, which is true, but the issue is does\n\n1:35:01.320 --> 1:35:08.180\n that mugger have the right to tell you at gunpoint, you're either giving me your money\n\n1:35:08.180 --> 1:35:12.420\n or I'm going to shoot you or secret plan C, you get to run away.\n\n1:35:12.420 --> 1:35:14.580\n Is that person a moral actor?\n\n1:35:14.580 --> 1:35:16.540\n And the anarchist answer is never.\n\n1:35:16.540 --> 1:35:21.380\n And just one more thing, the anarchist view is the difference between that mugger and\n\n1:35:21.380 --> 1:35:25.660\n the government is only an air of legitimacy.\n\n1:35:25.660 --> 1:35:27.180\n Literally they're morally identical.\n\n1:35:27.180 --> 1:35:33.180\n So is it possible that every hierarchy that gets big enough and successful enough such\n\n1:35:33.180 --> 1:35:41.300\n that it can monopolize a bunch of services it provides, isn't it always going to be amoral\n\n1:35:41.300 --> 1:35:44.540\n in your sense, the way the United States government is amoral?\n\n1:35:44.540 --> 1:35:47.780\n I don't want to say just like the United States government is amoral because that implies\n\n1:35:47.780 --> 1:35:50.500\n the United States government is uniquely or especially amoral.\n\n1:35:50.500 --> 1:35:51.500\n Governments, I apologize.\n\n1:35:51.500 --> 1:35:53.740\n I just want to clarify that because I know you didn't mean that and I don't want that\n\n1:35:53.740 --> 1:35:56.460\n to be the implication.\n\n1:35:56.460 --> 1:35:57.460\n Can you repeat the question?\n\n1:35:57.460 --> 1:35:58.460\n I'm sorry.\n\n1:35:58.460 --> 1:36:01.540\n So like won't every Okay, so that's right.\n\n1:36:01.540 --> 1:36:03.300\n So that's progressive economics.\n\n1:36:03.300 --> 1:36:07.980\n So the argument is in any market at a certain point, things tend to centralize and then\n\n1:36:07.980 --> 1:36:12.540\n that organization de facto can dictate price, can dictate so on and so forth.\n\n1:36:12.540 --> 1:36:14.740\n That is completely historical.\n\n1:36:14.740 --> 1:36:20.020\n If you look at any market, the trend is always towards decentralization, the music industry,\n\n1:36:20.020 --> 1:36:21.020\n right?\n\n1:36:21.020 --> 1:36:23.460\n When we were kids, there were four or five record labels.\n\n1:36:23.460 --> 1:36:25.740\n They were the ones who made all the songs that you're going to see in the Billboard\n\n1:36:25.740 --> 1:36:27.560\n Top 100 with a few exceptions.\n\n1:36:27.560 --> 1:36:30.020\n Now anyone can go to direct to market.\n\n1:36:30.020 --> 1:36:35.100\n If you look at TV stations, right, it went from CBS, NBC, ABC, then you got Fox, then\n\n1:36:35.100 --> 1:36:36.620\n you had cable, which is 100.\n\n1:36:36.620 --> 1:36:39.380\n Now you have satellite, which have sounds around the world and you have YouTube, which\n\n1:36:39.380 --> 1:36:40.700\n is literally infinite.\n\n1:36:40.700 --> 1:36:45.780\n So as technology improves and as wealth increases, which is a function of free enterprise, you\n\n1:36:45.780 --> 1:36:52.900\n are going to always have more and more choice, even within a monopoly, Coca Cola, right?\n\n1:36:52.900 --> 1:36:56.460\n This is an example I used, I think in the new right, when we were kids, every terrible\n\n1:36:56.460 --> 1:37:02.220\n comedian would be like, oh, now that I've got diet caffeine free Coke, what's next?\n\n1:37:02.220 --> 1:37:03.880\n It's like, yeah, that's good.\n\n1:37:03.880 --> 1:37:08.900\n You want to have, what was his name, Cayman, the guy who invented the Segway.\n\n1:37:08.900 --> 1:37:14.860\n If you go, Dean Cayman, if you go into some restaurants right now, you will have those\n\n1:37:14.860 --> 1:37:15.860\n machines.\n\n1:37:15.860 --> 1:37:19.580\n You have like 80 kinds of Cokes and then you could have whatever flavor you want to add\n\n1:37:19.580 --> 1:37:20.580\n to it.\n\n1:37:20.580 --> 1:37:22.700\n Grape, cherry, lemon, lime, so on and so forth.\n\n1:37:22.700 --> 1:37:27.200\n So in any field, you're going to have more and more competition.\n\n1:37:27.200 --> 1:37:31.660\n You're going to have less competition and less choices when the state gets involved\n\n1:37:31.660 --> 1:37:33.640\n because the state wants control.\n\n1:37:33.640 --> 1:37:37.980\n The state wants one big neck with one leash around it and that way it could just pull\n\n1:37:37.980 --> 1:37:39.940\n that dog in one direction or another.\n\n1:37:39.940 --> 1:37:44.380\n And you saw this last year with the lockdowns, Carol Roth wrote this amazing book called\n\n1:37:44.380 --> 1:37:49.620\n The War on Small Business and she talked about, we have seen for the first time in history\n\n1:37:49.620 --> 1:37:55.380\n a massive wealth transfer from small and medium business towards organizations like Target\n\n1:37:55.380 --> 1:37:59.140\n and Amazon who made trillions of dollars last year.\n\n1:37:59.140 --> 1:38:03.540\n Whereas mom and pop, which to me at least is like the acme of American achievement.\n\n1:38:03.540 --> 1:38:08.780\n You come to America, you have a fruit stand, a laundromat, you make socks, whatever it\n\n1:38:08.780 --> 1:38:11.860\n is, you're that unique artisan creating something special.\n\n1:38:11.860 --> 1:38:14.780\n They're the ones who didn't last whereas Target and Amazon did.\n\n1:38:14.780 --> 1:38:18.460\n So when you have the state involvement, it will always be in favor of Jeff Bezos and\n\n1:38:18.460 --> 1:38:23.100\n for the simple reason that it's going to be a lot easier for Jeff Bezos to get Nancy Pelosi\n\n1:38:23.100 --> 1:38:27.780\n and Mitch McConnell on the phone than it is for me making socks on Etsy.\n\n1:38:27.780 --> 1:38:34.620\n Your sense is that there'll be less and less over time Jeff Bezos is like whatever industry\n\n1:38:34.620 --> 1:38:42.100\n we look at, there's be less, there's a trend towards decentralization across all industries.\n\n1:38:42.100 --> 1:38:45.660\n And when I say decentralization, I just mean choice, right?\n\n1:38:45.660 --> 1:38:50.100\n So if you look at again, networks, you're going to, if you were in the 80s and you had\n\n1:38:50.100 --> 1:38:55.220\n a network just for LGBT issues, first of all, it's going to be complete heretical.\n\n1:38:55.220 --> 1:38:58.420\n That's not going to happen and there's not going to be enough necessarily people identifies\n\n1:38:58.420 --> 1:38:59.740\n that to have an audience.\n\n1:38:59.740 --> 1:39:01.020\n Then there was something called logo.\n\n1:39:01.020 --> 1:39:03.640\n They have that and there's lots of other shows like that in this way.\n\n1:39:03.640 --> 1:39:06.580\n So more specific, look at websites.\n\n1:39:06.580 --> 1:39:12.940\n I am positive that you and I, if we wanted to look up breeding guinea pigs, would find\n\n1:39:12.940 --> 1:39:17.580\n thousands of websites about different breeds and all this other stuff 20 years ago, 30\n\n1:39:17.580 --> 1:39:21.660\n years ago, like you're going to have two books and they're not going to be dynamic as these\n\n1:39:21.660 --> 1:39:24.560\n new breeds are developed.\n\n1:39:24.560 --> 1:39:31.780\n So at the same time it does, following on your argument, it does seem easier to move\n\n1:39:31.780 --> 1:39:37.020\n and immigrate from state to state within the United States and to other countries.\n\n1:39:37.020 --> 1:39:45.020\n Do you think that's a form of freedom that embodies anarchism where you can resist the\n\n1:39:45.020 --> 1:39:47.540\n force of state by choosing where you live?\n\n1:39:47.540 --> 1:39:51.860\n To some extent, but the line of people, some of these boomers will go at me on Twitter\n\n1:39:51.860 --> 1:39:55.100\n if I'm going after the police or something and be like, if you don't like America, get\n\n1:39:55.100 --> 1:39:56.100\n out of here.\n\n1:39:56.100 --> 1:39:59.780\n And I tell them freedom means I do what I want, not what you want.\n\n1:39:59.780 --> 1:40:01.640\n Freedom means I don't have to move.\n\n1:40:01.640 --> 1:40:02.880\n You don't have to move.\n\n1:40:02.880 --> 1:40:04.020\n Free speech is a good example.\n\n1:40:04.020 --> 1:40:05.880\n It doesn't mean I have to be on Twitter, right?\n\n1:40:05.880 --> 1:40:06.880\n Twitter has the right to ban me.\n\n1:40:06.880 --> 1:40:11.460\n But what I'm saying is I'm saying something and you don't like it, too bad.\n\n1:40:11.460 --> 1:40:15.860\n You're the one who has to accommodate me because I have a right to do what I want with my person\n\n1:40:15.860 --> 1:40:18.100\n as long as I'm being peaceful.\n\n1:40:18.100 --> 1:40:24.660\n So I guess I'm trying to get to the difference between the state and what you would naturally\n\n1:40:24.660 --> 1:40:31.300\n want in anarchy, which is like a security company, all of those things.\n\n1:40:31.300 --> 1:40:36.640\n They will, as they become successful, start looking more and more like the state.\n\n1:40:36.640 --> 1:40:42.180\n Because you get to elect, you give them money, they have leaders.\n\n1:40:42.180 --> 1:40:49.380\n What's the difference between a government and a very successful service provider in\n\n1:40:49.380 --> 1:40:50.380\n anarchism?\n\n1:40:50.380 --> 1:40:55.420\n Well, this gets a little confused in America as big companies necessarily are hand in hand\n\n1:40:55.420 --> 1:40:57.580\n with the government ended up in bed with them.\n\n1:40:57.580 --> 1:41:00.020\n The answer to this question is a long, complicated one.\n\n1:41:00.020 --> 1:41:02.340\n And thankfully, it's all in the Anarchist Handbook.\n\n1:41:02.340 --> 1:41:06.000\n There was an essay by Murray Rothbard who Dave Smith, this is the essay that converted\n\n1:41:06.000 --> 1:41:07.000\n Dave Smith.\n\n1:41:07.000 --> 1:41:11.100\n So maybe it's not as good as it could have been otherwise called Anatomy of the State.\n\n1:41:11.100 --> 1:41:16.480\n And Murray Rothbard points out that state is the only agency in a country which gets\n\n1:41:16.480 --> 1:41:18.580\n its goods through force.\n\n1:41:18.580 --> 1:41:23.980\n The state is the only agency that is not a producer, but inherently a parasite because\n\n1:41:23.980 --> 1:41:28.860\n it does not get its money voluntarily, but through taxation and by imposing its values\n\n1:41:28.860 --> 1:41:30.140\n on a country.\n\n1:41:30.140 --> 1:41:34.840\n That is what makes a state uniquely different from, let's suppose, an Amazon or a Barnes\n\n1:41:34.840 --> 1:41:36.380\n and Noble or a Target.\n\n1:41:36.380 --> 1:41:42.980\n Jeff Bezos does not have the authority or the moral legitimacy to get an army and go\n\n1:41:42.980 --> 1:41:48.900\n into somebody's house, whereas Andrew Cuomo or Ron DeSantis, Donald Trump and Barack Obama\n\n1:41:48.900 --> 1:41:50.160\n certainly do.\n\n1:41:50.160 --> 1:42:00.900\n But is it possible that to reframe, so Jeff Bezos does if he hires a security force, also\n\n1:42:00.900 --> 1:42:06.060\n is it possible to reframe taxation as a form of payment?\n\n1:42:06.060 --> 1:42:11.660\n If it was done much better, if you could pay this collective that we call government in\n\n1:42:11.660 --> 1:42:18.780\n ways where you could pay for things that you care for, your money would be much more directly\n\n1:42:18.780 --> 1:42:21.120\n contributing to the things you care for.\n\n1:42:21.120 --> 1:42:25.740\n If you care for a service like healthcare, you'll be able to buy essentially insurance\n\n1:42:25.740 --> 1:42:26.740\n from the government.\n\n1:42:26.740 --> 1:42:29.780\n Why am I buying insurance from the government as opposed to insurance from an insurance\n\n1:42:29.780 --> 1:42:30.780\n company?\n\n1:42:30.780 --> 1:42:33.140\n What do you perceive as the difference between a tax and a price?\n\n1:42:33.140 --> 1:42:34.140\n Do you see the difference?\n\n1:42:34.140 --> 1:42:40.980\n Yes, I know on the surface level, I'm trying to get deeply to say there's a lot of similarities.\n\n1:42:40.980 --> 1:42:45.860\n But what I'm saying is there's one essential difference, which is taxes are imposed on\n\n1:42:45.860 --> 1:42:48.940\n you and you have no choice.\n\n1:42:48.940 --> 1:42:49.940\n Here's an example.\n\n1:42:49.940 --> 1:42:53.780\n My book, Ego and Hubris, my biography, it goes for $500 on eBay.\n\n1:42:53.780 --> 1:42:54.780\n Someone paid for it.\n\n1:42:54.780 --> 1:42:55.780\n Some crazy person.\n\n1:42:55.780 --> 1:42:59.940\n People were showing me that it's on Amazon for $3,000, something like that.\n\n1:42:59.940 --> 1:43:01.360\n You could put a million for it.\n\n1:43:01.360 --> 1:43:03.100\n You could charge whatever price you want.\n\n1:43:03.100 --> 1:43:05.460\n The question is, is someone paying that $3,000 for it?\n\n1:43:05.460 --> 1:43:07.400\n Is someone paying that million for it?\n\n1:43:07.400 --> 1:43:11.820\n It's actually the buyer who establishes the price because the seller can put any price\n\n1:43:11.820 --> 1:43:14.340\n that he wants, $80 trillion.\n\n1:43:14.340 --> 1:43:18.220\n But unless someone's paying that amount and clearing the market, that price has literally\n\n1:43:18.220 --> 1:43:19.540\n no real meaning.\n\n1:43:19.540 --> 1:43:22.180\n It's not an indicator of value or worth or market price.\n\n1:43:22.180 --> 1:43:25.100\n Taxation, on the other hand, is by fiat.\n\n1:43:25.100 --> 1:43:32.180\n I can decide it's fair that you, Lex, have to pay 40% and Joe has to pay 45%.\n\n1:43:32.180 --> 1:43:36.100\n Joe and Lex are in no position to be like, this price is too high.\n\n1:43:36.100 --> 1:43:43.380\n Not only is that money set just completely out of their hands, for people who are employees,\n\n1:43:43.380 --> 1:43:45.700\n it's taken out of their paychecks before they even see it.\n\n1:43:45.700 --> 1:43:48.140\n So they don't even have the choice to be like, you know what?\n\n1:43:48.140 --> 1:43:50.940\n I agree that the government has the right to pay taxation.\n\n1:43:50.940 --> 1:43:52.340\n Here's my check for 40%.\n\n1:43:52.340 --> 1:43:53.340\n It's going on.\n\n1:43:53.340 --> 1:43:56.620\n It's a completely different paradigm than you are when you're paying for price.\n\n1:43:56.620 --> 1:43:59.980\n The government provides a lot of services in the current system.\n\n1:43:59.980 --> 1:44:05.180\n But there's no service the government provides that would not be provided better, more efficiently,\n\n1:44:05.180 --> 1:44:07.180\n and with more choices in a market.\n\n1:44:07.180 --> 1:44:08.180\n That's a hypothesis.\n\n1:44:08.180 --> 1:44:09.180\n No, that's very likely.\n\n1:44:09.180 --> 1:44:10.180\n Well, that's not a...\n\n1:44:10.180 --> 1:44:11.180\n I can demonstrate this to you very easily.\n\n1:44:11.180 --> 1:44:15.940\n I love it when you get flustered.\n\n1:44:15.940 --> 1:44:17.940\n This is what people like.\n\n1:44:17.940 --> 1:44:18.940\n It's so cute.\n\n1:44:18.940 --> 1:44:19.940\n The robot's...\n\n1:44:19.940 --> 1:44:21.940\n Don't make me put on the hat again.\n\n1:44:21.940 --> 1:44:22.940\n The robot has a fire.\n\n1:44:22.940 --> 1:44:26.300\n There's smoke coming out of his ears.\n\n1:44:26.300 --> 1:44:28.300\n What is price?\n\n1:44:28.300 --> 1:44:33.620\n I will tax love.\n\n1:44:33.620 --> 1:44:36.660\n I think of the government as a kind of subscription service.\n\n1:44:36.660 --> 1:44:37.660\n No, no.\n\n1:44:37.660 --> 1:44:38.780\n That's the anarchist view.\n\n1:44:38.780 --> 1:44:42.620\n The anarchist view of private security would be a subscription service.\n\n1:44:42.620 --> 1:44:44.060\n So that's exactly correct.\n\n1:44:44.060 --> 1:44:50.100\n But everyone hates when you sign up to a gym, and then you realize in the contract, it's\n\n1:44:50.100 --> 1:44:54.940\n very difficult to cancel that membership, and then they up the price.\n\n1:44:54.940 --> 1:45:00.540\n There's a lot of unpleasant things with a subscription service that then you can elect\n\n1:45:00.540 --> 1:45:03.620\n to go to another subscription service.\n\n1:45:03.620 --> 1:45:06.980\n Or you could go and Yelp and complain, and if there's enough people to do that, the gym\n\n1:45:06.980 --> 1:45:08.140\n will be receptive.\n\n1:45:08.140 --> 1:45:11.060\n Look at the power of Yelp versus the power of the vote.\n\n1:45:11.060 --> 1:45:13.380\n Well, we could talk about that too.\n\n1:45:13.380 --> 1:45:18.740\n So you're saying Yelp is more effective than voting.\n\n1:45:18.740 --> 1:45:25.340\n The thing is, I agree with you, but you take a further step.\n\n1:45:25.340 --> 1:45:31.180\n You say that Yelp is ethical and moral, and voting is amoral.\n\n1:45:31.180 --> 1:45:34.580\n Or like not voting, but government is amoral.\n\n1:45:34.580 --> 1:45:38.960\n So like it's not only is one more efficient than the other, you're saying like, because\n\n1:45:38.960 --> 1:45:44.460\n I would say government sucks at doing what it does, and it's gotten a lot better at it,\n\n1:45:44.460 --> 1:45:50.900\n and I believe it can keep getting better as it gets smaller and it leverages companies\n\n1:45:50.900 --> 1:45:51.900\n more and more.\n\n1:45:51.900 --> 1:45:59.620\n But you're saying, no, no, no, government is fundamentally as an idea gets in the way\n\n1:45:59.620 --> 1:46:03.420\n of companies that should be doing those things anyway.\n\n1:46:03.420 --> 1:46:07.660\n I just think that companies, when you take away government, will start looking like government.\n\n1:46:07.660 --> 1:46:11.520\n Just because something looks like something does not mean it's the same.\n\n1:46:11.520 --> 1:46:16.740\n If someone puts out a yarmulke and tefillin and they go to shul, they're not Jewish.\n\n1:46:16.740 --> 1:46:18.220\n Right.\n\n1:46:18.220 --> 1:46:23.580\n The basic objection you have with government, because you can leave, like I apologize that\n\n1:46:23.580 --> 1:46:26.740\n this is that stupid Twitter cliche statement.\n\n1:46:26.740 --> 1:46:34.380\n But your opposition to this idea of leaving the United States is that it's just, it's\n\n1:46:34.380 --> 1:46:35.380\n a lot of effort.\n\n1:46:35.380 --> 1:46:36.380\n It's too much friction.\n\n1:46:36.380 --> 1:46:37.380\n That's not the option.\n\n1:46:37.380 --> 1:46:43.940\n The opposition is in the introduction to the book, I say anarchism can be summed up in\n\n1:46:43.940 --> 1:46:44.940\n one sentence.\n\n1:46:44.940 --> 1:46:46.500\n You do not speak for me.\n\n1:46:46.500 --> 1:46:47.900\n Everything else is application.\n\n1:46:47.900 --> 1:46:53.180\n So the claim that somebody I've never met or who I voted against, let's say, I hate\n\n1:46:53.180 --> 1:46:56.980\n Donald Trump, I despise him, I want Hillary Clinton to be president.\n\n1:46:56.980 --> 1:46:59.940\n Too bad Trump's your president, that's not what I want.\n\n1:46:59.940 --> 1:47:05.200\n The idea that this person can come on me and make any claims onto one second of my time,\n\n1:47:05.200 --> 1:47:09.700\n as opposed to try to persuade me, that is something that I, an anarchist, regard as\n\n1:47:09.700 --> 1:47:12.780\n inherently evil and nonsensical.\n\n1:47:12.780 --> 1:47:18.180\n But to operate large organizations, like you see this with cryptocurrency, there's governance,\n\n1:47:18.180 --> 1:47:20.220\n you have to make difficult decisions.\n\n1:47:20.220 --> 1:47:22.140\n It's a block size wars for Bitcoin.\n\n1:47:22.140 --> 1:47:23.140\n Sure.\n\n1:47:23.140 --> 1:47:27.060\n So you will, there is a voting mechanism often with membership when you're a subscription\n\n1:47:27.060 --> 1:47:28.060\n service.\n\n1:47:28.060 --> 1:47:31.740\n But see, the thing is, you're using these words and you're switching definitions.\n\n1:47:31.740 --> 1:47:35.980\n Because like, if I go to a store, I can technically say I'm voting for Tropicana orange juice\n\n1:47:35.980 --> 1:47:37.700\n as opposed to another one.\n\n1:47:37.700 --> 1:47:41.800\n But to kind of say, oh, well, you're making a choice there for every choice is a vote.\n\n1:47:41.800 --> 1:47:44.780\n I don't, I think that that's something that the Venn diagram is not.\n\n1:47:44.780 --> 1:47:47.060\n No, I literally mean vote in this case, not money.\n\n1:47:47.060 --> 1:47:48.060\n Okay.\n\n1:47:48.060 --> 1:47:52.460\n There's some decisions, like, should Bitcoin have increases block size?\n\n1:47:52.460 --> 1:47:53.460\n Okay.\n\n1:47:53.460 --> 1:47:56.820\n There's a bunch of different, they're called soft forks or hard forks.\n\n1:47:56.820 --> 1:48:00.940\n Oh, I'm not saying you should never vote, like stockholders have to vote, right?\n\n1:48:00.940 --> 1:48:01.940\n Exactly.\n\n1:48:01.940 --> 1:48:02.940\n But there's no pretense.\n\n1:48:02.940 --> 1:48:04.420\n Here's, let's look at this.\n\n1:48:04.420 --> 1:48:06.280\n If you want to build robots, right?\n\n1:48:06.280 --> 1:48:09.060\n You would sit down with the company, you would, you guys would be like, we should do this\n\n1:48:09.060 --> 1:48:10.780\n kind of robot, we should do this kind of robot.\n\n1:48:10.780 --> 1:48:14.860\n The stockholders would have a vote or the board in proportion to their investment in\n\n1:48:14.860 --> 1:48:15.860\n the firm.\n\n1:48:15.860 --> 1:48:22.480\n Me, who knows nothing about robots, the idea that I'm in a position to walk in and be like,\n\n1:48:22.480 --> 1:48:28.060\n this is what you should do is crazy and bizarre and wrong because I'm not in a foreign position.\n\n1:48:28.060 --> 1:48:33.500\n So what democracy does is it forces people who run businesses well to run businesses\n\n1:48:33.500 --> 1:48:37.080\n poorly by people who don't know how to run businesses at all.\n\n1:48:37.080 --> 1:48:39.220\n That's the, that's one of the many concerns.\n\n1:48:39.220 --> 1:48:43.300\n But you're saying that's the fundamental property of the state.\n\n1:48:43.300 --> 1:48:47.820\n I have a sense that the state could become as effective as what we think of as companies.\n\n1:48:47.820 --> 1:48:49.060\n I mean, as.\n\n1:48:49.060 --> 1:48:53.720\n This is why they can't, because the state does not have access to data the way that\n\n1:48:53.720 --> 1:48:55.020\n firms do.\n\n1:48:55.020 --> 1:48:59.660\n And this is one of Ludwig von Mises's great points, what he called the calculation problem.\n\n1:48:59.660 --> 1:49:04.900\n If I'm looking at comic books, right, and I have Detective Comics, if Detective Comics\n\n1:49:04.900 --> 1:49:12.500\n 26 is a thousand and Detective Comics 28 is a thousand and Detective Comics 27 is 50,000,\n\n1:49:12.500 --> 1:49:16.780\n that is telling me that even if I don't know anything about comics, that Detective Comics\n\n1:49:16.780 --> 1:49:21.620\n 27 is either very, very scarce for some reason or very, very desirable.\n\n1:49:21.620 --> 1:49:24.880\n It's the first appearance of Batman, whatever, but you don't need to know that to just look\n\n1:49:24.880 --> 1:49:28.620\n at this data and be like, okay, this is the market, tell me something.\n\n1:49:28.620 --> 1:49:33.120\n If prices are set by the government, which the government is a monopoly, I have no way\n\n1:49:33.120 --> 1:49:35.220\n of picking those winners or losers.\n\n1:49:35.220 --> 1:49:40.620\n I don't have that data of supply and demand of an entire nation or a world of people making\n\n1:49:40.620 --> 1:49:47.420\n individual decisions and having price be dynamic and informing me as the organization where\n\n1:49:47.420 --> 1:49:49.380\n I should allocate my resources.\n\n1:49:49.380 --> 1:49:58.100\n So the price is a really strong signal that allows you to operate a voluntary collective\n\n1:49:58.100 --> 1:50:01.900\n where people get what they want and don't get what they don't want.\n\n1:50:01.900 --> 1:50:04.580\n And it tells me what to produce, what not to produce.\n\n1:50:04.580 --> 1:50:08.860\n And it also is great because if I see this podcasting industry, which didn't exist five\n\n1:50:08.860 --> 1:50:15.380\n years ago, and now these people are making bank, that tells me as someone who is an investor,\n\n1:50:15.380 --> 1:50:19.540\n they're making 50%, whatever, 10% profit on their capital.\n\n1:50:19.540 --> 1:50:22.260\n In the plant industry, it's 2%.\n\n1:50:22.260 --> 1:50:26.940\n If I'm going to further my capital to this 10%, and that's going to lower the profit\n\n1:50:26.940 --> 1:50:29.060\n rate as that builds up.\n\n1:50:29.060 --> 1:50:32.500\n And that is how markets are regulated, voluntarily.\n\n1:50:32.500 --> 1:50:38.880\n But the word government, I just think it's possible to have collectives of human beings\n\n1:50:38.880 --> 1:50:42.220\n that represent others based on their voluntary...\n\n1:50:42.220 --> 1:50:46.540\n Yes, of course, you have private governance.\n\n1:50:46.540 --> 1:50:50.040\n Any company, you can have a CEO, you can have a board of directors.\n\n1:50:50.040 --> 1:50:57.980\n But then you, I just, it starts to look very similar to me, a successful private governance\n\n1:50:57.980 --> 1:51:04.260\n mechanism at a scale of the United States starts looking a whole lot like the current\n\n1:51:04.260 --> 1:51:07.600\n government of the United States.\n\n1:51:07.600 --> 1:51:12.300\n Even Amazon, I don't think is anything close to the federal budget, size wise or budget\n\n1:51:12.300 --> 1:51:13.580\n wise or power wise.\n\n1:51:13.580 --> 1:51:14.580\n No.\n\n1:51:14.580 --> 1:51:19.600\n So you're saying you just, it's not even state, it's almost like anything at that size.\n\n1:51:19.600 --> 1:51:21.500\n You want to keep things smaller.\n\n1:51:21.500 --> 1:51:29.160\n And I don't, markets are not going to combine to that level of the state because Jeff Bezos\n\n1:51:29.160 --> 1:51:34.100\n will never be in a position to tell everyone in America, I'm going to take 40% of your\n\n1:51:34.100 --> 1:51:35.580\n money before you even see it.\n\n1:51:35.580 --> 1:51:37.380\n That to me is actually unclear.\n\n1:51:37.380 --> 1:51:41.580\n We don't know that to be true, where that Google or Amazon can't grow to the size.\n\n1:51:41.580 --> 1:51:46.180\n If you take away the US government, I'm not so sure that Amazon can't grow to the size\n\n1:51:46.180 --> 1:51:47.180\n of the US government.\n\n1:51:47.180 --> 1:51:52.700\n Okay, so worst case scenario is we're back where we started, right?\n\n1:51:52.700 --> 1:51:54.260\n That's not worst case scenario.\n\n1:51:54.260 --> 1:51:58.600\n But the concern is that Google is going to be the federal government?\n\n1:51:58.600 --> 1:51:59.600\n That's not the concern.\n\n1:51:59.600 --> 1:52:02.580\n I'm saying like, this is what it looks like when Google is the federal government.\n\n1:52:02.580 --> 1:52:10.140\n It's not, it's like, to me, the US government is our best attempt so far to have large scale\n\n1:52:10.140 --> 1:52:12.460\n representation of people's interest.\n\n1:52:12.460 --> 1:52:16.580\n It really sucks, but it's our best attempt so far and the question is how to improve\n\n1:52:16.580 --> 1:52:17.580\n it.\n\n1:52:17.580 --> 1:52:21.740\n Like if you take away all, if you take away the US government, I'm trying to see how do\n\n1:52:21.740 --> 1:52:27.780\n we improve on that level, that scale of representation of people's interest.\n\n1:52:27.780 --> 1:52:30.740\n Let me give you one example that people could wrap their hands around very easily.\n\n1:52:30.740 --> 1:52:34.780\n I'm against government police monopoly, I'm for private security, right?\n\n1:52:34.780 --> 1:52:37.180\n You don't have to be an anarchist to understand this.\n\n1:52:37.180 --> 1:52:42.780\n Can everyone agree, or at least as a hypothesis, everyone can wrap their heads around, here's\n\n1:52:42.780 --> 1:52:44.980\n a big concern, 911, right?\n\n1:52:44.980 --> 1:52:47.340\n I've heard this 911 call, it's very chilling.\n\n1:52:47.340 --> 1:52:50.100\n There's a kid in a closet, his family's being murdered outside, right?\n\n1:52:50.100 --> 1:52:51.860\n He has to call 911, he's whispering.\n\n1:52:51.860 --> 1:52:53.940\n It's horrifying to hear.\n\n1:52:53.940 --> 1:52:59.540\n There's no reason why the number I call for my family's being murdered is the same number\n\n1:52:59.540 --> 1:53:02.660\n I call for the fire department is the same number I call for an ambulance.\n\n1:53:02.660 --> 1:53:04.620\n What if instead it operated like Uber?\n\n1:53:04.620 --> 1:53:09.220\n You have buttons on your phone, if there's a real emergency, like someone's gun flyers,\n\n1:53:09.220 --> 1:53:14.660\n someone's being killed, you press this and it sends instead of the one police district,\n\n1:53:14.660 --> 1:53:18.320\n whatever company is nearby, you have a bunch of them and they're the ones who are going\n\n1:53:18.320 --> 1:53:20.260\n to come to your house to save you.\n\n1:53:20.260 --> 1:53:22.280\n People can wrap their heads around that very easily.\n\n1:53:22.280 --> 1:53:27.500\n That is one very clear way to go from having a government security monopoly towards having\n\n1:53:27.500 --> 1:53:29.660\n a more free enterprise system.\n\n1:53:29.660 --> 1:53:34.360\n So when you apply that to pretty much anything, it doesn't become that complicated of an alternative.\n\n1:53:34.360 --> 1:53:42.140\n So what I would, you're going to criticize this, but I believe the government, it's like\n\n1:53:42.140 --> 1:53:49.480\n the parenting thing we've talked about earlier, I think it creates a safe space for gov, for\n\n1:53:49.480 --> 1:53:52.820\n I'm for safe spaces, so I'm not going to laugh at you about that.\n\n1:53:52.820 --> 1:53:54.060\n I want people to be safe.\n\n1:53:54.060 --> 1:53:57.340\n But for a safe space for entrepreneurship.\n\n1:53:57.340 --> 1:54:02.180\n So I believe that good government, hold on a sec, give me a sec, give me a sec.\n\n1:54:02.180 --> 1:54:03.180\n Sure, sure.\n\n1:54:03.180 --> 1:54:04.180\n I'm sorry.\n\n1:54:04.180 --> 1:54:05.180\n I'm sorry.\n\n1:54:05.180 --> 1:54:06.180\n You're right.\n\n1:54:06.180 --> 1:54:07.180\n You're right.\n\n1:54:07.180 --> 1:54:08.180\n I'm sorry.\n\n1:54:08.180 --> 1:54:11.700\n I think government gives a opportunity for companies to out compete it.\n\n1:54:11.700 --> 1:54:12.700\n Yes.\n\n1:54:12.700 --> 1:54:16.140\n UPS, FedEx, 100%, not a question.\n\n1:54:16.140 --> 1:54:23.780\n So I believe you need to have private schools, government to give a chance for UPS, FedEx,\n\n1:54:23.780 --> 1:54:30.660\n for SpaceX, oh there's an X in there, to pop up and then government will naturally back\n\n1:54:30.660 --> 1:54:32.260\n off from that place.\n\n1:54:32.260 --> 1:54:36.300\n So like you, but you need the innovators to step in and build the thing.\n\n1:54:36.300 --> 1:54:37.300\n Okay.\n\n1:54:37.300 --> 1:54:38.300\n Like you can't just.\n\n1:54:38.300 --> 1:54:39.840\n When has government ever backed off though?\n\n1:54:39.840 --> 1:54:40.840\n That never happens.\n\n1:54:40.840 --> 1:54:47.660\n I back, well, from FedEx and UPS, from SpaceX, from Amazon.\n\n1:54:47.660 --> 1:54:49.500\n Wait, wait, hold on.\n\n1:54:49.500 --> 1:54:52.720\n The US Postal Service still competes with FedEx and UPS.\n\n1:54:52.720 --> 1:54:53.940\n So here's the other thing.\n\n1:54:53.940 --> 1:54:54.940\n Not nearly.\n\n1:54:54.940 --> 1:54:55.940\n Not well, but they still exist.\n\n1:54:55.940 --> 1:54:56.940\n And the point is.\n\n1:54:56.940 --> 1:54:57.940\n They're dying.\n\n1:54:57.940 --> 1:55:00.840\n But UPS and FedEx are taxed.\n\n1:55:00.840 --> 1:55:04.320\n So not only are they paying for their own company, they're paying for this competitor.\n\n1:55:04.320 --> 1:55:06.220\n This is the essential difference.\n\n1:55:06.220 --> 1:55:10.340\n Imagine if you didn't have UPS, excuse me, the federal government and no post office.\n\n1:55:10.340 --> 1:55:13.940\n So you had FedEx, you have DHL, you have US Postal Service and many others.\n\n1:55:13.940 --> 1:55:22.480\n How about in this scenario, UPS has the capacity to take 20% of FedEx's DHL and couriers money\n\n1:55:22.480 --> 1:55:25.220\n and put in their own pocket and they never have to do anything in return.\n\n1:55:25.220 --> 1:55:28.340\n This is going to be an enormous advantage of UPS.\n\n1:55:28.340 --> 1:55:32.180\n And then when you add the addition that UPS is not necessarily going to be more efficient\n\n1:55:32.180 --> 1:55:35.300\n than the others, this is going to be a huge distortion in the market.\n\n1:55:35.300 --> 1:55:39.180\n Can you imagine if your podcast, you just automatically got 20% of the views of everybody\n\n1:55:39.180 --> 1:55:40.180\n else?\n\n1:55:40.180 --> 1:55:42.420\n I mean, would there be any incentive for you to be great?\n\n1:55:42.420 --> 1:55:47.060\n Or you could just sit in your laurels and do whatever you want even more than now.\n\n1:55:47.060 --> 1:55:48.500\n It's hard to imagine more than now.\n\n1:55:48.500 --> 1:55:51.300\n That's because you're a robot and lack imagination.\n\n1:55:51.300 --> 1:55:56.260\n I think there just has to be, of course you can do it completely without government, but\n\n1:55:56.260 --> 1:55:57.260\n government...\n\n1:55:57.260 --> 1:55:58.260\n That's all I need to hear.\n\n1:55:58.260 --> 1:55:59.260\n Okay.\n\n1:55:59.260 --> 1:56:00.260\n That's all I need to hear.\n\n1:56:00.260 --> 1:56:01.260\n Show's over.\n\n1:56:01.260 --> 1:56:02.260\n Show's over.\n\n1:56:02.260 --> 1:56:03.260\n What else you can do without government at the end?\n\n1:56:03.260 --> 1:56:04.260\n Let us try.\n\n1:56:04.260 --> 1:56:09.860\n The question is that safety net that's needed for entrepreneurship, that's needed for, I'm\n\n1:56:09.860 --> 1:56:14.480\n sorry to say, but I have a sense that there needs to be a bit of a safety net for freedom.\n\n1:56:14.480 --> 1:56:18.700\n I'm much more comfortable with saying you need a safety net for freedom than you need\n\n1:56:18.700 --> 1:56:20.200\n one for entrepreneurs.\n\n1:56:20.200 --> 1:56:25.740\n The beauty of markets is with your startup, if you have a startup and it completely fails,\n\n1:56:25.740 --> 1:56:28.440\n the only person who's screwed is you and your investors.\n\n1:56:28.440 --> 1:56:32.620\n If I'm a government and I make a startup, the entire society fails, like the Iraq war.\n\n1:56:32.620 --> 1:56:36.460\n If I have this cockamamie plan, everyone else doesn't have a choice.\n\n1:56:36.460 --> 1:56:40.340\n They are both funding it and sometimes even drafted or forced into it.\n\n1:56:40.340 --> 1:56:44.260\n The safety net, the antlers, getting back to the early anarchists, one of the things\n\n1:56:44.260 --> 1:56:49.380\n that I admire about them, the inaugural communists, the old school left anarchists, is people\n\n1:56:49.380 --> 1:56:51.620\n don't remember what context they were in.\n\n1:56:51.620 --> 1:56:55.280\n They were in context without a welfare state, they're immigrating in huge numbers from\n\n1:56:55.280 --> 1:57:00.060\n Eastern Europe, you go to the Tenement Museum in New York, people like 12 to a room, kids\n\n1:57:00.060 --> 1:57:03.420\n are working in factories, they're either working in factories or they have to starve.\n\n1:57:03.420 --> 1:57:06.500\n It's not that their parents didn't love them, it's that the parents didn't have birth control,\n\n1:57:06.500 --> 1:57:09.960\n which was a felony, and they also were in a position to put food on the table for their\n\n1:57:09.960 --> 1:57:13.180\n kids because they're uneducated and the jobs are paying nothing.\n\n1:57:13.180 --> 1:57:17.980\n You could understand why Emma Goldman, Alexander Berkman, Proudhon, and all these other figures\n\n1:57:17.980 --> 1:57:24.100\n were like, this is untenable, we see Carnegie with 80,000 mansions, whereas this lady whose\n\n1:57:24.100 --> 1:57:29.780\n husband died at age 30, who's never been to high school or even junior high school, has\n\n1:57:29.780 --> 1:57:33.340\n 10 kids, how's she going to put food on the table, it's not going to happen.\n\n1:57:33.340 --> 1:57:36.780\n You could understand why they would be like, all right, we need to seize this money and\n\n1:57:36.780 --> 1:57:39.120\n distribute it around the people, that makes a lot of sense.\n\n1:57:39.120 --> 1:57:44.940\n In a contemporary context, where food is much cheaper, where shelter to some extent is more\n\n1:57:44.940 --> 1:57:53.180\n available, when medical care, we're so oblivious to how bad things were that we see things\n\n1:57:53.180 --> 1:57:56.140\n are bad now, so we assume that they were better than in some contexts.\n\n1:57:56.140 --> 1:57:58.580\n They were much, much worse there in many contexts.\n\n1:57:58.580 --> 1:58:03.260\n So if you're going to make an argument for government, for me, the strongest argument\n\n1:58:03.260 --> 1:58:08.900\n is like food stamps or like free lunches for children, because I agree that would be very\n\n1:58:08.900 --> 1:58:13.940\n inefficient and it's going to probably make them obese because you're going to have Nabisco\n\n1:58:13.940 --> 1:58:18.420\n lobbying to make sure that if you're going to have this protein, you're not going to\n\n1:58:18.420 --> 1:58:19.780\n give the kids an Oreo, aren't you?\n\n1:58:19.780 --> 1:58:24.220\n These kids are poor, you want them to have some pleasure and that's going to have deleterious\n\n1:58:24.220 --> 1:58:25.220\n effects.\n\n1:58:25.220 --> 1:58:29.780\n But if the choice is an inefficient government program and mass starvation, that is one where\n\n1:58:29.780 --> 1:58:36.200\n as an anarchist, I could easily see making the argument for that one.\n\n1:58:36.200 --> 1:58:39.500\n Even though I think very clearly private charity would be more efficient and distribute it\n\n1:58:39.500 --> 1:58:40.500\n more effectively.\n\n1:58:40.500 --> 1:58:42.780\n But at that point, I don't really care about efficiency.\n\n1:58:42.780 --> 1:58:46.620\n If you're throwing out food to make sure these kids get fed, I don't care.\n\n1:58:46.620 --> 1:58:53.900\n So would engagement in military conflict be one of the biggest negative things about the\n\n1:58:53.900 --> 1:58:55.860\n state to you?\n\n1:58:55.860 --> 1:58:57.820\n Yeah, of course.\n\n1:58:57.820 --> 1:58:59.420\n War is the state at its worst.\n\n1:58:59.420 --> 1:59:05.140\n So if we take away war or make it defensive instead of aggressive, yeah.\n\n1:59:05.140 --> 1:59:09.400\n I mean, wouldn't that be a huge step forward if war instead of regarded, we're always,\n\n1:59:09.400 --> 1:59:11.100\n this is what drives me crazy.\n\n1:59:11.100 --> 1:59:15.020\n We're taught as kids in school that war is a last resort.\n\n1:59:15.020 --> 1:59:16.580\n And I agree with that.\n\n1:59:16.580 --> 1:59:21.700\n And yet when you look at the corporate press, war is always the first response.\n\n1:59:21.700 --> 1:59:26.580\n And these people do not talk about what war means.\n\n1:59:26.580 --> 1:59:31.860\n They'll show examples during the Bush years of soldiers coming home in caskets, which\n\n1:59:31.860 --> 1:59:34.680\n already is an unacceptable price in many cases for me.\n\n1:59:34.680 --> 1:59:39.020\n But they don't even pretend to care about the people overseas whose countries we've\n\n1:59:39.020 --> 1:59:41.660\n ransacked and lives we've ruined.\n\n1:59:41.660 --> 1:59:43.020\n And it's just like, well, what are you going to do?\n\n1:59:43.020 --> 1:59:44.640\n Not ransack those countries?\n\n1:59:44.640 --> 1:59:48.900\n So that war to me is the state at its worst.\n\n1:59:48.900 --> 1:59:55.140\n See, I think that there is value from small government that doesn't engage in wars.\n\n1:59:55.140 --> 2:00:01.620\n I do think that the kind of collectives that you imagine functioning well would look like\n\n2:00:01.620 --> 2:00:04.260\n the best version of government that I imagine.\n\n2:00:04.260 --> 2:00:08.620\n So I see them as the same.\n\n2:00:08.620 --> 2:00:10.940\n I think a lot of it is just terminology.\n\n2:00:10.940 --> 2:00:15.740\n I have no problem saying that I'm using the word anarchism incorrectly and to go for what\n\n2:00:15.740 --> 2:00:16.740\n you want.\n\n2:00:16.740 --> 2:00:19.500\n I have no problem with that or anything, really.\n\n2:00:19.500 --> 2:00:21.380\n Because like I said, life is beautiful.\n\n2:00:21.380 --> 2:00:29.380\n But nevertheless, you wrote the essay, why I'm not going to vote this time or ever.\n\n2:00:29.380 --> 2:00:33.980\n Why I won't vote this year or any other year or any year.\n\n2:00:33.980 --> 2:00:34.980\n And the basic idea.\n\n2:00:34.980 --> 2:00:37.500\n I hope you do a better job reading it than you just read that title.\n\n2:00:37.500 --> 2:00:42.220\n I guess you'll take as many takes as necessary.\n\n2:00:42.220 --> 2:00:45.340\n I'll read it in Russian and then pay somebody to translate it.\n\n2:00:45.340 --> 2:00:46.340\n This isn't even Russian at all.\n\n2:00:46.340 --> 2:00:47.340\n He's just making up words.\n\n2:00:47.340 --> 2:00:48.340\n Where'd you find this guy?\n\n2:00:48.340 --> 2:00:49.340\n You get what you pay for.\n\n2:00:49.340 --> 2:00:50.340\n Yeah, exactly.\n\n2:00:50.340 --> 2:00:51.340\n This is anarchy.\n\n2:00:51.340 --> 2:00:56.340\n This is what you wanted.\n\n2:00:56.340 --> 2:01:09.140\n Like your basic summary is, let me see, if pressed, the simplest explanation I have for\n\n2:01:09.140 --> 2:01:16.180\n refusing to vote is this, I don't vote for the same exact reasons that I don't take communion.\n\n2:01:16.180 --> 2:01:22.020\n No matter how admirable he is or how much I agree with him, the Pope isn't the steward\n\n2:01:22.020 --> 2:01:27.820\n over my soul, nor is any president the leader of my life.\n\n2:01:27.820 --> 2:01:32.420\n This does not make me ignorant or evil any more than not being a Christian makes me ignorant\n\n2:01:32.420 --> 2:01:33.560\n or evil.\n\n2:01:33.560 --> 2:01:38.780\n If I need representation, I will hire the most qualified person to do so.\n\n2:01:38.780 --> 2:01:44.300\n Isn't voting our current best developed way of hiring the most qualified person to represent\n\n2:01:44.300 --> 2:01:45.740\n you on some things?\n\n2:01:45.740 --> 2:01:50.900\n No, because if I have a lawyer and the lawyer screws up, I can fire him.\n\n2:01:50.900 --> 2:01:53.420\n If I vote for someone, I don't get who I want.\n\n2:01:53.420 --> 2:01:55.300\n I get for who my neighbors want.\n\n2:01:55.300 --> 2:01:57.700\n So that makes no sense.\n\n2:01:57.700 --> 2:02:00.740\n Representation means I want you to speak for me.\n\n2:02:00.740 --> 2:02:04.660\n Whereas voting is like, I kind of want you, but I'll take what I can get and I'm going\n\n2:02:04.660 --> 2:02:06.260\n to take what I could get regardless.\n\n2:02:06.260 --> 2:02:08.060\n So what's the point?\n\n2:02:08.060 --> 2:02:11.700\n In governments, again, that's what Bitcoin is.\n\n2:02:11.700 --> 2:02:15.540\n You want to be represented in deciding what to do, but once...\n\n2:02:15.540 --> 2:02:17.680\n Wait, Bitcoin isn't picking a person.\n\n2:02:17.680 --> 2:02:19.980\n They're not picking a president of Bitcoin.\n\n2:02:19.980 --> 2:02:20.980\n They're picking an idea.\n\n2:02:20.980 --> 2:02:21.980\n Yeah.\n\n2:02:21.980 --> 2:02:22.980\n It's more like a referendum.\n\n2:02:22.980 --> 2:02:29.740\n And to me, a referendum is much more coherent and defensible than it is voting for a representative\n\n2:02:29.740 --> 2:02:35.940\n because if I'm voting for Joe Biden, I'm saying this person speaks for me for abortion, taxation,\n\n2:02:35.940 --> 2:02:38.420\n environmental policy, immigration, war, right?\n\n2:02:38.420 --> 2:02:42.660\n The odds that unless you're a complete NPC, that this one person will speak for you for\n\n2:02:42.660 --> 2:02:47.340\n everything and will deliver what he promised and has the power to deliver what he promises\n\n2:02:47.340 --> 2:02:48.340\n is not true.\n\n2:02:48.340 --> 2:02:54.100\n Whereas if I have Brexit, if I say I want Britain to remain part of the European Union\n\n2:02:54.100 --> 2:02:57.900\n to say yes or no question, that makes a lot more sense to me.\n\n2:02:57.900 --> 2:03:02.300\n But even that is not pure democracy because going back to the idea of the circulation\n\n2:03:02.300 --> 2:03:06.780\n of elites, which James Burnham talked about, Pareto and Moscow and all them, you're still\n\n2:03:06.780 --> 2:03:11.380\n going to have someone telling you what you can and can't vote for and how these questions\n\n2:03:11.380 --> 2:03:12.380\n are framed.\n\n2:03:12.380 --> 2:03:17.920\n So in contradiction to what the left anarchist said, some element of hierarchy is always\n\n2:03:17.920 --> 2:03:21.700\n going to be inevitable.\n\n2:03:21.700 --> 2:03:27.980\n So listen, I agree with this aspect very much so that we should be voting for ideas and\n\n2:03:27.980 --> 2:03:33.740\n issues not voting for leaders, for leaders to represent us across the full spectrum of\n\n2:03:33.740 --> 2:03:34.740\n issues.\n\n2:03:34.740 --> 2:03:35.980\n It seems to make no sense.\n\n2:03:35.980 --> 2:03:36.980\n Okay, good.\n\n2:03:36.980 --> 2:03:38.340\n Yeah, this is great.\n\n2:03:38.340 --> 2:03:44.460\n But I do think there should be a leader, I do believe in voting for representatives to\n\n2:03:44.460 --> 2:03:48.500\n debate, to be communicators of ideas to us.\n\n2:03:48.500 --> 2:03:52.740\n But let me start to interrupt you, but you could have those two things.\n\n2:03:52.740 --> 2:03:56.900\n For example, wouldn't this be an improvement if they have that now, you have a referendum,\n\n2:03:56.900 --> 2:04:01.080\n you want tax rates to be 30 or 40, whatever percent, you have the guy leading the campaign\n\n2:04:01.080 --> 2:04:05.940\n for 50, fight for 50, then you have the lady leading the campaign for 40, fight for 40,\n\n2:04:05.940 --> 2:04:09.420\n they'll go out there, they can have debates, they can talk about the issue, but you're\n\n2:04:09.420 --> 2:04:12.340\n still not voting for one of them, you're voting for the issue.\n\n2:04:12.340 --> 2:04:16.220\n That makes much more sense to me than I'm going to vote for him and hope that he puts\n\n2:04:16.220 --> 2:04:18.980\n forward 50 and that depends on 99 other senators.\n\n2:04:18.980 --> 2:04:19.980\n Exactly.\n\n2:04:19.980 --> 2:04:23.740\n But also, I mean, I do like the idea of voting for certain people to debate certain ideas.\n\n2:04:23.740 --> 2:04:25.600\n Yes, I think that's a major improvement.\n\n2:04:25.600 --> 2:04:27.980\n But the final vote should be based on the idea.\n\n2:04:27.980 --> 2:04:29.340\n So okay, so we agree.\n\n2:04:29.340 --> 2:04:35.740\n That would be nice to have, plus no wars, and then you'll stop tweeting so aggressively.\n\n2:04:35.740 --> 2:04:39.180\n And to decriminalize things that don't hurt people.\n\n2:04:39.180 --> 2:04:40.180\n Drugs.\n\n2:04:40.180 --> 2:04:43.900\n Drugs especially, prostitution is a big one.\n\n2:04:43.900 --> 2:04:47.240\n And this is me talking, all cops are criminals.\n\n2:04:47.240 --> 2:04:52.580\n There's no one, or maybe other than abused children, who needs access to the police other\n\n2:04:52.580 --> 2:04:54.300\n than sex workers.\n\n2:04:54.300 --> 2:04:58.580\n They're the ones who are the most likely to really put themselves in danger situation,\n\n2:04:58.580 --> 2:05:02.340\n so they need to be able to call security, because that's why they have pimps.\n\n2:05:02.340 --> 2:05:06.980\n Because you're a woman dealing with some strange dudes who are a lot of the time going to have\n\n2:05:06.980 --> 2:05:11.660\n weird kinks, you want to be able to be sure, even if you don't approve of prostitution,\n\n2:05:11.660 --> 2:05:15.780\n think it's horrible, that she's not going to be raped and murdered and have no consequences.\n\n2:05:15.780 --> 2:05:19.620\n And if you're going to say, oh, well, she's a prostitute, she can't be raped.\n\n2:05:19.620 --> 2:05:23.120\n Just think for a second, if you're agreeing to sleep with somebody, and then he starts\n\n2:05:23.120 --> 2:05:26.400\n choking you and beating the crap out of you and saying it's now it's a dom situation,\n\n2:05:26.400 --> 2:05:29.020\n that is clearly beyond the pale of salt.\n\n2:05:29.020 --> 2:05:35.780\n And the same thing with drugs, heroin, cocaine, crack.\n\n2:05:35.780 --> 2:05:40.720\n The people that need help the most are the ones who are addicted to those drugs and putting\n\n2:05:40.720 --> 2:05:41.720\n punishment.\n\n2:05:41.720 --> 2:05:44.700\n Let's suppose you think drug dealers should be in jail, right?\n\n2:05:44.700 --> 2:05:51.300\n It is very hard for me to say that someone who sells cocaine should be treated or in\n\n2:05:51.300 --> 2:05:55.340\n the same building as someone who rapes children, or as a murderer.\n\n2:05:55.340 --> 2:05:58.780\n These are not similar types of evil, even if you believe that that drug dealer is an\n\n2:05:58.780 --> 2:05:59.780\n evil person.\n\n2:05:59.780 --> 2:06:00.780\n Yeah, I have.\n\n2:06:00.780 --> 2:06:06.100\n I mean, there's an essay in there called by Alexander Berkman, who was Emma Goldman's\n\n2:06:06.100 --> 2:06:09.120\n partner on prisons and crime.\n\n2:06:09.120 --> 2:06:13.220\n And this is leftism at its best, forgetting the person is forgotten.\n\n2:06:13.220 --> 2:06:17.180\n And the fact that we have the world's largest prison population, the fact that so many people\n\n2:06:17.180 --> 2:06:20.660\n are just like, oh, you commit a crime, just put them in jail, throw away the key.\n\n2:06:20.660 --> 2:06:24.260\n At the very least, if you want to be totally immoral about it, it's expensive.\n\n2:06:24.260 --> 2:06:28.240\n And second of all, the concept that all criminals should be locked in a room together in these\n\n2:06:28.240 --> 2:06:31.820\n kind of largely inhuman conditions, and that's going to help people.\n\n2:06:31.820 --> 2:06:33.980\n I don't think that that's the ideal mechanism.\n\n2:06:33.980 --> 2:06:40.220\n Yeah, I tend to believe, I usually don't speak so negatively about politicians, but I do think\n\n2:06:40.220 --> 2:06:46.660\n that politicians have done more evil in the war on drugs than did the people that are\n\n2:06:46.660 --> 2:06:49.020\n supposed to be the criminals in this picture.\n\n2:06:49.020 --> 2:06:52.860\n And I'll give you another example of how this is the anarchist critique of power.\n\n2:06:52.860 --> 2:06:56.420\n Hunter Biden, and I'm not making fun of him, I'm not taking shots at him.\n\n2:06:56.420 --> 2:07:01.260\n He had an article in the New Yorker, where he talks about when he was in LA, he was buying\n\n2:07:01.260 --> 2:07:05.660\n crack and there was a misunderstanding or like he left the crack pipe in the Hertz car\n\n2:07:05.660 --> 2:07:07.720\n and then blah, blah, blah, there's an issue.\n\n2:07:07.720 --> 2:07:11.100\n He's admitting to a felony in writing to a reporter.\n\n2:07:11.100 --> 2:07:13.980\n And I'm sure this was within the statute of limitations.\n\n2:07:13.980 --> 2:07:17.260\n There was no possibility he was going to have consequences.\n\n2:07:17.260 --> 2:07:22.380\n Kamala Harris, who was a cop, talked about when she was in college, she was smoking weed.\n\n2:07:22.380 --> 2:07:27.740\n And it's like, I don't begrudge you guys smoking your crack or smoking your weed, but for other\n\n2:07:27.740 --> 2:07:32.740\n people who are poor or maybe just had the short end of the stick, this is years of their\n\n2:07:32.740 --> 2:07:35.180\n life being destroyed.\n\n2:07:35.180 --> 2:07:37.880\n At the very least, even an arrest is a traumatic situation.\n\n2:07:37.880 --> 2:07:42.580\n If you have a weed or cocaine or crack, you're arrested, that's really going to screw up,\n\n2:07:42.580 --> 2:07:44.800\n it's going to do a number on you being locked up.\n\n2:07:44.800 --> 2:07:48.780\n So to have that double standard to me is completely unacceptable.\n\n2:07:48.780 --> 2:07:51.740\n And that has nothing to do with Republican or Democrat.\n\n2:07:51.740 --> 2:07:55.220\n George W. Bush was a coke head back in the day.\n\n2:07:55.220 --> 2:07:59.500\n He talks about overcoming his addiction, and I'm glad that he did, more power to him.\n\n2:07:59.500 --> 2:08:04.100\n But just to have this kind of, you know, it's just really kind of disturbing to me, and\n\n2:08:04.100 --> 2:08:07.980\n this is my anarchist brain, like how prevalent drug use is in college.\n\n2:08:07.980 --> 2:08:11.020\n I think there's a joke on South Park, like, there's a time and a place to try drugs, and\n\n2:08:11.020 --> 2:08:13.020\n that's called college where people experiment.\n\n2:08:13.020 --> 2:08:17.100\n But all those college kids, which are going to become next generation's elite, don't really\n\n2:08:17.100 --> 2:08:21.580\n have that worry that if they get caught, then anything's going to happen to them.\n\n2:08:21.580 --> 2:08:25.620\n But that kid in the street who did not have that good upbringing, even if he's a piece\n\n2:08:25.620 --> 2:08:30.780\n of crap, like he's not going to have a different punishment, I think that's just really at\n\n2:08:30.780 --> 2:08:33.320\n his base on American.\n\n2:08:33.320 --> 2:08:37.140\n So in contrast to Tolstoy, let me ask you about Emma Goldman.\n\n2:08:37.140 --> 2:08:44.260\n You wrote that if anarchism believed in rulers, then Emma Goldman would be the undisputed\n\n2:08:44.260 --> 2:08:45.260\n queen.\n\n2:08:45.260 --> 2:08:46.260\n Yes.\n\n2:08:46.260 --> 2:08:51.940\n What ideas defined her flavor of anarchism, would you say?\n\n2:08:51.940 --> 2:08:56.420\n Emma was really an old school radical.\n\n2:08:56.420 --> 2:08:58.800\n She was a radical among radicals.\n\n2:08:58.800 --> 2:09:04.020\n I don't know what ideas, I mean, what would define her was anarchism, obviously.\n\n2:09:04.020 --> 2:09:05.020\n There's the violence.\n\n2:09:05.020 --> 2:09:11.340\n I mean, she was more open to the idea of violent opposition versus somebody like Tolstoy.\n\n2:09:11.340 --> 2:09:12.620\n Oh, sure, for sure.\n\n2:09:12.620 --> 2:09:17.340\n So basically, Emma and Alexander Berkman, their mentor was someone named Johann Most.\n\n2:09:17.340 --> 2:09:22.540\n And Johann Most was a very early free speech, not very early, but he was a free speech concern\n\n2:09:22.540 --> 2:09:26.900\n because he published a pamphlet in Europe that was translated in the States about how\n\n2:09:26.900 --> 2:09:28.540\n to build dynamite.\n\n2:09:28.540 --> 2:09:32.100\n Because his idea was, all right, you have this oppressive government, this oppressive\n\n2:09:32.100 --> 2:09:36.380\n police force that use batons and bolts against us.\n\n2:09:36.380 --> 2:09:40.860\n The only way for us as the working class to level the playing field is through dynamite\n\n2:09:40.860 --> 2:09:42.440\n and here's how you build it.\n\n2:09:42.440 --> 2:09:46.500\n So the question is, all right, is this something that could be allowed to be legal now that\n\n2:09:46.500 --> 2:09:50.360\n you're allowing the layman to, in his own house, build bombs?\n\n2:09:50.360 --> 2:09:56.560\n So Johann Most, basically, they had a big parting of ways because when Alexander Berkman\n\n2:09:56.560 --> 2:10:02.880\n tried to assassinate Frick, Johann said, no, no, no, this is not something I'm for.\n\n2:10:02.880 --> 2:10:07.540\n And in fact, they thought with this assassination, this failed assassination, this would be the\n\n2:10:07.540 --> 2:10:11.540\n thing that's fired off the revolution because you had the strike, the Pinkertons involved,\n\n2:10:11.540 --> 2:10:14.420\n Pinkertons getting killed, strikers are getting killed.\n\n2:10:14.420 --> 2:10:18.060\n This is what Marx predicted, they're gonna light the spark and everything's gonna come\n\n2:10:18.060 --> 2:10:19.060\n falling down.\n\n2:10:19.060 --> 2:10:23.060\n He ends up going to jail for 13 years instead, Alexander Berkman does.\n\n2:10:23.060 --> 2:10:28.780\n And then Goldman and Berkman had a big issue because when Leon Salgas killed McKinley\n\n2:10:28.780 --> 2:10:32.640\n in 1901, it was really, it's kind of humorous in retrospect.\n\n2:10:32.640 --> 2:10:34.740\n He gets arrested and they're like, why'd you kill the president?\n\n2:10:34.740 --> 2:10:39.300\n He goes, I was radicalized by Emma Goldman and she's like, oh, damn it, she's on the\n\n2:10:39.300 --> 2:10:40.300\n run.\n\n2:10:40.300 --> 2:10:42.580\n I don't even know this guy.\n\n2:10:42.580 --> 2:10:47.140\n And she made the point about like, why is it worse than the president being killed and\n\n2:10:47.140 --> 2:10:48.140\n somebody else?\n\n2:10:48.140 --> 2:10:49.260\n We're all equal.\n\n2:10:49.260 --> 2:10:53.000\n And you would think if you're against capitalism, against the ruling class, this would be your\n\n2:10:53.000 --> 2:10:54.120\n first target.\n\n2:10:54.120 --> 2:11:01.320\n But Berkman, who went to jail, who tried to assassinate someone, he had said, McKinley,\n\n2:11:01.320 --> 2:11:02.320\n this is your villain?\n\n2:11:02.320 --> 2:11:03.540\n He's just a party hack.\n\n2:11:03.540 --> 2:11:06.800\n He's like a symptom of the times, this is foolish.\n\n2:11:06.800 --> 2:11:08.220\n And Goldman disagreed with him.\n\n2:11:08.220 --> 2:11:14.800\n He thought it wasn't necessarily justified, but it may have done something that was defensible.\n\n2:11:14.800 --> 2:11:19.280\n So the three of them, you know, had their differences on the use of violence.\n\n2:11:19.280 --> 2:11:24.060\n And in fact, when she came back from Russia and was denouncing it in her book, My Disillusionment\n\n2:11:24.060 --> 2:11:28.300\n in Russia, My First Disillusionment in Russia, the last chapter she goes, look, I'm not saying\n\n2:11:28.300 --> 2:11:29.960\n I'm against violence.\n\n2:11:29.960 --> 2:11:32.220\n When there's the revolution comes, we're going to have to use force.\n\n2:11:32.220 --> 2:11:37.140\n She goes, but it's not the force of the state against the working class, against the masses.\n\n2:11:37.140 --> 2:11:38.640\n This is exactly what we're opposed to.\n\n2:11:38.640 --> 2:11:41.840\n This is a complete obscenity to our principles.\n\n2:11:41.840 --> 2:11:43.320\n So that was interesting.\n\n2:11:43.320 --> 2:11:49.920\n The fact that she was a, her periodical Mother Earth was a clearinghouse for many prominent,\n\n2:11:49.920 --> 2:11:52.940\n you know, ideas of the day that weren't anarchist, but were certainly radical.\n\n2:11:52.940 --> 2:11:55.880\n So she was a bit, and also she was like tiny, she was like 5.1.\n\n2:11:55.880 --> 2:11:59.920\n So to have this little woman who was so feisty and...\n\n2:11:59.920 --> 2:12:01.040\n Talk back to Lenin.\n\n2:12:01.040 --> 2:12:02.040\n Talk back to Lenin.\n\n2:12:02.040 --> 2:12:07.420\n She took on Lenin, Woodrow Wilson, J. Edgar Hoover was the one who deported her.\n\n2:12:07.420 --> 2:12:08.420\n Someone who just...\n\n2:12:08.420 --> 2:12:14.760\n And the thing is, you have to be careful because I think just like war, it's very easy to glamorize\n\n2:12:14.760 --> 2:12:20.560\n violence and to regard it as something admirable or heroic, like you're fighting for the cause.\n\n2:12:20.560 --> 2:12:24.600\n But if you take it out of the romanticism, you're like, you're killing someone who had\n\n2:12:24.600 --> 2:12:25.600\n kids.\n\n2:12:25.600 --> 2:12:27.280\n You are, you know, killing someone with a family.\n\n2:12:27.280 --> 2:12:30.840\n You're making your, if you're going to shoot someone, they're probably going to retaliate\n\n2:12:30.840 --> 2:12:32.340\n twice as hard.\n\n2:12:32.340 --> 2:12:35.680\n Violence sings its own song and this is a very dangerous road you're going down.\n\n2:12:35.680 --> 2:12:41.440\n So you really need to be careful about what you're preaching here.\n\n2:12:41.440 --> 2:12:46.440\n And you know, she kind of had this mixed feelings about it, but that is certainly not Emma Goldman\n\n2:12:46.440 --> 2:12:47.600\n her best.\n\n2:12:47.600 --> 2:12:54.080\n Emma Goldman her best was about the ultimate freedom of the individual, of caring about\n\n2:12:54.080 --> 2:12:59.120\n people who are desperately poor, who despised the corporate idea that we all had to be made\n\n2:12:59.120 --> 2:13:04.120\n into cookie cutters and be interchangeable and all have to start work at the same time.\n\n2:13:04.120 --> 2:13:08.260\n And basically our entire lives slave for corporation that have nothing to show for it while they\n\n2:13:08.260 --> 2:13:13.400\n get wealthy and you have no opportunity for either productive work or creative work.\n\n2:13:13.400 --> 2:13:19.320\n So that I think the valorization of kind of the lowest of the low is something I find\n\n2:13:19.320 --> 2:13:20.360\n very admirable.\n\n2:13:20.360 --> 2:13:24.600\n There's a quote of hers, which I think even for those of us who are, you know, for property\n\n2:13:24.600 --> 2:13:30.760\n rights is left anarchism at its best, but she goes, go and ask for work.\n\n2:13:30.760 --> 2:13:33.400\n If they don't give you work, ask for bread.\n\n2:13:33.400 --> 2:13:35.280\n If they don't give you bread, take bread.\n\n2:13:35.280 --> 2:13:38.800\n So the idea that like, if you're that poor and you're honestly trying to work and work\n\n2:13:38.800 --> 2:13:43.680\n isn't available and you steal food to keep alive, that you shouldn't feel guilt about\n\n2:13:43.680 --> 2:13:44.680\n it.\n\n2:13:44.680 --> 2:13:46.080\n I don't know that I would disagree with that.\n\n2:13:46.080 --> 2:13:50.580\n I think that there's something to be said at that point where it's just like, you know,\n\n2:13:50.580 --> 2:13:54.680\n if property rights come between that and mass starvation, it's going to be very hard for\n\n2:13:54.680 --> 2:13:56.280\n anyone to make the case for property rights.\n\n2:13:56.280 --> 2:14:00.880\n Now, my argument is when you have free enterprise, food becomes so plentiful that now obesity\n\n2:14:00.880 --> 2:14:01.920\n is an issue.\n\n2:14:01.920 --> 2:14:06.360\n But at the time she did not have, of course, have that data to access.\n\n2:14:06.360 --> 2:14:12.480\n Is there somebody you left out from the book that you thought about leaving in like some\n\n2:14:12.480 --> 2:14:14.120\n interesting figures?\n\n2:14:14.120 --> 2:14:15.960\n Yeah, there's a couple.\n\n2:14:15.960 --> 2:14:22.760\n So Chomsky would have been one, of course, because he's probably one of the biggest anarchist\n\n2:14:22.760 --> 2:14:26.040\n thinkers in contemporary times.\n\n2:14:26.040 --> 2:14:30.080\n I was on the fence about Herbert Spencer because he's not an anarchist.\n\n2:14:30.080 --> 2:14:32.120\n Chris Williamson's reading the chapter for the book.\n\n2:14:32.120 --> 2:14:35.320\n He coined the term Survival of the Fittest and the chapter is called The Right to Ignore\n\n2:14:35.320 --> 2:14:37.680\n the State from his book, Social Statics.\n\n2:14:37.680 --> 2:14:42.400\n It was deleted from later editions, but people found it and reprinted it.\n\n2:14:42.400 --> 2:14:47.320\n And Randolph Bourne, he was an early progressive.\n\n2:14:47.320 --> 2:14:51.720\n He was the only one or one of the very few fighting against entering the Great War.\n\n2:14:51.720 --> 2:14:55.700\n And he had an essay called War is the Health of the State, which is basically about how\n\n2:14:55.700 --> 2:14:59.640\n states love war because it gives them an excuse to increase their power.\n\n2:14:59.640 --> 2:15:03.220\n And it's very hard to argue against increasing state power in a time of war.\n\n2:15:03.220 --> 2:15:07.280\n But since he was not himself an anarchist and there was plenty antiwar in there already,\n\n2:15:07.280 --> 2:15:09.280\n I didn't include him, but those would be the ones.\n\n2:15:09.280 --> 2:15:16.520\n Is there some people that you think the public would be surprised to learn that they are\n\n2:15:16.520 --> 2:15:17.760\n at least in part anarchists?\n\n2:15:17.760 --> 2:15:20.840\n Like I saw that Howard Zinn is supposedly an anarchist.\n\n2:15:20.840 --> 2:15:25.480\n I mean, is there, like, just like Tolstoy is an anarchist.\n\n2:15:25.480 --> 2:15:29.680\n Is there some people like that that you think in our modern life that would be surprised\n\n2:15:29.680 --> 2:15:31.100\n to learn they're anarchists?\n\n2:15:31.100 --> 2:15:34.200\n I can't think of any off the top of my head.\n\n2:15:34.200 --> 2:15:38.520\n I mean, you could say Carl Hess, who was like Barry Goldwater's speechwriter from the 1964\n\n2:15:38.520 --> 2:15:41.200\n campaign, but he's hardly a household name.\n\n2:15:41.200 --> 2:15:48.160\n I mean, I think a lot of people would not ascribe to that term, but are certainly informed\n\n2:15:48.160 --> 2:15:51.480\n with this complete distrust of all authority.\n\n2:15:51.480 --> 2:15:54.740\n Murray Rothbard had an essay, if I didn't include anatomy of the state, I was going\n\n2:15:54.740 --> 2:15:55.740\n to include this one.\n\n2:15:55.740 --> 2:15:57.280\n It's much, much shorter.\n\n2:15:57.280 --> 2:16:00.680\n And his question was, who are our allies and who are our enemies?\n\n2:16:00.680 --> 2:16:04.880\n And the point he made is there's lots of people who would call themselves anarchists who are\n\n2:16:04.880 --> 2:16:10.200\n of little use, whereas someone who is still like a minarchist or for government, but genuinely\n\n2:16:10.200 --> 2:16:14.920\n hates the question Rothbard had is if there's a button and you could press that you would\n\n2:16:14.920 --> 2:16:18.340\n end the state, would you press it so fast your finger would get a blister?\n\n2:16:18.340 --> 2:16:22.100\n Those are allies, even if they're, you know, somewhat of a minarchist.\n\n2:16:22.100 --> 2:16:26.100\n So I think that is kind of a better lens of looking at it.\n\n2:16:26.100 --> 2:16:31.600\n And I don't think anyone needs to really ascribe to anarchism as a whole ideology in so far\n\n2:16:31.600 --> 2:16:36.720\n as you're seeing right now, many people in certain fringe elements are just essentially\n\n2:16:36.720 --> 2:16:42.680\n or are decreasingly fringe and increasing mainstream elements are realizing that this\n\n2:16:42.680 --> 2:16:47.400\n idea that whatever the state does is somehow morally binding or legitimate is something\n\n2:16:47.400 --> 2:16:50.080\n that at least bears strong questioning.\n\n2:16:50.080 --> 2:16:51.080\n Sure.\n\n2:16:51.080 --> 2:16:57.680\n And I mean, I guess there's a lot of groups like the libertarians, for example, have some\n\n2:16:57.680 --> 2:16:58.680\n element of that.\n\n2:16:58.680 --> 2:16:59.680\n Oh, sure.\n\n2:16:59.680 --> 2:17:00.680\n For sure.\n\n2:17:00.680 --> 2:17:02.780\n I mean, I think that's the beginning of the ways of government.\n\n2:17:02.780 --> 2:17:07.820\n And also, I think what I love, I mean, if there's one issue where I would want people\n\n2:17:07.820 --> 2:17:10.560\n to have this kind of analysis, it is war.\n\n2:17:10.560 --> 2:17:13.780\n And it is like, okay, are you really sure?\n\n2:17:13.780 --> 2:17:18.340\n Because this is 100% going to result in a lot of people being killed, a lot of people\n\n2:17:18.340 --> 2:17:23.320\n being traumatized, a lot of people who are never going to recover, children, innocent\n\n2:17:23.320 --> 2:17:24.320\n people.\n\n2:17:24.320 --> 2:17:26.780\n Are you really sure this is the right thing to do?\n\n2:17:26.780 --> 2:17:30.880\n And I think a lot of times if the answer is, well, it's the profitable thing to do.\n\n2:17:30.880 --> 2:17:37.420\n And that is, I think, again, government at its absolute most venal and worst.\n\n2:17:37.420 --> 2:17:40.960\n You Michael Malice in many ways are a New Yorker.\n\n2:17:40.960 --> 2:17:41.960\n Oh, yes.\n\n2:17:41.960 --> 2:17:43.480\n I'll give you one example.\n\n2:17:43.480 --> 2:17:45.200\n I don't know where Austin is on the map.\n\n2:17:45.200 --> 2:17:46.200\n No idea.\n\n2:17:46.200 --> 2:17:47.200\n Not even kidding.\n\n2:17:47.200 --> 2:17:48.200\n But does it even matter?\n\n2:17:48.200 --> 2:17:50.120\n It doesn't matter.\n\n2:17:50.120 --> 2:17:53.080\n But nevertheless, you've decided to move to Austin.\n\n2:17:53.080 --> 2:17:54.080\n Yes.\n\n2:17:54.080 --> 2:17:59.620\n Why do you think you're moving to Austin, or why do you moving both to Austin and away\n\n2:17:59.620 --> 2:18:00.720\n from New York?\n\n2:18:00.720 --> 2:18:05.640\n This was one of the both, I hate it when people talk like this, but I'm gonna do it anyway.\n\n2:18:05.640 --> 2:18:08.920\n This was one of the hardest and easiest decisions of my life.\n\n2:18:08.920 --> 2:18:13.440\n It was hard because I've lived in New York since I was two, other than college.\n\n2:18:13.440 --> 2:18:14.700\n It's the only home I've known.\n\n2:18:14.700 --> 2:18:16.160\n I know it intimately.\n\n2:18:16.160 --> 2:18:17.520\n I know all the cool spots.\n\n2:18:17.520 --> 2:18:20.920\n I love it with every fiber of my being or I did.\n\n2:18:20.920 --> 2:18:25.360\n It was very much, you know, ingrained in my personality, my outlook about what cities\n\n2:18:25.360 --> 2:18:29.760\n can be and can't be and should be and shouldn't be.\n\n2:18:29.760 --> 2:18:31.560\n Deciding to move was not done.\n\n2:18:31.560 --> 2:18:39.340\n But when you see your crew, your chosen family, one by one whittling away, it's not easy.\n\n2:18:39.340 --> 2:18:40.340\n They all left.\n\n2:18:40.340 --> 2:18:43.440\n There's just a couple of us left in New York.\n\n2:18:43.440 --> 2:18:47.400\n And I don't see any mechanism by which New York is going to improve.\n\n2:18:47.400 --> 2:18:49.440\n Things are getting much worse all the time.\n\n2:18:49.440 --> 2:18:51.800\n It's just completely outrageous.\n\n2:18:51.800 --> 2:18:54.500\n Here I would have a huge crew.\n\n2:18:54.500 --> 2:18:57.480\n I didn't realize how much cheaper real estate is than in New York.\n\n2:18:57.480 --> 2:18:58.480\n This is another way.\n\n2:18:58.480 --> 2:19:01.520\n So New Yorkers are the most provincial people on earth who are completely oblivious to the\n\n2:19:01.520 --> 2:19:02.680\n rest of the country.\n\n2:19:02.680 --> 2:19:06.720\n So for a long time, the argument was New York versus LA, right, for certain types of people.\n\n2:19:06.720 --> 2:19:08.920\n And they would say LA is cheaper in terms of rent.\n\n2:19:08.920 --> 2:19:12.320\n So in New York, let's suppose the rent is a thousand, LA was 700, but you have to get\n\n2:19:12.320 --> 2:19:13.320\n a car.\n\n2:19:13.320 --> 2:19:14.520\n I'm like, this is kind of a wash.\n\n2:19:14.520 --> 2:19:18.440\n So I assumed Austin would be like 80% of New York prices.\n\n2:19:18.440 --> 2:19:23.360\n And I'm looking at these houses and for like 700,000, you could get a house here that would\n\n2:19:23.360 --> 2:19:26.200\n cost like 3.5 million in New York.\n\n2:19:26.200 --> 2:19:27.240\n And you could have a gun.\n\n2:19:27.240 --> 2:19:30.840\n And it's just like, I could have a yard and I could have a dog and I could have a three\n\n2:19:30.840 --> 2:19:35.680\n bedroom and I could have, you know, aquariums and my weird plants.\n\n2:19:35.680 --> 2:19:44.160\n So to have all that, and it's just to have, I am very, very lucky that I have such a supportive\n\n2:19:44.160 --> 2:19:45.160\n crew.\n\n2:19:45.160 --> 2:19:49.520\n And they were also very smart because they sat me down and they said, whatever excuse\n\n2:19:49.520 --> 2:19:53.880\n you have not to move here, we are going to make sure that doesn't count.\n\n2:19:53.880 --> 2:19:59.400\n So my buddy Matt said, because I have a huge library, he goes, I will go to your house\n\n2:19:59.400 --> 2:20:04.160\n and I will pack every single book you own myself so you can get that as an excuse the\n\n2:20:04.160 --> 2:20:05.160\n other way.\n\n2:20:05.160 --> 2:20:09.360\n I don't know how to drive and you do this, she's like, we're going to take driving lessons\n\n2:20:09.360 --> 2:20:10.360\n together.\n\n2:20:10.360 --> 2:20:12.320\n There goes that excuse.\n\n2:20:12.320 --> 2:20:13.800\n How do I find an apartment?\n\n2:20:13.800 --> 2:20:17.520\n They're like, we'll go to with the realtor and we'll take pictures for you.\n\n2:20:17.520 --> 2:20:18.520\n We'll report back.\n\n2:20:18.520 --> 2:20:19.520\n You can trust our judgment.\n\n2:20:19.520 --> 2:20:20.520\n And I'm like, that's great.\n\n2:20:20.520 --> 2:20:21.520\n I would do that.\n\n2:20:21.520 --> 2:20:23.800\n That sounds like fun shopping for houses that have to buy them.\n\n2:20:23.800 --> 2:20:29.640\n Then Matt just yesterday had the idea goes, come here, rent a furnished apartment for\n\n2:20:29.640 --> 2:20:30.640\n a few months.\n\n2:20:30.640 --> 2:20:32.480\n You don't have the pressure of buying.\n\n2:20:32.480 --> 2:20:34.480\n And it's just, it's going to be an easy transition.\n\n2:20:34.480 --> 2:20:36.640\n The rent's not going to be anything compared to New York.\n\n2:20:36.640 --> 2:20:39.560\n I'm like, these are all very valid things.\n\n2:20:39.560 --> 2:20:40.820\n You're here.\n\n2:20:40.820 --> 2:20:41.820\n Lots of other people.\n\n2:20:41.820 --> 2:20:43.920\n Yeah, that's what this is.\n\n2:20:43.920 --> 2:20:47.000\n I made sure that's renting month to month.\n\n2:20:47.000 --> 2:20:48.000\n Oh, this is rental.\n\n2:20:48.000 --> 2:20:49.000\n This is rental.\n\n2:20:49.000 --> 2:20:50.000\n Oh, you didn't realize this.\n\n2:20:50.000 --> 2:20:51.000\n I thought you bought this.\n\n2:20:51.000 --> 2:20:52.000\n No, no, no.\n\n2:20:52.000 --> 2:20:53.000\n This is rental.\n\n2:20:53.000 --> 2:20:54.000\n We can talk.\n\n2:20:54.000 --> 2:20:55.000\n Why?\n\n2:20:55.000 --> 2:20:56.000\n I thought you bought it.\n\n2:20:56.000 --> 2:20:57.000\n No, it's rental.\n\n2:20:57.000 --> 2:20:58.000\n Well, I really value freedom.\n\n2:20:58.000 --> 2:20:59.000\n Yeah, of course.\n\n2:20:59.000 --> 2:21:00.000\n Who are you talking to?\n\n2:21:00.000 --> 2:21:05.440\n I've heard of this thing, freedom, it's really great.\n\n2:21:05.440 --> 2:21:08.960\n But not everybody in the implementation of freedom is different for everybody.\n\n2:21:08.960 --> 2:21:09.960\n Of course.\n\n2:21:09.960 --> 2:21:14.280\n I don't want to make a statement about others.\n\n2:21:14.280 --> 2:21:15.640\n I'll just speak for myself.\n\n2:21:15.640 --> 2:21:22.880\n I think when you buy a house, that is not just a wise financial decision or all those\n\n2:21:22.880 --> 2:21:26.340\n kinds of reasons that people have, investment, all those kinds of things.\n\n2:21:26.340 --> 2:21:32.000\n I think it's also a hit on your freedom because the positive way to frame that is you make\n\n2:21:32.000 --> 2:21:33.000\n it a home.\n\n2:21:33.000 --> 2:21:34.000\n Yes.\n\n2:21:34.000 --> 2:21:35.340\n You have a deep connection to it.\n\n2:21:35.340 --> 2:21:39.360\n But the negative way to frame it is you're now a little bit stuck there.\n\n2:21:39.360 --> 2:21:40.360\n Yeah.\n\n2:21:40.360 --> 2:21:44.760\n And you may stay there way longer than you should when much better opportunities for\n\n2:21:44.760 --> 2:21:46.960\n life come up.\n\n2:21:46.960 --> 2:21:50.080\n There's stages in life when you're not sure exactly what the future will hold.\n\n2:21:50.080 --> 2:21:54.640\n I would argue that's very often the case, basically at every stage in life.\n\n2:21:54.640 --> 2:22:03.120\n I just want to make sure I maximize the freedom to embrace the most ambitious, the craziest,\n\n2:22:03.120 --> 2:22:07.360\n the wildest, the most beautiful opportunities that come by.\n\n2:22:07.360 --> 2:22:10.640\n You've actually brought this up too, because I said I really enjoyed the conversation with\n\n2:22:10.640 --> 2:22:19.360\n you and Yaron, talking to you and somebody else, and I think you make a really significant\n\n2:22:19.360 --> 2:22:20.360\n effort.\n\n2:22:20.360 --> 2:22:26.040\n You've said this before, but it really is true and it stands in contrast to other folks\n\n2:22:26.040 --> 2:22:27.360\n who are also good conversation.\n\n2:22:27.360 --> 2:22:32.000\n You really make an effort for that person to meet the person.\n\n2:22:32.000 --> 2:22:34.920\n Oh, for sure.\n\n2:22:34.920 --> 2:22:45.280\n You made me realize it's kind of an art form, but it's also just, it's a thing worth doing\n\n2:22:45.280 --> 2:22:51.000\n of putting in that effort and that leap of humanity to reach the, whether you're talking\n\n2:22:51.000 --> 2:22:58.720\n to Dave Rubin or Alex Jones or Joe or me, just those are different human beings and\n\n2:22:58.720 --> 2:22:59.720\n they're taking that leap.\n\n2:22:59.720 --> 2:23:00.720\n It's fascinating.\n\n2:23:00.720 --> 2:23:04.120\n I mean, do you have, how do you think about that?\n\n2:23:04.120 --> 2:23:08.840\n I'm a huge introvert as you are, I think.\n\n2:23:08.840 --> 2:23:18.040\n I feel very, very, very lucky that I get to get on a mic and run my mouth and for some\n\n2:23:18.040 --> 2:23:20.080\n people, for some reason, people like this.\n\n2:23:20.080 --> 2:23:27.960\n So I know what it's like to have a good convo and I know what it's like to have a bad convo.\n\n2:23:27.960 --> 2:23:33.600\n So before I'll do a show, I will have like some things I would want to talk about.\n\n2:23:33.600 --> 2:23:36.440\n And then I'll think about how to say them in an engaging way.\n\n2:23:36.440 --> 2:23:38.200\n So I do my homework in that regard.\n\n2:23:38.200 --> 2:23:45.320\n I'm also very good at, or I pride myself at taking people who are cerebral or intellectual\n\n2:23:45.320 --> 2:23:49.760\n and making them a little bit silly, but also making them feel safe to be silly because\n\n2:23:49.760 --> 2:23:55.120\n I'm not going to be making a buffoon of them that we're having fun as opposed to disrespecting\n\n2:23:55.120 --> 2:23:56.120\n the person.\n\n2:23:56.120 --> 2:24:00.040\n I think we all saw that with Yaron, who's very cerebral, very serious, but we were all\n\n2:24:00.040 --> 2:24:05.480\n cracking jokes and he was having a good time and he knew even if I'm making fun of him\n\n2:24:05.480 --> 2:24:09.800\n to his face, it is coming from a place of kindness and he's in on the joke and we're\n\n2:24:09.800 --> 2:24:11.280\n all having fun.\n\n2:24:11.280 --> 2:24:15.960\n That is something I try to do as much as possible.\n\n2:24:15.960 --> 2:24:20.680\n I had an episode of my show a couple of weeks ago and someone who's been a friend of mine\n\n2:24:20.680 --> 2:24:25.080\n for a long time and someone I admire a lot, Elizabeth Spires, she was the founding member\n\n2:24:25.080 --> 2:24:31.320\n of, founding editor of Gawker, she's worked for the Observer for Jared Kushner, her resume\n\n2:24:31.320 --> 2:24:37.280\n second to none and she was on my show and she was talking, her politics are pretty straightforward\n\n2:24:37.280 --> 2:24:41.920\n like corporate journalist, blue pilled politics and my audience was very upset that I wasn't\n\n2:24:41.920 --> 2:24:43.320\n pushing back or whatever.\n\n2:24:43.320 --> 2:24:48.520\n I'm like, my job, if someone is coming to a place where the audience is at least going\n\n2:24:48.520 --> 2:24:54.740\n to be somewhat hostile, is not to make her have negative consequences for doing something\n\n2:24:54.740 --> 2:24:56.140\n that she didn't need to do.\n\n2:24:56.140 --> 2:25:02.080\n My job is to make sure that the experience is a positive one for her as the host.\n\n2:25:02.080 --> 2:25:07.500\n So when I'm the guest, I always feel that my job is to make the host look good and make\n\n2:25:07.500 --> 2:25:11.500\n the host not feel like it's work and the audience really likes that because instead of it being\n\n2:25:11.500 --> 2:25:16.640\n an interview or intense, it is a conversation, nine of us know what's going to happen and\n\n2:25:16.640 --> 2:25:21.640\n so this is something I think about a fair amount and I try to apply and insofar as it's\n\n2:25:21.640 --> 2:25:26.240\n successful, I'm delighted and there's times when it's not successful and that's a shame\n\n2:25:26.240 --> 2:25:28.760\n but all we could do is do our best.\n\n2:25:28.760 --> 2:25:30.600\n Yeah, I really enjoyed that conversation with her.\n\n2:25:30.600 --> 2:25:34.320\n I was surprised by the dislikes and all that kind of stuff.\n\n2:25:34.320 --> 2:25:38.800\n Well, one of the things I always talk about is I don't care what my friends politics are.\n\n2:25:38.800 --> 2:25:43.120\n I care about if I'm having a bad day, can I call them up and ask for advice and Elizabeth\n\n2:25:43.120 --> 2:25:47.680\n has been there for me in the past and then when I do it on a camera in front of mics,\n\n2:25:47.680 --> 2:25:48.680\n people freaking out.\n\n2:25:48.680 --> 2:25:51.160\n I'm like, I'm practicing what I preach.\n\n2:25:51.160 --> 2:25:57.240\n My, the relationships are more important than someone's political views and it's not hypocrisy\n\n2:25:57.240 --> 2:26:01.260\n at all to demonstrate that and not to push back.\n\n2:26:01.260 --> 2:26:02.600\n And there was great humor there.\n\n2:26:02.600 --> 2:26:07.600\n You're both a bit of trolls in very different ways but nevertheless, that connection, the\n\n2:26:07.600 --> 2:26:14.400\n humor and the mutual respect and love that was all there, yeah, it's just fascinating.\n\n2:26:14.400 --> 2:26:16.520\n You've talked to Alex Jones a couple days ago.\n\n2:26:16.520 --> 2:26:17.520\n Sure, yeah.\n\n2:26:17.520 --> 2:26:21.200\n I haven't seen him many times before but you've had him on your podcast.\n\n2:26:21.200 --> 2:26:22.200\n This week, yeah.\n\n2:26:22.200 --> 2:26:23.200\n This week.\n\n2:26:23.200 --> 2:26:31.880\n I was kind of surprised that he mentioned that human animal hybrids was like the number,\n\n2:26:31.880 --> 2:26:38.840\n the main conspiracy that people should look into to open their eyes to the, you know,\n\n2:26:38.840 --> 2:26:42.560\n to all this, to the globalists, to all the conspiracies that are out there.\n\n2:26:42.560 --> 2:26:44.520\n Was that surprising to you?\n\n2:26:44.520 --> 2:26:51.320\n No, because I came in there with questions and I was very focused on corralling him and\n\n2:26:51.320 --> 2:26:54.120\n having it be like kind of a coherent intellectual conversation.\n\n2:26:54.120 --> 2:26:58.120\n That was a really, really good, it was only an hour but it was a very good conversation.\n\n2:26:58.120 --> 2:26:59.120\n Yeah, thank you.\n\n2:26:59.120 --> 2:27:04.280\n I, the response was overwhelmingly positive and I'm like, all right, I'm in a unique position\n\n2:27:04.280 --> 2:27:08.800\n because Alex, I met Alex, well, that's not true, but I was on Alex, with Alex on Tim\n\n2:27:08.800 --> 2:27:10.320\n Pool a couple of times.\n\n2:27:10.320 --> 2:27:14.160\n It was mayhem, it was anarchy and I'm like, all right, let me get.\n\n2:27:14.160 --> 2:27:18.040\n But the thing is what people enjoyed is I was the one who was basically able to translate\n\n2:27:18.040 --> 2:27:19.040\n Alex's ease.\n\n2:27:19.040 --> 2:27:23.360\n He's obviously very performative and a lot of times Alex will say things that are not\n\n2:27:23.360 --> 2:27:29.200\n really particularly controversial, but he'll say them in such a way that it sounds crazier\n\n2:27:29.200 --> 2:27:30.200\n than it is.\n\n2:27:30.200 --> 2:27:32.440\n You know, I think Joe's made this observation as well.\n\n2:27:32.440 --> 2:27:38.720\n So what I wanted to have him on my show is, all right, let's go through all these conspiracies\n\n2:27:38.720 --> 2:27:40.800\n which have validity, which don't.\n\n2:27:40.800 --> 2:27:43.920\n And I knew if I asked him, because he's got a lot of historical knowledge, even if you\n\n2:27:43.920 --> 2:27:49.040\n think of a lot of it's nonsensical, let's sort out the wheat from the chaff, you know,\n\n2:27:49.040 --> 2:27:50.680\n because everyone has someone crazy in them.\n\n2:27:50.680 --> 2:27:54.960\n I have this expression, you take one red pill, not the whole bottle, you take the whole bottle\n\n2:27:54.960 --> 2:27:59.120\n of red pills, you assume literally everything in the media is a lie, that's just not a coherent\n\n2:27:59.120 --> 2:28:00.120\n position to have.\n\n2:28:00.120 --> 2:28:03.060\n Is the weather a lie when they tell you that temperature is going to be wrong tomorrow?\n\n2:28:03.060 --> 2:28:05.400\n So that was fun to watch him go through that.\n\n2:28:05.400 --> 2:28:10.820\n And he felt bad because he felt incorrectly, in my opinion, that he was needlessly aggressive\n\n2:28:10.820 --> 2:28:12.320\n and disrespectful toward me on Tim.\n\n2:28:12.320 --> 2:28:13.640\n I didn't feel disrespected at all.\n\n2:28:13.640 --> 2:28:15.760\n It got heated, but I didn't take it personally.\n\n2:28:15.760 --> 2:28:17.360\n People have heated debates all the time.\n\n2:28:17.360 --> 2:28:21.640\n So I think he promised me he wouldn't interrupt and would be deferential, but that because\n\n2:28:21.640 --> 2:28:27.480\n he promised to be on his best behavior, that gave me an opportunity to address him seriously\n\n2:28:27.480 --> 2:28:32.200\n and not to bring the clown aspect out of him, which is easy to caricature him.\n\n2:28:32.200 --> 2:28:36.000\n My friend Ethan Suppley, who I'm sure people know, played basically a character based on\n\n2:28:36.000 --> 2:28:40.320\n him in The Hunt, because Alex is kind of this cartoon archetype.\n\n2:28:40.320 --> 2:28:45.680\n So it was really fun to get another side of him.\n\n2:28:45.680 --> 2:28:49.080\n And also, it's just fun being on his show, just him being bombastic and just trying to\n\n2:28:49.080 --> 2:28:51.040\n be the calm voice of reason.\n\n2:28:51.040 --> 2:28:52.800\n And for once, the trickster was Apollo.\n\n2:28:52.800 --> 2:28:57.000\n Well, I like this thing he said before.\n\n2:28:57.000 --> 2:29:03.520\n And that's what makes me the most interested in Alex is the Nietzsche quote about gazing\n\n2:29:03.520 --> 2:29:04.920\n into the abyss.\n\n2:29:04.920 --> 2:29:08.980\n I think he said on your show that he has become the abyss or something like that.\n\n2:29:08.980 --> 2:29:14.840\n I think that makes him fascinating that when you really take conspiracy theories seriously,\n\n2:29:14.840 --> 2:29:17.840\n the kind of effect it has on your mind.\n\n2:29:17.840 --> 2:29:18.840\n That to me is fascinating.\n\n2:29:18.840 --> 2:29:22.140\n Well, can I say one thing, that term conspiracy theory?\n\n2:29:22.140 --> 2:29:26.480\n If you ask any layman, look, it's like this, you say, do you like puppies?\n\n2:29:26.480 --> 2:29:27.480\n I hate them.\n\n2:29:27.480 --> 2:29:28.480\n Do you like baby dogs?\n\n2:29:28.480 --> 2:29:29.480\n Oh, they're the best, right?\n\n2:29:29.480 --> 2:29:31.960\n People, the human mind is capable of doing this.\n\n2:29:31.960 --> 2:29:38.640\n So if you ask people, do you think extremely powerful people often get together and manipulate\n\n2:29:38.640 --> 2:29:43.160\n data or rules in order to further their power and control and maintain it?\n\n2:29:43.160 --> 2:29:46.380\n I think 90 plus percent of people would be like, of course.\n\n2:29:46.380 --> 2:29:48.200\n Then you say, oh, so you believe in conspiracy theories.\n\n2:29:48.200 --> 2:29:49.760\n Oh no, that's for crazy people.\n\n2:29:49.760 --> 2:29:51.440\n Those concepts are identical.\n\n2:29:51.440 --> 2:29:58.120\n Now that term is used for people who are like, all right, there's conspiracies in government\n\n2:29:58.120 --> 2:30:00.040\n to experiment on people like Tuskegee.\n\n2:30:00.040 --> 2:30:01.040\n This is not in dispute.\n\n2:30:01.040 --> 2:30:05.480\n The CIA has unsealed things, Operation Mockingbird, so on and so forth.\n\n2:30:05.480 --> 2:30:09.700\n And at the same time, conspiracy theory applies to people who say 9 11 never happened and\n\n2:30:09.700 --> 2:30:11.040\n those are holograms.\n\n2:30:11.040 --> 2:30:16.240\n Now it's the same word for both, but these are not at all equal truth claims and they\n\n2:30:16.240 --> 2:30:18.360\n do not at all have equal evidence to them.\n\n2:30:18.360 --> 2:30:22.840\n But it's very useful for powerful people to have that term in the zeitgeist because then\n\n2:30:22.840 --> 2:30:24.400\n I don't have to explain or defend.\n\n2:30:24.400 --> 2:30:27.560\n It's like, only lunatics are going to look further on this.\n\n2:30:27.560 --> 2:30:29.440\n Do you really want to be a lunatic kid?\n\n2:30:29.440 --> 2:30:31.400\n And that takes care of the issue.\n\n2:30:31.400 --> 2:30:35.720\n Unfortunately the same problem applies, language applies to a lot of other areas.\n\n2:30:35.720 --> 2:30:37.800\n 100%, that's the nature of language, yeah.\n\n2:30:37.800 --> 2:30:39.880\n It's used not just to communicate, but to obfuscate.\n\n2:30:39.880 --> 2:30:46.320\n Obviously that could be fixed by coming up with different words to label conspiracy theories\n\n2:30:46.320 --> 2:30:48.720\n that are much more likely to be true.\n\n2:30:48.720 --> 2:30:53.720\n Yeah, like power elite analysis is another, is basically conspiracy theory.\n\n2:30:53.720 --> 2:30:59.200\n This is the black pill versus white pill question with the abyss.\n\n2:30:59.200 --> 2:31:06.780\n Do you think thinking about these things can destroy the mind, can make you deeply cynical\n\n2:31:06.780 --> 2:31:08.280\n about the world?\n\n2:31:08.280 --> 2:31:15.320\n Yeah, because if you are thinking that you are not aware of, or no one is aware of who's\n\n2:31:15.320 --> 2:31:20.520\n controlling things and that the level of their control, it gives you the sense of powerlessness\n\n2:31:20.520 --> 2:31:22.160\n and hopelessness.\n\n2:31:22.160 --> 2:31:27.520\n And my counter is the people in charge, one of the reasons I'm an anarchist, are nowhere\n\n2:31:27.520 --> 2:31:30.360\n near as smart and crafty as you think they are.\n\n2:31:30.360 --> 2:31:34.320\n And certainly maybe the ones complete in the shadow maybe are, but the ones who are in\n\n2:31:34.320 --> 2:31:38.240\n the public face most certainly are not, as social media has demonstrated, when you look\n\n2:31:38.240 --> 2:31:45.200\n at how senators and Harvard professors tweet, these are not, you know, intellects that you're\n\n2:31:45.200 --> 2:31:47.320\n in awe of, to put it mildly.\n\n2:31:47.320 --> 2:31:52.680\n So I think that kind of takes the bloom off the rose to a great extent.\n\n2:31:52.680 --> 2:31:57.480\n You mentioned that you've been doing a lot of amazing things, been truly joyful recently.\n\n2:31:57.480 --> 2:32:02.400\n But I don't know if you have a bucket list.\n\n2:32:02.400 --> 2:32:05.800\n Is there items on the bucket list you haven't done yet?\n\n2:32:05.800 --> 2:32:11.440\n Are you pretty much satisfied and happy, and if you die today, if I murder you, you'll\n\n2:32:11.440 --> 2:32:12.440\n be happy?\n\n2:32:12.440 --> 2:32:13.440\n I could die today.\n\n2:32:13.440 --> 2:32:17.840\n Is there an item on the bucket list you want to get done?\n\n2:32:17.840 --> 2:32:20.000\n I don't, yeah.\n\n2:32:20.000 --> 2:32:21.000\n Deep Sea submersible.\n\n2:32:21.000 --> 2:32:24.640\n That would be number one on the bucket list.\n\n2:32:24.640 --> 2:32:25.640\n Why?\n\n2:32:25.640 --> 2:32:28.600\n Because that's where all the most interesting zoology is.\n\n2:32:28.600 --> 2:32:35.720\n And to be in a place where like virtually no human being has been, and to see these\n\n2:32:35.720 --> 2:32:38.720\n gods mistakes and their natural environment.\n\n2:32:38.720 --> 2:32:40.600\n My friend coined that term gods mistakes.\n\n2:32:40.600 --> 2:32:44.480\n If you look at deep sea creatures, you can imagine god making some animal being like,\n\n2:32:44.480 --> 2:32:48.200\n oh god, this is hideous, I'll just throw them on the ocean, no one's gonna see this.\n\n2:32:48.200 --> 2:32:51.040\n So that would be my number one bucket list thing.\n\n2:32:51.040 --> 2:32:55.800\n I would say go to the White House as a guest would be a bucket list thing.\n\n2:32:55.800 --> 2:32:59.600\n Russia, go to Russia would be a bucket list thing.\n\n2:32:59.600 --> 2:33:04.000\n I want to go, these are secondary, like go to Eritrea would be a bucket list thing.\n\n2:33:04.000 --> 2:33:06.600\n I've got a long list of books I need to write.\n\n2:33:06.600 --> 2:33:12.680\n That's that's, I don't know if that's really a bucket list per se.\n\n2:33:12.680 --> 2:33:18.520\n There's not that much, what I'm at a point in my life is once you cross up certain things,\n\n2:33:18.520 --> 2:33:21.800\n you basically, instead of driving the car, start surfing.\n\n2:33:21.800 --> 2:33:25.880\n And just amazing thing, I talked to you about this medical thing, you know, before we started.\n\n2:33:25.880 --> 2:33:29.120\n At a certain point, and I'm sure this happens to you, because your platform is a lot bigger\n\n2:33:29.120 --> 2:33:32.760\n than mine, all sorts of things start coming your way that you never would have thought\n\n2:33:32.760 --> 2:33:33.760\n of.\n\n2:33:33.760 --> 2:33:35.440\n And you're like, this is pretty darn cool.\n\n2:33:35.440 --> 2:33:38.560\n So to be, and that's happening at an escalating rate.\n\n2:33:38.560 --> 2:33:43.100\n Like I'm at a point now where I get stopped every day by people.\n\n2:33:43.100 --> 2:33:47.720\n So that's going to be a weird thing for me to get adjusted to.\n\n2:33:47.720 --> 2:33:53.160\n Like without exception, everyone who has ever stopped me on the street has been cool.\n\n2:33:53.160 --> 2:33:54.840\n And it's been a pleasant experience.\n\n2:33:54.840 --> 2:33:58.880\n There was one exception at an event where someone was genuinely on the spectrum and\n\n2:33:58.880 --> 2:34:02.680\n they didn't understand like distance and you don't touch people and that, but that's as\n\n2:34:02.680 --> 2:34:04.200\n bad as it got.\n\n2:34:04.200 --> 2:34:09.400\n So that is something that's going to be weird for me to have to deal with over the next\n\n2:34:09.400 --> 2:34:10.400\n couple of years.\n\n2:34:10.400 --> 2:34:14.440\n But you know, it's the price you pay and it's hardly a small price when people come up to\n\n2:34:14.440 --> 2:34:16.320\n you and say you've made my life better.\n\n2:34:16.320 --> 2:34:20.380\n But it's just weird when you go and like, like I was at the gym and then someone tweets\n\n2:34:20.380 --> 2:34:22.600\n like, did I see you at the gym just now?\n\n2:34:22.600 --> 2:34:24.000\n It's kind of weird.\n\n2:34:24.000 --> 2:34:27.920\n And I'm sure it's the same for you when you're walking around and you don't think about it,\n\n2:34:27.920 --> 2:34:30.880\n but people know who you are and you don't know who they are that you're being watched.\n\n2:34:30.880 --> 2:34:34.880\n Even though it's not malevolent, it's still just, you don't get prepared for that.\n\n2:34:34.880 --> 2:34:42.200\n Michael, there were, there will be two really big names that wanted to do this podcast.\n\n2:34:42.200 --> 2:34:46.060\n We'll do this podcast that I considered to do episode 200 with.\n\n2:34:46.060 --> 2:34:54.840\n But then I realized why the hell talk to somebody famous when I could talk to somebody I love\n\n2:34:54.840 --> 2:34:56.840\n that nobody knows or cares for.\n\n2:34:56.840 --> 2:35:00.680\n You just hit a random number generator.\n\n2:35:00.680 --> 2:35:01.680\n Yeah.\n\n2:35:01.680 --> 2:35:04.800\n Just, I listed all the Russians I know and who is the easiest to get.\n\n2:35:04.800 --> 2:35:05.800\n You're the.\n\n2:35:05.800 --> 2:35:07.800\n Yeah, who's the most desperate for camera stuff.\n\n2:35:07.800 --> 2:35:12.600\n He's got a shitty book out, we can talk about that for five minutes.\n\n2:35:12.600 --> 2:35:15.120\n This garbage cut and paste that he did.\n\n2:35:15.120 --> 2:35:20.640\n Uh, it turned out okay, I think slightly above average.\n\n2:35:20.640 --> 2:35:22.560\n Michael, I love you.\n\n2:35:22.560 --> 2:35:24.040\n You're an incredible human being.\n\n2:35:24.040 --> 2:35:26.800\n It's an honor that you would talk to me and you'll be my friend.\n\n2:35:26.800 --> 2:35:27.800\n Thanks so much for doing this.\n\n2:35:27.800 --> 2:35:34.500\n Uh, the respect that I got, uh, when you asked me to be the guest for the anniversary episode\n\n2:35:34.500 --> 2:35:38.520\n was similar to the respect when my two friends, Josh and Zoe, they were going to get married\n\n2:35:38.520 --> 2:35:41.840\n at city hall and they said, we want someone to witness at the Basque.\n\n2:35:41.840 --> 2:35:46.680\n So it's one thing when people tell you they like you and respect you, which I had growing\n\n2:35:46.680 --> 2:35:47.680\n up.\n\n2:35:47.680 --> 2:35:48.680\n It's another thing when they show it.\n\n2:35:48.680 --> 2:35:51.960\n And this is something that I do not take lightly and I hope no one takes lightly.\n\n2:35:51.960 --> 2:35:56.360\n And if someone does right by you and shows you respect, going back to kind of taking\n\n2:35:56.360 --> 2:36:01.840\n out for dinner, thank them, buy them a candy bar, buy them a soda, do something to show\n\n2:36:01.840 --> 2:36:03.840\n that you don't take it for granted.\n\n2:36:03.840 --> 2:36:09.960\n Because I think what you and I both want to do is increase human kindness as much as possible.\n\n2:36:09.960 --> 2:36:16.040\n And I'm going to look at the camera, be kind to yourself, because a lot of you deserve\n\n2:36:16.040 --> 2:36:17.040\n it.\n\n2:36:17.040 --> 2:36:23.880\n Thanks for listening to this conversation with Michael Malice and thank you to Gala\n\n2:36:23.880 --> 2:36:27.760\n Games, Indeed, BetterHelp and Masterclass.\n\n2:36:27.760 --> 2:36:31.480\n Check them out in the description to support this podcast.\n\n2:36:31.480 --> 2:36:37.160\n And now let me leave you with some words from Jack Kerouac that perhaps begins to explain\n\n2:36:37.160 --> 2:36:42.400\n the nature of and the reasons for my friendship with Mr. Michael Malice.\n\n2:36:42.400 --> 2:36:47.880\n The only people for me are the mad ones, the ones who are mad to live, mad to talk, mad\n\n2:36:47.880 --> 2:36:53.160\n to be saved, desirous of everything at the same time, the ones who never yawn or say\n\n2:36:53.160 --> 2:37:00.400\n commonplace thing but burn, burn, like fabulous yellow Roman candles exploding like spiders\n\n2:37:00.400 --> 2:37:05.920\n across the stars and in the middle you see the blue center light pop and everybody goes\n\n2:37:05.920 --> 2:37:09.120\n ahhhhh.\n\n2:37:09.120 --> 2:37:36.200\n Thank you for listening and hope to see you next time.\n\n"
}