{
  "title": "Eric Weinstein: Geometric Unity and the Call for New Ideas & Institutions | Lex Fridman Podcast #88",
  "id": "rIAZJNe7YtE",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.200\n The following is a conversation with Eric Weinstein, the second time we've\n\n00:04.200 --> 00:08.680\n spoken on this podcast, he's a mathematician with a bold and piercing\n\n00:08.680 --> 00:13.320\n intelligence, unafraid to explore the biggest questions in the universe and\n\n00:13.320 --> 00:16.280\n shine a light on the darkest corners of our society.\n\n00:16.920 --> 00:23.200\n He is the host of the portal podcast, a part of which he recently released his\n\n00:23.200 --> 00:29.720\n 2013 Oxford lecture on his theory of geometric unity that is at the center of\n\n00:29.720 --> 00:34.400\n his lifelong efforts to arrive at a theory of everything that unifies the\n\n00:34.400 --> 00:35.840\n fundamental laws of physics.\n\n00:36.520 --> 00:40.720\n This conversation was recorded recently in the time of the coronavirus pandemic\n\n00:41.120 --> 00:44.320\n for everyone feeling the medical, psychological and financial burden of\n\n00:44.320 --> 00:46.560\n this crisis, I'm sending love your way.\n\n00:47.080 --> 00:47.880\n Stay strong.\n\n00:47.960 --> 00:48.960\n We're in this together.\n\n00:49.200 --> 00:50.000\n We'll beat this thing.\n\n00:50.800 --> 00:53.120\n This is the artificial intelligence podcast.\n\n00:53.320 --> 00:56.800\n If you enjoy it, subscribe on YouTube, review it with five stars and apple\n\n00:56.800 --> 01:00.520\n podcasts, support it on Patreon or simply connect with me on Twitter\n\n01:00.760 --> 01:04.000\n at Lex Friedman spelled F R I D M A N.\n\n01:04.880 --> 01:09.240\n This show is presented by cash app, the number one finance app in the app store.\n\n01:09.560 --> 01:12.320\n When you get it, use code Lex podcast.\n\n01:12.840 --> 01:16.320\n Cash app lets you send money to friends by Bitcoin and invest in the stock\n\n01:16.320 --> 01:18.280\n market with as little as $1.\n\n01:18.800 --> 01:22.720\n Since cash app does fractional share trading, let me mention that the order\n\n01:22.720 --> 01:27.080\n execution algorithm that works behind the scenes to create the abstraction of\n\n01:27.080 --> 01:30.040\n the fractional orders is an algorithmic Marvel.\n\n01:30.480 --> 01:34.440\n So big props to the cash app engineers for solving a hard problem that in the\n\n01:34.440 --> 01:38.720\n end provides an easy interface that takes a step up to the next layer of\n\n01:38.720 --> 01:43.000\n abstraction of the stock market, making trading more accessible to new\n\n01:43.000 --> 01:46.520\n investors and diversification much easier.\n\n01:47.120 --> 01:51.320\n So again, if you get cash app from the app store, Google play and use code\n\n01:51.320 --> 01:57.080\n Lex podcast, you get $10 and cash app will also donate $10 to first an\n\n01:57.080 --> 02:00.880\n organization that is helping to advance robotics and STEM education for\n\n02:00.880 --> 02:02.160\n young people around the world.\n\n02:03.280 --> 02:07.320\n And now here's my conversation with Eric Weinstein.\n\n02:08.400 --> 02:12.200\n Do you see a connection between world war II and the crisis\n\n02:12.200 --> 02:13.120\n we're living through right now?\n\n02:13.800 --> 02:14.280\n Sure.\n\n02:14.920 --> 02:20.680\n The need for collective action, reminding ourselves of the fact that all of these\n\n02:20.680 --> 02:25.960\n abstractions, like everyone should just do exactly what he or she wants to do\n\n02:25.960 --> 02:28.080\n for himself and leave everyone else alone.\n\n02:28.120 --> 02:30.840\n None of these abstractions work in a global crisis.\n\n02:31.520 --> 02:35.800\n And this is just a reminder that we didn't somehow put all that behind us.\n\n02:36.600 --> 02:40.640\n When I hear stories about my grandfather who was in the army.\n\n02:40.640 --> 02:43.600\n And so the Soviet union where most people die, when you're in the army,\n\n02:44.080 --> 02:45.960\n there's a brotherhood that happens.\n\n02:45.960 --> 02:47.400\n There's a love that happens.\n\n02:48.120 --> 02:49.720\n Do you think that's something we're going to see here?\n\n02:49.720 --> 02:54.640\n Uh, since we're not there, I mean, what the Soviet union went through, I mean,\n\n02:54.640 --> 03:02.240\n the enormity of the war on, uh, the Russian doorstep, this is different.\n\n03:02.640 --> 03:05.640\n What we're going through now is not, we can't talk about Stalingrad and\n\n03:05.640 --> 03:07.080\n COVID in the same breath yet.\n\n03:07.440 --> 03:08.080\n We're not ready.\n\n03:08.320 --> 03:14.320\n And the, the sort of, uh, you know, just the sense of like the great patriotic\n\n03:14.320 --> 03:19.680\n war and the way in which I was very moved by the Soviet custom of,\n\n03:19.680 --> 03:23.240\n of newlyweds going and visiting war memorials on their wedding day.\n\n03:23.280 --> 03:24.440\n It's like the happiest day of your life.\n\n03:24.440 --> 03:27.000\n You have to say thank you to the people who made it possible.\n\n03:27.680 --> 03:28.240\n We're not there.\n\n03:28.880 --> 03:31.840\n We're, we're just restarting history.\n\n03:31.840 --> 03:35.520\n We, you know, I've called this on the Rogan program.\n\n03:35.520 --> 03:41.840\n I called it the great nap, the 75 years with, um, very little by historical\n\n03:41.840 --> 03:45.800\n standards in, in terms of really profound disruption.\n\n03:45.800 --> 03:50.600\n And so when you call it the great nap, meaning lack of deep global tragedy,\n\n03:51.240 --> 03:54.240\n well, lack of realized global tragedy.\n\n03:54.240 --> 03:58.680\n So I think that the development, for example, of the hydrogen bomb, you know,\n\n03:58.680 --> 04:01.520\n was something that happened during the great nap.\n\n04:02.360 --> 04:08.160\n And that doesn't mean that people who lived during that time didn't feel\n\n04:08.160 --> 04:13.240\n feared and no anxiety, but it was to say that most of the violent potential\n\n04:13.240 --> 04:15.680\n of the human species was not realized.\n\n04:15.680 --> 04:18.040\n It was in the form of potential energy.\n\n04:18.040 --> 04:21.440\n And this is the thing that I've sort of taken issue with, with the description\n\n04:21.440 --> 04:25.960\n of Steven Pinker's optimism is that if you look at the realized kinetic\n\n04:25.960 --> 04:28.880\n variables, things have been getting much better for a long time, which is the\n\n04:28.880 --> 04:34.880\n great nap, but it's not as if, uh, our fragility has not grown our dependence\n\n04:34.880 --> 04:38.440\n on electronic systems, our vulnerability to disruption.\n\n04:38.440 --> 04:42.960\n And so all sorts of things have gotten much better. Other things have gotten\n\n04:42.960 --> 04:46.600\n much worse and the destructive potential is skyrocketed.\n\n04:47.000 --> 04:47.760\n It's tragedy.\n\n04:47.760 --> 04:50.920\n The only way we wake up from the big nap.\n\n04:51.160 --> 04:56.520\n Well, no, you could also have a, you know, jubilation about positive things, but\n\n04:56.520 --> 04:58.680\n it's harder to get people's attention.\n\n04:58.720 --> 05:02.840\n Can you give an example of a big global positive thing that could happen?\n\n05:02.920 --> 05:07.880\n I think that when, for example, just historically speaking, uh, HIV\n\n05:07.880 --> 05:11.360\n went from being a death sentence to something that people could live with\n\n05:11.360 --> 05:13.280\n for a very long period of time.\n\n05:13.600 --> 05:16.840\n It would be great if that had happened on a Wednesday, right?\n\n05:16.840 --> 05:19.480\n Like all at once, like you knew that things had changed.\n\n05:19.960 --> 05:24.640\n And so the bleed in somewhat kills the, the sort of the Wednesday effect\n\n05:24.640 --> 05:28.840\n where it all happens on a particular day at a particular moment.\n\n05:29.320 --> 05:32.320\n I think if you look at the stock market here, you know, there's a very clear\n\n05:32.320 --> 05:37.120\n moment where you can see that the market absorbs the idea of the coronavirus.\n\n05:37.120 --> 05:43.240\n I think that with respect to, um, positives, the moon landing was the best\n\n05:43.240 --> 05:49.240\n example of a positive that happened at a particular time or, uh, recapitulating\n\n05:49.240 --> 05:57.160\n the Soviet American, uh, link up in terms of, um, Skylab and Soyuz, right?\n\n05:57.160 --> 06:02.120\n Like that was a huge moment when you actually had these two nations connecting.\n\n06:02.800 --> 06:03.800\n Uh, in orbit.\n\n06:03.800 --> 06:07.400\n And so, yeah, there are great moments where something beautiful and wonderful\n\n06:07.400 --> 06:11.720\n and amazing happens, you know, but it's just, there are fewer of, that's why,\n\n06:11.720 --> 06:16.560\n that's why as much as I can't imagine proposing to somebody at a sporting event,\n\n06:17.200 --> 06:21.840\n when you have like 30,000 people waiting and you know, like she says, yes,\n\n06:22.720 --> 06:23.720\n it's pretty exciting.\n\n06:23.760 --> 06:26.160\n So I think that we shouldn't, we shouldn't discount that.\n\n06:27.840 --> 06:33.240\n So how bad do you think it's going to get in terms of, um,\n\n06:33.240 --> 06:38.440\n of the global suffering that we're going to experience with this, with this crisis?\n\n06:38.480 --> 06:39.760\n I can't figure this one out.\n\n06:40.200 --> 06:41.200\n I'm just not smart enough.\n\n06:41.200 --> 06:43.160\n Something is going weirdly wrong.\n\n06:43.840 --> 06:46.360\n They're almost like two separate storylines.\n\n06:46.360 --> 06:51.600\n We in one storyline, we aren't taking things nearly seriously enough.\n\n06:52.080 --> 06:59.680\n We see people using food packaging lids as masks who are doctors or nurses.\n\n06:59.680 --> 07:04.680\n Um, we hear horrible stories about people dying needlessly due to triage.\n\n07:05.560 --> 07:08.840\n And that's a very terrifying story.\n\n07:09.560 --> 07:12.960\n On the other hand, there's this other story, which says there are\n\n07:12.960 --> 07:14.960\n tons of ventilators someplace.\n\n07:15.000 --> 07:18.440\n We've got lots of masks, but they haven't been released.\n\n07:18.800 --> 07:21.840\n We've got hospital ships where none of the beds are being used.\n\n07:22.560 --> 07:28.800\n And it's very confusing to me that somehow these two stories give me the feeling\n\n07:28.800 --> 07:33.520\n that they both must be true simultaneously, and they can't both be true in any kind\n\n07:33.520 --> 07:37.800\n of standard way, whether I don't know whether it's just that I'm dumb, but I\n\n07:37.800 --> 07:40.560\n can't get one or the other story to quiet down.\n\n07:40.560 --> 07:44.360\n So I think weirdly, this is much more serious than we had understood it.\n\n07:44.800 --> 07:49.480\n And it's not nearly as serious as some people are making it out to be at the\n\n07:49.480 --> 07:54.440\n same time and that we're not being given the tools to actually understand, Oh,\n\n07:54.440 --> 07:58.760\n here's how to interpret the data, or here's the issue with the personal protective\n\n07:58.760 --> 08:03.440\n equipment is actually a jurisdictional battle or a question of who pays for it\n\n08:03.760 --> 08:06.000\n rather than a question of whether it's present or absent.\n\n08:06.040 --> 08:10.360\n I don't understand the details of it, but something is wildly off in our\n\n08:10.360 --> 08:11.720\n ability to understand where we are.\n\n08:11.960 --> 08:14.560\n So that's, that's policy that's institutions.\n\n08:14.600 --> 08:18.960\n What about, do you think about the quiet suffering of millions of\n\n08:18.960 --> 08:21.160\n people that have lost their job?\n\n08:21.600 --> 08:23.200\n Is this a temporary thing?\n\n08:23.200 --> 08:28.520\n I mean, what I'm my ears, not to the suffering of those people who have\n\n08:28.520 --> 08:32.800\n lost their job or the 50% possibly a small businesses that are going to go\n\n08:32.800 --> 08:35.120\n bankrupt, do you think about that?\n\n08:36.280 --> 08:36.400\n Sure.\n\n08:36.400 --> 08:37.240\n It's suffering.\n\n08:37.440 --> 08:41.800\n Well, and how that might arise itself could be not quiet too.\n\n08:41.840 --> 08:42.720\n I mean, right.\n\n08:42.720 --> 08:44.040\n That's the, could be a depression.\n\n08:44.600 --> 08:47.960\n This could go from recession to depression and depression could go\n\n08:47.960 --> 08:49.720\n to armed conflict and then to war.\n\n08:49.720 --> 08:56.720\n So it's not a very, um, abstract causal chain that gets us to the point where\n\n08:57.240 --> 09:01.720\n we can begin with quiet suffering and anxiety and all of these sorts of things\n\n09:01.720 --> 09:06.520\n and people losing their jobs and people dying from stress and all sorts of things.\n\n09:06.840 --> 09:15.080\n But, um, look, anything powerful enough to put us all indoors in a, I mean,\n\n09:15.080 --> 09:20.240\n I think about this as an incredible experiment. Imagine that you proposed,\n\n09:20.520 --> 09:22.480\n Hey, I want to do a bunch of research.\n\n09:22.880 --> 09:27.600\n Let's figure out what changes in our emissions, emissions profiles for our\n\n09:27.600 --> 09:32.200\n carbon footprints when we're all indoors or what happens to traffic patterns or\n\n09:32.200 --> 09:37.920\n what happens to the vulnerability of retail sales, uh, as Amazon gets stronger,\n\n09:37.960 --> 09:39.120\n you know, et cetera, et cetera.\n\n09:39.120 --> 09:44.960\n I believe that in many of those situations, um, we're running an incredible\n\n09:44.960 --> 09:47.760\n experiment and I, am I worried for us all?\n\n09:47.760 --> 09:49.440\n Yes, there are some bright spots.\n\n09:49.440 --> 09:53.640\n One of which is that when you're ordered to stay indoors, people are\n\n09:53.640 --> 09:58.440\n going to feel entitled and the usual thing that people are going to hit when\n\n09:58.440 --> 10:04.720\n they hear that they've lost your job, you know, there's this kind of tough,\n\n10:04.720 --> 10:09.560\n um, tough love attitude that you see, particularly in the United States, like,\n\n10:09.800 --> 10:12.120\n Oh, you lost your job, poor baby.\n\n10:12.360 --> 10:14.320\n Well, go retrain, get another one.\n\n10:15.080 --> 10:17.760\n I think there's going to be a lot less appetite for that.\n\n10:18.280 --> 10:23.160\n Um, because we've been asked to sacrifice, to risk, to act collectively.\n\n10:23.960 --> 10:25.240\n And that's the interesting thing.\n\n10:25.480 --> 10:27.120\n What does that reawaken in us?\n\n10:27.160 --> 10:31.640\n Maybe the idea that we actually are nations and that, you know, you're\n\n10:31.640 --> 10:35.520\n fellow countrymen may, may start to mean something to more people.\n\n10:35.520 --> 10:39.560\n It certainly means something to people in the military, but I wonder how many\n\n10:39.800 --> 10:43.240\n people who aren't in the military start to think about this as like, Oh yeah,\n\n10:43.320 --> 10:46.800\n we are kind of running separate experiments and we are not China.\n\n10:48.720 --> 10:51.920\n So you think this is kind of a period that might be studied for years to come.\n\n10:52.560 --> 10:57.840\n From my perspective, we are a part of experiment, but I don't feel like\n\n10:57.840 --> 10:59.680\n we have access to the full range of knowledge.\n\n10:59.680 --> 11:04.280\n But I don't feel like we have access to the full data, the full data of the\n\n11:04.280 --> 11:09.600\n experiment, we're just like little mice in a large, does this one make sense to you?\n\n11:11.480 --> 11:14.720\n I'm, I'm romanticizing it and I keep connecting it to world war II.\n\n11:15.080 --> 11:19.240\n So I keep connecting to historical events and making sense of them through that way\n\n11:19.640 --> 11:26.720\n or reading the plague by Camus, like almost kind of telling narratives and\n\n11:26.720 --> 11:33.320\n stories, but it might, I'm not hearing the suffering that people are going\n\n11:33.320 --> 11:36.480\n through because I think that's quiet there.\n\n11:36.480 --> 11:39.240\n Everybody's numb currently.\n\n11:39.320 --> 11:43.160\n They're not realizing what it means to have lost your job and\n\n11:43.160 --> 11:44.200\n to have lost your business.\n\n11:44.240 --> 11:52.720\n There's kind of a, I don't, I, um, I'm afraid how that fear will materialize\n\n11:52.720 --> 11:54.680\n itself once the numbness wears out.\n\n11:54.680 --> 12:01.160\n And especially if this lasts for many months, then if it's connected to\n\n12:01.160 --> 12:07.600\n the incompetence of the CDC and the WHO and our government and perhaps the\n\n12:07.600 --> 12:13.600\n election process, you know, my biggest fear is that the elections get delayed\n\n12:13.640 --> 12:14.520\n or something like that.\n\n12:15.800 --> 12:23.000\n So the, the, the basic mechanisms of our democracy get slowed or\n\n12:23.000 --> 12:26.960\n damaged in some way that then mixes with the fear that people have that\n\n12:26.960 --> 12:30.800\n turns to panic, that turns to anger, that anger.\n\n12:31.160 --> 12:32.400\n Can I just play with that for a little bit?\n\n12:32.400 --> 12:32.680\n Sure.\n\n12:33.680 --> 12:40.440\n What if in fact, all of that structure that you grew up thinking about, and\n\n12:40.440 --> 12:43.080\n again, you grew up in two places, right?\n\n12:43.120 --> 12:49.360\n So, uh, when you were inside the U S we tend to look at all of these things as\n\n12:49.360 --> 12:53.000\n museum pieces, like how often do we amend the constitution anymore?\n\n12:54.600 --> 12:58.880\n And in some sense, if you think about the Jewish tradition of Simha Torah,\n\n12:59.200 --> 13:04.640\n you've got this beautiful scroll that has been lovingly hand drawn and\n\n13:04.640 --> 13:08.160\n calligraphy, um, that's very valuable.\n\n13:08.600 --> 13:15.560\n And it's very important that you not treat it as a relic to be revered.\n\n13:15.560 --> 13:20.080\n And so we, one day a year, we dance with the Torah and we hold this incredibly\n\n13:20.080 --> 13:25.800\n vulnerable document up and we treat it as if, uh, you know, it was Ginger\n\n13:25.800 --> 13:28.480\n Rogers being, uh, led by Fred Astaire.\n\n13:28.920 --> 13:32.720\n Well, that is how you become part of your country.\n\n13:33.400 --> 13:36.640\n In fact, maybe the, maybe the election will be delayed.\n\n13:36.640 --> 13:38.920\n Maybe extraordinary powers will be used.\n\n13:38.960 --> 13:42.280\n Maybe any one of a number of things will indicate that you're\n\n13:42.280 --> 13:43.720\n actually living through history.\n\n13:43.720 --> 13:47.280\n This isn't a museum piece that you were handed by your great, great grandparents.\n\n13:47.800 --> 13:51.920\n But you're kind of suggesting that there might be a, like a\n\n13:51.920 --> 13:59.560\n community thing that pops up like, like, um, as opposed to, uh, an angry revolution.\n\n13:59.560 --> 14:04.480\n It might have a positive effect of, well, for example, are you telling me\n\n14:04.520 --> 14:11.840\n that if the right person stood up and called for us to sacrifice PPE, uh, for\n\n14:11.840 --> 14:18.720\n our nurses and our, our MDs who are on the front lines, that like people wouldn't\n\n14:19.160 --> 14:23.400\n reach down deep in their own supply that they've been like stocking and carefully\n\n14:23.480 --> 14:25.200\n storing them just say, like, say here, take it.\n\n14:26.200 --> 14:35.440\n Like right now, an actual leader would use this time to bring out the heroic\n\n14:35.440 --> 14:39.400\n character and I'm going to just go wildly patriotic cause I frigging love this\n\n14:39.400 --> 14:45.960\n country, we've got this dormant population in the us that loves leadership\n\n14:45.960 --> 14:51.240\n and country and pride in our freedom and not being told what to do.\n\n14:51.240 --> 14:55.080\n And we still have this thing that binds us together and all of them,\n\n14:55.800 --> 14:59.120\n the merchants of division just be gone.\n\n14:59.920 --> 15:01.160\n I totally agree with you.\n\n15:01.160 --> 15:04.520\n There's a, I think there is a deep hunger for that leadership.\n\n15:04.800 --> 15:09.160\n Why hasn't that, why, why hasn't one of us, we don't have the right search\n\n15:09.160 --> 15:14.360\n surgeon general, we have a guy saying, you know, come on guys, don't buy masks.\n\n15:14.360 --> 15:15.400\n They don't really work for you.\n\n15:15.440 --> 15:17.880\n Save them for our healthcare professionals.\n\n15:18.640 --> 15:20.600\n No, you can't do that.\n\n15:20.880 --> 15:24.040\n You have to say, you know what, these masks actually do work and they more\n\n15:24.040 --> 15:28.440\n work to protect other people from you, but they would work for you.\n\n15:28.640 --> 15:30.680\n They'll keep you somewhat safer if you wear them.\n\n15:30.720 --> 15:31.520\n Here's the deal.\n\n15:31.840 --> 15:35.040\n You've got somebody who's taking huge amounts of viral load all the time\n\n15:35.040 --> 15:36.320\n because the patients are shedding.\n\n15:36.320 --> 15:38.920\n Do you want to protect that person who's volunteered to be on the front\n\n15:38.920 --> 15:40.440\n line, who's up sleepless nights?\n\n15:41.520 --> 15:43.080\n You just changed the message.\n\n15:43.080 --> 15:44.920\n You stop lying to people.\n\n15:44.960 --> 15:46.800\n You just, you level with them.\n\n15:46.800 --> 15:47.760\n It's like, it's bad.\n\n15:48.160 --> 15:48.680\n Absolutely.\n\n15:48.680 --> 15:51.120\n But that's a, that's a little bit specific.\n\n15:51.320 --> 15:54.560\n So you, you have to be just honest about the facts of the situation.\n\n15:54.560 --> 15:55.060\n Yes.\n\n15:55.360 --> 15:59.760\n But I think you were referring to something bigger than just that inspiring,\n\n16:00.480 --> 16:05.520\n like, you know, rewriting the constitution, sort of rethinking how\n\n16:05.520 --> 16:06.480\n we work as a nation.\n\n16:06.920 --> 16:07.420\n Yeah.\n\n16:07.420 --> 16:09.960\n I think you should probably, you know, amend the constitution once\n\n16:09.960 --> 16:15.760\n or twice in a lifetime so that you don't get this distance from the foundational\n\n16:15.760 --> 16:20.520\n documents and, you know, part of the problem is that we've got two generations\n\n16:20.520 --> 16:25.560\n on top that feel very connected to the U S they feel bought in and we've got three\n\n16:25.560 --> 16:31.800\n generations below it's a little bit like watching your parents riding the tricycle\n\n16:31.800 --> 16:34.200\n that they were supposed to pass on to you.\n\n16:34.200 --> 16:37.600\n And it's like, you're now too old to ride a tricycle and they're still\n\n16:37.600 --> 16:41.040\n whooping it up, ringing the bell with the streamers coming off the handlebars.\n\n16:41.040 --> 16:44.200\n And you're just thinking, do you guys never get bored?\n\n16:44.240 --> 16:45.680\n Do you never pass a torch?\n\n16:45.800 --> 16:46.800\n Do you really want it?\n\n16:47.440 --> 16:51.640\n We had five septuagenarians all born in the forties running for president of the\n\n16:51.640 --> 16:53.440\n United States when Clovis sure dropped out.\n\n16:53.840 --> 16:55.040\n The youngest was Warren.\n\n16:55.040 --> 17:01.840\n We had Warren Biden, Sanders, Bloomberg, and Trump from like 1949 to 1941.\n\n17:01.840 --> 17:07.240\n All who had been the oldest president at inauguration and nobody's, nobody says\n\n17:07.240 --> 17:12.040\n grandma and grandpa, you're embarrassing us except Joe Rogan.\n\n17:13.240 --> 17:14.440\n Let me put it on you.\n\n17:14.480 --> 17:15.840\n You have a big platform.\n\n17:16.440 --> 17:18.640\n You're somewhat of an intelligent, eloquent guy.\n\n17:19.240 --> 17:23.440\n What, what role do you somewhat, what role do you play?\n\n17:23.440 --> 17:24.640\n Why aren't you that leader?\n\n17:25.240 --> 17:30.840\n Well, you're, I mean, I would argue that you're in, in ways becoming a leader.\n\n17:30.840 --> 17:32.360\n In ways becoming that leader.\n\n17:32.360 --> 17:34.040\n So I haven't taken enough risk.\n\n17:34.720 --> 17:35.600\n Is that your idea?\n\n17:35.920 --> 17:38.160\n What should I do or say at the moment?\n\n17:38.160 --> 17:41.720\n No, you're a little bit, no, you have taken quite a big risks\n\n17:41.800 --> 17:43.160\n and we'll, we'll talk about it.\n\n17:43.400 --> 17:43.760\n All right.\n\n17:43.760 --> 17:55.360\n But you're also on the outside shooting in, meaning, um, you're, uh, dismantling\n\n17:55.400 --> 18:00.360\n the institution from the outside as opposed to becoming the institution.\n\n18:00.360 --> 18:04.920\n Do you remember that thing you brought up when you were on the view, the view?\n\n18:05.160 --> 18:05.520\n I'm sorry.\n\n18:05.520 --> 18:09.360\n When you were on Oprah, I didn't make, I didn't get the invite.\n\n18:09.360 --> 18:09.800\n Sorry.\n\n18:09.880 --> 18:13.600\n When you were on Bill Maher's program, what was that thing you were saying?\n\n18:16.800 --> 18:17.840\n They don't know we're here.\n\n18:18.640 --> 18:19.680\n They may watch us.\n\n18:20.160 --> 18:20.520\n Yeah.\n\n18:21.200 --> 18:27.480\n They may quietly slip us a direct message, but they pretend that this\n\n18:27.480 --> 18:32.520\n internet thing is, uh, some dangerous place where only lunatics play.\n\n18:32.840 --> 18:37.880\n Well, who has the bigger platform, the portal or Bill Maher's program or the\n\n18:37.880 --> 18:43.120\n view, Bill Maher and the view in terms of viewership or in terms of what's\n\n18:43.120 --> 18:44.160\n the metric of size?\n\n18:44.160 --> 18:50.160\n Well, first of all, the key thing is, um, take, take a newspaper and even\n\n18:50.160 --> 18:51.920\n imagine that it's completely fake.\n\n18:52.440 --> 18:52.760\n Okay.\n\n18:53.160 --> 18:55.600\n And then there's very little in the way of circulation.\n\n18:55.600 --> 18:59.920\n Yet imagine that it's an a hundred year old paper and that it's still part of\n\n18:59.920 --> 19:01.960\n this game, this internal game of media.\n\n19:03.520 --> 19:10.120\n The key point is, is that those sources that have that kind of, um, mark of\n\n19:10.120 --> 19:16.680\n respectability to the institutional structures matter in a way that even if\n\n19:16.680 --> 19:20.600\n I say something on a very large platform that makes a lot of sense, if it's\n\n19:20.600 --> 19:24.600\n outside of what I've called the gated institutional narrative or gin, I'm\n\n19:24.600 --> 19:29.160\n sorry, institutional narrative or gin, it sort of doesn't matter to the\n\n19:29.160 --> 19:34.680\n institutions. So the game is if it happens outside of the club, we can\n\n19:34.680 --> 19:36.000\n pretend that it never happened.\n\n19:37.120 --> 19:41.760\n How can you get the credibility and the authority from outside the, the\n\n19:41.760 --> 19:43.520\n gated institutional narrative?\n\n19:43.920 --> 19:52.560\n Well, first of all, you and I both share, um, institutional credibility coming\n\n19:52.560 --> 19:57.600\n from organizations. So you, we were both at MIT, were you at Harvard at any\n\n19:57.600 --> 19:59.360\n point? Nope. Okay.\n\n19:59.520 --> 20:01.680\n Well, I lived in Harvard square.\n\n20:02.160 --> 20:07.600\n So did I, but you know, at some level, the issue isn't whether you have\n\n20:07.600 --> 20:09.080\n credentials in that sense.\n\n20:09.880 --> 20:14.200\n The key question is, can you be trusted to file a flight plan and not deviate\n\n20:14.400 --> 20:19.400\n from that flight plan when you are in an interview situation, will you stick to\n\n20:19.400 --> 20:20.280\n the talking points?\n\n20:20.280 --> 20:25.640\n Not, and that's why you're not going to be allowed in the general\n\n20:25.640 --> 20:30.320\n conversation, which amplifies these sentiments, but I'm still trying to, um,\n\n20:30.520 --> 20:33.000\n so your, your point, it would be, is that we're, let's say both.\n\n20:33.600 --> 20:37.560\n So you've done how many Joe Rogan for I've done for two, right?\n\n20:37.720 --> 20:40.880\n So both of us are somewhat frequent guests. The show is huge.\n\n20:40.880 --> 20:44.800\n You know, the power as well as I do, and people are going to watch this\n\n20:44.800 --> 20:48.880\n conversation. A huge number watched our last one, by the way, I want to thank\n\n20:48.880 --> 20:51.560\n you for that one. That was a terrific, terrific conversation.\n\n20:51.560 --> 20:55.680\n Really did change my life. Like you're brilliant interviewer. So thank you.\n\n20:56.560 --> 21:00.360\n Thank you. That was that you changed my life too.\n\n21:00.520 --> 21:04.080\n That you gave me a chance. So I was so glad I did that one.\n\n21:04.640 --> 21:08.720\n What I would say is, is that we keep mistaking how big the audience is for\n\n21:08.720 --> 21:11.800\n whether or not you have the kiss and the kiss is a different thing.\n\n21:12.120 --> 21:16.120\n Yes. Yeah. Well, it doesn't, it's not an acronym yet. Okay. Um,\n\n21:16.120 --> 21:20.480\n it's uh, but thank you for asking. It's a question of,\n\n21:20.960 --> 21:25.480\n are you part of the inter interoperable institution friendly discussion?\n\n21:25.960 --> 21:29.160\n And that's the discussion which we ultimately have to break into.\n\n21:29.520 --> 21:32.560\n But that's what I'm trying to get at is how do we, how do you,\n\n21:32.600 --> 21:35.440\n how does Eric Weinstein become the president of the United States?\n\n21:36.360 --> 21:39.120\n I shouldn't become the president of the United States. Not interested.\n\n21:39.160 --> 21:40.560\n Thank you very much for asking. Okay.\n\n21:40.640 --> 21:45.280\n Get into a leadership position where I guess I don't know what that means,\n\n21:45.280 --> 21:50.040\n but where you can inspire millions of people to, uh,\n\n21:50.200 --> 21:53.680\n the inspire the sense of community, inspire the,\n\n21:54.960 --> 21:57.720\n the kind of actions required to overcome hardship,\n\n21:57.760 --> 22:01.880\n the kind of hardship that we may be experiencing to inspire people,\n\n22:01.880 --> 22:05.280\n to work hard and face the difficult,\n\n22:05.280 --> 22:09.080\n hard facts of the realities we're living through all those kinds of things that\n\n22:09.080 --> 22:13.080\n you're talking about. That leader, you know,\n\n22:13.080 --> 22:17.680\n can that leader emerge from the current institutions or\n\n22:18.480 --> 22:21.400\n alternatively, can it also emerge from the outside?\n\n22:21.840 --> 22:22.880\n I guess that's what I was asking.\n\n22:22.920 --> 22:23.840\n So my belief is,\n\n22:23.840 --> 22:28.840\n is that this is the last hurrah for the elderly centrist kleptocrats.\n\n22:31.760 --> 22:35.560\n Can you define each of those terms? Okay. Elderly.\n\n22:36.200 --> 22:40.240\n I mean people who were born at least a year before I was,\n\n22:40.240 --> 22:43.800\n that's a joke. You can laugh. Uh, no,\n\n22:43.800 --> 22:48.400\n because I'm born at the cusp of the gen X boomer divide. Um,\n\n22:49.160 --> 22:51.320\n centrist they're pretending, you know,\n\n22:51.560 --> 22:54.880\n there are two parties, Democrat and Republican party in the United States.\n\n22:54.920 --> 22:58.240\n I think it's easier to think of the mainstream of both of them as part of a,\n\n22:58.560 --> 23:01.400\n an aggregate party that I sometimes call the looting party,\n\n23:01.760 --> 23:05.200\n which gets us to kleptocracy, which is ruled by thieves.\n\n23:05.880 --> 23:09.600\n And the great temptation has been to treat the U S like a trough.\n\n23:09.600 --> 23:12.280\n And you just have to get yours because it's not like we're doing anything\n\n23:12.280 --> 23:13.120\n productive.\n\n23:13.320 --> 23:17.480\n So everybody's sort of looting the family mansion and somebody stole the silver\n\n23:17.480 --> 23:20.800\n and somebody is cutting the pictures out of the frames and you know,\n\n23:20.840 --> 23:24.160\n roughly speaking, we're watching our elders, uh,\n\n23:25.120 --> 23:28.000\n we'll live it up in a way that doesn't make sense to the rest of us.\n\n23:28.840 --> 23:31.040\n Okay. So if it's the last hurrah,\n\n23:32.320 --> 23:34.120\n this is the time for leaders to step up.\n\n23:35.040 --> 23:36.920\n We're not ready yet. We're not ready.\n\n23:36.920 --> 23:40.200\n I just disagree with that. I call, I call out, you know,\n\n23:40.600 --> 23:44.320\n the head of the CDC should resign, should resign.\n\n23:45.680 --> 23:49.160\n The surgeon general should resign. Trump should resign. Pelosi should resign.\n\n23:49.920 --> 23:54.360\n De Blasio should resign. I understand that. So that's why. So we'll wait.\n\n23:55.240 --> 23:59.680\n No, but that's not how revolutions work. You don't wait for people to resign.\n\n24:00.120 --> 24:03.880\n You, uh, step up and inspire the alternative.\n\n24:03.880 --> 24:08.600\n Do you remember the Russian revolution of 1907? It's before my time,\n\n24:09.800 --> 24:12.000\n but there wasn't a Russian revolution of 1907.\n\n24:12.360 --> 24:15.760\n So you're thinking we're in 1907. I'm saying we're too early.\n\n24:16.040 --> 24:20.480\n But we got this, you know, Spanish flu came in 17, 18.\n\n24:20.480 --> 24:25.080\n So I would argue that there's a lot of parallels there or there were one.\n\n24:25.360 --> 24:29.040\n I think it's not time yet. Like John Prine, the, uh,\n\n24:29.040 --> 24:34.040\n uh, the songwriter just died of COVID. That was a pretty big,\n\n24:34.240 --> 24:38.040\n really? Yeah. By the way, you, yes, of course. I, um,\n\n24:40.080 --> 24:41.520\n every time we do this, uh,\n\n24:41.560 --> 24:46.320\n we discover our mutual appreciation of obscure brilliant witty\n\n24:46.800 --> 24:50.480\n songwriter. He's really, he's really quite good, right? He's, he's really good.\n\n24:50.520 --> 24:52.080\n Yeah. He died.\n\n24:52.560 --> 24:56.720\n My understanding is that he passed recently due to complications of Corona.\n\n24:56.720 --> 25:01.280\n Yeah. So we haven't had large enough,\n\n25:01.320 --> 25:04.360\n enough large, large enough shocking deaths yet,\n\n25:05.400 --> 25:09.080\n picturesque deaths, deaths of a family that couldn't get treatment.\n\n25:10.160 --> 25:14.840\n There are stories that will come and break our hearts and we have not had enough\n\n25:14.840 --> 25:18.320\n of those. The visuals haven't come in, but I think they're coming. Well,\n\n25:18.360 --> 25:19.200\n we'll find out.\n\n25:19.440 --> 25:22.560\n But that you gotta, you have to be there. He has to be there when they come.\n\n25:22.560 --> 25:23.000\n I mean,\n\n25:23.000 --> 25:27.680\n but we didn't get the visual for example of falling man from nine 11.\n\n25:27.840 --> 25:31.080\n Right. So the outside world did, but Americans were not,\n\n25:32.000 --> 25:33.720\n it was thought that we would be too delicate.\n\n25:33.960 --> 25:37.960\n So just the way you remember Pulitzer prize winning photographs from the Vietnam\n\n25:37.960 --> 25:38.640\n era,\n\n25:38.640 --> 25:43.640\n you don't easily remember the photographs from all sorts of things that have\n\n25:43.720 --> 25:46.200\n happened since because something changed in our media.\n\n25:46.200 --> 25:51.200\n We are in sense that we cannot feel or experience our own lives and the tragedy\n\n25:51.200 --> 25:52.920\n that would animate us to action.\n\n25:53.760 --> 25:56.000\n Yeah. But I think there, again,\n\n25:56.000 --> 25:59.880\n I think there's going to be that suffering that's going to build and build and\n\n25:59.880 --> 26:02.600\n build in terms of businesses,\n\n26:02.600 --> 26:05.680\n mom and pop shops that close. And I, like,\n\n26:05.680 --> 26:08.360\n I think for myself, I think often that,\n\n26:09.960 --> 26:13.440\n that I'm being weak and,\n\n26:13.440 --> 26:16.800\n and like I feel like I should be doing something.\n\n26:17.280 --> 26:19.760\n I should be becoming a leader on a small scale.\n\n26:19.760 --> 26:24.760\n You can't, this is not world war II, and this is not Soviet Russia.\n\n26:24.800 --> 26:27.080\n Why not? Why not?\n\n26:27.080 --> 26:29.880\n Because our internal programming,\n\n26:29.880 --> 26:34.880\n the malware that sits between our ears is much different than the propaganda is\n\n26:36.560 --> 26:40.720\n malware of the Soviet era. I mean,\n\n26:40.720 --> 26:45.720\n people were both very indoctrinated and also knew that some level it was BS.\n\n26:45.720 --> 26:48.440\n They had a double mind. I don't know.\n\n26:48.440 --> 26:53.440\n There must be a great word in Russian for being able to think both of those\n\n26:53.440 --> 26:54.280\n things simultaneously.\n\n26:54.280 --> 26:59.280\n You don't think people are actually sick of the partisanship,\n\n27:00.280 --> 27:01.680\n sick of incompetence.\n\n27:01.680 --> 27:05.160\n Yeah, but I called for revolt the other day on Joe Rogan.\n\n27:05.160 --> 27:06.480\n People found it quixotic.\n\n27:06.480 --> 27:11.160\n Well, because I think you're not, I think revolt is different.\n\n27:11.160 --> 27:16.160\n I think that's like, okay, I'm really angry. I'm, I'm furious.\n\n27:16.680 --> 27:21.080\n I cannot stand that this is my country at the moment. I'm embarrassed.\n\n27:21.080 --> 27:24.880\n So let's build a better one. Yeah. Right. That's the, I'm in.\n\n27:25.880 --> 27:30.320\n Okay. So, well, okay, so let's take over a few universities.\n\n27:30.320 --> 27:34.120\n Let's start running a different experiment at some of our better universities.\n\n27:34.120 --> 27:36.720\n Like when I did this experiment and I said, what,\n\n27:36.720 --> 27:41.240\n at this, if this were 40 years ago, the median age,\n\n27:41.240 --> 27:46.240\n I believe of a university president was 51 that would have the person in gen X\n\n27:46.840 --> 27:49.920\n and we'd have a bunch of millennial presidents, a bunch of, you know,\n\n27:50.280 --> 27:55.280\n more than half gen X it's almost 100% baby boom at this point.\n\n27:56.680 --> 27:58.280\n Um, and how did that happen?\n\n27:58.520 --> 28:00.720\n We can get into how they changed retirement,\n\n28:00.880 --> 28:04.880\n but this generation of people are not going to be able to do that.\n\n28:04.880 --> 28:09.880\n But this generation above us does not feel for even even the older generous\n\n28:12.920 --> 28:16.320\n silent generous. I had Roger Penrose on my program.\n\n28:16.800 --> 28:19.520\n Excellent. And I thank you. I really appreciate that.\n\n28:19.800 --> 28:22.840\n And I asked him a question that was very important to me. I said, look,\n\n28:22.840 --> 28:23.960\n you're in your late eighties.\n\n28:24.880 --> 28:28.600\n Is there anyone you could point to as a successor that we should be watching?\n\n28:28.640 --> 28:30.440\n We can get excited. You know, I said,\n\n28:31.000 --> 28:33.440\n here's an opportunity to pass the baton and he said, well, let me,\n\n28:33.440 --> 28:35.840\n let me hold off on that. It was like, Oh,\n\n28:36.360 --> 28:40.480\n is it ever the right moment to point to somebody younger than you to keep your\n\n28:40.480 --> 28:43.760\n flame alive after you're gone? And also like, I don't know whether,\n\n28:44.080 --> 28:45.280\n I'm just going to admit to this.\n\n28:45.280 --> 28:48.960\n People treat me like I'm crazy for caring about the world after I'm dead\n\n28:51.160 --> 28:53.600\n or wanting to be remembered after you're gone. Like, well,\n\n28:53.600 --> 28:54.960\n what does it matter to you? You're gone.\n\n28:55.040 --> 29:00.040\n It's this deeply sort of secular somatic perspective on everything where we\n\n29:00.040 --> 29:04.120\n don't, you know, that phrase in a, as time goes by,\n\n29:04.520 --> 29:09.560\n it says it's still the same old story, a fight for love and glory,\n\n29:10.040 --> 29:11.960\n a case of do or die.\n\n29:13.040 --> 29:18.040\n I don't think people imagined then that there wouldn't be a story about\n\n29:18.760 --> 29:20.160\n fighting for love and glory.\n\n29:20.160 --> 29:25.080\n And like we are so out of practice about fighting, you know,\n\n29:25.080 --> 29:30.080\n rivals for love and and and and fighting for glory and something bigger than\n\n29:31.080 --> 29:31.920\n yourself.\n\n29:34.320 --> 29:35.440\n But the hunger is there.\n\n29:35.920 --> 29:39.040\n Well, that was the point then, right? The whole idea is that Rick was,\n\n29:39.520 --> 29:42.280\n you know, it was like Han Solo of his time. He's just like,\n\n29:42.760 --> 29:45.880\n I stick my neck out for nobody. You know, it's like, Oh, come on, Rick,\n\n29:46.240 --> 29:49.040\n you're just pretending you actually have a big soul. Right.\n\n29:49.320 --> 29:53.120\n And so at some level, that's the question. Do we have a big soul or is it just\n\n29:53.120 --> 29:53.960\n all bullshit?\n\n29:53.960 --> 29:58.960\n So yeah, I think, I think there's huge Manhattan project style projects,\n\n29:59.320 --> 30:03.360\n whether you talk about physical infrastructure or going to Mars, you know,\n\n30:03.360 --> 30:08.200\n the SpaceX NASA efforts or huge,\n\n30:08.880 --> 30:10.040\n huge scientific efforts.\n\n30:10.040 --> 30:10.200\n Well,\n\n30:10.200 --> 30:13.360\n we need to get back into the institutions and we need to remove the weak\n\n30:13.360 --> 30:17.040\n leadership that we have weak leaders and the weak leaders need to be removed and\n\n30:17.040 --> 30:21.000\n they need to seat people more dangerous than the people who are currently sitting\n\n30:21.000 --> 30:21.960\n in a lot of those chairs.\n\n30:21.960 --> 30:26.240\n Yeah. Or build new institutions. Good luck. Well,\n\n30:27.080 --> 30:29.960\n so one of the nice things of, uh,\n\n30:30.440 --> 30:32.240\n from the internet is for example,\n\n30:32.240 --> 30:37.240\n somebody like you can have a bigger voice than almost anybody at the particular\n\n30:38.440 --> 30:39.800\n institutions we're talking about.\n\n30:39.920 --> 30:42.760\n That's true. But the thing is I might say something.\n\n30:43.560 --> 30:45.920\n You can count on the fact that the, you know,\n\n30:46.000 --> 30:48.200\n provost at Princeton isn't going to say anything.\n\n30:48.200 --> 30:51.320\n Yeah. What do you mean to, to afraid?\n\n30:51.440 --> 30:54.000\n Well, if that person were to give an interview,\n\n30:55.120 --> 30:58.520\n how are things going in research at Princeton? Well,\n\n30:58.840 --> 30:59.920\n I'm hesitant to say it,\n\n30:59.920 --> 31:03.120\n but they're perhaps as good as they've ever been and I think they're going to\n\n31:03.120 --> 31:07.920\n get better. Oh, is that right? All fields? Yep. I don't see a weak one.\n\n31:08.440 --> 31:12.920\n It's just like, okay, great. Who are you and what are you even saying?\n\n31:14.600 --> 31:17.000\n We're just used to total nonsense. 24 seven.\n\n31:17.000 --> 31:17.840\n Yeah.\n\n31:18.360 --> 31:22.920\n What do you think might be a beautiful thing that comes out of this?\n\n31:23.360 --> 31:27.280\n Like what is there a hope that like a little inkling,\n\n31:27.440 --> 31:30.160\n a little fire of hope you have about our time right now?\n\n31:31.320 --> 31:31.720\n Yeah.\n\n31:31.720 --> 31:36.080\n I think one thing is coming to understand that the freaks, weirdos,\n\n31:36.080 --> 31:39.520\n mutants, and other, uh,\n\n31:39.560 --> 31:43.240\n near do wells, uh, sometimes referred to as grifters. I like that one.\n\n31:43.240 --> 31:48.240\n Grifters, uh, and gadflies were very often the earliest people on the coronavirus.\n\n31:51.560 --> 31:53.600\n That's a really interesting question. Why was that?\n\n31:54.120 --> 31:59.120\n And it seems to be that they had already paid such a social price that they\n\n32:00.800 --> 32:05.440\n weren't going to be beaten up by being, um,\n\n32:05.760 --> 32:09.960\n told that, Oh my God, you're xenophobic. You just hate China, you know,\n\n32:09.960 --> 32:13.720\n or wow, you sound like a conspiracy theorist. Um,\n\n32:14.360 --> 32:17.240\n so if you'd already paid those prices, you were free to think about this.\n\n32:17.240 --> 32:21.720\n And everyone in an institutional framework was terrified that they didn't want\n\n32:21.720 --> 32:26.080\n to be seen as the alarmist, the, um,\n\n32:26.200 --> 32:30.560\n chicken little. And so that's why you have this confidence where, you know,\n\n32:30.880 --> 32:34.320\n the Blasio says, you know, get on with your lives,\n\n32:34.320 --> 32:37.920\n get back in there and celebrate Chinese new year in Chinatown.\n\n32:37.920 --> 32:41.040\n Uh, despite coronavirus, it's like, okay, really?\n\n32:41.040 --> 32:44.960\n So you just always thought everything would automatically be okay if you,\n\n32:44.960 --> 32:48.400\n if you adapted, sorry, if you adopted that posture.\n\n32:49.000 --> 32:50.120\n So you think, uh,\n\n32:50.160 --> 32:55.160\n this time reveals the weakness of our institutions and reveals the strength of\n\n32:55.180 --> 32:58.000\n our gadflies and the weirdos and the.\n\n32:58.080 --> 33:02.240\n No, not necessarily the strength, but the, the, the value of freedom,\n\n33:02.280 --> 33:04.920\n like a different way of saying it would be, wow,\n\n33:04.920 --> 33:09.120\n even your gadflies and your grifters were able to beat your institutional folks\n\n33:09.120 --> 33:13.080\n because your institutional folks were playing with a giant mental handicap.\n\n33:13.800 --> 33:18.800\n So just imagine like we were in the story of Harrison Bergeron by Vonnegut and\n\n33:18.800 --> 33:23.440\n our smartest people were all subjected to, uh,\n\n33:23.480 --> 33:26.640\n distracting noises every seven seconds. Well,\n\n33:27.520 --> 33:31.800\n they would be functionally much dumber because they couldn't continue a thought\n\n33:31.800 --> 33:33.080\n through all the disturbance.\n\n33:33.080 --> 33:37.200\n So in some sense, that's a little bit like what belonging to an institution is,\n\n33:37.200 --> 33:39.080\n is that if you have to make a public statement,\n\n33:39.080 --> 33:42.800\n of course the surgeon general is going to be the worst because they're,\n\n33:42.800 --> 33:44.400\n they're just playing with too much of a handicap.\n\n33:44.400 --> 33:47.320\n There are too many institutional players are like, don't screw us up.\n\n33:48.160 --> 33:50.000\n And so the person has to say something wrong.\n\n33:50.040 --> 33:54.440\n We're going to back propagate a falsehood. And this is very interesting.\n\n33:54.440 --> 33:57.640\n Some of my socially oriented friends say, Eric,\n\n33:57.680 --> 34:00.000\n I don't understand what you're on about. Of course masks work,\n\n34:00.000 --> 34:01.320\n but you know what they're trying to do.\n\n34:01.320 --> 34:05.520\n They're trying to get us not to buy up the masks for the doctors. And I think,\n\n34:05.520 --> 34:05.840\n okay,\n\n34:05.840 --> 34:10.840\n so you imagine that we can just create scientific fiction at will so that you can\n\n34:10.840 --> 34:13.960\n run whatever social program you want. This is what I, you know,\n\n34:13.960 --> 34:16.240\n my point is get out of my lab, get out of the lab.\n\n34:16.360 --> 34:18.840\n You don't belong in the lab. You're not meant for the lab.\n\n34:19.040 --> 34:21.880\n You're constitutionally incapable of being around the lab.\n\n34:21.960 --> 34:23.320\n You need to leave the lab.\n\n34:23.760 --> 34:28.760\n You think the CDC and WHO knew that masks work and we're trying to,\n\n34:28.760 --> 34:33.760\n and we're trying to sort of imagine that people are kind of stupid and they would\n\n34:34.800 --> 34:39.440\n buy masks in excess if they were told that masks work.\n\n34:39.960 --> 34:41.160\n Is that like, uh,\n\n34:42.400 --> 34:47.400\n cause this does seem to be a particularly clear example of mistakes made.\n\n34:48.880 --> 34:53.440\n You're asking me this question. No, you're not. What do you think, Lex?\n\n34:53.440 --> 34:58.120\n Well, I actually probably disagree with you a little bit. Great. Let's do it.\n\n34:58.120 --> 35:03.120\n I think it's not so easy to be honest with the populace when the danger of\n\n35:04.800 --> 35:07.200\n panic is always around the corner.\n\n35:08.000 --> 35:13.000\n So I think the kind of honesty you exhibit appeals to a certain class of brave\n\n35:18.640 --> 35:22.960\n intellectual minds that, uh, it appeals to me,\n\n35:22.960 --> 35:26.760\n but I don't know from the perspective of WHO,\n\n35:26.800 --> 35:30.800\n I don't know if it's so obvious that they should,\n\n35:32.240 --> 35:36.680\n um, be honest 100% of the time with people.\n\n35:37.440 --> 35:41.000\n I'm not saying you should be perfectly transparent and 100% honest.\n\n35:41.040 --> 35:44.920\n I'm saying that the quality of your lies has to be very high and it has to be\n\n35:44.920 --> 35:48.960\n public spirited. There's a big difference between, so I'm not,\n\n35:49.040 --> 35:52.400\n I'm not a child about this. I'm not saying that when you're at war,\n\n35:52.400 --> 35:53.000\n for example,\n\n35:53.000 --> 35:57.200\n you turn over all of your plans to the enemy because it's important that you're\n\n35:57.200 --> 36:00.840\n transparent with 360 degree visibility. Far from it.\n\n36:01.120 --> 36:06.120\n What I'm saying is something has been forgotten and I forgot who it was who\n\n36:06.120 --> 36:06.880\n told it to me,\n\n36:06.880 --> 36:11.880\n but it was a fellow graduate student in the Harvard math department and he said,\n\n36:12.960 --> 36:13.240\n you know,\n\n36:13.240 --> 36:16.400\n I learned one thing being out in the workforce because he was one of the few\n\n36:16.400 --> 36:20.840\n people who had had a work life in the department as a grad student.\n\n36:20.840 --> 36:23.800\n And he said, you can be friends with your boss,\n\n36:24.400 --> 36:26.040\n but if you're going to be friends with your boss,\n\n36:26.080 --> 36:27.800\n you have to be doing a good job at work.\n\n36:29.760 --> 36:32.280\n And there's an analog here,\n\n36:32.320 --> 36:36.120\n which is if you're going to be reasonably honest with the population,\n\n36:36.760 --> 36:40.160\n you have to be doing a good job at work as the surgeon general or as the head of\n\n36:40.160 --> 36:43.400\n the CDC. So if you're doing a terrible job,\n\n36:44.760 --> 36:45.920\n you're supposed to resign.\n\n36:45.920 --> 36:50.240\n And then the next person is supposed to say, look,\n\n36:50.320 --> 36:53.320\n I'm not going to lie to you. I inherited the situation.\n\n36:53.320 --> 36:54.600\n It was in a bit of disarray.\n\n36:55.800 --> 36:59.160\n But I had several requirements before I agreed to step in and take the job\n\n36:59.160 --> 37:00.800\n because I needed to know I could turn it around.\n\n37:00.800 --> 37:02.800\n I needed to know that I had clear lines of authority.\n\n37:03.040 --> 37:06.240\n I needed to know that I had the resources available in order to rectify the\n\n37:06.240 --> 37:06.840\n problem.\n\n37:06.840 --> 37:09.520\n And I needed to know that I had the ability and the freedom to level with the\n\n37:09.520 --> 37:12.840\n American people directly as I saw fit. All of my wishes were granted.\n\n37:12.840 --> 37:17.280\n And that's why I'm happy here on Monday morning. I've got my sleeves rolled up.\n\n37:17.280 --> 37:18.560\n Boy, do we got a lot to do.\n\n37:18.560 --> 37:21.320\n So please come back in two weeks and then ask me how I'm doing then.\n\n37:21.320 --> 37:24.000\n And I hope to have something to show you. That's how you do it.\n\n37:24.680 --> 37:29.360\n So why is that excellence and basic competence\n\n37:29.400 --> 37:30.240\n missing?\n\n37:31.000 --> 37:32.360\n The big net. You see,\n\n37:32.680 --> 37:36.880\n you come from multiple traditions where it was very important to remember\n\n37:36.880 --> 37:37.720\n things.\n\n37:38.040 --> 37:42.440\n The Soviet tradition made sure that you remembered the sacrifices that came in\n\n37:42.440 --> 37:47.280\n that war and the Jewish tradition we're doing this on Passover,\n\n37:47.280 --> 37:52.280\n right? Okay. Well, every year we tell one simple story.\n\n37:52.440 --> 37:54.080\n Well, why can't it be different every year?\n\n37:54.080 --> 37:58.320\n Maybe we could have a rotating series of seven stories because it's the one\n\n37:58.320 --> 38:02.640\n story that you need. It's like, you know, you work with the men in black group,\n\n38:02.640 --> 38:04.520\n right? And it's the last suit that you'll ever need.\n\n38:04.680 --> 38:06.480\n This is the last story that you ever need.\n\n38:06.520 --> 38:10.440\n Don't think I fell for your neuralyzer last time.\n\n38:10.440 --> 38:14.960\n In any event, we tell one story because it's the,\n\n38:14.960 --> 38:16.080\n get out of Dodge story.\n\n38:16.080 --> 38:19.720\n There's a time when you need to not wait for the bread to rise.\n\n38:19.760 --> 38:24.120\n And that's the thing, which is even if you live through a great nap,\n\n38:24.880 --> 38:29.600\n you deserve to know what it feels like to have to leave everything that has\n\n38:29.600 --> 38:32.080\n become comfortable and, and unworkable.\n\n38:33.760 --> 38:37.800\n It's sad that you need, you need that tragedy.\n\n38:37.800 --> 38:41.520\n I imagine to have the tradition of remembering\n\n38:42.840 --> 38:47.280\n it's, it's sad to to think that because things have been\n\n38:47.640 --> 38:52.360\n nice and comfortable means that we can't have great competent leaders,\n\n38:54.120 --> 38:55.600\n which is kind of the implied statement.\n\n38:55.600 --> 39:00.400\n Like, can we have great leaders who take big risks,\n\n39:00.400 --> 39:03.560\n who are, who inspire hard work,\n\n39:03.560 --> 39:07.360\n who deal with difficult truth, even though things have been comfortable?\n\n39:08.480 --> 39:12.320\n Well, we know what those people sound like. I mean, you know, if,\n\n39:12.320 --> 39:15.960\n for example, Jaco Willink suddenly threw his hat into the ring,\n\n39:17.720 --> 39:21.800\n everyone would say, okay, right.\n\n39:21.800 --> 39:26.040\n Party's over. It's time to get up at four 30 and really work hard.\n\n39:26.040 --> 39:30.640\n And we've got to get back into fighting shape. And yeah,\n\n39:30.640 --> 39:34.640\n but Jaco is a very special, I think,\n\n39:34.640 --> 39:39.640\n that whole group of people by profession,\n\n39:39.800 --> 39:43.560\n put themselves in the way of, and into hardship on a daily basis.\n\n39:44.200 --> 39:47.080\n And he's not, I don't, well, I don't know,\n\n39:47.120 --> 39:52.120\n but he's probably not going to be, well, could Jaco be president?\n\n39:52.680 --> 39:55.120\n Okay. But it doesn't have to be Jaco, right? Like in other words,\n\n39:55.120 --> 39:59.840\n if it was Kai Lenny or if it was Alex\n\n39:59.840 --> 40:03.840\n Honnold from rock climbing, right. But they're just serious people.\n\n40:04.480 --> 40:09.480\n They're serious people who can't afford your BS.\n\n40:10.440 --> 40:10.600\n Yeah.\n\n40:10.600 --> 40:15.600\n But why do we have serious people that do rock climbing and uh,\n\n40:16.440 --> 40:20.760\n don't have serious people who lead the nation? That seems to.\n\n40:20.760 --> 40:21.680\n Because that was a,\n\n40:22.360 --> 40:27.360\n those skills needed in rock climbing are not good during the big nap.\n\n40:27.360 --> 40:29.480\n And at the tail end of the big nap, they would get you fired.\n\n40:29.720 --> 40:30.560\n But I don't,\n\n40:30.560 --> 40:35.040\n don't you think there's a fundamental part of human nature that desires to,\n\n40:35.040 --> 40:37.920\n to excel, to be exceptionally good at your job?\n\n40:38.400 --> 40:42.000\n Yeah. But what is your job? I mean, in other words, my, my,\n\n40:42.040 --> 40:44.040\n my point to you is if you,\n\n40:44.040 --> 40:48.040\n if you're a general in a peacetime army and your major activity is playing war\n\n40:48.040 --> 40:48.880\n games,\n\n40:50.200 --> 40:54.200\n what if the skills needed to win war games are very different than the skills\n\n40:54.200 --> 40:57.560\n needed to win wars? Because you know how the war games are scored and you've,\n\n40:57.800 --> 41:00.840\n you've done money ball, for example, with war games,\n\n41:01.320 --> 41:03.200\n you figured out how to win games on paper.\n\n41:03.720 --> 41:08.720\n So then the advancement skill becomes divergent from the, uh,\n\n41:08.760 --> 41:11.520\n ultimate skill that it was proxying for.\n\n41:12.320 --> 41:16.760\n Yeah. But you create this, we're good as human beings to, I mean,\n\n41:16.760 --> 41:19.520\n I, at least me, I can't do a big nap.\n\n41:20.000 --> 41:22.600\n So at any one moment when I finish something,\n\n41:22.600 --> 41:25.320\n a new dream pops up. So going to Mars,\n\n41:25.800 --> 41:28.480\n what do you like to do? You like to do Brazilian jujitsu?\n\n41:28.960 --> 41:31.600\n Well, first of all, I like to do every, you like to play guitar,\n\n41:31.680 --> 41:35.200\n guitar, you do this podcast, you do theory. You're always,\n\n41:35.320 --> 41:39.840\n you're constantly taking risks and exposing yourself. Right? Why?\n\n41:40.400 --> 41:43.360\n Because you've got one of those crazy, I'm sorry to say it.\n\n41:43.360 --> 41:46.960\n You've got an Eastern European Jewish personality, which I'm still tied to,\n\n41:47.240 --> 41:51.040\n and I'm a couple of generations more distant than you are.\n\n41:51.040 --> 41:54.280\n And I've held on to that thing because it's valuable to me.\n\n41:54.760 --> 41:57.600\n You don't think there's a huge percent of the populace,\n\n41:58.000 --> 42:01.720\n even in the United States. That's that's that might be a little bit dormant,\n\n42:01.760 --> 42:05.680\n but do you know Anna Hatchian from the red scare podcast?\n\n42:06.080 --> 42:09.480\n Did you interview her? Yeah. Yeah, yeah, yeah. I listened. Yeah, yeah, she was great.\n\n42:09.480 --> 42:12.520\n She was great, right? Yeah. She's fun. She's, she's terrific.\n\n42:12.560 --> 42:14.280\n But she also has the same thing going on.\n\n42:14.280 --> 42:17.360\n And I made a joke in the liner notes for that episode,\n\n42:17.360 --> 42:22.360\n which is somewhere on the road from Stalingrad to forever 21,\n\n42:22.360 --> 42:26.120\n something was lost. Like how can Stalingrad and forever 21 be in the same\n\n42:26.120 --> 42:30.480\n sentence? And, you know, in part it's that weird thing.\n\n42:30.480 --> 42:35.000\n It's like trying to remember even words like I'm in Russian and Hebrew things,\n\n42:35.000 --> 42:38.200\n like it's like what pom yet then the score, you know,\n\n42:38.200 --> 42:43.200\n these words have much more potency about memory and I don't know.\n\n42:43.200 --> 42:48.200\n I do, I think, I think there's still a dormant populace that craves leaders on a\n\n42:53.080 --> 42:54.560\n small scale and large scale.\n\n42:55.160 --> 42:58.640\n And I hope to be that leader on a small scale.\n\n42:58.840 --> 43:03.280\n And I think you sir have a role to be a leader.\n\n43:04.480 --> 43:06.680\n You kids go ahead without me. I'm just gonna,\n\n43:07.160 --> 43:08.760\n I'm going to do a little bit of weird podcast.\n\n43:08.760 --> 43:13.080\n I see now you're, you're putting on your, uh, Joe Rogan hat.\n\n43:14.040 --> 43:17.000\n Uh, he says, I'm just a comedian. Oh no, I'm not saying I'm just a,\n\n43:17.000 --> 43:21.760\n it's not that if I say I want to lead too much because of the big nap,\n\n43:21.800 --> 43:26.160\n there's like a group, a chorus of automated idiots and their first thought is\n\n43:26.160 --> 43:30.560\n like, ah, I knew it. So it's a power grab all along. Why should you lead?\n\n43:30.560 --> 43:31.400\n You know, it's just like,\n\n43:31.760 --> 43:34.400\n and so the idea is you're just trying to skirt around,\n\n43:34.400 --> 43:38.280\n not stepping on all of the idiot landmines. It's like, okay,\n\n43:38.280 --> 43:40.720\n so now I'm going to hear that in my inbox for the next three days.\n\n43:41.120 --> 43:45.200\n Okay. So lead by example, just live. No, I mean, the issue platform, look,\n\n43:45.240 --> 43:47.920\n we should take over the institutions. There are institutions.\n\n43:47.960 --> 43:49.080\n We've got bad leadership.\n\n43:49.120 --> 43:53.080\n We should mutiny and we should inject a, I don't know,\n\n43:53.120 --> 43:57.360\n 15% 20% uh, disagreeable, dissident,\n\n43:57.360 --> 44:00.520\n very aggressive loner, individual mutant freaks,\n\n44:00.760 --> 44:04.280\n all the people that you go to see Avengers movies about or the X men or whatever\n\n44:04.280 --> 44:09.280\n it is and stop pretending that everything good comes out of some great giant\n\n44:09.320 --> 44:13.720\n inclusive, communal, uh, 12 hour meeting.\n\n44:14.720 --> 44:17.960\n It's like, stop it. That's not how shit happens.\n\n44:19.560 --> 44:24.560\n You recently published the video of a lecture you gave at Oxford presenting\n\n44:24.880 --> 44:26.680\n some aspects of a theory, uh,\n\n44:27.600 --> 44:29.840\n theory of everything called geometric unity.\n\n44:29.840 --> 44:33.960\n So this was a work of 30, 30 plus years.\n\n44:34.440 --> 44:35.600\n This is life's work.\n\n44:37.000 --> 44:39.680\n Let me ask her the, the silly old question.\n\n44:40.000 --> 44:43.840\n How do you feel as a human? Excited, scared,\n\n44:44.160 --> 44:46.160\n the experience of posting it.\n\n44:47.200 --> 44:49.320\n You know, it's funny. One of the, one of the things that you,\n\n44:49.360 --> 44:53.760\n you learn to feel as an academic is, um,\n\n44:53.800 --> 44:57.720\n the great sins you can commit in academics, uh,\n\n44:57.720 --> 45:01.720\n is to show yourself to be a non serious person to show yourself to have\n\n45:01.720 --> 45:02.560\n delusions,\n\n45:03.800 --> 45:07.880\n to avoid the standard practices,\n\n45:07.920 --> 45:10.320\n which everyone has signed up for.\n\n45:12.400 --> 45:14.560\n And you know,\n\n45:14.560 --> 45:18.480\n it's weird because like, you know that those people are going to be angry.\n\n45:19.000 --> 45:23.320\n He did what, you know, why would he do that? And,\n\n45:23.600 --> 45:25.640\n and what we're referring to, for example,\n\n45:25.640 --> 45:28.440\n there's traditions of sort of publishing incrementally,\n\n45:29.000 --> 45:31.560\n certainly not trying to have a theory of everything,\n\n45:32.520 --> 45:37.200\n perhaps working within the academic departments, all those things.\n\n45:37.200 --> 45:41.000\n So that's true. And so you're going outside of all of that.\n\n45:41.480 --> 45:46.480\n Well, I mean, I was going inside of all of that and we did not come to terms\n\n45:47.000 --> 45:52.000\n when I was inside and what they did was so outside to me was so weird,\n\n45:52.000 --> 45:57.000\n so freakish, like the most senior, respectable people at the most senior,\n\n45:57.040 --> 46:01.000\n respectable places were functionally insane as far as I could tell.\n\n46:01.600 --> 46:03.760\n And again, it's like being functionally stupid.\n\n46:03.760 --> 46:07.680\n If you're the head of the CDC or something where, you know,\n\n46:07.680 --> 46:10.600\n you're giving recommendations out that aren't based on what you actually\n\n46:10.600 --> 46:13.680\n believe. They're based on what you think you have to be doing. Well,\n\n46:13.680 --> 46:14.520\n in some sense,\n\n46:14.520 --> 46:18.680\n I think that that's a lot of how I saw the math and physics world as\n\n46:18.680 --> 46:22.680\n the physics world was really crazy and the math world was considerably less\n\n46:22.680 --> 46:25.160\n crazy, just very strict and kind of dogmatic.\n\n46:25.880 --> 46:27.920\n Well, we'll psychoanalyze those folks,\n\n46:27.960 --> 46:32.960\n but I really want to maybe linger on it a little bit longer of how you feel\n\n46:33.520 --> 46:36.520\n because yeah, so this is such a, such a special moment in your life.\n\n46:36.560 --> 46:38.240\n I really appreciate it. It's a great question.\n\n46:38.280 --> 46:43.280\n So that if we can pair off some of that other, those other issues. Um,\n\n46:43.280 --> 46:48.280\n it's new being able to say what the observers is,\n\n46:49.400 --> 46:53.400\n which was my attempt to replace space time with something that is both closely\n\n46:53.400 --> 46:57.200\n related to space, time and not space time. Um,\n\n46:57.240 --> 47:02.240\n so I used to carry the number 14 as a closely guarded secret in my life and uh,\n\n47:03.280 --> 47:08.280\n we're 14 is really four dimensions of space and time plus 10.\n\n47:08.280 --> 47:13.280\n Extra dimensions of rulers and protractors or for the cool kids out there,\n\n47:13.560 --> 47:15.120\n uh, symmetric two tensors.\n\n47:16.120 --> 47:17.880\n She had a geometric,\n\n47:18.160 --> 47:22.120\n a complicated, beautiful geometric view of the world that you cared with you\n\n47:22.120 --> 47:24.240\n for a long time. Yeah. Did you,\n\n47:24.240 --> 47:28.440\n did you have friends that you, um, colleagues, essentially? No.\n\n47:28.920 --> 47:33.120\n Talked. No. In fact, part of these, part of some of these stories are me,\n\n47:33.120 --> 47:34.160\n coming out of the world,\n\n47:34.160 --> 47:39.160\n to my friends, um, and I use the phrase coming out because I think that gays\n\n47:39.160 --> 47:41.200\n have monopolized the concept of the closet.\n\n47:41.920 --> 47:45.680\n Many of us are in closets having nothing to do with our sexual orientation.\n\n47:46.160 --> 47:50.600\n Um, yeah, I didn't really feel comfortable talking to almost anyone.\n\n47:50.640 --> 47:54.200\n So this was a closely guarded, uh, secret.\n\n47:54.320 --> 47:58.280\n And I think that I let on in some ways that I was up to something and probably\n\n47:58.280 --> 48:02.720\n I was, I was, I was, I was, I was, I was, I was, I was, I was, I was,\n\n48:02.720 --> 48:07.040\n I was up to something and probably, but it was a very weird life. So I had to,\n\n48:07.040 --> 48:10.960\n I had to have a series of things that I pretended to care about so that I could\n\n48:11.280 --> 48:14.640\n use that as the stalking horse for what I really cared about. And to your point,\n\n48:15.560 --> 48:19.080\n um, I never understood this whole thing about theories of everything.\n\n48:19.160 --> 48:22.000\n Like if you were going to go into something like theoretical physics,\n\n48:22.840 --> 48:25.320\n isn't that what you would normally pursue?\n\n48:25.480 --> 48:29.720\n Like wouldn't it be crazy to do something that difficult and that poorly paid if\n\n48:29.720 --> 48:33.000\n you were going to try to do something other than figure out what this is all\n\n48:33.000 --> 48:33.840\n about?\n\n48:34.400 --> 48:36.080\n Now I have to reveal my cards,\n\n48:36.160 --> 48:41.160\n my sort of weaknesses and lack and understanding of the music of physics and\n\n48:41.360 --> 48:42.240\n math departments.\n\n48:42.800 --> 48:47.800\n But there's an analogy here to artificial intelligence and often folks come in\n\n48:49.680 --> 48:50.920\n and say, okay,\n\n48:50.920 --> 48:55.320\n so there's a giant department working on quote unquote artificial intelligence,\n\n48:55.320 --> 48:59.960\n right? But why is nobody actually working on intelligence?\n\n49:00.560 --> 49:04.520\n Like you're all just building little toys, right?\n\n49:04.560 --> 49:08.680\n You're not actually trying to understand. And that breaks a lot of people. Uh,\n\n49:08.760 --> 49:13.440\n they, it confuses them because like, okay, so I'm at MIT,\n\n49:13.440 --> 49:16.400\n I'm at Stanford, I'm at Harvard, I'm here.\n\n49:16.400 --> 49:19.240\n I dreamed of being working on artificial intelligence.\n\n49:20.000 --> 49:23.200\n Why is everybody not actually working on intelligence?\n\n49:23.200 --> 49:27.280\n And I have the same kind of sense that that's what working on the theory of\n\n49:27.280 --> 49:32.280\n everything is that strangely you somehow become an outcast for even,\n\n49:33.040 --> 49:38.440\n but we know why this is right. Why? Well, it's because let's take the artificial,\n\n49:38.480 --> 49:40.080\n let's, let's play with AGI for example.\n\n49:41.200 --> 49:45.560\n I think that the idea starts off with nobody really knows how to work on that.\n\n49:45.760 --> 49:47.560\n And so if we don't know how to work on it,\n\n49:48.160 --> 49:52.920\n we choose instead to work on a program that is tangentially related to it.\n\n49:52.920 --> 49:57.920\n So we do a component of a program that is related to that big question because\n\n49:58.040 --> 50:00.680\n it's felt like at least I can make progress there.\n\n50:02.240 --> 50:05.280\n And that wasn't where I was, where I was in,\n\n50:06.600 --> 50:10.040\n it's funny there was this book of a called Frieden Uhlenbeck and it had this\n\n50:10.040 --> 50:12.600\n weird mysterious line in the beginning of it.\n\n50:13.320 --> 50:17.920\n And I tried to get clarification of this weird mysterious line and everyone said\n\n50:17.920 --> 50:20.440\n wrong things. And then I said, okay, well,\n\n50:20.440 --> 50:24.520\n so I can tell that nobody's thinking properly because I just asked the entire\n\n50:24.520 --> 50:28.600\n department and nobody has a correct interpretation of this.\n\n50:29.320 --> 50:33.000\n And so, you know, it's a little bit like you see a crime scene photo\n\n50:33.880 --> 50:36.040\n and you have a different idea.\n\n50:36.040 --> 50:39.400\n Like there's a smoking gun and you figure that's actually a cigarette lighter.\n\n50:39.400 --> 50:43.320\n I don't really believe that. And then there's like a pack of cards and you think,\n\n50:43.320 --> 50:43.680\n Oh,\n\n50:43.680 --> 50:47.360\n that looks like the blunt instrument that the person was beaten with. You know,\n\n50:47.360 --> 50:50.560\n so you have a very different idea about how things go.\n\n50:50.560 --> 50:54.000\n And very quickly you realize that there's no one thinking about that.\n\n50:55.440 --> 50:58.480\n There's a few human sides to this and technical sides,\n\n50:58.480 --> 51:02.720\n both of which I'd love to try to get down to. So the human side,\n\n51:03.120 --> 51:08.000\n I can tell from my perspective, I think it was before April 1st, April Fools,\n\n51:08.320 --> 51:09.760\n maybe the day before, I forget,\n\n51:10.000 --> 51:15.000\n but I was laying in bed in the middle of the night and somehow it popped up,\n\n51:15.000 --> 51:20.000\n you know on my feed somewhere that your beautiful face is speaking live and I\n\n51:23.560 --> 51:26.840\n clicked. And you know,\n\n51:26.840 --> 51:29.960\n it's kind of weird how the universe just brings things together in this kind of\n\n51:29.960 --> 51:30.800\n way.\n\n51:30.880 --> 51:34.720\n And all of a sudden I realized that there's something big happening at this\n\n51:34.720 --> 51:38.400\n particular moment. It's strange. On a day,\n\n51:38.400 --> 51:42.840\n like any day and all of a sudden you were thinking of,\n\n51:42.840 --> 51:46.640\n you had this somber tone, like you were serious,\n\n51:46.640 --> 51:51.640\n like you were going through some difficult decision and it seems strange.\n\n51:54.000 --> 51:55.760\n I almost thought you were maybe joking,\n\n51:56.080 --> 51:59.520\n but there was a serious decision being made and it was a wonderful experience\n\n51:59.520 --> 52:00.360\n to go through with you.\n\n52:00.640 --> 52:02.600\n I really appreciate it. I mean it was April 1st.\n\n52:03.000 --> 52:05.880\n Yeah, it was, it's kind of fascinating. I mean it's just the whole experience.\n\n52:05.880 --> 52:10.720\n And so I want to ask,\n\n52:10.720 --> 52:14.760\n I mean thank you for letting me be part of that kind of journey of decision\n\n52:14.760 --> 52:19.080\n making that took 30 years, but why now?\n\n52:19.560 --> 52:20.720\n Why did you think,\n\n52:21.240 --> 52:26.240\n why did you struggle so long not to release it and decide to release it now?\n\n52:28.360 --> 52:32.320\n While the whole world is on lockdown on April Fools,\n\n52:32.360 --> 52:37.360\n is it just because you like the comedy of absurd ways that the universe comes\n\n52:38.120 --> 52:38.960\n together?\n\n52:38.960 --> 52:40.320\n I don't think so.\n\n52:40.880 --> 52:45.280\n I think that the COVID epidemic is the end of the big nap.\n\n52:46.920 --> 52:51.920\n And I think that I actually tried this seven years earlier in Oxford.\n\n52:53.120 --> 52:55.560\n So I, uh, and it was too early.\n\n52:56.800 --> 52:59.200\n Which part was too, is it the platform?\n\n52:59.200 --> 53:02.480\n Cause your platform is quite different now actually the internet. I remember you,\n\n53:02.480 --> 53:06.840\n uh, I read several of your brilliant answers that people should read for the\n\n53:06.840 --> 53:09.480\n edge questions. One of them was related to the internet.\n\n53:10.320 --> 53:12.880\n And it was the first one. Was it the first one? Yeah.\n\n53:12.880 --> 53:16.720\n An essay called go virtual young man. Yeah. Yeah. That seemed,\n\n53:16.760 --> 53:19.520\n that's like forever ago now. Well that was 10 years ago.\n\n53:19.520 --> 53:22.520\n And that's exactly what I did is I decamped to the internet,\n\n53:22.520 --> 53:25.320\n which is where the portal lives, the portal, the portal, the portal.\n\n53:27.120 --> 53:30.600\n Well, so the whole, the theme, that's the ominous theme music,\n\n53:30.600 --> 53:32.720\n which you just listened to forever.\n\n53:32.720 --> 53:36.920\n I actually started recording a tiny guitar licks, uh,\n\n53:36.920 --> 53:40.000\n for the audio portion, not for the video portion. Um,\n\n53:40.400 --> 53:43.560\n you've kind of inspired me with bringing your guitar into the story,\n\n53:43.560 --> 53:44.400\n but keep going.\n\n53:45.200 --> 53:48.400\n So you thought, so the Oxford was like step one and you kind of,\n\n53:48.640 --> 53:52.240\n you put your foot into the, in the water to sample it,\n\n53:52.640 --> 53:55.600\n but it was too cold at the time. So you didn't want to step in.\n\n53:55.600 --> 53:56.880\n I was just really disappointed.\n\n53:57.440 --> 53:59.320\n What was disappointing about that experience?\n\n53:59.320 --> 54:01.080\n It's very, it's a hard thing to talk about.\n\n54:01.080 --> 54:05.600\n It has to do with the fact that, and I can see this,\n\n54:05.600 --> 54:09.200\n this, you know, this mirrors a disappointment within myself.\n\n54:09.240 --> 54:10.640\n There are two separate issues.\n\n54:10.640 --> 54:15.640\n One is the issue of making sure that the idea is actually heard and explored.\n\n54:16.960 --> 54:18.360\n And the other is the,\n\n54:18.360 --> 54:23.360\n I is the question about will I become disconnected from my work because it will\n\n54:24.400 --> 54:27.520\n be ridiculed. It will, it will be immediately improved.\n\n54:27.520 --> 54:31.320\n It will be found to be derivative of something that occurred in some paper in\n\n54:31.320 --> 54:35.440\n 1957. When the community does not want you to gain a voice,\n\n54:37.040 --> 54:42.040\n it's a little bit like a policeman deciding to weirdly enforce all of these\n\n54:42.720 --> 54:47.160\n little known regulations against you. And you know,\n\n54:47.160 --> 54:50.880\n sometimes nobody else. And I think that's kind of, you know,\n\n54:50.880 --> 54:57.880\n this weird thing where I just don't believe that we can reach the final theory\n\n54:59.520 --> 55:03.240\n necessarily within the political economy of academics.\n\n55:03.800 --> 55:08.400\n So if you think about how academics are tortured by each other and how they're\n\n55:08.400 --> 55:11.200\n paid and where they have freedom and where they don't,\n\n55:11.760 --> 55:15.360\n I actually weirdly think that that system of selective pressures is going to\n\n55:15.360 --> 55:18.000\n eliminate anybody who's going to make real progress.\n\n55:18.400 --> 55:19.200\n So that's interesting.\n\n55:19.200 --> 55:22.440\n So if you look at the story of Andrew Wiles, for example,\n\n55:22.440 --> 55:26.480\n with from our last term, I mean, he,\n\n55:26.480 --> 55:28.240\n as far as I understand,\n\n55:28.240 --> 55:33.160\n he pretty much isolated himself from the world of academics in terms of the big,\n\n55:33.200 --> 55:34.600\n the bulk of the work he did.\n\n55:35.200 --> 55:39.520\n And it from my perspective is dramatic and fun to read about,\n\n55:39.920 --> 55:42.720\n but it seemed exceptionally stressful. The first step he took,\n\n55:43.080 --> 55:47.240\n the first steps he took when actually making the work public that seemed to me\n\n55:47.240 --> 55:51.720\n it would be hell, but it's like so artificially dramatic, you know,\n\n55:51.720 --> 55:54.960\n he leads up to it at a series of lectures.\n\n55:55.560 --> 55:59.760\n He doesn't want to say it. And then he finally says it at the end,\n\n55:59.800 --> 56:02.920\n because obviously this comes out of a body of work where, I mean,\n\n56:02.920 --> 56:06.680\n the funny part about from us last theorem is that wasn't originally thought to\n\n56:06.680 --> 56:08.680\n be a deep and meaningful problem.\n\n56:09.160 --> 56:11.680\n It was just an easy to state one that had gone unsolved.\n\n56:12.400 --> 56:13.960\n But if you think about it,\n\n56:13.960 --> 56:17.080\n it became attached to the body of regular theory.\n\n56:17.600 --> 56:21.280\n So he built up this body of regular theory gets all the way up to the end\n\n56:21.320 --> 56:25.840\n announces. And then like, there's this whole drama about, okay,\n\n56:25.840 --> 56:29.320\n somebody's checking the proof. I don't understand what's going on in line 37,\n\n56:30.040 --> 56:31.680\n you know, and like, Oh, is this serious?\n\n56:31.720 --> 56:33.400\n It seems a little bit more serious than we knew.\n\n56:33.640 --> 56:34.840\n I mean, do you see parallels?\n\n56:35.000 --> 56:38.240\n Do you share the concern that your experience might be something similar?\n\n56:38.280 --> 56:41.040\n Well, in his case, I think that if I recall correctly,\n\n56:41.040 --> 56:42.680\n his original proof was unsalvageable.\n\n56:42.680 --> 56:47.600\n He actually came up with a second proof with a\n\n56:47.600 --> 56:50.120\n colleague, Richard Taylor.\n\n56:50.880 --> 56:53.800\n And it was that second proof which carried the day.\n\n56:53.800 --> 56:58.520\n So it was a little bit that he got put under incredible pressure and then had\n\n56:58.520 --> 57:00.920\n to succeed in a new way, having failed the first time,\n\n57:00.920 --> 57:03.520\n which is like even a weirder and stranger story.\n\n57:03.520 --> 57:06.600\n That's an incredible story in some sense. But I mean, are you,\n\n57:06.880 --> 57:09.600\n I'm trying to get a sense of the kind of stress.\n\n57:09.600 --> 57:14.040\n I think that this is okay, but I'm rejecting what I don't think people\n\n57:14.040 --> 57:16.960\n understand with me is the scale of the critique.\n\n57:18.440 --> 57:21.560\n It's like, I don't, you, people say, well,\n\n57:21.560 --> 57:24.280\n you must implicitly agree with this and implicitly agree. It's like, no,\n\n57:24.280 --> 57:27.080\n try me ask before you,\n\n57:27.160 --> 57:30.880\n you decide that I am mostly in agreement with the community about how these\n\n57:30.880 --> 57:33.560\n things should be handled or what these things mean.\n\n57:33.640 --> 57:37.280\n Can you, can you elaborate? And also just why, um,\n\n57:37.280 --> 57:41.480\n does criticism matter so much here?\n\n57:41.880 --> 57:46.880\n So you seem to dislike the burden of criticism that it will choke away all\n\n57:49.560 --> 57:50.800\n different kinds of criticism.\n\n57:51.320 --> 57:54.360\n There's constructive criticism and there's destructive criticism.\n\n57:54.840 --> 57:59.840\n And what I don't like is I don't like a community that can't,\n\n58:01.640 --> 58:03.760\n first of all, like if you take the physics community,\n\n58:03.760 --> 58:08.680\n like just the way we screwed up on masks and PPE, uh,\n\n58:08.720 --> 58:11.320\n just the way we screwed up in the financial crisis and mortgage backed\n\n58:11.320 --> 58:13.240\n securities, we screwed up on string theory.\n\n58:13.880 --> 58:17.640\n Can we just forget the string theory happened or sure,\n\n58:17.680 --> 58:20.600\n but somebody should say that, right? Somebody should say, you know,\n\n58:20.600 --> 58:24.880\n it didn't work out. Yeah. But okay.\n\n58:24.880 --> 58:25.840\n But you're asking this,\n\n58:25.880 --> 58:30.240\n like why do you guys get to keep the prestige after failing for 35 years?\n\n58:30.240 --> 58:34.000\n Yeah. That's an interesting question. You guys, because to me,\n\n58:34.720 --> 58:38.960\n look these things, if there is a theory of everything to be had, right?\n\n58:39.640 --> 58:43.240\n It's going to be a relatively small group of people where this will be sorted\n\n58:43.240 --> 58:46.800\n out. Absolutely. It's, it's, it's not tens of thousands.\n\n58:46.840 --> 58:49.440\n It's probably hundreds at the top.\n\n58:50.360 --> 58:53.400\n But within that, within that community,\n\n58:53.400 --> 58:57.200\n there is the assholes.\n\n58:57.200 --> 59:00.280\n There's the, I mean, they, you have,\n\n59:00.280 --> 59:04.680\n you always in this world have people who are kind, open minded.\n\n59:05.600 --> 59:07.760\n It's a question about, okay,\n\n59:08.160 --> 59:09.760\n let's imagine for example,\n\n59:10.000 --> 59:14.560\n that you have a story where you believe that ulcers are definitely\n\n59:14.560 --> 59:18.600\n caused by stress and you've never questioned it.\n\n59:18.640 --> 59:21.920\n Or maybe you felt like the Japanese came out of the blue and attacked us at\n\n59:21.920 --> 59:23.760\n Pearl Harbor, right?\n\n59:23.760 --> 59:27.120\n And now somebody introduces a new idea to you, which is like,\n\n59:27.160 --> 59:28.560\n what if it isn't stress at all?\n\n59:29.000 --> 59:33.720\n Or what if we actually tried to make resource star of Japan attack us somewhere\n\n59:33.720 --> 59:36.840\n in the Pacific so we could have cast this belly to enter the Asian theater\n\n59:38.520 --> 59:42.120\n person's original idea is like, what, what are you even saying? You know,\n\n59:42.120 --> 59:44.960\n it's like too crazy. Well,\n\n59:45.040 --> 59:47.320\n when Dirac in 1963\n\n59:47.320 --> 59:52.320\n talked about the importance of beauty as a guiding principle in physics and he\n\n59:52.320 --> 59:56.200\n wasn't talking about the scientific method, that was crazy talk,\n\n59:57.200 --> 1:00:00.120\n but he was actually making a great point and he was using Schrodinger.\n\n1:00:00.120 --> 1:00:04.240\n And I think it was Schrodinger was standing in for him and he said that if your\n\n1:00:04.240 --> 1:00:08.400\n equations don't agree with experiment, that's kind of a minor detail.\n\n1:00:08.400 --> 1:00:09.800\n If they have true beauty in them,\n\n1:00:10.280 --> 1:00:15.280\n you should explore them because very often the agreement with experiment is\n\n1:00:15.280 --> 1:00:20.280\n that it is an issue of fine tuning of your model of the instantiation.\n\n1:00:22.440 --> 1:00:25.120\n And so it doesn't really tell you that your model is wrong.\n\n1:00:25.560 --> 1:00:30.360\n And of course Heisenberg told Dirac that his model was wrong because that the\n\n1:00:30.400 --> 1:00:33.680\n proton and the electron should be the same mass if they are each other's\n\n1:00:33.680 --> 1:00:34.560\n anti particles.\n\n1:00:35.560 --> 1:00:40.560\n And that was an irrelevant kind of silliness rather than a real threat to the\n\n1:00:40.560 --> 1:00:45.800\n Dirac theory. But okay. So amidst all this silliness,\n\n1:00:46.560 --> 1:00:51.240\n I'm hoping that we could talk about the journey that geometric unity has taken\n\n1:00:51.240 --> 1:00:55.200\n and will take as an idea and an idea that we'll see the light.\n\n1:00:56.000 --> 1:00:58.360\n Yeah. That. So first of all, let's,\n\n1:00:59.320 --> 1:01:03.720\n I'm thinking of writing a book called geometric unity for idiots. Okay.\n\n1:01:03.920 --> 1:01:07.160\n And I need you as a consultant. So can we, first of all,\n\n1:01:07.200 --> 1:01:10.400\n I hope I have the trademark on geometric unit. You do. Good.\n\n1:01:10.400 --> 1:01:15.400\n Can you give a basic introduction of the goals of geometric unity?\n\n1:01:17.120 --> 1:01:22.120\n The basic tools of mathematics use the viewpoints in general for idiots.\n\n1:01:23.640 --> 1:01:26.000\n Sure. Like me. Okay. Great. Fun.\n\n1:01:26.240 --> 1:01:28.760\n So what's the goal of geometric unity?\n\n1:01:28.800 --> 1:01:33.800\n The goal of geometric unity is to start with something so completely bland that\n\n1:01:36.000 --> 1:01:37.520\n you can simply say, well,\n\n1:01:37.520 --> 1:01:41.320\n that's a something that begins the game is as close to a mathematical.\n\n1:01:41.320 --> 1:01:44.400\n Nothing is possible. In other words, I can't answer the question.\n\n1:01:44.400 --> 1:01:46.080\n Why is there something rather than nothing?\n\n1:01:46.120 --> 1:01:48.680\n But if there has to be a something that we begin from,\n\n1:01:49.160 --> 1:01:52.320\n let it begin from something that's like a blank canvas.\n\n1:01:53.520 --> 1:01:58.040\n Let's even more basic. So what is something, what are we trying to describe here?\n\n1:01:59.000 --> 1:02:04.000\n Right now we have a model of our world and it's got two sectors.\n\n1:02:04.000 --> 1:02:07.640\n Two sectors. One of the sectors is called general relativity.\n\n1:02:07.680 --> 1:02:09.360\n The other is called the standard model.\n\n1:02:09.840 --> 1:02:14.840\n So we'll call it GR for general relativity and SM for standard model.\n\n1:02:15.960 --> 1:02:18.480\n What's the difference between the two? What are the two described?\n\n1:02:19.320 --> 1:02:24.320\n So general relativity gives pride of place to gravity and everything else is\n\n1:02:26.760 --> 1:02:30.600\n acting as a sort of a back, a backup singer.\n\n1:02:30.600 --> 1:02:33.920\n Gravity is the star of the show. Gravity is the star of general relativity.\n\n1:02:34.960 --> 1:02:37.480\n And in the standard model,\n\n1:02:38.160 --> 1:02:41.360\n the other three non gravitational forces.\n\n1:02:41.360 --> 1:02:44.240\n So if there are four forces that we know about three of the four non\n\n1:02:44.240 --> 1:02:48.480\n gravitational, that's where they get to shine. Great.\n\n1:02:48.480 --> 1:02:52.120\n So tiny little particles and how they interact with each other.\n\n1:02:52.280 --> 1:02:57.120\n So photons, gluons and so called intermediate vector bosons.\n\n1:02:57.120 --> 1:03:02.120\n Those are the things that the standard model showcases and general relativity\n\n1:03:02.120 --> 1:03:04.440\n showcases gravity. And then you have matter,\n\n1:03:05.800 --> 1:03:08.040\n which is accommodated in both theories,\n\n1:03:08.040 --> 1:03:10.680\n but much more beautifully inside of the standard model.\n\n1:03:11.160 --> 1:03:14.520\n So what, what is a theory of everything do?\n\n1:03:14.880 --> 1:03:17.160\n So, so first of all, I think that that's,\n\n1:03:17.520 --> 1:03:19.840\n that's the first place where we haven't talked enough.\n\n1:03:19.840 --> 1:03:21.800\n We assume that we know what it means,\n\n1:03:22.600 --> 1:03:25.080\n but we don't actually have any idea what it means.\n\n1:03:25.080 --> 1:03:30.080\n And what I claim it is, is that it's a theory where the questions beyond that\n\n1:03:30.960 --> 1:03:34.120\n theory are no longer of a mathematical nature.\n\n1:03:36.240 --> 1:03:40.200\n In other words, if I say, let us take, um,\n\n1:03:40.680 --> 1:03:44.560\n X to be a four dimensional manifold\n\n1:03:45.720 --> 1:03:48.600\n to a mathematician or a physicist. I've said very little.\n\n1:03:49.000 --> 1:03:54.000\n I've simply said there's some place for calculus and linear algebra to,\n\n1:03:54.000 --> 1:03:56.440\n to, uh, to dance together and to play.\n\n1:03:58.080 --> 1:04:00.840\n And that's what manifolds are. They're the most natural place where,\n\n1:04:00.840 --> 1:04:04.760\n where our two greatest math theories can really, uh,\n\n1:04:06.800 --> 1:04:07.640\n intertwine.\n\n1:04:07.880 --> 1:04:12.640\n Which are the two? Oh, you mean calculus and linear algebra. Right. Okay.\n\n1:04:12.680 --> 1:04:16.560\n Now the question is beyond that. So it's sort of like saying,\n\n1:04:16.600 --> 1:04:18.680\n I'm an artist and I want to order a canvas.\n\n1:04:18.680 --> 1:04:23.680\n Okay. Now the question is, does the canvas paint itself?\n\n1:04:26.720 --> 1:04:29.480\n Does the can, does the canvas come up with an artist\n\n1:04:31.960 --> 1:04:36.720\n and paint an ink, which then paint the canvas? Like that's the,\n\n1:04:36.720 --> 1:04:39.240\n that's the hard part about theories of everything,\n\n1:04:39.240 --> 1:04:41.320\n which I don't think people talk enough about.\n\n1:04:41.640 --> 1:04:45.480\n Can we just, you bring up Escher and the hand that draws itself.\n\n1:04:45.480 --> 1:04:49.840\n Is it the fire that lights itself or drawing hands, the drawing hands. Yeah.\n\n1:04:50.480 --> 1:04:54.840\n And, uh, every time I start to think about that, my mind like, uh,\n\n1:04:54.880 --> 1:05:00.200\n shuts down. Well, don't do that. There's a spark and this is the most beautiful\n\n1:05:00.200 --> 1:05:03.520\n part. We should do this together. No, it's beautiful, but, uh,\n\n1:05:04.320 --> 1:05:07.360\n this robot's brain, uh, sparks fly.\n\n1:05:08.680 --> 1:05:12.880\n So can we try to say the same thing over and over in different ways about what,\n\n1:05:12.880 --> 1:05:17.240\n what, what you mean by that having to be a thing we have to contend with?\n\n1:05:17.440 --> 1:05:19.200\n Sure. Like why,\n\n1:05:19.200 --> 1:05:22.520\n why do you think that creating a theory of everything,\n\n1:05:23.000 --> 1:05:28.000\n as you call the source code are understanding our source code require a view\n\n1:05:29.320 --> 1:05:31.040\n like the hand that draws itself. Okay.\n\n1:05:31.040 --> 1:05:34.760\n Well here's what goes on in the regular physics picture.\n\n1:05:35.040 --> 1:05:38.360\n We've got these two main theories, general relativity and the standard model.\n\n1:05:38.400 --> 1:05:39.240\n Right?\n\n1:05:39.240 --> 1:05:44.240\n Okay. Think of general relativity as more or less,\n\n1:05:44.800 --> 1:05:48.280\n the theory of the canvas. Okay.\n\n1:05:48.880 --> 1:05:52.720\n Maybe you have the canvas in a particularly rigid shape.\n\n1:05:52.720 --> 1:05:55.320\n Maybe you've measured it. So it's got length and it's got angle,\n\n1:05:55.480 --> 1:05:58.280\n but more or less it's just canvas and length and angle.\n\n1:05:58.720 --> 1:06:02.560\n And that's all that really general relativity is,\n\n1:06:02.560 --> 1:06:04.720\n but it allows the canvas to warp a bit.\n\n1:06:04.720 --> 1:06:08.280\n Okay. Then we have the second thing,\n\n1:06:08.560 --> 1:06:13.560\n which is this import of foreign libraries where,\n\n1:06:13.680 --> 1:06:17.920\n which aren't tied to space and time.\n\n1:06:18.880 --> 1:06:23.200\n So we've got this crazy set of symmetries called SU three cross SU two cross U\n\n1:06:23.200 --> 1:06:24.040\n one.\n\n1:06:24.240 --> 1:06:27.600\n We've got this collection of 16 particles in a generation,\n\n1:06:27.600 --> 1:06:29.480\n which are these sort of twisted spinners.\n\n1:06:30.600 --> 1:06:32.600\n And we've got three copies of them.\n\n1:06:32.600 --> 1:06:36.960\n Then we've got this weird Higgs field that comes in and like Deus ex machina\n\n1:06:37.160 --> 1:06:40.960\n solves all the problems that have been created in the play that can't be\n\n1:06:40.960 --> 1:06:42.000\n resolved otherwise.\n\n1:06:42.040 --> 1:06:45.200\n So that's the standard model of quantum field theory just plopped on top.\n\n1:06:45.920 --> 1:06:48.880\n It's a problem of the double origin story.\n\n1:06:48.880 --> 1:06:51.280\n One origin story is about space and time.\n\n1:06:51.600 --> 1:06:56.320\n The other origin story is about what we would call internal quantum numbers and\n\n1:06:56.320 --> 1:06:57.440\n internal symmetries.\n\n1:06:58.040 --> 1:07:02.440\n And then there was an attempt to get one to follow from the other called\n\n1:07:02.440 --> 1:07:04.680\n Kaluza Klein theory, which didn't work out.\n\n1:07:06.160 --> 1:07:09.280\n And this is sort of in that vein.\n\n1:07:10.800 --> 1:07:15.360\n So you said origin story. So in the hand that draws itself,\n\n1:07:15.400 --> 1:07:16.200\n what is it?\n\n1:07:16.200 --> 1:07:21.000\n So it's, it's as if you had the canvas and then you ordered\n\n1:07:21.000 --> 1:07:26.000\n up also give me paint brushes, paints, pigments, pencils, and artists.\n\n1:07:26.040 --> 1:07:29.800\n But you're saying that's like, if you want to create a universe from scratch,\n\n1:07:29.800 --> 1:07:33.960\n the canvas should be generating the paintbrushes and the paintbrushes and the\n\n1:07:33.960 --> 1:07:38.280\n artists, right? Like you should, who's the artist in this analogy?\n\n1:07:38.280 --> 1:07:40.080\n Well, this is sorry.\n\n1:07:40.160 --> 1:07:42.320\n Then we're going to get into a religious thing and I don't want to do that.\n\n1:07:42.880 --> 1:07:46.960\n Okay. Well, you know my shtick, which is that we are the AI.\n\n1:07:47.600 --> 1:07:51.440\n We have two great stories about the simulation and artificial general\n\n1:07:51.440 --> 1:07:53.480\n intelligence. In one story,\n\n1:07:54.400 --> 1:07:59.400\n man fears that some program we've given birth to will become self aware,\n\n1:07:59.400 --> 1:08:03.760\n smarter than us and we'll take over in another story.\n\n1:08:04.680 --> 1:08:09.680\n There are genius simulators and we live in their simulation and we haven't\n\n1:08:10.200 --> 1:08:14.440\n realized that those two stories are the same story. In one case,\n\n1:08:14.960 --> 1:08:18.640\n we are the simulator. In another case,\n\n1:08:18.640 --> 1:08:23.640\n we are the simulated and if you buy those and you put them together,\n\n1:08:23.960 --> 1:08:27.080\n we are the AGI and whether or not we have simulators,\n\n1:08:27.080 --> 1:08:30.280\n we may be trying to wake up by learning our own source code.\n\n1:08:30.320 --> 1:08:31.960\n So this could be our Skynet moment,\n\n1:08:31.960 --> 1:08:33.800\n which is one of the reasons I have some issues around it.\n\n1:08:35.200 --> 1:08:36.920\n I think we'll talk about that cause I,\n\n1:08:37.160 --> 1:08:40.800\n well that's the issue of the emergent artist within the story just to get back\n\n1:08:40.800 --> 1:08:42.280\n to the point. Okay. So,\n\n1:08:42.400 --> 1:08:47.120\n so now the key point is the standard way we tell the story is that Einstein sets\n\n1:08:47.120 --> 1:08:52.120\n the canvas and then we order all the stuff that we want and then that paints the\n\n1:08:52.720 --> 1:08:54.040\n picture that is our universe.\n\n1:08:54.040 --> 1:08:57.520\n So you order the, the, the paint,\n\n1:08:57.920 --> 1:08:59.800\n you order the artist,\n\n1:09:00.600 --> 1:09:05.600\n you order the brushes and that then when you collide the two gives you two\n\n1:09:06.640 --> 1:09:07.760\n separate origin stories.\n\n1:09:08.080 --> 1:09:12.280\n The canvas came from one place and everything else came from somewhere else.\n\n1:09:12.840 --> 1:09:17.040\n So what are the mathematical tools required to,\n\n1:09:18.240 --> 1:09:21.480\n to construct consistent geometric theory?\n\n1:09:21.480 --> 1:09:22.320\n Yeah.\n\n1:09:23.600 --> 1:09:25.000\n You know, make this concrete.\n\n1:09:25.760 --> 1:09:30.240\n Well, somehow you need to get three copies,\n\n1:09:30.240 --> 1:09:31.200\n for example,\n\n1:09:31.760 --> 1:09:35.240\n of generations with 16 particles each,\n\n1:09:36.720 --> 1:09:40.640\n right? And so the question would be like, well, there's a lot,\n\n1:09:40.760 --> 1:09:43.720\n there's a lot of special personality in those symmetries.\n\n1:09:44.440 --> 1:09:47.680\n Where would they come from? So for example,\n\n1:09:47.680 --> 1:09:52.040\n you've got what would be called grand unified theories that sound like,\n\n1:09:52.600 --> 1:09:55.280\n um, SU five, uh, the George I.\n\n1:09:55.280 --> 1:09:58.400\n Glashow theory. There's something that should be called spin 10,\n\n1:09:58.400 --> 1:10:00.760\n but physicists insist on calling it SO 10.\n\n1:10:01.680 --> 1:10:06.080\n There's something called the petit salon theory that tends to be called SU four\n\n1:10:06.080 --> 1:10:10.120\n cross SU two cross SU two, which should be called spin six cross spin four.\n\n1:10:10.360 --> 1:10:11.600\n I can get into all of these.\n\n1:10:11.960 --> 1:10:13.800\n What are they all accomplishing?\n\n1:10:13.800 --> 1:10:18.200\n They're all taking the known forces that we see and packaging them up\n\n1:10:18.800 --> 1:10:22.600\n to say, we can't get rid of the second origin story,\n\n1:10:22.640 --> 1:10:25.720\n but we can at least make that origin story more unified.\n\n1:10:26.520 --> 1:10:29.240\n So they're trying grand unification is the attempt to.\n\n1:10:29.240 --> 1:10:30.800\n And that's a mistake in your, in your.\n\n1:10:30.800 --> 1:10:35.240\n It's not a mistake that the problem is, is it was born lifeless. When,\n\n1:10:35.240 --> 1:10:35.920\n when George I.\n\n1:10:35.920 --> 1:10:40.520\n And Glashow first came out with the SU five theory, um,\n\n1:10:40.520 --> 1:10:45.160\n it was very exciting because it could be tested in a South Dakota, um,\n\n1:10:45.200 --> 1:10:49.040\n mine filled up with like, I dunno, cleaning fluid or something like that.\n\n1:10:49.600 --> 1:10:51.760\n And they looked for proton decay and didn't see it.\n\n1:10:51.800 --> 1:10:54.240\n And then they gave up because in that day,\n\n1:10:54.240 --> 1:10:56.720\n when your experiment didn't work, you gave up on the theory.\n\n1:10:57.680 --> 1:11:02.200\n It didn't come to us born of a fusion between Einstein and,\n\n1:11:02.280 --> 1:11:04.920\n and, and bore, you know,\n\n1:11:05.160 --> 1:11:09.440\n and that was kind of the problem is that it had this weird parenting where it\n\n1:11:09.440 --> 1:11:12.760\n was just on the bore side. There was no Einsteinian contribution.\n\n1:11:15.920 --> 1:11:19.880\n Lex, how can I help you most? I'm trying to figure,\n\n1:11:19.880 --> 1:11:23.520\n what questions do you want to ask so that you get the most satisfying answers?\n\n1:11:24.600 --> 1:11:26.040\n Uh, there's, there's a, there's a bunch,\n\n1:11:26.080 --> 1:11:28.400\n there's a bunch of questions I want to ask. I mean, one,\n\n1:11:28.560 --> 1:11:33.440\n and I'm trying to sneak up on you somehow to reveal\n\n1:11:33.440 --> 1:11:38.440\n in a accessible way, then the nature of our universe.\n\n1:11:40.040 --> 1:11:41.840\n So I can just give you a guess, right?\n\n1:11:42.520 --> 1:11:47.520\n We have to be very careful that we're not claiming that this has been accepted.\n\n1:11:47.880 --> 1:11:51.880\n This is a speculation, but I will, I will make the speculation that what,\n\n1:11:51.920 --> 1:11:55.480\n I think what you would want to ask me is how can the canvas generate all the\n\n1:11:55.480 --> 1:11:58.960\n stuff that usually has to be ordered separately? All right. Should we do that?\n\n1:11:59.240 --> 1:12:00.360\n Let's go there. Okay.\n\n1:12:00.360 --> 1:12:03.600\n Okay. So the first thing is,\n\n1:12:03.600 --> 1:12:07.640\n is that you have a concept in computers called technical debt.\n\n1:12:08.560 --> 1:12:10.440\n You're coding and you cut corners and you know,\n\n1:12:10.440 --> 1:12:14.720\n you're going to have to do it right before the thing is safe for the world,\n\n1:12:15.400 --> 1:12:20.400\n but you're piling up some series of IO use to yourself and your project as\n\n1:12:21.960 --> 1:12:22.800\n you're going along.\n\n1:12:23.680 --> 1:12:28.680\n So the first thing is we can't figure out if you have only four degrees of\n\n1:12:28.680 --> 1:12:30.640\n freedom. And that's what your canvas is.\n\n1:12:30.680 --> 1:12:35.280\n How do you get at least Einstein's world? Einstein says, look,\n\n1:12:35.320 --> 1:12:36.880\n it's not just four degrees of freedom,\n\n1:12:36.880 --> 1:12:40.720\n but there need to be rulers and protractors to measure length and angle in the\n\n1:12:40.720 --> 1:12:44.440\n world. You can't just have a flabby four degrees of freedom.\n\n1:12:46.360 --> 1:12:49.440\n So the first thing you do is you create 10 extra variables,\n\n1:12:49.440 --> 1:12:53.480\n which is like if we can't choose any particular set of rulers and protractors to\n\n1:12:53.480 --> 1:12:55.960\n measure length and angle, let's take the,\n\n1:12:55.960 --> 1:13:00.080\n take the set of all possible rulers and protractors.\n\n1:13:00.080 --> 1:13:04.880\n And that would be called symmetric non degenerate two tensors on the tangent\n\n1:13:04.880 --> 1:13:07.000\n space of the four manifold X four.\n\n1:13:08.480 --> 1:13:10.880\n Now because there are four degrees of freedom,\n\n1:13:11.000 --> 1:13:12.560\n you start off with four dimensions.\n\n1:13:12.600 --> 1:13:17.600\n Then you need four rulers for each of those different directions.\n\n1:13:17.880 --> 1:13:20.360\n So that's four that gets us up to eight variables.\n\n1:13:20.480 --> 1:13:24.800\n And then between four original variables, there are six possible angles.\n\n1:13:24.800 --> 1:13:28.320\n So four plus four plus six is equal to 14.\n\n1:13:29.280 --> 1:13:33.440\n So now you've replaced X four with another space, which in the lecture,\n\n1:13:33.440 --> 1:13:36.160\n I think I called you 14, but I'm now calling Y 14.\n\n1:13:36.160 --> 1:13:39.720\n This is one of the big problems of working on something in private is every time\n\n1:13:39.720 --> 1:13:42.680\n you pull it out, you sort of can't remember it. You name something, something new.\n\n1:13:43.120 --> 1:13:45.560\n Okay. So you've got a 14 dimensional world,\n\n1:13:45.560 --> 1:13:50.560\n which is the original four dimensional world plus a lot of extra gadgetry for\n\n1:13:51.400 --> 1:13:52.240\n measurement.\n\n1:13:52.240 --> 1:13:55.200\n Yeah. And because you're not in the four dimensional world,\n\n1:13:55.200 --> 1:13:56.320\n you don't have the technical debt.\n\n1:13:56.880 --> 1:13:59.840\n No, now you've got a lot of technical debt because now you have to explain away\n\n1:13:59.840 --> 1:14:02.080\n a 14 dimensional world, which is a big,\n\n1:14:02.680 --> 1:14:05.800\n you're taking a huge advance on your payday check, right?\n\n1:14:05.960 --> 1:14:10.240\n But aren't more dimensions allow you more freedom to, I mean,\n\n1:14:10.360 --> 1:14:13.320\n maybe, but you have to get rid of them somehow because we don't perceive them.\n\n1:14:14.000 --> 1:14:16.880\n So eventually you have to collapse it down to the thing that we perceive or you\n\n1:14:16.880 --> 1:14:21.880\n have to sample a four dimensional filament within that 14 dimensional world known\n\n1:14:23.040 --> 1:14:24.280\n as a section of a bundle.\n\n1:14:26.280 --> 1:14:31.240\n Okay. So how do we get from the four 14 dimensional world where I imagine a lot\n\n1:14:31.240 --> 1:14:33.760\n of, oh, wait, wait, wait. Yep. You're cheating.\n\n1:14:33.760 --> 1:14:38.240\n The first question was how do we get something from almost nothing?\n\n1:14:38.920 --> 1:14:39.960\n Like how do we get the,\n\n1:14:40.720 --> 1:14:45.720\n if I've said that the who and the what in the newspaper story that is a theory\n\n1:14:45.720 --> 1:14:50.680\n theory of everything are bosons and Fermions. So let's make the who,\n\n1:14:50.680 --> 1:14:54.240\n the Fermions and the what the bosons think of it as the players and the\n\n1:14:54.240 --> 1:14:55.360\n equipment for a game.\n\n1:14:56.320 --> 1:15:00.640\n Are we supposed to be thinking of actual physical things with mass or energy?\n\n1:15:00.840 --> 1:15:04.240\n Okay. So think about everything you see in this room.\n\n1:15:05.240 --> 1:15:08.440\n So from chemistry, you know, it's all protons, neutrons and electrons,\n\n1:15:08.480 --> 1:15:12.240\n but from a little bit of late 1960s physics,\n\n1:15:12.240 --> 1:15:16.000\n we know that the protons and neutrons are all made of up quarks and down quarks.\n\n1:15:16.720 --> 1:15:19.840\n So everything in this room is basically up quarks, down quarks,\n\n1:15:19.840 --> 1:15:24.200\n and electrons stuck together with, with the, the, what the equipment.\n\n1:15:25.200 --> 1:15:26.040\n Okay.\n\n1:15:26.760 --> 1:15:31.760\n Now the way we see it currently is we see that there are space time indices,\n\n1:15:32.960 --> 1:15:37.960\n which we would call spinners that correspond to the who that is the Fermions,\n\n1:15:38.200 --> 1:15:41.120\n the matter, the stuff, the up quarks, the down quarks, the electrons.\n\n1:15:41.120 --> 1:15:44.720\n And there are also\n\n1:15:46.640 --> 1:15:51.640\n 16 degrees of freedom that come from this in this space of internal quantum\n\n1:15:51.640 --> 1:15:55.760\n numbers. So in my theory,\n\n1:15:55.920 --> 1:15:57.360\n in 14 dimensions,\n\n1:15:58.200 --> 1:16:02.120\n there's no internal quantum number space that figures in.\n\n1:16:03.560 --> 1:16:05.200\n It's all just spin oriel.\n\n1:16:05.200 --> 1:16:10.200\n So spinners in 14 dimensions without any festooning with extra linear algebraic\n\n1:16:14.920 --> 1:16:15.760\n information.\n\n1:16:17.040 --> 1:16:20.160\n There's a concept of a, of, of, of spinners,\n\n1:16:20.920 --> 1:16:25.920\n which is natural if you have a manifold with length and angle and Y 14 is almost\n\n1:16:27.880 --> 1:16:32.240\n a manifold with length and angle. It's,\n\n1:16:32.240 --> 1:16:34.960\n it's so close. It's in other words,\n\n1:16:35.080 --> 1:16:39.320\n because you're looking at the space of all rulers and protractors,\n\n1:16:39.320 --> 1:16:43.520\n maybe it's not that surprising that a space of rulers and protractors might come\n\n1:16:43.520 --> 1:16:46.800\n very close to having rulers and protractors on it itself.\n\n1:16:47.040 --> 1:16:52.040\n Like can you measure the space of measurements and you almost can't in a space\n\n1:16:52.720 --> 1:16:53.920\n that has length and angle.\n\n1:16:54.600 --> 1:16:58.480\n If it doesn't have a topological obstruction comes with these objects called\n\n1:16:58.480 --> 1:16:59.320\n spinners.\n\n1:16:59.320 --> 1:17:04.320\n Now spinners are the stuff of of our world.\n\n1:17:05.160 --> 1:17:08.360\n We are made of spinners. They are the most important,\n\n1:17:08.360 --> 1:17:11.720\n really deep object that I can tell you about. They were very surprising.\n\n1:17:11.720 --> 1:17:14.600\n What is a spinner? So famously,\n\n1:17:14.640 --> 1:17:19.640\n there are these weird things that require 720 degrees of rotation in order to\n\n1:17:23.400 --> 1:17:26.040\n come back to normal. And that doesn't make sense.\n\n1:17:26.040 --> 1:17:31.040\n And the reason for this is that there's a knottedness in our three dimensional\n\n1:17:31.880 --> 1:17:34.400\n world that people don't observe. And you know,\n\n1:17:34.400 --> 1:17:39.000\n you can famously see it by this Dirac string trick.\n\n1:17:39.000 --> 1:17:40.440\n So if you take a glass of water,\n\n1:17:40.440 --> 1:17:43.080\n imagine that this was a tumbler and I didn't want to spill any of it.\n\n1:17:43.680 --> 1:17:48.680\n And the question is if I rotate the cup without losing my grip on the base,\n\n1:17:49.520 --> 1:17:53.480\n 360 degrees and I can't go backwards,\n\n1:17:53.480 --> 1:17:58.400\n is there any way I can take a sip? And the answer is this weird motion,\n\n1:17:58.480 --> 1:17:59.320\n which is\n\n1:18:01.440 --> 1:18:04.760\n go over first and under second.\n\n1:18:04.800 --> 1:18:08.400\n And that that's 720 degrees of rotation to come back to normal so that I can\n\n1:18:08.400 --> 1:18:10.840\n take a sip. Well, that weird principle,\n\n1:18:10.880 --> 1:18:14.840\n which sometimes is known as the Philippine wine glass dance because waitresses\n\n1:18:14.840 --> 1:18:18.160\n in the Philippines apparently learned how to do this.\n\n1:18:18.320 --> 1:18:19.160\n Um,\n\n1:18:19.160 --> 1:18:24.160\n so that that move defines if you will,\n\n1:18:24.520 --> 1:18:28.040\n this hidden space that nobody knew was there of spinners,\n\n1:18:28.720 --> 1:18:32.760\n which Dirac figured out when he took the square root of something called the\n\n1:18:32.760 --> 1:18:37.000\n Klein Gordon equation, uh, which I think had earlier,\n\n1:18:37.680 --> 1:18:42.680\n um, work incorporated from Cartan and killing and company in mathematics.\n\n1:18:43.280 --> 1:18:46.760\n So spinners are one of the most profound aspects of human existence.\n\n1:18:46.760 --> 1:18:49.400\n I mean, forgive me for the perhaps dumb questions, but, uh,\n\n1:18:49.560 --> 1:18:54.560\n would a spinner be the mathematical objects that's the basic unit of our\n\n1:18:54.560 --> 1:18:55.400\n universe?\n\n1:18:55.560 --> 1:18:59.120\n When you, when you start with a manifold,\n\n1:19:01.560 --> 1:19:06.200\n um, which is just like something like a donut or a sphere circle or a Mobius\n\n1:19:06.200 --> 1:19:07.040\n band,\n\n1:19:07.680 --> 1:19:12.680\n a spinner is usually the first wildly surprising thing that you found was\n\n1:19:12.760 --> 1:19:14.720\n hidden in your original purchase.\n\n1:19:14.720 --> 1:19:15.560\n So you,\n\n1:19:15.560 --> 1:19:20.560\n you order a manifold and you didn't even realize it's like buying a house and\n\n1:19:20.560 --> 1:19:23.480\n finding a panic room inside that you hadn't counted on.\n\n1:19:23.960 --> 1:19:27.200\n It's very surprising when you understand that spinners are running around on\n\n1:19:27.200 --> 1:19:28.040\n your spaces.\n\n1:19:29.960 --> 1:19:31.640\n Again, perhaps a dumb question,\n\n1:19:31.640 --> 1:19:34.880\n but we're talking about 14 dimensions and four dimensions.\n\n1:19:34.920 --> 1:19:37.720\n What is the manifold we're operating under?\n\n1:19:38.600 --> 1:19:41.720\n So in my case, it's proto space time. It's before,\n\n1:19:41.720 --> 1:19:46.720\n it's before Einstein can slap rulers and protractors on space time.\n\n1:19:47.000 --> 1:19:49.680\n What do you mean by that? Sorry to interrupt is space.\n\n1:19:49.680 --> 1:19:51.840\n Time is the four D manifold.\n\n1:19:52.760 --> 1:19:56.640\n Space time is a four dimensional manifold with extra structure.\n\n1:19:57.760 --> 1:19:58.880\n What's the extra structure?\n\n1:19:58.920 --> 1:20:03.280\n It's called a semi Ramanian or pseudo Ramanian metric.\n\n1:20:04.200 --> 1:20:05.240\n In essence,\n\n1:20:05.280 --> 1:20:10.280\n there is something akin to a four by four symmetric manifold.\n\n1:20:10.280 --> 1:20:15.280\n Four symmetric matrix from which is equivalent to length and angle.\n\n1:20:15.680 --> 1:20:17.520\n So when I talk about rulers and protractors,\n\n1:20:17.520 --> 1:20:19.160\n or I talk about length and angle,\n\n1:20:19.520 --> 1:20:24.040\n or I talk about Ramanian or pseudo Ramanian or semi Ramanian met manifolds,\n\n1:20:24.040 --> 1:20:25.960\n I'm usually talking about the same thing.\n\n1:20:26.560 --> 1:20:30.720\n Can you measure how long something is and what the angle is between two\n\n1:20:30.720 --> 1:20:32.960\n different rays or vectors?\n\n1:20:32.960 --> 1:20:42.400\n So that's what Einstein gave us as his arena, his place to play, his his canvas.\n\n1:20:43.320 --> 1:20:45.880\n So there's a bunch of questions I can ask here.\n\n1:20:45.920 --> 1:20:50.320\n But like I said, I'm working on this book, Geometric Unity for Idiots.\n\n1:20:51.240 --> 1:20:57.280\n And and I think what would be really nice as your editor\n\n1:20:57.280 --> 1:21:05.760\n to have like beautiful, maybe even visualizations that people could try to\n\n1:21:05.760 --> 1:21:09.760\n play with, try to try to reveal small little beauties about the way you're\n\n1:21:09.760 --> 1:21:10.680\n thinking about the score.\n\n1:21:10.680 --> 1:21:12.840\n Well, I usually use the Joe Rogan program for that.\n\n1:21:13.120 --> 1:21:16.200\n Sometimes I have him doing the Philippine wine glass dance.\n\n1:21:16.480 --> 1:21:17.880\n I had the hop vibration.\n\n1:21:18.400 --> 1:21:23.680\n The part of the problem is that most people don't know this language about\n\n1:21:23.680 --> 1:21:27.520\n spinners, bundles, metrics, gauge fields.\n\n1:21:27.960 --> 1:21:31.720\n And they're very curious about the theory of everything, but they have no\n\n1:21:31.720 --> 1:21:34.320\n understanding of even what we know about our own world.\n\n1:21:34.360 --> 1:21:37.400\n Is it, is it a hopeless pursuit?\n\n1:21:37.520 --> 1:21:39.840\n So like even gauge theory, right?\n\n1:21:39.960 --> 1:21:43.320\n Just this, I mean, it seems to be very inaccessible.\n\n1:21:43.680 --> 1:21:46.080\n Is there some aspect of it that could be made accessible?\n\n1:21:46.080 --> 1:21:50.120\n I mean, I could go to the board right there and give you a five minute lecture\n\n1:21:50.120 --> 1:21:54.560\n on gauge theory that would be better than the official lecture on gauge theory.\n\n1:21:54.560 --> 1:21:56.440\n You would know what gauge theory was.\n\n1:21:56.800 --> 1:22:01.240\n So it is, it's, it's possible to make it accessible, but nobody does.\n\n1:22:01.280 --> 1:22:05.400\n Like, in other words, you're going to watch over the next year, lots of\n\n1:22:05.400 --> 1:22:09.920\n different discussions about quantum entanglement or, you know, the multiverse.\n\n1:22:09.920 --> 1:22:11.080\n Where are we now?\n\n1:22:11.760 --> 1:22:14.960\n Or, you know, many worlds, are they all equally real?\n\n1:22:15.120 --> 1:22:15.360\n Yeah.\n\n1:22:17.160 --> 1:22:17.520\n Right.\n\n1:22:17.840 --> 1:22:19.120\n I mean, yeah, that's okay.\n\n1:22:19.120 --> 1:22:22.120\n But you're not going to hear anything about the hop vibration except if\n\n1:22:22.120 --> 1:22:23.520\n it's from me and I hate that.\n\n1:22:24.320 --> 1:22:26.080\n Why, why can't you be the one?\n\n1:22:26.400 --> 1:22:28.200\n Well, because I'm going a different path.\n\n1:22:28.240 --> 1:22:31.840\n I think that we've made a huge mistake, which is we have things we can show\n\n1:22:31.840 --> 1:22:33.680\n people about the actual models.\n\n1:22:34.160 --> 1:22:38.240\n We can push out visualizations where they they're not listening by analogy.\n\n1:22:38.240 --> 1:22:40.280\n They're watching the same thing that we're seeing.\n\n1:22:40.840 --> 1:22:45.640\n And as I've said to you before, this is like choosing to perform sheet music\n\n1:22:45.640 --> 1:22:47.520\n that hasn't been performed in a long time.\n\n1:22:47.520 --> 1:22:50.040\n Or, you know, the experts can't afford orchestras.\n\n1:22:50.040 --> 1:22:53.160\n So they just trade Beethoven symphonies as sheet music.\n\n1:22:53.160 --> 1:22:55.000\n And they, Oh, wow, that was beautiful.\n\n1:22:55.440 --> 1:22:57.280\n But it's like, nobody heard anything.\n\n1:22:57.920 --> 1:22:59.040\n They just looked at the score.\n\n1:22:59.040 --> 1:23:03.280\n Well, that's how mathematicians and physicists trade papers and ideas is that\n\n1:23:03.280 --> 1:23:06.680\n they, they write down the things that represent stuff.\n\n1:23:07.880 --> 1:23:13.840\n I want to at least close out the thought line that you started, which is how does\n\n1:23:13.840 --> 1:23:22.320\n the canvas order all of this other stuff into being so I at least want to say some\n\n1:23:22.320 --> 1:23:23.960\n incomprehensible things about that.\n\n1:23:23.960 --> 1:23:25.600\n And then we'll, we'll have that much done.\n\n1:23:26.120 --> 1:23:26.440\n All right.\n\n1:23:27.760 --> 1:23:32.000\n And that just point, does it have to be incomprehensible?\n\n1:23:32.520 --> 1:23:34.080\n Do you know what the Schrodinger equation is?\n\n1:23:34.440 --> 1:23:34.880\n Yes.\n\n1:23:35.280 --> 1:23:36.960\n Do you know what the Dirac equation is?\n\n1:23:38.160 --> 1:23:39.440\n What does no mean?\n\n1:23:39.760 --> 1:23:42.960\n Well, my point is you're going to have some feeling that, you know, what the\n\n1:23:42.960 --> 1:23:47.440\n Schrodinger equation is, as soon as we get to the Dirac equation, your eyes are\n\n1:23:47.440 --> 1:23:49.920\n going to get a little bit glazed, right?\n\n1:23:51.360 --> 1:23:52.640\n So now why is that?\n\n1:23:53.520 --> 1:23:59.920\n Well, the answer to me is, is that you, you want to ask me about the theory\n\n1:23:59.920 --> 1:24:05.600\n of everything, but you haven't even digested the theory of everything as\n\n1:24:05.600 --> 1:24:10.240\n we've had it since 1928 when Dirac came out with his equation.\n\n1:24:10.240 --> 1:24:17.120\n So for whatever reason, and this isn't a hit on you, you haven't been motivated\n\n1:24:17.120 --> 1:24:21.560\n enough in all the time that you've been on earth to at least get as far as the\n\n1:24:21.560 --> 1:24:22.520\n Dirac equation.\n\n1:24:22.640 --> 1:24:26.720\n And this was very interesting to me after I gave the talk in Oxford new scientist.\n\n1:24:28.040 --> 1:24:32.080\n Who had done kind of a hatchet job on me to begin with sent a reporter to come to\n\n1:24:32.080 --> 1:24:33.680\n the third version of the talk that I gave.\n\n1:24:34.560 --> 1:24:37.200\n And that person had never heard of the Dirac equation.\n\n1:24:37.200 --> 1:24:43.560\n So you have a person who's completely professionally, not qualified to ask\n\n1:24:43.560 --> 1:24:49.600\n these questions wanting to know, well, how does, how does your theory solve\n\n1:24:49.600 --> 1:24:53.120\n new problems and like, well, in the case of the Dirac equation, well, tell me\n\n1:24:53.120 --> 1:24:53.400\n about that.\n\n1:24:53.400 --> 1:24:54.160\n I don't know what that is.\n\n1:24:54.520 --> 1:24:56.920\n So then the point is, okay, I got it.\n\n1:24:57.560 --> 1:25:01.480\n You're not even caught up minimally to where we are now.\n\n1:25:01.560 --> 1:25:03.120\n And that's not a knock on you.\n\n1:25:03.120 --> 1:25:04.960\n Almost nobody even knows where you are.\n\n1:25:04.960 --> 1:25:07.600\n And that's not a knock on you, almost nobody is.\n\n1:25:08.040 --> 1:25:08.320\n Yeah.\n\n1:25:08.480 --> 1:25:13.320\n But then how does it become my job to digest what has been available\n\n1:25:14.000 --> 1:25:17.400\n for like over 90 years?\n\n1:25:17.840 --> 1:25:22.280\n Well, to me, the open question is whether what's been available for over 90 years\n\n1:25:22.280 --> 1:25:30.000\n can be, um, there could be, uh, a blueprint of a journey that one takes to\n\n1:25:30.000 --> 1:25:32.600\n understand it, not to do that with you.\n\n1:25:32.600 --> 1:25:36.560\n And I, I, one of the things I think I've been relatively successful at, for\n\n1:25:36.560 --> 1:25:41.720\n example, you know, when you ask other people what gauge theory is, you get\n\n1:25:41.720 --> 1:25:45.520\n these very confusing responses and my response is much simpler.\n\n1:25:45.520 --> 1:25:49.800\n It's, oh, it's a theory of, uh, differentiation where when you calculate\n\n1:25:49.800 --> 1:25:54.360\n the instantaneous rise over run, you measure the rise, not from a flat\n\n1:25:54.360 --> 1:25:57.440\n horizontal, but from a custom endogenous reference level.\n\n1:25:58.640 --> 1:25:59.560\n What do you mean by that?\n\n1:25:59.840 --> 1:26:00.520\n It's like, okay.\n\n1:26:00.520 --> 1:26:04.280\n And then I do this thing with Mount Everest, which is Mount Everest is how\n\n1:26:04.280 --> 1:26:07.600\n high then they give the height I say above what then they say sea level.\n\n1:26:07.640 --> 1:26:10.240\n And I say, which sea is that in Nepal?\n\n1:26:10.320 --> 1:26:12.400\n Like, oh, I guess there isn't a sea cause it's landlocked.\n\n1:26:12.400 --> 1:26:14.600\n It's like, okay, well, what do you mean by sea level?\n\n1:26:14.600 --> 1:26:17.080\n Oh, there's this thing called the geoid I'd never heard of.\n\n1:26:17.240 --> 1:26:18.560\n Oh, that's the reference level.\n\n1:26:18.840 --> 1:26:21.240\n That's a custom reference level that we imported.\n\n1:26:22.120 --> 1:26:27.280\n So you, all sorts of people have remembered the exact height of Mount\n\n1:26:27.280 --> 1:26:31.080\n Everest without ever knowing what it's a height from.\n\n1:26:31.840 --> 1:26:35.600\n Well, in this case, engage theory, there's a hidden reference level where\n\n1:26:35.600 --> 1:26:39.440\n you measure the rise in rise over run to give the slope of the line.\n\n1:26:40.880 --> 1:26:46.560\n What if you have different concepts of what, of where that rise should be\n\n1:26:46.560 --> 1:26:50.560\n measured from that vary within the theory that are endogenous to the theory.\n\n1:26:51.040 --> 1:26:52.160\n That's what gauge theory is.\n\n1:26:53.720 --> 1:26:54.040\n Okay.\n\n1:26:54.040 --> 1:26:55.160\n We have a video here, right?\n\n1:26:55.200 --> 1:26:55.480\n Yeah.\n\n1:26:55.680 --> 1:26:56.000\n Okay.\n\n1:26:56.000 --> 1:26:56.320\n Okay.\n\n1:26:57.160 --> 1:26:58.160\n I'm going to use my phone.\n\n1:26:59.280 --> 1:27:05.000\n If I want to measure my hand and its slope, this is my attempt to\n\n1:27:05.000 --> 1:27:07.720\n measure it using standard calculus.\n\n1:27:07.800 --> 1:27:11.280\n In other words, the reference level is apparently flat and I measure the\n\n1:27:11.280 --> 1:27:14.720\n rise above that phone using my hand.\n\n1:27:14.960 --> 1:27:15.320\n Okay.\n\n1:27:15.640 --> 1:27:20.200\n If I want to use gauge theory, it means I can do this or I can do that, or\n\n1:27:20.200 --> 1:27:23.240\n I can do this, or I can do this, or I could do what I did from the beginning.\n\n1:27:24.040 --> 1:27:24.480\n Okay.\n\n1:27:24.480 --> 1:27:26.520\n At some level, that's what gauge theory is.\n\n1:27:27.080 --> 1:27:27.840\n Now that is an act.\n\n1:27:27.880 --> 1:27:30.680\n No, I've never heard anyone describe it that way.\n\n1:27:31.640 --> 1:27:34.240\n So while the community may say, well, who is this guy and why does he\n\n1:27:34.240 --> 1:27:35.560\n have the right to talk in public?\n\n1:27:35.880 --> 1:27:39.960\n I'm waiting for somebody to jump out of the woodwork and say, you know,\n\n1:27:39.960 --> 1:27:44.920\n Eric's whole shtick about rulers and protractors, uh, leading to a derivative.\n\n1:27:44.920 --> 1:27:47.640\n Derivatives are measured as rise over run above reference level.\n\n1:27:47.640 --> 1:27:48.800\n The reference levels don't fit together.\n\n1:27:48.800 --> 1:27:51.680\n Like I go through this whole shtick in order to make it accessible.\n\n1:27:51.680 --> 1:27:54.360\n I've never heard anyone say it.\n\n1:27:54.360 --> 1:27:58.600\n I'm trying to make Prometheus would like to discuss fire with everybody else.\n\n1:28:00.040 --> 1:28:00.160\n All right.\n\n1:28:00.160 --> 1:28:03.800\n I'm going to just say one thing to close out the earlier line, which is what I\n\n1:28:03.800 --> 1:28:05.120\n think we should have continued with.\n\n1:28:05.960 --> 1:28:10.960\n When you take the naturally occurring spinners, the unadorned spinners, the\n\n1:28:10.960 --> 1:28:18.120\n naked spinners, not on this 14 dimensional manifold, but on something very closely\n\n1:28:18.120 --> 1:28:23.400\n tied to it, which I've called the chimeric tangent bundle, that is the object\n\n1:28:24.000 --> 1:28:27.560\n which stands in for the thing that should have had length and angle on it,\n\n1:28:27.560 --> 1:28:28.480\n but just missed.\n\n1:28:28.600 --> 1:28:28.920\n Okay.\n\n1:28:30.440 --> 1:28:34.440\n When you take that object and you form spinners on that and you don't adorn them.\n\n1:28:34.440 --> 1:28:36.480\n So you're still in the single origin story.\n\n1:28:37.600 --> 1:28:43.800\n You get very large spin oriel objects upstairs on this 14 dimensional world.\n\n1:28:43.800 --> 1:28:46.520\n Why 14, which is part of the observers.\n\n1:28:46.520 --> 1:28:56.320\n When you pull that information back from Y 14 down to X four, it miraculously\n\n1:28:56.360 --> 1:29:03.800\n looks like the adorned spinners, the festoon spinners, the spinners that\n\n1:29:03.800 --> 1:29:05.920\n we play with in ordinary reality.\n\n1:29:06.720 --> 1:29:11.160\n In other words, the 14 dimensional world looks like a four dimensional world\n\n1:29:11.400 --> 1:29:13.640\n plus a 10 dimensional compliment.\n\n1:29:13.640 --> 1:29:17.960\n So 10 plus four equals 14, that 10 dimensional compliment, which is called\n\n1:29:17.960 --> 1:29:24.040\n a normal bundle, generates spin properties, internal quantum numbers that look like\n\n1:29:24.360 --> 1:29:30.160\n the things that give our, our particles personality that make let's say up quarks\n\n1:29:30.160 --> 1:29:36.080\n and down quarks charged by negative one third or plus two thirds, you know, that\n\n1:29:36.080 --> 1:29:42.640\n kind of stuff, or whether or not, you know, some quarks feel the weak side.\n\n1:29:42.640 --> 1:29:45.440\n Quarks feel the weak force and other quarks do not.\n\n1:29:46.520 --> 1:29:52.600\n So the X four generates Y 14 Y 14 generates something called the chimeric\n\n1:29:52.600 --> 1:29:56.160\n tangent bundle chimeric tangent bundle generates unadorned spinners.\n\n1:29:56.520 --> 1:30:00.760\n The unadorned spinners get pulled back from 14 down to four where they\n\n1:30:00.760 --> 1:30:02.320\n look like adorned spinners.\n\n1:30:03.200 --> 1:30:04.880\n And we have the right number of them.\n\n1:30:05.200 --> 1:30:06.600\n You thought you needed three.\n\n1:30:06.600 --> 1:30:10.720\n You only got two, but then something else that you'd never seen before\n\n1:30:10.720 --> 1:30:15.800\n broke apart on this journey and it broke into another copy of the thing that you\n\n1:30:15.800 --> 1:30:19.080\n already have two copies of one piece of that thing broke off.\n\n1:30:19.680 --> 1:30:25.200\n So now you have two generations plus an imposter third generation, which is, I\n\n1:30:25.200 --> 1:30:28.520\n don't know why we never talk about this possibility in regular physics.\n\n1:30:28.520 --> 1:30:31.760\n And then you've got a bunch of stuff that we haven't seen, which has descriptions.\n\n1:30:32.080 --> 1:30:34.800\n So people always say, does it make any falsifiable predictions?\n\n1:30:34.800 --> 1:30:35.480\n Yes, it does.\n\n1:30:35.480 --> 1:30:41.120\n It says that the matter that you should be seeing, um, next has particular\n\n1:30:41.120 --> 1:30:47.600\n properties that can be read off like, like a weak ISIS spin, weak hypercharge,\n\n1:30:47.640 --> 1:30:50.400\n like the responsiveness to the strong force.\n\n1:30:50.560 --> 1:30:53.160\n The one I can't tell you is what energy scale it would happen at.\n\n1:30:54.560 --> 1:30:58.760\n So you would, if you can't say if those characteristics can be\n\n1:30:58.760 --> 1:31:01.960\n detected with the current, but it may be that somebody else can.\n\n1:31:02.000 --> 1:31:02.920\n I'm not a physicist.\n\n1:31:02.920 --> 1:31:04.640\n I'm not a quantum field theorist.\n\n1:31:04.640 --> 1:31:07.240\n I can't, I don't know how you would do that.\n\n1:31:07.920 --> 1:31:14.640\n The hope for me is that there's some simple explanations for all of it.\n\n1:31:14.960 --> 1:31:16.160\n Like, should we have a drink?\n\n1:31:17.280 --> 1:31:18.280\n You're having fun.\n\n1:31:18.600 --> 1:31:20.160\n No, I'm trying to have fun with you.\n\n1:31:20.200 --> 1:31:26.240\n You know, there's a bunch of fun things to talk about here.\n\n1:31:26.840 --> 1:31:30.680\n Anyway, that was how I got what I thought you wanted, which is,\n\n1:31:30.680 --> 1:31:37.760\n if you think about the fermions as the artists and the bosons as the brushes\n\n1:31:37.760 --> 1:31:42.080\n and the paint, what I told you is that's how we get the artists.\n\n1:31:43.800 --> 1:31:46.240\n What are the open questions for you in this?\n\n1:31:46.280 --> 1:31:48.080\n What were the challenges?\n\n1:31:48.120 --> 1:31:49.040\n So you're not done.\n\n1:31:49.800 --> 1:31:53.560\n Well, there's, there's things that I would like to have in better order.\n\n1:31:53.600 --> 1:31:59.120\n So a lot of people will say, see, if you're going to do this, you have to\n\n1:31:59.120 --> 1:32:03.920\n say, see, the reason I hesitate on this is I just have a totally different\n\n1:32:03.920 --> 1:32:04.840\n view than the community.\n\n1:32:04.880 --> 1:32:10.640\n So for example, I believe that general relativity began in 1913\n\n1:32:10.640 --> 1:32:12.760\n with Einstein and Grossman.\n\n1:32:13.920 --> 1:32:19.360\n Now that was the first of like four major papers in this line of thinking.\n\n1:32:19.960 --> 1:32:25.800\n To most physicists, general relativity happened when Einstein produced, uh,\n\n1:32:25.800 --> 1:32:32.760\n a divergence free, um, gradient, which turned out to be the gradient of the,\n\n1:32:32.800 --> 1:32:35.840\n of the so called Hilbert or Einstein Hilbert action.\n\n1:32:36.800 --> 1:32:39.360\n And from my perspective, that wasn't true.\n\n1:32:39.400 --> 1:32:45.040\n This is that it began when Einstein said, look, this is about, um, differential\n\n1:32:45.040 --> 1:32:49.960\n geometry and it's the final answer is going to look like a curvature tensor\n\n1:32:50.000 --> 1:32:52.880\n on one side and matter and energy on the other side.\n\n1:32:53.280 --> 1:32:54.520\n And that was enough.\n\n1:32:54.520 --> 1:32:58.600\n And then he published a wrong version of it where it was the Ricci tensor,\n\n1:32:58.640 --> 1:32:59.920\n not the Einstein tensor.\n\n1:32:59.920 --> 1:33:03.200\n Then he corrected the reach, the Ricci tensor to make it into the Einstein\n\n1:33:03.200 --> 1:33:06.640\n tensor, then he corrected that to add a cosmological constant.\n\n1:33:08.600 --> 1:33:11.360\n I can't stand that the community thinks in those terms.\n\n1:33:11.840 --> 1:33:15.360\n There's some things about which, like there's a question about\n\n1:33:15.360 --> 1:33:17.040\n which contraction do I use?\n\n1:33:17.080 --> 1:33:18.680\n There's an Einstein contraction.\n\n1:33:19.120 --> 1:33:20.400\n There's a Ricci contraction.\n\n1:33:20.400 --> 1:33:22.240\n They both go between the same spaces.\n\n1:33:22.240 --> 1:33:23.800\n I'm not sure what I should do.\n\n1:33:23.840 --> 1:33:25.760\n I'm not sure which contraction I should choose.\n\n1:33:26.760 --> 1:33:30.960\n This is called a shiab operator for ship in a bottle and my stuff.\n\n1:33:32.040 --> 1:33:39.360\n You have this big platform in many ways that inspires people's\n\n1:33:39.360 --> 1:33:42.120\n curiosity about physics and mathematics.\n\n1:33:42.160 --> 1:33:42.680\n Right.\n\n1:33:43.920 --> 1:33:50.960\n Now, and I'm one of those people and, but then you start using a lot of words\n\n1:33:50.960 --> 1:33:57.960\n that I don't understand and, or like I might know them, but I don't understand.\n\n1:33:58.400 --> 1:34:03.160\n And what's unclear to me, if I'm supposed to be listening to those words, or if\n\n1:34:03.160 --> 1:34:08.280\n it's just, if this is one of those technical things that's intended for\n\n1:34:08.280 --> 1:34:13.440\n a very small community, or if I'm supposed to actually take those words and start,\n\n1:34:14.280 --> 1:34:20.240\n you know, a multi year study, not, not a serious study, but a, the community\n\n1:34:20.240 --> 1:34:24.320\n study, but the kind of study when you, you're interested in learning about\n\n1:34:24.320 --> 1:34:28.040\n machine learning, for example, or any kind of discipline, that's where\n\n1:34:28.040 --> 1:34:29.400\n I'm a little bit confused.\n\n1:34:29.400 --> 1:34:32.840\n So you've, you've speak beautifully about ideas.\n\n1:34:32.840 --> 1:34:39.960\n You often reveal the beauty in math, in geometry, and I'm unclear in what\n\n1:34:39.960 --> 1:34:41.720\n are the steps I should be taking.\n\n1:34:42.040 --> 1:34:45.640\n I, I'm curious, how can I explore?\n\n1:34:45.640 --> 1:34:46.880\n How can I play with something?\n\n1:34:46.880 --> 1:34:48.440\n How can I play with these ideas?\n\n1:34:48.440 --> 1:34:52.400\n And, and, and enjoy the beauty of not necessarily understanding the\n\n1:34:52.400 --> 1:34:56.280\n depth of the theory that you're presenting, but start to share in the\n\n1:34:56.280 --> 1:35:01.480\n beauty, as opposed to sharing and enjoying the beauty of just the way,\n\n1:35:01.680 --> 1:35:08.360\n the passion with which you speak, which is in itself fun to listen to, but\n\n1:35:08.520 --> 1:35:14.160\n also starting to be able to understand some aspects of this theory that I can\n\n1:35:14.160 --> 1:35:19.520\n enjoy it to, and start to build an intuition, what the heck we're even\n\n1:35:19.520 --> 1:35:23.240\n talking about, because you're basically saying we need to throw a lot of our\n\n1:35:23.240 --> 1:35:27.480\n ideas of, of views of the universe out.\n\n1:35:29.200 --> 1:35:36.200\n And I'm trying to find accessible ways in, not in this conversation.\n\n1:35:36.960 --> 1:35:37.760\n No, I appreciate that.\n\n1:35:37.800 --> 1:35:40.600\n So one of the things that I've done is I've, I've picked on one\n\n1:35:40.600 --> 1:35:46.400\n paragraph from Edward Witten, and I said, this is the paragraph.\n\n1:35:46.480 --> 1:35:49.760\n If I could only take one paragraph with me, this is the one I'd take.\n\n1:35:49.840 --> 1:35:52.000\n And it's almost all in prose, not an equation.\n\n1:35:53.360 --> 1:35:55.480\n And he says, look, this is, this is our knowledge of the\n\n1:35:55.480 --> 1:35:57.080\n universe at its deepest level.\n\n1:35:57.120 --> 1:35:58.800\n And he was writing this during the 1980s.\n\n1:35:59.720 --> 1:36:03.640\n And he has three separate points that constitute our deepest knowledge.\n\n1:36:04.520 --> 1:36:08.840\n And those three points refer to equations, one to the Einstein field\n\n1:36:08.840 --> 1:36:12.760\n equation, one to the Dirac equation, and one to the Yang Mills Maxwell equation.\n\n1:36:14.480 --> 1:36:20.440\n Now, one thing I would do is take a look at that paragraph and say, okay,\n\n1:36:20.760 --> 1:36:22.680\n what do these three lines mean?\n\n1:36:22.920 --> 1:36:24.560\n Like it's a finite amount of verbiage.\n\n1:36:24.560 --> 1:36:26.520\n You can write down every word that you don't know.\n\n1:36:27.720 --> 1:36:32.000\n And you can say, what do I think done now?\n\n1:36:32.680 --> 1:36:33.200\n Young man.\n\n1:36:33.560 --> 1:36:33.920\n Yes.\n\n1:36:33.920 --> 1:36:39.400\n There's a beautiful wall in Stony Brook, New York built by someone\n\n1:36:39.400 --> 1:36:44.920\n who I know you will interview named Jim Simons and Jim Simons.\n\n1:36:45.160 --> 1:36:47.360\n He's not the artist, but he's the guy who funded it.\n\n1:36:47.720 --> 1:36:49.400\n World's greatest hedge fund manager.\n\n1:36:49.720 --> 1:36:53.360\n And on that wall contain the three equations that Witten\n\n1:36:53.360 --> 1:36:56.280\n refers to in that paragraph.\n\n1:36:56.880 --> 1:37:01.840\n And so that is the transmission from the paragraph or graph to the wall.\n\n1:37:01.840 --> 1:37:07.320\n Now that wall needs an owner's manual, which Roger Penrose has written\n\n1:37:07.640 --> 1:37:08.920\n called the road to reality.\n\n1:37:09.400 --> 1:37:10.600\n And let's call that the tome.\n\n1:37:11.480 --> 1:37:17.400\n So this is the subject of the so called graph wall tome project that is going\n\n1:37:17.400 --> 1:37:22.600\n on in our discord server and our general group around the portal community, which\n\n1:37:22.600 --> 1:37:28.520\n is how do you take something that purports in one paragraph to say what the deepest\n\n1:37:28.520 --> 1:37:34.760\n understanding man has of the universe in which he lives, it's memorialized on a\n\n1:37:34.760 --> 1:37:40.600\n wall, which nobody knows about, which is an incredibly gorgeous piece of, uh, of\n\n1:37:40.600 --> 1:37:40.920\n art.\n\n1:37:41.920 --> 1:37:46.560\n And that was written up in a book, which is, has been written for no man.\n\n1:37:47.280 --> 1:37:47.520\n Right.\n\n1:37:47.960 --> 1:37:48.960\n Maybe, maybe it's for a woman.\n\n1:37:48.960 --> 1:37:52.920\n I don't know, but no, no one should be able to read this book because either\n\n1:37:52.920 --> 1:37:56.560\n you're a professional and you know, a lot of this book, in which case it's kind of\n\n1:37:56.560 --> 1:38:00.880\n a refresher to see how Roger thinks about these things, or you don't even know that\n\n1:38:00.880 --> 1:38:05.560\n this book is a self contained, uh, invitation to understanding our deepest\n\n1:38:05.560 --> 1:38:05.960\n nature.\n\n1:38:06.680 --> 1:38:12.360\n So I would say find yourself in the graph wall tome transmission sequence and join\n\n1:38:12.360 --> 1:38:15.000\n the graph wall tome project if that's of interest.\n\n1:38:15.800 --> 1:38:16.000\n Okay.\n\n1:38:16.040 --> 1:38:16.600\n Beautiful.\n\n1:38:17.000 --> 1:38:20.440\n Uh, now just to linger on a little longer, what kind of journey do you\n\n1:38:20.440 --> 1:38:22.320\n see geometric community taking?\n\n1:38:22.640 --> 1:38:23.200\n I don't know.\n\n1:38:23.600 --> 1:38:25.160\n I mean, that's the thing is that.\n\n1:38:25.160 --> 1:38:28.280\n First of all, the professional community has to get very angry and outraged and\n\n1:38:28.280 --> 1:38:31.520\n they have to work through their feeling that this is nonsense.\n\n1:38:31.520 --> 1:38:33.920\n This is bullshit or like, no, wait a minute.\n\n1:38:33.920 --> 1:38:35.000\n This is really cool.\n\n1:38:35.440 --> 1:38:37.280\n Actually, I need some clarification over here.\n\n1:38:37.280 --> 1:38:41.480\n So there's going to be some sort of weird coming back together process.\n\n1:38:41.560 --> 1:38:45.360\n Are you already hearing murmurings of that?\n\n1:38:45.720 --> 1:38:46.640\n It was very funny.\n\n1:38:46.680 --> 1:38:47.960\n Officially I've seen very little.\n\n1:38:50.160 --> 1:38:52.000\n So it's perhaps happening quietly.\n\n1:38:52.040 --> 1:38:52.400\n Yeah.\n\n1:38:52.400 --> 1:38:54.800\n You, you often talk about, we need to get off this planet.\n\n1:38:55.200 --> 1:38:55.520\n Yep.\n\n1:38:57.320 --> 1:39:01.920\n Can I try to sneak up on that by asking what in your kind of view is the\n\n1:39:01.920 --> 1:39:07.760\n difference, the gap between the science of it, the theory and the actual\n\n1:39:07.760 --> 1:39:11.320\n engineering of building something that leverages the theory to do something?\n\n1:39:11.320 --> 1:39:12.400\n Like how big is that?\n\n1:39:12.800 --> 1:39:13.320\n We don't know.\n\n1:39:13.920 --> 1:39:14.320\n Gap.\n\n1:39:14.880 --> 1:39:19.320\n I mean, if you have 10 extra dimensions to play with that are the rules of\n\n1:39:19.320 --> 1:39:22.920\n protractors of the world themselves, can you gain access to those dimensions?\n\n1:39:25.320 --> 1:39:26.280\n Do you have a hunch?\n\n1:39:26.320 --> 1:39:27.600\n So I don't know.\n\n1:39:28.480 --> 1:39:31.840\n I don't want to get ahead of myself because you have to appreciate, I can\n\n1:39:31.840 --> 1:39:34.080\n have hunches and I can, I can jaw off.\n\n1:39:35.360 --> 1:39:42.280\n But one of the ways that I'm succeeding in this world is to not bow down to my\n\n1:39:42.280 --> 1:39:44.760\n professional communities nor to ignore them.\n\n1:39:45.080 --> 1:39:47.720\n Like I'm actually in the middle of a world where I'm not\n\n1:39:47.720 --> 1:39:50.840\n going to ignore them, like I'm actually interested in the criticism.\n\n1:39:50.840 --> 1:39:56.720\n I just want to denature it so that it's not mostly interpersonal and irrelevant.\n\n1:39:58.920 --> 1:40:01.560\n I believe that they don't want me to speculate and I don't\n\n1:40:01.560 --> 1:40:02.960\n need to speculate about this.\n\n1:40:02.960 --> 1:40:08.000\n I can simply say I'm open to the idea that it may have engineering prospects\n\n1:40:08.000 --> 1:40:09.480\n and it may be a death sentence.\n\n1:40:09.480 --> 1:40:15.360\n We may find out that there's not enough new here that even if it were right, that\n\n1:40:15.360 --> 1:40:16.360\n there would be nothing new to do.\n\n1:40:16.360 --> 1:40:19.560\n Can't tell you that's what you mean by death sentences.\n\n1:40:19.640 --> 1:40:21.480\n There would not be exciting breakthroughs.\n\n1:40:21.480 --> 1:40:25.600\n Wouldn't it be terrible if you couldn't, like you can do new things in an\n\n1:40:25.600 --> 1:40:29.520\n Einsteinian world that you couldn't do in a Newtonian world, right?\n\n1:40:29.520 --> 1:40:33.200\n You know, like you have twin paradoxes or Lorentz contraction of length or\n\n1:40:33.200 --> 1:40:36.800\n any one of a number of new cool things happen in relativity theory\n\n1:40:36.800 --> 1:40:38.040\n that didn't happen for Newton.\n\n1:40:38.640 --> 1:40:43.040\n What if there wasn't new stuff to do at the next and final level?\n\n1:40:43.040 --> 1:40:46.600\n Yeah, that would be quite sad.\n\n1:40:47.880 --> 1:40:52.600\n Let me ask a silly question, but we'll say it with a straight face.\n\n1:40:55.480 --> 1:40:56.160\n Impossible.\n\n1:40:57.400 --> 1:41:01.640\n So let me mention Elon Musk.\n\n1:41:01.680 --> 1:41:07.680\n What are your thoughts about he's more, you're more on the physics theory side\n\n1:41:07.680 --> 1:41:11.400\n of things, he's more on the physics engineering side of things in terms of\n\n1:41:11.400 --> 1:41:17.560\n SpaceX efforts, what do you think of his efforts to, uh, get off this planet?\n\n1:41:18.920 --> 1:41:24.840\n Well, I think he's the other guy who's semi serious about getting off this planet.\n\n1:41:26.360 --> 1:41:29.000\n I think there are two of us who are semi serious about getting off the planet.\n\n1:41:29.480 --> 1:41:33.600\n What do you think about his methodology and yours when you look at them?\n\n1:41:33.600 --> 1:41:38.480\n Don't, and I don't want to be against you because like I was so excited that like\n\n1:41:38.480 --> 1:41:42.920\n your top video was Ray Kurzweil and then I did your podcast and we had some\n\n1:41:42.920 --> 1:41:46.200\n chemistry, so it zoomed up and I thought, okay, I'm going to beat Ray Kurzweil.\n\n1:41:46.200 --> 1:41:50.720\n So just as I'm coming up on Ray Kurzweil, you're like, and now Alex Fridman\n\n1:41:50.720 --> 1:41:53.360\n special Elon Musk and he blew me out of the water.\n\n1:41:53.400 --> 1:41:54.680\n So I don't want to be petty about it.\n\n1:41:55.240 --> 1:41:58.080\n I want to say that I don't, but I am.\n\n1:41:58.640 --> 1:41:59.000\n Okay.\n\n1:41:59.000 --> 1:41:59.960\n But here's the funny part.\n\n1:42:00.560 --> 1:42:02.720\n Um, he's not taking enough risk.\n\n1:42:03.840 --> 1:42:05.280\n Like he's trying to get us to Mars.\n\n1:42:05.280 --> 1:42:12.360\n Imagine that he got us to Mars, the moon, and we'll throw in Titan and nowhere\n\n1:42:12.360 --> 1:42:15.400\n good enough, the diversification level is too low.\n\n1:42:15.400 --> 1:42:17.160\n Now there's a compatibility.\n\n1:42:18.280 --> 1:42:20.920\n First of all, I don't think Elon is serious about Mars.\n\n1:42:22.680 --> 1:42:29.080\n I think Elon is using Mars as a, as a narrative, as a story, as a dream to\n\n1:42:29.080 --> 1:42:33.640\n make the moon jealous to make the, uh,\n\n1:42:33.640 --> 1:42:39.160\n uh, I think he's using it as a story to organize us, to reacquaint ourselves\n\n1:42:39.160 --> 1:42:42.240\n with our need for space, our need to get off this planet.\n\n1:42:42.240 --> 1:42:43.480\n It's a concrete thing.\n\n1:42:43.720 --> 1:42:48.800\n He shown that, um, many people think that he's shown that he's the most\n\n1:42:48.800 --> 1:42:50.840\n brilliant and capable person on the planet.\n\n1:42:50.840 --> 1:42:52.120\n I don't think that's what he showed.\n\n1:42:52.120 --> 1:42:55.000\n I think he showed that the rest of us have forgotten our capabilities.\n\n1:42:55.520 --> 1:42:59.320\n And so he's like the only guy who has still kept the faith and is like,\n\n1:42:59.320 --> 1:43:00.560\n what's wrong with you people?\n\n1:43:00.560 --> 1:43:04.360\n So you think the lesson we should draw from Elon Musk is there's, uh, there's\n\n1:43:04.360 --> 1:43:09.600\n a capable person within, within a lot of us, Elon makes sense to me in what way\n\n1:43:10.480 --> 1:43:12.520\n he's doing, what any sensible person should do.\n\n1:43:12.520 --> 1:43:17.400\n He's trying incredible things and he's partially succeeding, partially failing\n\n1:43:17.440 --> 1:43:21.640\n to try to solve the obvious problems before, you know, when he comes up with\n\n1:43:21.640 --> 1:43:23.800\n things like, uh, you know, I got it.\n\n1:43:24.040 --> 1:43:26.680\n We'll come up with a battery company, but batteries aren't sexy.\n\n1:43:26.680 --> 1:43:28.400\n So we'll, we'll make a car around it.\n\n1:43:28.400 --> 1:43:33.320\n It's like, great, you know, or, um, any one of a number of things.\n\n1:43:34.760 --> 1:43:39.400\n Elon is behaving like a sane person and I view everyone else is insane.\n\n1:43:40.200 --> 1:43:44.680\n And my feeling is, is that we really have to get off this planet.\n\n1:43:45.080 --> 1:43:46.040\n We have to get out of this.\n\n1:43:46.080 --> 1:43:47.320\n We have to get out of the neighborhood.\n\n1:43:48.560 --> 1:43:49.600\n To linger on a little bit.\n\n1:43:49.640 --> 1:43:53.000\n Do you think that's a physics problem or an engineering problem?\n\n1:43:54.040 --> 1:43:55.400\n I think it's a cowardice problem.\n\n1:43:55.400 --> 1:44:01.800\n I think that we're afraid that we had 400 hitters of the mind, like Einstein\n\n1:44:01.800 --> 1:44:03.880\n and Dirac and that, that era is done.\n\n1:44:03.880 --> 1:44:07.880\n And now we're just sort of copy editors.\n\n1:44:07.920 --> 1:44:13.640\n So it's some of it money, like if we become brave enough to go outside the\n\n1:44:13.640 --> 1:44:17.160\n solar system, can we afford to financially?\n\n1:44:17.560 --> 1:44:19.840\n Well, I think that that's not really the issue.\n\n1:44:19.840 --> 1:44:27.760\n The issue is look what Elon did well, he amassed a lot of money and then he,\n\n1:44:28.240 --> 1:44:31.880\n you know, he plowed it back in and he spun, spun the wheel and he made more\n\n1:44:31.880 --> 1:44:34.360\n money and now he's got F you money.\n\n1:44:35.000 --> 1:44:41.640\n Now the problem is, is that a lot of the people who have F you money are not\n\n1:44:41.640 --> 1:44:43.760\n people whose middle finger you ever want to see.\n\n1:44:43.800 --> 1:44:45.520\n I want to see Elon's middle finger.\n\n1:44:46.600 --> 1:44:47.960\n I want to see what he's doing by that.\n\n1:44:47.960 --> 1:44:50.800\n Or like when you say, fuck it, I'm going to do the biggest possible.\n\n1:44:50.800 --> 1:44:53.160\n Do whatever the fuck you want, right?\n\n1:44:53.280 --> 1:44:54.080\n Fuck you.\n\n1:44:54.080 --> 1:44:57.480\n Fuck anything that gets in his way that he can afford to push out of his way.\n\n1:44:57.480 --> 1:44:59.880\n And you're saying he's not actually even doing that enough.\n\n1:45:00.280 --> 1:45:02.440\n No, I'm he's not going, please.\n\n1:45:02.440 --> 1:45:03.040\n I'm going to go.\n\n1:45:03.360 --> 1:45:05.200\n Elon's doing fine with his money.\n\n1:45:05.240 --> 1:45:11.000\n I just want him to enjoy himself, have the most, you know, Dionysian, but\n\n1:45:11.000 --> 1:45:13.400\n you're saying Mars is playing it safe.\n\n1:45:14.480 --> 1:45:15.800\n He doesn't know how to do anything else.\n\n1:45:15.800 --> 1:45:24.880\n He knows rockets and he might know some physics at a fundamental level.\n\n1:45:25.120 --> 1:45:25.640\n Yeah.\n\n1:45:25.640 --> 1:45:30.440\n I guess, okay, just, let me just go right back to how much physics do you really,\n\n1:45:30.520 --> 1:45:34.400\n how much brilliant breakthrough ideas on the physics side do you\n\n1:45:34.400 --> 1:45:36.480\n need to get off this planet?\n\n1:45:37.480 --> 1:45:38.320\n I don't know.\n\n1:45:38.400 --> 1:45:41.520\n And I don't know whether like in my most optimistic dream, I don't know\n\n1:45:41.520 --> 1:45:42.920\n whether my stuff gets us out of this.\n\n1:45:42.920 --> 1:45:46.080\n Like in my most optimistic dream, I don't know whether my stuff gets us off the\n\n1:45:46.080 --> 1:45:51.200\n planet, but it's hope it's hope that there's a more fundamental theory that\n\n1:45:51.200 --> 1:45:53.640\n we can access that we don't need.\n\n1:45:54.120 --> 1:46:00.040\n Um, you know, whose elegance and beauty will suggest that this is probably\n\n1:46:00.040 --> 1:46:01.280\n the way the universe goes.\n\n1:46:01.400 --> 1:46:06.160\n Like you have to say this weird thing, which is this, I believe, and this,\n\n1:46:06.160 --> 1:46:11.560\n I believe is a very dangerous statement, but this, I believe, I believe that my\n\n1:46:11.560 --> 1:46:18.280\n theory, um, points the way now, Elon might or might not be able to access my\n\n1:46:18.280 --> 1:46:18.680\n theory.\n\n1:46:18.680 --> 1:46:19.160\n I don't know.\n\n1:46:19.200 --> 1:46:25.400\n I don't know what he knows, but keep in mind, why are we all so focused on Elon?\n\n1:46:25.720 --> 1:46:26.600\n It's really weird.\n\n1:46:26.640 --> 1:46:27.720\n It's kind of creepy too.\n\n1:46:28.320 --> 1:46:32.240\n Why he's just the person who's just asking the, the obvious questions\n\n1:46:32.240 --> 1:46:35.000\n and doing whatever he can, but he makes sense to me.\n\n1:46:35.040 --> 1:46:37.080\n You see Craig Venter makes sense to me.\n\n1:46:37.080 --> 1:46:41.000\n Jim Watson makes sense to me, but we're focusing on Elon.\n\n1:46:41.000 --> 1:46:43.360\n Because he's, he's somehow is rare.\n\n1:46:44.160 --> 1:46:45.360\n Well, that's the weird thing.\n\n1:46:45.560 --> 1:46:50.520\n Like we've come up with a system that eliminates all Elon from our pipeline\n\n1:46:51.280 --> 1:46:56.600\n and Elon somehow, uh, snuck through when they weren't quality adjusting\n\n1:46:56.600 --> 1:46:57.360\n everything, you know?\n\n1:46:57.840 --> 1:47:02.200\n And this, this idea of, uh, of disc, right?\n\n1:47:02.200 --> 1:47:04.440\n Distributed idea suppression complex.\n\n1:47:04.480 --> 1:47:04.840\n Yeah.\n\n1:47:04.880 --> 1:47:08.920\n Is that what's bringing the Elans of the world down?\n\n1:47:09.520 --> 1:47:10.320\n You know, it's so funny.\n\n1:47:10.320 --> 1:47:14.520\n It's like, he's asking Joe Rogan, like, is that a joint, you know, it's like,\n\n1:47:14.520 --> 1:47:16.240\n well, what, what will happen if I smoke it?\n\n1:47:16.240 --> 1:47:17.560\n What will happen to the stock price?\n\n1:47:17.920 --> 1:47:20.480\n What will happen if I scratch myself in public?\n\n1:47:20.840 --> 1:47:26.200\n What will happen if I say what I think about Thailand or COVID or who knows what?\n\n1:47:26.800 --> 1:47:30.040\n And everybody's like, don't say that, say this, go do this, go do that.\n\n1:47:30.400 --> 1:47:34.440\n Well, it's crazy making, it's absolutely crazy making.\n\n1:47:34.440 --> 1:47:41.240\n And if you think about what we put through people through, um, we, we\n\n1:47:41.240 --> 1:47:46.840\n need to get people who can use FU money, the FU money they need to insulate\n\n1:47:46.840 --> 1:47:51.720\n themselves from all of the people who know better, because the, the, my\n\n1:47:51.720 --> 1:47:55.320\n nightmare is, is that why did we only get one Elon?\n\n1:47:55.640 --> 1:47:58.520\n What if we were supposed to have thousands and thousands of Elans?\n\n1:47:59.080 --> 1:48:03.400\n And the weird thing is like, this is all that remains you're, you're looking\n\n1:48:03.400 --> 1:48:09.240\n at like OB one and Yoda, and it's like, this is the only, this is all that's\n\n1:48:09.240 --> 1:48:13.520\n left after X, uh, order 66 has been executed.\n\n1:48:14.320 --> 1:48:16.720\n And that's the thing that's really upsetting to me is we used, we\n\n1:48:16.720 --> 1:48:18.520\n used to have Elon's five deep.\n\n1:48:18.600 --> 1:48:22.920\n And then we could talk about Elon in the context of his cohort.\n\n1:48:23.400 --> 1:48:27.320\n But this is like, if you were to see a giraffe in the Arctic with no\n\n1:48:27.320 --> 1:48:32.200\n trees around, you'd think why the long neck, what a strange sight, you know?\n\n1:48:32.200 --> 1:48:34.640\n You know, how do we get more Elans?\n\n1:48:35.880 --> 1:48:36.880\n How do we change these?\n\n1:48:37.000 --> 1:48:44.520\n So I think the use, so we know MIT and Harvard, so maybe returning to our\n\n1:48:44.520 --> 1:48:48.800\n previous conversation, my sense is that the Elans of the world are supposed\n\n1:48:48.800 --> 1:48:50.680\n to come from MIT and Harvard, right?\n\n1:48:51.240 --> 1:48:53.040\n And how do you change?\n\n1:48:53.160 --> 1:48:55.520\n Let's think of one that MIT sort of killed.\n\n1:48:57.480 --> 1:48:58.600\n Have any names in mind?\n\n1:48:58.600 --> 1:49:00.840\n Aaron Schwartz leaps to my mind.\n\n1:49:01.440 --> 1:49:01.760\n Yeah.\n\n1:49:01.920 --> 1:49:02.400\n Okay.\n\n1:49:02.600 --> 1:49:11.720\n Are we MIT supposed to shield the Aaron Schwartz's from, I don't know, journal\n\n1:49:11.720 --> 1:49:15.640\n publishers, or are we supposed to help the journal publishers so that we can\n\n1:49:15.640 --> 1:49:19.840\n throw 35 year sentences in his face or whatever it is that we did that depressed\n\n1:49:19.840 --> 1:49:20.960\n him? Okay.\n\n1:49:21.000 --> 1:49:22.000\n So here's my point.\n\n1:49:22.080 --> 1:49:22.400\n Yeah.\n\n1:49:22.400 --> 1:49:29.240\n I want MIT to go back to being the home of Aaron Schwartz, and if you want to\n\n1:49:29.240 --> 1:49:36.440\n send Aaron Schwartz to a state where he's looking at 35 years in prison or\n\n1:49:36.440 --> 1:49:38.800\n something like that, you are my sworn enemy.\n\n1:49:39.560 --> 1:49:40.600\n You are not MIT.\n\n1:49:41.800 --> 1:49:42.040\n Yeah.\n\n1:49:42.040 --> 1:49:53.920\n You are the traitors, uh, irresponsible, middle brow, pencil pushing green\n\n1:49:53.920 --> 1:49:59.160\n eyeshade fool that needs to not be in the seat at the, at the presidency of MIT\n\n1:49:59.160 --> 1:50:03.360\n period, the end, get the fuck out of there and let one of our people sit in that\n\n1:50:03.360 --> 1:50:03.880\n chair.\n\n1:50:04.080 --> 1:50:10.160\n And the thing that you've articulated is that the people in those chairs are not\n\n1:50:10.160 --> 1:50:15.240\n the way they are because they're evil or somehow morally compromised is that it's\n\n1:50:15.240 --> 1:50:19.280\n just the, that's the distributed nature is that there's some kind of aspect of\n\n1:50:19.280 --> 1:50:25.400\n the system that people who wed themselves to the system, they adapt every instinct.\n\n1:50:25.600 --> 1:50:30.880\n And the fact is, is that they're not going to be on Joe Rogan smoking a blunt.\n\n1:50:32.120 --> 1:50:33.280\n Let me ask a silly question.\n\n1:50:33.280 --> 1:50:36.400\n Do you think institutions generally just tend to become that?\n\n1:50:38.000 --> 1:50:38.400\n No.\n\n1:50:38.400 --> 1:50:41.320\n We get some of the institutions, we get Caltech.\n\n1:50:41.920 --> 1:50:42.960\n Here's what we're supposed to have.\n\n1:50:42.960 --> 1:50:44.320\n We're supposed to have Caltech.\n\n1:50:44.320 --> 1:50:45.600\n We're supposed to have a read.\n\n1:50:46.360 --> 1:50:48.000\n We're supposed to have deep springs.\n\n1:50:49.520 --> 1:50:50.760\n We're supposed to have MIT.\n\n1:50:50.760 --> 1:50:52.680\n We're supposed to have a part of Harvard.\n\n1:50:54.040 --> 1:50:58.200\n And when the sharp elbow crowd comes after the shelf, sharp, uh, mind crowd,\n\n1:50:58.200 --> 1:51:01.840\n we're supposed to break those sharp elbows and say, don't come around here\n\n1:51:01.840 --> 1:51:02.160\n again.\n\n1:51:02.400 --> 1:51:06.320\n So what are the weapons that the sharp minds are supposed to use in our modern\n\n1:51:06.320 --> 1:51:06.680\n day?\n\n1:51:06.680 --> 1:51:11.160\n So to reclaim MIT, what, what is the, what's the future?\n\n1:51:11.160 --> 1:51:12.000\n Are you kidding me?\n\n1:51:12.480 --> 1:51:15.440\n First of all, assume that this is being seen at MIT.\n\n1:51:15.920 --> 1:51:17.760\n Hey everybody is okay.\n\n1:51:18.640 --> 1:51:21.760\n Hey everybody, try to remember who you are.\n\n1:51:22.240 --> 1:51:25.280\n You're the guys who put the police car on top of the great dump.\n\n1:51:25.680 --> 1:51:28.080\n You guys came up with the great breast of knowledge.\n\n1:51:28.120 --> 1:51:30.480\n You created a Tetris game in the green building.\n\n1:51:31.360 --> 1:51:33.920\n Now, what is your problem?\n\n1:51:33.920 --> 1:51:37.080\n Is your problem they killed one of your own.\n\n1:51:37.440 --> 1:51:39.960\n You should make their life a living hell.\n\n1:51:40.960 --> 1:51:45.720\n You should be the ones who keep the mayor memory of Aaron Schwartz alive and all\n\n1:51:45.720 --> 1:51:50.240\n of those hackers and all of those mutants, you know,\n\n1:51:50.360 --> 1:51:53.440\n it's like it's either our place or it isn't.\n\n1:51:54.160 --> 1:51:58.760\n And if we have to throw 12 more pianos off of the\n\n1:51:58.760 --> 1:52:01.040\n roof, right?\n\n1:52:01.040 --> 1:52:05.240\n If Harold Edgerton was taking those photographs, you know,\n\n1:52:06.240 --> 1:52:08.080\n uh, with slow mo back in the forties,\n\n1:52:10.520 --> 1:52:13.720\n if Noam Chomsky is on your faculty,\n\n1:52:13.800 --> 1:52:15.760\n what the hell is wrong with you kids?\n\n1:52:16.120 --> 1:52:19.880\n You are the most creative and insightful people and you can't figure out how to\n\n1:52:19.880 --> 1:52:22.240\n defend Aaron Schwartz. That's on you guys.\n\n1:52:22.560 --> 1:52:25.840\n So some of that is giving more power to the young, like you said,\n\n1:52:25.880 --> 1:52:30.200\n no, it's taking power from taking power from the feeble and the middle\n\n1:52:30.200 --> 1:52:32.920\n Brown. Yeah. But how do you, what is the mechanism to me?\n\n1:52:32.920 --> 1:52:37.280\n I don't know. You, you have some nine volt batteries, copper wire.\n\n1:52:38.200 --> 1:52:41.480\n I, uh, I tend to, do you have a capacitor?\n\n1:52:41.720 --> 1:52:46.400\n I tend to believe you have to create an alternative and, uh,\n\n1:52:46.440 --> 1:52:51.400\n make the alternative so much better that it makes MIT obsolete unless\n\n1:52:51.400 --> 1:52:56.280\n they change. And that's what forces change. So as opposed to somehow,\n\n1:52:56.280 --> 1:53:00.000\n okay, so use projection mapping, what's projection mapping,\n\n1:53:00.240 --> 1:53:04.200\n where you take some complicated edifice and you map all of its planes.\n\n1:53:04.240 --> 1:53:07.160\n And then you actually project some unbelievable graphics,\n\n1:53:07.160 --> 1:53:10.120\n re skinning a building, let's say at night. That's right. Yeah. Okay.\n\n1:53:10.120 --> 1:53:13.560\n So you want to do some graffiti art with like basically want to hack the system.\n\n1:53:13.600 --> 1:53:17.840\n No, I'm saying, look, listen to me. Yeah. We're smarter than they are.\n\n1:53:18.600 --> 1:53:21.240\n And they, you know what they say? They say things like,\n\n1:53:21.240 --> 1:53:25.520\n okay, I think we need some geeks. Get me two PhDs.\n\n1:53:26.600 --> 1:53:30.360\n Right. You treat PhDs like that. That's a bad move.\n\n1:53:31.200 --> 1:53:35.800\n Because PhDs are capable and we act like our job is to peel\n\n1:53:35.800 --> 1:53:37.280\n grapes for our betters.\n\n1:53:37.600 --> 1:53:39.120\n Yeah. That's a strange thing. And I,\n\n1:53:39.120 --> 1:53:43.800\n I you speak about it very eloquently is how we treat basically\n\n1:53:43.800 --> 1:53:48.520\n the greatest minds in the world, which is like at their prime,\n\n1:53:48.520 --> 1:53:52.840\n which is PhD students like that. We pay them nothing.\n\n1:53:54.160 --> 1:53:57.880\n Uh, I'm done with it. Yeah. Right. We got to take what's ours.\n\n1:53:58.840 --> 1:54:03.040\n So, so take back MIT, become ungovernable,\n\n1:54:04.040 --> 1:54:08.920\n become ungovernable. And by the way, when you become ungovernable,\n\n1:54:08.920 --> 1:54:10.640\n don't do it by throwing food.\n\n1:54:12.400 --> 1:54:15.360\n Don't do it by pouring salt on the lawn, like a jerk,\n\n1:54:15.360 --> 1:54:19.720\n do it through brilliance, because what you Caltech and MIT can do,\n\n1:54:19.720 --> 1:54:23.760\n and maybe Rensselaer Polytechnic or Worcester Polytech, I don't know.\n\n1:54:23.760 --> 1:54:27.440\n Lehigh. God damn it. What's wrong with you technical people?\n\n1:54:27.440 --> 1:54:29.520\n You act like you're a servant class.\n\n1:54:30.400 --> 1:54:33.800\n It's unclear to me how you reclaim it except with brilliance,\n\n1:54:33.800 --> 1:54:35.240\n like you said. Uh,\n\n1:54:35.480 --> 1:54:39.000\n but to me that the way you reclaim it with brilliance is to go outside the\n\n1:54:39.000 --> 1:54:39.440\n system.\n\n1:54:39.440 --> 1:54:42.200\n Aaron Schwartz came from the Elon Musk class.\n\n1:54:42.200 --> 1:54:44.920\n What are you guys going to do about it? Right.\n\n1:54:44.920 --> 1:54:49.920\n The super capable people need to flex,\n\n1:54:49.960 --> 1:54:53.080\n need to be individual. They need to stop giving away all their power to,\n\n1:54:53.160 --> 1:54:56.800\n you know, a zeitgeist or a community or this or that you're not,\n\n1:54:56.840 --> 1:54:59.760\n you're not indoor cats. You're outdoor cats. Go be outdoor cats.\n\n1:54:59.800 --> 1:55:03.400\n Do you think we're going to see this, this kind of one asking me, you know,\n\n1:55:03.400 --> 1:55:06.200\n before, like what about the world war II generation? Right.\n\n1:55:06.280 --> 1:55:06.400\n Oh,\n\n1:55:06.400 --> 1:55:10.520\n and I'm trying to say is that there's a technical revolt coming here's you want\n\n1:55:10.520 --> 1:55:13.360\n to talk about it, but I'm trying to lead it. I'm trying to see,\n\n1:55:13.360 --> 1:55:15.680\n no, you're not trying to lead it. I'm trying to get a blueprint here.\n\n1:55:15.680 --> 1:55:16.720\n All right, Lex. Yeah.\n\n1:55:17.120 --> 1:55:22.120\n How angry are you about our country pretending that you and I can't actually do\n\n1:55:22.480 --> 1:55:25.480\n technical subjects so that they need an army of, uh,\n\n1:55:26.040 --> 1:55:28.640\n kids coming in from four countries in Asia.\n\n1:55:29.160 --> 1:55:32.080\n It's not about the four countries in Asia. It's not about those kids.\n\n1:55:32.640 --> 1:55:35.840\n It's about lying about us that we don't care enough about science and\n\n1:55:35.840 --> 1:55:40.840\n technology that we're incapable of it as if we don't have Chinese and Russians\n\n1:55:40.840 --> 1:55:45.640\n and Russians and Koreans and Croatians. Like we've got everybody here.\n\n1:55:46.360 --> 1:55:48.600\n The only reason you're looking outside is,\n\n1:55:48.600 --> 1:55:52.160\n is that you want to hire cheap people from the family business because you don't\n\n1:55:52.160 --> 1:55:55.240\n want to pass the family business on. And you know what?\n\n1:55:56.120 --> 1:55:59.840\n You didn't really build the family business. It's not yours to decide.\n\n1:56:00.400 --> 1:56:03.720\n You the boomers and you the silent generation, you did your bit,\n\n1:56:03.840 --> 1:56:07.600\n but you also fouled a lot of stuff up and you're custodians.\n\n1:56:07.600 --> 1:56:11.200\n You are caretakers. You were supposed to hand something.\n\n1:56:11.320 --> 1:56:16.240\n What you did instead was to gorge yourself on cheap foreign labor,\n\n1:56:16.560 --> 1:56:20.360\n which you then held up as being much more brilliant than your own children,\n\n1:56:20.400 --> 1:56:21.400\n which was never true.\n\n1:56:22.720 --> 1:56:25.760\n But I'm trying to understand how we create a better system without anger,\n\n1:56:26.120 --> 1:56:28.680\n without revolution, not, not,\n\n1:56:28.680 --> 1:56:31.960\n not by kissing and hugs and, and,\n\n1:56:32.320 --> 1:56:35.000\n but by any,\n\n1:56:35.000 --> 1:56:39.280\n I don't understand within MIT what the mechanism of building a better MIT is.\n\n1:56:39.800 --> 1:56:42.840\n We're not going to pay Elsevier. Aaron Schwartz was right.\n\n1:56:42.840 --> 1:56:45.240\n JSTOR is an abomination.\n\n1:56:45.400 --> 1:56:50.080\n But why, who within MIT, who within institutions is going to do that?\n\n1:56:50.080 --> 1:56:51.920\n When just like you said,\n\n1:56:51.920 --> 1:56:54.480\n the people who are running the show are more senior.\n\n1:56:54.800 --> 1:56:57.080\n I don't know, get Frank Wilczek to speak out.\n\n1:56:58.320 --> 1:57:01.040\n So you're, it's basically individuals that step up. I mean,\n\n1:57:01.040 --> 1:57:05.920\n one of the surprising things about Elon is that one person can inspire so\n\n1:57:05.920 --> 1:57:06.560\n much.\n\n1:57:06.560 --> 1:57:09.240\n He's got academic freedom. It just comes from money.\n\n1:57:10.760 --> 1:57:15.160\n I don't agree with that. That you think money. Okay.\n\n1:57:15.160 --> 1:57:19.160\n So yes, certainly. Sorry.\n\n1:57:19.160 --> 1:57:20.800\n And testicles. Yes.\n\n1:57:20.800 --> 1:57:25.120\n I think that testicles are more important than money or guts.\n\n1:57:25.200 --> 1:57:27.240\n I think I do agree with you.\n\n1:57:27.240 --> 1:57:30.960\n You speak about this a lot that because the money in academic institutions\n\n1:57:30.960 --> 1:57:35.760\n has been so constrained that people are misbehaving and horrible.\n\n1:57:35.760 --> 1:57:36.440\n Yes.\n\n1:57:36.440 --> 1:57:40.960\n But I don't think that if we reverse that and give a huge amount of money,\n\n1:57:40.960 --> 1:57:43.720\n people will all of a sudden behave well. I think it also takes guts.\n\n1:57:43.720 --> 1:57:46.600\n No, you need to give people security. Security. Yes.\n\n1:57:46.600 --> 1:57:51.360\n Like you need to know that you have a job on Monday when on\n\n1:57:51.360 --> 1:57:55.560\n Friday you say, I'm not so sure I really love diversity and inclusion.\n\n1:57:56.040 --> 1:57:59.320\n And somebody is like, wait, what? You didn't love diversity?\n\n1:57:59.320 --> 1:58:01.840\n We had a statement on diversity and you wouldn't sign.\n\n1:58:02.040 --> 1:58:05.000\n Are you against the inclusion part or are you against diverse?\n\n1:58:05.040 --> 1:58:06.640\n Do you just not like people like you?\n\n1:58:06.960 --> 1:58:09.920\n Like actually that has nothing to do with anything.\n\n1:58:09.920 --> 1:58:11.920\n You're making this into something that it isn't.\n\n1:58:11.960 --> 1:58:15.640\n I don't want to sign your goddamn stupid statement and get out of my lab,\n\n1:58:16.200 --> 1:58:19.800\n right? Get out of my lab. It all begins from the middle finger.\n\n1:58:19.840 --> 1:58:24.720\n Get out of my lab. The administrators need to find other\n\n1:58:24.720 --> 1:58:25.560\n work.\n\n1:58:25.560 --> 1:58:30.880\n Yeah. Listen, I agree with you and I hope to seek your advice\n\n1:58:30.880 --> 1:58:35.760\n and wisdom as we change this, because I'd love to see...\n\n1:58:35.760 --> 1:58:38.240\n I will visit you in prison if that's what you're asking.\n\n1:58:38.240 --> 1:58:41.840\n I have no... I think prison is great.\n\n1:58:41.840 --> 1:58:45.800\n You get a lot of reading done and good working out.\n\n1:58:45.800 --> 1:58:52.040\n Well, let me ask something I brought up before is the Nietzsche quote\n\n1:58:52.040 --> 1:58:56.640\n of beware that when fighting monsters, you yourself do not become a monster.\n\n1:58:56.640 --> 1:59:01.000\n For when you gaze long into the abyss, the abyss gazes into you.\n\n1:59:01.000 --> 1:59:05.240\n Are you worried that your focus on the flaws in the system\n\n1:59:05.240 --> 1:59:09.280\n that we've just been talking about has damaged your mind\n\n1:59:09.280 --> 1:59:13.360\n or the part of your mind that's able to see the beauty in the world\n\n1:59:13.360 --> 1:59:20.440\n in the system that because you have so sharply been able to see\n\n1:59:20.440 --> 1:59:25.840\n the flaws in the system, you can no longer step back and appreciate its beauty?\n\n1:59:25.840 --> 1:59:31.160\n Look, I'm the one who's trying to get the institutions to save themselves\n\n1:59:31.160 --> 1:59:34.560\n by getting rid of their inhabitants, but leaving the institution\n\n1:59:34.560 --> 1:59:40.800\n like a neutron bomb that removes the unworkable leadership class,\n\n1:59:40.800 --> 1:59:42.400\n but leaves the structures.\n\n1:59:42.400 --> 1:59:45.240\n So the leadership class is really the problem.\n\n1:59:45.240 --> 1:59:46.680\n The leadership class is the problem.\n\n1:59:46.680 --> 1:59:48.760\n But the individual, like the professors, the individual scholars...\n\n1:59:48.760 --> 1:59:52.120\n No, the professors are going to have to go back into training\n\n1:59:52.120 --> 1:59:54.760\n to remember how to be professors.\n\n1:59:54.760 --> 1:59:58.000\n Like people are cowards at the moment because if they're not cowards,\n\n1:59:58.000 --> 2:00:00.240\n they're unemployed.\n\n2:00:00.240 --> 2:00:06.520\n Yeah, that's one of the disappointing things I've encountered is to me, tenure...\n\n2:00:06.520 --> 2:00:10.520\n But nobody has tenure now.\n\n2:00:10.520 --> 2:00:19.200\n Whether they do or not, they certainly don't have the kind of character\n\n2:00:19.200 --> 2:00:22.880\n and fortitude that I was hoping to see.\n\n2:00:22.880 --> 2:00:25.400\n But they'd be gone.\n\n2:00:25.400 --> 2:00:33.120\n See, you're dreaming about the people who used to live at MIT.\n\n2:00:33.120 --> 2:00:37.200\n You're dreaming about the previous inhabitants of your university.\n\n2:00:37.200 --> 2:00:42.080\n And if you looked at somebody like, you know, Isidore Singer is very old.\n\n2:00:42.080 --> 2:00:46.560\n I don't know what state he's in, but that guy was absolutely the real deal.\n\n2:00:46.560 --> 2:00:51.600\n And if you look at Noam Chomsky, tell me that Noam Chomsky has been muzzled.\n\n2:00:51.600 --> 2:00:52.120\n Right?\n\n2:00:52.120 --> 2:00:53.080\n Yeah.\n\n2:00:53.080 --> 2:00:58.120\n Now, what I'm trying to get at is you're talking about younger energetic people,\n\n2:00:58.120 --> 2:00:59.040\n but those people...\n\n2:00:59.040 --> 2:01:02.440\n Like when I say something like, I'm against...\n\n2:01:02.440 --> 2:01:09.880\n I'm for inclusion and I'm for diversity, but I'm against diversity and inclusion TM,\n\n2:01:09.880 --> 2:01:12.400\n like the movement.\n\n2:01:12.400 --> 2:01:16.360\n Well, I couldn't say that if I was a professor.\n\n2:01:16.360 --> 2:01:18.840\n Oh my God, he's against our sacred document.\n\n2:01:18.840 --> 2:01:19.240\n Okay.\n\n2:01:19.240 --> 2:01:24.480\n Well, in that kind of a world, do you want to know how many things I don't agree with you on?\n\n2:01:24.480 --> 2:01:30.840\n Like we could go on for days and days and days, all the nonsense that you've parroted inside of the institution.\n\n2:01:30.840 --> 2:01:33.280\n Any sane person like has no need for it.\n\n2:01:33.280 --> 2:01:37.560\n They have no want or desire.\n\n2:01:37.560 --> 2:01:44.240\n Do you think you have to have some patience for nonsense when many people work together in a system?\n\n2:01:44.240 --> 2:01:45.920\n How long has string theory gone on for?\n\n2:01:45.920 --> 2:01:48.200\n And how long have I been patient?\n\n2:01:48.200 --> 2:01:48.400\n Okay.\n\n2:01:48.400 --> 2:01:49.040\n So you're talking about...\n\n2:01:49.040 --> 2:01:50.280\n There's a limit to patience.\n\n2:01:50.280 --> 2:01:54.960\n You're talking about like 36 years of modern nonsense and string theory.\n\n2:01:54.960 --> 2:01:57.800\n So you can do like eight to 10 years, but not more.\n\n2:01:57.800 --> 2:02:01.440\n I can do 40 minutes.\n\n2:02:01.440 --> 2:02:02.200\n This is 36 years.\n\n2:02:02.200 --> 2:02:03.880\n Well, you've done that over two hours already.\n\n2:02:03.880 --> 2:02:05.320\n No, but I appreciate it.\n\n2:02:05.320 --> 2:02:11.000\n But it's been 36 years of nonsense since the anomaly cancellation in string theory.\n\n2:02:11.000 --> 2:02:13.800\n It's like, what are you talking about about patience?\n\n2:02:13.800 --> 2:02:18.680\n I mean, Lex, you're not even acting like yourself.\n\n2:02:18.680 --> 2:02:20.560\n You're trying to stay in the system.\n\n2:02:20.560 --> 2:02:22.120\n I'm not trying...\n\n2:02:22.120 --> 2:02:29.640\n I'm trying to see if perhaps... So my hope is that the system just has a few assholes in it,\n\n2:02:29.640 --> 2:02:35.640\n which you highlight, and the fundamentals of the system are broken.\n\n2:02:35.640 --> 2:02:42.840\n Because if the fundamentals of the systems are broken, then I just don't see a way for MIT to succeed.\n\n2:02:42.840 --> 2:02:47.320\n Like, I don't see how young people take over MIT.\n\n2:02:47.320 --> 2:02:49.960\n I don't see how...\n\n2:02:49.960 --> 2:02:52.440\n By inspiring us.\n\n2:02:52.440 --> 2:02:59.160\n You know, the great part about being at MIT, like when you saw the genius in these pranks,\n\n2:02:59.160 --> 2:03:03.320\n the heart, the irreverence, it's like, don't...\n\n2:03:03.320 --> 2:03:05.640\n We were talking about Tom Lehrer the last time.\n\n2:03:05.640 --> 2:03:08.560\n Tom Lehrer was as naughty as the day is long.\n\n2:03:08.560 --> 2:03:09.280\n Agreed?\n\n2:03:09.280 --> 2:03:10.160\n Agreed.\n\n2:03:10.160 --> 2:03:11.680\n Was he also a genius?\n\n2:03:11.680 --> 2:03:12.680\n Was he well spoken?\n\n2:03:12.680 --> 2:03:14.840\n Was he highly cultured?\n\n2:03:14.840 --> 2:03:19.040\n He was so talented, so intellectual that he could just make fart jokes morning,\n\n2:03:19.040 --> 2:03:20.280\n noon and night.\n\n2:03:20.280 --> 2:03:21.280\n Okay.\n\n2:03:21.280 --> 2:03:26.280\n Well, in part, the right to make fart jokes, the right to, for example, put a functioning\n\n2:03:26.280 --> 2:03:31.520\n phone booth that was ringing on top of the great dome at MIT has to do with we are such\n\n2:03:31.520 --> 2:03:34.760\n bad asses that we can actually do this stuff.\n\n2:03:34.760 --> 2:03:36.640\n Well, don't tell me about it anymore.\n\n2:03:36.640 --> 2:03:38.640\n Go break the law.\n\n2:03:38.640 --> 2:03:43.600\n Go break the law in a way that inspires us and makes us not want to prosecute you.\n\n2:03:43.600 --> 2:03:48.040\n Break the law in a way that lets us know that you're calling us out on our bullshit, that\n\n2:03:48.040 --> 2:03:56.480\n you're filled with love, and that our technical talent has not gone to sleep, it's not incapable.\n\n2:03:56.480 --> 2:04:00.800\n And if the idea is that you're going to dig a moat around the university and fill it with\n\n2:04:00.800 --> 2:04:06.120\n tiger sharks, that's awesome because I don't know how you're going to do it.\n\n2:04:06.120 --> 2:04:10.800\n But if you actually manage to do that, I'm not going to prosecute you under a reckless\n\n2:04:10.800 --> 2:04:13.320\n endangerment.\n\n2:04:13.320 --> 2:04:15.000\n That's beautifully put.\n\n2:04:15.000 --> 2:04:19.760\n I hope those, first of all, they'll listen, I hope young people at MIT will take over\n\n2:04:19.760 --> 2:04:22.160\n in this kind of way.\n\n2:04:22.160 --> 2:04:29.780\n In the introduction to your podcast episode on Jeffrey Epstein, you give to me a really\n\n2:04:29.780 --> 2:04:37.020\n moving story, but unfortunately for me, too brief, about your experience with a therapist\n\n2:04:37.020 --> 2:04:40.440\n and a lasting terror that permeated your mind.\n\n2:04:40.440 --> 2:04:45.160\n Can you go there, can you tell?\n\n2:04:45.160 --> 2:04:46.160\n I don't think so.\n\n2:04:46.160 --> 2:04:47.720\n I mean, I appreciate what you're saying.\n\n2:04:47.720 --> 2:04:51.920\n I said it obliquely, I said enough.\n\n2:04:51.920 --> 2:05:00.280\n There are bad people who cross our paths and the current vogue is to say, oh, I'm a survivor,\n\n2:05:00.280 --> 2:05:05.660\n I'm a victim, I can do anything I want.\n\n2:05:05.660 --> 2:05:11.200\n This is a broken person and I don't know why I was sent to a broken person as a kid.\n\n2:05:11.200 --> 2:05:15.520\n And to be honest with you, I also felt like in that story, I say that I was able to say\n\n2:05:15.520 --> 2:05:23.440\n no and this was like the entire weight of authority and he was misusing his position\n\n2:05:23.440 --> 2:05:28.160\n and I was also able to say no.\n\n2:05:28.160 --> 2:05:32.680\n What I couldn't say no to was having him re inflicted in my life.\n\n2:05:32.680 --> 2:05:36.160\n Right, so you were sent back a second time.\n\n2:05:36.160 --> 2:05:42.040\n I tried to complain about what had happened and I tried to do it in a way that did not\n\n2:05:42.040 --> 2:05:48.440\n immediately cause horrific consequences to both this person and myself because we don't\n\n2:05:48.440 --> 2:05:55.400\n have the tools to deal with sexual misbehavior.\n\n2:05:55.400 --> 2:06:01.840\n We have nuclear weapons, we don't have any way of saying this is probably not a good\n\n2:06:01.840 --> 2:06:07.760\n place or a role for you at this moment as an authority figure and something needs to\n\n2:06:07.760 --> 2:06:08.800\n be worked on.\n\n2:06:08.800 --> 2:06:15.960\n So in general, when we see somebody who is misbehaving in that way, our immediate instinct\n\n2:06:15.960 --> 2:06:23.040\n is to treat the person as Satan and we understand why.\n\n2:06:23.040 --> 2:06:28.080\n We don't want our children to be at risk.\n\n2:06:28.080 --> 2:06:33.480\n Now I personally believe that I fell down on the job and did not call out the Jeffrey\n\n2:06:33.480 --> 2:06:38.240\n Epstein thing early enough because I was terrified of what Jeffrey Epstein represents and this\n\n2:06:38.240 --> 2:06:45.200\n recapitulated the old terror trying to tell the world this therapist is out of control.\n\n2:06:45.200 --> 2:06:50.040\n And when I said that, the world responded by saying, well, you have two appointments\n\n2:06:50.040 --> 2:06:52.520\n booked and you have to go for the second one.\n\n2:06:52.520 --> 2:06:57.640\n So I got re inflicted into this office on this person who was now convinced that I was\n\n2:06:57.640 --> 2:07:01.160\n about to tear down his career and his reputation and might have been on the verge of suicide\n\n2:07:01.160 --> 2:07:02.160\n for all I know.\n\n2:07:02.160 --> 2:07:03.160\n I don't know.\n\n2:07:03.160 --> 2:07:08.400\n But he was very, very angry and he was furious with me that I had breached a sacred confidence\n\n2:07:08.400 --> 2:07:11.200\n of his office.\n\n2:07:11.200 --> 2:07:13.600\n What kind of ripple effects does that have?\n\n2:07:13.600 --> 2:07:16.400\n Has that had to the rest of your life?\n\n2:07:16.400 --> 2:07:19.480\n The absurdity and the cruelty of that?\n\n2:07:19.480 --> 2:07:22.560\n I mean, there's no sense to it.\n\n2:07:22.560 --> 2:07:30.240\n Well, see, this is the thing people don't really grasp, I think there's an academic\n\n2:07:30.240 --> 2:07:39.200\n who I got to know many years ago, um, named Jennifer fried, who has a theory of betrayal,\n\n2:07:39.200 --> 2:07:41.400\n which she calls institutional betrayal.\n\n2:07:41.400 --> 2:07:47.320\n And her gambit is, is that when you were betrayed by an institution that is sort of like a fiduciary\n\n2:07:47.320 --> 2:07:54.760\n or a parental obligation to take care of you, that you find yourself in a far different\n\n2:07:54.760 --> 2:08:02.480\n situation with respect to trauma than if you were betrayed by somebody who's a peer.\n\n2:08:02.480 --> 2:08:12.880\n And so I think that my, in my situation, um, I kind of repeat a particular dynamic with\n\n2:08:12.880 --> 2:08:13.880\n authority.\n\n2:08:13.880 --> 2:08:20.400\n I come in not following all the rules, trying to do some things, not trying to do others,\n\n2:08:20.400 --> 2:08:21.680\n blah, blah, blah.\n\n2:08:21.680 --> 2:08:25.560\n And then I get into a weird relationship with authority.\n\n2:08:25.560 --> 2:08:29.840\n And so I have more experience with what I would call institutional betrayal.\n\n2:08:29.840 --> 2:08:38.200\n Now, the funny part about it is that when you don't have masks or PPE in a influenza\n\n2:08:38.200 --> 2:08:45.520\n like pandemic and you missing ICU beds and ventilators, that is ubiquitous institutional\n\n2:08:45.520 --> 2:08:46.920\n betrayal.\n\n2:08:46.920 --> 2:08:53.200\n So I believe that in a weird way, I was very early, the idea of, and this is like the really\n\n2:08:53.200 --> 2:09:01.080\n hard concept pervasive or otherwise universal institutional betrayal where all of the institutions\n\n2:09:01.080 --> 2:09:06.940\n you can count on any hospital to not charge you properly for what their services are.\n\n2:09:06.940 --> 2:09:11.480\n You can count on no pharmaceutical company to produce the drug that will be maximally\n\n2:09:11.480 --> 2:09:14.560\n beneficial to the people who take it.\n\n2:09:14.560 --> 2:09:19.880\n You know that your financial professionals are not simply working in your best interest.\n\n2:09:19.880 --> 2:09:25.280\n And that issue had to do with the way in which growth left our system.\n\n2:09:25.280 --> 2:09:30.560\n So I think that the weird thing is, is that this first institutional betrayal by a therapist\n\n2:09:30.560 --> 2:09:34.620\n left me very open to the idea of, okay, well maybe the schools are bad.\n\n2:09:34.620 --> 2:09:35.880\n Maybe the hospitals are bad.\n\n2:09:35.880 --> 2:09:37.240\n Maybe the drug companies are bad.\n\n2:09:37.240 --> 2:09:39.080\n Maybe our food is off.\n\n2:09:39.080 --> 2:09:42.180\n Maybe our journalists are not serving journalistic ends.\n\n2:09:42.180 --> 2:09:47.600\n And that was what allowed me to sort of go all the distance and say, huh, I wonder if\n\n2:09:47.600 --> 2:09:54.260\n our problem is that something is causing all of our sensemaking institutions to be off.\n\n2:09:54.260 --> 2:09:59.360\n That was the big insight and that tying that to a single ideology.\n\n2:09:59.360 --> 2:10:00.680\n What if it's just about growth?\n\n2:10:00.680 --> 2:10:05.600\n They were all built on growth and now we've promoted people who are capable of keeping\n\n2:10:05.600 --> 2:10:08.720\n quiet that their institutions aren't working.\n\n2:10:08.720 --> 2:10:15.300\n So we've, the privileged silent aristocracy, the people who can be counted upon, not to\n\n2:10:15.300 --> 2:10:20.680\n mention a fire when a raging fire is tearing through a building.\n\n2:10:20.680 --> 2:10:25.280\n But nevertheless, it's how big of a psychological burden is that?\n\n2:10:25.280 --> 2:10:26.560\n It's huge.\n\n2:10:26.560 --> 2:10:27.560\n It's terrible.\n\n2:10:27.560 --> 2:10:28.560\n It's crushing.\n\n2:10:28.560 --> 2:10:34.280\n It's very, it's very comforting to be the parental, I mean, I don't know.\n\n2:10:34.280 --> 2:10:38.480\n I treasure, I mean, we were just talking about MIT.\n\n2:10:38.480 --> 2:10:42.600\n We can, until I can intellectualize and agree with everything you're saying, but there's\n\n2:10:42.600 --> 2:10:49.680\n a comfort, a warm blanket of being within the institution and up until Aaron Schwartz,\n\n2:10:49.680 --> 2:10:54.880\n let's say, in other words, now, if I look at the provost and the president as mommy\n\n2:10:54.880 --> 2:11:00.580\n and daddy, you did what to my big brother?\n\n2:11:00.580 --> 2:11:03.540\n You did what to our family?\n\n2:11:03.540 --> 2:11:06.860\n You sold us out in which way?\n\n2:11:06.860 --> 2:11:09.000\n What secrets left for China?\n\n2:11:09.000 --> 2:11:10.800\n You hired which workforce?\n\n2:11:10.800 --> 2:11:13.180\n You did what to my wages?\n\n2:11:13.180 --> 2:11:15.700\n You took this portion of my grant for what purpose?\n\n2:11:15.700 --> 2:11:18.560\n You just stole my retirement through a fringe rate.\n\n2:11:18.560 --> 2:11:19.820\n What did you do?\n\n2:11:19.820 --> 2:11:26.760\n But can you still, I mean, the thing is about this view you have is it often turns out to\n\n2:11:26.760 --> 2:11:27.760\n be sadly correct.\n\n2:11:27.760 --> 2:11:29.880\n Well, this is the thing.\n\n2:11:29.880 --> 2:11:37.000\n But let me just, in this silly, hopeful thing, do you still have hope in institutions?\n\n2:11:37.000 --> 2:11:42.560\n Can you within your, psychologically, I'm referring not intellectually, because you\n\n2:11:42.560 --> 2:11:47.480\n have to carry this burden, can you still have a hope within you?\n\n2:11:47.480 --> 2:11:53.320\n When you sit at home alone and as opposed to seeing the darkness within these institutions,\n\n2:11:53.320 --> 2:11:54.320\n seeing a hope.\n\n2:11:54.320 --> 2:11:55.760\n Well, but this is the thing.\n\n2:11:55.760 --> 2:12:02.240\n I want to confront, not for the purpose of a dust up.\n\n2:12:02.240 --> 2:12:09.000\n I believe, for example, if you've heard episode 19, that the best outcome is for Carol Greider\n\n2:12:09.000 --> 2:12:17.760\n to come forward, as we discussed in episode 19, and say, you know what, I screwed up.\n\n2:12:17.760 --> 2:12:18.760\n He did call.\n\n2:12:18.760 --> 2:12:20.920\n He did suggest the experiment.\n\n2:12:20.920 --> 2:12:24.380\n I didn't understand that it was his theory that was producing it.\n\n2:12:24.380 --> 2:12:27.480\n I was slow to grasp it.\n\n2:12:27.480 --> 2:12:30.120\n But my bad.\n\n2:12:30.120 --> 2:12:38.480\n And I don't want to pay for this bad choice on my part, let's say.\n\n2:12:38.480 --> 2:12:44.000\n For the rest of my career, I want to own up, and I want to help make sure that we do what's\n\n2:12:44.000 --> 2:12:45.280\n right with what's left.\n\n2:12:45.280 --> 2:12:48.680\n And that's one little case within the institution that you would like to see made.\n\n2:12:48.680 --> 2:12:54.560\n I would like to see MIT very clearly come out and say, Margot O'Toole was right when\n\n2:12:54.560 --> 2:13:02.920\n she said David Baltimore's lab here produced some stuff that was not reproducible with\n\n2:13:02.920 --> 2:13:05.600\n Teresa Imanishi Kari's research.\n\n2:13:05.600 --> 2:13:08.760\n I want to see the courageous people.\n\n2:13:08.760 --> 2:13:14.600\n I would like to see the Aaron Schwartz wing of the computer science department.\n\n2:13:14.600 --> 2:13:17.640\n Yeah, wouldn't, no, let's think about it.\n\n2:13:17.640 --> 2:13:22.200\n Wouldn't that be great if we said, you know, an injustice was done and we're going to write\n\n2:13:22.200 --> 2:13:26.660\n that wrong just as if this was Alan Turing?\n\n2:13:26.660 --> 2:13:28.940\n Which I don't think they've righted that wrong.\n\n2:13:28.940 --> 2:13:33.160\n Well then let's have the Turing Schwartz wing.\n\n2:13:33.160 --> 2:13:34.920\n They're starting a new college of computing.\n\n2:13:34.920 --> 2:13:37.280\n It wouldn't be wonderful to call it the Turing Schwartz wing.\n\n2:13:37.280 --> 2:13:41.080\n I would like to have the Madame Wu wing of the physics department.\n\n2:13:41.080 --> 2:13:45.480\n And I'd love to have the Emmy Nerder statue in front of the math department.\n\n2:13:45.480 --> 2:13:48.920\n I mean, like you want to get excited about actual diversity and inclusion?\n\n2:13:48.920 --> 2:13:49.920\n Yeah.\n\n2:13:49.920 --> 2:13:53.880\n Well, let's go with our absolute best people who never got theirs because there is structural\n\n2:13:53.880 --> 2:13:56.100\n bigotry, you know?\n\n2:13:56.100 --> 2:14:00.800\n But if we don't actually start celebrating the beautiful stuff that we're capable of\n\n2:14:00.800 --> 2:14:05.320\n when we're handed heroes and we fumble them into the trash, what the hell?\n\n2:14:05.320 --> 2:14:10.280\n I mean, Lex, this is such nonsense.\n\n2:14:10.280 --> 2:14:16.080\n We just pulling our head out.\n\n2:14:16.080 --> 2:14:25.840\n You know, on everyone's cecum should be tattooed, if you can read this, you're too close.\n\n2:14:25.840 --> 2:14:30.680\n Beautifully put and I'm a dreamer just like you.\n\n2:14:30.680 --> 2:14:38.820\n So I don't see as much of the darkness genetically or due to my life experience, but I do share\n\n2:14:38.820 --> 2:14:39.820\n the hope.\n\n2:14:39.820 --> 2:14:42.640\n From my teeth, the institution that we care a lot about.\n\n2:14:42.640 --> 2:14:43.640\n You both do.\n\n2:14:43.640 --> 2:14:44.640\n Yeah.\n\n2:14:44.640 --> 2:14:48.040\n And a Harvard institution I don't give a damn about, but you do.\n\n2:14:48.040 --> 2:14:49.040\n So I love Harvard.\n\n2:14:49.040 --> 2:14:50.040\n I'm just kidding.\n\n2:14:50.040 --> 2:14:53.520\n I love Harvard, but Harvard and I have a very difficult relationship.\n\n2:14:53.520 --> 2:14:58.400\n And part of what, you know, when you love a family that isn't working, I don't want\n\n2:14:58.400 --> 2:14:59.400\n to trash.\n\n2:14:59.400 --> 2:15:05.080\n I didn't bring up the name of the president of MIT during the Aaron Schwartz period.\n\n2:15:05.080 --> 2:15:06.600\n It's not vengeance.\n\n2:15:06.600 --> 2:15:09.000\n I want the rot cleared out.\n\n2:15:09.000 --> 2:15:11.840\n I don't need to go after human beings.\n\n2:15:11.840 --> 2:15:12.840\n Yeah.\n\n2:15:12.840 --> 2:15:19.080\n Just like you said with the, with the disc formulation, the individual human beings aren't\n\n2:15:19.080 --> 2:15:22.960\n don't necessarily carry them.\n\n2:15:22.960 --> 2:15:26.640\n It's those chairs that are so powerful that in which they sit.\n\n2:15:26.640 --> 2:15:34.240\n It's the chairs, not the humans, not the humans without naming names.\n\n2:15:34.240 --> 2:15:41.140\n Can you tell the story of your struggle during your time at Harvard, maybe in a way that\n\n2:15:41.140 --> 2:15:47.440\n tells the bigger story of the struggle of young bright minds that are trying to come\n\n2:15:47.440 --> 2:15:54.360\n up with big, bold ideas within the institutions that we're talking about?\n\n2:15:54.360 --> 2:15:55.360\n You can start.\n\n2:15:55.360 --> 2:16:06.520\n I mean, in part, uh, it starts with, uh, coffee with, uh, a couple, uh, of Croatians in the\n\n2:16:06.520 --> 2:16:09.680\n math department at MIT.\n\n2:16:09.680 --> 2:16:17.560\n And, um, we used to talk about, um, music and dance and math and physics and love and\n\n2:16:17.560 --> 2:16:24.960\n all this kind of stuff as Eastern Europeans, uh, love to, and I ate it up and my friend\n\n2:16:24.960 --> 2:16:30.280\n Gordon, uh, who was, uh, an instructor in the MIT math department when I was a graduate\n\n2:16:30.280 --> 2:16:36.440\n student at Harvard said to me, I'm probably gonna do a bad version of her accent, but\n\n2:16:36.440 --> 2:16:37.440\n here we go.\n\n2:16:37.440 --> 2:16:42.560\n It, um, will I see you tomorrow at the secret seminar?\n\n2:16:42.560 --> 2:16:48.920\n And I said, w what secret seminar, Eric, don't joke.\n\n2:16:48.920 --> 2:16:52.880\n I said, I'm not used to this style of humor.\n\n2:16:52.880 --> 2:16:57.840\n Then she's Eric, the secret seminar that your advisor is running.\n\n2:16:57.840 --> 2:17:00.960\n I said, what are you talking about?\n\n2:17:00.960 --> 2:17:06.120\n Ha ha ha, uh, you know, your advisor is running a secret seminar on this aspect.\n\n2:17:06.120 --> 2:17:09.240\n I think it was like the churn Simon's invariant.\n\n2:17:09.240 --> 2:17:14.960\n I'm not sure what the topic was again, but she gave me the room number and the time and\n\n2:17:14.960 --> 2:17:16.760\n she was like not cracking a smile.\n\n2:17:16.760 --> 2:17:18.840\n I've never known her to make this kind of a joke.\n\n2:17:18.840 --> 2:17:22.080\n And I thought this was crazy and I was trying to have an advisor.\n\n2:17:22.080 --> 2:17:24.480\n I didn't want an advisor, but people said you have to have one.\n\n2:17:24.480 --> 2:17:32.160\n So I took one and I went to this room at like 15 minutes early and there was not a soul\n\n2:17:32.160 --> 2:17:33.160\n inside it.\n\n2:17:33.160 --> 2:17:38.960\n It was outside of the math department and it was still in the same building, the science\n\n2:17:38.960 --> 2:17:41.260\n center at Harvard.\n\n2:17:41.260 --> 2:17:45.440\n And I sat there and I let five minutes go by, I let seven minutes go by, 10 minutes\n\n2:17:45.440 --> 2:17:46.440\n go by.\n\n2:17:46.440 --> 2:17:47.440\n There's nobody.\n\n2:17:47.440 --> 2:17:50.680\n I thought, okay, so this was all an elaborate joke.\n\n2:17:50.680 --> 2:17:56.720\n And then like three minutes to the hour, this graduate student walks in and like sees me\n\n2:17:56.720 --> 2:17:58.660\n and does a double take.\n\n2:17:58.660 --> 2:18:05.760\n And then I start to see the professors in geometry and topology start to file in and\n\n2:18:05.760 --> 2:18:11.120\n everybody's like very disconcerted that I'm in this room.\n\n2:18:11.120 --> 2:18:18.440\n And finally the person who was supposed to be my advisor walks in to the seminar and\n\n2:18:18.440 --> 2:18:22.880\n sees me and goes white as a ghost.\n\n2:18:22.880 --> 2:18:30.480\n And I realized that the secret seminar is true, that the department is conducting a\n\n2:18:30.480 --> 2:18:36.120\n secret seminar on the exact topic that I'm interested in, not telling me about it.\n\n2:18:36.120 --> 2:18:41.440\n And that these are the reindeer games that the Rudolph's of the department are not invited\n\n2:18:41.440 --> 2:18:42.880\n to.\n\n2:18:42.880 --> 2:18:45.840\n And so then I realized, okay, I did not understand it.\n\n2:18:45.840 --> 2:18:49.600\n There's a parallel department.\n\n2:18:49.600 --> 2:19:00.680\n And that became the beginning of an incredible odyssey in which I came to understand that\n\n2:19:00.680 --> 2:19:12.360\n the game that I had been sold about publication, about blind refereeing, about openness and\n\n2:19:12.360 --> 2:19:18.240\n scientific transmission of information was all a lie.\n\n2:19:18.240 --> 2:19:24.640\n I came to understand that at the very top, there's a second system that's about closed\n\n2:19:24.640 --> 2:19:33.760\n meetings and private communications and agreements about citation and publication that the rest\n\n2:19:33.760 --> 2:19:36.040\n of us don't understand.\n\n2:19:36.040 --> 2:19:41.040\n And that in large measure, that is the thing that I won't submit to.\n\n2:19:41.040 --> 2:19:45.240\n And so when you ask me questions like, well, why wouldn't you feel good about, you know,\n\n2:19:45.240 --> 2:19:49.200\n talking to your critics or why wouldn't you feel the answer is, oh, you don't know.\n\n2:19:49.200 --> 2:19:54.560\n Like if you stay in a nice hotel, you don't realize that there is an entire second structure\n\n2:19:54.560 --> 2:20:01.580\n inside of that hotel where like there's usually a worker's cafe in a resort complex that isn't\n\n2:20:01.580 --> 2:20:03.920\n available to the people who are staying in the hotel.\n\n2:20:03.920 --> 2:20:11.960\n And then there are private hallways inside the same hotel that are parallel structures.\n\n2:20:11.960 --> 2:20:16.560\n So that's what I found, which was in essence, just the way you can stay hotels your whole\n\n2:20:16.560 --> 2:20:20.920\n life and not realize that inside of every hotel is a second structure that you're not\n\n2:20:20.920 --> 2:20:23.200\n supposed to see as the guest.\n\n2:20:23.200 --> 2:20:28.600\n There is a second structure inside of academics that behaves totally differently with respect\n\n2:20:28.600 --> 2:20:33.820\n to how people get dinged, how people get their grants taken away, how this person comes to\n\n2:20:33.820 --> 2:20:37.640\n have that thing named after them.\n\n2:20:37.640 --> 2:20:44.880\n And by pretending that we're not running a parallel structure, um, I have no patience\n\n2:20:44.880 --> 2:20:45.880\n for that anymore.\n\n2:20:45.880 --> 2:20:52.400\n So I got a chance to see how the game, how hard ball is really played at Harvard.\n\n2:20:52.400 --> 2:20:59.080\n And I'm now eager to play hard ball back with the same people who played hard ball with\n\n2:20:59.080 --> 2:21:00.080\n me.\n\n2:21:00.080 --> 2:21:02.640\n Let me ask two questions on this.\n\n2:21:02.640 --> 2:21:10.600\n So one, do you think it's possible, so I call those people assholes, that's the technical\n\n2:21:10.600 --> 2:21:11.600\n term.\n\n2:21:11.600 --> 2:21:18.040\n Do you think it's possible that that's just not the entire system, but a part of the system?\n\n2:21:18.040 --> 2:21:23.840\n Sort of that there's, you can navigate, you can swim in the waters and find the groups\n\n2:21:23.840 --> 2:21:26.640\n of people who do aspire to the openness.\n\n2:21:26.640 --> 2:21:33.680\n The guy who rescued my phd was one of the people who filed in to the secret seminar.\n\n2:21:33.680 --> 2:21:35.600\n Right.\n\n2:21:35.600 --> 2:21:38.200\n But are there people outside of this, right?\n\n2:21:38.200 --> 2:21:39.200\n Is he an asshole?\n\n2:21:39.200 --> 2:21:44.600\n Well, yes, I was, it was a bad, no, but I'm trying to make this point, which is this isn't\n\n2:21:44.600 --> 2:21:48.120\n my failure to correctly map these people.\n\n2:21:48.120 --> 2:21:49.120\n It's yours.\n\n2:21:49.120 --> 2:21:53.200\n You, you have a simplification that isn't going to work.\n\n2:21:53.200 --> 2:21:54.200\n I think, okay.\n\n2:21:54.200 --> 2:21:59.800\n If I asked what was the wrong term, I would say lacking of character and what would you\n\n2:21:59.800 --> 2:22:02.600\n have had these people do?\n\n2:22:02.600 --> 2:22:03.700\n Why did they do this?\n\n2:22:03.700 --> 2:22:06.120\n Why have a secret seminar?\n\n2:22:06.120 --> 2:22:09.880\n I don't understand the exact dynamics of a secret seminar, but I think the right thing\n\n2:22:09.880 --> 2:22:15.800\n to do is to, I mean, to see individuals like you, there might be a reason to have a secret\n\n2:22:15.800 --> 2:22:23.160\n seminar, but they should detect that an individual like you, a brilliant mind who's thinking\n\n2:22:23.160 --> 2:22:25.400\n about certain ideas could be damaged by this.\n\n2:22:25.400 --> 2:22:27.860\n I don't think that they see it that way.\n\n2:22:27.860 --> 2:22:32.480\n The idea is we're going to sneak food to the children we want to survive.\n\n2:22:32.480 --> 2:22:33.480\n Yeah.\n\n2:22:33.480 --> 2:22:36.800\n So that that's highly problematic and there should be people within that room.\n\n2:22:36.800 --> 2:22:41.800\n I'm trying to say this is the thing, the ball that can't is thrown, but won't be caught.\n\n2:22:41.800 --> 2:22:50.560\n The problem is they know that most of their children won't survive and they can't say\n\n2:22:50.560 --> 2:22:51.560\n that.\n\n2:22:51.560 --> 2:22:52.560\n I see.\n\n2:22:52.560 --> 2:22:54.560\n Sorry to interrupt.\n\n2:22:54.560 --> 2:23:00.440\n You mean that the fact that the whole system is underfunded, that they naturally have to\n\n2:23:00.440 --> 2:23:02.240\n pick favorites.\n\n2:23:02.240 --> 2:23:08.440\n They live in a world which reached steady state at some level, let's say, you know,\n\n2:23:08.440 --> 2:23:16.640\n in the early seventies and in that world before that time you have a professor like Norman\n\n2:23:16.640 --> 2:23:20.980\n Steenrod and you'd have 20 children that is graduate students and all of them would go\n\n2:23:20.980 --> 2:23:25.000\n on to be professors and all of them would want to have 20 children, right?\n\n2:23:25.000 --> 2:23:30.680\n So you start like taking higher and higher powers of 20 and you see that the system could\n\n2:23:30.680 --> 2:23:34.580\n not, it's not just about money, the system couldn't survive.\n\n2:23:34.580 --> 2:23:41.040\n So the way it's supposed to work now is that we should shut down the vast majority of PhD\n\n2:23:41.040 --> 2:23:49.040\n programs and we should let the small number of truly top places populate, um, mostly teaching\n\n2:23:49.040 --> 2:23:53.040\n and research departments that aren't PhD producing.\n\n2:23:53.040 --> 2:23:56.720\n We don't want to do that because we use PhD students as a labor force.\n\n2:23:56.720 --> 2:24:04.480\n So the whole thing has to do with growth, resources, dishonesty, and in that world you\n\n2:24:04.480 --> 2:24:10.040\n see all of these adaptations to a ruthless world where the key question is where are\n\n2:24:10.040 --> 2:24:14.640\n we going to bury this huge number of bodies of people who don't work out?\n\n2:24:14.640 --> 2:24:18.620\n So my problem was I wasn't interested in dying.\n\n2:24:18.620 --> 2:24:26.440\n So you clearly highlight that there's aspects of the system that are broken, but as an individual,\n\n2:24:26.440 --> 2:24:32.640\n is your role to, uh, exit the system or just acknowledge that it's a game and win it?\n\n2:24:32.640 --> 2:24:37.560\n My role is to survive and thrive in the public eye.\n\n2:24:37.560 --> 2:24:45.520\n In other words, when you have an escapee of the system, like yourself, such as, and that\n\n2:24:45.520 --> 2:24:50.440\n person says, you know, I wasn't exactly finished, let me show you a bunch of stuff.\n\n2:24:50.440 --> 2:24:55.560\n Let me show you that, uh, the theory of telomeres never got reported properly.\n\n2:24:55.560 --> 2:25:00.920\n Let me show you that all of, uh, marginal economics, uh, is supposed to be redone with\n\n2:25:00.920 --> 2:25:03.040\n a different version of the differential calculus.\n\n2:25:03.040 --> 2:25:07.400\n Let me show you that you didn't understand the self dual Yang Mills equations correctly\n\n2:25:07.400 --> 2:25:15.360\n in topology and physics because they're in fact, uh, much more broadly found and it's\n\n2:25:15.360 --> 2:25:17.840\n only the mutations that happen in special dimensions.\n\n2:25:17.840 --> 2:25:24.400\n There are lots of things to say, but this particular group of people, like if you just\n\n2:25:24.400 --> 2:25:30.240\n take, where are all the gen X and millennial university presidents?\n\n2:25:30.240 --> 2:25:31.240\n Right.\n\n2:25:31.240 --> 2:25:32.240\n Okay.\n\n2:25:32.240 --> 2:25:36.320\n They're all, they're all in a holding pattern.\n\n2:25:36.320 --> 2:25:42.040\n Now where, why in this story, you know, was it of telomeres?\n\n2:25:42.040 --> 2:25:45.520\n Was it an older professor and a younger graduate student?\n\n2:25:45.520 --> 2:25:50.060\n It's this issue of what would be called interference competition.\n\n2:25:50.060 --> 2:25:55.520\n So for example, orcas try to drown minke whales by covering their blow holes so that they\n\n2:25:55.520 --> 2:25:58.960\n suffocate because the needed resource is air.\n\n2:25:58.960 --> 2:25:59.960\n Okay.\n\n2:25:59.960 --> 2:26:01.660\n Well, what do the universities do?\n\n2:26:01.660 --> 2:26:08.160\n They try to make sure that you can't be viable, that you need them, that you need their grants.\n\n2:26:08.160 --> 2:26:15.440\n You need to be, uh, zinged with overhead charges or fringe rates or all of the games that the\n\n2:26:15.440 --> 2:26:17.200\n locals love to play.\n\n2:26:17.200 --> 2:26:20.640\n Well, my point is, okay, what's the cost of this?\n\n2:26:20.640 --> 2:26:25.880\n How many people died as a result of these interference competition games?\n\n2:26:25.880 --> 2:26:30.120\n You know, when you take somebody like Douglas Prasher who did green fluorescent protein\n\n2:26:30.120 --> 2:26:32.160\n and he drives a shuttle bus, right?\n\n2:26:32.160 --> 2:26:36.280\n Cause he, his grant runs out and he has to give away all of his research and all of that\n\n2:26:36.280 --> 2:26:40.920\n research gets a Nobel prize and he gets to drive a shuttle bus for $35,000 a year.\n\n2:26:40.920 --> 2:26:41.920\n What do you mean by died?\n\n2:26:41.920 --> 2:26:43.920\n You mean their career, their dreams, their passions?\n\n2:26:43.920 --> 2:26:49.760\n Yeah, the whole, as an academic, Doug Prasher was dead for a long period of time.\n\n2:26:49.760 --> 2:26:51.400\n Okay.\n\n2:26:51.400 --> 2:26:58.560\n So as a, as a person who's escaped the system, can't you at this, cause you also have in\n\n2:26:58.560 --> 2:27:05.040\n your mind a powerful theory that may turn out to be a useful, maybe not.\n\n2:27:05.040 --> 2:27:09.840\n So can't you also play the game enough?\n\n2:27:09.840 --> 2:27:16.640\n Like with the children, so like publish and, but also if you told me that this would work,\n\n2:27:16.640 --> 2:27:23.960\n really what I want to do, you see, is I would love to revolutionize a field with an H index\n\n2:27:23.960 --> 2:27:31.700\n of zero, like we have these proxies that count how many papers you've written, how cited\n\n2:27:31.700 --> 2:27:34.160\n are the papers you've written.\n\n2:27:34.160 --> 2:27:35.160\n All of this is nonsense.\n\n2:27:35.160 --> 2:27:36.160\n That's interesting.\n\n2:27:36.160 --> 2:27:37.160\n Sorry.\n\n2:27:37.160 --> 2:27:40.240\n What do you mean by field with an H index as your, so a totally new field.\n\n2:27:40.240 --> 2:27:42.200\n H index is count somehow.\n\n2:27:42.200 --> 2:27:46.320\n How many papers have you gotten that get so many citations?\n\n2:27:46.320 --> 2:27:56.160\n Let's say H index undefined, like for example, um, I don't have an advisor for my PhD, but\n\n2:27:56.160 --> 2:28:01.400\n I have to have an advisor as far as something called the math genealogy project that tracks\n\n2:28:01.400 --> 2:28:07.160\n who advised who, who advised whom down the line.\n\n2:28:07.160 --> 2:28:10.600\n So I am my own advisor, which sets up a loop, right?\n\n2:28:10.600 --> 2:28:11.600\n How many students do I have?\n\n2:28:11.600 --> 2:28:12.600\n An infinite number.\n\n2:28:12.600 --> 2:28:16.940\n Um, your descendants, they don't want to have that story.\n\n2:28:16.940 --> 2:28:21.920\n So I have to be, I have to have formal advisor, Raul bought, and my Wikipedia entry, for example,\n\n2:28:21.920 --> 2:28:25.760\n says that I was advised by Raul bought, which is not true.\n\n2:28:25.760 --> 2:28:31.000\n So you get fit into a system that says, well, we have to know what your H index is.\n\n2:28:31.000 --> 2:28:34.520\n We have to know, um, you know, where are you a professor?\n\n2:28:34.520 --> 2:28:38.040\n If you want to apply for a grant, it makes all of these assumptions.\n\n2:28:38.040 --> 2:28:41.960\n What I'm trying to do is in part to show all of this is nonsense.\n\n2:28:41.960 --> 2:28:45.760\n This is proxy BS that came up in the institutional setting.\n\n2:28:45.760 --> 2:28:50.400\n And right now it's important for those of us who are still vital, like Elon, it would\n\n2:28:50.400 --> 2:28:53.640\n be great to have Elon as a professor of physics and engineering.\n\n2:28:53.640 --> 2:28:54.640\n Yeah.\n\n2:28:54.640 --> 2:28:55.640\n Right.\n\n2:28:55.640 --> 2:29:00.440\n It seems ridiculous to say, but just as a shot, just as a shot in the arm.\n\n2:29:00.440 --> 2:29:01.440\n Yeah.\n\n2:29:01.440 --> 2:29:07.120\n You know, like it'd be great to have Elon at Caltech even one day a week, one day a\n\n2:29:07.120 --> 2:29:08.120\n month.\n\n2:29:08.120 --> 2:29:09.120\n Okay.\n\n2:29:09.120 --> 2:29:10.920\n Well, why can't we be in there?\n\n2:29:10.920 --> 2:29:11.920\n It's the same reason.\n\n2:29:11.920 --> 2:29:13.440\n Well, why can't you be on the view?\n\n2:29:13.440 --> 2:29:14.880\n Why can't you be on bill Martin?\n\n2:29:14.880 --> 2:29:18.200\n We need to know what you're going to do before we take you on the show on the show.\n\n2:29:18.200 --> 2:29:20.760\n Well, I don't want to tell you what I'm going to do.\n\n2:29:20.760 --> 2:29:24.440\n Do you think you need to be able to dance the dance a little bit?\n\n2:29:24.440 --> 2:29:26.760\n I can dance the dance fun to be on the view.\n\n2:29:26.760 --> 2:29:27.760\n Oh, come on.\n\n2:29:27.760 --> 2:29:28.760\n So you can, yeah, you do.\n\n2:29:28.760 --> 2:29:30.560\n You're not, I can do that.\n\n2:29:30.560 --> 2:29:31.560\n Fine.\n\n2:29:31.560 --> 2:29:37.320\n Here's where the place that it goes south is there like a set of questions that get\n\n2:29:37.320 --> 2:29:39.880\n you into this more adversarial stuff.\n\n2:29:39.880 --> 2:29:44.680\n And you've in fact asked some of those more adversarial questions, the setting, and they're\n\n2:29:44.680 --> 2:29:49.200\n not things that are necessarily aggressive, but they're things that are making assumptions.\n\n2:29:49.200 --> 2:29:50.200\n Right.\n\n2:29:50.200 --> 2:29:51.200\n Right.\n\n2:29:51.200 --> 2:29:57.120\n So when you make a, I have a question is like, you know, Lex, are you avoiding your critics?\n\n2:29:57.120 --> 2:29:58.720\n You know, it's just like, okay, well why did you?\n\n2:29:58.720 --> 2:29:59.720\n You frame that that way.\n\n2:29:59.720 --> 2:30:04.480\n Or the next question would be like, um, do you think that you should have a special exemption\n\n2:30:04.480 --> 2:30:07.400\n and that you should have the right to break rules and everyone else should have to follow\n\n2:30:07.400 --> 2:30:08.400\n them?\n\n2:30:08.400 --> 2:30:09.960\n Like that question I find innervating.\n\n2:30:09.960 --> 2:30:10.960\n Yeah.\n\n2:30:10.960 --> 2:30:12.400\n It doesn't really come out of anything meaningful.\n\n2:30:12.400 --> 2:30:16.160\n It's just like we feel we're supposed to ask that of the other person to show that we're\n\n2:30:16.160 --> 2:30:18.480\n not captured by their madness.\n\n2:30:18.480 --> 2:30:20.120\n That's not the real question you want to ask me.\n\n2:30:20.120 --> 2:30:24.480\n If you want to get really excited about this, you want to ask, do you think this thing is\n\n2:30:24.480 --> 2:30:25.480\n right?\n\n2:30:25.480 --> 2:30:26.480\n Yeah.\n\n2:30:26.480 --> 2:30:27.480\n Weirdly I do.\n\n2:30:27.480 --> 2:30:30.160\n Do you think that it's going to be immediately seen to be right?\n\n2:30:30.160 --> 2:30:31.160\n I don't.\n\n2:30:31.160 --> 2:30:34.280\n I think it's going to, it's going to have an interesting fight and it's going to have\n\n2:30:34.280 --> 2:30:39.560\n an interesting evolution and well, what do you hope to do with it in nonphysical terms?\n\n2:30:39.560 --> 2:30:47.240\n Gosh, I hope it revolutionizes our relationship of well with people outside of the institutional\n\n2:30:47.240 --> 2:30:52.280\n framework and it re inflicts us into the institutional framework where we can do the most good to\n\n2:30:52.280 --> 2:30:55.500\n bring the institutions back to health.\n\n2:30:55.500 --> 2:31:00.480\n You know, it's like these are positive, uplifting questions and if you had Frank will check,\n\n2:31:00.480 --> 2:31:05.240\n you wouldn't say, Frank, let's be honest, you have done very little with your life after\n\n2:31:05.240 --> 2:31:10.160\n the original, a huge show that you used to break onto the physics scene.\n\n2:31:10.160 --> 2:31:14.720\n Like we weirdly ask people different questions based upon how they sit down.\n\n2:31:14.720 --> 2:31:15.720\n Yeah.\n\n2:31:15.720 --> 2:31:16.720\n That's very strange, right?\n\n2:31:16.720 --> 2:31:20.000\n But you have to understand that.\n\n2:31:20.000 --> 2:31:21.000\n So here's the thing.\n\n2:31:21.000 --> 2:31:27.440\n I get these days, a large number of emails from people with the equivalent of a theory\n\n2:31:27.440 --> 2:31:39.920\n of everything for AGI and I use my own radar, BS radar to detect unfairly, perhaps whether\n\n2:31:39.920 --> 2:31:48.680\n they're full of shit or not, because I love where you're going with this, by the way.\n\n2:31:48.680 --> 2:31:54.400\n My concern I often think about is there's elements of brilliance in what people write\n\n2:31:54.400 --> 2:32:01.900\n to me and I'm trying to right now, as you made it clear, the kind of judgments and assumptions\n\n2:32:01.900 --> 2:32:08.440\n we make, how am I supposed to deal with you who are not an outsider of the system and\n\n2:32:08.440 --> 2:32:15.680\n think about what you're doing because my radar is saying you're not full of shit.\n\n2:32:15.680 --> 2:32:18.260\n But I'm also not completely outside of the system.\n\n2:32:18.260 --> 2:32:19.260\n That's right.\n\n2:32:19.260 --> 2:32:20.620\n You've danced beautifully.\n\n2:32:20.620 --> 2:32:26.080\n You've actually got all the credibility that you're supposed to get, all the nice little\n\n2:32:26.080 --> 2:32:33.080\n stamps of approval, not all, but a large enough amount.\n\n2:32:33.080 --> 2:32:41.560\n I mean, it's hard to put into words exactly why you sound, whether your theory turns out\n\n2:32:41.560 --> 2:32:46.720\n to be good or not, you sound like a special human being.\n\n2:32:46.720 --> 2:32:50.400\n I appreciate that and thank you in a good way.\n\n2:32:50.400 --> 2:32:54.840\n So but what am I supposed to do with that flood of emails from AGI?\n\n2:32:54.840 --> 2:32:56.640\n Why do I sound different?\n\n2:32:56.640 --> 2:32:58.240\n I don't know.\n\n2:32:58.240 --> 2:32:59.600\n And I would like to systemize that.\n\n2:32:59.600 --> 2:33:01.480\n I don't know.\n\n2:33:01.480 --> 2:33:09.420\n Look, you know, when you're talking to people, you very quickly can surmise, like, am I claiming\n\n2:33:09.420 --> 2:33:10.420\n to be a physicist?\n\n2:33:10.420 --> 2:33:11.600\n No, I say it every turn.\n\n2:33:11.600 --> 2:33:14.840\n I'm not a physicist, right?\n\n2:33:14.840 --> 2:33:17.720\n When I say to you, when you say something about bundles, you say, well, can you explain\n\n2:33:17.720 --> 2:33:18.720\n it differently?\n\n2:33:18.720 --> 2:33:25.080\n You know, I'm pushing around on this area, that lever over there.\n\n2:33:25.080 --> 2:33:30.320\n I'm trying to find something that we can play with and engage.\n\n2:33:30.320 --> 2:33:34.540\n And you know, another thing is that I'll say something at scale.\n\n2:33:34.540 --> 2:33:38.840\n So if I was saying completely wrong things about bundles on the Joe Rogan program, you\n\n2:33:38.840 --> 2:33:41.480\n don't think that we wouldn't hear a crushing chorus.\n\n2:33:41.480 --> 2:33:42.480\n Yes.\n\n2:33:42.480 --> 2:33:43.480\n Absolutely.\n\n2:33:43.480 --> 2:33:45.400\n And you know, same thing with geometric unity.\n\n2:33:45.400 --> 2:33:50.160\n So I put up this video from this Oxford lecture.\n\n2:33:50.160 --> 2:33:56.840\n I understand that it's not a standard lecture, but you haven't heard, you know, the most\n\n2:33:56.840 --> 2:34:00.960\n brilliant people in the field say, well, this is obviously nonsense.\n\n2:34:00.960 --> 2:34:01.960\n They don't know what to make of it.\n\n2:34:01.960 --> 2:34:06.720\n And they're going to hide behind, well, he hasn't said enough details.\n\n2:34:06.720 --> 2:34:07.720\n Where's the paper?\n\n2:34:07.720 --> 2:34:08.720\n Where's the paper?\n\n2:34:08.720 --> 2:34:10.560\n I've seen the criticism.\n\n2:34:10.560 --> 2:34:11.880\n I've gotten the same kind of criticism.\n\n2:34:11.880 --> 2:34:19.120\n I've published a few things and like, especially stuff related to Tesla that we did studies\n\n2:34:19.120 --> 2:34:24.480\n on Tesla vehicles and the kind of criticism I've gotten, which showed that they're completely.\n\n2:34:24.480 --> 2:34:25.480\n Oh, right.\n\n2:34:25.480 --> 2:34:29.720\n Like the guy who had Elon Musk on his program twice is going to give us an accurate assessment.\n\n2:34:29.720 --> 2:34:30.720\n Next.\n\n2:34:30.720 --> 2:34:31.720\n Exactly.\n\n2:34:31.720 --> 2:34:32.720\n Exactly.\n\n2:34:32.720 --> 2:34:33.720\n Exactly.\n\n2:34:33.720 --> 2:34:34.720\n It's just very low level.\n\n2:34:34.720 --> 2:34:40.480\n Like without actually ever addressing the content.\n\n2:34:40.480 --> 2:34:44.840\n You know, Lex, I think that in part you're trying to solve a puzzle that isn't really\n\n2:34:44.840 --> 2:34:45.840\n your puzzle.\n\n2:34:45.840 --> 2:34:47.640\n I think, you know, that I'm sincere.\n\n2:34:47.640 --> 2:34:50.820\n You don't know whether the theory is going to work or not.\n\n2:34:50.820 --> 2:34:55.440\n And you know that it's not coming out of somebody who's coming out of left field, like the story\n\n2:34:55.440 --> 2:34:56.440\n makes sense.\n\n2:34:56.440 --> 2:35:01.880\n There's enough that's new and creative and different in other aspects where you can check\n\n2:35:01.880 --> 2:35:08.120\n me that your real concern is, are you really telling me that when you start breaking the\n\n2:35:08.120 --> 2:35:13.080\n rules, you see the system for what it is and it's become really vicious and aggressive.\n\n2:35:13.080 --> 2:35:18.240\n And the answer is yes, and I had to break the rules in part because of learning issues\n\n2:35:18.240 --> 2:35:23.620\n because I came into this field, you know, with a totally different set of attributes.\n\n2:35:23.620 --> 2:35:28.300\n My profile just doesn't look like anybody else's remotely, but as a result, what that\n\n2:35:28.300 --> 2:35:34.080\n did is it showed me what is the system true to its own ideals or does it just follow these\n\n2:35:34.080 --> 2:35:39.360\n weird procedures and then when it, when you take it off the rails, it behaves terribly.\n\n2:35:39.360 --> 2:35:45.500\n And that's really what my story I think does is it just says, well, he completely takes\n\n2:35:45.500 --> 2:35:49.960\n the system into new territory where it's not expecting to have to deal with somebody with\n\n2:35:49.960 --> 2:35:52.400\n these confusing sets of attributes.\n\n2:35:52.400 --> 2:35:56.440\n And I think what he's telling us is he believes it behaves terribly.\n\n2:35:56.440 --> 2:36:04.320\n Now, if you take somebody with perfect standardized tests and you know, a winner of math competitions\n\n2:36:04.320 --> 2:36:09.880\n and you put them in a PhD program, they're probably going to be okay.\n\n2:36:09.880 --> 2:36:17.680\n I'm not saying that the system, um, you know, breaks down for any everybody under all circumstances.\n\n2:36:17.680 --> 2:36:23.360\n I'm saying when you present the system with a novel situation at the moment, it will almost\n\n2:36:23.360 --> 2:36:29.240\n certainly break down with probability approaching 100%.\n\n2:36:29.240 --> 2:36:35.840\n But to me, the painful and the tragic thing is it, uh, sorry to bring out my motherly\n\n2:36:35.840 --> 2:36:39.220\n instinct, but it feels like it's too much.\n\n2:36:39.220 --> 2:36:44.280\n It could be too much of a burden to exist outside the system, maybe, but psychologically,\n\n2:36:44.280 --> 2:36:51.760\n first of all, I've got a podcast that I kind of like and I've got amazing friends.\n\n2:36:51.760 --> 2:36:55.840\n I have a life which has more interesting people passing through it than I know what to do\n\n2:36:55.840 --> 2:36:56.840\n with.\n\n2:36:56.840 --> 2:36:57.840\n Yeah.\n\n2:36:57.840 --> 2:36:58.840\n And they haven't managed to kill me off yet.\n\n2:36:58.840 --> 2:37:02.000\n So, so far, so good.\n\n2:37:02.000 --> 2:37:06.400\n Speaking of which you host an amazing podcast that we've mentioned several times, but should\n\n2:37:06.400 --> 2:37:13.440\n mention over and over the portal, uh, where you somehow manage every single conversation\n\n2:37:13.440 --> 2:37:15.560\n is a surprise.\n\n2:37:15.560 --> 2:37:22.080\n You go, I mean, not just the guests, but just the places you take them, uh, the, the kind\n\n2:37:22.080 --> 2:37:25.280\n of ways they become challenging and how you recover from that.\n\n2:37:25.280 --> 2:37:30.920\n I mean, it's, uh, there's just, it's full of genuine human moments.\n\n2:37:30.920 --> 2:37:35.280\n So I really appreciate what you're, it's a fun, fun podcast to listen to.\n\n2:37:35.280 --> 2:37:38.240\n Uh, let me ask some silly questions about it.\n\n2:37:38.240 --> 2:37:43.480\n What have you learned about conversation about human to human conversation?\n\n2:37:43.480 --> 2:37:50.040\n Well, I have a problem that I haven't solved on the portal, which is that in general, when\n\n2:37:50.040 --> 2:37:56.760\n I ask people questions, they usually find their deeply grooved answers and I'm not so\n\n2:37:56.760 --> 2:37:59.120\n interested in all of the deeply grooved answers.\n\n2:37:59.120 --> 2:38:03.920\n And so there's a complaint, which I'm very sympathetic to actually that I talk over people\n\n2:38:03.920 --> 2:38:05.400\n that I won't sit still for the answer.\n\n2:38:05.400 --> 2:38:09.280\n And I think that that's weirdly sort of correct.\n\n2:38:09.280 --> 2:38:12.680\n It's not that I'm not interested in hearing other voices.\n\n2:38:12.680 --> 2:38:16.880\n That I'm not interested in hearing the same voice on my program that I could have gotten\n\n2:38:16.880 --> 2:38:17.880\n on somebody else's.\n\n2:38:17.880 --> 2:38:19.600\n And I haven't solved that well.\n\n2:38:19.600 --> 2:38:25.200\n So I've learned that I need a new conversational technique where I can keep somebody from finding\n\n2:38:25.200 --> 2:38:29.960\n their comfortable place and yet not be the voice talking over that person.\n\n2:38:29.960 --> 2:38:30.960\n Yeah.\n\n2:38:30.960 --> 2:38:31.960\n It's funny.\n\n2:38:31.960 --> 2:38:36.440\n I can sense like your conversation with Brett, I can sense you detect that the line he's\n\n2:38:36.440 --> 2:38:43.800\n going down, you know how it's going to end and you think it's a useless line, so you'll\n\n2:38:43.800 --> 2:38:47.360\n just stop it right there and you take them into the direction that you think it should\n\n2:38:47.360 --> 2:38:48.360\n go.\n\n2:38:48.360 --> 2:38:49.360\n But that requires interruption.\n\n2:38:49.360 --> 2:38:51.320\n Well, and it does so far.\n\n2:38:51.320 --> 2:38:52.440\n I haven't found a better way.\n\n2:38:52.440 --> 2:38:54.240\n I'm looking for a better way.\n\n2:38:54.240 --> 2:38:57.020\n It's not like I don't hear the problem.\n\n2:38:57.020 --> 2:38:59.280\n I do hear the problem.\n\n2:38:59.280 --> 2:39:01.880\n I haven't solved the problem.\n\n2:39:01.880 --> 2:39:06.680\n And you know, on the, on the bread episode, um, I was insufferable.\n\n2:39:06.680 --> 2:39:08.640\n It was very difficult to listen to.\n\n2:39:08.640 --> 2:39:10.520\n It was so overbearing.\n\n2:39:10.520 --> 2:39:12.640\n But on the other hand, I was right.\n\n2:39:12.640 --> 2:39:14.000\n You know, it's like funny.\n\n2:39:14.000 --> 2:39:19.360\n You keep saying that, but I didn't find it maybe because I heard brothers, like I heard\n\n2:39:19.360 --> 2:39:20.360\n a big brother.\n\n2:39:20.360 --> 2:39:21.360\n Yeah.\n\n2:39:21.360 --> 2:39:22.360\n It was pretty bad.\n\n2:39:22.360 --> 2:39:23.360\n Really?\n\n2:39:23.360 --> 2:39:24.360\n I think so.\n\n2:39:24.360 --> 2:39:25.360\n I didn't think it was bad.\n\n2:39:25.360 --> 2:39:26.440\n Well, a lot of people found it interesting.\n\n2:39:26.440 --> 2:39:31.040\n And I think it also has to do with the fact that this has become a frequent experience.\n\n2:39:31.040 --> 2:39:35.960\n I have several shows where somebody who I very much admire and think of as courageous,\n\n2:39:35.960 --> 2:39:41.400\n um, you know, I'm talking with them, maybe we're friends and they sit down on the show\n\n2:39:41.400 --> 2:39:44.560\n and they immediately become this fake person.\n\n2:39:44.560 --> 2:39:49.200\n Like two seconds in there, they're sort of saying, well, I don't want to be too critical\n\n2:39:49.200 --> 2:39:50.200\n or too harsh.\n\n2:39:50.200 --> 2:39:51.200\n I don't want to name any names.\n\n2:39:51.200 --> 2:39:52.200\n I wanted this story.\n\n2:39:52.200 --> 2:39:57.440\n He was like, okay, I'm going to put my listeners through three hours of you being sweetness\n\n2:39:57.440 --> 2:39:58.440\n and light.\n\n2:39:58.440 --> 2:40:04.960\n Like at least give me some reality and then we can decide to shelve the show and never\n\n2:40:04.960 --> 2:40:10.040\n let it hear, uh, you know, the, the, the call of freedom in the, in the bigger world.\n\n2:40:10.040 --> 2:40:12.800\n But I've seen you break out of that a few times.\n\n2:40:12.800 --> 2:40:18.000\n I've seen you to be successful that, uh, I forgot to guess, but she was dressed with,\n\n2:40:18.000 --> 2:40:24.520\n um, um, you were at the end of the episode, you had an argument about Brett.\n\n2:40:24.520 --> 2:40:25.520\n I forgot.\n\n2:40:25.520 --> 2:40:26.520\n Agnes Callard.\n\n2:40:26.520 --> 2:40:27.520\n Yeah.\n\n2:40:27.520 --> 2:40:30.080\n She was one of the philosophers for at the university of Chicago.\n\n2:40:30.080 --> 2:40:31.080\n Yeah.\n\n2:40:31.080 --> 2:40:33.280\n You've continuously broken out of her.\n\n2:40:33.280 --> 2:40:38.040\n Uh, you guys went, you know, uh, I didn't even seem pretty genuine.\n\n2:40:38.040 --> 2:40:39.400\n I like her.\n\n2:40:39.400 --> 2:40:42.720\n I'm completely ethically opposed to what she's ethically for.\n\n2:40:42.720 --> 2:40:44.480\n Well, she was great.\n\n2:40:44.480 --> 2:40:46.000\n And she wasn't like that.\n\n2:40:46.000 --> 2:40:47.600\n You're both going hard.\n\n2:40:47.600 --> 2:40:48.600\n She's a grownup.\n\n2:40:48.600 --> 2:40:49.600\n Yeah.\n\n2:40:49.600 --> 2:40:50.600\n And she knows that I care about her.\n\n2:40:50.600 --> 2:40:51.600\n So that was awesome.\n\n2:40:51.600 --> 2:40:52.600\n Yeah.\n\n2:40:52.600 --> 2:40:55.520\n But you're saying that some people are difficult to break out.\n\n2:40:55.520 --> 2:40:59.840\n Well, it's just that, you know, she was bringing the courage of her convictions.\n\n2:40:59.840 --> 2:41:05.320\n She was sort of defending the system and I thought, wow, that's a pretty indefensible\n\n2:41:05.320 --> 2:41:06.320\n system that you're doing.\n\n2:41:06.320 --> 2:41:07.320\n That's great though.\n\n2:41:07.320 --> 2:41:08.320\n She's doing that.\n\n2:41:08.320 --> 2:41:09.320\n Isn't it?\n\n2:41:09.320 --> 2:41:13.840\n I mean, it made for an awesome, it's very informative for the world.\n\n2:41:13.840 --> 2:41:14.840\n Yes.\n\n2:41:14.840 --> 2:41:15.840\n You just hated.\n\n2:41:15.840 --> 2:41:19.720\n I just can't stand the idea that somebody says, well, we don't care who gets paid or\n\n2:41:19.720 --> 2:41:21.920\n who gets the credit as long as we get the goodies.\n\n2:41:21.920 --> 2:41:24.360\n Cause that seems like insane.\n\n2:41:24.360 --> 2:41:30.760\n Have you ever been afraid leading into a conversation?\n\n2:41:30.760 --> 2:41:31.760\n Gary Kasparov.\n\n2:41:31.760 --> 2:41:39.920\n By the way, I mean, I know I'm just a fan taking requests, but I started, I started\n\n2:41:39.920 --> 2:41:43.280\n the beginning in Russian and in fact I used one word incorrectly.\n\n2:41:43.280 --> 2:41:44.280\n Is that terrible?\n\n2:41:44.280 --> 2:41:46.240\n You know, it was, it was pretty good.\n\n2:41:46.240 --> 2:41:47.240\n It's pretty good Russian.\n\n2:41:47.240 --> 2:41:49.680\n What was terrible is I think he complimented you.\n\n2:41:49.680 --> 2:41:50.680\n Right?\n\n2:41:50.680 --> 2:41:51.680\n No.\n\n2:41:51.680 --> 2:41:52.680\n Did he compliment you or was that me?\n\n2:41:52.680 --> 2:41:54.600\n Did he compliment you on your Russian?\n\n2:41:54.600 --> 2:41:57.040\n Well, he said almost perfect Russian.\n\n2:41:57.040 --> 2:41:58.040\n Yeah.\n\n2:41:58.040 --> 2:42:00.040\n Like he was full of shit.\n\n2:42:00.040 --> 2:42:03.000\n That was not great Russian, but that was not great Russian.\n\n2:42:03.000 --> 2:42:04.000\n That was great.\n\n2:42:04.000 --> 2:42:05.000\n That was hard.\n\n2:42:05.000 --> 2:42:07.280\n That was, you tried hard, which is what matters.\n\n2:42:07.280 --> 2:42:08.280\n That is so insulting.\n\n2:42:08.280 --> 2:42:10.160\n I hope so.\n\n2:42:10.160 --> 2:42:12.160\n But I do hope you continue.\n\n2:42:12.160 --> 2:42:13.960\n It felt like, I don't know how long it went.\n\n2:42:13.960 --> 2:42:18.600\n It might've been like a two hour conversation, but it felt, I hope it continues.\n\n2:42:18.600 --> 2:42:21.520\n Like I feel like you have many conversations with Gary.\n\n2:42:21.520 --> 2:42:22.520\n Yeah.\n\n2:42:22.520 --> 2:42:23.520\n I would love to hear.\n\n2:42:23.520 --> 2:42:27.720\n There's certain conversations I would just love to hear a long, much longer.\n\n2:42:27.720 --> 2:42:33.320\n He's coming from a very, it's this issue about needing to overpower people in a very dangerous\n\n2:42:33.320 --> 2:42:34.320\n world.\n\n2:42:34.320 --> 2:42:36.320\n And so Gary has that need.\n\n2:42:36.320 --> 2:42:37.320\n Yeah.\n\n2:42:37.320 --> 2:42:38.880\n He wasn't, he was interrupting you.\n\n2:42:38.880 --> 2:42:39.880\n Sure.\n\n2:42:39.880 --> 2:42:40.880\n It was an interesting dynamic.\n\n2:42:40.880 --> 2:42:43.200\n It was a, it was an interesting dynamic.\n\n2:42:43.200 --> 2:42:44.760\n Two Weinsteins going at you.\n\n2:42:44.760 --> 2:42:47.760\n I mean, two powerhouse egos, brilliant.\n\n2:42:47.760 --> 2:42:51.560\n No, don't say egos, minds, spirits.\n\n2:42:51.560 --> 2:42:52.560\n You don't have an ego.\n\n2:42:52.560 --> 2:42:54.200\n You're the most humble person I know.\n\n2:42:54.200 --> 2:42:55.360\n Is that true?\n\n2:42:55.360 --> 2:42:58.520\n No, that's a complete lie.\n\n2:42:58.520 --> 2:43:01.320\n Do you think about your own mortality, death?\n\n2:43:01.320 --> 2:43:02.320\n Sure.\n\n2:43:02.320 --> 2:43:03.320\n Are you afraid?\n\n2:43:03.320 --> 2:43:07.840\n Well, I released a theory during something that can kill older people.\n\n2:43:07.840 --> 2:43:08.840\n Sure.\n\n2:43:08.840 --> 2:43:12.640\n Oh, is there a little bit of a parallel there?\n\n2:43:12.640 --> 2:43:13.640\n Of course.\n\n2:43:13.640 --> 2:43:14.640\n Of course.\n\n2:43:14.640 --> 2:43:16.860\n I don't want it to die with me.\n\n2:43:16.860 --> 2:43:20.000\n What do you hope your legacy is?\n\n2:43:20.000 --> 2:43:28.960\n Oh, I hope my legacy is accurate.\n\n2:43:28.960 --> 2:43:33.520\n I'd like to write on my accomplishments rather than how my community decided to ding me while\n\n2:43:33.520 --> 2:43:34.520\n I was alive.\n\n2:43:34.520 --> 2:43:35.520\n That would be great.\n\n2:43:35.520 --> 2:43:38.280\n What about if it was significantly exaggerated?\n\n2:43:38.280 --> 2:43:39.820\n I don't want it.\n\n2:43:39.820 --> 2:43:42.560\n You want it to be accurate.\n\n2:43:42.560 --> 2:43:48.240\n I've got some pretty terrific stuff and whether it works out or doesn't that I would like\n\n2:43:48.240 --> 2:43:52.920\n it to reflect what I actually was.\n\n2:43:52.920 --> 2:43:56.600\n I'll settle for accurate.\n\n2:43:56.600 --> 2:44:04.240\n What would you say, what is the greatest element of a Eric Weinstein accomplishment in life\n\n2:44:04.240 --> 2:44:09.360\n in terms of being accurate?\n\n2:44:09.360 --> 2:44:14.160\n What are you most proud of?\n\n2:44:14.160 --> 2:44:27.160\n The idea that we were stalled out in the hardest field at the most difficult juncture and that\n\n2:44:27.160 --> 2:44:36.120\n I didn't listen to that voice ever that said, stop, you're hurting yourself.\n\n2:44:36.120 --> 2:44:37.120\n You're hurting your family.\n\n2:44:37.120 --> 2:44:38.120\n You're hurting everybody.\n\n2:44:38.120 --> 2:44:39.120\n You're embarrassing yourself.\n\n2:44:39.120 --> 2:44:40.120\n You're screwing up.\n\n2:44:40.120 --> 2:44:41.120\n You can't do this.\n\n2:44:41.120 --> 2:44:42.120\n You're a failure.\n\n2:44:42.120 --> 2:44:43.540\n You're a fraud.\n\n2:44:43.540 --> 2:44:46.640\n Turn back, save yourself.\n\n2:44:46.640 --> 2:44:58.800\n That voice, I didn't ultimately listen to it and it was going for 35, 37 years.\n\n2:44:58.800 --> 2:45:02.400\n Very hard.\n\n2:45:02.400 --> 2:45:05.440\n And I hope you never listen to that voice.\n\n2:45:05.440 --> 2:45:07.680\n That's why you're an inspiration.\n\n2:45:07.680 --> 2:45:08.680\n Thank you.\n\n2:45:08.680 --> 2:45:09.680\n I appreciate that.\n\n2:45:09.680 --> 2:45:15.680\n I'm just infinitely honored that you would spend time with me.\n\n2:45:15.680 --> 2:45:21.200\n You've been a mentor to me, almost a friend.\n\n2:45:21.200 --> 2:45:23.600\n I can't imagine a better person to talk to in this world.\n\n2:45:23.600 --> 2:45:24.920\n So thank you so much for talking to me.\n\n2:45:24.920 --> 2:45:26.520\n I can't wait till we do it again.\n\n2:45:26.520 --> 2:45:32.280\n Lex, thanks for sticking with me and thanks for being the most singular guy in the podcasting\n\n2:45:32.280 --> 2:45:33.280\n space.\n\n2:45:33.280 --> 2:45:38.080\n In terms of all of my interviews, I would say that the last one I did with you, many\n\n2:45:38.080 --> 2:45:43.840\n people feel was my best and it was a nonconventional one.\n\n2:45:43.840 --> 2:45:46.720\n So whatever it is that you're bringing to the game, I think everyone's noticing and\n\n2:45:46.720 --> 2:45:48.320\n keep at it.\n\n2:45:48.320 --> 2:45:49.320\n Thank you.\n\n2:45:49.320 --> 2:45:52.640\n Thanks for listening to this conversation with Eric Weinstein.\n\n2:45:52.640 --> 2:45:55.600\n And thank you to our presenting sponsor, Cash App.\n\n2:45:55.600 --> 2:46:00.360\n Please consider supporting the podcast by downloading Cash App and using code LexPodcast.\n\n2:46:00.360 --> 2:46:06.720\n If you enjoy this podcast, subscribe on YouTube, review it with five stars on Apple Podcast,\n\n2:46:06.720 --> 2:46:11.720\n subscribe on Patreon, or simply connect with me on Twitter at Lex Friedman.\n\n2:46:11.720 --> 2:46:16.400\n And now let me leave you with some words of wisdom from Eric Weinstein's first appearance\n\n2:46:16.400 --> 2:46:19.120\n on this podcast.\n\n2:46:19.120 --> 2:46:24.560\n Everything is great about war, except all the destruction.\n\n2:46:24.560 --> 2:46:37.880\n Thank you for listening and hope to see you next time.\n\n"
}