{
  "title": "Konstantin Batygin: Planet 9 and the Edge of Our Solar System | Lex Fridman Podcast #201",
  "id": "tm7poMupE8k",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:06.640\n The following is a conversation with Konstantin Batygin, planetary astrophysicist at Caltech,\n\n00:06.640 --> 00:13.140\n interested in, among other things, the search for the distant, the mysterious, Planet Nine,\n\n00:13.140 --> 00:16.060\n in the outer regions of our solar system.\n\n00:16.060 --> 00:21.920\n Quick mention of our sponsors, Squarespace, Literati, Onnit, and Ni.\n\n00:21.920 --> 00:25.200\n Check them out in the description to support this podcast.\n\n00:25.200 --> 00:30.160\n As a side note, let me say that our little sun is orbited by not just a few planets in\n\n00:30.160 --> 00:36.200\n the planetary region, but trillions of objects in the Kuiper Belt and the Oort Cloud that\n\n00:36.200 --> 00:39.500\n extends over three light years out.\n\n00:39.500 --> 00:45.280\n This to me is amazing, since Proxima Centauri, the closest star to our sun, is only 4.2 light\n\n00:45.280 --> 00:50.280\n years away, and all of it is mostly covered in darkness.\n\n00:50.280 --> 00:54.140\n When I get a chance to go out swimming in the ocean far from the shore, I'm sometimes\n\n00:54.140 --> 00:59.800\n overcome by the terrifying and the exciting feeling of not knowing what's there in the\n\n00:59.800 --> 01:00.800\n deep darkness.\n\n01:00.800 --> 01:04.240\n That's how I feel about the edge of our solar system.\n\n01:04.240 --> 01:09.720\n One day, I hope humans will travel there, or at the very least, AI systems that carry\n\n01:09.720 --> 01:12.360\n the flame of human consciousness.\n\n01:12.360 --> 01:19.120\n This is the Lux Friedman Podcast, and here's my conversation with Konstantin Batygin.\n\n01:19.120 --> 01:21.400\n What is Planet Nine?\n\n01:21.400 --> 01:28.200\n Planet Nine is an object that we believe lives in the solar system beyond the orbit of Neptune.\n\n01:28.200 --> 01:36.480\n It orbits the sun with a period of about 10,000 years, and is about five Earth masses.\n\n01:36.480 --> 01:38.660\n So that's a hypothesized object.\n\n01:38.660 --> 01:41.920\n There's some evidence for this kind of object.\n\n01:41.920 --> 01:44.180\n There's a bunch of different explanations.\n\n01:44.180 --> 01:48.540\n Can you give like an overview of the planets in our solar system?\n\n01:48.540 --> 01:50.160\n How many are there?\n\n01:50.160 --> 01:53.720\n What do we know and not know about them at a high level?\n\n01:53.720 --> 01:54.720\n All right.\n\n01:54.720 --> 01:55.720\n That sounds like a good plan.\n\n01:55.720 --> 02:01.500\n So look, the solar system basically is comprised of two parts, the inner and the outer solar\n\n02:01.500 --> 02:02.500\n system.\n\n02:02.500 --> 02:07.800\n The inner solar system has the planets, Mercury, Venus, Earth, and Mars.\n\n02:07.800 --> 02:14.800\n Now Mercury is about 40% of the orbital separation of where the Earth is.\n\n02:14.800 --> 02:25.160\n It's closer to the sun, Venus is about 70%, then Mars is about 160% further away from\n\n02:25.160 --> 02:27.400\n the sun than is the Earth.\n\n02:27.400 --> 02:33.680\n These planets that we, one of them we occupy, right, are pretty small, okay?\n\n02:33.680 --> 02:40.880\n They're two leading order sort of heavily overgrown asteroids, if you will.\n\n02:40.880 --> 02:46.920\n And this becomes evident when you move out further in the solar system and encounter\n\n02:46.920 --> 02:53.880\n Jupiter, which is 316 Earth masses, right, 10 times the size.\n\n02:53.880 --> 03:00.320\n You know, and Saturn is another huge one, 90 Earth masses at about 10 times the separation\n\n03:00.320 --> 03:07.600\n from the sun as is the Earth, and then you have Uranus and Neptune at 20 and 30 respectively.\n\n03:07.600 --> 03:15.560\n For a long time, that is where the kind of massive part of the solar system ended.\n\n03:15.560 --> 03:22.760\n But what we've learned in the last 30 years is that beyond Neptune, there's this expansive\n\n03:22.760 --> 03:27.560\n field of icy debris, a second icy asteroid belt in the solar system.\n\n03:27.560 --> 03:33.880\n A lot of people have heard of the asteroid belt, which lives between Mars and Jupiter,\n\n03:33.880 --> 03:34.880\n right?\n\n03:34.880 --> 03:40.880\n That's a pretty common thing that people like to imagine and draw on lunch boxes and stuff.\n\n03:40.880 --> 03:47.760\n But beyond Neptune, there's a much more massive and much more radially expansive field of\n\n03:47.760 --> 03:48.760\n debris.\n\n03:48.760 --> 03:54.840\n Pluto, by the way, it belongs to that second, you know, icy asteroid belt, which we call\n\n03:54.840 --> 03:55.840\n the Kuiper belt.\n\n03:55.840 --> 03:59.520\n It's just a big object within that population of bodies.\n\n03:59.520 --> 04:01.280\n Wow, Pluto the planet.\n\n04:01.280 --> 04:05.160\n Pluto the dwarf planet, the former planet, you know.\n\n04:05.160 --> 04:07.920\n Why is Pluto not a planet anymore?\n\n04:07.920 --> 04:09.400\n I mean, it's tiny.\n\n04:09.400 --> 04:10.400\n We used to...\n\n04:10.400 --> 04:12.400\n So size matters when it comes to planets.\n\n04:12.400 --> 04:13.760\n Oh, 100%, 100%.\n\n04:13.760 --> 04:15.980\n It's actually a fascinating story.\n\n04:15.980 --> 04:22.400\n When Pluto was discovered in 1930, the reason it was discovered in the first place is because\n\n04:22.400 --> 04:29.000\n astronomers at the time were looking for a seven Earth mass planet somewhere beyond Neptune.\n\n04:29.000 --> 04:32.080\n It was hypothesized that such an object exists.\n\n04:32.080 --> 04:38.080\n When they found something, they interpreted that as a seven Earth mass planet and immediately\n\n04:38.080 --> 04:42.960\n revised its mass downward because they couldn't resolve the object with the telescope.\n\n04:42.960 --> 04:47.640\n So it looked like just a point mass, you know, star rather than a physical disk.\n\n04:47.640 --> 04:50.840\n They said, well, maybe it's not seven, maybe it's one, right?\n\n04:50.840 --> 04:56.920\n And then, so over the next, you know, I guess 40 years, Pluto's mass kept getting revised\n\n04:56.920 --> 05:04.400\n downwards, downwards, downwards until it was realized that it's like 500 times less massive\n\n05:04.400 --> 05:05.400\n than the Earth.\n\n05:05.400 --> 05:12.820\n I mean, like Pluto's surface area is almost perfectly equal to the surface area of Russia\n\n05:12.820 --> 05:13.820\n actually.\n\n05:13.820 --> 05:17.120\n And you know, Russia is big, but it's not a planet.\n\n05:17.120 --> 05:20.400\n Well, I mean, actually we can touch more on that.\n\n05:20.400 --> 05:22.640\n That's another discussion.\n\n05:22.640 --> 05:29.040\n So in some sense, earlier in the century, Pluto represented kind of our ignorance about\n\n05:29.040 --> 05:31.560\n the edges of the solar system.\n\n05:31.560 --> 05:37.880\n And perhaps planet nine is the thing that represents our ignorance about now the modern\n\n05:37.880 --> 05:41.360\n set of ignorances about the edges of our solar system.\n\n05:41.360 --> 05:42.560\n That's a good way to put it.\n\n05:42.560 --> 05:48.920\n By the way, just imagining this belt of astral debris at the edge of our solar system is\n\n05:48.920 --> 05:49.920\n incredible.\n\n05:49.920 --> 05:51.740\n Can you talk about it a little bit?\n\n05:51.740 --> 05:56.280\n What is the Kuiper belt and what is the Oort cloud?\n\n05:56.280 --> 05:57.280\n Yeah.\n\n05:57.280 --> 05:58.280\n Okay.\n\n05:58.280 --> 06:02.680\n So look, the simple way to think about it is that if you imagine, you know, Neptune's\n\n06:02.680 --> 06:05.280\n orbit like a circle, right?\n\n06:05.280 --> 06:14.880\n Kind of maybe a factor of one and a half, 1.3 times bigger on a radius of 1.3 times\n\n06:14.880 --> 06:18.600\n bigger, you've got a whole collection of icy objects.\n\n06:18.600 --> 06:26.200\n Most of these objects are sort of the size of Austin, you know, maybe a little bit smaller.\n\n06:26.200 --> 06:36.120\n If you then zoom out and explore the orbits of the most long period Kuiper belt object,\n\n06:36.120 --> 06:42.000\n these are the things that have the biggest orbits and take the longest time to go around\n\n06:42.000 --> 06:49.600\n in, then what you find is that beyond a critical orbit size, beyond a critical orbit period,\n\n06:49.600 --> 06:56.280\n which is about 4,000 years, you start to see weird structure, like all the orbits sort\n\n06:56.280 --> 06:58.840\n of point into one direction.\n\n06:58.840 --> 07:04.600\n And all the orbits are kind of tilted in the same way by about 20 degrees with respect\n\n07:04.600 --> 07:05.600\n to Sun.\n\n07:05.600 --> 07:11.160\n This is particularly pronounced in orbits that are not heavily affected by Neptune.\n\n07:11.160 --> 07:17.880\n So there you start to see this weird dichotomy where they're objects which are stable, which\n\n07:17.880 --> 07:22.320\n Neptune does not mess with gravitationally, and unstable objects.\n\n07:22.320 --> 07:27.020\n The unstable objects are basically all over the place because they're being kicked around\n\n07:27.020 --> 07:28.020\n by Neptune.\n\n07:28.020 --> 07:33.360\n The stable orbits show this remarkable pattern of clustering.\n\n07:33.360 --> 07:39.600\n We back, I guess, five years ago interpreted this pattern of clustering as a gravitational\n\n07:39.600 --> 07:45.680\n one way sign, the existence of a planet in a distant planet, right?\n\n07:45.680 --> 07:50.600\n Something that is shepherding and confining these orbits together.\n\n07:50.600 --> 07:57.000\n Of course, right, you have to have some skepticism when you're talking about these things.\n\n07:57.000 --> 08:01.760\n You have to ask the question of, okay, how statistically significant is this clustering?\n\n08:01.760 --> 08:06.600\n And there are many authors that have indeed called that into question.\n\n08:06.600 --> 08:11.920\n We have done our own analyses and basically, just like with all statistics where there's\n\n08:11.920 --> 08:21.400\n kind of multiple ways to do the exercise, you can either ask the question of if I have\n\n08:21.400 --> 08:27.380\n a telescope that has surveyed this part of the sky, what are the chances that I would\n\n08:27.380 --> 08:30.320\n discover this clustering?\n\n08:30.320 --> 08:36.000\n That basically tells you that you have zero confidence, right?\n\n08:36.000 --> 08:40.100\n That does not give you a confident answer one way or another.\n\n08:40.100 --> 08:45.240\n Another way to do the statistics, which is what we prefer to do, is to say we have a\n\n08:45.240 --> 08:50.920\n whole night sky of discoveries in the Kuiper Belt, right?\n\n08:50.920 --> 08:56.520\n And if we have some object over there, which has right ascension and declination, which\n\n08:56.520 --> 09:01.660\n is a way to say it's there on the sky, and it has some brightness, that means somebody\n\n09:01.660 --> 09:07.800\n looked over there and discovered an object, was able to discover an object of that brightness\n\n09:07.800 --> 09:09.360\n or brighter.\n\n09:09.360 --> 09:14.160\n Through that analysis, you can construct a whole map on the sky of kind of where all\n\n09:14.160 --> 09:18.320\n of the surveys that have ever been done have collectively looked.\n\n09:18.320 --> 09:25.560\n So if you do the exercise this way, the false alarm probability of the clustering on which\n\n09:25.560 --> 09:28.720\n the Planet Nine hypothesis is built is about 0.4%.\n\n09:28.720 --> 09:32.280\n Wow, okay, so there's a million questions here.\n\n09:32.280 --> 09:35.320\n One, when you say bright objects, why are they bright?\n\n09:35.320 --> 09:38.920\n Are we talking about actual objects within the Kuiper Belt or the stuff we see through\n\n09:38.920 --> 09:39.920\n the Kuiper Belt?\n\n09:39.920 --> 09:42.360\n This is the actual stuff we see in the Kuiper Belt.\n\n09:42.360 --> 09:46.040\n The way you go about discovering Kuiper Belt objects is pretty easy.\n\n09:46.040 --> 09:49.260\n I mean, it's easy in theory, right?\n\n09:49.260 --> 09:50.620\n Hard in practice.\n\n09:50.620 --> 09:54.640\n All you do is you take snapshots of the sky, right?\n\n09:54.640 --> 09:59.240\n Use that direction, say, and take a high exposure snapshot.\n\n09:59.240 --> 10:03.320\n Then you wait a night and you do it again, and then you wait another night and you do\n\n10:03.320 --> 10:05.000\n it again.\n\n10:05.000 --> 10:09.920\n Objects that are just random stars in the galaxy don't move on the sky, whereas objects\n\n10:09.920 --> 10:11.980\n in the solar system will slowly move.\n\n10:11.980 --> 10:17.640\n This is no different than if you're driving down the freeway, it looks like trees are\n\n10:17.640 --> 10:19.920\n going by you faster than the clouds, right?\n\n10:19.920 --> 10:21.600\n This is parallax.\n\n10:21.600 --> 10:22.600\n That's it.\n\n10:22.600 --> 10:27.440\n It's they're reflecting light off of the sun and it's going back and hitting this.\n\n10:27.440 --> 10:31.480\n There's a little bit of a glimmer from the different objects that you can see based on\n\n10:31.480 --> 10:32.760\n the reflection from the sun.\n\n10:32.760 --> 10:36.140\n So like there's actual light, it's not darkness.\n\n10:36.140 --> 10:37.140\n That's right.\n\n10:37.140 --> 10:41.880\n These are just big icicles basically that are just reflecting sunlight back at you.\n\n10:41.880 --> 10:47.840\n It's then easy to understand why it's so hard to discover them because light has to travel\n\n10:47.840 --> 10:54.960\n to something like 40 times the distance between the earth and the sun and then get reflected\n\n10:54.960 --> 10:55.960\n back.\n\n10:55.960 --> 10:57.440\n Was that like an hour travel?\n\n10:57.440 --> 10:58.880\n Yeah, that's right.\n\n10:58.880 --> 11:04.720\n That's something like that because the earth to the sun is eight minutes, I believe.\n\n11:04.720 --> 11:07.980\n Something in that order of magnitude.\n\n11:07.980 --> 11:09.680\n So that's interesting.\n\n11:09.680 --> 11:12.320\n So you have to account for all of that.\n\n11:12.320 --> 11:18.360\n And then there's a huge amount of data, pixels that are coming from the pictures and you\n\n11:18.360 --> 11:24.840\n have to integrate all of that together to paint a sort of like a high estimate of the\n\n11:24.840 --> 11:25.840\n different objects.\n\n11:25.840 --> 11:26.840\n Can you track them?\n\n11:26.840 --> 11:27.840\n Can you be like, that's Bob?\n\n11:27.840 --> 11:29.400\n Like, can you like?\n\n11:29.400 --> 11:30.400\n Yes, exactly.\n\n11:30.400 --> 11:33.720\n In fact, one of them is named Joe Biden.\n\n11:33.720 --> 11:36.920\n I mean, I'm not like, this is not even a joke, right?\n\n11:36.920 --> 11:38.400\n Is there a Trump one or no?\n\n11:38.400 --> 11:39.400\n No, no.\n\n11:39.400 --> 11:40.400\n Not yet.\n\n11:40.400 --> 11:41.400\n I don't know.\n\n11:41.400 --> 11:43.000\n I don't know for that.\n\n11:43.000 --> 11:49.840\n But like the way it works is if you discover one, you right away get a license plate for\n\n11:49.840 --> 11:51.040\n it.\n\n11:51.040 --> 11:56.840\n So like the first four numbers is the first year that this object has appeared on, you\n\n11:56.840 --> 12:00.000\n know, in the data set, if you will.\n\n12:00.000 --> 12:06.920\n And then there's like this code that follows it, which basically tells you where in the\n\n12:06.920 --> 12:08.160\n sky it is, right?\n\n12:08.160 --> 12:13.640\n So one of the really interesting Kuiper Belt objects, which is very much part of the Planet\n\n12:13.640 --> 12:20.760\n Nine story is called VP113, because Joe Biden was vice president at the time, you know,\n\n12:20.760 --> 12:22.760\n got nicknamed Biden.\n\n12:22.760 --> 12:23.760\n VP113?\n\n12:23.760 --> 12:24.760\n Yeah.\n\n12:24.760 --> 12:27.600\n He got nicknamed Biden.\n\n12:27.600 --> 12:28.600\n Beautiful.\n\n12:28.600 --> 12:32.720\n What's the fingerprint for any particular object?\n\n12:32.720 --> 12:34.200\n Like how do you know it's the same one?\n\n12:34.200 --> 12:38.480\n Or you just kind of like, yeah, from night to night, you take a picture, how do you know\n\n12:38.480 --> 12:39.480\n it's the same object?\n\n12:39.480 --> 12:40.480\n Yeah.\n\n12:40.480 --> 12:45.120\n So the way you know is it appears in almost exactly the same part of the sky except for\n\n12:45.120 --> 12:46.120\n move, but it moves.\n\n12:46.120 --> 12:53.640\n But this is why actually you need at least three nights because oftentimes asteroids,\n\n12:53.640 --> 13:02.300\n which are much closer to the earth, like will appear to move only slightly, but then on\n\n13:02.300 --> 13:03.640\n the third night will move away.\n\n13:03.640 --> 13:07.480\n So that third night is really there to detect acceleration.\n\n13:07.480 --> 13:15.080\n Now the thing that I didn't really realize until, you know, I started observing together\n\n13:15.080 --> 13:20.880\n with my partner in crime in all this, Mike Brown, is just the fact that for the first\n\n13:20.880 --> 13:26.480\n year when you make these detections, the only thing you really know with confidence is where\n\n13:26.480 --> 13:30.580\n it is on the night sky and how far away it is, okay?\n\n13:30.580 --> 13:31.580\n That's it.\n\n13:31.580 --> 13:38.600\n It's all about the orbit because over three days the object just moves so little, right?\n\n13:38.600 --> 13:43.240\n That whole motion on the sky is entirely coming from motion of the earth, right?\n\n13:43.240 --> 13:47.400\n So the earth is kind of the car, the object is the tree and you see it move.\n\n13:47.400 --> 13:52.680\n So then to get some confident information about what its orbit looks like, you have\n\n13:52.680 --> 13:56.640\n to come back a year later and then measure it again.\n\n13:56.640 --> 13:57.640\n Oh, interesting.\n\n13:57.640 --> 14:01.640\n So three nights then come back a year later and do another three nights so you get the\n\n14:01.640 --> 14:07.560\n velocity of the acceleration from the three nights and then you have the maybe the additional\n\n14:07.560 --> 14:08.560\n information.\n\n14:08.560 --> 14:11.520\n Because an orbit is basically described by six parameters.\n\n14:11.520 --> 14:17.180\n So you at least need six independent points, but in reality you need many more observations\n\n14:17.180 --> 14:20.660\n to really pin down the orbit well.\n\n14:20.660 --> 14:24.280\n And from that you're able to construct for that one particular object and orbit and then\n\n14:24.280 --> 14:27.840\n there's of course, like how many objects are there?\n\n14:27.840 --> 14:31.560\n There's like four ish thousand now.\n\n14:31.560 --> 14:36.800\n But like the, in the future that could be like millions.\n\n14:36.800 --> 14:39.040\n Oh sure, oh sure.\n\n14:39.040 --> 14:43.720\n So in fact these things are hard to predict, but there's a new observatory called the Vera\n\n14:43.720 --> 14:48.200\n Rubin Observatory, which is coming online maybe next year.\n\n14:48.200 --> 14:53.280\n I mean with COVID these things are a little bit more uncertain, but they've actually been\n\n14:53.280 --> 14:56.340\n making great progress with construction.\n\n14:56.340 --> 15:04.200\n And so that telescope is just going to sort of scan the night sky every day automatically\n\n15:04.200 --> 15:11.820\n and just, it's such an efficient survey that it might increase the census of the distant\n\n15:11.820 --> 15:15.600\n Kuiper Belt, the things that I'm interested in by a factor of a hundred.\n\n15:15.600 --> 15:18.200\n I mean that would be, that would be really cool.\n\n15:18.200 --> 15:22.520\n And yeah, that's a, that's an incredible...\n\n15:22.520 --> 15:26.480\n I mean they might just find planet nine.\n\n15:26.480 --> 15:27.480\n I mean that's...\n\n15:27.480 --> 15:29.720\n Like almost like literally pictures, like visually.\n\n15:29.720 --> 15:30.720\n I mean, sure.\n\n15:30.720 --> 15:31.720\n Yeah.\n\n15:31.720 --> 15:34.280\n Like the first detection you make, all you know is where it is in the sky and how far\n\n15:34.280 --> 15:35.280\n away it is.\n\n15:35.280 --> 15:39.800\n If something is, you know, 500 times away from the sun, as far away from the sun as\n\n15:39.800 --> 15:42.200\n is the earth, you know that's planet nine.\n\n15:42.200 --> 15:45.920\n That's when the story concludes and then you can study it.\n\n15:45.920 --> 15:46.920\n Now you can study it.\n\n15:46.920 --> 15:47.920\n Yeah.\n\n15:47.920 --> 15:51.760\n By the way, I'm going to use that as like, I don't know, a pickup line or a dating strategy,\n\n15:51.760 --> 15:56.720\n like see the person for three days and then don't see them at all and then see them again\n\n15:56.720 --> 15:59.040\n in a year to determine the orbit.\n\n15:59.040 --> 16:06.000\n And over time you figure out if sort of from a cosmic perspective, this, this whole thing\n\n16:06.000 --> 16:07.000\n works.\n\n16:07.000 --> 16:08.000\n Yeah.\n\n16:08.000 --> 16:09.600\n I have no dating advice to give.\n\n16:09.600 --> 16:16.000\n I was going to use this as a metaphor to somehow map it onto the human condition.\n\n16:16.000 --> 16:17.000\n Okay.\n\n16:17.000 --> 16:18.000\n You mentioned the Kuiper Belt.\n\n16:18.000 --> 16:19.000\n What's the Oort cloud?\n\n16:19.000 --> 16:25.800\n If you look at the Neptune orbit as a one, then the Kuiper Belt is like 1.3 out there\n\n16:25.800 --> 16:28.560\n and then we get farther and farther into the darkness.\n\n16:28.560 --> 16:29.560\n What's the Oort cloud?\n\n16:29.560 --> 16:36.320\n So okay, you've got the kind of main Kuiper Belt, which is about say 1.3, 1.5.\n\n16:36.320 --> 16:40.960\n Then you have something called the scattered disc, which is kind of an extension of the\n\n16:40.960 --> 16:41.960\n Kuiper Belt.\n\n16:41.960 --> 16:48.480\n It's a bunch of these long, very elliptical orbits that hug the orbit of Neptune, but\n\n16:48.480 --> 16:50.320\n come out very far.\n\n16:50.320 --> 16:58.560\n So that, the scattered disc with the current senses, like the, some of the longest orbits\n\n16:58.560 --> 17:04.760\n we know of have a semi major axis.\n\n17:04.760 --> 17:10.080\n So half the orbit length, roughly speaking of about a thousand, thousand times the distance\n\n17:10.080 --> 17:12.320\n between the earth and the sun.\n\n17:12.320 --> 17:21.840\n Now if you keep moving out, okay, eventually once you're at sort of 10,000 to 100,000 roughly,\n\n17:21.840 --> 17:23.160\n that's where the Oort cloud is.\n\n17:23.160 --> 17:30.120\n Now the Oort cloud is a distinct population of icy bodies and is distinct from the Kuiper\n\n17:30.120 --> 17:31.120\n Belt.\n\n17:31.120 --> 17:39.240\n In fact, it's so expansive that it ends roughly halfway between us and the next star.\n\n17:39.240 --> 17:45.360\n It's edge is just dictated by to what extent does the solar gravity reach.\n\n17:45.360 --> 17:47.600\n Solar gravity reaches that far?\n\n17:47.600 --> 17:55.060\n So it has to, wow, imagining this is a little bit overwhelming.\n\n17:55.060 --> 18:03.560\n So there's like a giant, like vast icy rock thingy.\n\n18:03.560 --> 18:04.560\n It's like a sphere.\n\n18:04.560 --> 18:12.360\n It's like, it's an almost spherical structure that engulfs, that encircles the sun and all\n\n18:12.360 --> 18:16.360\n the long period comets come from the Oort cloud.\n\n18:16.360 --> 18:21.440\n They come, the way that they appear, I mean, for already, I don't know, hundreds of years\n\n18:21.440 --> 18:28.440\n we've been detecting and occasionally like a comet will come in and it seemingly comes\n\n18:28.440 --> 18:29.640\n out of nowhere.\n\n18:29.640 --> 18:36.320\n The reason these long period comets appear on very, very long timescales, right?\n\n18:36.320 --> 18:42.400\n These Oort cloud objects that are sitting 30,000 times as far away from the sun as is\n\n18:42.400 --> 18:48.020\n the earth actually interact with the gravity of the galaxy, the tide, effectively the tide\n\n18:48.020 --> 18:53.680\n that the galaxy exerts upon them and their orbits slowly change and they elongate to\n\n18:53.680 --> 19:01.160\n the point where once they, their closest approach to the sun starts to reach a critical distance\n\n19:01.160 --> 19:07.080\n where ice starts to sublimate, then we discover them as comets because then the ice comes\n\n19:07.080 --> 19:08.280\n off of them.\n\n19:08.280 --> 19:13.520\n They look beautiful in the night sky, et cetera, but they're all coming from really, really\n\n19:13.520 --> 19:14.520\n far away.\n\n19:14.520 --> 19:19.240\n So is there, are any of them coming our way from collisions?\n\n19:19.240 --> 19:22.840\n Like how many collisions are there or is there a bunch of space for them to move around?\n\n19:22.840 --> 19:24.080\n Yeah, there's zero.\n\n19:24.080 --> 19:27.080\n It's completely collisionless out there.\n\n19:27.080 --> 19:33.120\n The physical radii of objects are so small compared to the distance between them, right?\n\n19:33.120 --> 19:38.400\n It's just, it is truly a collisionless environment.\n\n19:38.400 --> 19:39.720\n I don't know.\n\n19:39.720 --> 19:46.920\n I think that probably in the age of the solar system have literally been zero collisions\n\n19:46.920 --> 19:48.480\n in the Oort cloud.\n\n19:48.480 --> 19:49.480\n Wow.\n\n19:49.480 --> 19:53.880\n So if you like draw a picture of the solar system, everything's really close together.\n\n19:53.880 --> 19:57.720\n So everything I guess here is spaced far apart.\n\n19:57.720 --> 20:01.420\n Do rogue planets like fly in every once in a while and join?\n\n20:01.420 --> 20:04.000\n Not rogue planets, but rogue objects from out there.\n\n20:04.000 --> 20:05.000\n Oh sure.\n\n20:05.000 --> 20:06.000\n Oh sure.\n\n20:06.000 --> 20:07.000\n Yeah.\n\n20:07.000 --> 20:08.000\n Join the party?\n\n20:08.000 --> 20:09.000\n Yeah, absolutely.\n\n20:09.000 --> 20:15.200\n We've seen a couple of them in the last three or so years, maybe four years now.\n\n20:15.200 --> 20:22.060\n The first one was the one called Uamuamua and it's been all over the news.\n\n20:22.060 --> 20:28.600\n The second one was Comet Borisov discovered by a guy named Borisov.\n\n20:28.600 --> 20:35.960\n Yeah, so the way you know they're coming from elsewhere is unlike solar system objects which\n\n20:35.960 --> 20:42.060\n travel on elliptical paths around the sun, these guys travel on hyperbolic paths.\n\n20:42.060 --> 20:45.200\n So they come in, say hello and then they're gone.\n\n20:45.200 --> 20:52.920\n And the fact that they exist is totally like not surprising, right?\n\n20:52.920 --> 20:59.960\n The Neptune is constantly ejecting Kuiper belt objects into interstellar space.\n\n20:59.960 --> 21:05.600\n Our solar system itself is sort of leaking icy debris and ejecting it.\n\n21:05.600 --> 21:11.920\n So presumably every planetary systems around other stars do exactly the same thing.\n\n21:11.920 --> 21:17.120\n Let me ask you about the millions of objects that are part of the Kuiper belt and part\n\n21:17.120 --> 21:18.120\n of the Oort cloud.\n\n21:18.120 --> 21:20.240\n Do you think some of them have primitive life?\n\n21:20.240 --> 21:25.480\n It kind of makes you sad if there's like primitive life there and they're just kind of like lonely\n\n21:25.480 --> 21:26.480\n out there in space.\n\n21:26.480 --> 21:27.480\n Yeah.\n\n21:27.480 --> 21:30.160\n Like how many of them do you think have life, like bacterial life?\n\n21:30.160 --> 21:32.000\n Probably a negligible amount.\n\n21:32.000 --> 21:35.160\n Zero with like a plus on top.\n\n21:35.160 --> 21:36.160\n Right.\n\n21:36.160 --> 21:37.160\n Zero plus plus.\n\n21:37.160 --> 21:38.160\n Yeah.\n\n21:38.160 --> 21:46.000\n So, you know, if you and I took a little trip to the interstellar medium, I think we would\n\n21:46.000 --> 21:49.560\n develop cancer and die real fast, right?\n\n21:49.560 --> 21:50.560\n That's rough.\n\n21:50.560 --> 21:51.560\n Yeah.\n\n21:51.560 --> 21:54.920\n It's a pretty hostile radiation environment.\n\n21:54.920 --> 21:56.600\n You don't actually have to go to the interstellar medium.\n\n21:56.600 --> 22:00.240\n You just have to leave the earth's magnetic field too.\n\n22:00.240 --> 22:03.480\n And then you're not doing so well suddenly.\n\n22:03.480 --> 22:12.720\n So you know, this idea of, you know, life kind of traveling between places, it's not\n\n22:12.720 --> 22:18.480\n entirely implausible, but you really have to twist, I think, a lot of parameters.\n\n22:18.480 --> 22:22.800\n One of the problems we have is we don't actually know how life originates, right?\n\n22:22.800 --> 22:29.520\n So it's kind of a second order question of survival in the interstellar medium and how\n\n22:29.520 --> 22:37.880\n resilient it is because we think you require water, but, and that's certainly the case\n\n22:37.880 --> 22:43.080\n for the earth, but you know, we really don't know for sure.\n\n22:43.080 --> 22:49.160\n That said, I will argue that the question of like, are there aliens out there is a very\n\n22:49.160 --> 22:53.520\n boring question because the answer is, of course there are.\n\n22:53.520 --> 23:02.800\n I mean, like we know that there are planets around almost every star.\n\n23:02.800 --> 23:05.400\n Of course there are other life forms.\n\n23:05.400 --> 23:11.280\n Life is not some specific thing that happened on the earth and that's it, right?\n\n23:11.280 --> 23:12.760\n That's a statistical impossibility.\n\n23:12.760 --> 23:13.760\n Yeah.\n\n23:13.760 --> 23:19.240\n Yeah, but the difficult question is before even the fact that we don't know how life\n\n23:19.240 --> 23:25.240\n originates, I don't think we even know what life is like definitionally, like formalizing\n\n23:25.240 --> 23:32.440\n a kind of picture of, in terms of the mechanism we would use to search for life out there\n\n23:32.440 --> 23:36.520\n or even when we're on a planet to say, is this life?\n\n23:36.520 --> 23:42.480\n Is this rock that just moved from where it was yesterday life or maybe not even a rock,\n\n23:42.480 --> 23:43.480\n something else?\n\n23:43.480 --> 23:46.920\n I got to tell you, I want to know what life is, okay?\n\n23:46.920 --> 23:51.800\n And I want you to show me.\n\n23:51.800 --> 23:57.280\n I think there's a song to basically accompany every single thing we talk about today and\n\n23:57.280 --> 24:02.360\n probably half of them are love songs and somehow we'll integrate George Michael into the whole\n\n24:02.360 --> 24:03.360\n thing.\n\n24:03.360 --> 24:04.360\n Okay.\n\n24:04.360 --> 24:08.100\n So your intuition is there's life everywhere in our universe.\n\n24:08.100 --> 24:10.520\n Do you think there's intelligent life out there?\n\n24:10.520 --> 24:11.960\n I think it's entirely plausible.\n\n24:11.960 --> 24:17.280\n I mean, it's entirely plausible.\n\n24:17.280 --> 24:23.640\n I think there's intelligent life on earth and so yeah, taking that, like say whatever\n\n24:23.640 --> 24:29.920\n this thing we got on earth, whether it's dolphins or humans, say that's intelligent.\n\n24:29.920 --> 24:30.920\n Definitely dolphins.\n\n24:30.920 --> 24:34.160\n I mean, have you seen the dolphins?\n\n24:34.160 --> 24:37.020\n Well, they do some cruel stuff to each other.\n\n24:37.020 --> 24:43.440\n So if cruelty is a definition of intelligence, they're pretty good and then humans are pretty\n\n24:43.440 --> 24:44.440\n good in that regard.\n\n24:44.440 --> 24:48.920\n And then there's like pigs are very intelligent.\n\n24:48.920 --> 24:54.120\n I got actually a chance to hang out with pigs recently and they're, aside from the fact\n\n24:54.120 --> 25:01.840\n they were trying to eat me, they love food, they love food, but there's an intelligence\n\n25:01.840 --> 25:09.200\n to their eyes that was kind of like haunts me because I also love to eat meat and then\n\n25:09.200 --> 25:15.920\n to meet the thing I later ate and that was very intelligent and almost charismatic with\n\n25:15.920 --> 25:21.480\n the way he was expressing himself, herself, itself was quite incredible.\n\n25:21.480 --> 25:28.080\n So all that to say is if we have intelligent life here on earth, if you take dolphins,\n\n25:28.080 --> 25:33.400\n pigs, humans, from the perspective of like planetary science, how unique is earth?\n\n25:33.400 --> 25:34.400\n Okay.\n\n25:34.400 --> 25:41.600\n So earth is not a common outcome of the planet formation process.\n\n25:41.600 --> 25:48.400\n It's probably a something on the order of maybe a 1% effect.\n\n25:48.400 --> 25:53.200\n And by earth, I mean not just an earth mass planet, okay?\n\n25:53.200 --> 26:00.440\n I mean the architecture of the solar system that allows the earth to exist in its kind\n\n26:00.440 --> 26:06.300\n of very temperate way.\n\n26:06.300 --> 26:13.440\n One thing to understand and this is pretty crucial, right, is that the earth itself formed\n\n26:13.440 --> 26:23.160\n well after the gas disk that formed the giant planets had already dissipated.\n\n26:23.160 --> 26:28.720\n You see stars start out with, you know, the star and then a disk of gas and dust that\n\n26:28.720 --> 26:30.800\n encircles it, okay?\n\n26:30.800 --> 26:36.300\n From this disk of gas and dust, big planets can emerge.\n\n26:36.300 --> 26:43.640\n And we have over the last two, three decades discovered thousands of extra solar planets\n\n26:43.640 --> 26:45.140\n as an orbit or other stars.\n\n26:45.140 --> 26:53.000\n What we see is that many of them have these expansive hydrogen helium atmospheres.\n\n26:53.000 --> 26:59.840\n The fact that the earth doesn't is deeply connected to the fact that earth took about\n\n26:59.840 --> 27:01.600\n 100 million years to form.\n\n27:01.600 --> 27:08.040\n So we missed that, you know, train, so to speak, to get that hydrogen helium atmosphere.\n\n27:08.040 --> 27:10.560\n That's why actually we can see the sky, right?\n\n27:10.560 --> 27:17.440\n That's why the sky is, well, at least in most places, that's why the atmosphere is not completely\n\n27:17.440 --> 27:20.680\n opaque.\n\n27:20.680 --> 27:26.880\n With that, you know, kind of thinking in mind, I would argue that we're getting the kind\n\n27:26.880 --> 27:33.360\n of emergent pictures that the earth is not, you know, everywhere, right?\n\n27:33.360 --> 27:37.360\n There's sort of the sci fi view of things where we go to some other star and we just\n\n27:37.360 --> 27:40.400\n land on random planets and they're all earth like.\n\n27:40.400 --> 27:42.000\n That's totally not true.\n\n27:42.000 --> 27:49.120\n But even a low probability event, even if you imagine that earth is a one in a million\n\n27:49.120 --> 27:58.520\n or one in 10 million occurrence, there are 10 to the 12 stars in the galaxy, right?\n\n27:58.520 --> 28:03.440\n So you just, you always win by, that's right, by supply.\n\n28:03.440 --> 28:04.440\n They save you.\n\n28:04.440 --> 28:10.080\n Well, you've hypothesized that our solar system once possessed a population of short period\n\n28:10.080 --> 28:17.640\n planets that were destroyed by the evil Jupiter migrating through the solar nebula.\n\n28:17.640 --> 28:18.640\n Can you explain?\n\n28:18.640 --> 28:22.840\n Well, if I was to say what was the kind of the key outcome of searches for extra solar\n\n28:22.840 --> 28:30.440\n planets, it is that most stars are encircled by short period planets that are, you know,\n\n28:30.440 --> 28:33.180\n a few earth masses, right?\n\n28:33.180 --> 28:39.080\n So a few times bigger than the earth and have orbital periods that kind of range from days\n\n28:39.080 --> 28:42.200\n to weeks.\n\n28:42.200 --> 28:48.680\n Now if you go and ask the solar system what's in our region, right, in that region, it's\n\n28:48.680 --> 28:50.720\n completely empty, right?\n\n28:50.720 --> 28:53.960\n It's just, it's astonishingly hollow.\n\n28:53.960 --> 29:00.560\n And think, you know, from the sun is not some, you know, special star that decided that it\n\n29:00.560 --> 29:03.160\n was going to form the solar system.\n\n29:03.160 --> 29:09.160\n So I think, you know, the natural thing to assume is that the same processes of planet\n\n29:09.160 --> 29:15.080\n formation that occurred everywhere else also occurred in the solar system.\n\n29:15.080 --> 29:20.080\n Following this logic, it's not implausible to imagine that the solar system once possessed\n\n29:20.080 --> 29:28.520\n a system of intra Mercurian, like, you know, compact system of planets.\n\n29:28.520 --> 29:33.640\n So then we asked ourselves, would such a system survive to this day?\n\n29:33.640 --> 29:40.120\n And the answer is no, at least our calculations suggested it's highly unlikely because of\n\n29:40.120 --> 29:41.760\n the formation of Jupiter.\n\n29:41.760 --> 29:46.080\n And Jupiter's primordial kind of wandering through the solar system would have sent this\n\n29:46.080 --> 29:51.680\n collisional field of debris that would have pushed that system of planets onto the sun.\n\n29:51.680 --> 29:56.440\n So was Jupiter, this primordial wandering, what did Jupiter look like?\n\n29:56.440 --> 29:58.120\n Like, why was it wandering?\n\n29:58.120 --> 30:00.740\n It didn't have the orbit it has today?\n\n30:00.740 --> 30:05.080\n We're pretty certain that giant planets like Jupiter, when they form, they migrate.\n\n30:05.080 --> 30:11.680\n The reason they migrate is, you know, on a detailed level, perhaps difficult to explain,\n\n30:11.680 --> 30:19.440\n but just in a qualitative sense, they form in this fluid disk of gas and dust.\n\n30:19.440 --> 30:27.000\n So it's kind of like, okay, if I plop down a raft somewhere in the ocean, will it stay\n\n30:27.000 --> 30:30.400\n where you plop it down or will it kind of get carried around?\n\n30:30.400 --> 30:34.880\n It's not really a good analogy because it's not like Jupiter is being advected by the\n\n30:34.880 --> 30:44.640\n currents of gas and dust, but the way it migrates is it carves out a hole in the disk and then\n\n30:44.640 --> 30:50.040\n by interacting with the disk gravitationally, it can change its orbit.\n\n30:50.040 --> 30:56.400\n The fact that the solar system has both Jupiter and Saturn here complicates things a lot because\n\n30:56.400 --> 31:02.100\n you have to solve the problem of the evolution of the gas disk, the evolution of Jupiter's\n\n31:02.100 --> 31:08.920\n orbit in the gas disk, plus evolution of Saturn's and their mutual interaction.\n\n31:08.920 --> 31:15.800\n The common outcome of solving that problem, though, is pretty easy to explain.\n\n31:15.800 --> 31:22.080\n Jupiter forms, its orbit shrinks, and then once Saturn forms, its orbit catches up basically\n\n31:22.080 --> 31:24.880\n to the orbit of Jupiter and then both come out.\n\n31:24.880 --> 31:30.840\n So there's this inward outward pattern of Jupiter's early motion that happens sort of\n\n31:30.840 --> 31:36.820\n within the last million years of the lifetime of the solar system's primordial disk.\n\n31:36.820 --> 31:44.260\n So while this is happening, if our calculations are correct, which I think they are, you can\n\n31:44.260 --> 31:51.900\n destroy this inner system of, you know, few Earth mass planets.\n\n31:51.900 --> 31:58.720\n And then in the aftermath of all this violence, you form the terrestrial planets.\n\n31:58.720 --> 32:00.500\n Where would they come from in that case?\n\n32:00.500 --> 32:05.640\n So Jupiter clears out the space, and then there's a few terrestrial planets that come\n\n32:05.640 --> 32:12.440\n in and those come in from the disk somewhere, like one of the larger objects?\n\n32:12.440 --> 32:18.920\n What actually happens in these calculations, you leave behind a rather mass depleted, like\n\n32:18.920 --> 32:23.480\n remnant disk, only a couple Earth masses.\n\n32:23.480 --> 32:33.000\n So then from that remnant population, annulus of material, over a hundred million years,\n\n32:33.000 --> 32:37.240\n by just collisions, you grow the Earth and the Moon and everything else.\n\n32:37.240 --> 32:38.240\n You said annulus?\n\n32:38.240 --> 32:39.240\n Annulus.\n\n32:39.240 --> 32:40.240\n Annulus.\n\n32:40.240 --> 32:41.240\n Annulus, yeah.\n\n32:41.240 --> 32:42.240\n That's a beautiful word.\n\n32:42.240 --> 32:43.240\n What does that mean?\n\n32:43.240 --> 32:45.240\n Well, it's like a disk that's kind of thin.\n\n32:45.240 --> 32:50.800\n It's like a, yeah, it's something that is, you know, a disk that's so thin it's almost\n\n32:50.800 --> 32:53.560\n flirting with being a ring.\n\n32:53.560 --> 32:57.280\n Like I was going to say, this reminds me of Lord of the Rings, so like this, the word\n\n32:57.280 --> 33:00.160\n just feels like it belongs in a token though.\n\n33:00.160 --> 33:01.160\n Yeah.\n\n33:01.160 --> 33:02.160\n Okay.\n\n33:02.160 --> 33:03.160\n So that's incredible.\n\n33:03.160 --> 33:09.320\n And so that, in your senses, you said like 1%, that's a rare, the way Jupiter and Saturn\n\n33:09.320 --> 33:18.720\n danced and cleared out the short period debris and then changed the gravitational landscape.\n\n33:18.720 --> 33:20.340\n That's a pretty rare thing too.\n\n33:20.340 --> 33:21.340\n It's rare.\n\n33:21.340 --> 33:24.860\n And moreover, like you don't even have to go to our calculations.\n\n33:24.860 --> 33:31.200\n You can just ask the night sky, how many stars have Jupiter and Saturn analogs?\n\n33:31.200 --> 33:36.980\n The answer is Jupiter and Saturn analogs are found around only 10% of Sun like stars.\n\n33:36.980 --> 33:43.060\n They themselves, like you kind of have to score an A minus or better on the planet formation\n\n33:43.060 --> 33:48.780\n test to become a solar system analog, even in that basic sense.\n\n33:48.780 --> 33:56.560\n And moreover, you know, lower mass stars, which are very numerous in the galaxy, so\n\n33:56.560 --> 34:03.620\n called M dwarfs, think like 0% of them, well, maybe like a negligible fraction of them have\n\n34:03.620 --> 34:05.440\n giant planets.\n\n34:05.440 --> 34:11.280\n Giant planets are a rare, you know, outcome of planet formation.\n\n34:11.280 --> 34:15.040\n One of the really big problems that remain unanswered is why.\n\n34:15.040 --> 34:18.480\n We don't actually understand why they're so rare.\n\n34:18.480 --> 34:22.440\n How hard is it to simulate all of the things that we've been talking about, each of the\n\n34:22.440 --> 34:27.440\n things we've been talking about, and maybe one day, all of the things we've been talking\n\n34:27.440 --> 34:28.920\n about and beyond.\n\n34:28.920 --> 34:36.960\n I mean, like from the initial primordial solar system, you know, a bunch of disks with, I\n\n34:36.960 --> 34:42.060\n don't know, billions, trillions of objects in them, like simulate that such that you\n\n34:42.060 --> 34:47.160\n eventually get a Jupiter and a Saturn, and then eventually you get the Jupiter and the\n\n34:47.160 --> 34:51.440\n Saturn that clear out a disk, change the gravitational landscape, then Earth pops up, like that whole\n\n34:51.440 --> 34:59.560\n thing, and then be able to do that for every other system in the, every other star in the\n\n34:59.560 --> 35:04.680\n galaxy, and then be able to do that for other galaxies as well.\n\n35:04.680 --> 35:07.440\n Yeah, so, look.\n\n35:07.440 --> 35:11.320\n Maybe start from the smallest simulation, like what is actually being done today.\n\n35:11.320 --> 35:14.520\n I mean, even the smallest simulation is probably super, super difficult.\n\n35:14.520 --> 35:18.320\n Even just like one object in the Kuiper belt is probably super difficult to simulate.\n\n35:18.320 --> 35:20.360\n I mean, I think it's super easy.\n\n35:20.360 --> 35:23.720\n I mean, like, it's just not that hard.\n\n35:23.720 --> 35:29.680\n But you know, let's ask the most kind of basic problem, okay?\n\n35:29.680 --> 35:36.240\n So the problem of having a star and something in orbit of it, that you don't need a simulation\n\n35:36.240 --> 35:39.440\n for, like you can just write that down on a piece of paper.\n\n35:39.440 --> 35:47.720\n There's gravity, like yeah, I guess it's important to try to, you know, one way to simulate objects\n\n35:47.720 --> 35:50.520\n in our solar system is to build the universe from scratch.\n\n35:50.520 --> 35:54.240\n Okay, we'll get to building the universe from scratch in a sec.\n\n35:54.240 --> 35:58.560\n But let me just kind of go through the hierarchy of what, you know, what we do.\n\n35:58.560 --> 35:59.560\n Two objects.\n\n35:59.560 --> 36:05.720\n Two objects, analytically solvable, like we can figure it out very easily if you just,\n\n36:05.720 --> 36:08.720\n I don't think you, yeah, you don't need to know calculus.\n\n36:08.720 --> 36:13.660\n It helps to know calculus, but you don't necessarily need to know calculus.\n\n36:13.660 --> 36:18.820\n Three objects that are gravitationally interacting, the solution is chaotic.\n\n36:18.820 --> 36:25.280\n Doesn't matter how many simulations you do, the answer loses meaning after some time.\n\n36:25.280 --> 36:30.320\n I feel like that is a metaphor for dating as well, but go on.\n\n36:30.320 --> 36:39.120\n Now look, yeah, so the fact that you go from analytically solvable to unpredictable, you\n\n36:39.120 --> 36:46.200\n know, when your simulation goes from two bodies to three bodies should immediately tell you\n\n36:46.200 --> 36:53.400\n that the exercise of trying to engineer a calculation where you form the entire solar\n\n36:53.400 --> 37:00.440\n system from scratch and hope to have some predictive answer is a futile one, right?\n\n37:00.440 --> 37:03.520\n We will never succeed at such a simulation.\n\n37:03.520 --> 37:09.240\n I feel like, just to clarify, you mean like explicitly having a clear equation that generalizes\n\n37:09.240 --> 37:13.400\n the whole process enough to be able to make a prediction, or do you mean actually like\n\n37:13.400 --> 37:18.820\n literally simulating the objects is a hopeless pursuit once it goes beyond three?\n\n37:18.820 --> 37:26.540\n The simulating them is not a hopeless pursuit, but the outcome becomes a statistical one.\n\n37:26.540 --> 37:34.400\n What's actually quite interesting is I think we have all the equations figured out, right?\n\n37:34.400 --> 37:39.680\n You know, in order to really understand this, the formation of the solar system, it suffices\n\n37:39.680 --> 37:47.240\n to know gravity and magnetohydrodynamics, I mean, like a combination of Maxwell's equations\n\n37:47.240 --> 37:50.560\n and Navier Stokes equations for the fluids.\n\n37:50.560 --> 37:54.800\n You need to know quantum mechanics to understand the capacities and so on.\n\n37:54.800 --> 37:59.220\n But we have those equations in hand.\n\n37:59.220 --> 38:05.240\n It's not that we don't have that understanding, it's that putting it all together is A, very,\n\n38:05.240 --> 38:13.660\n very difficult, and B, if you were to run the same evolution twice, changing, you know,\n\n38:13.660 --> 38:19.240\n the initial conditions by some infinitesimal amount, some, you know, minor change in your\n\n38:19.240 --> 38:23.240\n calculation to start with, you would get a different answer.\n\n38:23.240 --> 38:29.720\n This is one, this is part of the reason why planetary systems are so diverse.\n\n38:29.720 --> 38:36.740\n You don't have like a, you know, very predictive path for you start with a disk of this mass\n\n38:36.740 --> 38:42.400\n and it's around this star, therefore you're going to form the solar system, right?\n\n38:42.400 --> 38:47.620\n You start with this and therefore you will conform this huge outcome, huge set of outcomes,\n\n38:47.620 --> 38:50.720\n and some percentage of it will resemble the solar system.\n\n38:50.720 --> 38:57.600\n You mentioned quantum mechanics and we're talking about cosmic scale objects.\n\n38:57.600 --> 39:02.680\n You've talked about that the evolution of astrophysical disks can be modeled with Schrodinger's\n\n39:02.680 --> 39:03.680\n equation.\n\n39:03.680 --> 39:04.680\n I sure did.\n\n39:04.680 --> 39:05.680\n Why?\n\n39:05.680 --> 39:14.520\n Like, how does quantum mechanics become relevant when you consider the evolution of objects\n\n39:14.520 --> 39:15.520\n in the solar system?\n\n39:15.520 --> 39:16.520\n Yeah.\n\n39:16.520 --> 39:22.680\n Well, let me take a step back and just say, like, I remember being, you know, utterly\n\n39:22.680 --> 39:26.880\n confused by quantum mechanics when I first learned it.\n\n39:26.880 --> 39:32.680\n And the Schrodinger equation, which is kind of the parent equation of that whole field,\n\n39:32.680 --> 39:35.400\n you know, seems to come out of nowhere, right?\n\n39:35.400 --> 39:40.800\n The way that I was sort of explaining it, I remember asking, you know, my professor\n\n39:40.800 --> 39:42.840\n is like, but where does it come from?\n\n39:42.840 --> 39:47.520\n And I'm like, well, it's just like, don't worry about it and just like calculate the\n\n39:47.520 --> 39:50.280\n hydrogen, you know, energy levels, right?\n\n39:50.280 --> 39:52.320\n So it's like I could do all the problems.\n\n39:52.320 --> 39:58.680\n I just did not have any intuition for where this parent, you know, super important equation\n\n39:58.680 --> 39:59.680\n came from.\n\n39:59.680 --> 40:04.360\n Now, down the line, I was, remember, I was preparing for my own lecture and I was trying\n\n40:04.360 --> 40:09.960\n to understand how waves travel in self gravitating disks.\n\n40:09.960 --> 40:17.320\n So you know, again, there's a very broad theory that's already developed, but I was looking\n\n40:17.320 --> 40:22.760\n for some simpler way to explain it really for the purposes of teaching class.\n\n40:22.760 --> 40:30.520\n And so I thought, okay, what if I just imagine a disk as an infinite number of concentric\n\n40:30.520 --> 40:31.520\n circles, right?\n\n40:31.520 --> 40:36.480\n That interact with each other gravitationally.\n\n40:36.480 --> 40:44.560\n That's a problem in some sense that I can solve using methods from like the late 1700s.\n\n40:44.560 --> 40:49.440\n I can write down Hamiltonian, well, I can write down the energy function basically of\n\n40:49.440 --> 40:51.840\n their interactions.\n\n40:51.840 --> 40:59.500\n And what I found is that when you take the continuum limit, when you go from discrete\n\n40:59.500 --> 41:07.920\n circles that are talking to each other gravitationally to a continuum disk, suddenly this gravitational\n\n41:07.920 --> 41:10.760\n interaction among them, right?\n\n41:10.760 --> 41:14.200\n The governing equation becomes the Schrodinger equation.\n\n41:14.200 --> 41:15.800\n I had to think about that for a little bit.\n\n41:15.800 --> 41:19.560\n Did you just unify quantum mechanics and gravity?\n\n41:19.560 --> 41:25.720\n No, this is not the same thing as like, you know, fusing relativity and quantum mechanics.\n\n41:25.720 --> 41:29.520\n But it did get me thinking a little bit.\n\n41:29.520 --> 41:37.920\n So the fact that waves in astrophysical disks behave just like wave functions of particles\n\n41:37.920 --> 41:43.520\n is kind of like an interesting analogy because for me it's easier to imagine waves traveling\n\n41:43.520 --> 41:48.480\n through, you know, astrophysical disks or really just sheets of paper.\n\n41:48.480 --> 41:55.320\n And the reason this is, that analogy exists is because there's actually nothing quantum\n\n41:55.320 --> 41:57.280\n about the Schrodinger equation.\n\n41:57.280 --> 42:04.320\n The Schrodinger equation is just a wave equation and all of the interpretation that comes from\n\n42:04.320 --> 42:11.000\n it is quantum, but the equation itself is not a quantum being.\n\n42:11.000 --> 42:14.320\n So you can use it to model waves.\n\n42:14.320 --> 42:15.320\n It's not turtles.\n\n42:15.320 --> 42:16.320\n It's waves all the way down.\n\n42:16.320 --> 42:19.000\n You can pick which level you pick the wave at.\n\n42:19.000 --> 42:22.160\n So it could be at the solar system level that you can use it.\n\n42:22.160 --> 42:28.800\n And also it actually provides a pretty neat calculational tool because it's difficult.\n\n42:28.800 --> 42:34.160\n So we just talked about simulations, but it's difficult to simulate the behavior of astrophysical\n\n42:34.160 --> 42:42.360\n disks on timescales that are in between a few orbits and their entire evolution.\n\n42:42.360 --> 42:48.320\n So it's over a timescale of a few orbits, you have, you do a hydrodynamic, you know,\n\n42:48.320 --> 42:49.320\n simulation, right?\n\n42:49.320 --> 42:55.120\n You do that, basically that's something that you can do on a modern computer on a timescale\n\n42:55.120 --> 42:56.700\n of say a week.\n\n42:56.700 --> 43:01.400\n When it comes to their evolution over their entire lifetime, you don't hope to resolve\n\n43:01.400 --> 43:02.400\n the orbits.\n\n43:02.400 --> 43:07.200\n You just kind of hope to understand how the system behaves in between, right?\n\n43:07.200 --> 43:11.540\n To get access to that, as it turns out, it's pretty, it's pretty cute.\n\n43:11.540 --> 43:16.860\n You can use, you can use the Schrodinger equation to get the answer rapidly, so it's a calculational\n\n43:16.860 --> 43:17.860\n tool.\n\n43:17.860 --> 43:18.860\n That's fascinating.\n\n43:18.860 --> 43:22.440\n So astrophysical disks, how, what are they?\n\n43:22.440 --> 43:23.680\n How broad is this definition?\n\n43:23.680 --> 43:24.680\n Okay.\n\n43:24.680 --> 43:31.280\n So astrophysical disks span a huge, huge amount of ranges.\n\n43:31.280 --> 43:33.800\n They start maybe at the smallest scale.\n\n43:33.800 --> 43:35.840\n They start with actually Kuiper belt objects.\n\n43:35.840 --> 43:38.620\n Some Kuiper belt objects have rings.\n\n43:38.620 --> 43:42.200\n So that's maybe the smallest example of an astrophysical disk.\n\n43:42.200 --> 43:47.520\n You've got this little potato shaped asteroid, you know, which is, you know, sort of the\n\n43:47.520 --> 43:53.360\n size of LA or something, and around it are some rings of icy matter.\n\n43:53.360 --> 43:57.040\n That object is a small astrophysical disk.\n\n43:57.040 --> 43:59.820\n Then you have Saturn, the rings of Saturn.\n\n43:59.820 --> 44:03.960\n You have the next set of scale, you have the solar system itself when it was forming, you\n\n44:03.960 --> 44:04.960\n have a disk.\n\n44:04.960 --> 44:07.540\n Then you have black hole disks.\n\n44:07.540 --> 44:09.840\n You have galaxies.\n\n44:09.840 --> 44:12.280\n Disks are super common in the universe.\n\n44:12.280 --> 44:15.680\n The reason is that stuff rotates, right?\n\n44:15.680 --> 44:16.680\n I mean, that's...\n\n44:16.680 --> 44:17.680\n Yeah.\n\n44:17.680 --> 44:24.320\n So, and those rings could be the material that composes those rings could be, it could\n\n44:24.320 --> 44:27.240\n be gas, it could be solid, it could be anything.\n\n44:27.240 --> 44:28.240\n That's right.\n\n44:28.240 --> 44:35.400\n So, the disk that made from which the planets emerged was predominantly hydrogen, helium,\n\n44:35.400 --> 44:36.400\n gas.\n\n44:36.400 --> 44:41.420\n On the other hand, the rings of Saturn are made up of, you know, icicle, ice, little\n\n44:41.420 --> 44:47.200\n like ice cubes this big, about a centimeter across.\n\n44:47.200 --> 44:48.200\n Sounds refreshing.\n\n44:48.200 --> 44:49.200\n So, that's incredible.\n\n44:49.200 --> 44:50.720\n Hydrogen, helium, gas.\n\n44:50.720 --> 44:55.980\n So, in the beginning, it was just hydrogen and helium around the sun.\n\n44:55.980 --> 45:01.760\n How does that lead to the first formations of solid objects in terms of simulation?\n\n45:01.760 --> 45:02.760\n Okay.\n\n45:02.760 --> 45:03.760\n Here's the story.\n\n45:03.760 --> 45:06.760\n So, you're like, have you ever been to the desert?\n\n45:06.760 --> 45:07.760\n Yes.\n\n45:07.760 --> 45:12.240\n I've been to the Death Valley and actually it was terrifying, just a total tangent, I'm\n\n45:12.240 --> 45:13.240\n distracting you.\n\n45:13.240 --> 45:14.240\n No.\n\n45:14.240 --> 45:19.360\n But I was driving through it and I was really surprised because it was, at first, hot.\n\n45:19.360 --> 45:23.920\n And then as it was getting into the evening, there's this huge thunderstorm, like it was\n\n45:23.920 --> 45:25.800\n raining and it got freezing cold.\n\n45:25.800 --> 45:26.800\n I'm like, what the hell?\n\n45:26.800 --> 45:27.800\n It was the apocalypse.\n\n45:27.800 --> 45:28.800\n Yes.\n\n45:28.800 --> 45:33.420\n I had to like just sit there listening to Bruce Springsteen, I remember, and just thinking,\n\n45:33.420 --> 45:37.720\n I'm probably going to die and I was okay with it because Bruce Springsteen was on the radio.\n\n45:37.720 --> 45:42.000\n But look, when you've got the boss, you're ready to meet the boss.\n\n45:42.000 --> 45:43.000\n Yeah.\n\n45:43.000 --> 45:44.000\n So, look, I mean.\n\n45:44.000 --> 45:45.000\n That's a good line.\n\n45:45.000 --> 45:46.000\n Anyway, sorry.\n\n45:46.000 --> 45:47.000\n That does, yes.\n\n45:47.000 --> 45:48.000\n It's true.\n\n45:48.000 --> 45:49.000\n Yeah.\n\n45:49.000 --> 45:57.800\n By the way, to continue on this tangent, I absolutely love the Southwest for this reason.\n\n45:57.800 --> 46:02.400\n During the pandemic, I drove from LA to New Mexico a bunch of times.\n\n46:02.400 --> 46:03.640\n The madness of weather?\n\n46:03.640 --> 46:04.640\n Yeah.\n\n46:04.640 --> 46:05.640\n The chaos.\n\n46:05.640 --> 46:09.800\n The madness of weather, the fact that it will be blazing hot one minute and then it's just\n\n46:09.800 --> 46:15.680\n like, we'll decide to have a little thunderstorm, maybe we'll decide to go back momentarily\n\n46:15.680 --> 46:19.200\n to like a thousand degrees and then go back to the thunderstorm.\n\n46:19.200 --> 46:20.200\n It's amazing.\n\n46:20.200 --> 46:23.560\n It's that, by the way, is chaos theory in action.\n\n46:23.560 --> 46:24.560\n Right.\n\n46:24.560 --> 46:26.800\n But let's get back to talking about the desert.\n\n46:26.800 --> 46:33.880\n So, in the desert, tumbleweeds have a tendency to roll because the wind rolls them.\n\n46:33.880 --> 46:38.600\n And if you're careful, you'll occasionally see this family of tumbleweeds where there's\n\n46:38.600 --> 46:44.800\n like a big one and then a bunch of little ones that kind of hide in its wake and are\n\n46:44.800 --> 46:51.440\n all rolling together and almost looks like a family of ducks crossing the street or something.\n\n46:51.440 --> 46:58.320\n Or for example, if you watch Tour de France, you've got a whole bunch of cyclists and they're\n\n46:58.320 --> 47:01.900\n like cycling within 10 centimeters of each other.\n\n47:01.900 --> 47:03.960\n They're not BFFs, right?\n\n47:03.960 --> 47:07.380\n They're not trying to be, trying to ride together.\n\n47:07.380 --> 47:16.360\n They are riding together to minimize the collective air resistance, if you will, that they experience.\n\n47:16.360 --> 47:21.960\n Turns out solids in the protoplanetary disk do just this.\n\n47:21.960 --> 47:30.040\n There's an instability wherein solid particles, things that are a centimeter across will start\n\n47:30.040 --> 47:33.800\n to hide behind one another and form these clouds.\n\n47:33.800 --> 47:34.920\n Why?\n\n47:34.920 --> 47:42.180\n Because cumulatively, that minimizes the solid component of this aerodynamic interaction\n\n47:42.180 --> 47:43.180\n with the gas.\n\n47:43.180 --> 47:49.560\n Now, these clouds, because they're kind of a favorable energetic condition for the dust\n\n47:49.560 --> 47:54.980\n to live in, they grow, grow, grow, grow, grow until they become so massive that they collapse\n\n47:54.980 --> 47:56.860\n under their own weight.\n\n47:56.860 --> 47:59.680\n That's how the first building blocks of planets form.\n\n47:59.680 --> 48:02.520\n That's how the big asteroids got there.\n\n48:02.520 --> 48:03.520\n That's incredible.\n\n48:03.520 --> 48:04.520\n Yeah.\n\n48:04.520 --> 48:06.880\n So that, is that simulatable or is it not useful to simulate?\n\n48:06.880 --> 48:09.500\n No, no, that's simulatable.\n\n48:09.500 --> 48:12.520\n And people do these types of calculations.\n\n48:12.520 --> 48:13.680\n It's really cool.\n\n48:13.680 --> 48:18.800\n That's actually, that's one of the many fields of planet formation theory that is really,\n\n48:18.800 --> 48:20.300\n really active right now.\n\n48:20.300 --> 48:24.640\n People are trying to understand all kinds of aspects of that process because of course\n\n48:24.640 --> 48:29.320\n I've explained it, you know, like as if there's one thing that happens.\n\n48:29.320 --> 48:37.820\n Turns out it's a beautifully rich dynamic, but qualitatively, formation of the first\n\n48:37.820 --> 48:42.580\n building blocks actually follows the same sequence as formation of stars, right?\n\n48:42.580 --> 48:50.600\n Stars are just clouds of gas, hydrogen, helium, gas that sit in space and slowly cool.\n\n48:50.600 --> 48:57.440\n And at some point they, you know, contract to a point where their gravity overtakes the\n\n48:57.440 --> 49:00.160\n thermal pressure support, if you will.\n\n49:00.160 --> 49:03.680\n And they collapse under their own weight and you get a little baby solar system.\n\n49:03.680 --> 49:04.680\n That's amazing.\n\n49:04.680 --> 49:11.780\n So do you think one day it will be possible to simulate the full history that took our\n\n49:11.780 --> 49:14.560\n solar system to what it is today?\n\n49:14.560 --> 49:15.880\n Yes.\n\n49:15.880 --> 49:16.880\n And it will be useless.\n\n49:16.880 --> 49:17.880\n Okay.\n\n49:17.880 --> 49:22.400\n So you don't think your story, many of the ideas that you have about Jupiter clear in\n\n49:22.400 --> 49:26.760\n the space, like retelling that story in high resolution is not that important.\n\n49:26.760 --> 49:36.280\n I actually think it's important, but at every stage you have to design your experiments,\n\n49:36.280 --> 49:44.420\n your numerical computer experiments so that they test some specific aspect of that evolution.\n\n49:44.420 --> 49:53.300\n I am not a proponent of doing huge simulations because even if we forget the information\n\n49:53.300 --> 50:00.280\n theory aspect of not being able to simulate in full detail the universe, because if you\n\n50:00.280 --> 50:05.260\n do, then you have made an actual universe.\n\n50:05.260 --> 50:07.920\n It's not the simulation, right?\n\n50:07.920 --> 50:10.480\n Simulation is in some sense a compression of information.\n\n50:10.480 --> 50:13.520\n So therefore you must lose detail.\n\n50:13.520 --> 50:22.280\n But that point aside, if we are able to simulate the entire history of the solar system in\n\n50:22.280 --> 50:28.920\n excruciating detail, I mean, it'll be cool, but it's not going to be any different from\n\n50:28.920 --> 50:31.820\n observing it, right?\n\n50:31.820 --> 50:38.840\n Because theoretical understanding, which is what ultimately I'm interested in, comes from\n\n50:38.840 --> 50:45.400\n taking complex things and reducing them down to something that, you know, some mechanism\n\n50:45.400 --> 50:49.060\n that you can actually quantify.\n\n50:49.060 --> 50:54.280\n That's the fun part of astrophysics, just kind of simulating things in extreme detail\n\n50:54.280 --> 51:02.240\n is we'll make cool visualizations, but that doesn't get you to any better understanding\n\n51:02.240 --> 51:04.800\n than you had before you did the simulation.\n\n51:04.800 --> 51:10.720\n So if you ask very specific questions, then you'll be able to create like very highly\n\n51:10.720 --> 51:15.560\n compressed, nice, beautiful theories about how things evolved, and then you can use those\n\n51:15.560 --> 51:21.200\n to then generalize to other solar systems, to other stars and other galaxies, and then\n\n51:21.200 --> 51:24.880\n say something generalizable about the entire universe.\n\n51:24.880 --> 51:31.240\n How difficult would it be to simulate our solar system such that we would not know the\n\n51:31.240 --> 51:32.240\n difference?\n\n51:32.240 --> 51:38.960\n Meaning, if we are living in a simulation, is there a nice, think of it as a video game,\n\n51:38.960 --> 51:43.720\n is there a nice compressible way of doing that, or just kind of like you intuited with\n\n51:43.720 --> 51:51.240\n a three body situation is just a giant mess that you cannot create a video game that will\n\n51:51.240 --> 51:56.960\n seem realistic without actually building your solar system from scratch?\n\n51:56.960 --> 52:04.760\n I'm speculating, but one of the, yeah, I know you have a deep understanding of this, but\n\n52:04.760 --> 52:11.960\n for me, I'm just going to speculate that for at least in the types of simulations that\n\n52:11.960 --> 52:19.120\n we can do today, inevitably, you run into the problem of resolution, right?\n\n52:19.120 --> 52:22.000\n Doesn't matter what you're doing, it is discrete.\n\n52:22.000 --> 52:28.240\n Now, the way you would go about asking, you know, what we're observing, is that a simulation\n\n52:28.240 --> 52:35.520\n or is that, you know, some real continuous thing, is you zoom in, right?\n\n52:35.520 --> 52:42.320\n You zoom in and try and find the, you know, the grid scale, if you will.\n\n52:42.320 --> 52:55.880\n Yeah, I mean, it's a really interesting question, and because the solar system itself and really,\n\n52:55.880 --> 52:59.200\n you know, the double pendulum is chaotic, right?\n\n52:59.200 --> 53:06.960\n From sitting on another pendulum, it moves unpredictably once you let them go.\n\n53:06.960 --> 53:12.520\n You really don't need to, like, inject any randomness into a simulation for it to give\n\n53:12.520 --> 53:16.200\n you stochastic and unpredictable answers.\n\n53:16.200 --> 53:18.540\n Weather is a great example of this.\n\n53:18.540 --> 53:23.680\n Weather has a lapen of time of, you know, typical weather systems have a lapen of time\n\n53:23.680 --> 53:25.040\n of a few days.\n\n53:25.040 --> 53:30.760\n And there's a fundamental reason why the force forecast always sucks, you know, two weeks\n\n53:30.760 --> 53:32.160\n in advance.\n\n53:32.160 --> 53:39.200\n It's not that we don't know the equations that govern the atmosphere, we know them well.\n\n53:39.200 --> 53:42.520\n Their solutions are meaningless, though, after a few days.\n\n53:42.520 --> 53:45.160\n The zooming in thing is very interesting.\n\n53:45.160 --> 53:51.640\n I think about this a lot, whether there'll be a time soon where we would want to stay\n\n53:51.640 --> 53:55.560\n in video game worlds, whether it's virtual reality or just playing video games.\n\n53:55.560 --> 54:01.560\n I mean, I think that time, like, came in, like, the 90s, and it's been that time.\n\n54:01.560 --> 54:05.040\n Well, it's not just came, I mean, it's accelerated.\n\n54:05.040 --> 54:12.080\n I just recently saw that WoW and Fortnite were played 140 billion hours, and those are\n\n54:12.080 --> 54:13.340\n just video games.\n\n54:13.340 --> 54:17.640\n And that's, like, increasing very, very quickly, especially with the people coming up now,\n\n54:17.640 --> 54:21.840\n being born now and become, you know, becoming teenagers and so on.\n\n54:21.840 --> 54:25.240\n Let's have a thought experiment where it's just you and a video game character inside\n\n54:25.240 --> 54:33.120\n a room, where you remove the simulation, they need to simulate sort of a lot of objects.\n\n54:33.120 --> 54:39.200\n If it's just you and that character, how far do you need to simulate in terms of zooming\n\n54:39.200 --> 54:43.920\n in for it to be very real to you, as real as reality?\n\n54:43.920 --> 54:48.680\n So like, first of all, you kind of mentioned zooming in, which is fascinating, because\n\n54:48.680 --> 54:53.440\n we have these tools of science that allow us to zoom in, quote unquote, in all kinds\n\n54:53.440 --> 54:57.260\n of ways in the world around us.\n\n54:57.260 --> 55:01.760\n But our cognitive abilities, like our perception system as humans, is very limited in terms\n\n55:01.760 --> 55:02.760\n of zooming in.\n\n55:02.760 --> 55:04.600\n So we might be very easily fooled.\n\n55:04.600 --> 55:11.680\n Some of the video games, like, on the PS4, like, look pretty real to me, right?\n\n55:11.680 --> 55:16.520\n I think, you know, you would really have to interrogate, I mean, I think even with what\n\n55:16.520 --> 55:22.680\n we have today, like, I don't know, Ace Combat 7 is a great example, right?\n\n55:22.680 --> 55:29.360\n Like, I mean, the way that the clouds are rendered, it's, I mean, it looks just like\n\n55:29.360 --> 55:34.120\n when you're flying, you know, on a real airplane, the kind of transparency.\n\n55:34.120 --> 55:41.680\n I think that the, you know, our perception is limited enough already to not be able to\n\n55:41.680 --> 55:46.400\n tell some of the, you know, some of the differences.\n\n55:46.400 --> 55:48.580\n There's a game called Skyrim.\n\n55:48.580 --> 55:51.640\n It's an Elder Scrolls role playing game.\n\n55:51.640 --> 55:55.240\n And I just, I played it for quite a bit.\n\n55:55.240 --> 55:58.640\n And I think I played it very different than others.\n\n55:58.640 --> 56:03.180\n Like, there'll be long stretches of time where I would just walk around and look at nature\n\n56:03.180 --> 56:04.180\n in the game.\n\n56:04.180 --> 56:05.180\n It's incredible.\n\n56:05.180 --> 56:06.320\n Oh, sure.\n\n56:06.320 --> 56:10.320\n It's just like the graphics is like, wow, I want to stay there.\n\n56:10.320 --> 56:11.320\n It was better.\n\n56:11.320 --> 56:12.320\n I went hiking recently.\n\n56:12.320 --> 56:14.880\n It was like as good as hiking.\n\n56:14.880 --> 56:16.240\n So look, I know what you mean.\n\n56:16.240 --> 56:21.480\n Not to go on a huge video game, you know, tangent, but like the third, like, Witcher\n\n56:21.480 --> 56:25.600\n game was astonishingly beautiful, right?\n\n56:25.600 --> 56:31.560\n Especially like playing on a good hardware machine, it's like, this is pretty, this is\n\n56:31.560 --> 56:32.820\n pretty legit.\n\n56:32.820 --> 56:40.560\n That said, um, you know, I, I don't resonate with the, I want to stay here, you know, like\n\n56:40.560 --> 56:47.840\n one of the things that I love to do is to go to my like boxing gym and, and box with\n\n56:47.840 --> 56:48.840\n a guy.\n\n56:48.840 --> 56:49.840\n Right.\n\n56:49.840 --> 56:54.080\n Like that's, there's, there's nothing quite like that physical, you know, experience.\n\n56:54.080 --> 56:55.080\n Like\n\n56:55.080 --> 56:56.080\n that's fascinating.\n\n56:56.080 --> 57:00.960\n That might be simply an artifact of the year you were born maybe because if you're born\n\n57:00.960 --> 57:07.720\n today, it almost seems like stupid to go to a gym, like you're going to a gym to box with\n\n57:07.720 --> 57:08.720\n a guy.\n\n57:08.720 --> 57:13.520\n Why not box with Mike Tyson when you yourself is like in his prime, when you yourself are\n\n57:13.520 --> 57:16.040\n also an incredible boxer in the video game world.\n\n57:16.040 --> 57:21.240\n For me, there, there's a multitude of reasons why I don't want to box with Mike Tyson.\n\n57:21.240 --> 57:22.240\n Right.\n\n57:22.240 --> 57:23.240\n No, no, no, no.\n\n57:23.240 --> 57:26.280\n I enjoy teeth, you know, and I want to have an ear.\n\n57:26.280 --> 57:31.440\n No, but your, your skills in this meat space, in this physical realm is very limited and\n\n57:31.440 --> 57:37.520\n takes a lot of work and you're, you're a musician, you're an incredible scientist.\n\n57:37.520 --> 57:42.040\n You only have so much time in the, in the day, but in the video game world, you can\n\n57:42.040 --> 57:47.080\n expand your capabilities and all kinds of dimensions that you can never have possibly\n\n57:47.080 --> 57:48.640\n have time in the physical world.\n\n57:48.640 --> 57:54.780\n And so that, it doesn't make sense like to, to be existing, to be working your ass off\n\n57:54.780 --> 58:01.480\n in the physical world when you can just be super successful in the video game world.\n\n58:01.480 --> 58:04.000\n But I still, you enjoy sucking and stuff.\n\n58:04.000 --> 58:06.320\n Yeah, I really struggling to get better.\n\n58:06.320 --> 58:07.320\n I sure do.\n\n58:07.320 --> 58:12.420\n I mean, I think like these days with music, music is a great example, right?\n\n58:12.420 --> 58:18.560\n We just started, you know, practicing live with my band again, you know, after not playing\n\n58:18.560 --> 58:22.680\n for a year and you know, it's just, it was terrible.\n\n58:22.680 --> 58:28.160\n Like it was just kind of a lot of the nuance, you know, a lot of the detail is just that\n\n58:28.160 --> 58:33.160\n detail that takes, you know, years of collective practice to develop.\n\n58:33.160 --> 58:39.560\n It's just lost, but it was just an incredible amount of fun, way more fun than all the like\n\n58:39.560 --> 58:44.680\n studio, you know, sitting around and playing that I did, you know, throughout the entire\n\n58:44.680 --> 58:45.680\n year.\n\n58:45.680 --> 58:50.560\n So I think there's something, there's something intangible or maybe, maybe tangible about\n\n58:50.560 --> 58:54.120\n being, being in person.\n\n58:54.120 --> 58:59.120\n I sure hope you're wrong and that, you know, we, that's not something that will get lost\n\n58:59.120 --> 59:06.200\n because I think there's like such a large part of the human condition is to hang out.\n\n59:06.200 --> 59:11.040\n If we were doing this interview on zoom, right?\n\n59:11.040 --> 59:15.480\n I mean, I'd already be, I'd already be bored out of my mind.\n\n59:15.480 --> 59:16.480\n Exactly.\n\n59:16.480 --> 59:18.280\n I mean, there's something to that.\n\n59:18.280 --> 59:22.440\n I mean, I'm almost playing devil's advocate, but at the same time, you know, I'm sure people\n\n59:22.440 --> 59:28.200\n talk about the same way at the beginning of the 20th century about horses, where they're,\n\n59:28.200 --> 59:34.320\n they are much more efficient, they're much easier to maintain than cars.\n\n59:34.320 --> 59:37.780\n It doesn't make sense to have, you know, all the ways that cars break down and there's\n\n59:37.780 --> 59:40.360\n not enough infrastructure in terms of roads for cars.\n\n59:40.360 --> 59:41.720\n It doesn't make any sense.\n\n59:41.720 --> 59:45.800\n Like horses and like nature, you could do the nature, like where, you know, you should\n\n59:45.800 --> 59:47.480\n be living more natural life.\n\n59:47.480 --> 59:48.480\n Horses are real.\n\n59:48.480 --> 59:51.600\n You don't want machines in your life that are going to pollute your mind and the minds\n\n59:51.600 --> 59:54.380\n of young people, but then eventually just cars took over.\n\n59:54.380 --> 1:00:00.880\n So in that same way, it just seems, going back to horses, I'm just, you know, well,\n\n1:00:00.880 --> 1:00:04.400\n you can be, you can play, what is it?\n\n1:00:04.400 --> 1:00:08.920\n Red dead, red dead redemption, redemption, and that you can ride horses in the video\n\n1:00:08.920 --> 1:00:09.920\n game world.\n\n1:00:09.920 --> 1:00:10.920\n That's true.\n\n1:00:10.920 --> 1:00:14.200\n So let me return us back to planet nine.\n\n1:00:14.200 --> 1:00:15.880\n Always a good place to come back to.\n\n1:00:15.880 --> 1:00:21.480\n So now that we did a big historical overview of our solar system, what is planet nine?\n\n1:00:21.480 --> 1:00:22.640\n Okay.\n\n1:00:22.640 --> 1:00:28.960\n Planet nine is a hypothetical object that orbits the solar system, right?\n\n1:00:28.960 --> 1:00:36.760\n On orbital period of about 10,000 years and an orbit, which is slightly tilted with respect\n\n1:00:36.760 --> 1:00:42.280\n to the plane of the solar system, slightly eccentric and the object itself we think is\n\n1:00:42.280 --> 1:00:46.520\n five times more massive than the earth.\n\n1:00:46.520 --> 1:00:53.640\n We have never seen planet nine in a telescope, but we have gravitational evidence for it.\n\n1:00:53.640 --> 1:00:58.160\n And so this is where all the stuff we've been talking about, this clustering ideas, maybe\n\n1:00:58.160 --> 1:01:02.080\n you can speak to the approximate location that we suspect.\n\n1:01:02.080 --> 1:01:07.160\n And also the question I wanted to ask is what are we supposed to be imagining here?\n\n1:01:07.160 --> 1:01:11.400\n Because you said there are certain objects in the Kuiper Belt that are kind of have a\n\n1:01:11.400 --> 1:01:16.320\n direction to them that they're all like flocking in some kind of way.\n\n1:01:16.320 --> 1:01:20.120\n So that's the sense that there's some kind of gravitational object, not changing their\n\n1:01:20.120 --> 1:01:25.720\n orbit, but kind of confining them, like grouping their orbits together.\n\n1:01:25.720 --> 1:01:31.040\n See, what would happen if planet nine were not there is these orbits that roughly share\n\n1:01:31.040 --> 1:01:35.480\n a common orientation, they would just disperse, right?\n\n1:01:35.480 --> 1:01:39.780\n They would just become as a mutually symmetric point everywhere.\n\n1:01:39.780 --> 1:01:47.640\n Planet nine's gravity makes it such that these objects stay in a state that's basically anti\n\n1:01:47.640 --> 1:01:55.640\n aligned with respect to the orbit of planet nine and sort of hang out there and kind of\n\n1:01:55.640 --> 1:01:58.700\n oscillate on a timescale of about a billion years.\n\n1:01:58.700 --> 1:02:03.420\n That's one of the lines of evidence for the existence of planet nine.\n\n1:02:03.420 --> 1:02:04.420\n There are others.\n\n1:02:04.420 --> 1:02:08.060\n That's the one that's easiest to maybe visualize just because it's fun to think about orbits\n\n1:02:08.060 --> 1:02:15.240\n that all point into the same direction, but I should, you know, emphasize that, for example,\n\n1:02:15.240 --> 1:02:20.820\n the existence of objects, again, Kuiper Belt objects that are heavily out of the plane\n\n1:02:20.820 --> 1:02:26.720\n of the solar system, things that are tilted by say 90 degrees, that's not, we don't expect\n\n1:02:26.720 --> 1:02:29.920\n that as an outcome of planet formation.\n\n1:02:29.920 --> 1:02:37.520\n Indeed, planet formation simulations have never produced such objects without some extrinsic\n\n1:02:37.520 --> 1:02:38.520\n gravitational force.\n\n1:02:38.520 --> 1:02:43.160\n Planet nine, on the other hand, generates them very readily, so that provides kind of\n\n1:02:43.160 --> 1:02:50.660\n an alternative, you know, population of small bodies in the solar system that also get produced\n\n1:02:50.660 --> 1:02:54.240\n by planet nine through an independent kind of gravitational effect.\n\n1:02:54.240 --> 1:03:02.840\n So they're kind of, there's basically five different things that planet nine does individually\n\n1:03:02.840 --> 1:03:08.500\n that are like kind of maybe a one sigma effect where you'd say, yeah, okay, if that's all\n\n1:03:08.500 --> 1:03:14.860\n it was, maybe it's not, no reason to jump up and down, but because it's a multitude\n\n1:03:14.860 --> 1:03:22.300\n of these puzzles that all are explained by one hypothesis, that's really the magnetism,\n\n1:03:22.300 --> 1:03:25.380\n the attraction of the planet nine model.\n\n1:03:25.380 --> 1:03:34.160\n So can you just clarify, so most orbit, most planets in the solar system orbit at approximately\n\n1:03:34.160 --> 1:03:35.660\n the same, so it's flat.\n\n1:03:35.660 --> 1:03:38.220\n Yeah, it's like one degree.\n\n1:03:38.220 --> 1:03:41.700\n The difference between them is about one degree.\n\n1:03:41.700 --> 1:03:46.540\n But nevertheless, if we looked at our solar system, it would look, and I could see every\n\n1:03:46.540 --> 1:03:49.140\n single object, it would look like a sphere.\n\n1:03:49.140 --> 1:03:54.900\n The inner part where the planets are would look like, you know, flat, right?\n\n1:03:54.900 --> 1:04:02.380\n The Kuiper belt and the asteroid belt have a larger, it gets fatter and fatter and fatter\n\n1:04:02.380 --> 1:04:03.800\n and becomes a sphere.\n\n1:04:03.800 --> 1:04:04.800\n That's right.\n\n1:04:04.800 --> 1:04:11.300\n And if you look at the very outside, it's polluted by this quasi spheroidal thing.\n\n1:04:11.300 --> 1:04:14.660\n Nobody's of course ever seen the Oort cloud, right?\n\n1:04:14.660 --> 1:04:20.180\n We've only seen comments that come from the Oort cloud so that the Oort cloud, which is\n\n1:04:20.180 --> 1:04:26.420\n this, right, population of distant debris, its existence is also inferred.\n\n1:04:26.420 --> 1:04:32.340\n You could say alternatively, there is, you know, there's a big cosmic creature that occasionally,\n\n1:04:32.340 --> 1:04:38.460\n you know, sitting at 20,000 AU and occasionally throws an icy rock towards the sun like that.\n\n1:04:38.460 --> 1:04:40.260\n Spaghetti monster, I think it's called.\n\n1:04:40.260 --> 1:04:41.260\n Okay.\n\n1:04:41.260 --> 1:04:46.100\n I mean, so it's a mystery in many ways, but you can kind of infer a bunch of things about\n\n1:04:46.100 --> 1:04:47.100\n it.\n\n1:04:47.100 --> 1:04:51.340\n And by the way, both terrifying and exciting that there's this vast darkness all around\n\n1:04:51.340 --> 1:04:54.220\n us that's full of objects that they're just throwing.\n\n1:04:54.220 --> 1:04:55.220\n Just there.\n\n1:04:55.220 --> 1:04:56.220\n Yeah.\n\n1:04:56.220 --> 1:05:02.660\n It's actually kind of astonishing, right, that we have only explored a small fraction\n\n1:05:02.660 --> 1:05:04.980\n of the solar system, right?\n\n1:05:04.980 --> 1:05:11.620\n That really kind of baffles me because I remember as a student, you know, studying physics,\n\n1:05:11.620 --> 1:05:16.620\n you know, you do the problem where you put the earth around the sun, you solve that and\n\n1:05:16.620 --> 1:05:22.540\n like, it's one line of math and you say, okay, well, that surely was figured out by Newton.\n\n1:05:22.540 --> 1:05:29.920\n So like all the interesting stuff is not in the solar system, but that it's just plainly\n\n1:05:29.920 --> 1:05:30.920\n not true.\n\n1:05:30.920 --> 1:05:37.980\n There are mysteries in the solar system that are remarkable that we are only now starting\n\n1:05:37.980 --> 1:05:40.460\n to just kind of scratch the surface of.\n\n1:05:40.460 --> 1:05:44.340\n And some of those objects probably have some information about the history of our solar\n\n1:05:44.340 --> 1:05:45.340\n system.\n\n1:05:45.340 --> 1:05:46.340\n Absolutely.\n\n1:05:46.340 --> 1:05:50.460\n Like a great example is, you know, small meteorites, right?\n\n1:05:50.460 --> 1:05:53.140\n Small meteorites are melted, right?\n\n1:05:53.140 --> 1:05:59.020\n They have, they're differentiated, meaning some of the iron sinks, you say, well, how\n\n1:05:59.020 --> 1:06:00.020\n can that be?\n\n1:06:00.020 --> 1:06:04.540\n Because they're so small that they wouldn't have melted just from the heat of their accretion.\n\n1:06:04.540 --> 1:06:10.140\n Turns out the fact that the solar nebula, the disk that made the planets was polluted\n\n1:06:10.140 --> 1:06:13.940\n by aluminum 26 is in itself a remarkable thing.\n\n1:06:13.940 --> 1:06:17.720\n It means the solar system did not form in isolation.\n\n1:06:17.720 --> 1:06:23.940\n It formed in a giant cloud of thousands of other stars that were also forming, some of\n\n1:06:23.940 --> 1:06:30.120\n which were undergoing, you know, going through supernova explosions, some of, and releasing\n\n1:06:30.120 --> 1:06:37.900\n these unstable isotopes that, of which we now see kind of the traces of.\n\n1:06:37.900 --> 1:06:38.900\n It's so cool.\n\n1:06:38.900 --> 1:06:43.980\n Do you think it's possible that life from other solar systems was injected and that\n\n1:06:43.980 --> 1:06:47.700\n was what was the origin of life on Earth?\n\n1:06:47.700 --> 1:06:51.140\n Yeah, the Panspermia idea.\n\n1:06:51.140 --> 1:06:54.580\n That's seen as a low probability event by people who studied the origin of life, but\n\n1:06:54.580 --> 1:06:58.220\n that's because then they would be out of a job.\n\n1:06:58.220 --> 1:07:02.020\n Well, I don't think they'd be out of the job because you just then say, you have to figure\n\n1:07:02.020 --> 1:07:04.260\n out how life started there.\n\n1:07:04.260 --> 1:07:05.460\n But then you have to go there.\n\n1:07:05.460 --> 1:07:07.740\n We can study life on Earth much easier.\n\n1:07:07.740 --> 1:07:13.300\n We could study it in the lab much easier because we can replicate conditions there from an\n\n1:07:13.300 --> 1:07:19.780\n early Earth much easier from a chemistry perspective, from a biology perspective.\n\n1:07:19.780 --> 1:07:21.160\n You can intuit a bunch of stuff.\n\n1:07:21.160 --> 1:07:23.740\n You can look at different parts of Earth and just.\n\n1:07:23.740 --> 1:07:28.780\n To an extent, I mean, the early Earth was completely unlike the current Earth, right?\n\n1:07:28.780 --> 1:07:30.020\n There was no oxygen.\n\n1:07:30.020 --> 1:07:41.260\n So one of my colleagues at Caltech, Joe Kirshnik, is certain, something like 100% certainty\n\n1:07:41.260 --> 1:07:48.120\n that life started on Mars and came to Earth on Martian meteorites.\n\n1:07:48.120 --> 1:07:55.620\n This is not a problem that I like to kind of think about too much, like the origin of\n\n1:07:55.620 --> 1:07:56.620\n life.\n\n1:07:56.620 --> 1:08:02.660\n It's a fascinating problem, but you know, it's not physics and I just like, I just don't\n\n1:08:02.660 --> 1:08:03.660\n love it.\n\n1:08:03.660 --> 1:08:08.140\n It's the same reason you don't love, I thought you're a musician, so music is not physics\n\n1:08:08.140 --> 1:08:09.140\n either.\n\n1:08:09.140 --> 1:08:10.140\n So why are you so into it?\n\n1:08:10.140 --> 1:08:11.140\n It's 100% physics.\n\n1:08:11.140 --> 1:08:20.860\n No, no, look, in all seriousness though, there are a few things that I really, really enjoy.\n\n1:08:20.860 --> 1:08:23.300\n I genuinely enjoy physics.\n\n1:08:23.300 --> 1:08:24.820\n I genuinely enjoy music.\n\n1:08:24.820 --> 1:08:31.460\n I genuinely, you know, enjoy martial arts and I genuinely enjoy my family.\n\n1:08:31.460 --> 1:08:35.980\n I should have said that all in a reverse order or something, but I like to focus on these\n\n1:08:35.980 --> 1:08:39.820\n things and not worry too much about everything else.\n\n1:08:39.820 --> 1:08:40.820\n You know what I mean?\n\n1:08:40.820 --> 1:08:41.820\n Yes.\n\n1:08:41.820 --> 1:08:44.900\n Just because there is a, like you said earlier, there's a time constraint.\n\n1:08:44.900 --> 1:08:47.420\n You can't do it all.\n\n1:08:47.420 --> 1:08:50.740\n There's many mysteries all around us.\n\n1:08:50.740 --> 1:08:53.400\n And they're all beautiful in different ways.\n\n1:08:53.400 --> 1:08:59.460\n To me, that thing I love is artificial intelligence that perhaps I love it because eventually\n\n1:08:59.460 --> 1:09:03.860\n I'm trying to suck up to our future overlords.\n\n1:09:03.860 --> 1:09:09.000\n The question of, you said there's a lot of kind of little pieces of evidence for this\n\n1:09:09.000 --> 1:09:11.500\n thing that's Planet Nine.\n\n1:09:11.500 --> 1:09:18.420\n If we were to try to collect more evidence or be certain, like a paper that says, like\n\n1:09:18.420 --> 1:09:22.300\n you drop it, clear, we're done.\n\n1:09:22.300 --> 1:09:23.300\n What does that require?\n\n1:09:23.300 --> 1:09:28.700\n Are sending probes out or do you think we can do it from telescopes here on earth?\n\n1:09:28.700 --> 1:09:32.060\n What are the different ideas for conclusive evidence for Planet Nine?\n\n1:09:32.060 --> 1:09:36.820\n The moment Planet Nine gets imaged from a telescope on earth, it's done.\n\n1:09:36.820 --> 1:09:37.820\n I mean, it's just there.\n\n1:09:37.820 --> 1:09:38.820\n Can you clarify it?\n\n1:09:38.820 --> 1:09:42.940\n Cause you mentioned that before from an image, would you be able to tell?\n\n1:09:42.940 --> 1:09:43.940\n Yes.\n\n1:09:43.940 --> 1:09:51.740\n So from an image, the moment you see something, something that is reflecting sunlight back\n\n1:09:51.740 --> 1:10:01.980\n at you and you know that it's hundreds of times as far away from the sun as the earth,\n\n1:10:01.980 --> 1:10:02.980\n you're done.\n\n1:10:02.980 --> 1:10:08.020\n So you're thinking, so basically if you have a really far away thing that's big, five times\n\n1:10:08.020 --> 1:10:13.920\n the size of earth, that means that is Planet Nine.\n\n1:10:13.920 --> 1:10:15.460\n Could there be multiple objects like that?\n\n1:10:15.460 --> 1:10:16.460\n I guess.\n\n1:10:16.460 --> 1:10:17.460\n In principle, yeah.\n\n1:10:17.460 --> 1:10:22.980\n I mean, there's no law of physics that doesn't allow you to have multiple, there's also no\n\n1:10:22.980 --> 1:10:25.740\n evidence at present for there being multiple.\n\n1:10:25.740 --> 1:10:31.380\n I wonder if it's possible, just like we're finding exoplanets, whether given the size\n\n1:10:31.380 --> 1:10:36.300\n of the Oort Cloud, there's basically, it's rarer and rarer, but there are sprinkled Planet\n\n1:10:36.300 --> 1:10:41.220\n Nine, 10, 11, 12, like these, some.\n\n1:10:41.220 --> 1:10:42.220\n Got 13.\n\n1:10:42.220 --> 1:10:43.220\n It goes after that.\n\n1:10:43.220 --> 1:10:45.180\n I can just keep counting.\n\n1:10:45.180 --> 1:10:50.660\n So just something about the dynamic system, it becomes lower and lower probability event,\n\n1:10:50.660 --> 1:10:57.380\n but they gather up, they become larger and larger maybe, something like that.\n\n1:10:57.380 --> 1:11:04.500\n I wonder if discovering Planet Nine will just be almost like a springboard, it's like, well,\n\n1:11:04.500 --> 1:11:05.620\n what's beyond that?\n\n1:11:05.620 --> 1:11:06.840\n It's entirely plausible.\n\n1:11:06.840 --> 1:11:12.220\n The Oort Cloud itself probably holds about five earth masses or seven earth masses of\n\n1:11:12.220 --> 1:11:13.220\n material.\n\n1:11:13.220 --> 1:11:16.980\n Right, so it's not nothing.\n\n1:11:16.980 --> 1:11:27.420\n And it all ultimately comes down to at what point will the observational surveys sample\n\n1:11:27.420 --> 1:11:33.900\n enough of the solar system to kind of reveal interesting things.\n\n1:11:33.900 --> 1:11:38.780\n There's a great analogy here with Neptune and the story of how Neptune was discovered.\n\n1:11:38.780 --> 1:11:42.140\n Neptune was not discovered by looking at the sky, right?\n\n1:11:42.140 --> 1:11:45.740\n It was discovered mathematically, right?\n\n1:11:45.740 --> 1:11:58.860\n So yeah, the orbit of Uranus, when Uranus was found, this was 1781, both the tracking\n\n1:11:58.860 --> 1:12:05.900\n of the orbit of Uranus as well as the reconstruction of the orbit of Uranus immediately revealed\n\n1:12:05.900 --> 1:12:10.220\n that it was not following the orbit that it was supposed to, right?\n\n1:12:10.220 --> 1:12:13.980\n The predicted orbit deviated away from where it actually was.\n\n1:12:13.980 --> 1:12:24.240\n So in the mid 1800s, right, a French mathematician by the name of Orban Le Verrier did a beautifully\n\n1:12:24.240 --> 1:12:31.500\n sophisticated calculation which said if this is due to gravity of a more distant planet,\n\n1:12:31.500 --> 1:12:34.080\n then that planet is there, okay?\n\n1:12:34.080 --> 1:12:35.560\n And then they found it.\n\n1:12:35.560 --> 1:12:42.980\n But the point is the understanding of where to look for Neptune came entirely out of celestial\n\n1:12:42.980 --> 1:12:43.980\n mechanics.\n\n1:12:43.980 --> 1:12:49.360\n The case with Planet Nine is a little bit different because what we can do I think relatively\n\n1:12:49.360 --> 1:12:52.060\n well is predict the orbit and mass of Planet Nine.\n\n1:12:52.060 --> 1:12:54.820\n We cannot tell you where it is on its orbit.\n\n1:12:54.820 --> 1:13:02.200\n The reason is we haven't seen the Kuiper Belt objects complete an orbit, their own orbit,\n\n1:13:02.200 --> 1:13:04.720\n even once because it takes 4,000 years.\n\n1:13:04.720 --> 1:13:13.220\n But I plan to live on as an AI being, and I'll be tracking those orbits as, you know,\n\n1:13:13.220 --> 1:13:14.220\n for…\n\n1:13:14.220 --> 1:13:15.220\n So it takes 4,000 or 5,000 years.\n\n1:13:15.220 --> 1:13:16.220\n I mean, it doesn't have to be AI.\n\n1:13:16.220 --> 1:13:17.220\n It could be longevity.\n\n1:13:17.220 --> 1:13:19.740\n There's a lot of really exciting genetic engineering research.\n\n1:13:19.740 --> 1:13:25.900\n So you'll just be a brain waiting for the, your brain waiting for the orbit to complete\n\n1:13:25.900 --> 1:13:27.900\n for the basic Kuiper Belt objects.\n\n1:13:27.900 --> 1:13:28.900\n That's right.\n\n1:13:28.900 --> 1:13:34.860\n That's like kind of the worst reason to want to live a long time, right, just like can\n\n1:13:34.860 --> 1:13:36.380\n the brain like smoke a cigarette?\n\n1:13:36.380 --> 1:13:37.380\n I know, right?\n\n1:13:37.380 --> 1:13:44.020\n Can you just like light one up while you're waiting or?\n\n1:13:44.020 --> 1:13:52.420\n But you're making me actually realize that the one way to explore the galaxy is by just\n\n1:13:52.420 --> 1:13:54.660\n sitting here on Earth and waiting.\n\n1:13:54.660 --> 1:13:59.460\n So if we can just get really good at waiting, it's like a mua mua or these interstellar\n\n1:13:59.460 --> 1:14:02.980\n objects that fly in, you can just wait for them to come to you.\n\n1:14:02.980 --> 1:14:03.980\n Same with the aliens.\n\n1:14:03.980 --> 1:14:05.180\n You can wait for them to come to you.\n\n1:14:05.180 --> 1:14:11.340\n If you get really good at waiting, then that's one way to do the exploration because eventually\n\n1:14:11.340 --> 1:14:12.660\n the thing will come to you.\n\n1:14:12.660 --> 1:14:18.680\n Maybe that's the, maybe the intelligent alien civilizations get much better at waiting,\n\n1:14:18.680 --> 1:14:23.140\n and so they all decide, so game theoretically, to start waiting, and it's just a bunch of\n\n1:14:23.140 --> 1:14:27.460\n like ancient intelligent civilizations of aliens all throughout the universe, they're\n\n1:14:27.460 --> 1:14:29.420\n just sitting there waiting for each other.\n\n1:14:29.420 --> 1:14:31.780\n Look, you can't just be good at waiting.\n\n1:14:31.780 --> 1:14:33.580\n You gotta know how to chill, okay?\n\n1:14:33.580 --> 1:14:36.280\n Like you can't just like sit around and do nothing.\n\n1:14:36.280 --> 1:14:38.260\n You gotta be, you gotta know how to chill.\n\n1:14:38.260 --> 1:14:45.940\n I honestly think that as we progress, if the aliens are anything like us, we enjoy loving\n\n1:14:45.940 --> 1:14:52.820\n things we do, and it's very possible that we just figure out mechanisms here on Earth\n\n1:14:52.820 --> 1:14:58.380\n to enjoy our life, and we just stay here on Earth forever, that exploration becomes less\n\n1:14:58.380 --> 1:15:03.420\n and less of an interesting thing to do, and so you basically, yes, wait and chill.\n\n1:15:03.420 --> 1:15:09.440\n You get really optimally good at chilling, and thereby exploring is not that interesting,\n\n1:15:09.440 --> 1:15:13.100\n so in terms of 4,000 years, it would be nothing for scientists.\n\n1:15:13.100 --> 1:15:18.340\n We'll be chilling and just all kinds of scientific explorations will become possible because\n\n1:15:18.340 --> 1:15:20.020\n we'll just be here on Earth.\n\n1:15:20.020 --> 1:15:21.020\n So chill.\n\n1:15:21.020 --> 1:15:22.020\n So chill.\n\n1:15:22.020 --> 1:15:26.060\n You have a paper out recently, because you already mentioned some of these ideas, but\n\n1:15:26.060 --> 1:15:28.100\n I'd love it if you could dig into it a little bit.\n\n1:15:28.100 --> 1:15:29.100\n Yeah, of course.\n\n1:15:29.100 --> 1:15:35.100\n The injection of inner Oort Cloud objects into the distant Kuiper Belt by Planet Nine.\n\n1:15:35.100 --> 1:15:40.820\n What is this idea of Planet Nine injecting objects into the Kuiper Belt?\n\n1:15:40.820 --> 1:15:47.740\n Okay, let me take a brief step back, and when we do calculations of Planet Nine, when we\n\n1:15:47.740 --> 1:15:57.380\n do the simulations, as far as our simulations are concerned, sort of the Neptune, like kind\n\n1:15:57.380 --> 1:16:05.300\n of the transneptunian solar system is entirely sourced from the inside, namely the Kuiper\n\n1:16:05.300 --> 1:16:10.840\n Belt gets scattered by Neptune, and then Planet Nine does things to it and aligns the orbits\n\n1:16:10.840 --> 1:16:17.060\n and so on, and then we calculate what happens on the lifetime of the solar system, yada,\n\n1:16:17.060 --> 1:16:18.580\n yada, yada.\n\n1:16:18.580 --> 1:16:23.100\n During the pandemic, one of the kind of questions we asked ourselves, and this is indeed something\n\n1:16:23.100 --> 1:16:31.460\n we, Mike and I, Mike Brown, who's a partner in crime on this, and I do regularly, is we\n\n1:16:31.460 --> 1:16:39.300\n say how can we A, disprove ourselves, and B, how can we improve our simulations?\n\n1:16:39.300 --> 1:16:40.940\n Like what's missing?\n\n1:16:40.940 --> 1:16:46.780\n One idea that maybe should have been obvious in retrospect is that all of our simulations\n\n1:16:46.780 --> 1:16:50.820\n treated the solar system as some isolated creature, right?\n\n1:16:50.820 --> 1:16:53.420\n But the solar system did not form in isolation, right?\n\n1:16:53.420 --> 1:16:59.780\n It formed in this cluster of stars, and during that phase of forming together with thousands\n\n1:16:59.780 --> 1:17:06.540\n of other stars, we believe the solar system formed this almost spherical population of\n\n1:17:06.540 --> 1:17:16.980\n icy debris that sits maybe at a few thousand times the separation between the Earth and\n\n1:17:16.980 --> 1:17:20.420\n the Sun, maybe even a little bit closer.\n\n1:17:20.420 --> 1:17:25.900\n If Planet Nine's not there, that population is completely dormant, and these objects just\n\n1:17:25.900 --> 1:17:29.620\n slowly orbit the Sun.\n\n1:17:29.620 --> 1:17:34.940\n Nothing interesting happens to them ever, but when we realize that if Planet Nine is\n\n1:17:34.940 --> 1:17:39.340\n there, Planet Nine can actually grab some of those objects and gravitationally reinject\n\n1:17:39.340 --> 1:17:42.740\n them into the distant solar system.\n\n1:17:42.740 --> 1:17:46.740\n So we thought, okay, let's look into this with numerical experiments.\n\n1:17:46.740 --> 1:17:53.020\n Do our simulations, does this process work, and if it works, what are its consequences?\n\n1:17:53.020 --> 1:18:01.460\n So it turns out, indeed, not only does Planet Nine inject these distant inner Oort cloud\n\n1:18:01.460 --> 1:18:09.340\n objects into the Kuiper Belt, they follow roughly the same pathway as the objects that\n\n1:18:09.340 --> 1:18:10.940\n are being scattered out.\n\n1:18:10.940 --> 1:18:15.140\n So there's this kind of river, two way river of material.\n\n1:18:15.140 --> 1:18:20.700\n Some of it is coming out by Neptune scattering, some of it is moving in.\n\n1:18:20.700 --> 1:18:27.420\n And if you work through the numbers, you kind of, at the end of the day, it has an effect\n\n1:18:27.420 --> 1:18:30.060\n on the best fit orbit for Planet Nine itself.\n\n1:18:30.060 --> 1:18:35.860\n So if you realize that the data set that we're observing is not entirely composed of things\n\n1:18:35.860 --> 1:18:41.140\n that came out of the solar system, but also things that got reinjected back in, then turns\n\n1:18:41.140 --> 1:18:44.140\n out the best fit Planet Nine is slightly more eccentric.\n\n1:18:44.140 --> 1:18:46.540\n That's kind of getting into the weeds.\n\n1:18:46.540 --> 1:18:53.780\n The point here is that the existence of Planet Nine itself provides this natural bridge that\n\n1:18:53.780 --> 1:18:58.580\n connects an otherwise dormant population of icy debris of the solar system with things\n\n1:18:58.580 --> 1:19:00.180\n that we're starting to directly observe.\n\n1:19:00.180 --> 1:19:04.660\n So it can flow back, so it's not just a river flowing one way, it's maybe a smaller stream\n\n1:19:04.660 --> 1:19:05.660\n going back.\n\n1:19:05.660 --> 1:19:06.660\n Backwash.\n\n1:19:06.660 --> 1:19:10.880\n You want a backwash, you want to incorporate that into the simulations, into your understanding\n\n1:19:10.880 --> 1:19:15.040\n of those distant objects when you're trying to make sense of the various observations\n\n1:19:15.040 --> 1:19:16.040\n and so on.\n\n1:19:16.040 --> 1:19:17.040\n Exactly.\n\n1:19:17.040 --> 1:19:18.040\n That's fascinating.\n\n1:19:18.040 --> 1:19:24.460\n I gotta ask you, some people think that many of the observations that you're describing\n\n1:19:24.460 --> 1:19:28.900\n could be described by a primordial black hole.\n\n1:19:28.900 --> 1:19:33.420\n First, what is a primordial black hole and what do you think about this idea?\n\n1:19:33.420 --> 1:19:39.580\n So primordial black hole is a black hole which is made not through the usual pathway of making\n\n1:19:39.580 --> 1:19:48.860\n a black hole, which is that you have a star, which is more massive than 1.4 or so solar\n\n1:19:48.860 --> 1:19:56.700\n masses and basically when it runs out of fuel, runs out of its nuclear fusion fuel, it can't\n\n1:19:56.700 --> 1:20:01.740\n hold itself up anymore and just the whole thing collapses on itself, right?\n\n1:20:01.740 --> 1:20:09.100\n You create a, I mean one, I guess, simple way to think about it is you create an object\n\n1:20:09.100 --> 1:20:16.500\n with zero radius, that has mass but zero radius, that singularity.\n\n1:20:16.500 --> 1:20:20.020\n Now such black holes exist all over the place.\n\n1:20:20.020 --> 1:20:25.980\n In the galaxy, there's in fact a really big one at the center of the galaxy that's like,\n\n1:20:25.980 --> 1:20:31.100\n that one's always looking at you when you're not looking, okay, and it's always talking\n\n1:20:31.100 --> 1:20:32.100\n about you.\n\n1:20:32.100 --> 1:20:34.940\n And when you turn off the lights, it wakes up.\n\n1:20:34.940 --> 1:20:37.600\n That's right.\n\n1:20:37.600 --> 1:20:40.580\n So such black holes are all over the place.\n\n1:20:40.580 --> 1:20:45.700\n When they merge, we get to see incredible gravitational waves that they emit, etc, etc.\n\n1:20:45.700 --> 1:20:50.780\n One kind of plausible scenario, however, is that when the universe was forming, basically\n\n1:20:50.780 --> 1:20:59.740\n during the Big Bang, you created a whole spectrum of black holes, some with masses of five Earth\n\n1:20:59.740 --> 1:21:05.700\n masses, some with masses of 10 Earth masses, like the entire, you know, mass spectrum size,\n\n1:21:05.700 --> 1:21:08.940\n some the massive asteroids.\n\n1:21:08.940 --> 1:21:14.340\n Now on the smaller end, over the lifetime of the universe, the smaller ones kind of\n\n1:21:14.340 --> 1:21:16.780\n evaporate and they're not there anymore.\n\n1:21:16.780 --> 1:21:21.500\n At least this is what we, what the calculations tell us.\n\n1:21:21.500 --> 1:21:25.060\n But five Earth masses is big enough to not have evaporated.\n\n1:21:25.060 --> 1:21:33.500\n So one idea is that Planet Nine is not a planet and instead it is a five Earth mass black\n\n1:21:33.500 --> 1:21:34.980\n hole.\n\n1:21:34.980 --> 1:21:37.020\n And that's why it's hard to find.\n\n1:21:37.020 --> 1:21:45.260\n Now can we right away from our calculations say that's definitely true or that's not true?\n\n1:21:45.260 --> 1:21:46.260\n Absolutely not.\n\n1:21:46.260 --> 1:21:53.700\n We can't, in fact, our calculations tell you nothing other than the orbit and the mass.\n\n1:21:53.700 --> 1:21:59.760\n And that means the black hole, I mean, it could be a five Earth mass, you know, cup.\n\n1:21:59.760 --> 1:22:04.660\n It could be a five Earth mass hedgehog or a black hole or really anything that's five\n\n1:22:04.660 --> 1:22:10.220\n Earth masses will do because the gravity of a black hole is no different than the gravity\n\n1:22:10.220 --> 1:22:11.740\n of a planet, right?\n\n1:22:11.740 --> 1:22:17.660\n If the sun became a black hole tomorrow, it would be dark, but the Earth would keep orbiting\n\n1:22:17.660 --> 1:22:18.660\n it.\n\n1:22:18.660 --> 1:22:23.300\n And like this notion that, oh, black holes suck everything in, it's not, that's like\n\n1:22:23.300 --> 1:22:24.300\n a sci fi notion.\n\n1:22:24.300 --> 1:22:25.300\n All right.\n\n1:22:25.300 --> 1:22:26.300\n It's just mass.\n\n1:22:26.300 --> 1:22:32.780\n What would be the difference between a black hole and a planet in terms of observationally?\n\n1:22:32.780 --> 1:22:37.180\n Probably the difference would be that you will never find the black hole, right?\n\n1:22:37.180 --> 1:22:43.060\n The truth is they're kind of, I'm actually not, you know, I never looked into this very\n\n1:22:43.060 --> 1:22:49.740\n carefully, but there are some constraints that you can get just statistically and say,\n\n1:22:49.740 --> 1:22:56.060\n okay, if the sun has a binary companion, which is a five Earth mass black hole, then that\n\n1:22:56.060 --> 1:23:01.500\n means such black holes would be extremely common and, you know, you can sort of look\n\n1:23:01.500 --> 1:23:05.260\n for lensing events and then you say, okay, maybe that's not so likely.\n\n1:23:05.260 --> 1:23:12.120\n But you know, that said, I want to emphasize that there's a limit to what our calculations\n\n1:23:12.120 --> 1:23:13.120\n can tell you.\n\n1:23:13.120 --> 1:23:14.680\n That's the orbit and the mass.\n\n1:23:14.680 --> 1:23:20.900\n So I think there's a bunch, like Ed Witten, I think wishes it's a black hole because I\n\n1:23:20.900 --> 1:23:26.580\n think one exciting things about black holes in our solar system is that we could go there\n\n1:23:26.580 --> 1:23:31.060\n and we can maybe study the singularity somehow because that allows us to understand some\n\n1:23:31.060 --> 1:23:33.340\n fundamental things about physics.\n\n1:23:33.340 --> 1:23:39.840\n If it's a planet, so planet nine, we may not, you know, and we go there, we may not discover\n\n1:23:39.840 --> 1:23:43.220\n anything profoundly new.\n\n1:23:43.220 --> 1:23:47.620\n The interesting thing, perhaps you can correct me about planet nine is like the big picture\n\n1:23:47.620 --> 1:23:48.620\n of it.\n\n1:23:48.620 --> 1:23:52.260\n The whole big story of the Kuiper belt and all those kinds of things.\n\n1:23:52.260 --> 1:23:58.900\n It's not that planet nine would be somehow fundamentally different from, I don't know,\n\n1:23:58.900 --> 1:24:03.700\n Neptune in terms of, in terms of the kind of things we could learn from it.\n\n1:24:03.700 --> 1:24:07.580\n So I think that there's kind of a hope that it's a black hole because it's an entirely\n\n1:24:07.580 --> 1:24:09.020\n new kind of object.\n\n1:24:09.020 --> 1:24:11.020\n Maybe you can correct me on that.\n\n1:24:11.020 --> 1:24:12.020\n Yeah.\n\n1:24:12.020 --> 1:24:18.060\n I mean, of course here, my own biases creep in because I'm interested, you know, in planets\n\n1:24:18.060 --> 1:24:19.960\n around other stars.\n\n1:24:19.960 --> 1:24:26.060\n And I would say, I would disagree that, you know, we wouldn't find things that would be\n\n1:24:26.060 --> 1:24:33.680\n truly, you know, fundamentally new because as it turns out, the galaxy is really good\n\n1:24:33.680 --> 1:24:38.620\n at making five or three earth mass objects, right?\n\n1:24:38.620 --> 1:24:45.160\n The most common type of planet that we see, that we, you know, discover orbiting around\n\n1:24:45.160 --> 1:24:47.800\n other stars is a few earth masses.\n\n1:24:47.800 --> 1:24:50.020\n In the solar system, there's no analog for that, right?\n\n1:24:50.020 --> 1:24:56.020\n We go from one earth mass object, which is this one and to skipping to Neptune and Uranus,\n\n1:24:56.020 --> 1:25:01.280\n which themselves are actually relatively poorly understood, especially Uranus from the interior\n\n1:25:01.280 --> 1:25:03.920\n structure point of view.\n\n1:25:03.920 --> 1:25:09.520\n If planet nine is a planet, going there will give us the closest window into understanding\n\n1:25:09.520 --> 1:25:12.220\n what other planets look like.\n\n1:25:12.220 --> 1:25:18.860\n And I will, you know, I'll say this, that, you know, planets kind of in terms of their\n\n1:25:18.860 --> 1:25:26.020\n complexity on some logarithmic scale fall somewhere between a star and an insect, right?\n\n1:25:26.020 --> 1:25:30.940\n An insect is way more complicated than a star, right?\n\n1:25:30.940 --> 1:25:37.240\n Just all kinds of physical processes and really biochemical processes that occur inside of\n\n1:25:37.240 --> 1:25:43.800\n an insect that just make a star look like, you know, somebody is like playing with a\n\n1:25:43.800 --> 1:25:45.500\n spring or something, right?\n\n1:25:45.500 --> 1:25:53.580\n So the, I think, you know, it would be, you know, arguably, you know, more interesting\n\n1:25:53.580 --> 1:25:59.380\n to go to, you know, to go to planet nine if it's a planet, because black holes are simple.\n\n1:25:59.380 --> 1:26:04.500\n They're just kind of, they're basically macroscopic like particles, right?\n\n1:26:04.500 --> 1:26:05.500\n Yeah.\n\n1:26:05.500 --> 1:26:08.060\n And so just like a star that you mentioned in terms of complexity.\n\n1:26:08.060 --> 1:26:14.100\n So it's possible that planet nine is supposed to being like homogeneous is like super like\n\n1:26:14.100 --> 1:26:18.220\n heterogeneous is a bunch of cool stuff going on that could give us an intuition.\n\n1:26:18.220 --> 1:26:24.580\n I never thought about that, that it's basically Earth number two in terms of size and gives\n\n1:26:24.580 --> 1:26:30.500\n us, starts giving us intuition that could be generalizable to Earth like planets elsewhere\n\n1:26:30.500 --> 1:26:31.500\n in the galaxy.\n\n1:26:31.500 --> 1:26:37.220\n I mean, yeah, Pluto is also in the sense like, you know, Pluto is a tiny, tiny thing, right?\n\n1:26:37.220 --> 1:26:41.380\n Just like you would imagine that it's just a tiny ball of ice, like who cares, but the\n\n1:26:41.380 --> 1:26:47.260\n New Horizons images of Pluto reveal so much remarkable structure, right?\n\n1:26:47.260 --> 1:26:51.860\n They reveal glaciers flowing and these are glaciers not made out of water ice, but you\n\n1:26:51.860 --> 1:27:00.340\n know, CO ice, it turns out at those temperatures, right, of like 40 or so Kelvin, water ice\n\n1:27:00.340 --> 1:27:01.340\n looks like metal, right?\n\n1:27:01.340 --> 1:27:07.380\n It just doesn't flow at all, but then ice made up of carbon monoxide starts to flow.\n\n1:27:07.380 --> 1:27:14.180\n I mean, there's just like all kinds of really cool phenomena that you otherwise just wouldn't\n\n1:27:14.180 --> 1:27:17.180\n really even imagine that occur.\n\n1:27:17.180 --> 1:27:20.620\n So yeah, I mean, there's a reason why I like planets.\n\n1:27:20.620 --> 1:27:28.720\n Well, let me ask you, I find as I read the idea that Ed Witten was thinking about this\n\n1:27:28.720 --> 1:27:30.060\n kind of stuff fascinating.\n\n1:27:30.060 --> 1:27:37.420\n So he's a mathematical physicist who's very interested in string theory, won the Fields\n\n1:27:37.420 --> 1:27:41.460\n Medal for his work in mathematics.\n\n1:27:41.460 --> 1:27:47.260\n So I read that he proposed a fleet of probes accelerated by radiation pressure that could\n\n1:27:47.260 --> 1:27:50.580\n discover a Planet Nine primordial black holes location.\n\n1:27:50.580 --> 1:27:55.980\n What do you think about this idea of sending a bunch of probes out there?\n\n1:27:55.980 --> 1:28:00.820\n Yeah, look, the way the idea is a cool one, right?\n\n1:28:00.820 --> 1:28:06.920\n You go and you say, you know, launch them basically, isotropically, you track where\n\n1:28:06.920 --> 1:28:07.920\n they go.\n\n1:28:07.920 --> 1:28:15.260\n And if I understand the idea correctly, basically measure the deflection and you say, okay,\n\n1:28:15.260 --> 1:28:21.620\n that must be something there since the probe trajectories are being altered.\n\n1:28:21.620 --> 1:28:26.420\n Oh, so the measurement, the basic sensory mechanism is the, it's not like you have senses\n\n1:28:26.420 --> 1:28:27.420\n on the probes.\n\n1:28:27.420 --> 1:28:32.300\n It's more like you're, because you're very precisely able to capture, to measure the\n\n1:28:32.300 --> 1:28:35.780\n trajectory of the probes, you can then infer the gravitational fields.\n\n1:28:35.780 --> 1:28:39.960\n I think that's the basic idea.\n\n1:28:39.960 --> 1:28:46.500\n You know, back a few years ago, we had conversations like these with, you know, engineers from\n\n1:28:46.500 --> 1:28:47.960\n JPL.\n\n1:28:47.960 --> 1:28:55.120\n They more or less convinced me that this is more, much more difficult than it seems because\n\n1:28:55.120 --> 1:28:58.820\n you don't, at that level of precision, right?\n\n1:28:58.820 --> 1:29:00.980\n Things like solar flares matter, right?\n\n1:29:00.980 --> 1:29:03.740\n Solar flares, right, are completely chaotic.\n\n1:29:03.740 --> 1:29:07.260\n You can't predict which, where a solar flare will happen.\n\n1:29:07.260 --> 1:29:10.580\n That will drive radiation pressure gradients.\n\n1:29:10.580 --> 1:29:12.640\n You don't know where every single asteroid is.\n\n1:29:12.640 --> 1:29:20.900\n So like actually doing that problem, I think it's possible, but it's not a trivial matter,\n\n1:29:20.900 --> 1:29:21.900\n right?\n\n1:29:21.900 --> 1:29:28.380\n Well, I wonder, not just about Planet 9, I wonder if that's kind of the future of doing\n\n1:29:28.380 --> 1:29:33.420\n science in our solar system is to just launch a huge number of probes.\n\n1:29:33.420 --> 1:29:39.820\n So like a whole order of magnitude, many orders of magnitude, larger numbers of probes, and\n\n1:29:39.820 --> 1:29:44.620\n then starting for a bunch of different stuff, not just gravity, but everything else.\n\n1:29:44.620 --> 1:29:50.420\n So in this regard, I actually think there is a huge revolution that's to some extent\n\n1:29:50.420 --> 1:29:52.100\n already started, right?\n\n1:29:52.100 --> 1:29:57.740\n The standard kind of like timescale for a NASA mission is that you like propose it and\n\n1:29:57.740 --> 1:30:01.980\n it launches, I don't know, like 150 years after your proposal.\n\n1:30:01.980 --> 1:30:08.860\n I'm over exaggerating, but you know, it's just like some huge development cycle and\n\n1:30:08.860 --> 1:30:15.900\n it gets delayed 55 times, like that is not going away, right?\n\n1:30:15.900 --> 1:30:20.340\n The really cutting edge things, you have to do it this way because you don't know what\n\n1:30:20.340 --> 1:30:22.300\n you're building, so to speak.\n\n1:30:22.300 --> 1:30:32.040\n But the CubeSat kind of world is starting to provide an avenue for like launching something\n\n1:30:32.040 --> 1:30:37.980\n that costs a few million dollars and has a turnaround timescale of like a couple of years.\n\n1:30:37.980 --> 1:30:44.260\n You can imagine doing PhD theses where you design the mission, the mission goes to where\n\n1:30:44.260 --> 1:30:49.520\n you're going, and you do the science all within a time span of five, six years.\n\n1:30:49.520 --> 1:30:56.220\n That has not been fully executed on yet, but I absolutely think that's on the horizon and\n\n1:30:56.220 --> 1:30:59.980\n we're not talking a decade, I think we're talking like this decade.\n\n1:30:59.980 --> 1:31:07.660\n Yeah, and the company is accelerating all this with Blue Origin and SpaceX, and there's\n\n1:31:07.660 --> 1:31:12.380\n a bunch of more CubeSat oriented companies that are pushing this forward.\n\n1:31:12.380 --> 1:31:17.740\n Well let me ask you on that topic, what do you think about either one?\n\n1:31:17.740 --> 1:31:24.420\n Elon Musk with SpaceX going to Mars, I think he wants SpaceX to be the first to put a first\n\n1:31:24.420 --> 1:31:33.380\n human on Mars, and then Jeff Bezos, gotta give him props, wants to be the first to fly\n\n1:31:33.380 --> 1:31:38.060\n his own rocket out into space.\n\n1:31:38.060 --> 1:31:43.020\n Wasn't there a guy who like built his rocket out of garbage?\n\n1:31:43.020 --> 1:31:47.580\n This was like a couple years ago, and somewhere in the desert he launched himself.\n\n1:31:47.580 --> 1:31:52.340\n I'm not tracking this closely, but I think I am familiar with folks who built their own\n\n1:31:52.340 --> 1:31:54.660\n rocket to try to prove the earth is flat.\n\n1:31:54.660 --> 1:32:00.540\n Yes, that's the guy I'm talking about, he also jumped some limousine.\n\n1:32:00.540 --> 1:32:09.940\n Truly revolutionary mind, you have to have greater men than either you or I.\n\n1:32:09.940 --> 1:32:17.380\n It's been astonishing to watch how really over the last decade the commercial sector\n\n1:32:17.380 --> 1:32:27.740\n took over this industry that traditionally has really been a government thing to do.\n\n1:32:27.740 --> 1:32:34.020\n Motivated primarily by the competition between nations, like the Cold War, and now it's motivated\n\n1:32:34.020 --> 1:32:39.380\n more and more by the natural forces of capitalism.\n\n1:32:39.380 --> 1:32:43.860\n That's right, so here I have many ideas about it.\n\n1:32:43.860 --> 1:32:51.780\n I think on the one hand, like what SpaceX has been able to do, for example, phenomenal.\n\n1:32:51.780 --> 1:32:57.980\n If that brings down the price of space exploration, that turnaround time scale for space exploration,\n\n1:32:57.980 --> 1:33:06.580\n which I think it inevitably will, that's a huge boost to the human condition.\n\n1:33:06.580 --> 1:33:14.220\n The same time, if we're talking astronomy, it comes at a huge cost, and the Starlink\n\n1:33:14.220 --> 1:33:16.660\n satellites is a great example of that cost.\n\n1:33:16.660 --> 1:33:26.480\n In fact, I was just camping in the Mojave with a friend of mine, and they saw this string\n\n1:33:26.480 --> 1:33:32.780\n of satellites just kind of appear and then disappear into nowhere.\n\n1:33:32.780 --> 1:33:39.860\n That is beginning to interfere with Earth based observations, so I think there's tremendous\n\n1:33:39.860 --> 1:33:45.020\n potential there, it's also important to be responsible about how it's executed.\n\n1:33:45.020 --> 1:33:53.520\n Now with Mars and the whole idea of exploring Mars, I don't have strong opinions on whether\n\n1:33:53.520 --> 1:34:05.260\n a manned mission is required or not required, but I do think the thing to keep in mind is\n\n1:34:05.260 --> 1:34:13.260\n that I'm not signed on, if you will, to the idea that Mars is some kind of a safe haven\n\n1:34:13.260 --> 1:34:17.980\n that we can escape to.\n\n1:34:17.980 --> 1:34:19.780\n Mars sucks.\n\n1:34:19.780 --> 1:34:26.420\n Living on Mars, if you want to live on Mars, you can have that experience by going to the\n\n1:34:26.420 --> 1:34:31.780\n Mojave Desert and camping, and it's just not a great experience.\n\n1:34:31.780 --> 1:34:35.500\n Well it's interesting, but there's something captivating about that kind of mission of\n\n1:34:35.500 --> 1:34:43.940\n us striving out into space, and by making Mars in some ways habitable for at least like\n\n1:34:43.940 --> 1:34:51.100\n months at a time, I think would lead to engineering breakthroughs that would make life in many\n\n1:34:51.100 --> 1:34:52.500\n ways much better on Earth.\n\n1:34:52.500 --> 1:34:58.180\n It will come up with ideas we totally don't expect yet, both on the robotics side, on\n\n1:34:58.180 --> 1:35:06.540\n the food engineering side, on the, maybe we'll switch from, there'll be huge breakthroughs\n\n1:35:06.540 --> 1:35:14.860\n in insect farming, as exciting as I find that idea to be, in the ways we consume protein.\n\n1:35:14.860 --> 1:35:22.140\n Maybe it'll revolutionize, we do factory farming, which is full of cruelty and torture of animals,\n\n1:35:22.140 --> 1:35:27.820\n we'll revolutionize that completely because of our, we shouldn't need to go to Mars to\n\n1:35:27.820 --> 1:35:32.580\n revolutionize life here on Earth, but at the same time, I shouldn't need a deadline to\n\n1:35:32.580 --> 1:35:35.100\n get shit done, but I do need it.\n\n1:35:35.100 --> 1:35:37.580\n And then in the same way, I think we need Mars.\n\n1:35:37.580 --> 1:35:41.060\n There's something about the human spirit that loves that longing for exploration.\n\n1:35:41.060 --> 1:35:51.900\n I agree with that thesis, the going to the moon, right, and that whole endeavor has captivated\n\n1:35:51.900 --> 1:35:59.780\n the imagination of so many, and it has led to incredible ideas, really, and probably\n\n1:35:59.780 --> 1:36:05.420\n in nonlinear ways, not like, okay, we went to the moon, therefore some person here has\n\n1:36:05.420 --> 1:36:07.180\n thought of this.\n\n1:36:07.180 --> 1:36:15.760\n In that similar sense, I think space exploration is, there's some real magnetism about it,\n\n1:36:15.760 --> 1:36:17.680\n and it's on a genetic level.\n\n1:36:17.680 --> 1:36:25.460\n We have this need to keep exploring when we're done with a certain frontier, we move on to\n\n1:36:25.460 --> 1:36:26.460\n the next frontier.\n\n1:36:26.460 --> 1:36:32.860\n All that I'm saying is that I'm not moving to Mars to live there permanently ever, and\n\n1:36:32.860 --> 1:36:39.540\n I think that, I'm glad you noted the kind of degradation of the Earth.\n\n1:36:39.540 --> 1:36:44.620\n I think that is a true kind of the leading order challenge of our time.\n\n1:36:44.620 --> 1:36:48.180\n That's a great engineering, that's a bunch of engineering problems.\n\n1:36:48.180 --> 1:36:53.980\n I'm most interested in space, because as I've read extensively, it's apparently very difficult\n\n1:36:53.980 --> 1:36:59.020\n to have sex in space, and so I just want that problem to be solved, because I think once\n\n1:36:59.020 --> 1:37:04.620\n we solve the sex in space problem, we'll revolutionize sex here on Earth, thereby increasing the\n\n1:37:04.620 --> 1:37:08.980\n fun on Earth, and the consequences of that can only be good.\n\n1:37:08.980 --> 1:37:14.220\n I mean, you can, you've got a clear plan, right, and it sounds like, you know.\n\n1:37:14.220 --> 1:37:16.420\n I'm submitting proposals to NASA as we speak.\n\n1:37:16.420 --> 1:37:17.420\n That's right.\n\n1:37:17.420 --> 1:37:21.020\n I keep getting rejected, I don't know why.\n\n1:37:21.020 --> 1:37:22.020\n Okay.\n\n1:37:22.020 --> 1:37:24.460\n You need better diagrams.\n\n1:37:24.460 --> 1:37:25.460\n Better pictures.\n\n1:37:25.460 --> 1:37:26.660\n I should have thought of that.\n\n1:37:26.660 --> 1:37:30.980\n You a while ago mentioned that, you know, there's certain aspects in the history of\n\n1:37:30.980 --> 1:37:38.260\n the solar system and Earth that resulted, it could have resulted in an opaque atmosphere,\n\n1:37:38.260 --> 1:37:43.100\n but it didn't, we couldn't see the stars.\n\n1:37:43.100 --> 1:37:47.580\n And somebody mentioned to me a little bit ago, and it's almost like a philosophical\n\n1:37:47.580 --> 1:37:49.320\n question for you.\n\n1:37:49.320 --> 1:37:58.700\n Do you think humans, like human society would develop as it did, or at all, if we couldn't\n\n1:37:58.700 --> 1:37:59.940\n see the stars?\n\n1:37:59.940 --> 1:38:03.060\n It would be drastically different.\n\n1:38:03.060 --> 1:38:05.260\n Just if it ever did develop.\n\n1:38:05.260 --> 1:38:12.540\n So I think some of the early developments, right, of like, you know, fire, you know.\n\n1:38:12.540 --> 1:38:16.020\n First of all, that atmosphere would be so hot, because, you know, if you have an opaque\n\n1:38:16.020 --> 1:38:22.260\n atmosphere, the temperature at the bottom is huge.\n\n1:38:22.260 --> 1:38:25.860\n So we would be very different beings to start with.\n\n1:38:25.860 --> 1:38:26.860\n We'd have very different.\n\n1:38:26.860 --> 1:38:29.420\n It could be cloudy in certain kinds of ways that you could still get.\n\n1:38:29.420 --> 1:38:30.420\n Okay.\n\n1:38:30.420 --> 1:38:32.380\n Think about like a greenhouse, right?\n\n1:38:32.380 --> 1:38:37.780\n A greenhouse is cloudy, effectively, but it's super hot.\n\n1:38:37.780 --> 1:38:38.780\n Yeah.\n\n1:38:38.780 --> 1:38:41.300\n It's hard to avoid having an atmosphere.\n\n1:38:41.300 --> 1:38:44.620\n If you have an opaque atmosphere, it's hard to, right.\n\n1:38:44.620 --> 1:38:46.580\n Venus is a great example, right?\n\n1:38:46.580 --> 1:38:52.940\n Venus is, I don't remember exactly how many degrees, but it's hundreds in Celsius, right?\n\n1:38:52.940 --> 1:38:55.460\n It's not a hundred, it's hundreds.\n\n1:38:55.460 --> 1:38:59.740\n Even though it's only a little bit closer to the sun, that temperature is entirely coming\n\n1:38:59.740 --> 1:39:01.820\n from the fact that the atmosphere is thick.\n\n1:39:01.820 --> 1:39:03.580\n So it's just a sauna of sorts.\n\n1:39:03.580 --> 1:39:04.580\n Yeah.\n\n1:39:04.580 --> 1:39:05.580\n Yeah.\n\n1:39:05.580 --> 1:39:08.740\n You go there, you know, you feel refreshed after you come back, you know.\n\n1:39:08.740 --> 1:39:13.060\n But if you stay there, I mean, so, okay, take that as an assumption.\n\n1:39:13.060 --> 1:39:15.500\n This is a philosophical question, not a biological one.\n\n1:39:15.500 --> 1:39:18.980\n So you have a life that develops under these extremely hot conditions.\n\n1:39:18.980 --> 1:39:19.980\n Yeah.\n\n1:39:19.980 --> 1:39:20.980\n So let's see.\n\n1:39:20.980 --> 1:39:28.620\n So much of the early evolution of mankind was driven by exploration, right?\n\n1:39:28.620 --> 1:39:37.060\n And the kind of interest in stars originated in part as a tool to guide that exploration,\n\n1:39:37.060 --> 1:39:38.060\n right?\n\n1:39:38.060 --> 1:39:44.420\n I mean, that in itself, I think would be a huge, you know, a huge differential in the\n\n1:39:44.420 --> 1:39:48.700\n way that we, you know, our evolution on this planet.\n\n1:39:48.700 --> 1:39:49.700\n Yeah.\n\n1:39:49.700 --> 1:39:51.560\n I mean, stars, that's brilliant.\n\n1:39:51.560 --> 1:39:59.360\n So even in that aspect, but even in further aspects, astronomy just shows up in basically\n\n1:39:59.360 --> 1:40:04.420\n every single development in the history of science up until the 20th century, it shows\n\n1:40:04.420 --> 1:40:05.500\n up.\n\n1:40:05.500 --> 1:40:10.340\n So I wonder without that, if we would have, if we would even get like calculus.\n\n1:40:10.340 --> 1:40:14.780\n Yeah, look, that's a great, I mean, that's a great point.\n\n1:40:14.780 --> 1:40:20.540\n Newton in part developed calculus because he was interested in understanding, explaining\n\n1:40:20.540 --> 1:40:22.580\n Kepler's laws, right?\n\n1:40:22.580 --> 1:40:29.300\n In general, that whole mechanistic understanding of the night sky, right, replacing a religious\n\n1:40:29.300 --> 1:40:34.220\n understanding where you interpret, you know, this is, you know, this whatever fire god\n\n1:40:34.220 --> 1:40:41.060\n riding his, you know, a little chariot across the sky, as opposed to, you know, this is\n\n1:40:41.060 --> 1:40:48.460\n some mechanistic set of laws that transformed humanity and arguably put us on the course\n\n1:40:48.460 --> 1:40:50.540\n that we're on today, right?\n\n1:40:50.540 --> 1:40:57.140\n The entirety of the last 400 years and the development of kind of our technological world\n\n1:40:57.140 --> 1:41:03.500\n that we live in today was sparked by that, right?\n\n1:41:03.500 --> 1:41:08.900\n Understanding an effectively, you know, a non secular view of the natural world and\n\n1:41:08.900 --> 1:41:15.860\n kind of saying, okay, this can be understood and if it can be understood, it can be utilized,\n\n1:41:15.860 --> 1:41:19.140\n we can create our own variants of this.\n\n1:41:19.140 --> 1:41:24.660\n Absolutely, we would be a very, very different species without astronomy.\n\n1:41:24.660 --> 1:41:29.100\n This I think extends beyond just astronomy, right?\n\n1:41:29.100 --> 1:41:35.180\n There are questions like why do we need to spend money on X, right?\n\n1:41:35.180 --> 1:41:39.860\n Where X can be anything like paleontology, like, right?\n\n1:41:39.860 --> 1:41:42.340\n The mating patterns of penguins.\n\n1:41:42.340 --> 1:41:46.460\n Yeah, that's like, that's right.\n\n1:41:46.460 --> 1:41:53.540\n I think, you know, there's a tremendous under appreciation for the usefulness of useless\n\n1:41:53.540 --> 1:41:54.540\n knowledge, right?\n\n1:41:54.540 --> 1:41:57.540\n I mean, that's brilliant.\n\n1:41:57.540 --> 1:42:02.820\n I didn't come up with this, this is a little book by the guy who started the Institute\n\n1:42:02.820 --> 1:42:10.500\n for Advanced Studies, but, you know, it's so true, so much of the electronics that are\n\n1:42:10.500 --> 1:42:13.900\n on this table, right, work on Maxwell's equations.\n\n1:42:13.900 --> 1:42:21.300\n Maxwell wasn't sitting around in the 1800s saying, you know, I hope one day, you know,\n\n1:42:21.300 --> 1:42:27.460\n we'll make, you know, a couple mics so, you know, a couple, you know, a couple guys can\n\n1:42:27.460 --> 1:42:30.780\n have this conversation, right?\n\n1:42:30.780 --> 1:42:38.820\n That wasn't at no point was that the motivation, and yet, you know, it gave us the world that\n\n1:42:38.820 --> 1:42:39.980\n we have today.\n\n1:42:39.980 --> 1:42:45.380\n The answer is if you are a purely pragmatic person, if you don't care at all about kind\n\n1:42:45.380 --> 1:42:53.780\n of the human condition, none of this, the answer is, you can tax it, right, like, useless\n\n1:42:53.780 --> 1:43:00.900\n things have created way more capital than useful things.\n\n1:43:00.900 --> 1:43:08.300\n And the sad thing, first of all, it's really important to think about, and it's brilliant\n\n1:43:08.300 --> 1:43:13.820\n in the following context, like Neil deGrasse Tyson has this book about the role of military\n\n1:43:13.820 --> 1:43:21.420\n based funding in the development of science, and then so much of technological breakthroughs\n\n1:43:21.420 --> 1:43:28.460\n in the 20th century had to do with humans working on different military things.\n\n1:43:28.460 --> 1:43:32.660\n And then the outcome of that had nothing to do with military, it had some military application,\n\n1:43:32.660 --> 1:43:36.820\n but their impact was much, much bigger than military.\n\n1:43:36.820 --> 1:43:41.600\n The splitting of the atom is a kind of a canonical example of this.\n\n1:43:41.600 --> 1:43:47.860\n We all know the tragedy that, you know, arises from splitting of the atom, and yet, you know,\n\n1:43:47.860 --> 1:43:55.420\n so much, I mean, the atom itself does not care for what purpose it is being split.\n\n1:43:55.420 --> 1:44:02.140\n So I wonder if we took the same amount of funding as we used for war and poured it into\n\n1:44:02.140 --> 1:44:06.980\n like totally seemingly useless things, like the mating patterns of penguins, we would\n\n1:44:06.980 --> 1:44:08.500\n get the internet anyway.\n\n1:44:08.500 --> 1:44:16.500\n I think so, I think so, and, you know, perhaps more of the internet would have penguins,\n\n1:44:16.500 --> 1:44:17.500\n you know.\n\n1:44:17.500 --> 1:44:23.420\n So we're both joking, but in some sense, like, I wonder, it's not the penguins, because penguins\n\n1:44:23.420 --> 1:44:32.900\n is more about sort of biology, but all useless kind of tinkering and all kinds of avenues,\n\n1:44:32.900 --> 1:44:40.160\n and also because military applications are often burdened by the secrecy required.\n\n1:44:40.160 --> 1:44:46.980\n So it's often like so much, the openness is lacking, and if we've learned anything for\n\n1:44:46.980 --> 1:44:52.580\n the last few decades is that when there's openness in science, that accelerates the\n\n1:44:52.580 --> 1:44:53.740\n development of science.\n\n1:44:53.740 --> 1:44:54.740\n That's right.\n\n1:44:54.740 --> 1:44:55.740\n That's true.\n\n1:44:55.740 --> 1:45:02.540\n That openness of science truly, you know, it benefits everybody, the notion that if,\n\n1:45:02.540 --> 1:45:07.260\n you know, I share my science with you, then you're going to catch up and like know the\n\n1:45:07.260 --> 1:45:08.900\n same thing.\n\n1:45:08.900 --> 1:45:16.180\n That is a short sighted viewpoint, because if you catch up and you open, you know, you\n\n1:45:16.180 --> 1:45:21.140\n discover something that puts me in a position to do the next step, right?\n\n1:45:21.140 --> 1:45:25.740\n So I absolutely agree with all of this.\n\n1:45:25.740 --> 1:45:32.740\n I mean, the kind of question of like military funding versus non military funding is obviously\n\n1:45:32.740 --> 1:45:39.820\n a complicated one, but at the end of the day, I think we have to get over the notion as\n\n1:45:39.820 --> 1:45:47.900\n a society that we are going to, you know, pay for this, and then we will get that, right?\n\n1:45:47.900 --> 1:45:53.260\n That's true if you're buying like, I don't know, toilet paper or something, right?\n\n1:45:53.260 --> 1:45:55.680\n It's just not true in the intellectual pursuit.\n\n1:45:55.680 --> 1:46:00.460\n That's not how it works, and sometimes it'll fail, right?\n\n1:46:00.460 --> 1:46:04.020\n Like sometimes, like a huge fraction of what I do, right?\n\n1:46:04.020 --> 1:46:07.620\n I come up with an idea, I think, oh, it's great, and then I work it out, it's totally\n\n1:46:07.620 --> 1:46:08.820\n not great, right?\n\n1:46:08.820 --> 1:46:10.700\n It fails immediately.\n\n1:46:10.700 --> 1:46:16.140\n Failure is not a sign that the initial pursuit was worthless, so failure is just part of\n\n1:46:16.140 --> 1:46:21.060\n this kind of this whole exploration thing, and we should fund more and more of this exploration,\n\n1:46:21.060 --> 1:46:22.060\n the variety of the exploration.\n\n1:46:22.060 --> 1:46:23.060\n That's right.\n\n1:46:23.060 --> 1:46:28.220\n I think it was Linus Pauling or somebody from, you know, that generation of scientists, you\n\n1:46:28.220 --> 1:46:33.460\n know, a good way to have good ideas is to have a lot of ideas.\n\n1:46:33.460 --> 1:46:34.460\n Yeah.\n\n1:46:34.460 --> 1:46:37.080\n So I think that's true.\n\n1:46:37.080 --> 1:46:42.100\n If you are conservative in your thinking, if you worry about proposing something that's\n\n1:46:42.100 --> 1:46:48.220\n going to fail and, oh, what if, you know, like, there's no science police that's going\n\n1:46:48.220 --> 1:46:54.060\n to come and arrest you for proposing the wrong thing, and, you know, it's also just like,\n\n1:46:54.060 --> 1:47:01.020\n why would you do science if you're afraid of, you know, taking that step?\n\n1:47:01.020 --> 1:47:07.140\n It'd be so much better to propose things that are plausible, that are interesting, and then\n\n1:47:07.140 --> 1:47:11.660\n for a fraction of them to be wrong than to just kind of, you know, make incremental progress\n\n1:47:11.660 --> 1:47:13.660\n all your life, right?\n\n1:47:13.660 --> 1:47:19.060\n Speaking of wild ideas, let me ask you about the thing we mentioned previously, which is\n\n1:47:19.060 --> 1:47:22.940\n this interstellar object Amuamua.\n\n1:47:22.940 --> 1:47:27.400\n Could it be space junk from a distant alien civilization?\n\n1:47:27.400 --> 1:47:33.940\n You can't immediately discount that by saying absolutely it cannot.\n\n1:47:33.940 --> 1:47:34.940\n Anything can be space junk.\n\n1:47:34.940 --> 1:47:41.300\n I mean, from that point of view, can any of the Kuiper Belt objects we see be space junk?\n\n1:47:41.300 --> 1:47:44.940\n Everything on the night sky can, in principle, be space junk.\n\n1:47:44.940 --> 1:47:49.700\n And Kuiper Belt would catch interstellar objects potentially and, like, force them into an\n\n1:47:49.700 --> 1:47:52.100\n orbit if they're, like, small enough?\n\n1:47:52.100 --> 1:47:57.300\n Not the Kuiper Belt itself, but you can imagine, like, Jupiter family comets being captured,\n\n1:47:57.300 --> 1:47:58.300\n you know.\n\n1:47:58.300 --> 1:48:00.840\n So you can actually capture things.\n\n1:48:00.840 --> 1:48:05.220\n It's even easier to do this very early in the solar system, like, early in the solar\n\n1:48:05.220 --> 1:48:09.420\n system's life while it's still in a cluster of stars.\n\n1:48:09.420 --> 1:48:15.700\n It's unavoidable that you capture debris, whether it be natural debris or unnatural\n\n1:48:15.700 --> 1:48:20.900\n debris, or just debris of some kind from other stars.\n\n1:48:20.900 --> 1:48:22.460\n It's like a daycare center, right?\n\n1:48:22.460 --> 1:48:25.700\n Like, everybody passes their infections on to other kids.\n\n1:48:25.700 --> 1:48:26.700\n Yeah.\n\n1:48:26.700 --> 1:48:31.940\n You know, Amuamua, there's been a lot of discussion about it, and there's been a lot of interest\n\n1:48:31.940 --> 1:48:35.140\n in this over, like, is it aliens or is it not?\n\n1:48:35.140 --> 1:48:39.460\n It's, like, if you just kind of look at the facts, like, what we know about it is it's\n\n1:48:39.460 --> 1:48:44.380\n kind of, like, a weird shape, and it also accelerated, you know?\n\n1:48:44.380 --> 1:48:45.380\n Right?\n\n1:48:45.380 --> 1:48:50.820\n Like, that's the two, those are the two interesting things about it.\n\n1:48:50.820 --> 1:49:02.460\n There are puzzles about it, and perhaps the most daring resolution to this puzzle is that\n\n1:49:02.460 --> 1:49:07.380\n it's not, you know, aliens or it's not, like, a rock, it's actually a piece of hydrogen\n\n1:49:07.380 --> 1:49:08.380\n ice.\n\n1:49:08.380 --> 1:49:09.380\n Right?\n\n1:49:09.380 --> 1:49:15.540\n So, this is a friend of mine, you know, Daryl Seligman, Greg Laughlin, came up with this\n\n1:49:15.540 --> 1:49:22.900\n idea that in giant molecular clouds that are just clouds of hydrogen, helium, gas that\n\n1:49:22.900 --> 1:49:31.700\n live throughout the galaxy, at their cores, you can condense ice to become these hydrogen,\n\n1:49:31.700 --> 1:49:33.860\n you know, icebergs, if you will.\n\n1:49:33.860 --> 1:49:41.620\n And then that explains many of the aspects of, in fact, I think that explains all of\n\n1:49:41.620 --> 1:49:48.260\n the Oumuamua mystery, how it becomes elongated, because basically the hydrogen ice sublimates\n\n1:49:48.260 --> 1:49:55.700\n and kind of like a bar of soap that, you know, slowly kind of elongates as you strip away\n\n1:49:55.700 --> 1:50:03.140\n the surface layers, how it was able to accelerate because of a jet that is produced from, you\n\n1:50:03.140 --> 1:50:06.820\n know, the hydrogen coming off of it, but you can't see it because it's hydrogen gas, like,\n\n1:50:06.820 --> 1:50:12.620\n all of this stuff kind of falls together nicely.\n\n1:50:12.620 --> 1:50:18.520\n I'm intrigued by that idea, truly, because it's like, if that's true, that's a new type\n\n1:50:18.520 --> 1:50:21.320\n of astrophysical object.\n\n1:50:21.320 --> 1:50:27.340\n And it would be produced by, what's the monster that produced it initially, that kind of object?\n\n1:50:27.340 --> 1:50:30.380\n So these giant molecular clouds, they're everywhere.\n\n1:50:30.380 --> 1:50:34.580\n I mean, the fact that they exist is not...\n\n1:50:34.580 --> 1:50:37.540\n Are they rogue clouds or are they part of like an Oort cloud?\n\n1:50:37.540 --> 1:50:38.540\n No, no, they're rogue clouds.\n\n1:50:38.540 --> 1:50:39.540\n They're just floating about?\n\n1:50:39.540 --> 1:50:47.260\n Yeah, so if you go, like, a lot of people imagine the galaxy as being a, you know, a\n\n1:50:47.260 --> 1:50:50.860\n bunch of stars, right, and they're just orbiting, right?\n\n1:50:50.860 --> 1:50:55.260\n But the truth is, if you fly between stars, you run into clouds.\n\n1:50:55.260 --> 1:50:59.480\n They don't have any large object that creates orbits, so they're just floating about?\n\n1:50:59.480 --> 1:51:00.480\n Just floating.\n\n1:51:00.480 --> 1:51:01.480\n But why are they floating together?\n\n1:51:01.480 --> 1:51:04.140\n Or they just float together for a time and not...\n\n1:51:04.140 --> 1:51:08.880\n Well, so these eventually become the nurseries of stars.\n\n1:51:08.880 --> 1:51:15.820\n So as they cool, they contract and, you know, then collapse into stars or into groups of\n\n1:51:15.820 --> 1:51:16.820\n stars.\n\n1:51:16.820 --> 1:51:24.380\n And some of them, the starless molecular clouds, according to the calculations that Daryl\n\n1:51:24.380 --> 1:51:31.180\n and Greg did, can create these, like, icicles of hydrogen ice.\n\n1:51:31.180 --> 1:51:35.980\n I wonder why they would be flying so fast, because they seem to be moving pretty fast\n\n1:51:35.980 --> 1:51:36.980\n at a quick pace.\n\n1:51:36.980 --> 1:51:37.980\n You mean Oumuamua?\n\n1:51:37.980 --> 1:51:38.980\n Oumuamua, yeah.\n\n1:51:38.980 --> 1:51:41.500\n Oh, that's just because of the acceleration due to the sun.\n\n1:51:41.500 --> 1:51:48.220\n If you stop, it's like, take something really far away, let it go, and the sun is here.\n\n1:51:48.220 --> 1:51:52.980\n By the time it comes close to the sun, right, it's moving pretty fast.\n\n1:51:52.980 --> 1:51:59.060\n So that's an attractive explanation, I think, not so much because it's cool, but it makes\n\n1:51:59.060 --> 1:52:06.980\n a clear prediction, right, of when Vera Rubin Observatory comes online next year or so.\n\n1:52:06.980 --> 1:52:11.020\n We will discover many, many more of these objects, right?\n\n1:52:11.020 --> 1:52:17.380\n And they have, so I like theories that are falsifiable.\n\n1:52:17.380 --> 1:52:19.380\n Not just testable, but falsifiable.\n\n1:52:19.380 --> 1:52:24.980\n It's good to have a falsifiable theory where you can say, that's not true.\n\n1:52:24.980 --> 1:52:29.820\n Aliens is one that's fundamentally difficult to say, no, that's not aliens.\n\n1:52:29.820 --> 1:52:35.900\n Well, the interesting thing to me, if you look at one alien civilization, and then we\n\n1:52:35.900 --> 1:52:43.380\n look at the things it produces, in terms of if we were to try to detect the alien civilization,\n\n1:52:43.380 --> 1:52:55.300\n there is like, say there's 10 billion aliens, there would probably be trillions of dumb\n\n1:52:55.300 --> 1:53:01.380\n drone type things produced by the aliens, and then be many, many, many more orders of\n\n1:53:01.380 --> 1:53:04.600\n magnitude of junk.\n\n1:53:04.600 --> 1:53:09.900\n So if you were to look for an alien civilization, in my mind, you would be looking for the junk.\n\n1:53:09.900 --> 1:53:12.340\n That's the more efficient thing to look for.\n\n1:53:12.340 --> 1:53:19.100\n So I'm not saying Oumuamua has any characteristics of space junk, but it kind of opened my eyes\n\n1:53:19.100 --> 1:53:25.520\n to the idea that we shouldn't necessarily be looking to the queen of the ant colony.\n\n1:53:25.520 --> 1:53:32.020\n We should be looking at, I don't know, I don't know, traces of alien life that doesn't look\n\n1:53:32.020 --> 1:53:35.180\n intelligent in any way, may not even look like life.\n\n1:53:35.180 --> 1:53:36.380\n It could be just garbage.\n\n1:53:36.380 --> 1:53:39.660\n We should be looking for garbage.\n\n1:53:39.660 --> 1:53:40.660\n Just generically.\n\n1:53:40.660 --> 1:53:47.420\n Well, garbage that's producible by unnatural forces.\n\n1:53:47.420 --> 1:53:53.160\n For me at least, that was kind of interesting, because if you have a successful alien civilization,\n\n1:53:53.160 --> 1:53:57.180\n that we will be producing many more orders of magnitude of junk, and that would be easier\n\n1:53:57.180 --> 1:53:58.500\n potentially to detect.\n\n1:53:58.500 --> 1:54:02.260\n Well, so you have to produce the junk, but you have to also launch it.\n\n1:54:02.260 --> 1:54:05.620\n So this is the, this is where, I mean, let's, let's imagine.\n\n1:54:05.620 --> 1:54:06.620\n Garbage disposal.\n\n1:54:06.620 --> 1:54:07.620\n Yeah.\n\n1:54:07.620 --> 1:54:13.100\n But let's imagine we are a successful civilization that, you know, has made it to space.\n\n1:54:13.100 --> 1:54:15.420\n We clearly have, right?\n\n1:54:15.420 --> 1:54:20.620\n And yes, we're in the infancy of that pursuit, but, you know, we've launched, I don't know\n\n1:54:20.620 --> 1:54:24.000\n how many satellites.\n\n1:54:24.000 --> 1:54:29.220\n If you count GPS satellites, it must be at least thousands.\n\n1:54:29.220 --> 1:54:30.220\n It's certainly thousands.\n\n1:54:30.220 --> 1:54:32.460\n I don't know if it's over 10,000, but it's on that order.\n\n1:54:32.460 --> 1:54:35.000\n But it's on that, like a large order of magnitude.\n\n1:54:35.000 --> 1:54:39.500\n How many of the things that we've launched will ever leave the solar system?\n\n1:54:39.500 --> 1:54:40.500\n I think two.\n\n1:54:40.500 --> 1:54:41.500\n Two so far.\n\n1:54:41.500 --> 1:54:46.940\n Well, maybe the Voyager, the Voyager 1, Voyager 2, I don't know if the Pioneer.\n\n1:54:46.940 --> 1:54:47.940\n So maybe three.\n\n1:54:47.940 --> 1:54:52.140\n Oh, there's also a Tesla Roadster out there.\n\n1:54:52.140 --> 1:54:54.180\n That one, it will never leave the solar system.\n\n1:54:54.180 --> 1:54:57.420\n It'll just, I think that one will eventually collide with Mars.\n\n1:54:57.420 --> 1:55:02.500\n That can be SpaceX's first Mars destination.\n\n1:55:02.500 --> 1:55:08.460\n But look, so there's an energetic cost to interstellar travel, which is really hard\n\n1:55:08.460 --> 1:55:09.740\n to overcome.\n\n1:55:09.740 --> 1:55:15.500\n And when we think about, you know, generically, what do we look for in an alien civilization,\n\n1:55:15.500 --> 1:55:20.300\n oftentimes we tend to imagine that the thing you look for is the thing that we're doing\n\n1:55:20.300 --> 1:55:21.300\n right now.\n\n1:55:21.300 --> 1:55:22.300\n Yeah.\n\n1:55:22.300 --> 1:55:23.300\n Right?\n\n1:55:23.300 --> 1:55:28.700\n So I think that, you know, if I look at the future, right, and for a while, like, okay,\n\n1:55:28.700 --> 1:55:33.340\n if aliens are out there, they must be broadcasting in radio, right?\n\n1:55:33.340 --> 1:55:41.260\n That radio, you know, the amount that we broadcast in radio has diminished tremendously in the\n\n1:55:41.260 --> 1:55:43.100\n last 50 years.\n\n1:55:43.100 --> 1:55:46.820\n But we're doing a lot more computation, right?\n\n1:55:46.820 --> 1:55:49.380\n What are the signs of computation?\n\n1:55:49.380 --> 1:55:53.540\n Like that's a good, that's an interesting question to ask, right?\n\n1:55:53.540 --> 1:55:58.820\n Where I don't know, I think something on the order of a few percent of the entire electrical\n\n1:55:58.820 --> 1:56:03.620\n grid last year went to mining Bitcoin, right?\n\n1:56:03.620 --> 1:56:04.620\n You know,\n\n1:56:04.620 --> 1:56:09.820\n Yeah, there could be a lot of in the future, different consequences of the computation,\n\n1:56:09.820 --> 1:56:14.780\n which I mean, I'm biased, but it could be robotics, it could be artificial intelligence.\n\n1:56:14.780 --> 1:56:22.580\n So we may be looking for intelligent looking objects, like that's what I meant by probes,\n\n1:56:22.580 --> 1:56:25.460\n like things that move in kind of artificial ways.\n\n1:56:25.460 --> 1:56:29.940\n But the emergence of AI is not an if, right?\n\n1:56:29.940 --> 1:56:33.800\n It's happening right in front of our eyes.\n\n1:56:33.800 --> 1:56:39.860\n And the energetic costs associated with that are becoming, you know, a tangible problem.\n\n1:56:39.860 --> 1:56:45.780\n So I think, you know, if you imagine kind of extrapolating that into the future, right?\n\n1:56:45.780 --> 1:56:50.680\n What are the, you know, what becomes the bottleneck, right?\n\n1:56:50.680 --> 1:56:57.340\n The bottleneck might be powering, you know, powering the AI, broadly speaking, not one\n\n1:56:57.340 --> 1:57:01.180\n AI, but powering that entire AI ecosystem, right?\n\n1:57:01.180 --> 1:57:08.380\n So I don't know, I think, you know, space junk is an is kind of, it's an interesting\n\n1:57:08.380 --> 1:57:14.100\n idea, but it's heavily influenced by like sci fi of 1950s, where by 2020, we're all\n\n1:57:14.100 --> 1:57:17.440\n like, flying to the moon.\n\n1:57:17.440 --> 1:57:23.900\n And so we produce a lot of space junk, I'm not sure if that's the pathway that alien\n\n1:57:23.900 --> 1:57:28.780\n civilizations take, I've also never seen an alien civilization.\n\n1:57:28.780 --> 1:57:29.780\n That's true.\n\n1:57:29.780 --> 1:57:36.140\n But if your theory of chill turns out to be true, and then we don't, you know, we don't\n\n1:57:36.140 --> 1:57:41.740\n necessarily explore, we seize the exploration phase of a, like alien civilizations quickly\n\n1:57:41.740 --> 1:57:49.700\n seize the exploration phase of their, of their efforts, then, then perhaps they'll just be\n\n1:57:49.700 --> 1:57:56.020\n chilling in a particular space, expanding slowly, but then using up a lot of resources\n\n1:57:56.020 --> 1:58:00.660\n and then have to have a lot of garbage disposal that sends stuff out.\n\n1:58:00.660 --> 1:58:06.780\n And the other, you know, the other idea was that it could be a relay that you'll almost\n\n1:58:06.780 --> 1:58:12.220\n have like these GPS like markers, these sent throughout, which I think is kind of interesting.\n\n1:58:12.220 --> 1:58:23.700\n It's similar to this probe idea of sending a large number of probes out to measure gravitational\n\n1:58:23.700 --> 1:58:29.060\n to measure basically, yeah, the gravitational field, essentially, I mean, a lot of people\n\n1:58:29.060 --> 1:58:33.180\n at Caltech or at MIT are trying to measure gravitational fields.\n\n1:58:33.180 --> 1:58:41.100\n And there's, there's a lot of ideas of sending stuff out there that accurately measures those\n\n1:58:41.100 --> 1:58:47.060\n gravitational fields to have a greater understanding of the early universe.\n\n1:58:47.060 --> 1:58:52.300\n But then you might realize that communication through gravitation, through gravity is actually\n\n1:58:52.300 --> 1:58:56.260\n much more effective than, than radio waves, for example, something like that.\n\n1:58:56.260 --> 1:59:03.020\n And then you send out, I mean, okay, if you're an alien civilization that's able to have\n\n1:59:03.020 --> 1:59:09.660\n gigantic masses, like basically, we're getting there as a, as a civilization, no, we're not\n\n1:59:09.660 --> 1:59:10.660\n not even close.\n\n1:59:10.660 --> 1:59:18.460\n Well, I mean, I mean, like be able to sort of play with black holes, that kind of thing.\n\n1:59:18.460 --> 1:59:23.980\n So we're talking about a whole nother order of magnitude of masses, then it may be very\n\n1:59:23.980 --> 1:59:27.020\n effective to send signals via gravitational waves.\n\n1:59:27.020 --> 1:59:33.940\n I actually my sense is that all of these things are genuinely difficult to predict, you know,\n\n1:59:33.940 --> 1:59:38.340\n and I don't mean like, to kind of shy away, I just I really mean, if you think if you\n\n1:59:38.340 --> 1:59:46.900\n take imagination of what the future will look like from, you know, 500 years ago, right?\n\n1:59:46.900 --> 1:59:51.460\n It's just, it is so hard to conceive of the impossible, right?\n\n1:59:51.460 --> 1:59:58.780\n So it's, it's almost like, you know, it's almost limiting to try and imagine things\n\n1:59:58.780 --> 2:00:03.460\n that are an order of magnitude, you know, or two orders of magnitude ahead in terms\n\n2:00:03.460 --> 2:00:10.140\n of progress, just because, you know, you mentioned cars before, you know, if you were to ask\n\n2:00:10.140 --> 2:00:15.380\n people what they wanted in 1870, it's faster buggies, right?\n\n2:00:15.380 --> 2:00:23.700\n So so I think the whole like, kind of, you know, alien conversation inevitably gets gets\n\n2:00:23.700 --> 2:00:31.820\n limited by by our entire kind of collective astrophysical lack of imagination.\n\n2:00:31.820 --> 2:00:38.200\n So to push back a little bit, I find that it's really interesting to talk about these\n\n2:00:38.200 --> 2:00:43.620\n wild ideas about the future, whether it's aliens, whether it's AI, with brilliant people\n\n2:00:43.620 --> 2:00:49.100\n like yourself, who are focused on very particular tools of science, we have today, to solve\n\n2:00:49.100 --> 2:00:52.380\n very particular, like rigorous scientific questions.\n\n2:00:52.380 --> 2:00:56.860\n And it's almost like putting on this wild dreamy hat, like some percent of the time\n\n2:00:56.860 --> 2:01:00.460\n and say, like, what are like, what would alien civilizations look like?\n\n2:01:00.460 --> 2:01:03.260\n What would alien trash look like?\n\n2:01:03.260 --> 2:01:09.620\n Well, what would our own civilization that sends out trillions of AI systems out there,\n\n2:01:09.620 --> 2:01:13.580\n like how 9000, but 10,000 out there, what would that look like?\n\n2:01:13.580 --> 2:01:18.220\n And you're right, any one prediction is probably going to be horrendously wrong.\n\n2:01:18.220 --> 2:01:22.940\n But there's something about creating these kind of wild predictions that kind of opens\n\n2:01:22.940 --> 2:01:23.940\n up.\n\n2:01:23.940 --> 2:01:26.620\n No, there's a huge magnetism to it, right?\n\n2:01:26.620 --> 2:01:35.120\n And some of some of it, you know, I mean, some of the Jules Verne novels did a phenomenal\n\n2:01:35.120 --> 2:01:38.700\n job predicting the future, right?\n\n2:01:38.700 --> 2:01:42.360\n That actually was a great example of what you're talking about, like allowing your imagination\n\n2:01:42.360 --> 2:01:44.500\n to run free.\n\n2:01:44.500 --> 2:01:49.200\n I mean, I just hope, I just hope there's dragons.\n\n2:01:49.200 --> 2:01:54.960\n That's like, I love dragons are the best.\n\n2:01:54.960 --> 2:01:59.380\n But see, the cool thing about science fiction and these kinds of conversations, it doesn't\n\n2:01:59.380 --> 2:02:01.800\n just predict the future, I think.\n\n2:02:01.800 --> 2:02:05.940\n Some of these things will create the future.\n\n2:02:05.940 --> 2:02:12.700\n Taking the idea, the humans are amazing, like fake it till you make it.\n\n2:02:12.700 --> 2:02:18.420\n Humans are really good at taking an idea that seems impossible at the time.\n\n2:02:18.420 --> 2:02:25.300\n And for any one individual human, that idea is like, it's like planting a seed that eventually\n\n2:02:25.300 --> 2:02:26.300\n materializes itself.\n\n2:02:26.300 --> 2:02:27.300\n It's weird.\n\n2:02:27.300 --> 2:02:32.500\n It's weird how science fiction can create science fiction, it drives the science.\n\n2:02:32.500 --> 2:02:43.460\n I agree with you, and I think in this regard, you know, I'm like a sucker for sci fi.\n\n2:02:43.460 --> 2:02:50.340\n It's all I listen to like now when I run and some of it is completely implausible, right?\n\n2:02:50.340 --> 2:02:54.620\n And it's just like, I don't care.\n\n2:02:54.620 --> 2:03:01.380\n It's both entertaining and, you know, it's just like, it's imagination.\n\n2:03:01.380 --> 2:03:05.580\n You know about the black clouds book, I think this is by Fred Hoyle.\n\n2:03:05.580 --> 2:03:09.380\n This is like, this has great connections with sort of a lot of the advancements that are\n\n2:03:09.380 --> 2:03:16.060\n happening in NLP right now, right, with transformer models and so on.\n\n2:03:16.060 --> 2:03:21.380\n But you know, it's this black cloud shows up in the solar system and then, you know,\n\n2:03:21.380 --> 2:03:26.140\n people try to send radio and then it learns to talk back at you, you know.\n\n2:03:26.140 --> 2:03:30.700\n So anyway, we don't have to talk at all about it, but it's just, it's something worth checking\n\n2:03:30.700 --> 2:03:31.700\n out.\n\n2:03:31.700 --> 2:03:36.700\n With that, on the alien front, with the black cloud, to me, exactly, on the NLP front, and\n\n2:03:36.700 --> 2:03:39.980\n also just explainability of AI, it's fascinating.\n\n2:03:39.980 --> 2:03:44.660\n Just the very question, Stephen Wolfram looked at this with the movie Arrival, it's like,\n\n2:03:44.660 --> 2:03:47.940\n what would be the common language that we would discover?\n\n2:03:47.940 --> 2:03:51.740\n The reason that's really interesting to me is we have aliens here on earth now.\n\n2:03:51.740 --> 2:03:52.740\n Japanese.\n\n2:03:52.740 --> 2:03:53.740\n Japanese, oh yeah.\n\n2:03:53.740 --> 2:03:54.740\n Japanese is the obvious answer.\n\n2:03:54.740 --> 2:03:59.900\n Japanese, yeah, that would be the common, maybe it would be music, actually.\n\n2:03:59.900 --> 2:04:00.900\n That's more likely.\n\n2:04:00.900 --> 2:04:01.900\n It wouldn't be a language.\n\n2:04:01.900 --> 2:04:04.020\n It would be art that they would communicate.\n\n2:04:04.020 --> 2:04:09.900\n But you know, I do believe that we have, I'm with Stephen Wolfram on this a little bit,\n\n2:04:09.900 --> 2:04:16.540\n that to me, computation, like programs we write, that, you know, that they're kind of\n\n2:04:16.540 --> 2:04:21.300\n intelligent creatures and I feel like we haven't found the common language to talk with them.\n\n2:04:21.300 --> 2:04:28.820\n Like our little creations that are artificial are not born with whatever that innate thing\n\n2:04:28.820 --> 2:04:34.900\n that produces language with us and like, coming up with mechanisms for communicating with\n\n2:04:34.900 --> 2:04:42.540\n them is an effort that feels like it will produce some incredible discoveries.\n\n2:04:42.540 --> 2:04:47.820\n You can even think of, if you think that math has discovered, mathematics in itself is a\n\n2:04:47.820 --> 2:04:48.820\n kind of...\n\n2:04:48.820 --> 2:04:54.060\n Oh yeah, it's an innate construction of the world we live in.\n\n2:04:54.060 --> 2:05:05.620\n I think we are, you know, part of the way there because pre 1950, right, computers were\n\n2:05:05.620 --> 2:05:09.300\n human beings that would carry out arithmetic, right?\n\n2:05:09.300 --> 2:05:17.340\n And I think it was Ulam who worked in Los Alamos at the time, like towards the end of\n\n2:05:17.340 --> 2:05:23.200\n the second world war, wrote something about how, you know, in the future, right, computers\n\n2:05:23.200 --> 2:05:31.240\n will not be just arithmetic tool, but will be truly an interactive, you know, thing with\n\n2:05:31.240 --> 2:05:34.380\n which you could do experiments, right?\n\n2:05:34.380 --> 2:05:40.340\n At the time, the notion of doing an experiment, not like in the lab with some beakers, but\n\n2:05:40.340 --> 2:05:47.660\n an experiment on a computer, designing an experiment, a numerical experiment was a new\n\n2:05:47.660 --> 2:05:48.660\n one.\n\n2:05:48.660 --> 2:05:55.580\n Like, you know, 70% of what I do is I design, you know, I write code, terrible code to be\n\n2:05:55.580 --> 2:06:04.340\n clear, like, but, you know, I write code that creates an experiment, which is a simulation.\n\n2:06:04.340 --> 2:06:08.860\n So in that sense, I think we're beginning to interact with the computer in a way that\n\n2:06:08.860 --> 2:06:14.820\n you're saying, not as just a, you know, fancy calculator, not as just a, you know, call\n\n2:06:14.820 --> 2:06:23.740\n and request type of thing, but, you know, something that can generate insights that\n\n2:06:23.740 --> 2:06:29.340\n are otherwise completely unattainable, right there, unattainable by doing analytical mathematics.\n\n2:06:29.340 --> 2:06:30.340\n Yeah.\n\n2:06:30.340 --> 2:06:38.100\n And there's, with AlphaFold 2, we're now starting to crack open biology, so being able to simulate\n\n2:06:38.100 --> 2:06:43.240\n at first trivial biological systems and hopefully down the line, complex biological systems.\n\n2:06:43.240 --> 2:06:49.380\n My hope is to be able to simulate psychological, like sociological systems, like humans.\n\n2:06:49.380 --> 2:06:57.180\n I've, you know, a large part of my work at MIT was on autonomous vehicles, and the fascinating\n\n2:06:57.180 --> 2:07:03.220\n thing to me was about pedestrians, human pedestrians interacting with autonomous vehicles and simulating\n\n2:07:03.220 --> 2:07:07.980\n those systems without murdering humans would be very useful, but nevertheless is exceptionally\n\n2:07:07.980 --> 2:07:08.980\n difficult.\n\n2:07:08.980 --> 2:07:09.980\n Yeah, I would say so.\n\n2:07:09.980 --> 2:07:11.980\n When is my Mustang gonna drive itself?\n\n2:07:11.980 --> 2:07:12.980\n Right.\n\n2:07:12.980 --> 2:07:16.700\n I'm not even joking, it's like, yeah.\n\n2:07:16.700 --> 2:07:23.300\n It turns out it's much more difficult than we imagined, and I suppose that's the kind\n\n2:07:23.300 --> 2:07:32.720\n of, the progress of science is just like, you know, going to Mars, it's probably going\n\n2:07:32.720 --> 2:07:35.500\n to turn out to be way more difficult than we imagined.\n\n2:07:35.500 --> 2:07:39.820\n Sending out probes to investigate Planet 9 at the edge of our solar system might turn\n\n2:07:39.820 --> 2:07:43.700\n out to be way more difficult than we imagined, but we do it anyway, and we figure it out\n\n2:07:43.700 --> 2:07:44.700\n in the end.\n\n2:07:44.700 --> 2:07:49.660\n It's actually, Mars is a great, I mean, going, sending humans to Mars is way more complicated\n\n2:07:49.660 --> 2:07:51.580\n than sending humans to the moon.\n\n2:07:51.580 --> 2:07:57.380\n You'd think, just like naively, both are in space, who cares, like, if you go there, why\n\n2:07:57.380 --> 2:08:05.500\n don't you go there, you know, just life support is an extremely expensive thing, yeah.\n\n2:08:05.500 --> 2:08:09.100\n There's a bunch of extra challenges, but I disagree with you, I would be one of the early\n\n2:08:09.100 --> 2:08:10.100\n people to go.\n\n2:08:10.100 --> 2:08:14.180\n I used to think not, I used to think I'd be one of the first maybe million to go once\n\n2:08:14.180 --> 2:08:18.820\n you have a little bit of a society, I think I'm upgrading myself to the first like 10,000.\n\n2:08:18.820 --> 2:08:22.000\n Yeah, that's right, front of the cabin.\n\n2:08:22.000 --> 2:08:30.020\n Not completely front, but like, it would be interesting to die, I'm okay with, death sucks,\n\n2:08:30.020 --> 2:08:34.160\n but I kind of like the idea of dying on Mars.\n\n2:08:34.160 --> 2:08:39.580\n Of all the places to die, I gotta say, in this regard, like, I don't wanna die on Mars.\n\n2:08:39.580 --> 2:08:40.580\n You don't?\n\n2:08:40.580 --> 2:08:45.220\n No, no, I would much rather die on Earth.\n\n2:08:45.220 --> 2:08:50.940\n I mean, death is fundamentally boring, right, like, death is a very boring experience, but\n\n2:08:50.940 --> 2:08:54.180\n I mean, I've never died before, so I don't know from first hand experience.\n\n2:08:54.180 --> 2:08:55.180\n As far as you know.\n\n2:08:55.180 --> 2:08:56.180\n Yeah.\n\n2:08:56.180 --> 2:08:57.780\n It could be reincarnation, all those kinds of things.\n\n2:08:57.780 --> 2:09:01.700\n So you mean, where would you die?\n\n2:09:01.700 --> 2:09:04.700\n If you had to choose?\n\n2:09:04.700 --> 2:09:13.420\n Oh, man, okay, so I would definitely, there's a question of who I'd wanna die with, I prefer\n\n2:09:13.420 --> 2:09:22.660\n not to die alone, but like, surrounded by family would be preferable, where I think\n\n2:09:22.660 --> 2:09:27.500\n Northern New Mexico, and I'm not even joking, like, this is not a random place, it's just\n\n2:09:27.500 --> 2:09:28.500\n like.\n\n2:09:28.500 --> 2:09:31.620\n Would that be your favorite place on Earth?\n\n2:09:31.620 --> 2:09:38.700\n Not necessarily, like, favorite place on Earth to reside, you know, indefinitely, but it\n\n2:09:38.700 --> 2:09:43.460\n is one of the most beautiful places I've ever been to.\n\n2:09:43.460 --> 2:09:49.540\n So you know, there's something, I don't know, there's something attractive about going,\n\n2:09:49.540 --> 2:09:50.540\n you know.\n\n2:09:50.540 --> 2:09:54.760\n Returning to nature in a beautiful place.\n\n2:09:54.760 --> 2:09:59.660\n Let me ask you about another aspect of your life that is full of beauty, music.\n\n2:09:59.660 --> 2:10:00.660\n Okay.\n\n2:10:00.660 --> 2:10:02.900\n You're a musician.\n\n2:10:02.900 --> 2:10:08.660\n The absurd question I have to ask, what is the greatest song of all time, objectively\n\n2:10:08.660 --> 2:10:09.660\n speaking?\n\n2:10:09.660 --> 2:10:10.820\n The greatest song of all time.\n\n2:10:10.820 --> 2:10:16.000\n I suppose that could change moment to moment, day to day, but if you were forced to answer\n\n2:10:16.000 --> 2:10:20.820\n for this particular moment in your life, that's something that pops to mind, this could be\n\n2:10:20.820 --> 2:10:25.060\n both philosophically, this could be technically as a musician, like what you enjoy, maybe\n\n2:10:25.060 --> 2:10:26.060\n lyrics.\n\n2:10:26.060 --> 2:10:32.580\n Lyrics is very important, so I would probably, it would be, my choice would be lyrics based.\n\n2:10:32.580 --> 2:10:37.380\n I don't want to answer in terms of just technical, you know, technical prowess.\n\n2:10:37.380 --> 2:10:41.540\n I think technical prowess is impressive, right?\n\n2:10:41.540 --> 2:10:44.940\n It's just like, it's impressive what can be done.\n\n2:10:44.940 --> 2:10:49.420\n I wouldn't place that into the category of the greatest music ever written.\n\n2:10:49.420 --> 2:10:57.420\n Some classical music that's written is undeniably beautiful, but I don't want to consider that\n\n2:10:57.420 --> 2:11:06.700\n category of music either, just because, you know, so if I have to limit the scope of this\n\n2:11:06.700 --> 2:11:13.240\n philosophical discussion to, you know, the kind of music that I listen to, you know,\n\n2:11:13.240 --> 2:11:18.660\n probably What's My Age Again by Blink 182, it's just, you know, it's a solid one.\n\n2:11:18.660 --> 2:11:21.740\n It's got, you know.\n\n2:11:21.740 --> 2:11:22.740\n Said nobody ever.\n\n2:11:22.740 --> 2:11:23.740\n That's a good song.\n\n2:11:23.740 --> 2:11:24.740\n I don't know if you're joking.\n\n2:11:24.740 --> 2:11:25.740\n No, no.\n\n2:11:25.740 --> 2:11:26.740\n I am joking.\n\n2:11:26.740 --> 2:11:29.740\n It's a good one, but it's, yeah, I mean.\n\n2:11:29.740 --> 2:11:32.860\n I was going to come back as a close second.\n\n2:11:32.860 --> 2:11:37.180\n What's My Age Again, oh, yeah.\n\n2:11:37.180 --> 2:11:44.780\n No, I mean, it would probably, you know, songwriting wise, I think The Beatles came pretty close\n\n2:11:44.780 --> 2:11:45.780\n to.\n\n2:11:45.780 --> 2:11:46.780\n Were they influential to you?\n\n2:11:46.780 --> 2:11:47.780\n Absolutely.\n\n2:11:47.780 --> 2:11:48.780\n Yeah.\n\n2:11:48.780 --> 2:11:49.780\n Yeah.\n\n2:11:49.780 --> 2:11:50.780\n Love The Beatles.\n\n2:11:50.780 --> 2:11:51.780\n I love The Beatles.\n\n2:11:51.780 --> 2:11:52.780\n Let it be yesterday.\n\n2:11:52.780 --> 2:11:53.780\n Yeah.\n\n2:11:53.780 --> 2:11:57.300\n Like, I think Strawberry Fields Forever is one.\n\n2:11:57.300 --> 2:12:00.260\n You know what one of my favorite Beatles songs is?\n\n2:12:00.260 --> 2:12:04.220\n It's, you know, In My Life, right?\n\n2:12:04.220 --> 2:12:09.300\n It's hard to imagine how, whatever, a 24 year old wrote that.\n\n2:12:09.300 --> 2:12:14.340\n It is one of the most introspective pieces of music ever.\n\n2:12:14.340 --> 2:12:20.740\n You know, I'm a huge Pink Floyd fan, and so I think, you know, if you were to, you can\n\n2:12:20.740 --> 2:12:27.380\n sort of look at the entire Dark Side of the Moon album as, you know, getting pretty close\n\n2:12:27.380 --> 2:12:32.660\n up there to the pinnacle of what, you know, can be created, so, you know, Time is a great\n\n2:12:32.660 --> 2:12:33.660\n song.\n\n2:12:33.660 --> 2:12:34.660\n Yeah.\n\n2:12:34.660 --> 2:12:35.660\n It's a great song.\n\n2:12:35.660 --> 2:12:42.380\n Just the entirety of just the instruments, the lyrics, the feeling created by a song,\n\n2:12:42.380 --> 2:12:46.860\n like Pink Floyd can create feelings.\n\n2:12:46.860 --> 2:12:52.420\n The entire experience, I mean, you have that with The Wall of just transporting you into\n\n2:12:52.420 --> 2:12:54.060\n another place.\n\n2:12:54.060 --> 2:12:58.220\n Songs don't, not many songs could do that as well.\n\n2:12:58.220 --> 2:13:00.660\n Not many artists can do that as well as Pink Floyd did.\n\n2:13:00.660 --> 2:13:06.580\n There are a lot of bands that you can kind of say, oh yeah, like if you take Blink 182,\n\n2:13:06.580 --> 2:13:07.580\n right?\n\n2:13:07.580 --> 2:13:13.740\n You have no idea, like if you are listening to sort of that type of pop punk for the first\n\n2:13:13.740 --> 2:13:20.100\n time, it's difficult to differentiate between Blink 182 and like Sum 41 and the thousand\n\n2:13:20.100 --> 2:13:25.780\n of other like lesser known bands that all sounded, they all had that sparkling production\n\n2:13:25.780 --> 2:13:32.020\n feel, they all kind of sounded the same, right?\n\n2:13:32.020 --> 2:13:38.180\n With Pink Floyd, it's hard to find another band that you're like, well, is this one Pink\n\n2:13:38.180 --> 2:13:39.180\n Floyd?\n\n2:13:39.180 --> 2:13:43.420\n Like you know when you're listening to Pink Floyd what you're listening to.\n\n2:13:43.420 --> 2:13:45.520\n The uniqueness, that's fascinating.\n\n2:13:45.520 --> 2:13:51.540\n You know, in the calculation of the greatest song in the greatest band of all time, you\n\n2:13:51.540 --> 2:13:56.580\n could probably, you could probably actually quantify this like scientifically, is like\n\n2:13:56.580 --> 2:14:01.900\n how unique, if you play different songs, how well are people able to recognize whether\n\n2:14:01.900 --> 2:14:03.660\n it's this band or not?\n\n2:14:03.660 --> 2:14:07.300\n And that, you know, that's probably a huge component to greatness.\n\n2:14:07.300 --> 2:14:10.620\n Like if the world would miss it if it was gone.\n\n2:14:10.620 --> 2:14:11.620\n Yes.\n\n2:14:11.620 --> 2:14:12.620\n Yes.\n\n2:14:12.620 --> 2:14:13.620\n So.\n\n2:14:13.620 --> 2:14:17.420\n But there's also the human story things, like I would say I would put Johnny Cash's cover\n\n2:14:17.420 --> 2:14:22.140\n of Hurt as one of the greatest songs of all time.\n\n2:14:22.140 --> 2:14:24.740\n And that has less to do with the song.\n\n2:14:24.740 --> 2:14:26.780\n But your interaction with it.\n\n2:14:26.780 --> 2:14:29.840\n Interaction with it, but also the human, the full story of the human.\n\n2:14:29.840 --> 2:14:34.500\n You're like, it's not just, if I just heard the song, I'd be like, okay.\n\n2:14:34.500 --> 2:14:40.360\n But if it's the full story of it, also the video component for that particular song.\n\n2:14:40.360 --> 2:14:43.980\n So like that, you can't discount the full experience of it.\n\n2:14:43.980 --> 2:14:44.980\n Absolutely.\n\n2:14:44.980 --> 2:14:52.900\n You know, I have no confusion about not, about being, you know, anywhere, you know, in that\n\n2:14:52.900 --> 2:15:01.180\n league, but I just like sometimes think about, you know, music that is being produced today\n\n2:15:01.180 --> 2:15:08.900\n feels oftentimes, it feels like kind of clothes, like clothes that you buy at like H&M and\n\n2:15:08.900 --> 2:15:12.980\n you wear it three times before they rip and you throw away.\n\n2:15:12.980 --> 2:15:18.760\n So like so much of it is, it's not bad, it's just kind of forgettable, right?\n\n2:15:18.760 --> 2:15:24.980\n Like the fact that we're talking about Pink Floyd in 2021 is in itself an interesting\n\n2:15:24.980 --> 2:15:26.500\n question.\n\n2:15:26.500 --> 2:15:28.300\n Why are we talking about Pink Floyd?\n\n2:15:28.300 --> 2:15:33.180\n And there's something unforgettable about them and unforgettable about the art that\n\n2:15:33.180 --> 2:15:34.420\n they created.\n\n2:15:34.420 --> 2:15:41.220\n That could be the markets that like, so Spotify has created this kind of market where the\n\n2:15:41.220 --> 2:15:46.460\n incentives for creating music that lasts is much lower because there's so much more music.\n\n2:15:46.460 --> 2:15:50.820\n You just want something that shines bright for a short amount of time, makes a lot of\n\n2:15:50.820 --> 2:15:51.820\n money and moves on.\n\n2:15:51.820 --> 2:15:54.980\n And I mean, the same thing you see with the news and all those kinds of things, we're\n\n2:15:54.980 --> 2:16:00.700\n just living in a shorter and shorter, shorter like a time scale in terms of our attention\n\n2:16:00.700 --> 2:16:01.860\n spans.\n\n2:16:01.860 --> 2:16:07.100\n And that, nevertheless, when we look at the long arc of history of music, perhaps there\n\n2:16:07.100 --> 2:16:12.580\n will be some songs from today that will last as much as Pink Floyd, we're just unable to\n\n2:16:12.580 --> 2:16:13.580\n see it.\n\n2:16:13.580 --> 2:16:14.580\n Yeah.\n\n2:16:14.580 --> 2:16:15.580\n Just the collected works of Nickelback.\n\n2:16:15.580 --> 2:16:16.580\n Exactly.\n\n2:16:16.580 --> 2:16:17.580\n You never know.\n\n2:16:17.580 --> 2:16:18.580\n You never know.\n\n2:16:18.580 --> 2:16:19.580\n Justin Bieber.\n\n2:16:19.580 --> 2:16:20.580\n It could be a contender.\n\n2:16:20.580 --> 2:16:24.140\n I've recently started listening to Justin Bieber just to understand what people are\n\n2:16:24.140 --> 2:16:25.140\n talking about.\n\n2:16:25.140 --> 2:16:28.140\n And I'll just keep my comments to myself on that one.\n\n2:16:28.140 --> 2:16:29.940\n It's too good to explain in words.\n\n2:16:29.940 --> 2:16:35.780\n The words cannot capture the greatness that is the Biebs.\n\n2:16:35.780 --> 2:16:44.180\n You as a musician, so you write your own music, you play guitar, you sing.\n\n2:16:44.180 --> 2:16:49.100\n Maybe can you give an overview of the role music has played in your life?\n\n2:16:49.100 --> 2:16:52.680\n You're one of the, you're a world class scientist.\n\n2:16:52.680 --> 2:17:01.500\n And so it's kind of fascinating to see somebody in your position who is also a great musician\n\n2:17:01.500 --> 2:17:04.500\n and still loves playing music.\n\n2:17:04.500 --> 2:17:05.500\n Yeah.\n\n2:17:05.500 --> 2:17:06.500\n Well, I wouldn't call myself a great musician.\n\n2:17:06.500 --> 2:17:07.500\n I'm like, you know.\n\n2:17:07.500 --> 2:17:08.500\n One of the best of all time.\n\n2:17:08.500 --> 2:17:09.500\n Yeah.\n\n2:17:09.500 --> 2:17:10.500\n That's right.\n\n2:17:10.500 --> 2:17:15.940\n Like we were saying offline, confidence is like the most essential thing about being\n\n2:17:15.940 --> 2:17:16.940\n a rock star.\n\n2:17:16.940 --> 2:17:17.940\n That's right.\n\n2:17:17.940 --> 2:17:18.940\n Exactly.\n\n2:17:18.940 --> 2:17:20.620\n It's the confidence and kind of like moodiness, right?\n\n2:17:20.620 --> 2:17:21.620\n Yeah.\n\n2:17:21.620 --> 2:17:22.620\n Yeah.\n\n2:17:22.620 --> 2:17:31.180\n Look, I mean, music plays an absolutely essential role in everything I do because I lose, if\n\n2:17:31.180 --> 2:17:38.220\n I stop playing for one reason or another, say I'm traveling, I notably lose creativity\n\n2:17:38.220 --> 2:17:41.140\n in every other aspect of my life, right?\n\n2:17:41.140 --> 2:17:48.540\n There's something, I don't view, you know, playing music as a separate endeavor from\n\n2:17:48.540 --> 2:17:50.460\n doing science or doing whatever.\n\n2:17:50.460 --> 2:18:01.240\n It's all part of that same creative thing, which is distinct from, I don't know, pressing\n\n2:18:01.240 --> 2:18:02.660\n a button or like, you know.\n\n2:18:02.660 --> 2:18:06.020\n So it's not a break from science, it's a part of your science.\n\n2:18:06.020 --> 2:18:12.860\n Absolutely, it's a part of, I would say, you know, it's a thing that enables the science,\n\n2:18:12.860 --> 2:18:13.860\n right?\n\n2:18:13.860 --> 2:18:19.380\n The science would, you know, suck even more than it does already without the music.\n\n2:18:19.380 --> 2:18:23.300\n And that means like the creating of the writing of the music or is it just even playing other\n\n2:18:23.300 --> 2:18:24.300\n people's stuff?\n\n2:18:24.300 --> 2:18:26.340\n Is it the whole of it?\n\n2:18:26.340 --> 2:18:27.340\n Yeah.\n\n2:18:27.340 --> 2:18:28.340\n It's definitely both.\n\n2:18:28.340 --> 2:18:29.340\n Yeah.\n\n2:18:29.340 --> 2:18:36.940\n And also just, you know, I love to play guitar, I love to sing, you know.\n\n2:18:36.940 --> 2:18:44.220\n My wife tolerates my screeching singing, you know, and even kind of likes it.\n\n2:18:44.220 --> 2:18:46.820\n Yeah, so people should check out your stuff.\n\n2:18:46.820 --> 2:18:49.960\n You have a great voice, so I love your stuff.\n\n2:18:49.960 --> 2:18:57.920\n Is there something, you're super busy, is there something you can say about practicing\n\n2:18:57.920 --> 2:19:03.680\n for musicians, for guitar, you're also in a band, so like that whole, how you can manage\n\n2:19:03.680 --> 2:19:04.680\n that?\n\n2:19:04.680 --> 2:19:09.980\n Is there some tricks, is there some hacks to being a lifelong musician while being like\n\n2:19:09.980 --> 2:19:11.140\n super busy?\n\n2:19:11.140 --> 2:19:19.980\n So I would say, you know, the way that I optimize my life is I try to do, you know, the thing\n\n2:19:19.980 --> 2:19:26.140\n that I'm passionate about in a moment and put that at the top of the priority list.\n\n2:19:26.140 --> 2:19:30.740\n There are moments when, you know, you just, you feel inspired to play music and if you're\n\n2:19:30.740 --> 2:19:35.340\n in the middle of something, if you can avoid, if that can be put on hold, just do it, right?\n\n2:19:35.340 --> 2:19:43.020\n There are times when you get inspired about something scientific, you know, I do my best\n\n2:19:43.020 --> 2:19:51.260\n to drop everything, go into that, you know, mode of, that isolated mode and execute upon\n\n2:19:51.260 --> 2:19:52.260\n that.\n\n2:19:52.260 --> 2:19:57.000\n It's a chaotic, you know, I think I have a pretty chaotic lifestyle where I'm always\n\n2:19:57.000 --> 2:20:03.580\n doing kind of multiple things and jumping between what I'm doing.\n\n2:20:03.580 --> 2:20:13.020\n But at the end of the day, it's not like, you know, those moments of inspiration are\n\n2:20:13.020 --> 2:20:14.780\n actually kind of rare, right?\n\n2:20:14.780 --> 2:20:21.740\n Like most of the time, all of us are just doing kind of, doing the stuff that needs\n\n2:20:21.740 --> 2:20:23.040\n to get done.\n\n2:20:23.040 --> 2:20:29.740\n If you do the disservice to yourself of saying, oh, I'm inspired to, you know, do this calculation,\n\n2:20:29.740 --> 2:20:37.580\n figure this out, but I've got to answer email or just like do something silly, you know,\n\n2:20:37.580 --> 2:20:40.940\n that is nothing more than disservice.\n\n2:20:40.940 --> 2:20:48.500\n And also, like I have some social media presence, but I mostly stay off of, you know, social\n\n2:20:48.500 --> 2:20:55.460\n media to, you know, just frankly, cause like, I don't kind of, I don't enjoy the mental\n\n2:20:55.460 --> 2:20:57.500\n cycles that it, that it takes over.\n\n2:20:57.500 --> 2:21:03.940\n Yeah, it robs you of that, the, yeah, those precious moments that could be filled with\n\n2:21:03.940 --> 2:21:08.220\n inspiration in your, in your other pursuits.\n\n2:21:08.220 --> 2:21:12.160\n But there's something to, maybe you and I are different in this, like I tried to play\n\n2:21:12.160 --> 2:21:20.420\n at least 10 minutes of guitar every day, like almost on the technical side, like keeping\n\n2:21:20.420 --> 2:21:27.420\n that base of basic competence going.\n\n2:21:27.420 --> 2:21:31.500\n And I mean, the same way like writers will get in front of a paper no matter what, that\n\n2:21:31.500 --> 2:21:38.980\n kind of thing, it just feels like that for my life has been essential to the daily ritual\n\n2:21:38.980 --> 2:21:39.980\n of it.\n\n2:21:39.980 --> 2:21:44.220\n Why does days turn into weeks, weeks turn into months, and you haven't played guitar\n\n2:21:44.220 --> 2:21:45.220\n for months?\n\n2:21:45.220 --> 2:21:47.500\n No, no, I, I, I understand.\n\n2:21:47.500 --> 2:21:53.180\n For me, I think it's, it's been like, if we have a gig coming up, we'll definitely\n\n2:21:53.180 --> 2:21:54.180\n You need deadlines.\n\n2:21:54.180 --> 2:21:55.180\n Yeah, yeah, that's right.\n\n2:21:55.180 --> 2:22:03.060\n No, like we, we will, we will sharpen up definitely, you know, especially coming up to a gig.\n\n2:22:03.060 --> 2:22:06.660\n It's like, you know, we're not trying to make money with this.\n\n2:22:06.660 --> 2:22:13.540\n This is like, just for the, for that satisfaction of doing something and doing something well,\n\n2:22:13.540 --> 2:22:15.300\n right?\n\n2:22:15.300 --> 2:22:22.900\n But overall, I would say most, I play guitar most days, most days.\n\n2:22:22.900 --> 2:22:29.980\n And you know, when I put kids to sleep, I play guitar, you know, with them and we like,\n\n2:22:29.980 --> 2:22:35.460\n just make up random songs about, you know, about our cat or something, you know, like\n\n2:22:35.460 --> 2:22:39.060\n we just do kind of random stuff.\n\n2:22:39.060 --> 2:22:41.780\n But you know, music is always involved in that process.\n\n2:22:41.780 --> 2:22:43.340\n Yeah, keeping it fun.\n\n2:22:43.340 --> 2:22:44.460\n You have Russian roots?\n\n2:22:44.460 --> 2:22:45.460\n I sure do.\n\n2:22:45.460 --> 2:22:46.460\n Were you born in Russia?\n\n2:22:46.460 --> 2:22:47.460\n I was.\n\n2:22:47.460 --> 2:22:48.460\n Yeah.\n\n2:22:48.460 --> 2:22:49.460\n When did you come here?\n\n2:22:49.460 --> 2:22:55.300\n So, I came to the US in very, the very end of 99.\n\n2:22:55.300 --> 2:22:59.880\n But so I was like, almost 14 years old.\n\n2:22:59.880 --> 2:23:03.360\n But along the way, we spent six years in Japan.\n\n2:23:03.360 --> 2:23:10.620\n So like, we moved from Russia to Japan in 94, and then to the US in 99.\n\n2:23:10.620 --> 2:23:14.220\n So did like elementary school, middle school in Japan.\n\n2:23:14.220 --> 2:23:16.620\n So elementary school in Japan.\n\n2:23:16.620 --> 2:23:17.620\n Yeah.\n\n2:23:17.620 --> 2:23:19.220\n So, that's interesting, dad.\n\n2:23:19.220 --> 2:23:20.220\n Do you still speak Russian?\n\n2:23:20.220 --> 2:23:21.220\n Sure.\n\n2:23:21.220 --> 2:23:22.220\n Okay.\n\n2:23:22.220 --> 2:23:23.220\n Ты по русски говоришь?\n\n2:23:23.220 --> 2:23:24.220\n Да, конечно.\n\n2:23:24.220 --> 2:23:31.660\n Okay, maybe I'll, let me ask you, in Russian, что ты помнишь о России?\n\n2:23:31.660 --> 2:23:33.660\n It'd be interesting to hear you speak Russian.\n\n2:23:33.660 --> 2:23:38.100\n В общем, в целом, я помню, то есть мне было восемь, когда\n\n2:23:38.100 --> 2:23:47.140\n мы уехали, и, конечно, как сказать, помню в первом\n\n2:23:47.140 --> 2:23:52.700\n приближении всё, включая вот переход, там, 91, 92 год,\n\n2:23:52.700 --> 2:23:56.700\n вот этот вот, вот этот турбулентный период, и ещё, естественно,\n\n2:23:56.700 --> 2:23:57.700\n 93.\n\n2:23:57.700 --> 2:24:03.700\n То есть ещё я очень хорошо помню, как в какой то момент\n\n2:24:03.700 --> 2:24:07.900\n сначала появилась пепси кола, а потом появилась\n\n2:24:07.900 --> 2:24:08.900\n кока кола.\n\n2:24:08.900 --> 2:24:13.500\n Я потом, я помню, я был лет, не знаю, в шесть, и я потом,\n\n2:24:13.500 --> 2:24:17.420\n как так может быть, что кока кола украла продукт и\n\n2:24:17.420 --> 2:24:18.740\n сделала то же самое?\n\n2:24:18.740 --> 2:24:26.060\n То есть я никогда, я долго думал, что и пепси, и кока\n\n2:24:26.060 --> 2:24:30.020\n колу изобрели, типа, в 92 году.\n\n2:24:30.020 --> 2:24:33.360\n So for people who don't speak Russian, Konstantin was talking\n\n2:24:33.360 --> 2:24:39.220\n about basically his first, in 1992, interaction with capitalism,\n\n2:24:39.220 --> 2:24:43.020\n which is Pepsi, and at first he discovered Pepsi, and then he\n\n2:24:43.020 --> 2:24:47.780\n discovered Coke, and he was confused how such, how such\n\n2:24:47.780 --> 2:24:48.780\n theft could occur.\n\n2:24:48.780 --> 2:24:50.340\n Yeah, like an intellectual property theft.\n\n2:24:50.340 --> 2:24:55.180\n And remember, Pepsi arrived to the Soviet Union first,\n\n2:24:55.180 --> 2:24:58.300\n and there was some, there's some complicated story which I\n\n2:24:58.300 --> 2:25:00.980\n don't quite understand the details of.\n\n2:25:00.980 --> 2:25:05.620\n For a while, Pepsi like commanded submarines or\n\n2:25:05.620 --> 2:25:06.620\n something.\n\n2:25:06.620 --> 2:25:09.700\n Yeah, Pepsi had like a fleet of Soviet submarines that it\n\n2:25:09.700 --> 2:25:10.700\n was.\n\n2:25:10.700 --> 2:25:13.860\n They were sponsoring tanks and this fascinating.\n\n2:25:13.860 --> 2:25:16.700\n And I remember, there's certain things that trickled in, like\n\n2:25:16.700 --> 2:25:18.500\n McDonald's, I remember that was a big deal.\n\n2:25:18.500 --> 2:25:19.500\n Oh yeah.\n\n2:25:19.500 --> 2:25:20.500\n Certain aspects of the West.\n\n2:25:20.500 --> 2:25:21.500\n Absolutely.\n\n2:25:21.500 --> 2:25:25.300\n So, I mean, we went to McDonald's, and we stood on, I mean,\n\n2:25:25.300 --> 2:25:29.140\n this is, this is absurd, right, from, kind of looking at it\n\n2:25:29.140 --> 2:25:33.700\n from today's perspective, but we stood in line for like six\n\n2:25:33.700 --> 2:25:38.140\n hours to get into this McDonald's, and I remember inside\n\n2:25:38.140 --> 2:25:42.420\n it was just like a billion people, and I'm just taking a\n\n2:25:42.420 --> 2:25:47.080\n bite out of that Big Mac, and we're like, wow.\n\n2:25:47.080 --> 2:25:49.540\n What was it, an incredible experience for you?\n\n2:25:49.540 --> 2:25:52.580\n So, like, what is this taste of the West like?\n\n2:25:52.580 --> 2:25:53.580\n Did you enjoy it?\n\n2:25:53.580 --> 2:25:58.060\n I enjoyed the fact that, I mean, this is like, this is getting\n\n2:25:58.060 --> 2:26:01.740\n into the weeds, but I really enjoyed the fact that the top of\n\n2:26:01.740 --> 2:26:06.060\n the bun had those seeds, you know, like, and I remember how\n\n2:26:06.060 --> 2:26:08.780\n on the commercials, like, the Big Mac would kind of bounce.\n\n2:26:08.780 --> 2:26:12.140\n I was like, the seeds, how do they inject the seeds into the\n\n2:26:12.140 --> 2:26:13.140\n bread?\n\n2:26:13.140 --> 2:26:14.140\n Like, amazing.\n\n2:26:14.140 --> 2:26:15.140\n Yeah.\n\n2:26:15.140 --> 2:26:16.140\n Right.\n\n2:26:16.140 --> 2:26:17.140\n So, I think it was...\n\n2:26:17.140 --> 2:26:18.140\n Artistry.\n\n2:26:18.140 --> 2:26:19.140\n Yeah.\n\n2:26:19.140 --> 2:26:21.460\n But you enjoyed the artistry of the culinary experience.\n\n2:26:21.460 --> 2:26:22.460\n Exactly.\n\n2:26:22.460 --> 2:26:25.940\n It was the, you know, it was the food art that is the Big Mac.\n\n2:26:25.940 --> 2:26:27.620\n Actually, I still don't know the answer to that.\n\n2:26:27.620 --> 2:26:28.980\n How do they get the sesame seeds on the bun?\n\n2:26:28.980 --> 2:26:31.580\n It's better to not know the answer.\n\n2:26:31.580 --> 2:26:33.420\n You just wander the mystery of it all.\n\n2:26:33.420 --> 2:26:39.340\n Yeah, I remember it being exceptionally delicious, but I'm with you, I don't know, you didn't\n\n2:26:39.340 --> 2:26:45.180\n mention how transformative Pepsi was, but to me, basically sugar based stuff, like Pepsi\n\n2:26:45.180 --> 2:26:51.060\n was, or Coke, I don't remember which one we partook in, but that was an incredible experience.\n\n2:26:51.060 --> 2:26:53.380\n Yeah, yeah, yeah, no, absolutely.\n\n2:26:53.380 --> 2:27:04.020\n And, you know, I think it's, you know, it was an important and formative period.\n\n2:27:04.020 --> 2:27:10.540\n I sometimes, I guess, rely on that a little bit, you know, in my daily life, because I\n\n2:27:10.540 --> 2:27:18.900\n remember, like, the early 90s were real rough, you know, like my parents were kind of on\n\n2:27:18.900 --> 2:27:26.540\n the bottom of the spectrum in terms of, you know, in terms of financial well being.\n\n2:27:26.540 --> 2:27:35.480\n So kind of like just when I run into trouble, not like, you know, money trouble, just any\n\n2:27:35.480 --> 2:27:42.220\n kind of trouble these days, it just kind of is not particularly meaningful when you compare\n\n2:27:42.220 --> 2:27:45.260\n it to that turbulent time of the early 90s.\n\n2:27:45.260 --> 2:27:52.460\n And the other thing is, I think there's like an advantage to being, you know, an immigrant,\n\n2:27:52.460 --> 2:27:59.900\n which is that you go through the mental exercise of changing your environment completely early\n\n2:27:59.900 --> 2:28:00.900\n in your life, right?\n\n2:28:00.900 --> 2:28:07.500\n You go, it's by no means, you know, pleasant in the moment, right, but like going into\n\n2:28:07.500 --> 2:28:13.860\n Japanese elementary school, right, like, I didn't go to some, like, private, you know,\n\n2:28:13.860 --> 2:28:19.860\n thing, I just went to a regular, like, Japanese public elementary school, and I was the non\n\n2:28:19.860 --> 2:28:22.900\n Japanese person in my class.\n\n2:28:22.900 --> 2:28:26.420\n So just like to learn Japanese and just kind of.\n\n2:28:26.420 --> 2:28:30.860\n So that's a super humbling experience in many ways was when you like made fun of all that\n\n2:28:30.860 --> 2:28:31.860\n kind of stuff.\n\n2:28:31.860 --> 2:28:32.860\n Oh, yeah.\n\n2:28:32.860 --> 2:28:33.860\n Being the outsider.\n\n2:28:33.860 --> 2:28:34.860\n Oh, absolutely.\n\n2:28:34.860 --> 2:28:41.420\n But, you know, you kind of do, you kind of do that, and then you kind of, then you just\n\n2:28:41.420 --> 2:28:44.580\n kind of are okay with stuff, you know what I mean?\n\n2:28:44.580 --> 2:28:50.980\n And so like doing that, again, in middle school in the US, it was arguably easy, because I\n\n2:28:50.980 --> 2:28:53.220\n was like, yeah, well, I've already done this before.\n\n2:28:53.220 --> 2:28:59.340\n So I think it kind of prepares you mentally a little bit for switching up for whatever,\n\n2:28:59.340 --> 2:29:02.380\n you know, changes that will come up for the rest of your life.\n\n2:29:02.380 --> 2:29:08.100\n So I wouldn't trade that, that experience really for anything.\n\n2:29:08.100 --> 2:29:14.860\n It's a huge aspect of who I am, and I'm sure you can relate to a lot of this.\n\n2:29:14.860 --> 2:29:15.860\n Yes.\n\n2:29:15.860 --> 2:29:22.420\n Is there advice from your life that you can give to young people today, high school, college,\n\n2:29:22.420 --> 2:29:26.760\n you know, about their career, or maybe about life in general?\n\n2:29:26.760 --> 2:29:32.020\n I'm not like a career coach, but I'm definitely not a life coach.\n\n2:29:32.020 --> 2:29:33.900\n I don't have it all figured out.\n\n2:29:33.900 --> 2:29:45.420\n But I think there's a perpetual cycle of, you know, thinking that there is a, there's\n\n2:29:45.420 --> 2:29:48.900\n kind of like a template for success, right?\n\n2:29:48.900 --> 2:29:56.380\n Maybe there is, but in my experience, I haven't seen it, right?\n\n2:29:56.380 --> 2:30:01.540\n You know, I would say people in high school, right?\n\n2:30:01.540 --> 2:30:07.260\n So much of their focus is on getting straight A's, filling their CV with this and this and\n\n2:30:07.260 --> 2:30:13.020\n this so that it looks impressive, right?\n\n2:30:13.020 --> 2:30:17.420\n That is not, I think, a good way to optimize your life, right?\n\n2:30:17.420 --> 2:30:20.580\n Do the thing that fills your life with passion.\n\n2:30:20.580 --> 2:30:24.940\n Do the thing that fills your life with interest.\n\n2:30:24.940 --> 2:30:28.300\n And you know, do that perpetually, right?\n\n2:30:28.300 --> 2:30:36.140\n A straight A student, you know, is really impressive, but also, you know, somewhat boring,\n\n2:30:36.140 --> 2:30:37.140\n right?\n\n2:30:37.140 --> 2:30:44.380\n So, I think, you know, injection of more of that kind of interest into the lives of young\n\n2:30:44.380 --> 2:30:51.540\n people would go a long way in just both upping their level of happiness and then just kind\n\n2:30:51.540 --> 2:30:58.740\n of ensuring that, looking forward, they are not suffering from a, you know, perpetual\n\n2:30:58.740 --> 2:31:04.500\n condition of, oh, I have to satisfy these, like, you know, check boxes to do well, right?\n\n2:31:04.500 --> 2:31:08.100\n Because you can lose yourself in that whole process for the rest of your life, but it's\n\n2:31:08.100 --> 2:31:13.520\n nice if it's possible, like Max Tegmark was exceptionally good at this at MIT, figure\n\n2:31:13.520 --> 2:31:20.020\n out how you can spend a small part of your, percent of your efforts that, such that your\n\n2:31:20.020 --> 2:31:21.940\n CV looks really impressive.\n\n2:31:21.940 --> 2:31:23.980\n Yeah, absolutely.\n\n2:31:23.980 --> 2:31:31.500\n There's no, like, without a doubt, like, that's a baseline that you need to have.\n\n2:31:31.500 --> 2:31:35.300\n And then, so like, spend most of your time doing like amazing things you're passionate\n\n2:31:35.300 --> 2:31:44.540\n about, but such that it kind of like Planet Nine produces objects that feed your CV, like,\n\n2:31:44.540 --> 2:31:45.540\n slowly over time.\n\n2:31:45.540 --> 2:31:50.460\n Like getting good grades in high school, maybe doing extracurricular activities or in terms\n\n2:31:50.460 --> 2:31:55.100\n of like, you know, for programmers that's producing code that you can show up on GitHub,\n\n2:31:55.100 --> 2:32:01.780\n like leaving traces, like, throughout your efforts, such that your CV looks impressive\n\n2:32:01.780 --> 2:32:02.820\n to the rest of the world.\n\n2:32:02.820 --> 2:32:08.500\n In fact, I mean, this is somewhat along the lines of what I'm talking about, see, like,\n\n2:32:08.500 --> 2:32:14.540\n getting like good grades is important, but grades are not a tangible, like, product.\n\n2:32:14.540 --> 2:32:21.620\n You cannot, you know, show your A and have your A live a separate life from you.\n\n2:32:21.620 --> 2:32:24.260\n Code very much does, right?\n\n2:32:24.260 --> 2:32:31.580\n Music very much takes on, you know, provided somebody else listens to it, like, takes on\n\n2:32:31.580 --> 2:32:33.100\n a life of its own.\n\n2:32:33.100 --> 2:32:36.620\n That's kind of what I mean, right?\n\n2:32:36.620 --> 2:32:45.980\n Creating stuff that can then get separated from you is exceptionally attractive, right?\n\n2:32:45.980 --> 2:32:47.620\n It's like a fun and...\n\n2:32:47.620 --> 2:32:50.060\n And it's also very impressive to others.\n\n2:32:50.060 --> 2:32:54.740\n I think we're moving to a world where grades mean less and less, like certifications mean\n\n2:32:54.740 --> 2:32:55.900\n less and less.\n\n2:32:55.900 --> 2:33:02.660\n If you look at, especially again in the computing fields, getting a degree, finishing your,\n\n2:33:02.660 --> 2:33:07.400\n especially just finishing your degree, whether it's bachelor's or master's or PhD is less\n\n2:33:07.400 --> 2:33:11.660\n important than the things you've actually put out into the world.\n\n2:33:11.660 --> 2:33:16.700\n And that's a fascinating kind of, that's great that in that sense, the meritocracy is in\n\n2:33:16.700 --> 2:33:20.860\n its richest, most beautiful form is starting to win out.\n\n2:33:20.860 --> 2:33:26.020\n Yeah, it's weird because like, you know, my understanding, and I'm not like, I don't know\n\n2:33:26.020 --> 2:33:31.420\n the history of science well enough to speak very confidently about this, but, you know,\n\n2:33:31.420 --> 2:33:39.380\n the advisor of my advisor of my advisor from undergrad, like didn't have a PhD, right?\n\n2:33:39.380 --> 2:33:49.580\n So I think it was a more common thing back in the day, even in the academic sector to,\n\n2:33:49.580 --> 2:33:56.740\n you know, not have, you know, Faraday, like Faraday didn't know algebra and drew diagrams\n\n2:33:56.740 --> 2:34:03.900\n about, you know, magnetic fields and Faraday's law was derived entirely from intuition.\n\n2:34:03.900 --> 2:34:11.820\n So it is interesting to how the world of academia has evolved into a, you've got to do this\n\n2:34:11.820 --> 2:34:17.620\n and then get PhD, then you have to postdoc once and twice and maybe thrice and then like\n\n2:34:17.620 --> 2:34:18.820\n you move on.\n\n2:34:18.820 --> 2:34:25.580\n So, you know, it does, I do wonder, you know, if we're, you know, if there's a better approach.\n\n2:34:25.580 --> 2:34:29.500\n I think we're heading there, but it's a fascinating historical perspective, like that we might\n\n2:34:29.500 --> 2:34:34.340\n have just tried this whole thing out for a while where we put a lot more emphasis on\n\n2:34:34.340 --> 2:34:38.100\n grades and certificates and degrees and all those kinds of things.\n\n2:34:38.100 --> 2:34:43.860\n I think the difference historically is like we can actually, using the internet, show\n\n2:34:43.860 --> 2:34:51.060\n off ourselves and our creations better and better and more effectively, whether that's\n\n2:34:51.060 --> 2:34:54.020\n code or producing videos or all those kinds of things.\n\n2:34:54.020 --> 2:34:55.020\n That's right.\n\n2:34:55.020 --> 2:35:00.740\n I want to become a certified drone pilot.\n\n2:35:00.740 --> 2:35:03.420\n Of all the things you want to pick, yeah, for sure.\n\n2:35:03.420 --> 2:35:06.820\n Or you could just fly and make YouTube videos against hundreds of thousands of views with\n\n2:35:06.820 --> 2:35:10.140\n your drone and never getting a certificate.\n\n2:35:10.140 --> 2:35:11.140\n That's probably illegal.\n\n2:35:11.140 --> 2:35:12.140\n Don't do it.\n\n2:35:12.140 --> 2:35:14.460\n What do you think is the meaning of this whole thing?\n\n2:35:14.460 --> 2:35:23.100\n So you look at planets, they seem to orbit stuff without asking the why question.\n\n2:35:23.100 --> 2:35:28.140\n And for some reason, life emerged on Earth such that it led to big brains that can ask\n\n2:35:28.140 --> 2:35:30.300\n the big why question.\n\n2:35:30.300 --> 2:35:34.980\n Do you think there's an answer to it?\n\n2:35:34.980 --> 2:35:37.380\n I'm not sure what the question is.\n\n2:35:37.380 --> 2:35:38.380\n Meaning of life?\n\n2:35:38.380 --> 2:35:40.460\n The meaning of life.\n\n2:35:40.460 --> 2:35:41.460\n It's 42.\n\n2:35:41.460 --> 2:35:42.460\n It's 42.\n\n2:35:42.460 --> 2:35:43.460\n Yeah.\n\n2:35:43.460 --> 2:35:54.820\n But aside from that, I think the question you're asking is why we do all this, right?\n\n2:35:54.820 --> 2:35:58.220\n Why we do all this.\n\n2:35:58.220 --> 2:36:00.780\n It's part of the human condition, right?\n\n2:36:00.780 --> 2:36:11.300\n Human beings are fundamentally, I feel like, sort of stochastic and fundamentally interested\n\n2:36:11.300 --> 2:36:18.060\n in kind of expanding our own understanding of the world around us.\n\n2:36:18.060 --> 2:36:21.640\n And creating stuff to enable that understanding.\n\n2:36:21.640 --> 2:36:24.260\n So we're like stochastic, fundamentally stochastic.\n\n2:36:24.260 --> 2:36:27.940\n So like there's just a bunch of randomness that really doesn't seem like it has a good\n\n2:36:27.940 --> 2:36:33.180\n explanation and yet there's a kind of direction to our being that we just keep wanting to\n\n2:36:33.180 --> 2:36:34.700\n create and to understand.\n\n2:36:34.700 --> 2:36:35.700\n That's right.\n\n2:36:35.700 --> 2:36:41.580\n There are people that claim to be anti science, right?\n\n2:36:41.580 --> 2:36:50.420\n And yet in their anti science discussion, they're like, well, if you're so scientific,\n\n2:36:50.420 --> 2:36:54.340\n then why don't you explain to me how, I don't know, this works.\n\n2:36:54.340 --> 2:37:00.580\n And like it always, there's that fundamental seed of curiosity and interest that is common\n\n2:37:00.580 --> 2:37:02.940\n to all of us.\n\n2:37:02.940 --> 2:37:08.900\n That is absolutely what makes us human, right?\n\n2:37:08.900 --> 2:37:16.980\n And I'm in a privileged position of being able to have that be my job, right?\n\n2:37:16.980 --> 2:37:26.480\n I think as time evolves forward and the kind of economy changes, I mean, we're already\n\n2:37:26.480 --> 2:37:36.740\n starting to see a shift towards that type of creative enterprise as taking over a bigger\n\n2:37:36.740 --> 2:37:39.100\n and bigger chunk of the sector.\n\n2:37:39.100 --> 2:37:45.300\n It's not yet, I think, the dominant portion of the economy by any account.\n\n2:37:45.300 --> 2:37:53.540\n But if we compare this to sometime when the dominant thing you would do would be to go\n\n2:37:53.540 --> 2:38:00.980\n to a factory and do the same exact thing, I think there's a tide there and things are\n\n2:38:00.980 --> 2:38:02.660\n sort of headed in that direction.\n\n2:38:02.660 --> 2:38:04.500\n Yeah, life's becoming more and more fun.\n\n2:38:04.500 --> 2:38:05.500\n I can't wait.\n\n2:38:05.500 --> 2:38:06.500\n Honestly, what happens next?\n\n2:38:06.500 --> 2:38:07.500\n I can't wait to just chill.\n\n2:38:07.500 --> 2:38:08.500\n Just chill.\n\n2:38:08.500 --> 2:38:13.900\n The terminal point of this is just chill and wait for those Kuiper Belt objects to complete\n\n2:38:13.900 --> 2:38:14.900\n one orbit.\n\n2:38:14.900 --> 2:38:17.260\n I'm going to credit you with this idea.\n\n2:38:17.260 --> 2:38:24.020\n I do hope that we definitively discover a proof that there is a Planet 9 out there in\n\n2:38:24.020 --> 2:38:29.700\n the next few years so you can sit back with a cigar or cigarette or vodka or wine and\n\n2:38:29.700 --> 2:38:32.160\n just say, I told you so.\n\n2:38:32.160 --> 2:38:33.160\n That's already happening.\n\n2:38:33.160 --> 2:38:36.580\n I'm going to do that later tonight.\n\n2:38:36.580 --> 2:38:40.420\n As I mentioned, confidence is essential to being a rock star.\n\n2:38:40.420 --> 2:38:45.020\n I really appreciate you explaining so many fascinating things to me today.\n\n2:38:45.020 --> 2:38:50.220\n I really appreciate the work that you do out there and I really appreciate you talking\n\n2:38:50.220 --> 2:38:51.220\n with me today.\n\n2:38:51.220 --> 2:38:52.220\n Thanks, Constantine.\n\n2:38:52.220 --> 2:38:53.220\n It was a pleasure.\n\n2:38:53.220 --> 2:38:54.220\n Thanks for having me on.\n\n2:38:54.220 --> 2:38:57.500\n Thanks for listening to this conversation with Constantine Batygin and thank you to\n\n2:38:57.500 --> 2:39:02.500\n Squarespace, Litterati, Onnit, And, and I.\n\n2:39:02.500 --> 2:39:06.260\n Check them out in the description to support this podcast.\n\n2:39:06.260 --> 2:39:10.220\n And now let me leave you with some words from Douglas Adams in the Hitchhiker's Guide to\n\n2:39:10.220 --> 2:39:12.300\n the Galaxy.\n\n2:39:12.300 --> 2:39:18.440\n Far out in the uncharted backwaters of the unfashionable end of the western spiral arm\n\n2:39:18.440 --> 2:39:23.980\n of the galaxy lies a small, unregarded yellow sun.\n\n2:39:23.980 --> 2:39:30.020\n Orbiting this at a distance of roughly 92 million miles is an utterly insignificant\n\n2:39:30.020 --> 2:39:36.580\n little blue green planet whose ape descendant life forms are so amazingly primitive that\n\n2:39:36.580 --> 2:39:41.960\n they still think digital watches are a pretty neat idea.\n\n2:39:41.960 --> 2:39:44.500\n Thank you for listening and hope to see you next time.\n\n"
}