{
  "title": "Grant Sanderson: Math, Manim, Neural Networks & Teaching with 3Blue1Brown | Lex Fridman Podcast #118",
  "id": "U_6AYX42gkU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.080\n The following is a conversation with Grant Sanderson, his second time on the podcast.\n\n00:05.080 --> 00:10.680\n He's known to millions of people as the mind behind 3Blue1Brown, a YouTube channel where\n\n00:10.680 --> 00:15.940\n he educates and inspires the world with the beauty and power of mathematics.\n\n00:15.940 --> 00:20.140\n Quick summary of the sponsors, Dollar Shave Club, DoorDash, and CashApp.\n\n00:20.140 --> 00:24.560\n Click the sponsor links in the description to get a discount and to support this podcast,\n\n00:24.560 --> 00:29.120\n especially for the two new sponsors, Dollar Shave Club and DoorDash.\n\n00:29.120 --> 00:33.860\n Let me say, as a side note, I think that this pandemic challenged millions of educators\n\n00:33.860 --> 00:38.640\n to rethink how they teach, to rethink the nature of education.\n\n00:38.640 --> 00:43.820\n As people know, Grant is a master elucidator of mathematical concepts that may otherwise\n\n00:43.820 --> 00:49.160\n seem difficult or out of reach for students and curious minds, but he's also an inspiration\n\n00:49.160 --> 00:53.680\n to teachers, researchers, and people who just enjoy sharing knowledge.\n\n00:53.680 --> 00:56.300\n Like me, for what it's worth.\n\n00:56.300 --> 01:00.520\n It's one thing to give a semester's worth of multi hour lectures, it's another to extract\n\n01:00.520 --> 01:06.000\n from those lectures the most important, interesting, beautiful, and difficult concepts and present\n\n01:06.000 --> 01:09.040\n them in a way that makes everything fall into place.\n\n01:09.040 --> 01:11.480\n That is the challenge that is worth taking on.\n\n01:11.480 --> 01:16.640\n My dream is to see more and more of my colleagues at MIT and world experts across the world\n\n01:16.640 --> 01:22.360\n summon their inner 3Blue1Brown and create the canonical explainer videos on a topic\n\n01:22.360 --> 01:25.960\n that they know more than almost anyone else in the world.\n\n01:25.960 --> 01:30.600\n Amidst the political division, the economic pain, the psychological and medical toll of\n\n01:30.600 --> 01:36.560\n the virus, masterfully crafted educational content feels like one of the beacons of hope\n\n01:36.560 --> 01:37.800\n that we can hold onto.\n\n01:37.800 --> 01:43.440\n If you enjoy this thing, subscribe on YouTube, review it with 5 Stars and Apple Podcasts,\n\n01:43.440 --> 01:48.600\n follow on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n01:48.600 --> 01:52.880\n Of course, after you go immediately, which you already probably have done a long time\n\n01:52.880 --> 01:59.120\n ago, and subscribe to 3Blue1Brown's YouTube channel, you will not regret it.\n\n01:59.120 --> 02:02.000\n As usual, I'll do a few minutes of as now and no ads in the middle.\n\n02:02.000 --> 02:06.980\n I try to make these interesting, but I give you timestamps so you can skip.\n\n02:06.980 --> 02:10.600\n But still, please do check out the sponsors by clicking the links in the description.\n\n02:10.600 --> 02:15.880\n Especially the two new ones, DoorDash and Dollar Shave Club, they're evaluating us,\n\n02:15.880 --> 02:19.320\n looking at how many people go to their site and get their stuff in order to determine\n\n02:19.320 --> 02:22.960\n if they want to support us for the long term, so you know what to do.\n\n02:22.960 --> 02:26.680\n It's the best way to support this podcast, as always.\n\n02:26.680 --> 02:28.960\n This show is sponsored by Dollar Shave Club.\n\n02:28.960 --> 02:34.560\n Try them out with a one time offer for only $5 and free shipping at DollarShaveClub.com\n\n02:34.560 --> 02:36.600\n slash Lex.\n\n02:36.600 --> 02:41.200\n The starter kit comes with a six blade razor, refills, and all kinds of other stuff that\n\n02:41.200 --> 02:43.160\n makes shaving feel great.\n\n02:43.160 --> 02:47.040\n I've been a member of Dollar Shave Club for over five years now, and actually signed up\n\n02:47.040 --> 02:53.080\n when I first heard about them on the Joe Rogan podcast, and now we have come full circle.\n\n02:53.080 --> 02:57.720\n I feel like I've made it, now that I can do a read for them just like Joe did all those\n\n02:57.720 --> 02:58.720\n years ago.\n\n02:58.720 --> 03:02.360\n For the most part, I've just used the razor and the refills, but they encouraged me to\n\n03:02.360 --> 03:07.880\n try the shave butter, which I've never used before, so I did, and I love it.\n\n03:07.880 --> 03:11.920\n Not sure how the chemistry of it works out, but it's translucent somehow, which is a\n\n03:11.920 --> 03:13.400\n cool new experience.\n\n03:13.400 --> 03:19.520\n Again, try the Ultimate Shave Starter Set today for just $5 plus free shipping at DollarShaveClub.com\n\n03:19.520 --> 03:21.440\n slash Lex.\n\n03:21.440 --> 03:24.480\n This show is also sponsored by DoorDash.\n\n03:24.480 --> 03:29.520\n Get $5 off and zero delivery fees on your first order of $15 or more when you download\n\n03:29.520 --> 03:32.440\n the DoorDash app and enter code LEX.\n\n03:32.440 --> 03:37.640\n I have so many memories of working late nights for a deadline with a team of engineers and\n\n03:37.640 --> 03:42.160\n eventually taking a break to argue about which DoorDash restaurant to order from, and when\n\n03:42.160 --> 03:48.280\n the food came, those moments of bonding, of exchanging ideas, of pausing to shift attention\n\n03:48.280 --> 03:53.180\n from the programs to the humans were special.\n\n03:53.180 --> 03:58.360\n These days, for a bit of time, I'm on my own, sadly, so I miss that camaraderie.\n\n03:58.360 --> 04:00.640\n But actually DoorDash is still there for me.\n\n04:00.640 --> 04:04.320\n There's a million options that fit into my keto diet ways.\n\n04:04.320 --> 04:07.800\n Also it's a great way to support restaurants in these challenging times.\n\n04:07.800 --> 04:13.020\n Once again, download the DoorDash app and enter code LEX to get $5 off and zero delivery\n\n04:13.020 --> 04:16.520\n fees on your first order of $15 or more.\n\n04:16.520 --> 04:21.760\n Finally, this show is presented by Cash App, the number one finance app in the App Store.\n\n04:21.760 --> 04:24.760\n When you get it, use code LEX PODCAST.\n\n04:24.760 --> 04:28.940\n Cash App lets you send money to friends, buy bitcoin, and invest in the stock market with\n\n04:28.940 --> 04:31.040\n as little as $1.\n\n04:31.040 --> 04:34.760\n It's one of the best design interfaces of an app that I've ever used.\n\n04:34.760 --> 04:38.280\n To me, good design is when everything is easy and natural.\n\n04:38.280 --> 04:42.640\n Bad design is when the app gets in the way either because it's buggy or because it tries\n\n04:42.640 --> 04:44.880\n too hard to be helpful.\n\n04:44.880 --> 04:46.360\n I'm looking at you, Clippy.\n\n04:46.360 --> 04:50.400\n Anyway, there's a big part of my brain and heart that love to design things and also\n\n04:50.400 --> 04:52.800\n to appreciate great design by others.\n\n04:52.800 --> 04:57.920\n So again, if you get Cash App from the App Store or Google Play and use code LEX PODCAST,\n\n04:57.920 --> 05:03.200\n you get $10 and Cash App will also donate $10 to FIRST, an organization that is helping\n\n05:03.200 --> 05:08.560\n to advance robotics and STEM education for young people around the world.\n\n05:08.560 --> 05:13.880\n And now here's my conversation with Grant Sanderson.\n\n05:13.880 --> 05:17.360\n You've spoken about Richard Feynman as someone you admire.\n\n05:17.360 --> 05:21.420\n I think last time we spoke, we ran out of time.\n\n05:21.420 --> 05:24.760\n So I wanted to talk to you about him.\n\n05:24.760 --> 05:27.280\n Who is Richard Feynman to you in your eyes?\n\n05:27.280 --> 05:29.400\n What impact did he have on you?\n\n05:29.400 --> 05:31.800\n I mean, I think a ton of people like Feynman.\n\n05:31.800 --> 05:34.280\n It's a little bit cliche to say that you like Feynman, right?\n\n05:34.280 --> 05:38.720\n That's almost like when you don't know what to say about sports and you just point to\n\n05:38.720 --> 05:41.320\n the Super Bowl or something or something you enjoy watching.\n\n05:41.320 --> 05:45.600\n But I do actually think there's a layer to Feynman that sits behind the iconography.\n\n05:45.600 --> 05:50.540\n One thing that just really struck me was this letter that he wrote to his wife two years\n\n05:50.540 --> 05:51.780\n after she died.\n\n05:51.780 --> 05:54.320\n So during the Manhattan Project, she had polio.\n\n05:54.320 --> 05:55.500\n Tragically she died.\n\n05:55.500 --> 05:58.080\n They were just young, madly in love.\n\n05:58.080 --> 06:06.000\n And the icon of Feynman is almost this mildly sexist, womanizing philanderer, at least on\n\n06:06.000 --> 06:08.160\n the personal side.\n\n06:08.160 --> 06:10.840\n But you read this letter, and I can try to pull it up for you if I want.\n\n06:10.840 --> 06:15.840\n And it's just this absolutely heartfelt letter to his wife saying how much he loves her even\n\n06:15.840 --> 06:21.760\n though she's dead and what she means to him, how no woman can ever measure up to her.\n\n06:21.760 --> 06:26.820\n And it shows you that the Feynman that we've all seen in Surely You're Joking is different\n\n06:26.820 --> 06:28.860\n from the Feynman in reality.\n\n06:28.860 --> 06:35.340\n And I think the same kind of goes in his science, where he sometimes has this output of being\n\n06:35.340 --> 06:39.960\n this aw shucks character, like everyone else is coming in with these fancyfalutin formulas,\n\n06:39.960 --> 06:43.240\n but I'm just going to try to whittle it down to its essentials, which is so appealing because\n\n06:43.240 --> 06:45.120\n we love to see that kind of thing.\n\n06:45.120 --> 06:52.060\n But when you get into it, what he was doing was actually quite deep, very much mathematical.\n\n06:52.060 --> 06:55.160\n That should go without saying, but I remember reading a book about Feynman in a cafe once,\n\n06:55.160 --> 06:58.720\n and this woman looked at me and saw that it was about Feynman.\n\n06:58.720 --> 06:59.720\n She was like, oh, I love him.\n\n06:59.720 --> 07:01.220\n I read Surely You're Joking.\n\n07:01.220 --> 07:04.880\n And she started explaining to me how he was never really a math person.\n\n07:04.880 --> 07:10.040\n And I don't understand how that can possibly be a public perception about any physicist,\n\n07:10.040 --> 07:14.660\n but for whatever reason, that worked into his art that he shooed off math in place of\n\n07:14.660 --> 07:15.660\n true science.\n\n07:15.660 --> 07:18.880\n The reality of it is he was deeply in love with math and was much more going in that\n\n07:18.880 --> 07:22.880\n direction and had a clicking point into seeing that physics was a way to realize that and\n\n07:22.880 --> 07:27.560\n all the creativity that he could output in that direction was instead poured towards\n\n07:27.560 --> 07:31.680\n things like fundamental, not even fundamental theories, just emergent phenomena and everything\n\n07:31.680 --> 07:32.760\n like that.\n\n07:32.760 --> 07:37.880\n So to answer your actual question, like what, what, what I like about, uh, his way of going\n\n07:37.880 --> 07:42.320\n at things is this constant desire to reinvent it for himself.\n\n07:42.320 --> 07:45.320\n Like when he would consume papers, the way he'd describe it, he's, he would start to\n\n07:45.320 --> 07:48.340\n see what problem he was trying to solve and then just try to solve it himself to get a\n\n07:48.340 --> 07:50.040\n sense of personal ownership.\n\n07:50.040 --> 07:52.560\n And then from there, see what others had done.\n\n07:52.560 --> 07:54.120\n Is that how you see problems yourself?\n\n07:54.120 --> 08:00.360\n Like that's actually an interesting point when you first are inspired by a certain idea\n\n08:00.360 --> 08:05.040\n that you maybe want to teach or visualize or just explore on your own.\n\n08:05.040 --> 08:08.420\n I'm sure you're captured by some possibility and magic of it.\n\n08:08.420 --> 08:10.600\n Do you read the work of others?\n\n08:10.600 --> 08:15.000\n Like do you go through the proofs or do you try to rediscover everything yourself?\n\n08:15.000 --> 08:19.120\n So I think the things that I've learned best and have the deepest ownership of are the\n\n08:19.120 --> 08:21.200\n ones that have some element of rediscovery.\n\n08:21.200 --> 08:23.260\n The problem is that really slows you down.\n\n08:23.260 --> 08:25.400\n And this is for my, for my part, it's actually a big fault.\n\n08:25.400 --> 08:28.240\n Like this is part of why I'm, I'm not an active researcher.\n\n08:28.240 --> 08:29.880\n I'm not like at the depth of the field.\n\n08:29.880 --> 08:32.160\n A lot of other people are the stuff that I do learn.\n\n08:32.160 --> 08:33.880\n I try to learn it really well.\n\n08:33.880 --> 08:37.480\n Um, but other times you do need to get through it at a certain pace.\n\n08:37.480 --> 08:39.680\n You do need to get to a point of a problem you're trying to solve.\n\n08:39.680 --> 08:43.940\n So obviously you need to be well equipped to read things, uh, without that reinvention\n\n08:43.940 --> 08:45.960\n component and see how others have done it.\n\n08:45.960 --> 08:49.080\n But I think if you choose a few core building blocks along the way and you say, I'm really\n\n08:49.080 --> 08:54.920\n going to try to approach this, um, before I see how this person went at it, I'm really\n\n08:54.920 --> 08:56.880\n going to try to approach it for myself.\n\n08:56.880 --> 09:02.020\n No matter what you gain, all sorts of inarticulatable intuitions about that topic, which aren't\n\n09:02.020 --> 09:03.020\n going to be there.\n\n09:03.020 --> 09:06.600\n If you simply go through the proof, for example, you're going to be, um, trying to come up\n\n09:06.600 --> 09:07.880\n with counter examples.\n\n09:07.880 --> 09:11.920\n You're going to try to come up with, um, intuitive examples, all sorts of things where you're\n\n09:11.920 --> 09:13.560\n populating your brain with data.\n\n09:13.560 --> 09:16.120\n And the ones that you come up with are likely to be different than the one that the text\n\n09:16.120 --> 09:19.240\n comes up with and that like lends at a different angle.\n\n09:19.240 --> 09:22.640\n So that aspect also slowed Feynman down in a lot of respects.\n\n09:22.640 --> 09:26.480\n I think there was a period when like the rest of physics was running away from him.\n\n09:26.480 --> 09:32.240\n Um, but in so far as got, it got him to where he was, uh, I, I kind of resonate with that.\n\n09:32.240 --> 09:37.240\n I just, I would, I would be nowhere near it cause I not like him at all, but it's like\n\n09:37.240 --> 09:41.360\n a, uh, state to aspire to.\n\n09:41.360 --> 09:46.800\n You know, just to link in a small point you made that you're not a quote unquote active\n\n09:46.800 --> 09:55.400\n researcher, do you, you're swimming often in reasonably good depth about a lot of topics.\n\n09:55.400 --> 10:01.280\n Do you sometimes want to like dive deep at a certain moment and say, like, cause you\n\n10:01.280 --> 10:07.080\n probably built up a hell of an amazing intuition about what is and isn't true within these\n\n10:07.080 --> 10:08.080\n worlds.\n\n10:08.080 --> 10:14.000\n Do you ever want to just dive in and see if you can discover something new?\n\n10:14.000 --> 10:15.000\n Yeah.\n\n10:15.000 --> 10:20.440\n I, I think one of my biggest regrets from undergrad is not having built better relationships\n\n10:20.440 --> 10:21.800\n with the professors I had there.\n\n10:21.800 --> 10:26.400\n And I think a big part of success and research is that element of like mentorship and like\n\n10:26.400 --> 10:30.760\n people giving you the kind of scaffolded problems to carry along for my own like goals right\n\n10:30.760 --> 10:31.760\n now.\n\n10:31.760 --> 10:37.320\n I feel like, um, I'm pretty good at exposing math to others and like want to continue doing\n\n10:37.320 --> 10:39.800\n that for my personal learning.\n\n10:39.800 --> 10:44.720\n I, are you familiar with like the hedgehog Fox dynamic?\n\n10:44.720 --> 10:50.280\n I think this was, um, either the ancient Greeks came up with it or it was pretended to be\n\n10:50.280 --> 10:53.560\n something drawn from the ancient Greeks that I don't know who to point it to, but the probably\n\n10:53.560 --> 10:54.560\n Mark Twain.\n\n10:54.560 --> 10:59.400\n It is that you've got two types of people or especially two types of researchers.\n\n10:59.400 --> 11:03.140\n There's the Fox that knows many different things and then the hedgehog that knows one\n\n11:03.140 --> 11:04.700\n thing very deeply.\n\n11:04.700 --> 11:06.840\n So like von Neumann would have been the Fox.\n\n11:06.840 --> 11:10.040\n Obviously someone who knows many different things, just very foundational, a lot of different\n\n11:10.040 --> 11:11.040\n fields.\n\n11:11.040 --> 11:14.240\n Um, Einstein would have been more of a hedge thinking really deeply about one particular\n\n11:14.240 --> 11:17.520\n thing and both are very necessary for making progress.\n\n11:17.520 --> 11:22.600\n Um, so between those two, I would definitely see myself as like the Fox where, uh, I'll\n\n11:22.600 --> 11:24.720\n try to get my pause in like a whole bunch of different things.\n\n11:24.720 --> 11:28.660\n And at the moment I just think I don't know enough of anything to make like a significant\n\n11:28.660 --> 11:30.080\n contribution to any of them.\n\n11:30.080 --> 11:36.760\n But I do see value in, um, like having a decently deep understanding of a wide variety of things.\n\n11:36.760 --> 11:42.200\n Like most people who, uh, know computer science really deeply don't necessarily know physics\n\n11:42.200 --> 11:47.120\n very deeply or, uh, many of the aspects, like different fields in math, even let's say you\n\n11:47.120 --> 11:49.760\n have like an analytic number theory versus an algebraic number theory.\n\n11:49.760 --> 11:52.440\n Like these two things end up being related to very different fields.\n\n11:52.440 --> 11:56.240\n Like some of them more complex analysis, some of them more like algebraic geometry.\n\n11:56.240 --> 12:00.000\n And then when you just go out so far as to take those adjacent fields, place one, you\n\n12:00.000 --> 12:03.040\n know, PhD student into a seminar of another ones, they don't understand what the other\n\n12:03.040 --> 12:04.040\n one's saying at all.\n\n12:04.040 --> 12:08.480\n Like you take the complex analysis specialist inside the algebraic geometry seminar, they're\n\n12:08.480 --> 12:10.320\n as lost as you or I would be.\n\n12:10.320 --> 12:14.320\n But I think, uh, going around and like trying to have some sense of what this big picture\n\n12:14.320 --> 12:16.560\n is certainly has personal value for me.\n\n12:16.560 --> 12:20.880\n I don't know if I would ever make like new contributions in those fields, but I do think\n\n12:20.880 --> 12:26.600\n I could make new like expositional contributions where there's kind of a notion of, uh, things\n\n12:26.600 --> 12:29.400\n that are known, but like haven't been explained very well.\n\n12:29.400 --> 12:34.600\n Well, first of all, I think most people would agree your videos, your teaching the way you\n\n12:34.600 --> 12:42.040\n see the world is fundamentally often new, like you're creating something new and it\n\n12:42.040 --> 12:47.280\n almost feels like research, even just like the visualizations, uh, the multidimensional\n\n12:47.280 --> 12:48.480\n visualization we'll talk about.\n\n12:48.480 --> 12:54.840\n I mean, you're revealing something very interesting that, uh, yeah, just feels like research feels\n\n12:54.840 --> 13:01.440\n like science feels like the cutting edge of the very thing of which like new ideas and\n\n13:01.440 --> 13:03.160\n new discoveries are made of.\n\n13:03.160 --> 13:06.800\n I do think you're being a little bit more generous than is necessarily.\n\n13:06.800 --> 13:10.960\n And I promise that's not even false humility because I sometimes think when I research\n\n13:10.960 --> 13:14.320\n a video, I'll learn like 10 times as much as I need for the video itself and it ends\n\n13:14.320 --> 13:15.960\n up feeling kind of elementary.\n\n13:15.960 --> 13:20.960\n Um, so I have a sense of just how far away like the stuff that I cover is from the actual\n\n13:20.960 --> 13:22.440\n depth.\n\n13:22.440 --> 13:26.320\n I think that's natural, but I think that could also be a mathematics thing.\n\n13:26.320 --> 13:30.680\n I feel like in the machine learning world, you like two weeks in, you feel like you've\n\n13:30.680 --> 13:34.040\n basically mastered in mathematics.\n\n13:34.040 --> 13:37.520\n It's like, well, everything is either trivial or impossible.\n\n13:37.520 --> 13:41.200\n And it's like a shockingly thin line between the two where you can find something that's\n\n13:41.200 --> 13:42.200\n totally impenetrable.\n\n13:42.200 --> 13:45.880\n And then after you get a feel for it, it's like, Oh yeah, that whole, that whole subject\n\n13:45.880 --> 13:48.180\n is actually trivial in some way.\n\n13:48.180 --> 13:50.360\n So maybe that's what goes on.\n\n13:50.360 --> 13:53.240\n Every researcher is just on the other end of that hump and it feels like it's so far\n\n13:53.240 --> 13:56.120\n away, but one step actually gets them there.\n\n13:56.120 --> 14:02.720\n What do you think about, uh, sort of Feynman's teaching style or another perspective of use\n\n14:02.720 --> 14:05.720\n of visualization?\n\n14:05.720 --> 14:09.640\n Well his teaching style is interesting because people have described like the Feynman effect\n\n14:09.640 --> 14:13.520\n where while you're watching his lectures or while he reading his lectures, everything\n\n14:13.520 --> 14:15.420\n makes such perfect sense.\n\n14:15.420 --> 14:21.920\n So as an entertainment session, it's wonderful because it gives you this, um, this intellectual\n\n14:21.920 --> 14:26.440\n satisfaction that you don't get from anywhere else that you like finally understand it.\n\n14:26.440 --> 14:31.080\n But the Feynman effect is that you can't really recall what it is that gave you that insight,\n\n14:31.080 --> 14:32.680\n you know, even a week later.\n\n14:32.680 --> 14:36.640\n And this is, um, this is true of a lot of books and a lot of lectures where the retention\n\n14:36.640 --> 14:38.760\n is never quite what we hope it is.\n\n14:38.760 --> 14:46.680\n Um, so there is a risk that, uh, the stuff that I do also fits that same bill where at\n\n14:46.680 --> 14:50.320\n best it's giving this kind of intellectual candy on giving a glimpse of feeling like\n\n14:50.320 --> 14:55.040\n you understand something, but unless you do something active, like reinventing it yourself,\n\n14:55.040 --> 15:00.280\n like doing problems, um, to solidify it, um, even things like space repetition memory to\n\n15:00.280 --> 15:04.420\n just make sure that you have like the building blocks of what do all the terms mean.\n\n15:04.420 --> 15:07.080\n Unless you're doing something like that, it's not actually going to stick.\n\n15:07.080 --> 15:12.720\n So the very same thing that's so admirable about Feynman's lectures, which is how damn\n\n15:12.720 --> 15:18.680\n satisfying they are to consume might actually also reveal a little bit of the flaw that\n\n15:18.680 --> 15:22.840\n we should as educators all look out for, which is that that does not correlate with long\n\n15:22.840 --> 15:23.840\n term learning.\n\n15:23.840 --> 15:25.600\n We'll talk about it a little bit.\n\n15:25.600 --> 15:28.280\n I think you've done some interactive stuff.\n\n15:28.280 --> 15:34.960\n I mean, even in your videos, the awesome thing that Feynman couldn't do at the time is you\n\n15:34.960 --> 15:40.840\n could, since it's programmed, you can like tinker, like play with stuff.\n\n15:40.840 --> 15:42.760\n You could take this value and change it.\n\n15:42.760 --> 15:47.720\n You can like heroes, take the value of this variable and change it to build up an intuition,\n\n15:47.720 --> 15:51.960\n to move along the surface or to, to change the shape of something.\n\n15:51.960 --> 15:57.120\n I think that's almost an equivalent of you doing it yourself.\n\n15:57.120 --> 16:02.040\n It's not quite there, but you as a viewer, um, yeah, do you think there's some value\n\n16:02.040 --> 16:04.000\n in that interactive element?\n\n16:04.000 --> 16:08.280\n Yeah, well, so what's interesting is you're saying that, and the videos are non interactive\n\n16:08.280 --> 16:10.520\n in the sense that there's a play button and a pause button.\n\n16:10.520 --> 16:13.940\n Um, and you could ask like, Hey, while you're programming these things, why don't you program\n\n16:13.940 --> 16:15.880\n it into an interactable version?\n\n16:15.880 --> 16:19.320\n You know, make it a Jupiter notebook that people can play with, which I should do.\n\n16:19.320 --> 16:20.760\n And that like would be better.\n\n16:20.760 --> 16:25.440\n I think the thing about interactives though is most people consuming them, um, just sort\n\n16:25.440 --> 16:27.520\n of consume what the author had in mind.\n\n16:27.520 --> 16:29.680\n Uh, and that's kind of what they want.\n\n16:29.680 --> 16:33.360\n Like I have a ton of friends who make interactive explanations.\n\n16:33.360 --> 16:37.800\n And when you look into the analytics of how people use them, there's a small sliver that\n\n16:37.800 --> 16:40.360\n genuinely use it as a playground to have experiments.\n\n16:40.360 --> 16:43.520\n And maybe that small sliver is actually who you're targeting and the rest don't matter.\n\n16:43.520 --> 16:48.580\n Um, but most people consume it just as a piece of, um, like well constructed literature that\n\n16:48.580 --> 16:51.960\n maybe you tweak with the example a little bit to see what it's getting at.\n\n16:51.960 --> 16:56.760\n But in that way, I do think like a video can get most of the benefits of the interactive,\n\n16:56.760 --> 17:01.160\n like the interactive app, as long as you make the interactive for yourself and you decide\n\n17:01.160 --> 17:03.480\n what the best narrative to spin is.\n\n17:03.480 --> 17:08.600\n Um, as a more concrete example, like my process with, I made this video about, um, SIR models\n\n17:08.600 --> 17:13.660\n for epidemics and it's like this agent based bottling thing where you tweak some things\n\n17:13.660 --> 17:17.360\n about how the epidemic spreads and you want to see how that affects its evolution.\n\n17:17.360 --> 17:21.720\n Um, my, my, uh, format for making that was very different than others where rather than\n\n17:21.720 --> 17:26.800\n scripting it ahead of time, I just made the playground and then I played a bunch, uh,\n\n17:26.800 --> 17:29.480\n and then I saw what stories there were to tell within that.\n\n17:29.480 --> 17:30.480\n Um,\n\n17:30.480 --> 17:31.480\n that's cool.\n\n17:31.480 --> 17:36.040\n So your, your video had that kind of structure, it had, uh, like five or six stories or whatever\n\n17:36.040 --> 17:37.160\n it was.\n\n17:37.160 --> 17:42.040\n And like, it was basically, okay, here's a simulation, here's a model.\n\n17:42.040 --> 17:44.440\n What can we discover with this model?\n\n17:44.440 --> 17:46.960\n And here's five things I found after playing with it.\n\n17:46.960 --> 17:51.080\n Well, cause here, the thing is a way that you could do that project is you make the\n\n17:51.080 --> 17:54.640\n model and then you put it out and you say, here's a thing for the world to play with,\n\n17:54.640 --> 17:57.160\n like come to my website where you interact with this thing.\n\n17:57.160 --> 18:01.560\n Um, and, and people did like sort of remake it in a, um, JavaScript way so that you can\n\n18:01.560 --> 18:04.720\n go to that website and you can test your own hypotheses.\n\n18:04.720 --> 18:08.640\n But I think a meaningful part of the value to add is not just the technology, but to\n\n18:08.640 --> 18:11.000\n give the story around it as well.\n\n18:11.000 --> 18:12.960\n And like, that's kind of my job.\n\n18:12.960 --> 18:17.680\n It's not just to like make the, uh, the visuals that someone will look at it's to be the one\n\n18:17.680 --> 18:20.320\n to decide what's the interesting thing to walk through here.\n\n18:20.320 --> 18:24.280\n Um, and even though there's lots of other interesting paths that one could take, that\n\n18:24.280 --> 18:27.120\n can be kind of daunting when you're just sitting there in a sandbox and you're given this\n\n18:27.120 --> 18:32.240\n tool with like five different sliders and you're told to like play and discover things.\n\n18:32.240 --> 18:33.240\n Where do you do?\n\n18:33.240 --> 18:34.240\n What do you start?\n\n18:34.240 --> 18:35.240\n What are my hypotheses?\n\n18:35.240 --> 18:36.240\n What should I be asking?\n\n18:36.240 --> 18:40.040\n Like a little bit of guidance in that direction can be what actually sparks curiosity to make\n\n18:40.040 --> 18:43.120\n someone want to, um, imagine more about it.\n\n18:43.120 --> 18:47.720\n A few videos I've seen you do, I don't know how often you do it, but there's almost a\n\n18:47.720 --> 18:54.280\n tangential like pause where you, here's a cool thing you say like, here's a cool thing,\n\n18:54.280 --> 18:59.560\n but it's outside the scope of this video essentially, but I'll leave it to you as homework essentially\n\n18:59.560 --> 19:02.760\n to like figure out it's a cool thing to explore.\n\n19:02.760 --> 19:06.960\n I wish I could say that wasn't a function of laziness and that's like, you've worked\n\n19:06.960 --> 19:11.320\n so hard on making the 20 minutes already that to extend it out even further, it would take\n\n19:11.320 --> 19:12.320\n more time.\n\n19:12.320 --> 19:19.640\n And one of your cooler videos, the homomorphic, like from the Mobius strip to this, yeah,\n\n19:19.640 --> 19:26.160\n that's the super and you're like, yeah, you can't, uh, you can't transform the Mobius\n\n19:26.160 --> 19:35.800\n strip into a, into a surface without it intersecting itself, but I'll leave it to you to see why\n\n19:35.800 --> 19:36.800\n that is.\n\n19:36.800 --> 19:41.240\n Well, I hope that's not exactly how I phrase it because I think what my hope would be is\n\n19:41.240 --> 19:45.280\n that I leave it to you to think about why you would expect that to be true and then\n\n19:45.280 --> 19:50.040\n to want to know what aspects of a Mobius strip do you want to formalize such that you can\n\n19:50.040 --> 19:55.160\n prove that intuition that you have because at some point now you're starting to invent\n\n19:55.160 --> 19:56.840\n algebraic topology.\n\n19:56.840 --> 20:02.160\n If you have these vague instincts like I want to get this Mobius strip, I want to, um, fit\n\n20:02.160 --> 20:08.120\n it such that it's all above the plane, but it's boundary sits exactly on the plane.\n\n20:08.120 --> 20:11.320\n I don't think I can do that without crossing itself, but that feels really vague.\n\n20:11.320 --> 20:12.320\n How do I formalize it?\n\n20:12.320 --> 20:16.480\n And as you're starting to formalize that, that's what's going to get you to try to come\n\n20:16.480 --> 20:19.760\n up with a definition for what it means to be orientable or non orientable.\n\n20:19.760 --> 20:22.920\n And like once you have that motivation, a lot of the otherwise arbitrary things that\n\n20:22.920 --> 20:26.560\n are sitting at the very beginning of a topology stack textbook start to make a little more\n\n20:26.560 --> 20:27.560\n sense.\n\n20:27.560 --> 20:28.560\n Yeah.\n\n20:28.560 --> 20:32.400\n And I mean that, that whole video beautifully was a motivation for topology school.\n\n20:32.400 --> 20:36.400\n That was my, well, my hope with that is I feel like topology is, um, I don't want to\n\n20:36.400 --> 20:41.920\n say it's taught wrong, but I do think sometimes it's popularized in the wrong way where, uh,\n\n20:41.920 --> 20:44.920\n you know, you'll hear these things that people saying, Oh, topologists, they're very interested\n\n20:44.920 --> 20:50.180\n in surfaces that you can bend and stretch, but you can't cut or glue.\n\n20:50.180 --> 20:51.180\n Are they?\n\n20:51.180 --> 20:52.180\n Why?\n\n20:52.180 --> 20:53.180\n Yeah.\n\n20:53.180 --> 20:56.780\n There's all sorts of things you can be interested in with random, like imaginative manipulations\n\n20:56.780 --> 20:57.780\n of things.\n\n20:57.780 --> 21:00.200\n Is that really what like mathematicians are into?\n\n21:00.200 --> 21:03.120\n And the short answer is not, not really.\n\n21:03.120 --> 21:07.580\n That's uh, it's not as if someone was sitting there thinking like, I wonder what the properties\n\n21:07.580 --> 21:12.120\n of clay are by add some arbitrary rules about what, when I can't cut it and when I can't\n\n21:12.120 --> 21:18.680\n glue it instead, it's, there's a ton of pieces of math that, um, can actually be equivalent\n\n21:18.680 --> 21:23.200\n to, uh, like these very general structures that's like geometry, except you don't have\n\n21:23.200 --> 21:24.200\n exact distances.\n\n21:24.200 --> 21:26.400\n You just want to maintain a notion of closeness.\n\n21:26.400 --> 21:31.400\n And once you get it to those general structures, constructing mappings between them translate\n\n21:31.400 --> 21:36.360\n into non trivial facts about other parts of math and that I just, I don't think that's\n\n21:36.360 --> 21:38.040\n actually like popularized.\n\n21:38.040 --> 21:41.640\n Um, I don't even think it's emphasized well enough when you're starting to take a topology\n\n21:41.640 --> 21:43.560\n class because you kind of have these two problems.\n\n21:43.560 --> 21:45.320\n It's like either it's too squishy.\n\n21:45.320 --> 21:49.720\n You're just talking about coffee mugs and donuts, or it's a little bit too rigor first.\n\n21:49.720 --> 21:55.280\n And you're talking about, um, the axiom systems with open sets and an open set is not the\n\n21:55.280 --> 21:56.600\n opposite of closed set.\n\n21:56.600 --> 21:57.600\n So sorry about that.\n\n21:57.600 --> 22:01.800\n Everyone, we have a notion of clopin sets for ones that are both at the same time.\n\n22:01.800 --> 22:02.800\n Yeah.\n\n22:02.800 --> 22:06.860\n It's just, it's not, it's not an intuitive axiom system in comparison to other fields\n\n22:06.860 --> 22:07.860\n of math.\n\n22:07.860 --> 22:11.140\n So you as the student like really have to walk through mud to get there and you're constantly\n\n22:11.140 --> 22:15.240\n confused about how this relates to the beautiful things about coffee mugs and Mobius strips\n\n22:15.240 --> 22:16.240\n and such.\n\n22:16.240 --> 22:21.140\n And it takes a really long time to actually see like see topology in the way that mathematicians\n\n22:21.140 --> 22:22.400\n see topology.\n\n22:22.400 --> 22:23.840\n But I don't think it needs to take that time.\n\n22:23.840 --> 22:27.800\n I think there's, um, this is making me feel like I need to make more videos on the topic\n\n22:27.800 --> 22:32.760\n because I think you do, but you know, I've also seen it in my narrow view.\n\n22:32.760 --> 22:39.840\n Uh, like, um, I find game theory very beautiful and I know topology has been used, uh, elegantly\n\n22:39.840 --> 22:41.320\n to prove things in game theory.\n\n22:41.320 --> 22:42.320\n Yeah.\n\n22:42.320 --> 22:43.760\n You have like facts that seem very strange.\n\n22:43.760 --> 22:47.920\n Like I could tell you, you stir your coffee and um, after you stir it and like, let's\n\n22:47.920 --> 22:51.040\n say all the molecules settled to like not moving again, one of the molecules will be\n\n22:51.040 --> 22:53.360\n basically in the same position it was before.\n\n22:53.360 --> 22:57.200\n Um, you have all sorts of fixed point theorems like this, right?\n\n22:57.200 --> 23:01.320\n That kind of fixed point theorem directly relevant to Nash equilibriums, right?\n\n23:01.320 --> 23:05.680\n Um, so you can imagine popularizing it by describing the coffee fact, but then you're\n\n23:05.680 --> 23:09.160\n left to wonder like who cares about if a molecule of coffee like stays in the same spot?\n\n23:09.160 --> 23:11.160\n Is this what we're paying our mathematicians for?\n\n23:11.160 --> 23:15.640\n Um, you have this very elegant mapping onto economics in a way that's very concrete or\n\n23:15.640 --> 23:20.240\n very, I shouldn't say concrete, very, uh, tangible, like actually adds value to people's\n\n23:20.240 --> 23:22.320\n lives through the predictions that it makes.\n\n23:22.320 --> 23:26.780\n Uh, but that line isn't always drawn because like you have to get a little bit technical\n\n23:26.780 --> 23:34.160\n in order to properly draw that line out, um, and often I think popularized forms of media\n\n23:34.160 --> 23:37.760\n just shy away from being a little too technical for sure.\n\n23:37.760 --> 23:41.840\n Uh, by the way, for people who are watching the video, I do not condone the message in\n\n23:41.840 --> 23:42.840\n this mug.\n\n23:42.840 --> 23:44.760\n It's the only one I have, which is this.\n\n23:44.760 --> 23:47.360\n The snuggle is real.\n\n23:47.360 --> 23:50.240\n By the way, for anyone watching, I do condone the message of that mug.\n\n23:50.240 --> 23:51.240\n The snuggle is real.\n\n23:51.240 --> 23:52.240\n The snuggle is real.\n\n23:52.240 --> 23:57.160\n Okay, so you mentioned the SIR model.\n\n23:57.160 --> 24:03.220\n I think, uh, there are certain ideas there of growth of exponential growth.\n\n24:03.220 --> 24:11.680\n What maybe have you learned about, um, pandemics from, from making that video?\n\n24:11.680 --> 24:12.680\n Because it was kind of exploratory.\n\n24:12.680 --> 24:17.680\n You were kind of building up an intuition and it's, again, people should watch the video.\n\n24:17.680 --> 24:19.160\n It's kind of an abstract view.\n\n24:19.160 --> 24:23.480\n It's not really modeling in detail.\n\n24:23.480 --> 24:31.440\n The whole field of epidemiology, those, those people, they go really far in terms of modeling,\n\n24:31.440 --> 24:32.440\n like how people move about.\n\n24:32.440 --> 24:37.600\n I don't know if you've seen it, but like there is the mobility patterns, like how, like the\n\n24:37.600 --> 24:42.560\n track, like how many people you encounter in a certain situations when you go to a school,\n\n24:42.560 --> 24:46.400\n when you go to a mall, they like model every aspect of that for a particular city.\n\n24:46.400 --> 24:49.880\n Like they have maps of actual city streets.\n\n24:49.880 --> 24:54.280\n They model it really well and natural patterns of the people have it's crazy.\n\n24:54.280 --> 24:55.280\n So you don't do any of that.\n\n24:55.280 --> 24:59.400\n You're just doing an abstract model to explore different ideas of simple pedigree.\n\n24:59.400 --> 25:02.680\n Well, because I don't want to pretend like an epidemiologist, I'm an epidemiologist.\n\n25:02.680 --> 25:08.440\n Like we have a ton of armchair epidemiologists and the spirit of that was more like, uh,\n\n25:08.440 --> 25:12.680\n can we through a little bit of play, uh, draw like reasonable ish conclusions.\n\n25:12.680 --> 25:17.680\n Um, and also just like, uh, get ourselves in a position where we can judge the validity\n\n25:17.680 --> 25:18.680\n of a model.\n\n25:18.680 --> 25:21.160\n Like, I think people should look at that and they should criticize it.\n\n25:21.160 --> 25:24.640\n They should point to all the ways that it's wrong because it's definitely naive, right?\n\n25:24.640 --> 25:25.920\n And the way that it's set up.\n\n25:25.920 --> 25:30.480\n Um, but to say like what, what lessons from that hold, like thinking about the are not\n\n25:30.480 --> 25:33.720\n value and what that represents and what it can imply.\n\n25:33.720 --> 25:40.440\n Um, so are not is if you are infectious and you're in a population which is completely\n\n25:40.440 --> 25:44.760\n susceptible, uh, what's the average number of people that you're going to infect during\n\n25:44.760 --> 25:46.080\n your infectiousness?\n\n25:46.080 --> 25:51.280\n Um, so certainly during the beginning of an epidemic, this basically gives you kind of\n\n25:51.280 --> 25:53.280\n the, um, the exponential growth rate.\n\n25:53.280 --> 25:57.280\n Like if every person infects two others, you've got that one, two, four, eight, uh, exponential\n\n25:57.280 --> 25:58.280\n growth pattern.\n\n25:58.280 --> 26:04.280\n Um, as it goes on and, uh, let's say it's something, um, uh, endemic where you've got\n\n26:04.280 --> 26:10.040\n like a ton of people who have had it, uh, and are recovered, then, uh, you, you would,\n\n26:10.040 --> 26:13.960\n the are not value doesn't tell you that as directly because a lot of the people you interact\n\n26:13.960 --> 26:16.880\n with aren't susceptible, but in the early phases it does.\n\n26:16.880 --> 26:21.360\n Um, and this is like the fundamental constant that it seems like epidemiologists look at\n\n26:21.360 --> 26:23.460\n and you know, the whole goal is to get that down.\n\n26:23.460 --> 26:26.560\n If you can get it below one, then it's no longer epidemic.\n\n26:26.560 --> 26:30.960\n If it's equal to one, then it's endemic, um, and it's above one, then your epidemic.\n\n26:30.960 --> 26:36.120\n So, uh, like just teaching what that value is and giving some intuitions on how do certain\n\n26:36.120 --> 26:40.160\n changes in behavior change that value and then what does that imply for exponential\n\n26:40.160 --> 26:41.160\n growth?\n\n26:41.160 --> 26:47.140\n I think those are, um, general enough lessons and they're like resilient to all of the\n\n26:47.140 --> 26:52.400\n chaoses of the world, um, that it's still like valid to take from the video.\n\n26:52.400 --> 26:56.040\n I mean, one of the interesting aspects of that is just exponential growth and we think\n\n26:56.040 --> 26:57.040\n about growth.\n\n26:57.040 --> 27:03.480\n Is that the one of the first times you've done a video on, on, uh, no, of course not\n\n27:03.480 --> 27:07.360\n the whole, uh, well there's identity.\n\n27:07.360 --> 27:08.360\n Okay.\n\n27:08.360 --> 27:09.360\n So\n\n27:09.360 --> 27:10.360\n sure.\n\n27:10.360 --> 27:13.360\n I guess I've done a lot of videos about exponential growth in the circular direction, uh, only\n\n27:13.360 --> 27:14.880\n minimal in the normal direction.\n\n27:14.880 --> 27:22.280\n I mean, another way to ask, like, do you think we're able to reason intuitively about exponential\n\n27:22.280 --> 27:23.280\n growth?\n\n27:23.280 --> 27:25.360\n It's, it's funny.\n\n27:25.360 --> 27:30.360\n I think it's, um, I think it's extremely intuitive to humans and then we train it out of ourselves\n\n27:30.360 --> 27:33.720\n such that it's then really not intuitive and then I think it can become intuitive again\n\n27:33.720 --> 27:35.200\n when you study a technical field.\n\n27:35.200 --> 27:41.240\n Uh, so what I mean by that is, um, have you ever heard of these studies where in a, uh,\n\n27:41.240 --> 27:46.000\n like anthropological setting where you're studying a group that has been disassociated\n\n27:46.000 --> 27:51.760\n from a lot of like modern society and you ask what number is between one and nine and\n\n27:51.760 --> 27:54.600\n maybe you would ask you, you've got like one rock and you've got nine rocks, you're like\n\n27:54.600 --> 27:59.960\n what pile is halfway in between these and our instinct is usually to say five.\n\n27:59.960 --> 28:02.000\n That's the number that sits right between one and nine.\n\n28:02.000 --> 28:07.360\n Um, but sometimes when a numeracy and, uh, the kind of just basic arithmetic that we\n\n28:07.360 --> 28:12.840\n have isn't in a society, the natural instinct is three because it's, uh, in between in an\n\n28:12.840 --> 28:16.920\n exponential sense and a geometric sense that, uh, one is three times bigger and then the\n\n28:16.920 --> 28:18.520\n next one is three times bigger than that.\n\n28:18.520 --> 28:22.240\n So it's like, what's, you know, if you have one friend versus a hundred friends, what's\n\n28:22.240 --> 28:23.240\n in between that?\n\n28:23.240 --> 28:26.840\n Ten friends seems like the social status in between those two states.\n\n28:26.840 --> 28:30.200\n So that's like deeply intuitive to us to think logarithmically like that.\n\n28:30.200 --> 28:35.120\n Um, and for some reason we kind of train it out of ourselves to start thinking linearly\n\n28:35.120 --> 28:36.120\n about things.\n\n28:36.120 --> 28:42.240\n So in the sense, yeah, the early, early basic math is, uh, yeah, forces us to take a step\n\n28:42.240 --> 28:43.240\n back.\n\n28:43.240 --> 28:51.160\n It's, it's the same criticism if there's any of science is the lessons of science make\n\n28:51.160 --> 28:57.760\n us like see the world in a slightly narrow sense to where we, we have an over exaggerated\n\n28:57.760 --> 29:02.480\n confidence that we understand everything as opposed to just understanding a small slice\n\n29:02.480 --> 29:03.560\n of it.\n\n29:03.560 --> 29:07.280\n But I think that probably only really goes for small numbers cause the real counterintuitive\n\n29:07.280 --> 29:10.340\n thing about exponential growth is like as the numbers start to get big.\n\n29:10.340 --> 29:14.660\n So I bet if you took that same setup and you asked them, oh, if I keep tripling the size\n\n29:14.660 --> 29:18.320\n of this rock pile, you know, um, seven times, how big will it be?\n\n29:18.320 --> 29:23.680\n I bet it would be surprisingly big even to like an a society without numeracy.\n\n29:23.680 --> 29:28.360\n And that's the side of it that, um, I think is pretty counterintuitive to us, uh, but\n\n29:28.360 --> 29:33.320\n that you can basically train into people like I think computer scientists and physicists\n\n29:33.320 --> 29:38.520\n when they're looking at the early numbers of, um, like COVID were, they were the ones\n\n29:38.520 --> 29:42.080\n thinking like, oh God, this is following an exact exponential curve.\n\n29:42.080 --> 29:47.240\n Um, and I heard that from a number of people, uh, so it's, and, and almost all of them are\n\n29:47.240 --> 29:51.800\n like techies in some capacity, probably just cause I like live in the Bay area, but, but\n\n29:51.800 --> 29:56.320\n for sure they, they're cognizant of this kind of, this kind of growth is present in a lot\n\n29:56.320 --> 30:01.240\n of natural systems and a lot of, in a lot of, in a lot of systems.\n\n30:01.240 --> 30:04.920\n Uh, I don't know if you've seen like, I mean, there's a lot of ways to visualize this obviously,\n\n30:04.920 --> 30:12.000\n but Raker as well, I think was the one that had this like chess board where, um, every,\n\n30:12.000 --> 30:15.720\n every square on the chess board, you double the number of stones or something in that\n\n30:15.720 --> 30:16.720\n chess board.\n\n30:16.720 --> 30:20.800\n I've heard, this is like an old proverb where it's like, you know, someone, the King offered\n\n30:20.800 --> 30:24.560\n him a gift and he said, ah, the only gift I would like very modest, give me a single\n\n30:24.560 --> 30:29.800\n grain of rice for the first chess board and then two grains of rice for the next square.\n\n30:29.800 --> 30:32.600\n Then twice that for the next square and just continue on.\n\n30:32.600 --> 30:37.120\n That's my only modest ask your sire and like, it's all, you know, more grains of rice than\n\n30:37.120 --> 30:41.680\n there are, uh, anything in the world, um, by the time you get to the end.\n\n30:41.680 --> 30:47.960\n And I, I, my intuition falls apart there, like, I would have never predicted that, like\n\n30:47.960 --> 30:54.080\n for some reason, that's a really compelling, uh, illustration, how poorly breaks down.\n\n30:54.080 --> 30:58.280\n Just like you said, maybe we're okay for the first few piles, but after, uh, of rocks,\n\n30:58.280 --> 31:00.860\n but after a while it's game over.\n\n31:00.860 --> 31:04.820\n You know, the other classic example for, um, gauging someone's intuitive understanding\n\n31:04.820 --> 31:10.200\n of exponential growth is, uh, I've got like a Lily pad on a, on like really big lake,\n\n31:10.200 --> 31:16.320\n um, like lake Michigan and that Lily pad replicates, it doubles, um, one day and then it doubles\n\n31:16.320 --> 31:17.960\n the next day and it doubles the next day.\n\n31:17.960 --> 31:22.320\n Um, and after 50 days, um, it actually is going to cover the entire lake.\n\n31:22.320 --> 31:23.320\n Okay.\n\n31:23.320 --> 31:25.840\n So after how many days does it cover half the lake?\n\n31:25.840 --> 31:26.840\n 49.\n\n31:26.840 --> 31:30.600\n So you, you have a good instinct for exponential growth.\n\n31:30.600 --> 31:31.600\n Right.\n\n31:31.600 --> 31:35.560\n So I think a lot of, uh, like the knee jerk reaction is sometimes to think that it's like\n\n31:35.560 --> 31:41.160\n half the amount of time or to at least be like surprised that like after 49 days, you've\n\n31:41.160 --> 31:42.400\n only covered half of it.\n\n31:42.400 --> 31:43.400\n Um, yeah.\n\n31:43.400 --> 31:46.080\n I mean, that's the reason you heard a pause for me.\n\n31:46.080 --> 31:48.440\n Um, I literally thought that can't be right.\n\n31:48.440 --> 31:49.440\n Right.\n\n31:49.440 --> 31:50.440\n Yeah, exactly.\n\n31:50.440 --> 31:53.480\n So even when you know the fact and you do the division, it's like, wow.\n\n31:53.480 --> 31:57.000\n So you've gotten like that whole time and then day 49, it's only covering half.\n\n31:57.000 --> 31:58.940\n And then after that it gets the whole thing.\n\n31:58.940 --> 32:02.080\n But I think you can make that even more visceral if rather than going one day before you say\n\n32:02.080 --> 32:06.280\n how long until, um, it's covered 1% of the lake, right.\n\n32:06.280 --> 32:08.080\n And it's, uh, so what would that be?\n\n32:08.080 --> 32:12.240\n Um, how many times you have to double to get over a hundred, like seven, six and a half\n\n32:12.240 --> 32:13.240\n times, something like that.\n\n32:13.240 --> 32:14.240\n Right.\n\n32:14.240 --> 32:17.920\n So at that point you're looking at 43, 44 days into it.\n\n32:17.920 --> 32:19.880\n You're not even at 1% of the lake.\n\n32:19.880 --> 32:23.360\n So you've, you've experienced, you know, 44 out of 50 days and you're like, ah, that's\n\n32:23.360 --> 32:24.360\n really bad.\n\n32:24.360 --> 32:25.580\n It's just 1% of the lake.\n\n32:25.580 --> 32:28.760\n But then next thing you know, it's the entire lake.\n\n32:28.760 --> 32:30.040\n You're wearing a space X shirt.\n\n32:30.040 --> 32:38.000\n So let me ask you, let me ask you one, one person who talks about exponential, you know,\n\n32:38.000 --> 32:42.700\n just the miracle of the exponential function in general is Elon Musk.\n\n32:42.700 --> 32:51.720\n So he kind of advocates the idea of exponential thinking, you know, realizing that technological\n\n32:51.720 --> 32:58.080\n development can, at least in the short term, follow exponential improvement, which breaks\n\n32:58.080 --> 33:03.120\n apart our intuition, our ability to reason about what is and isn't impossible.\n\n33:03.120 --> 33:04.760\n So he's a big one.\n\n33:04.760 --> 33:09.080\n It's a good leadership kind of style of saying like, look, the thing that everyone thinks\n\n33:09.080 --> 33:13.800\n is impossible is actually possible because exponentials.\n\n33:13.800 --> 33:19.240\n But what's your sense about, um, about that kind of way to see the world?\n\n33:19.240 --> 33:25.140\n Well, so I think it's, um, it can be very inspiring to note when something like Moore's\n\n33:25.140 --> 33:29.160\n law is another great example where you have this exponential pattern that holds shockingly\n\n33:29.160 --> 33:30.160\n well.\n\n33:30.160 --> 33:33.480\n Um, and it enables, um, just better lives to be led.\n\n33:33.480 --> 33:37.980\n I think the people who took Moore's law seriously in the sixties, we're seeing that, wow, it's\n\n33:37.980 --> 33:41.580\n not going to be too long before like these giant computers that are either batch processing\n\n33:41.580 --> 33:45.180\n or time shared, you could actually have one small enough to put on your desk on top of\n\n33:45.180 --> 33:46.780\n your desk and you could do things.\n\n33:46.780 --> 33:49.740\n And if they took it seriously, like you have people predicting smartphones like a long\n\n33:49.740 --> 33:50.740\n time ago.\n\n33:50.740 --> 33:55.120\n Um, and it's only out of like kind of this, I don't want to say faith in exponentials,\n\n33:55.120 --> 33:58.120\n but an understanding that that's what's happening.\n\n33:58.120 --> 34:03.400\n What's more interesting I think is to, um, really understand why exponential growth happens\n\n34:03.400 --> 34:07.400\n and that the mechanism behind it is when the rate of change is proportional to the thing\n\n34:07.400 --> 34:08.880\n in and of itself.\n\n34:08.880 --> 34:14.240\n So the reason that technology would grow exponentially is only going to be if, um, the rate of progress\n\n34:14.240 --> 34:16.360\n is proportional to the amount that you have.\n\n34:16.360 --> 34:19.960\n So that the software you write enables you to write more software.\n\n34:19.960 --> 34:25.080\n Um, and I think we see this with the internet, like the advent of the internet makes it faster\n\n34:25.080 --> 34:29.200\n to learn things, which makes it faster to, uh, create new things.\n\n34:29.200 --> 34:35.600\n Um, I think this is, uh, oftentimes why like investment will grow exponentially that the\n\n34:35.600 --> 34:40.680\n more resources a company has, if it knows how to use them, well, the more, uh, the more\n\n34:40.680 --> 34:41.680\n it can actually grow.\n\n34:41.680 --> 34:43.520\n So, I mean, you know, you referenced Elon Musk.\n\n34:43.520 --> 34:47.320\n I think he seems to really be into vertically integrating his companies.\n\n34:47.320 --> 34:49.920\n I think a big part of that is because you have the sense, what you want is to make sure\n\n34:49.920 --> 34:54.060\n that the things that you develop, you have ownership of in the, they enable further development\n\n34:54.060 --> 34:55.800\n of the adjacent parts, right?\n\n34:55.800 --> 35:00.320\n So it's not just this, you, you see a curve and you're blindly drawing a line through\n\n35:00.320 --> 35:01.320\n it.\n\n35:01.320 --> 35:04.960\n What's much more interesting is to ask, when do you have this proportional growth property?\n\n35:04.960 --> 35:09.520\n Um, because then you can also recognize when it breaks down, like in an epidemic, as you\n\n35:09.520 --> 35:11.640\n approach saturation, that would break down.\n\n35:11.640 --> 35:16.520\n Um, as you do anything that, uh, skews what that proportionality constant is, um, you\n\n35:16.520 --> 35:20.020\n can make it maybe not break down as being an exponential, but it can seriously slow\n\n35:20.020 --> 35:21.480\n what that exponential rate is.\n\n35:21.480 --> 35:28.960\n This is the opposite of a pandemic is you want, in terms of ideas, you want to minimize\n\n35:28.960 --> 35:31.680\n barriers that, um, prevent the spread.\n\n35:31.680 --> 35:33.620\n You want to maximize the spread of impact.\n\n35:33.620 --> 35:38.720\n So like you want it to, to grow when you're doing technological development is so that\n\n35:38.720 --> 35:42.240\n you do hold up that rate holds up.\n\n35:42.240 --> 35:47.400\n And that's, that's almost like, uh, like an operational challenge of like how you run\n\n35:47.400 --> 35:52.640\n a company, how you run a group of people is that any one invention has a ripple that's\n\n35:52.640 --> 35:54.440\n unstopped.\n\n35:54.440 --> 35:58.000\n And that ripple effect then has its own ripple effects and so on.\n\n35:58.000 --> 35:59.000\n And that continues.\n\n35:59.000 --> 36:00.000\n Yeah.\n\n36:00.000 --> 36:01.000\n Like Moore's law is fascinating.\n\n36:01.000 --> 36:06.760\n And the, like on a psychological level and a human level, cause it's not exponential.\n\n36:06.760 --> 36:13.400\n It's, it's just a consistent set of like what you would call like S curves, which is like,\n\n36:13.400 --> 36:18.120\n it's constantly like breakthrough innovations nonstop.\n\n36:18.120 --> 36:19.120\n That's a good point.\n\n36:19.120 --> 36:22.680\n Like it might not actually be an example of exponentials because of something which grows\n\n36:22.680 --> 36:23.920\n in proportion to itself.\n\n36:23.920 --> 36:27.880\n But instead it's almost like a benchmark that was set out that everyone's been pressured\n\n36:27.880 --> 36:29.000\n to meet.\n\n36:29.000 --> 36:33.840\n And it's like all these innovations and micro inventions along the way, rather than some\n\n36:33.840 --> 36:38.480\n consistent sit back and just let the lily pad grow across the lake phenomenon.\n\n36:38.480 --> 36:42.600\n And it's also that there's a human psychological level for sure of like the four minute mile,\n\n36:42.600 --> 36:45.080\n like it's something about it.\n\n36:45.080 --> 36:51.800\n Like saying that, look, there is, you know, Moore's law, it's a law.\n\n36:51.800 --> 36:56.720\n So like it's a, it's certainly an achievable thing.\n\n36:56.720 --> 36:59.920\n You know, we achieved it for the last decade, for the last two decades, for the last three\n\n36:59.920 --> 37:04.320\n decades, you just keep going and it somehow makes it happen.\n\n37:04.320 --> 37:10.520\n I mean, it makes people, I'm continuously surprised in this world how few people do\n\n37:10.520 --> 37:18.200\n the best work in the world, like in that particular, whatever that field is, like it's very often\n\n37:18.200 --> 37:25.480\n that like the genius, I mean, you couldn't argue that community matters, but it's certain\n\n37:25.480 --> 37:32.080\n like I've been in groups of engineers where like one person is clearly like doing an incredible\n\n37:32.080 --> 37:38.880\n amount of work and just is the genius and it's fascinating to see basically it's kind\n\n37:38.880 --> 37:46.840\n of the Steve Jobs idea is maybe the whole point is to create an atmosphere where the\n\n37:46.840 --> 37:52.080\n genius can discover themselves, like have the opportunity to do the best work of their\n\n37:52.080 --> 37:57.920\n life and yeah, and that the exponential is just milking that.\n\n37:57.920 --> 38:03.120\n It's like rippling the idea that it's possible and that idea that it's possible finds the\n\n38:03.120 --> 38:07.200\n right people for the four minute mile and the idea that it's possible finds the right\n\n38:07.200 --> 38:12.520\n runners to run it and then expose the number of people who can run faster than four minutes.\n\n38:12.520 --> 38:17.140\n It's kind of interesting to, I don't know, basically the positive way to see that is\n\n38:17.140 --> 38:22.320\n most of us are way more intelligent, have way more potential than we ever realized.\n\n38:22.320 --> 38:26.520\n I guess that's kind of depressing, but I mean like the ceiling for most of us is much higher\n\n38:26.520 --> 38:28.640\n than we ever realized.\n\n38:28.640 --> 38:29.640\n That is true.\n\n38:29.640 --> 38:34.740\n A good book to read if you want that sense is Peak, which essentially talks about peak\n\n38:34.740 --> 38:39.200\n performance in a lot of different ways, like chess, London cab drivers, how many pushups\n\n38:39.200 --> 38:45.600\n people can do, short term memory tasks, and it's meant to be like a concrete manifesto\n\n38:45.600 --> 38:50.480\n about deliberate practice and such, but the one sensation you come out with is wow, no\n\n38:50.480 --> 38:54.560\n matter how good people are at something, they can get better and like way better than we\n\n38:54.560 --> 38:55.680\n think they could.\n\n38:55.680 --> 38:59.480\n I don't know if that's actually related to exponential growth, but I do think it's a\n\n38:59.480 --> 39:01.440\n true phenomenon that's interesting.\n\n39:01.440 --> 39:06.720\n Yeah, I mean, there's certainly no law of exponential growth in human innovation.\n\n39:06.720 --> 39:09.920\n Well, I don't know.\n\n39:09.920 --> 39:11.480\n Well kind of, there is.\n\n39:11.480 --> 39:15.200\n I think it's very interesting to see when innovations in one field allow for innovations\n\n39:15.200 --> 39:16.200\n in another.\n\n39:16.200 --> 39:20.440\n Like the advent of computing seems like a prerequisite for the advent of chaos theory.\n\n39:20.440 --> 39:25.120\n You have this truth about physics and the world that in theory could be known.\n\n39:25.120 --> 39:29.960\n You could find Lorenz's equations without computers, but in practice, it was just never\n\n39:29.960 --> 39:34.200\n going to be analyzed that way unless you were doing like a bunch of simulations and that\n\n39:34.200 --> 39:36.520\n you could computationally see these models.\n\n39:36.520 --> 39:40.360\n So it's like physics allowed for computers, computers allowed for better physics, and\n\n39:40.360 --> 39:42.500\n you know, wash, rinse and repeat.\n\n39:42.500 --> 39:45.720\n That self proportionality, that's exponential.\n\n39:45.720 --> 39:50.920\n So I think I wouldn't think it's too far to say that that's a law of some kind.\n\n39:50.920 --> 39:59.760\n Yeah, a fundamental law of the universe is that these descendants of apes will exponentially\n\n39:59.760 --> 40:05.280\n improve their technology and one day be taken over by the AGI.\n\n40:05.280 --> 40:06.280\n That's built in.\n\n40:06.280 --> 40:09.640\n That'll make the video game fun, whoever created this thing.\n\n40:09.640 --> 40:12.960\n So I mean, since you're wearing a space X shirt, let me ask.\n\n40:12.960 --> 40:15.960\n I didn't realize I was wearing a space X shirt.\n\n40:15.960 --> 40:16.960\n I apologize.\n\n40:16.960 --> 40:17.960\n It's on point.\n\n40:17.960 --> 40:18.960\n So it's on topic.\n\n40:18.960 --> 40:19.960\n I'll take it.\n\n40:19.960 --> 40:32.600\n It's the first crewed mission out into space since the space shuttle and just by first\n\n40:32.600 --> 40:37.880\n time ever by a commercial company, I mean, it's an incredible accomplishment, I think,\n\n40:37.880 --> 40:44.560\n but it's also just an incredible, it inspires imagination amongst people that this is the\n\n40:44.560 --> 40:50.960\n first step in a long, vibrant journey of humans into space.\n\n40:50.960 --> 40:52.800\n So how do you feel?\n\n40:52.800 --> 40:55.000\n Is this exciting to you?\n\n40:55.000 --> 40:56.000\n Yeah, it is.\n\n40:56.000 --> 40:57.000\n I think it's great.\n\n40:57.000 --> 41:00.360\n The idea of seeing it basically done by smaller entities instead of by governments.\n\n41:00.360 --> 41:04.720\n I mean, it's a heavy collaboration between space X and NASA in this case, but moving\n\n41:04.720 --> 41:09.340\n in the direction of not necessarily requiring an entire country and its government to make\n\n41:09.340 --> 41:14.840\n it happen, but that you can have something closer to a single company doing it.\n\n41:14.840 --> 41:18.320\n We're not there yet because it's not like they're unilaterally saying like we're just\n\n41:18.320 --> 41:20.960\n shooting people up into space.\n\n41:20.960 --> 41:25.680\n It's just a sign that we're able to do more powerful things with smaller groups of people.\n\n41:25.680 --> 41:26.680\n I find that inspiring.\n\n41:26.680 --> 41:27.680\n Innovate quickly.\n\n41:27.680 --> 41:30.800\n I hope we see people land on Mars in my lifetime.\n\n41:30.800 --> 41:32.360\n Do you think we will?\n\n41:32.360 --> 41:33.360\n I think so.\n\n41:33.360 --> 41:35.600\n I mean, I think there's a ton of challenges there, right?\n\n41:35.600 --> 41:37.720\n Like radiation being kind of the biggest one.\n\n41:37.720 --> 41:42.160\n And I think there's a ton of people who look at that and say, why?\n\n41:42.160 --> 41:43.880\n Why would you want to do that?\n\n41:43.880 --> 41:46.100\n Let's let the robots do the science for us.\n\n41:46.100 --> 41:50.520\n But I think there's enough people who are genuinely inspired about broadening the worlds\n\n41:50.520 --> 41:55.800\n that we've touched or people who think about things like backing up the light of consciousness\n\n41:55.800 --> 41:59.800\n with super long term visions of terraforming, like as long as there's a backing up the\n\n41:59.800 --> 42:00.800\n light of consciousness.\n\n42:00.800 --> 42:01.800\n Yeah.\n\n42:01.800 --> 42:07.800\n I thought that if Earth goes to hell, we've got to have a backup somewhere.\n\n42:07.800 --> 42:10.800\n A lot of people see that as pretty out there and it's like not in the short term future,\n\n42:10.800 --> 42:12.680\n but I think that's an inspiring thought.\n\n42:12.680 --> 42:17.160\n I think that's a reason to get up in the morning and I feel like most employees at SpaceX feel\n\n42:17.160 --> 42:18.160\n that way too.\n\n42:18.160 --> 42:21.360\n Do you think we'll colonize Mars one day?\n\n42:21.360 --> 42:22.360\n No idea.\n\n42:22.360 --> 42:26.080\n Like either AGI kills us first or if we're like allowed, I don't know if it'll take us\n\n42:26.080 --> 42:27.080\n for allowed.\n\n42:27.080 --> 42:29.960\n Well, like honestly, it would take such a long time.\n\n42:29.960 --> 42:32.760\n Like, okay, you might have a small colony, right?\n\n42:32.760 --> 42:39.840\n Something like what you see in the Martian, but not like people living comfortably there.\n\n42:39.840 --> 42:46.200\n But if you want to talk about actual like second Earth kind of stuff, that's just like\n\n42:46.200 --> 42:50.680\n way far out there and the future moves so fast that it's hard to predict.\n\n42:50.680 --> 42:53.520\n We might just kill ourselves before that even becomes viable.\n\n42:53.520 --> 42:54.520\n Yeah.\n\n42:54.520 --> 42:58.040\n I mean, there's a lot of possibilities where it could be just, it doesn't have to be on\n\n42:58.040 --> 43:07.360\n a planet, we could be floating out in space, have a space faring backup solution that doesn't\n\n43:07.360 --> 43:11.440\n have to deal with the constraints that a planet, I mean, a planet provides a lot of possibilities\n\n43:11.440 --> 43:13.800\n and resources, but also has some constraints.\n\n43:13.800 --> 43:14.800\n Yeah.\n\n43:14.800 --> 43:19.560\n I mean, for me, for some reason, it's a deeply exciting possibility.\n\n43:19.560 --> 43:20.560\n Oh yeah.\n\n43:20.560 --> 43:21.560\n Yeah.\n\n43:21.560 --> 43:24.720\n All of the people who were like skeptical about it are like, why do we care about going\n\n43:24.720 --> 43:25.720\n to Mars?\n\n43:25.720 --> 43:28.640\n Like, what makes you care about anything that's inspiring?\n\n43:28.640 --> 43:29.640\n It's hard.\n\n43:29.640 --> 43:34.760\n It actually is hard to hear that because exactly as you put it on a philosophical level, it's\n\n43:34.760 --> 43:37.600\n hard to say, why do anything?\n\n43:37.600 --> 43:38.740\n I don't know.\n\n43:38.740 --> 43:45.560\n It's like the people say like, I've been doing like an insane challenge last 30 something\n\n43:45.560 --> 43:46.560\n days.\n\n43:46.560 --> 43:47.560\n Your pull ups?\n\n43:47.560 --> 43:55.080\n The pull ups and push ups and like, a bunch of people are like, awesome.\n\n43:55.080 --> 43:57.040\n They're insane, but awesome.\n\n43:57.040 --> 43:59.520\n And then some people are like, why?\n\n43:59.520 --> 44:00.720\n Why do anything?\n\n44:00.720 --> 44:02.720\n I don't know.\n\n44:02.720 --> 44:03.720\n There's a calling.\n\n44:03.720 --> 44:09.720\n It's, I'm with JFK a little bit is because we do these things because they're hard.\n\n44:09.720 --> 44:14.120\n There's something in the human spirit that says like, same with like a math problem.\n\n44:14.120 --> 44:20.240\n There's something you fail once and it's like this feeling that, you know what, I'm not\n\n44:20.240 --> 44:21.800\n going to back down from this.\n\n44:21.800 --> 44:25.320\n There's something to be discovered in overcoming this thing.\n\n44:25.320 --> 44:29.560\n So what I like about it is, and I also like this about the moon missions, sure, it's kind\n\n44:29.560 --> 44:32.020\n of arbitrary, but you can't move the target.\n\n44:32.020 --> 44:36.120\n So you can't make it easier and say that you've accomplished the goal.\n\n44:36.120 --> 44:39.640\n And when that happens, it just demands actual innovation, right?\n\n44:39.640 --> 44:44.720\n Like protecting humans from the radiation in space on the flight there while they're\n\n44:44.720 --> 44:46.820\n hard problem demands innovation.\n\n44:46.820 --> 44:49.500\n You can't move the goalpost to make that easier.\n\n44:49.500 --> 44:52.560\n But certainly the innovations required for things like that will be relevant in a bunch\n\n44:52.560 --> 44:54.820\n of other domains too.\n\n44:54.820 --> 44:59.280\n So like the idea of doing something merely because it's hard, it's like loosely productive.\n\n44:59.280 --> 45:00.280\n Great.\n\n45:00.280 --> 45:03.240\n But as long as you can't move the goalposts, there's probably going to be these secondary\n\n45:03.240 --> 45:07.000\n benefits that like we should all strive for.\n\n45:07.000 --> 45:08.000\n Yeah.\n\n45:08.000 --> 45:13.280\n I mean, it's hard to formulate the Mars colonization problem as something that has a deadline,\n\n45:13.280 --> 45:15.360\n which is the problem.\n\n45:15.360 --> 45:23.360\n But if there was a deadline, then the amount of things we would come up with by forcing\n\n45:23.360 --> 45:29.100\n ourselves to figure out how to colonize that place would be just incredible.\n\n45:29.100 --> 45:34.280\n This is what people, like the internet didn't get created because people sat down and try\n\n45:34.280 --> 45:41.480\n to figure out how do I, you know, send TikTok videos of myself dancing to people.\n\n45:41.480 --> 45:44.880\n They, you know, it was, there's an application.\n\n45:44.880 --> 45:48.120\n I mean, actually I don't even know what do you think the application for the internet\n\n45:48.120 --> 45:53.360\n was when it was, it must've been very low level basic network communication within DARPA,\n\n45:53.360 --> 46:00.600\n like military based, like how do I send like a networking, how do I send information securely\n\n46:00.600 --> 46:03.040\n between two places?\n\n46:03.040 --> 46:04.040\n Maybe it was an encryption.\n\n46:04.040 --> 46:08.160\n I'm totally speaking totally outside of my knowledge, but like it was probably intended\n\n46:08.160 --> 46:10.200\n for a very narrow, small group of people.\n\n46:10.200 --> 46:13.880\n Well, so I mean, it was, there was like this small community of people who are really interested\n\n46:13.880 --> 46:20.000\n in timesharing computing and like interactive computing in contrast with a batch processing.\n\n46:20.000 --> 46:24.600\n And then the idea that as you set up like a timesharing center, basically meaning kind\n\n46:24.600 --> 46:28.820\n of multiple people like logged in and using that like central computer, why not make it\n\n46:28.820 --> 46:30.360\n accessible to others?\n\n46:30.360 --> 46:33.880\n And this was kind of what I had always thought like, Oh, is this like fringe group that was\n\n46:33.880 --> 46:37.820\n interested in this new kind of computing and they all like got themselves together.\n\n46:37.820 --> 46:41.360\n But the thing is like DARPA wouldn't act, you wouldn't have the U S government funding\n\n46:41.360 --> 46:44.020\n that just for the funds of it, right?\n\n46:44.020 --> 46:48.880\n In some sense, that's what ARPA was all about was like just really advanced research for\n\n46:48.880 --> 46:53.400\n the sake of having advanced research and it doesn't have to pay out with utility soon.\n\n46:53.400 --> 46:57.480\n But the core parts of its development were happening like in the middle of the Vietnam\n\n46:57.480 --> 47:01.360\n war when there was budgetary constraints all over the place.\n\n47:01.360 --> 47:06.400\n I only learned this recently, actually, like if you look at the documents, basically justifying\n\n47:06.400 --> 47:12.840\n the budget for the ARPANET as they were developing it, and not just keeping it where it was,\n\n47:12.840 --> 47:15.880\n but actively growing it while all sorts of other departments were having their funding\n\n47:15.880 --> 47:21.440\n cut because of the war, a big part of it was national defense in terms of having like a\n\n47:21.440 --> 47:26.500\n more robust communication system, like the idea of packet switching versus circuit switching.\n\n47:26.500 --> 47:31.000\n You could kind of make this case that in some calamitous circumstance where a central location\n\n47:31.000 --> 47:36.360\n gets nuked, this is a much more resilient way to still have your communication lines\n\n47:36.360 --> 47:45.560\n that like traditional telephone lines weren't as resilient to, which I just found very interesting.\n\n47:45.560 --> 47:48.760\n Even something that we see as so happy go lucky is just a bunch of computer nerds trying\n\n47:48.760 --> 47:51.060\n to get like interactive computing out there.\n\n47:51.060 --> 47:57.480\n The actual thing that made it funded and thing that made it advance when it did was because\n\n47:57.480 --> 48:00.880\n of this direct national security question and concern.\n\n48:00.880 --> 48:02.360\n I don't know if you've read it.\n\n48:02.360 --> 48:03.360\n I haven't read it.\n\n48:03.360 --> 48:06.320\n I don't know if I've been meaning to read it, but Neil deGrasse Tyson actually came out\n\n48:06.320 --> 48:11.640\n with a book that talks about like science in the context of the military, like basically\n\n48:11.640 --> 48:18.640\n saying all the great science we've done in the 20th century was like because of the military.\n\n48:18.640 --> 48:23.880\n He paints a positive, it's not like a critical, a lot of people say like military industrial\n\n48:23.880 --> 48:25.880\n complex and so on.\n\n48:25.880 --> 48:30.400\n Another way to see the military and national security is like a source of, like you said,\n\n48:30.400 --> 48:37.200\n headlines and like hard things you can't move, like almost like scaring yourself into being\n\n48:37.200 --> 48:38.200\n productive.\n\n48:38.200 --> 48:39.200\n It is that.\n\n48:39.200 --> 48:43.240\n I mean, Manhattan Project is a perfect example, probably the quintessential example.\n\n48:43.240 --> 48:48.440\n That one is a little bit more macabre than others because of like what they were building,\n\n48:48.440 --> 48:54.800\n but in terms of how many focused, smart hours of human intelligence get pointed towards\n\n48:54.800 --> 48:58.580\n a topic per day, you're just maxing it out with that sense of worry.\n\n48:58.580 --> 49:01.600\n In that context, everyone there was saying like, we've got to get the bomb before Hitler\n\n49:01.600 --> 49:08.340\n does and that just lights a fire under you that I, again, like the circumstances macabre,\n\n49:08.340 --> 49:11.540\n but I think that's actually pretty healthy, especially for researchers that are otherwise\n\n49:11.540 --> 49:17.040\n going to be really theoretical to take these like theorizers and say, make this real physical\n\n49:17.040 --> 49:18.640\n thing happen.\n\n49:18.640 --> 49:22.380\n Meaning a lot of it is going to be unsexy, a lot of it's going to be like young Feynman\n\n49:22.380 --> 49:28.120\n sitting there kind of inventing a notion of computation in order to like compute what\n\n49:28.120 --> 49:31.940\n they needed to compute more quickly with like the rudimentary automated tools that they\n\n49:31.940 --> 49:34.280\n had available.\n\n49:34.280 --> 49:39.460\n I think you see this with Bell Labs also where you've got otherwise very theorizing minds\n\n49:39.460 --> 49:43.600\n in very pragmatic contexts that I think is like really helpful for the theory as well\n\n49:43.600 --> 49:46.280\n as for the applications.\n\n49:46.280 --> 49:50.280\n I think that stuff can be positive for progress.\n\n49:50.280 --> 49:52.760\n You mentioned Bell Labs and Manhattan Project.\n\n49:52.760 --> 49:58.240\n This kind of makes me curious for the things you've create, which are quite singular.\n\n49:58.240 --> 50:04.040\n Like if you look at all YouTube or just not YouTube, it doesn't matter what it is.\n\n50:04.040 --> 50:06.920\n It's just teaching content, art, it doesn't matter.\n\n50:06.920 --> 50:11.620\n It's like, yep, that's, that's grant, right?\n\n50:11.620 --> 50:12.620\n That's unique.\n\n50:12.620 --> 50:15.700\n I know you're teaching style and everything.\n\n50:15.700 --> 50:22.000\n Does it, Manhattan Project and Bell Labs was like famously a lot of brilliant people, but\n\n50:22.000 --> 50:23.480\n there's a lot of them.\n\n50:23.480 --> 50:25.200\n They play off of each other.\n\n50:25.200 --> 50:28.880\n So like my question for you is that, does it get lonely?\n\n50:28.880 --> 50:32.640\n Honestly, that right there, I think is the biggest part of my life that I would like\n\n50:32.640 --> 50:39.640\n to change in some way that I look at a Bell Labs type situation and I'm like, God damn,\n\n50:39.640 --> 50:44.160\n I love that whole situation and I'm so jealous of it and you're like reading about Hamming\n\n50:44.160 --> 50:47.480\n and then you see that he also shared an office with Shannon and you're like, of course he\n\n50:47.480 --> 50:48.480\n did.\n\n50:48.480 --> 50:49.480\n Of course they shared an office.\n\n50:49.480 --> 50:50.480\n That's how these ideas get.\n\n50:50.480 --> 50:53.320\n And they actually probably very likely worked separately.\n\n50:53.320 --> 50:55.360\n Yeah, totally, totally separate.\n\n50:55.360 --> 50:59.720\n But there's a literally, and sorry to interrupt, there's a literally magic that happens when\n\n50:59.720 --> 51:06.480\n you run into each other, like on the way to like getting a snack or something.\n\n51:06.480 --> 51:09.320\n Conversations you overhear, it's other projects you're pulled into, it's like puzzles that\n\n51:09.320 --> 51:12.240\n colleagues are sharing, like all of that.\n\n51:12.240 --> 51:17.960\n I have some extent of it just because I try to stay well connected in communities of people\n\n51:17.960 --> 51:19.720\n who think in similar ways.\n\n51:19.720 --> 51:25.120\n But it's not in the day to day in the same way, which I would like to fix somehow.\n\n51:25.120 --> 51:35.040\n That's one of the, I would say one of the biggest, well, one of the many drawbacks,\n\n51:35.040 --> 51:40.920\n negative things about this current pandemic is that whatever the term is, but like chance\n\n51:40.920 --> 51:44.160\n collisions are significantly reduced.\n\n51:44.160 --> 51:50.440\n I saw, I don't know why I saw this, but on my brother's work calendar, he had a scheduled\n\n51:50.440 --> 51:57.240\n slot with someone that he scheduled a meeting and the title of the whole meeting was no\n\n51:57.240 --> 51:58.240\n specific agenda.\n\n51:58.240 --> 52:02.200\n I just missed the happenstance serendipitous conversations that we used to have, which\n\n52:02.200 --> 52:05.080\n the pandemic and remote work has so cruelly taken away from us.\n\n52:05.080 --> 52:06.080\n Brilliant.\n\n52:06.080 --> 52:07.080\n That's brilliant.\n\n52:07.080 --> 52:09.720\n I'm like, that's the way to do it.\n\n52:09.720 --> 52:13.680\n You just schedule those things, schedule the serendipitous interaction.\n\n52:13.680 --> 52:16.400\n That's like, I mean, you can't do it in an academic setting, but it's basically like\n\n52:16.400 --> 52:22.080\n going to a bar and sitting there just for the strangers you might meet, just the strangers\n\n52:22.080 --> 52:26.280\n or striking up a conversation with strangers on the train.\n\n52:26.280 --> 52:33.820\n Harder to do when you're deeply like maybe myself or maybe a lot of academic types who\n\n52:33.820 --> 52:38.440\n are like introverted and avoid human contact as much as possible.\n\n52:38.440 --> 52:43.600\n So it's nice when it's forced, those chance collisions, but maybe scheduling is a possibility\n\n52:43.600 --> 52:48.000\n but for the most part, do you work alone?\n\n52:48.000 --> 52:53.660\n I'm sure you struggle a lot.\n\n52:53.660 --> 53:00.200\n You probably hit moments when you look at this and you say like, this is the wrong way\n\n53:00.200 --> 53:01.200\n to show it.\n\n53:01.200 --> 53:02.440\n It's a long way to visualize it.\n\n53:02.440 --> 53:04.160\n I'm making it too hard for myself.\n\n53:04.160 --> 53:05.740\n I'm going down the wrong direction.\n\n53:05.740 --> 53:06.740\n This is too long.\n\n53:06.740 --> 53:07.740\n This is too short.\n\n53:07.740 --> 53:11.360\n All those self doubt that could be paralyzing.\n\n53:11.360 --> 53:13.160\n What do you do in those moments?\n\n53:13.160 --> 53:18.720\n I actually much prefer like work to be a solitary affair for me.\n\n53:18.720 --> 53:19.880\n That's like a personality quirk.\n\n53:19.880 --> 53:23.280\n I would like it to be in an environment with others and like collaborative in the sense\n\n53:23.280 --> 53:24.700\n of ideas exchanged.\n\n53:24.700 --> 53:27.980\n But those phenomena you're describing when you say this is too long, this is too short,\n\n53:27.980 --> 53:31.920\n this visualization sucks, it's way easier to say that to yourself than it is to say\n\n53:31.920 --> 53:34.300\n to a collaborator.\n\n53:34.300 --> 53:36.440\n And I know that's just a thing that I'm not good at.\n\n53:36.440 --> 53:41.200\n So in that way, it's very easy to just throw away a script because the script isn't working.\n\n53:41.200 --> 53:43.400\n It's hard to tell someone else they should do the same.\n\n53:43.400 --> 53:47.560\n Actually last time we talked, I think it was like very close to me talking Don Knuth was\n\n53:47.560 --> 53:48.560\n kind of cool.\n\n53:48.560 --> 53:49.560\n Like two people that...\n\n53:49.560 --> 53:51.560\n I can't believe you got that interview.\n\n53:51.560 --> 53:52.560\n It's the hard...\n\n53:52.560 --> 53:54.960\n No, can I brag about something?\n\n53:54.960 --> 53:55.960\n Please.\n\n53:55.960 --> 54:01.520\n My favorite thing is Don Knuth, after did the interview, he offered to go out to hot\n\n54:01.520 --> 54:02.520\n dogs with me.\n\n54:02.520 --> 54:03.520\n To get hot dogs.\n\n54:03.520 --> 54:04.520\n That was never...\n\n54:04.520 --> 54:09.480\n Like people ask me what's the favorite interview you've ever done and that has to be...\n\n54:09.480 --> 54:12.760\n But unfortunately I couldn't, I had a thing after.\n\n54:12.760 --> 54:14.440\n So I had to turn down Don Knuth.\n\n54:14.440 --> 54:15.440\n You missed Knuth dogs?\n\n54:15.440 --> 54:16.440\n Knuth dogs.\n\n54:16.440 --> 54:17.440\n Sorry.\n\n54:17.440 --> 54:22.200\n So that was a little bragging, but the hot dogs, he's such a sweet.\n\n54:22.200 --> 54:28.000\n But the reason I bring that up is he works through problems alone as well.\n\n54:28.000 --> 54:33.360\n He prefers that struggle, the struggle of it.\n\n54:33.360 --> 54:40.720\n Writers like Stephen King often talk about their process of what they do, what they eat\n\n54:40.720 --> 54:49.280\n when they wake up, when they sit down, how they like their desk on a perfectly productive\n\n54:49.280 --> 54:51.680\n day.\n\n54:51.680 --> 54:56.600\n What they like to do, how long they like to work for, what enables them to think deeply,\n\n54:56.600 --> 54:57.600\n all that kind of stuff.\n\n54:57.600 --> 55:00.520\n Hunter S. Thompson did a lot of drugs.\n\n55:00.520 --> 55:03.000\n Everybody has their own thing.\n\n55:03.000 --> 55:05.880\n Do you have a thing?\n\n55:05.880 --> 55:10.720\n If you were to lay out a perfect productive day, what would that schedule look like do\n\n55:10.720 --> 55:11.720\n you think?\n\n55:11.720 --> 55:19.360\n Part of that's hard to answer because like the mode of work I do changes a lot from day\n\n55:19.360 --> 55:20.360\n to day.\n\n55:20.360 --> 55:21.400\n Like some days I'm writing.\n\n55:21.400 --> 55:22.900\n The thing I have to do is write a script.\n\n55:22.900 --> 55:23.900\n Some days I'm animating.\n\n55:23.900 --> 55:24.900\n The thing I have to do is animate.\n\n55:24.900 --> 55:27.160\n Sometimes I'm like working on the animation library.\n\n55:27.160 --> 55:30.720\n The thing I have to do is like a little, I'm not a software engineer, but something in\n\n55:30.720 --> 55:32.560\n the direction of software engineering.\n\n55:32.560 --> 55:34.520\n Some days it's like a variant of research.\n\n55:34.520 --> 55:37.620\n It's like learn this topic well and try to learn it differently.\n\n55:37.620 --> 55:41.520\n So those are like four very different modes.\n\n55:41.520 --> 55:45.360\n Some days it's like get through the email backlog of people I've been, tasks I've been\n\n55:45.360 --> 55:46.360\n putting off.\n\n55:46.360 --> 55:51.960\n It goes research, scripting, like the idea starts with research and then there's scripting\n\n55:51.960 --> 55:56.800\n and then there's programming and then there's the showtime.\n\n55:56.800 --> 56:01.440\n And the research side, by the way, I think a problematic way to do it is to say I'm starting\n\n56:01.440 --> 56:03.960\n this project and therefore I'm starting the research.\n\n56:03.960 --> 56:08.020\n Instead it should be that you're like ambiently learning a ton of things just in the background\n\n56:08.020 --> 56:11.660\n and then once you feel like you have the understanding for one, you put it on the list of things\n\n56:11.660 --> 56:14.040\n that there can be a video for.\n\n56:14.040 --> 56:18.660\n Otherwise either you're going to end up roadblocked forever or you're just not going to like have\n\n56:18.660 --> 56:21.920\n a good way of talking about it.\n\n56:21.920 --> 56:25.120\n But still some of the days it's like the thing to do is learn new things.\n\n56:25.120 --> 56:26.360\n So what's the most painful one?\n\n56:26.360 --> 56:29.120\n I think you mentioned scripting.\n\n56:29.120 --> 56:30.520\n Scripting is yeah, that's the worst.\n\n56:30.520 --> 56:31.880\n Yeah, writing is the worst.\n\n56:31.880 --> 56:35.520\n So what's your, on a perfectly, so let's take the hardest one.\n\n56:35.520 --> 56:37.320\n What's a perfectly productive day?\n\n56:37.320 --> 56:41.800\n You wake up and it's like, damn it, this is the day I need to do some scripting.\n\n56:41.800 --> 56:45.600\n And like you didn't do anything the last two days so you came up with excuses to procrastinate\n\n56:45.600 --> 56:47.480\n so today must be the day.\n\n56:47.480 --> 56:57.100\n Yeah, I wake up early, I guess I exercise and then I turn the internet off.\n\n56:57.100 --> 57:01.520\n If we're writing, yeah, that's what's required is having the internet off and then maybe\n\n57:01.520 --> 57:04.200\n you keep notes on the things that you want to Google when you're allowed to have the\n\n57:04.200 --> 57:05.200\n internet again.\n\n57:05.200 --> 57:08.820\n I'm not great about doing that, but when I do, that makes it happen.\n\n57:08.820 --> 57:13.200\n And then when I hit writer's block, like the solution to writer's block is to read.\n\n57:13.200 --> 57:14.360\n Doesn't even have to be related.\n\n57:14.360 --> 57:18.340\n Just read something different just for like 15 minutes, half an hour and then go back\n\n57:18.340 --> 57:20.160\n to writing.\n\n57:20.160 --> 57:22.520\n That when it's a nice cycle, I think can work very well.\n\n57:22.520 --> 57:26.200\n And when you're writing the script, you don't know where it ends, right?\n\n57:26.200 --> 57:28.820\n Like you have a problem solving videos.\n\n57:28.820 --> 57:30.840\n I know where it ends, expositional videos.\n\n57:30.840 --> 57:36.760\n I don't know where it ends coming up with a, with the magical thing that makes this\n\n57:36.760 --> 57:41.980\n whole story, like ties this whole story together that when does that happen?\n\n57:41.980 --> 57:45.120\n That's that's the thing that makes it such that a topic gets put on the list of like\n\n57:45.120 --> 57:46.120\n videos.\n\n57:46.120 --> 57:47.120\n Oh, that's an issue.\n\n57:47.120 --> 57:50.760\n You shouldn't start the project unless there's one of those and you have, you have so many\n\n57:50.760 --> 57:55.040\n nice bags that you haven't such a big bag of aha moments already that you could just\n\n57:55.040 --> 57:56.880\n pull at it.\n\n57:56.880 --> 57:57.960\n That's one of the things.\n\n57:57.960 --> 58:05.400\n And one of the sad things about time and that nothing lasts forever and that we're all mortal.\n\n58:05.400 --> 58:14.660\n Let's not get into that discussion is, you know, if I see like, even when I ask for people\n\n58:14.660 --> 58:19.600\n to ask, like ask, I did a call for questions and people want to ask you questions and so\n\n58:19.600 --> 58:23.520\n many requests from people about like certain videos they would love you to do.\n\n58:23.520 --> 58:30.480\n It's such a pile and I think that's a, that's a sign of like admiration from people for\n\n58:30.480 --> 58:31.480\n sure.\n\n58:31.480 --> 58:35.200\n But it's like, it makes me sad cause like whenever I see them, people give ideas, they're\n\n58:35.200 --> 58:38.640\n all like very often really good ideas.\n\n58:38.640 --> 58:44.960\n And it's like, it's such a, it makes me sad in the same kind of way when I go through\n\n58:44.960 --> 58:49.160\n a library or through a bookstore, you see all these amazing books that you'll never\n\n58:49.160 --> 58:52.720\n get to open.\n\n58:52.720 --> 58:53.720\n So yeah.\n\n58:53.720 --> 58:59.200\n So you gotta enjoy the ones that you have, enjoy the books that are open and don't let\n\n58:59.200 --> 59:02.960\n yourself lament the ones that stay closed.\n\n59:02.960 --> 59:03.960\n What else?\n\n59:03.960 --> 59:05.120\n Is there any other magic to that day?\n\n59:05.120 --> 59:08.720\n So do you try to dedicate like a certain number of hours?\n\n59:08.720 --> 59:13.160\n Do you, Cal Newport has this deep work kind of idea.\n\n59:13.160 --> 59:17.640\n There's systematic people who like get really on top of, you know, they checklist of what\n\n59:17.640 --> 59:20.280\n they're going to do in the day and they like count their hours.\n\n59:20.280 --> 59:23.280\n And I am not a systematic person in that way.\n\n59:23.280 --> 59:24.560\n Which is probably a problem.\n\n59:24.560 --> 59:30.800\n I very likely would get more done if I was systematic in that way, but that doesn't happen.\n\n59:30.800 --> 59:35.920\n So you talk to me later in life and maybe I'll have like changed my ways and give you\n\n59:35.920 --> 59:37.360\n a very different answer.\n\n59:37.360 --> 59:42.760\n I think Benjamin Franklin like later in life figured out the rigor is these like very rigorous\n\n59:42.760 --> 59:45.000\n schedules and how to be productive.\n\n59:45.000 --> 59:47.640\n I think those schedules are much more fun to write.\n\n59:47.640 --> 59:50.840\n Like it's very fun to like write a schedule and make a blog post about like the perfect\n\n59:50.840 --> 59:54.360\n productive day that like might work for one person.\n\n59:54.360 --> 59:57.820\n But I don't know how much people get out of like reading them or trying to adopt someone\n\n59:57.820 --> 59:59.160\n else's style.\n\n59:59.160 --> 1:00:01.360\n And I'm not even sure that they've ever followed.\n\n1:00:01.360 --> 1:00:02.360\n Exactly.\n\n1:00:02.360 --> 1:00:05.640\n You're always going to write it as the best version of yourself.\n\n1:00:05.640 --> 1:00:10.240\n You're not going to explain the phenomenon of like wanting to get out of the bed, but\n\n1:00:10.240 --> 1:00:13.520\n not really wanting to get out of the bed and all of that.\n\n1:00:13.520 --> 1:00:18.720\n And just like zoning out for random reasons or the one that people probably don't touch\n\n1:00:18.720 --> 1:00:24.160\n at all is I try to check social media once a day, but I'm like only.\n\n1:00:24.160 --> 1:00:26.440\n So I post and that's it.\n\n1:00:26.440 --> 1:00:28.840\n When I post, I check the previous days.\n\n1:00:28.840 --> 1:00:31.880\n That's like my, what I try to do.\n\n1:00:31.880 --> 1:00:34.080\n That's what I do like 90% of the days.\n\n1:00:34.080 --> 1:00:38.680\n But then I'll go, I'll have like a two week period where it's just like, I'm checking\n\n1:00:38.680 --> 1:00:44.320\n the internet like, I mean, it's some, probably some scary number of times and a lot of people\n\n1:00:44.320 --> 1:00:45.320\n can resonate with that.\n\n1:00:45.320 --> 1:00:47.480\n I think it's a legitimate addiction.\n\n1:00:47.480 --> 1:00:52.740\n It's like, it's a dopamine addiction and it's, I don't know if it's a problem because as\n\n1:00:52.740 --> 1:00:55.920\n long as it's the kind of socializing, like if you're actually engaging with friends and\n\n1:00:55.920 --> 1:01:00.080\n engaging with other people's ideas, uh, I think it can be really useful.\n\n1:01:00.080 --> 1:01:01.480\n Well, I don't know.\n\n1:01:01.480 --> 1:01:07.080\n So like for sure I agree with you, but I'm, it's a, it's definitely an addiction because\n\n1:01:07.080 --> 1:01:09.640\n for me, I think it's true for a lot of people.\n\n1:01:09.640 --> 1:01:14.560\n I am very cognizant of the fact I just don't feel that happy.\n\n1:01:14.560 --> 1:01:20.280\n If I look at a day where I've checked social media a lot, like if I just aggregate, I did\n\n1:01:20.280 --> 1:01:26.160\n a self report, I'm sure I would find that I'm just like literally on like less happy\n\n1:01:26.160 --> 1:01:29.880\n with my life and myself after I've done that check.\n\n1:01:29.880 --> 1:01:36.000\n When I check it once a day, I'm very like, I'm happy I even like, cause I've seen it.\n\n1:01:36.000 --> 1:01:37.000\n Okay.\n\n1:01:37.000 --> 1:01:42.360\n One way to measure that is when somebody says something not nice to you on the internet\n\n1:01:42.360 --> 1:01:48.600\n is like when I check it once a day, I'm able to just like, like I smile, like, like I virtually,\n\n1:01:48.600 --> 1:01:51.520\n I think about them positively, empathetically, I send them love.\n\n1:01:51.520 --> 1:01:56.080\n I don't, I don't ever respond, but I just feel positively about the whole thing.\n\n1:01:56.080 --> 1:02:01.520\n If I check it, if I check like more than that, it starts eating at me.\n\n1:02:01.520 --> 1:02:07.600\n Like it start, there, there's an eating thing that, that happens like anxiety.\n\n1:02:07.600 --> 1:02:11.160\n It occupies a part of your mind that's not, doesn't seem to be healthy.\n\n1:02:11.160 --> 1:02:15.760\n Same with, I mean, you, you, you put stuff out on YouTube.\n\n1:02:15.760 --> 1:02:17.520\n I think it's important.\n\n1:02:17.520 --> 1:02:21.260\n I think you have a million dimensions that are interesting to you, but yeah, one of,\n\n1:02:21.260 --> 1:02:26.800\n one of the interesting ones is the study of education and the psychological aspect of\n\n1:02:26.800 --> 1:02:28.880\n putting stuff up on YouTube.\n\n1:02:28.880 --> 1:02:34.560\n I like now have completely stopped checking statistics of any kind.\n\n1:02:34.560 --> 1:02:39.920\n I've released an episode a 100 with my dad, conversation with my dad.\n\n1:02:39.920 --> 1:02:44.920\n He checks, he's probably listening to this stop.\n\n1:02:44.920 --> 1:02:49.560\n He checks the number of views on his, on his video, on his conversation.\n\n1:02:49.560 --> 1:02:54.480\n So he discovered like a reason he's new to this whole addiction and he just checks and\n\n1:02:54.480 --> 1:03:04.160\n he like, he'll text me or write to me, I just passed Dawkins and I love that so much.\n\n1:03:04.160 --> 1:03:05.160\n Yeah.\n\n1:03:05.160 --> 1:03:09.800\n So he's, uh, can I tell you a funny story in that effect of like parental use of YouTube?\n\n1:03:09.800 --> 1:03:14.480\n Uh, early on in the channel, uh, my mom would like text me.\n\n1:03:14.480 --> 1:03:19.200\n She's like, uh, the channel, the channel has had 990,000 views.\n\n1:03:19.200 --> 1:03:20.720\n The channel has had 991,000 views.\n\n1:03:20.720 --> 1:03:22.040\n I'm like, oh, that's cute.\n\n1:03:22.040 --> 1:03:24.880\n She's going to the little part on the about page where you see the total number of channel\n\n1:03:24.880 --> 1:03:25.880\n views.\n\n1:03:25.880 --> 1:03:27.880\n No, she didn't know about that.\n\n1:03:27.880 --> 1:03:33.200\n She had been going every day through all the videos and then adding them up and she thought\n\n1:03:33.200 --> 1:03:38.000\n she was like doing me this favor of providing me this like global analytic that, uh, otherwise\n\n1:03:38.000 --> 1:03:39.000\n wouldn't be visible.\n\n1:03:39.000 --> 1:03:40.000\n That's awesome.\n\n1:03:40.000 --> 1:03:43.680\n It's just like this addiction where you have some number you want to follow and like, yeah,\n\n1:03:43.680 --> 1:03:44.960\n it's funny that your dad had this.\n\n1:03:44.960 --> 1:03:46.960\n I think a lot of people have it.\n\n1:03:46.960 --> 1:03:52.080\n I think that's probably a beautiful thing for like parents cause they're legitimately,\n\n1:03:52.080 --> 1:03:53.080\n they're proud.\n\n1:03:53.080 --> 1:03:54.080\n Yeah.\n\n1:03:54.080 --> 1:03:55.080\n It's, it's born of love.\n\n1:03:55.080 --> 1:03:56.620\n It's great.\n\n1:03:56.620 --> 1:04:03.800\n The downside, I feel one, one of them is this is one interesting experience that you probably\n\n1:04:03.800 --> 1:04:07.560\n don't know much about cause comments on your videos are super positive.\n\n1:04:07.560 --> 1:04:12.320\n Uh, but people judge the quality of how something went.\n\n1:04:12.320 --> 1:04:16.200\n Like I see that with these conversations by the comments.\n\n1:04:16.200 --> 1:04:17.200\n Yeah.\n\n1:04:17.200 --> 1:04:22.440\n Like, I'm not talking about like, you know, people in their twenties and their thirties.\n\n1:04:22.440 --> 1:04:27.120\n I'm talking about like CEOs of major companies who don't have time.\n\n1:04:27.120 --> 1:04:31.620\n They basically, they literally, this is their evaluation metric.\n\n1:04:31.620 --> 1:04:35.820\n They're like, Ooh, the comments seem to be positive and that's really concerning to me.\n\n1:04:35.820 --> 1:04:40.320\n Most important lesson for any content creator to learn is that the commenting public is\n\n1:04:40.320 --> 1:04:42.800\n not representative of the actual public.\n\n1:04:42.800 --> 1:04:44.100\n And this is easy to see.\n\n1:04:44.100 --> 1:04:47.400\n Ask yourself, how often do you write comments on YouTube videos?\n\n1:04:47.400 --> 1:04:49.680\n Most people will realize I never do it.\n\n1:04:49.680 --> 1:04:53.760\n Some people realize they do, but the people who realize they never do it should understand\n\n1:04:53.760 --> 1:04:54.760\n that that's a sign.\n\n1:04:54.760 --> 1:04:58.120\n The kind of people who are like you aren't the ones leaving comments.\n\n1:04:58.120 --> 1:04:59.120\n And I think this is important.\n\n1:04:59.120 --> 1:05:03.000\n A number of respects, like, uh, in my case, I think I would think my content was better\n\n1:05:03.000 --> 1:05:06.360\n than it was if I just read comments cause people are super nice.\n\n1:05:06.360 --> 1:05:10.920\n The thing is the people who are bored by it are, are put off by it in some way or frustrated\n\n1:05:10.920 --> 1:05:11.960\n by it.\n\n1:05:11.960 --> 1:05:13.420\n Usually they just go away.\n\n1:05:13.420 --> 1:05:16.680\n You're certainly not going to watch the whole video, much less leave a comment on it.\n\n1:05:16.680 --> 1:05:20.720\n So there's a huge under representation of like negative feedback, like well intentioned\n\n1:05:20.720 --> 1:05:23.400\n negative feedback because very few people actively do that.\n\n1:05:23.400 --> 1:05:26.820\n Like watch the whole thing that they dislike, figure out what they disliked, articulate\n\n1:05:26.820 --> 1:05:27.820\n what they dislike.\n\n1:05:27.820 --> 1:05:32.280\n Um, there's plenty of negative feedback that's not well intentioned, but um, for like that\n\n1:05:32.280 --> 1:05:38.240\n golden kind, uh, I think a lot of YouTuber friends I have, uh, at least have gone through\n\n1:05:38.240 --> 1:05:44.520\n phases of like anxiety about the nature of comments, um, that stem from basically just\n\n1:05:44.520 --> 1:05:48.600\n this that it's like people who aren't necessarily representative of who they were going for\n\n1:05:48.600 --> 1:05:52.640\n or misinterpreted what they're trying to say or whatever have you, or we're focusing on\n\n1:05:52.640 --> 1:05:55.880\n things like personal appearances as opposed to like substance.\n\n1:05:55.880 --> 1:05:59.480\n Um, and they come away thinking like, oh, that's what everyone thinks, right?\n\n1:05:59.480 --> 1:06:01.720\n That's what everyone's response to this video was.\n\n1:06:01.720 --> 1:06:05.680\n Um, but a lot of the people who had the reaction you wanted them to have, like they probably\n\n1:06:05.680 --> 1:06:07.120\n didn't write it down.\n\n1:06:07.120 --> 1:06:09.640\n So very important to learn.\n\n1:06:09.640 --> 1:06:14.440\n It also translates to, um, realizing that you're not as important as you might think\n\n1:06:14.440 --> 1:06:15.440\n you are, right?\n\n1:06:15.440 --> 1:06:19.020\n Because all of the people commenting are the ones who love you the most and are like really\n\n1:06:19.020 --> 1:06:22.280\n asking you to like create certain things or like mad that you didn't create like a past\n\n1:06:22.280 --> 1:06:23.280\n thing.\n\n1:06:23.280 --> 1:06:26.560\n Um, I don't, I have such a problem.\n\n1:06:26.560 --> 1:06:30.060\n Like I have a very real problem with making promises about a type of content that I'll\n\n1:06:30.060 --> 1:06:34.680\n make and then either not following up on it soon or just like never following up on it.\n\n1:06:34.680 --> 1:06:35.680\n Yeah.\n\n1:06:35.680 --> 1:06:38.840\n Like the last time we talked, I think prom, I'm not sure a promise to me that you'll have\n\n1:06:38.840 --> 1:06:44.040\n music incorporated into your, like, uh, I'll share it with you a private link, but there's\n\n1:06:44.040 --> 1:06:45.720\n an example of like what I had in mind.\n\n1:06:45.720 --> 1:06:50.120\n I like did a version of it, um, and I'm like, Oh, I think there's a better version of this\n\n1:06:50.120 --> 1:06:52.100\n that might exist one day.\n\n1:06:52.100 --> 1:06:55.800\n So it's now on the, like the back burner, it's like, it's sitting there.\n\n1:06:55.800 --> 1:06:59.400\n It was like a live performance at this one thing, I think next, next circumstance that\n\n1:06:59.400 --> 1:07:03.740\n I'm like doing another recorded live performance that like fits having that then in a better\n\n1:07:03.740 --> 1:07:06.040\n recording context, maybe I'll make it nice in public.\n\n1:07:06.040 --> 1:07:08.040\n Maybe a while, but exactly.\n\n1:07:08.040 --> 1:07:09.040\n Right.\n\n1:07:09.040 --> 1:07:12.400\n Um, the point I was going to make those, like, I know I'm bad about following up on stuff,\n\n1:07:12.400 --> 1:07:14.800\n uh, which is an actual problem.\n\n1:07:14.800 --> 1:07:18.440\n It's born of the fact that I have a sense of what will be like good content when it\n\n1:07:18.440 --> 1:07:19.440\n won't be.\n\n1:07:19.440 --> 1:07:24.600\n Um, but this can actually be credibly disheartening because a ton of comments that I see are people\n\n1:07:24.600 --> 1:07:29.160\n who are like, uh, frustrated, usually in a benevolent way that like I haven't followed\n\n1:07:29.160 --> 1:07:32.680\n through on like X and X, which I get and I should do that.\n\n1:07:32.680 --> 1:07:36.400\n But what's comforting thought for me is that when there's a topic I haven't promised, but\n\n1:07:36.400 --> 1:07:40.600\n I am working on and I'm excited about, it's like the people who would really like this\n\n1:07:40.600 --> 1:07:44.240\n don't know that it's coming and don't know to like comment to that effect and like the\n\n1:07:44.240 --> 1:07:49.380\n commenting public that I'm seeing is not representative of like who I think this other project will\n\n1:07:49.380 --> 1:07:50.380\n touch meaningfully.\n\n1:07:50.380 --> 1:07:51.380\n Yeah.\n\n1:07:51.380 --> 1:07:54.240\n So focus on the future on the thing you're creating now, just like the, uh, yeah, the\n\n1:07:54.240 --> 1:07:55.240\n art of it.\n\n1:07:55.240 --> 1:08:00.760\n One of the people is really inspiring to me in that regard because I've really seen it\n\n1:08:00.760 --> 1:08:08.720\n in persons, um, Joe Rogan, he doesn't read comments, but not just that he doesn't give\n\n1:08:08.720 --> 1:08:09.720\n a damn.\n\n1:08:09.720 --> 1:08:10.720\n Hmm.\n\n1:08:10.720 --> 1:08:13.960\n He like legitimate, he's not like clueless about it.\n\n1:08:13.960 --> 1:08:19.800\n He's like, just like the richness and the depth of a smile he has when he just experiences\n\n1:08:19.800 --> 1:08:28.420\n the moment with you like offline, you can tell he doesn't give a damn about like, like\n\n1:08:28.420 --> 1:08:31.760\n about anything, about what people think about whether if it's on a podcast, you talk to\n\n1:08:31.760 --> 1:08:36.480\n them or whether offline about just, it's not there.\n\n1:08:36.480 --> 1:08:41.420\n Like what other people think, how, how, um, even like what the rest of the day looks like\n\n1:08:41.420 --> 1:08:48.040\n is just deeply in the moment, uh, or like, especially like is, is what we're doing going\n\n1:08:48.040 --> 1:08:50.720\n to make for a good Instagram photo or something like that?\n\n1:08:50.720 --> 1:08:52.880\n It doesn't think like that at all.\n\n1:08:52.880 --> 1:08:58.360\n It's I think for actually quite a lot of people, he's an inspiration in that way, but it was\n\n1:08:58.360 --> 1:09:06.760\n and in real life, I show that you can be very successful, not giving a damn about, um, about\n\n1:09:06.760 --> 1:09:07.760\n comments.\n\n1:09:07.760 --> 1:09:12.940\n And it sounds, it sounds bad not to read comments cause it's like, well, there's a huge number\n\n1:09:12.940 --> 1:09:15.120\n of people who are deeply passionate about what you do.\n\n1:09:15.120 --> 1:09:20.760\n So you're what ignoring them, but at the same time, the nature of our platforms is such\n\n1:09:20.760 --> 1:09:27.200\n that the cost of listening to all the positive people who are really close to you, who are\n\n1:09:27.200 --> 1:09:32.240\n incredible people have been, you know, I've made a great community that you can learn\n\n1:09:32.240 --> 1:09:40.840\n a lot from the cost of listening to those folks is also the cost of your psychology\n\n1:09:40.840 --> 1:09:47.560\n slowly being degraded by the natural underlying toxicity of the internet.\n\n1:09:47.560 --> 1:09:51.720\n Engage with a handful of people deeply rather than like as many people as you can in a shallow\n\n1:09:51.720 --> 1:09:52.720\n way.\n\n1:09:52.720 --> 1:09:55.000\n I think that's a good lesson for social media usage.\n\n1:09:55.000 --> 1:10:00.160\n Um, like platforms in general, like choose, choose just a handful of things to engage\n\n1:10:00.160 --> 1:10:03.720\n with and engage with it very well in a way that you feel proud of and don't worry about\n\n1:10:03.720 --> 1:10:04.720\n the rest.\n\n1:10:04.720 --> 1:10:09.400\n Honestly, I think the best social media platform is texting.\n\n1:10:09.400 --> 1:10:10.400\n That's my favorite.\n\n1:10:10.400 --> 1:10:12.080\n That's my go to social media platform.\n\n1:10:12.080 --> 1:10:17.560\n Well, yeah, the best social media interactions like real life, not social media, but social\n\n1:10:17.560 --> 1:10:18.560\n interaction.\n\n1:10:18.560 --> 1:10:19.560\n Oh yeah.\n\n1:10:19.560 --> 1:10:20.560\n No, no, no question there.\n\n1:10:20.560 --> 1:10:21.560\n I think everyone should agree with that.\n\n1:10:21.560 --> 1:10:26.440\n Which sucks because, uh, it's been challenged now with the current situation and we're trying\n\n1:10:26.440 --> 1:10:31.560\n to figure out what kind of platform can be created that we can do remote communication\n\n1:10:31.560 --> 1:10:32.560\n that still is effective.\n\n1:10:32.560 --> 1:10:34.480\n It's important for education.\n\n1:10:34.480 --> 1:10:38.040\n It's important for just the question of education right now.\n\n1:10:38.040 --> 1:10:39.120\n Yeah.\n\n1:10:39.120 --> 1:10:44.560\n So on that topic, uh, you've done a series of live streams called lockdown math and you\n\n1:10:44.560 --> 1:10:48.920\n know, you want live, which is different than you usually do.\n\n1:10:48.920 --> 1:10:53.160\n Maybe one, can you talk about how that feel?\n\n1:10:53.160 --> 1:10:58.080\n What's that experience like like in your own, when you look back, like, is that an effective\n\n1:10:58.080 --> 1:10:59.080\n way?\n\n1:10:59.080 --> 1:11:01.040\n Did you find a being able to teach?\n\n1:11:01.040 --> 1:11:07.720\n And if so, is there a lessons for this world where all of these educators are now trying\n\n1:11:07.720 --> 1:11:11.120\n to figure out how the heck do I teach remotely?\n\n1:11:11.120 --> 1:11:13.280\n For me, it was very different, as different as you can get.\n\n1:11:13.280 --> 1:11:15.080\n I'm on camera, which I'm usually not.\n\n1:11:15.080 --> 1:11:17.240\n I'm doing it live, which is nerve wracking.\n\n1:11:17.240 --> 1:11:21.920\n Um, it was a slightly different like level of topics, although realistically I'm just\n\n1:11:21.920 --> 1:11:24.360\n talking about things I'm interested in no matter what.\n\n1:11:24.360 --> 1:11:28.520\n I think the reason I did that was this thought that a ton of people are looking to learn\n\n1:11:28.520 --> 1:11:33.160\n remotely the rate at which I usually put out content is too slow to be actively helpful.\n\n1:11:33.160 --> 1:11:36.880\n Let me just do some biweekly lectures that if you're looking for a place to point your\n\n1:11:36.880 --> 1:11:39.920\n students, if you're a student looking for a place to be edified about math, just tune\n\n1:11:39.920 --> 1:11:40.920\n in at these times.\n\n1:11:40.920 --> 1:11:45.000\n Um, and in that sense, I think it was, you know, a success for those who followed with\n\n1:11:45.000 --> 1:11:46.000\n it.\n\n1:11:46.000 --> 1:11:50.240\n It was a really rewarding experience for me to see how people engaged with it.\n\n1:11:50.240 --> 1:11:54.800\n Um, part of the fun of the live interaction was to actually like I do these live quizzes\n\n1:11:54.800 --> 1:11:57.820\n and see how people would answer and try to shape the lesson based on that or see what\n\n1:11:57.820 --> 1:11:59.960\n questions people were asking in the audience.\n\n1:11:59.960 --> 1:12:03.880\n I would love to, if I did more things like that in the future, kind of tighten that feedback\n\n1:12:03.880 --> 1:12:05.440\n loop even more.\n\n1:12:05.440 --> 1:12:10.960\n Um, I think for, you know, you asked about like if this can be relevant to educators,\n\n1:12:10.960 --> 1:12:15.040\n like 100% online teaching is basically a form of live streaming now.\n\n1:12:15.040 --> 1:12:17.280\n Um, and usually it happens through zoom.\n\n1:12:17.280 --> 1:12:22.440\n I think if teachers view what they're doing as a kind of performance and a kind of live\n\n1:12:22.440 --> 1:12:27.660\n stream performance, um, that would probably be pretty healthy because zoom can be kind\n\n1:12:27.660 --> 1:12:28.660\n of awkward.\n\n1:12:28.660 --> 1:12:32.820\n Um, and I brought up this little blog post actually just on like just what our setup\n\n1:12:32.820 --> 1:12:37.040\n looked like if you want to adopt it yourself and how to integrate, um, like the broadcasting\n\n1:12:37.040 --> 1:12:39.400\n software OBS with zoom or things like that.\n\n1:12:39.400 --> 1:12:40.880\n It was really sorry to pause on that.\n\n1:12:40.880 --> 1:12:45.560\n I mean, yeah, maybe we could look at the blog post, but it looked really nice.\n\n1:12:45.560 --> 1:12:48.440\n The thing is, I knew nothing about any of that stuff before I started.\n\n1:12:48.440 --> 1:12:50.320\n I had a friend who knew a fair bit.\n\n1:12:50.320 --> 1:12:52.640\n Um, and so he kind of helped show me the routes.\n\n1:12:52.640 --> 1:12:57.080\n One of the things that I realized is that you could, as a teacher, like it doesn't take\n\n1:12:57.080 --> 1:12:59.680\n that much to make things look and feel pretty professional.\n\n1:12:59.680 --> 1:13:04.160\n Um, like one component of it is as soon as you hook things up with the broadcasting software,\n\n1:13:04.160 --> 1:13:07.840\n rather than just doing like screen sharing, you can set up different scenes and then you\n\n1:13:07.840 --> 1:13:11.320\n can like have keyboard shortcuts to transition between those scenes.\n\n1:13:11.320 --> 1:13:14.560\n So you don't need a production studio with a director calling like, go to camera three,\n\n1:13:14.560 --> 1:13:17.040\n go to camera two, like onto the screen capture.\n\n1:13:17.040 --> 1:13:18.820\n Instead you can have control of that.\n\n1:13:18.820 --> 1:13:21.800\n And it took a little bit of practice and I would mess it up now and then, but I think\n\n1:13:21.800 --> 1:13:25.800\n I had it decently smooth such that, you know, I'm talking to the camera and then we're doing\n\n1:13:25.800 --> 1:13:26.800\n something on the paper.\n\n1:13:26.800 --> 1:13:31.080\n Then we're doing like a, um, playing with a Desmos graph or something.\n\n1:13:31.080 --> 1:13:34.240\n And something that I think in the past would have required a production team, you can actually\n\n1:13:34.240 --> 1:13:38.000\n do as a solo operation, um, and in particular as a teacher.\n\n1:13:38.000 --> 1:13:42.760\n And I think it's worth it to try to do that because, uh, two reasons, one, you might get\n\n1:13:42.760 --> 1:13:46.400\n more engagement from the students, but the biggest reason I think one of the like best\n\n1:13:46.400 --> 1:13:50.440\n things that can come out of this pandemic education wise is if we turn a bunch of teachers\n\n1:13:50.440 --> 1:13:51.920\n into content creators.\n\n1:13:51.920 --> 1:13:55.920\n And if we take lessons that are usually done in these one off settings and like start to\n\n1:13:55.920 --> 1:14:01.300\n get in the habit of, um, sometimes I'll use the phrase commoditizing explanation where\n\n1:14:01.300 --> 1:14:06.680\n what you want is whatever a thing a student wants to learn.\n\n1:14:06.680 --> 1:14:11.020\n It just seems inefficient to me that that lesson is taught millions of times over in\n\n1:14:11.020 --> 1:14:14.160\n parallel across many different classrooms in the world.\n\n1:14:14.160 --> 1:14:18.120\n Like year to year, you've got a given algebra one lesson that's just taught like literally\n\n1:14:18.120 --> 1:14:21.640\n millions of times, um, by different people.\n\n1:14:21.640 --> 1:14:27.080\n What should happen is that there's the small handful of explanations online, uh, that exists\n\n1:14:27.080 --> 1:14:30.640\n so that when someone needs that explanation, they can go to it, that the time in classroom\n\n1:14:30.640 --> 1:14:34.040\n is spent on all of the parts of teaching and education that aren't explanation, which is\n\n1:14:34.040 --> 1:14:35.400\n most of it.\n\n1:14:35.400 --> 1:14:36.400\n Right.\n\n1:14:36.400 --> 1:14:40.720\n Um, and the way to get there is to basically have more people who are already explaining,\n\n1:14:40.720 --> 1:14:43.960\n publish their explanations and have it in a publicized forum.\n\n1:14:43.960 --> 1:14:49.340\n So if during a pandemic you can have people automatically creating online content cause\n\n1:14:49.340 --> 1:14:53.400\n it has to be online, but getting into the habit of doing it in a, um, in a way that\n\n1:14:53.400 --> 1:14:57.800\n doesn't just feel like a zoom call that happened to be recorded, but it actually feels like\n\n1:14:57.800 --> 1:15:03.680\n a, a piece that was always going to be publicized to more people than just your students that\n\n1:15:03.680 --> 1:15:05.480\n can be really powerful.\n\n1:15:05.480 --> 1:15:11.160\n And there's an improvement process there, like so being self critical and growing, like,\n\n1:15:11.160 --> 1:15:17.680\n you know, like I guess YouTubers go through this process of like putting out some content\n\n1:15:17.680 --> 1:15:24.000\n and like nobody caring about it and then trying to figure out like, and basically improving\n\n1:15:24.000 --> 1:15:28.000\n figure out like, why did nobody care?\n\n1:15:28.000 --> 1:15:31.280\n What can I, you know, and they come up with all kinds of answers, which may or may not\n\n1:15:31.280 --> 1:15:35.600\n be correct, but doesn't matter because the answer leads to improvement.\n\n1:15:35.600 --> 1:15:40.520\n So you're being constantly self critical, self analytical, it should be better to say.\n\n1:15:40.520 --> 1:15:43.060\n So you think of like, how can I make the audio better?\n\n1:15:43.060 --> 1:15:45.680\n Like all the basic things.\n\n1:15:45.680 --> 1:15:52.240\n Maybe one, one question to ask, cause, uh, well, by way of, uh, Russ Tedrick is a robotics\n\n1:15:52.240 --> 1:15:55.920\n professor at MIT, one of my favorite people, a big fan of yours.\n\n1:15:55.920 --> 1:15:57.720\n Uh, he watched our first conversation.\n\n1:15:57.720 --> 1:16:01.320\n I just interviewed him a couple of weeks ago.\n\n1:16:01.320 --> 1:16:08.320\n He, uh, he teaches this course in the under actuated robotics, which is, um, like robotic\n\n1:16:08.320 --> 1:16:13.560\n systems when you can't control everything, like when you're like, we as humans, when\n\n1:16:13.560 --> 1:16:17.680\n we walk, we're always falling forward, which means like it's gravity.\n\n1:16:17.680 --> 1:16:18.680\n You can't control it.\n\n1:16:18.680 --> 1:16:21.800\n You just hope you can catch yourself, but that's not all guaranteed.\n\n1:16:21.800 --> 1:16:23.000\n It depends on the surface.\n\n1:16:23.000 --> 1:16:24.480\n So like that's under actuated.\n\n1:16:24.480 --> 1:16:26.360\n You can't control everything.\n\n1:16:26.360 --> 1:16:31.760\n The number of actuators, uh, the degrees of freedoms you have is not enough to fully control\n\n1:16:31.760 --> 1:16:32.760\n the system.\n\n1:16:32.760 --> 1:16:33.760\n So I don't know.\n\n1:16:33.760 --> 1:16:35.680\n It's a really, I think, beautiful, fascinating class.\n\n1:16:35.680 --> 1:16:37.240\n He puts it online.\n\n1:16:37.240 --> 1:16:39.040\n Um, it's quite popular.\n\n1:16:39.040 --> 1:16:40.440\n He does an incredible job teaching.\n\n1:16:40.440 --> 1:16:45.240\n He puts it online every time, but he's kind of been interested in like crisping it up,\n\n1:16:45.240 --> 1:16:50.480\n like, you know, making it, uh, you know, innovating in different kinds of ways.\n\n1:16:50.480 --> 1:16:56.280\n And he was inspired by the work you do, because I think in his work, he can do similar kinds\n\n1:16:56.280 --> 1:17:01.240\n of explanations as you're doing, like revealing the beauty of it and spending like months\n\n1:17:01.240 --> 1:17:03.360\n in preparing a single video.\n\n1:17:03.360 --> 1:17:06.360\n Uh, and he's interested in how to do that.\n\n1:17:06.360 --> 1:17:07.840\n That's why he listened to the conversation.\n\n1:17:07.840 --> 1:17:16.000\n He's playing with manum, but he had this question of, you know, um, of, uh, you know, like in\n\n1:17:16.000 --> 1:17:21.520\n my apartment where we did the interview, I have like curtains, like the, for like a black\n\n1:17:21.520 --> 1:17:28.800\n curtain, not this, uh, this is, this is a adjacent mansion that we're in that I also,\n\n1:17:28.800 --> 1:17:33.600\n uh, but you basically just have, I have like a black curtain, whatever that, you know,\n\n1:17:33.600 --> 1:17:38.080\n makes it really easy to set up a filming situation with cameras that we have here, these microphones.\n\n1:17:38.080 --> 1:17:41.560\n He was asking, you know, what kind of equipment do you recommend?\n\n1:17:41.560 --> 1:17:43.640\n I guess like your blog post is a good one.\n\n1:17:43.640 --> 1:17:49.000\n I said, I don't recommend this is excessive and actually really hard to work with.\n\n1:17:49.000 --> 1:17:55.160\n So I wonder, I mean, uh, is there something you would recommend in terms of equipment?\n\n1:17:55.160 --> 1:18:00.880\n Like is, is it, do you re do you think like lapel mics, like USB mics, what do you, for\n\n1:18:00.880 --> 1:18:06.280\n my narration, I use a USB mic for the streams that used to lapel mic, uh, the narration,\n\n1:18:06.280 --> 1:18:07.280\n it's a blue Yeti.\n\n1:18:07.280 --> 1:18:12.120\n Um, I'm forgetting actually the name of the lapel mic, but it was probably like a road\n\n1:18:12.120 --> 1:18:13.680\n of some kind.\n\n1:18:13.680 --> 1:18:17.120\n Um, but is it hard to figure out how to make the audio sound good?\n\n1:18:17.120 --> 1:18:21.600\n Oh, I mean, listen to all the early videos on my channel and clearly like I'm terrible\n\n1:18:21.600 --> 1:18:23.640\n at this for, for some reason.\n\n1:18:23.640 --> 1:18:25.760\n Um, I just couldn't get audio for awhile.\n\n1:18:25.760 --> 1:18:28.120\n I think I, it's weird when you hear your own voice.\n\n1:18:28.120 --> 1:18:31.820\n So you hear it, you're like, this sounds weird and it's hard to notice it sound weird because\n\n1:18:31.820 --> 1:18:36.160\n you're not used to your own voice or they're like actual audio artifacts at play.\n\n1:18:36.160 --> 1:18:43.120\n Um, so, uh, and then video is just for the lockdown, just the camera, like you said,\n\n1:18:43.120 --> 1:18:47.260\n it was probably streaming somehow through the, yeah, there were two GH five cameras.\n\n1:18:47.260 --> 1:18:49.520\n One that was mounted overhead over a piece of paper.\n\n1:18:49.520 --> 1:18:53.640\n You could also use like an iPad or a Wacom tablet to do your writing electronically,\n\n1:18:53.640 --> 1:18:57.840\n but I just wanted the paper feel, um, one on the face.\n\n1:18:57.840 --> 1:18:58.840\n There's two.\n\n1:18:58.840 --> 1:19:02.400\n Um, again, I don't know, I'm like just not actually the one to ask this cause I like\n\n1:19:02.400 --> 1:19:08.400\n animate stuff usually, but, uh, each of them like has a compressor object that makes it\n\n1:19:08.400 --> 1:19:12.880\n such that the camera output goes into the computer USB, but like gets compressed before\n\n1:19:12.880 --> 1:19:13.880\n it does that.\n\n1:19:13.880 --> 1:19:20.120\n The, the live aspect of it, do you, do you regret doing it live?\n\n1:19:20.120 --> 1:19:21.120\n Not at all.\n\n1:19:21.120 --> 1:19:26.360\n Um, I think I do think the content might be like much less sharp and tight than if it\n\n1:19:26.360 --> 1:19:30.360\n were something, even that I just recorded like that and then edited later.\n\n1:19:30.360 --> 1:19:34.080\n But I do like something that I do to be out there to show like, Hey, this is what it's\n\n1:19:34.080 --> 1:19:35.080\n like.\n\n1:19:35.080 --> 1:19:36.080\n Raw.\n\n1:19:36.080 --> 1:19:37.080\n This is what it's like when I make mistakes.\n\n1:19:37.080 --> 1:19:41.240\n Um, this is like the pace of thinking, um, I like the live interaction of it.\n\n1:19:41.240 --> 1:19:42.760\n I think that made it better.\n\n1:19:42.760 --> 1:19:45.480\n Uh, I probably would do it on a different channel.\n\n1:19:45.480 --> 1:19:49.120\n I think, um, if I did series like that in the future, just because it's, it's a different\n\n1:19:49.120 --> 1:19:50.120\n style.\n\n1:19:50.120 --> 1:19:53.240\n It's probably a different target audience and, um, kind of keep clean what three blue\n\n1:19:53.240 --> 1:19:58.080\n and brown is about versus, uh, the benefits of like live lectures.\n\n1:19:58.080 --> 1:20:04.280\n Do you, uh, suggest like in this time of COVID that people like Russ or other educators tried\n\n1:20:04.280 --> 1:20:12.080\n to go like the, the shorter, like 20 minute videos that are like really well planned out\n\n1:20:12.080 --> 1:20:13.080\n or scripted.\n\n1:20:13.080 --> 1:20:15.680\n You really think through, you slowly design.\n\n1:20:15.680 --> 1:20:16.680\n So it's not live.\n\n1:20:16.680 --> 1:20:20.360\n Do you see like that being an important part of, um, what they do?\n\n1:20:20.360 --> 1:20:21.360\n Yeah.\n\n1:20:21.360 --> 1:20:25.880\n Well, what I think teachers like Russ should do is, um, choose the small handful of topics\n\n1:20:25.880 --> 1:20:27.400\n that they're going to do just really well.\n\n1:20:27.400 --> 1:20:31.320\n They want to create the best short explanation of it in the world that will be one of those\n\n1:20:31.320 --> 1:20:35.160\n handfuls in a world where you have commoditized explanation, right?\n\n1:20:35.160 --> 1:20:37.440\n Most of the lectures should be done just normally.\n\n1:20:37.440 --> 1:20:39.040\n Um, so put thought and planning into it.\n\n1:20:39.040 --> 1:20:42.920\n I'm sure he's a wonderful teacher and like knows all about that, but maybe choose those\n\n1:20:42.920 --> 1:20:44.440\n small handful of topics.\n\n1:20:44.440 --> 1:20:49.560\n Um, do what beneficial for me sometimes is I do sample lessons with people on that topic\n\n1:20:49.560 --> 1:20:52.560\n to get some sense of how other people think about it.\n\n1:20:52.560 --> 1:20:56.840\n Let that inform how you want to, um, edit it or script it or whatever format you want\n\n1:20:56.840 --> 1:20:57.840\n to do.\n\n1:20:57.840 --> 1:20:59.960\n Some people are comfortable just explaining it and editing later.\n\n1:20:59.960 --> 1:21:02.640\n I'm more comfortable like writing it out and thinking in that setting.\n\n1:21:02.640 --> 1:21:03.640\n Yeah.\n\n1:21:03.640 --> 1:21:04.640\n It's kind of sad.\n\n1:21:04.640 --> 1:21:05.640\n Sorry to interrupt.\n\n1:21:05.640 --> 1:21:10.960\n Uh, it's, it's a little bit sad to me to see how much knowledge is lost.\n\n1:21:10.960 --> 1:21:16.200\n Like just, just like you mentioned, there's professors, like we can take my dad, for example,\n\n1:21:16.200 --> 1:21:21.800\n to blow up his ego a little bit, but he's a, he's a great teacher and he knows plasma,\n\n1:21:21.800 --> 1:21:23.900\n plasma chemistry, plasma physics really well.\n\n1:21:23.900 --> 1:21:31.520\n So he can very simply explain some beautiful, but otherwise, uh, complicated concepts.\n\n1:21:31.520 --> 1:21:37.520\n And it's sad that like, if you Google plasma or like for plasma physics, like there's no\n\n1:21:37.520 --> 1:21:38.520\n videos.\n\n1:21:38.520 --> 1:21:43.120\n And just imagine if every one of those excellent teachers like your father or like Russ, um,\n\n1:21:43.120 --> 1:21:46.940\n even if they just chose one topic this year, they're like, I'm going to make the best video\n\n1:21:46.940 --> 1:21:48.160\n that I can on this topic.\n\n1:21:48.160 --> 1:21:52.360\n If every one of the great teachers did that, the internet would be replete and it's already\n\n1:21:52.360 --> 1:21:53.800\n replete with great explanations.\n\n1:21:53.800 --> 1:21:56.840\n But it would be even more so with all the niche, great explanations and like anything\n\n1:21:56.840 --> 1:21:57.840\n you want to learn.\n\n1:21:57.840 --> 1:22:02.480\n Um, and there's a self interest to it for, in terms of teachers, in terms of even, so\n\n1:22:02.480 --> 1:22:08.160\n if you take Russ, for example, it's not that he's teaching something like he teaches his\n\n1:22:08.160 --> 1:22:11.600\n main thing, his thing he's deeply passionate about.\n\n1:22:11.600 --> 1:22:20.360\n And from a selfish perspective, it's also just like, I mean, it's a, it's a, it's like\n\n1:22:20.360 --> 1:22:27.680\n publishing a paper in a really, uh, like nature has like letters, like accessible publication.\n\n1:22:27.680 --> 1:22:35.500\n It's just going to guarantee that your work, that your passion is seen by a huge number\n\n1:22:35.500 --> 1:22:39.080\n of people, whatever the definition of huge is, doesn't matter.\n\n1:22:39.080 --> 1:22:42.400\n It's much more than it otherwise, uh, would be.\n\n1:22:42.400 --> 1:22:47.960\n And it's those lectures that tell early students what to be interested in at the moment.\n\n1:22:47.960 --> 1:22:51.360\n I think students are disproportionately interested in the things that are well represented on\n\n1:22:51.360 --> 1:22:52.440\n YouTube.\n\n1:22:52.440 --> 1:22:56.000\n So to any educator out there, if you're wondering, Hey, I want more like grad students in my\n\n1:22:56.000 --> 1:22:59.000\n department, like what's the best way to recruit grad students?\n\n1:22:59.000 --> 1:23:02.040\n It's like, make the best video you can and then wait eight years.\n\n1:23:02.040 --> 1:23:05.560\n And then you're going to have a pile of like excellent grad students for that department.\n\n1:23:05.560 --> 1:23:12.920\n And one of the lessons I think your channel teaches is there's appeal of explaining just\n\n1:23:12.920 --> 1:23:19.680\n something beautiful, explaining it cleanly, technically not doing a marketing video about\n\n1:23:19.680 --> 1:23:21.120\n why topology is great.\n\n1:23:21.120 --> 1:23:24.000\n There's yeah, that's the, there's people interested in this stuff.\n\n1:23:24.000 --> 1:23:29.280\n I mean, uh, one of the greatest channels like Matt, it's not even a math channel, but the\n\n1:23:29.280 --> 1:23:33.200\n channel with greatest math content is Vsauce, like interviewed.\n\n1:23:33.200 --> 1:23:38.800\n If imagine you were to propose making a video that explains the Banach Tarski paradox substantively,\n\n1:23:38.800 --> 1:23:39.800\n right?\n\n1:23:39.800 --> 1:23:45.440\n Like not shying around it, maybe not describing things in terms of, um, like the group theoretic\n\n1:23:45.440 --> 1:23:51.920\n terminology that you'd usually see in a paper, but the actual results, um, that went into\n\n1:23:51.920 --> 1:23:56.160\n this idea of like breaking apart a sphere, proposing that to like a network TV station\n\n1:23:56.160 --> 1:23:59.880\n saying, yeah, I'm going to, I'm going to do this in depth talk of the Banach Tarski paradox.\n\n1:23:59.880 --> 1:24:02.120\n I'm pretty sure it's going to reach 20 million people.\n\n1:24:02.120 --> 1:24:04.000\n It's like, get out of here.\n\n1:24:04.000 --> 1:24:05.760\n Like no, no one cares about that.\n\n1:24:05.760 --> 1:24:08.720\n No one's interested in anything even anywhere near that.\n\n1:24:08.720 --> 1:24:11.060\n But then you have Michael's quirky personality around it.\n\n1:24:11.060 --> 1:24:16.200\n And just people that are actually hungry for that kind of depth, um, then you don't need\n\n1:24:16.200 --> 1:24:19.280\n like the approval of some higher network.\n\n1:24:19.280 --> 1:24:22.080\n You can just do it and let the people speak for themselves.\n\n1:24:22.080 --> 1:24:26.720\n So I think, you know, if your father was to make something on plasma physics or, um, if\n\n1:24:26.720 --> 1:24:32.680\n we were to have like, uh, underactualized robotics, underactuated, underactuated, yes,\n\n1:24:32.680 --> 1:24:37.360\n not underactualized, plenty actualized underactuated robotics.\n\n1:24:37.360 --> 1:24:41.520\n Robotics is under actualized currently.\n\n1:24:41.520 --> 1:24:46.100\n So even if it's things that you might think are niche, I bet you'll be surprised by how\n\n1:24:46.100 --> 1:24:49.360\n many people, um, actually engage with it really deeply.\n\n1:24:49.360 --> 1:24:52.720\n Although I just psychologically watching him, I can't speak for a lot of people.\n\n1:24:52.720 --> 1:24:53.880\n I can speak for my dad.\n\n1:24:53.880 --> 1:25:00.200\n I think there's a, there's a little bit of a skill gap, but I think that could be overcome.\n\n1:25:00.200 --> 1:25:01.200\n That's pretty basic.\n\n1:25:01.200 --> 1:25:04.160\n None of us know how to make videos when we start the first stuff I made was terrible\n\n1:25:04.160 --> 1:25:05.160\n in a number of respects.\n\n1:25:05.160 --> 1:25:09.280\n Like look at the earliest videos I need in the YouTube channel, except for captain disillusion.\n\n1:25:09.280 --> 1:25:13.480\n And they're all like terrible versions of whatever they are now.\n\n1:25:13.480 --> 1:25:19.480\n But the thing I've noticed, especially like with world experts is it's the same thing\n\n1:25:19.480 --> 1:25:25.320\n that I'm sure you went through, which is like, um, fear of like embarrassment.\n\n1:25:25.320 --> 1:25:29.720\n Like they, they definitely, it's, it's the same reason.\n\n1:25:29.720 --> 1:25:35.120\n Like I feel that anytime I put out a video, I don't know if you still feel that.\n\n1:25:35.120 --> 1:25:39.360\n But like, I don't know, it's this imposter syndrome.\n\n1:25:39.360 --> 1:25:41.040\n Like who am I to talk about this?\n\n1:25:41.040 --> 1:25:46.320\n And that that's true for like even things that you've studied for like your whole life.\n\n1:25:46.320 --> 1:25:47.400\n Uh, I don't know.\n\n1:25:47.400 --> 1:25:50.160\n It's scary to post stuff on YouTube.\n\n1:25:50.160 --> 1:25:51.160\n It is scary.\n\n1:25:51.160 --> 1:25:57.700\n Uh, I honestly wish that more of the people who had that modesty to say, who am I to\n\n1:25:57.700 --> 1:25:58.700\n post this?\n\n1:25:58.700 --> 1:26:00.200\n We're the ones actually posting it.\n\n1:26:00.200 --> 1:26:01.200\n That's right.\n\n1:26:01.200 --> 1:26:04.680\n I mean, the honest problem is like a lot of the educational content is posted by people\n\n1:26:04.680 --> 1:26:09.680\n who like, we're just starting to research it two weeks ago and are on a certain schedule\n\n1:26:09.680 --> 1:26:15.960\n and who maybe should think like, who am I to explain and choose your favorite topic,\n\n1:26:15.960 --> 1:26:17.720\n quantum mechanics or something.\n\n1:26:17.720 --> 1:26:23.760\n Um, and the people who have the self awareness, uh, to not post are probably the people also\n\n1:26:23.760 --> 1:26:27.400\n best positioned to give a good, honest explanation of it.\n\n1:26:27.400 --> 1:26:32.480\n That's why there's a lot of value in a channel like numberphile where they basically trap\n\n1:26:32.480 --> 1:26:38.240\n a really smart person and force them to explain stuff on a bronze sheet of paper.\n\n1:26:38.240 --> 1:26:41.760\n So, but of course that's not scalable as a single channel.\n\n1:26:41.760 --> 1:26:45.640\n If they, if there's anything beautiful that it could be done as people take it in their\n\n1:26:45.640 --> 1:26:51.220\n own hands, uh, educators, which is again, circling back, I do think the pandemic will\n\n1:26:51.220 --> 1:26:54.560\n serve to force a lot of people's hands.\n\n1:26:54.560 --> 1:26:56.940\n You're going to be making online content anyway.\n\n1:26:56.940 --> 1:26:58.940\n It's happening, right?\n\n1:26:58.940 --> 1:27:01.520\n Just hit that publish button and see how it goes.\n\n1:27:01.520 --> 1:27:02.720\n Yeah.\n\n1:27:02.720 --> 1:27:03.720\n See how it goes.\n\n1:27:03.720 --> 1:27:10.040\n The cool thing about YouTube is it might not go for a while, but like 10 years later, right?\n\n1:27:10.040 --> 1:27:11.040\n Yeah.\n\n1:27:11.040 --> 1:27:14.440\n It'll be like, this, the thing this, what people don't understand with YouTube, at least\n\n1:27:14.440 --> 1:27:20.000\n for now, at least that's my hope with it is, uh, it's a leg.\n\n1:27:20.000 --> 1:27:24.800\n It's a, it's literally better than publishing a book in terms of the legacy.\n\n1:27:24.800 --> 1:27:27.800\n It's it will live for a long, long time.\n\n1:27:27.800 --> 1:27:34.480\n Of course it's, um, one of the things I mentioned Joe Rogan before, it's kinda, there's a sad\n\n1:27:34.480 --> 1:27:36.640\n thing cause I'm a fan.\n\n1:27:36.640 --> 1:27:38.240\n He's moving to Spotify.\n\n1:27:38.240 --> 1:27:39.240\n Yeah.\n\n1:27:39.240 --> 1:27:40.240\n Yeah.\n\n1:27:40.240 --> 1:27:41.800\n Nine digit numbers will do that to you.\n\n1:27:41.800 --> 1:27:42.800\n Yeah.\n\n1:27:42.800 --> 1:27:46.040\n But he doesn't really that he was one of the person that doesn't actually care that much\n\n1:27:46.040 --> 1:27:47.040\n about money.\n\n1:27:47.040 --> 1:27:50.900\n Like having talked to him here, it wasn't because of money.\n\n1:27:50.900 --> 1:27:58.880\n It's because he legitimately thinks that they're going to do like a better job.\n\n1:27:58.880 --> 1:28:03.040\n Like, so they're, so from his perspective, YouTube, you have to understand where they're\n\n1:28:03.040 --> 1:28:04.040\n coming from.\n\n1:28:04.040 --> 1:28:10.880\n YouTube has been cracking down on people who they, you know, Joe Rogan talks to Alex Jones\n\n1:28:10.880 --> 1:28:13.120\n and conspiracy theories and stuff.\n\n1:28:13.120 --> 1:28:16.480\n And YouTube is really like careful that kind of stuff.\n\n1:28:16.480 --> 1:28:18.400\n And that's not a good feeling.\n\n1:28:18.400 --> 1:28:22.760\n Like, and Joe didn't, doesn't feel like YouTube was on his side.\n\n1:28:22.760 --> 1:28:28.680\n You know, he's often has videos that they don't put in trending that like are obviously\n\n1:28:28.680 --> 1:28:34.720\n should be in trending because they're nervous about like, you know, if this concert is this,\n\n1:28:34.720 --> 1:28:41.520\n is this content going to, you know, upset people that all that kind of stuff have misinformation.\n\n1:28:41.520 --> 1:28:44.320\n And that's not a good place for a person to be in.\n\n1:28:44.320 --> 1:28:48.480\n And Spotify is giving them a, we're never going to censor you.\n\n1:28:48.480 --> 1:28:50.360\n We're never going to do that.\n\n1:28:50.360 --> 1:28:55.120\n But the reason I bring that up, whatever you think about that, I personally think as bullshit\n\n1:28:55.120 --> 1:28:59.640\n because podcasting should be free and not constrained to a platform.\n\n1:28:59.640 --> 1:29:00.640\n It's pirate radio.\n\n1:29:00.640 --> 1:29:01.640\n What the hell?\n\n1:29:01.640 --> 1:29:08.360\n You can't, as much as I love Spotify, you can't just, you can't put fences around it.\n\n1:29:08.360 --> 1:29:13.480\n But anyway, the reason I bring that up is Joe's going to remove his entire library from\n\n1:29:13.480 --> 1:29:14.480\n YouTube.\n\n1:29:14.480 --> 1:29:15.480\n Whoa, really?\n\n1:29:15.480 --> 1:29:16.480\n I didn't know that.\n\n1:29:16.480 --> 1:29:20.640\n His full length, the clips are going to stay, but the full length videos are all, I mean,\n\n1:29:20.640 --> 1:29:22.320\n made private or deleted.\n\n1:29:22.320 --> 1:29:23.660\n That's part of the deal.\n\n1:29:23.660 --> 1:29:29.200\n And like, that's the first time where I was like, Oh, YouTube videos might not live forever.\n\n1:29:29.200 --> 1:29:32.640\n Like things you find like, okay, I'm sorry.\n\n1:29:32.640 --> 1:29:36.960\n This is why you need an IPFS or something where it's like, if there's a content link,\n\n1:29:36.960 --> 1:29:39.300\n are you familiar with this system at all?\n\n1:29:39.300 --> 1:29:41.920\n Like right now, if you have a URL, it points to a server.\n\n1:29:41.920 --> 1:29:46.240\n There's like a system where the address points to content and then it's like distributed.\n\n1:29:46.240 --> 1:29:50.920\n So you, you can't actually delete what's at an address because it's, it's content addressed.\n\n1:29:50.920 --> 1:29:54.500\n And as long as there's someone on the network who hosts it, it's always accessible at the\n\n1:29:54.500 --> 1:29:56.860\n address that it once was.\n\n1:29:56.860 --> 1:29:58.600\n But I mean, that raises a question.\n\n1:29:58.600 --> 1:30:03.420\n I'm not going to put you on the spot, but like somebody like Vsauce, right?\n\n1:30:03.420 --> 1:30:07.800\n Spotify comes along and gives him, let's say $100 billion.\n\n1:30:07.800 --> 1:30:08.800\n Okay.\n\n1:30:08.800 --> 1:30:13.160\n Let's say some crazy number and then removes it from YouTube, right?\n\n1:30:13.160 --> 1:30:19.840\n It's made me, I don't know, for some reason I thought YouTube is forever.\n\n1:30:19.840 --> 1:30:20.840\n I don't think it will be.\n\n1:30:20.840 --> 1:30:25.560\n I mean, you know, another variant that this might take is like, uh, that, you know, um,\n\n1:30:25.560 --> 1:30:30.360\n you fast forward 50 years and, uh, you know, Google or Alphabet isn't the company that\n\n1:30:30.360 --> 1:30:31.360\n it once was.\n\n1:30:31.360 --> 1:30:33.240\n And it's kind of struggling to make ends meet.\n\n1:30:33.240 --> 1:30:38.360\n And you know, it's been supplanted by the whoever wins on the AR game or whatever it\n\n1:30:38.360 --> 1:30:39.640\n might be.\n\n1:30:39.640 --> 1:30:43.880\n And then they're like, you know, all of these videos that we're hosting are pretty costly.\n\n1:30:43.880 --> 1:30:47.680\n So we're just, we're going to start deleting the ones that aren't watched that much and\n\n1:30:47.680 --> 1:30:51.560\n tell people to like try to back them up on their own or whatever it is.\n\n1:30:51.560 --> 1:30:56.520\n Um, or even if it does exist in some form forever, it's like if people are, um, not\n\n1:30:56.520 --> 1:30:59.600\n habituated to watching YouTube in 50 years, they're watching something else, which seems\n\n1:30:59.600 --> 1:31:00.600\n pretty likely.\n\n1:31:00.600 --> 1:31:06.040\n Like it would be shocking if YouTube remained as popular as it is now indefinitely into\n\n1:31:06.040 --> 1:31:07.520\n the future.\n\n1:31:07.520 --> 1:31:10.160\n So, uh, it won't be forever.\n\n1:31:10.160 --> 1:31:16.160\n Makes me sad still, but cause it's such a nice, it's just like you said of the canonical\n\n1:31:16.160 --> 1:31:17.160\n videos.\n\n1:31:17.160 --> 1:31:18.160\n Sorry.\n\n1:31:18.160 --> 1:31:19.160\n I didn't mean to interrupt.\n\n1:31:19.160 --> 1:31:21.800\n You know, you should get Juan Bennett on the, uh, on the thing and then talk to him about\n\n1:31:21.800 --> 1:31:22.800\n permanence.\n\n1:31:22.800 --> 1:31:24.400\n I think you would have a good conversation.\n\n1:31:24.400 --> 1:31:25.400\n Who's that?\n\n1:31:25.400 --> 1:31:28.880\n So he's the one that founded this thing called IPFS that I'm talking about.\n\n1:31:28.880 --> 1:31:32.560\n And if you have him talk about basically what you're describing, like, Oh, it's sad that\n\n1:31:32.560 --> 1:31:33.560\n this isn't forever.\n\n1:31:33.560 --> 1:31:38.160\n Then you'll get some articulate pontification around it that's like been pretty well thought\n\n1:31:38.160 --> 1:31:39.160\n through.\n\n1:31:39.160 --> 1:31:44.040\n Uh, but yeah, I do see YouTube, just like you said, as a, as a place, like what your\n\n1:31:44.040 --> 1:31:47.880\n channel creates, which is like a set of canonical videos on a topic.\n\n1:31:47.880 --> 1:31:54.560\n Now others could create videos on that topic as well, but as a collection, it creates a\n\n1:31:54.560 --> 1:31:56.480\n nice set of places to go.\n\n1:31:56.480 --> 1:32:02.320\n Uh, if you're curious about a particular topic and it seems like coronavirus is a nice opportunity\n\n1:32:02.320 --> 1:32:10.680\n to, uh, put that knowledge out there in the world at, uh, MIT and beyond, I have to talk\n\n1:32:10.680 --> 1:32:13.440\n to you a little bit about machine learning, deep learning and so on.\n\n1:32:13.440 --> 1:32:19.560\n Again, we talked about last time you have a set of beautiful videos on neural networks.\n\n1:32:19.560 --> 1:32:28.160\n Uh, let me ask you first, what is the most beautiful aspect of neural networks and machine\n\n1:32:28.160 --> 1:32:35.320\n learning to you, like for making those videos from watching how the field is evolving?\n\n1:32:35.320 --> 1:32:42.560\n Is there something mathematically or in applied sense, just beautiful to you about them?\n\n1:32:42.560 --> 1:32:48.320\n Well, I think what I would go to is the layered structure and how, um, you can have what feel\n\n1:32:48.320 --> 1:32:52.960\n like qualitatively distinct things happening, going from one layer to another, but that\n\n1:32:52.960 --> 1:32:56.960\n are, um, following the same mathematical rule because you look at it as a piece of math.\n\n1:32:56.960 --> 1:33:00.720\n It's like you got a non linearity and then you've got a matrix multiplication.\n\n1:33:00.720 --> 1:33:02.400\n That's what's happening on all the layers.\n\n1:33:02.400 --> 1:33:06.880\n Um, but especially if you look at like some of the visualizations that, uh, like Chris\n\n1:33:06.880 --> 1:33:12.640\n Ola has done with respect to, um, like convolutional nets that have been trained on image net trying\n\n1:33:12.640 --> 1:33:14.120\n to say, what does this neuron do?\n\n1:33:14.120 --> 1:33:17.440\n What do this, uh, does this family of neurons do?\n\n1:33:17.440 --> 1:33:22.260\n What you can see is that, um, the ones closer to the input side are picking up on very low\n\n1:33:22.260 --> 1:33:24.720\n level ideas like the texture, right?\n\n1:33:24.720 --> 1:33:26.920\n And then as you get further back, you have higher level ideas.\n\n1:33:26.920 --> 1:33:29.200\n Like what is the, where are the eyes in this picture?\n\n1:33:29.200 --> 1:33:33.760\n And then how do the eyes form like an animal is this animal, a cat or a dog or a deer.\n\n1:33:33.760 --> 1:33:37.800\n You have this series of qualitatively different things happening, even though it's the same\n\n1:33:37.800 --> 1:33:39.680\n piece of math on each one.\n\n1:33:39.680 --> 1:33:44.760\n So that's a pretty beautiful idea that you can have like a generalizable object that,\n\n1:33:44.760 --> 1:33:50.220\n um, runs through the layers of abstraction, which in some sense constitute intelligence\n\n1:33:50.220 --> 1:33:55.720\n is having, um, those many different layers of an understanding to something form abstractions\n\n1:33:55.720 --> 1:33:57.640\n in a automated way.\n\n1:33:57.640 --> 1:33:58.640\n Exactly.\n\n1:33:58.640 --> 1:34:02.160\n It's automated abstracting, which, I mean, that just feels very powerful.\n\n1:34:02.160 --> 1:34:06.200\n Um, and the idea that it can be so simply mathematically represented.\n\n1:34:06.200 --> 1:34:10.360\n I mean, a ton of like modern ML research seems a little bit like you do a bunch of ad hoc\n\n1:34:10.360 --> 1:34:14.000\n things, then you decide which one worked and then you retrospectively come up with the\n\n1:34:14.000 --> 1:34:16.240\n mathematical reason that it always had to work.\n\n1:34:16.240 --> 1:34:19.820\n Um, but you know, who cares how you came to it when you have like that elegant piece of\n\n1:34:19.820 --> 1:34:20.820\n math?\n\n1:34:20.820 --> 1:34:24.440\n Uh, it's hard not to just smile seeing it work in action.\n\n1:34:24.440 --> 1:34:30.880\n Well, and when you talked about topology before, one of the really interesting things is, is\n\n1:34:30.880 --> 1:34:34.560\n beginning to be investigated under kind of the field of like science and deep learning,\n\n1:34:34.560 --> 1:34:42.920\n which is like the craziness of the surface that, uh, is trying to be optimized, uh, in\n\n1:34:42.920 --> 1:34:43.920\n neural networks.\n\n1:34:43.920 --> 1:34:51.520\n I mean, the, the amount of local minima, local optima there is in these surfaces and somehow\n\n1:34:51.520 --> 1:34:55.640\n a dumb gradient descent algorithm was able to find really good solutions.\n\n1:34:55.640 --> 1:34:58.280\n That's like, that's really surprising.\n\n1:34:58.280 --> 1:35:04.200\n Well, so on the one hand it is, but also it's like not, it's not terribly surprising that\n\n1:35:04.200 --> 1:35:08.880\n you have these interesting points that exist when you make your space so high dimensional,\n\n1:35:08.880 --> 1:35:10.880\n like GPT three, what did it have?\n\n1:35:10.880 --> 1:35:12.640\n 175 billion parameters.\n\n1:35:12.640 --> 1:35:19.900\n So it doesn't feel as mesmerizing to think about, Oh, there's some surface of intelligent\n\n1:35:19.900 --> 1:35:21.760\n behavior in this crazy high dimensional space.\n\n1:35:21.760 --> 1:35:24.840\n It's like, there's so many parameters that of course, but what's more interesting is\n\n1:35:24.840 --> 1:35:28.940\n like, how, how is it that you're able to efficiently get there, which is maybe what you're describing\n\n1:35:28.940 --> 1:35:35.120\n that something as dumb as gradient descent does it, but like the re the reason that gradient\n\n1:35:35.120 --> 1:35:38.920\n descent works well with neural networks and not just, you know, choose however you want\n\n1:35:38.920 --> 1:35:42.640\n to parameterize this space and then like apply gradient descent to it is that that layered\n\n1:35:42.640 --> 1:35:47.160\n structure lets you decompose the derivative in a way that makes it computationally feasible.\n\n1:35:47.160 --> 1:35:54.160\n Um, yeah, it's just that, that there's so many good solutions, probably infinitely infinitely\n\n1:35:54.160 --> 1:35:58.780\n many good solutions, not best solutions, but good solutions.\n\n1:35:58.780 --> 1:36:00.840\n That's that's what's interesting.\n\n1:36:00.840 --> 1:36:07.120\n It's similar to, uh, Steven Wolfram has this idea of like the, if you just look at all\n\n1:36:07.120 --> 1:36:13.040\n space of computations of all space of basically algorithms that you'd be surprised how many\n\n1:36:13.040 --> 1:36:15.760\n of them are actually intelligent.\n\n1:36:15.760 --> 1:36:19.600\n Like if you just randomly pick from the bucket, uh, that's surprising.\n\n1:36:19.600 --> 1:36:26.400\n We tend to think like a tiny, tiny minority of them would be intelligent, but his sense\n\n1:36:26.400 --> 1:36:32.760\n is like, it seems weirdly easy to find computations that do something interesting.\n\n1:36:32.760 --> 1:36:38.680\n Well, okay, so that from like a calm agor, calm agor of complexity standpoint, almost\n\n1:36:38.680 --> 1:36:40.080\n everything will be interesting.\n\n1:36:40.080 --> 1:36:44.160\n What's fascinating is to find the stuff that's describable with low information, but still\n\n1:36:44.160 --> 1:36:45.640\n does interesting things.\n\n1:36:45.640 --> 1:36:51.080\n Uh, like one fun example of this, you know, um, Shannon's noisy coding and theorem, uh,\n\n1:36:51.080 --> 1:36:55.400\n noisy coding theorem and, uh, information theory that basically says if, you know, I\n\n1:36:55.400 --> 1:36:59.560\n want to send some bits to you, um, maybe, uh, some of them are going to get flipped.\n\n1:36:59.560 --> 1:37:01.720\n Uh, there's some noise along the channel.\n\n1:37:01.720 --> 1:37:04.320\n I can come up with some way of coding it.\n\n1:37:04.320 --> 1:37:06.040\n That's resilient to that noise.\n\n1:37:06.040 --> 1:37:07.280\n That's very good.\n\n1:37:07.280 --> 1:37:10.400\n Um, and then he quantitatively describes what very good is.\n\n1:37:10.400 --> 1:37:15.400\n What's funny about how he proves the existence of good error correction codes is rather than\n\n1:37:15.400 --> 1:37:20.040\n saying like, here's how to construct it or even like a sensible nonconstructive proof.\n\n1:37:20.040 --> 1:37:25.260\n The nature of his nonconstructive proof is to say, um, if we chose a random encoding,\n\n1:37:25.260 --> 1:37:30.040\n it would be almost at the limit, which is weird because then it took decades for people\n\n1:37:30.040 --> 1:37:33.000\n to actually find any that were anywhere close to the limit.\n\n1:37:33.000 --> 1:37:35.880\n And what his proof was saying is choose a random one.\n\n1:37:35.880 --> 1:37:39.160\n And it's like the best kind of encoding you'll ever find.\n\n1:37:39.160 --> 1:37:44.600\n But what's what that tells us is that sometimes when you choose a random element from this\n\n1:37:44.600 --> 1:37:49.120\n ungodly huge set, that's a very different task from finding an efficient way to actively\n\n1:37:49.120 --> 1:37:50.120\n describe it.\n\n1:37:50.120 --> 1:37:52.920\n Cause in that case, the random element to actually implement it as a bit of code, you\n\n1:37:52.920 --> 1:37:58.200\n would just have this huge table of like, um, telling you how to encode one thing into another.\n\n1:37:58.200 --> 1:38:00.520\n That's totally computationally infeasible.\n\n1:38:00.520 --> 1:38:06.200\n So on the side of like how many possible programs are interesting in some way, it's like, yeah,\n\n1:38:06.200 --> 1:38:07.200\n tons of them.\n\n1:38:07.200 --> 1:38:11.920\n But the much, much more delicate question is when you can have a low information description\n\n1:38:11.920 --> 1:38:14.720\n of something that still becomes interesting.\n\n1:38:14.720 --> 1:38:18.400\n And thereby this kind of gives you a blueprint for how to engineer that kind of thing.\n\n1:38:18.400 --> 1:38:19.400\n Right.\n\n1:38:19.400 --> 1:38:20.400\n Yeah.\n\n1:38:20.400 --> 1:38:22.800\n Chaos theory is another good instance there where it's like, yeah, a ton of things are\n\n1:38:22.800 --> 1:38:27.040\n hard to describe, but how do you have ones that have a simple set of governing equations\n\n1:38:27.040 --> 1:38:30.160\n that remain like arbitrarily hard to describe?\n\n1:38:30.160 --> 1:38:33.680\n Well, let me ask you, uh, you mentioned GPT three.\n\n1:38:33.680 --> 1:38:40.000\n It's interesting to ask, uh, what are your thoughts about the recently released open\n\n1:38:40.000 --> 1:38:46.640\n AI GPT three model that I believe is already trying to learn how to communicate like Grant\n\n1:38:46.640 --> 1:38:47.640\n Sanderson?\n\n1:38:47.640 --> 1:38:51.480\n You know, I think I got an email a day or two ago about someone who wanted to, um, try\n\n1:38:51.480 --> 1:38:57.280\n to use GPT three with manum where you would like give it a high level description of something\n\n1:38:57.280 --> 1:39:01.120\n and then it'll like automatically create the mathematical animation, like trying to put\n\n1:39:01.120 --> 1:39:03.120\n me out of a job here.\n\n1:39:03.120 --> 1:39:08.920\n I mean, it probably won't put you out of a job, but it'll create something visually beautiful\n\n1:39:08.920 --> 1:39:09.920\n for sure.\n\n1:39:09.920 --> 1:39:15.040\n I would be surprised if that worked as stated, but maybe there's like variants of it like\n\n1:39:15.040 --> 1:39:16.040\n that you can get to.\n\n1:39:16.040 --> 1:39:18.600\n Um, I mean like a lot of those demos, it's interesting.\n\n1:39:18.600 --> 1:39:26.360\n I think, uh, there's a lot of failed experiments, like depending on how you prime the thing,\n\n1:39:26.360 --> 1:39:30.280\n you're going to have a lot of failed, I'm certainly with code and program synthesis.\n\n1:39:30.280 --> 1:39:35.480\n Most of it won't even run, but eventually I think if you, if you're, if you pick the\n\n1:39:35.480 --> 1:39:38.840\n right examples, you'll be able to generate something cool.\n\n1:39:38.840 --> 1:39:42.280\n And I think that even that's good enough, even though if it's, if it's, if you're being\n\n1:39:42.280 --> 1:39:46.240\n very selective, it's still cool that something can be generated.\n\n1:39:46.240 --> 1:39:47.240\n Yeah.\n\n1:39:47.240 --> 1:39:48.720\n That's a huge value.\n\n1:39:48.720 --> 1:39:50.360\n Um, I mean, think of the writing process.\n\n1:39:50.360 --> 1:39:52.960\n Sometimes a big part of it is just getting a bunch of stuff on the page and then you\n\n1:39:52.960 --> 1:39:54.920\n can decide what to whittle down to.\n\n1:39:54.920 --> 1:39:59.640\n So if it can be used in like a man machine symbiosis where it's just giving you a spew\n\n1:39:59.640 --> 1:40:05.080\n of potential ideas that then you can refine down, um, like it's serving as the generator\n\n1:40:05.080 --> 1:40:07.320\n and then the human serves as the refiner.\n\n1:40:07.320 --> 1:40:09.280\n That seems like a pretty powerful dynamic.\n\n1:40:09.280 --> 1:40:10.280\n Yeah.\n\n1:40:10.280 --> 1:40:14.120\n Have you, uh, have you gotten a chance to see any of the demos like on Twitter?\n\n1:40:14.120 --> 1:40:15.800\n Is there a favorite you've seen or?\n\n1:40:15.800 --> 1:40:17.440\n Oh, my absolute favorite.\n\n1:40:17.440 --> 1:40:18.440\n Yeah.\n\n1:40:18.440 --> 1:40:23.000\n Uh, so Tim Blay who runs a channel called acapella science, he was like tweeting a bunch\n\n1:40:23.000 --> 1:40:24.760\n about playing with it.\n\n1:40:24.760 --> 1:40:30.680\n Um, and so he, so GPT three was trained on the internet from before COVID.\n\n1:40:30.680 --> 1:40:33.660\n So in a sense it doesn't know about the Corona virus.\n\n1:40:33.660 --> 1:40:37.800\n So what he seeded it with was just a short description about like, um, a novel virus,\n\n1:40:37.800 --> 1:40:41.580\n uh, emerges in Wuhan, China and starts to spread around the globe.\n\n1:40:41.580 --> 1:40:46.500\n What follows is a month by month description of what happens, January, colon, right?\n\n1:40:46.500 --> 1:40:47.500\n That's what he sees it with.\n\n1:40:47.500 --> 1:40:51.440\n So then what GPT three generates is like January, then a paragraph of description, February\n\n1:40:51.440 --> 1:40:52.640\n and such.\n\n1:40:52.640 --> 1:40:58.240\n And it's the funniest thing you'll ever read because, um, it predicts a zombie apocalypse,\n\n1:40:58.240 --> 1:41:02.960\n which of course it would because it's trained on like the internet, the stories, but what\n\n1:41:02.960 --> 1:41:08.240\n you see unfolding is a description of COVID 19 if it were a zombie apocalypse.\n\n1:41:08.240 --> 1:41:12.680\n And like the early aspects of it are kind of shockingly in line with what's reasonable\n\n1:41:12.680 --> 1:41:14.880\n and then it gets out of hand so quickly.\n\n1:41:14.880 --> 1:41:19.600\n And the other flip side of that is, uh, I wouldn't be surprised if it's onto something\n\n1:41:19.600 --> 1:41:25.360\n at some point here when, you know, 2020 has been full of surprises, who knows, like we\n\n1:41:25.360 --> 1:41:30.880\n might all be in like this crazy militarized zone as it predicts just a couple of months\n\n1:41:30.880 --> 1:41:31.880\n off.\n\n1:41:31.880 --> 1:41:32.880\n Yeah.\n\n1:41:32.880 --> 1:41:36.220\n I think there's definitely an interesting tool of storytelling.\n\n1:41:36.220 --> 1:41:40.800\n It has struggled with mathematics, which is interesting, or in just even numbers, it's\n\n1:41:40.800 --> 1:41:49.280\n able to, it's not able to generate like patterns, you know, like you give it, um, in like five\n\n1:41:49.280 --> 1:41:55.560\n digit numbers and it's not able to figure out the sequence, you know, or like, um, I\n\n1:41:55.560 --> 1:42:00.000\n didn't look in too much, but I'm talking about like sequences, like the Fibonacci numbers\n\n1:42:00.000 --> 1:42:04.480\n and to see how far it can go because obviously it's leveraging stuff from the internet and\n\n1:42:04.480 --> 1:42:09.400\n it starts to lose it, but it is also cool that I've seen it able to generate some interesting\n\n1:42:09.400 --> 1:42:12.120\n patterns, um, that are mathematically correct.\n\n1:42:12.120 --> 1:42:13.120\n Yeah.\n\n1:42:13.120 --> 1:42:18.440\n I honestly haven't dug into like what's going on within it, uh, in a way that I can speak\n\n1:42:18.440 --> 1:42:24.040\n intelligently to, I guess it doesn't surprise me that it's bad at numerical patterns because\n\n1:42:24.040 --> 1:42:30.960\n I mean, maybe I should be more impressed with it, but like that requires having, um, a weird\n\n1:42:30.960 --> 1:42:35.560\n combination of intuitive and, uh, and formulaic worldview.\n\n1:42:35.560 --> 1:42:37.320\n So you're not just going off of intuition.\n\n1:42:37.320 --> 1:42:39.940\n When you see Fibonacci numbers, you're not saying like intuitively, what do I think will\n\n1:42:39.940 --> 1:42:40.940\n follow the 13?\n\n1:42:40.940 --> 1:42:45.640\n Like I've seen patterns a lot where like 13s are followed by 21s instead.\n\n1:42:45.640 --> 1:42:50.480\n It's the, like the way you're starting to see a shape of things is by knowing what hypotheses\n\n1:42:50.480 --> 1:42:54.480\n to test where you're saying, oh, maybe it's generated based on the previous terms or maybe\n\n1:42:54.480 --> 1:42:58.000\n it's generated based on like multiplying by a constant or whatever it is you like have\n\n1:42:58.000 --> 1:43:01.760\n a bunch of different hypotheses and your intuitions are around those hypotheses, but you still\n\n1:43:01.760 --> 1:43:04.240\n need to actively test it.\n\n1:43:04.240 --> 1:43:10.100\n Um, and it seems like GPT three is extremely good at, um, like that sort of pattern matching\n\n1:43:10.100 --> 1:43:13.360\n recognition that usually is very hard for computers.\n\n1:43:13.360 --> 1:43:17.520\n That is what humans get good at through expertise and exposure to lots of things.\n\n1:43:17.520 --> 1:43:21.920\n It's why it's good to learn from as many examples as you can rather than just from the definitions\n\n1:43:21.920 --> 1:43:27.640\n it's to get that level of intuition, but to actually concretize it into a piece of math,\n\n1:43:27.640 --> 1:43:33.600\n you do need to, um, like test your hypotheses and if not prove it, um, like have an actual\n\n1:43:33.600 --> 1:43:37.800\n explanation for what's going on, not just a, uh, a pattern that you've seen.\n\n1:43:37.800 --> 1:43:38.800\n Yeah.\n\n1:43:38.800 --> 1:43:43.920\n And, but then the flip side to play devil's advocate, that's a very kind of probably correct\n\n1:43:43.920 --> 1:43:49.400\n intuitive understanding of just like we said, a few, a few layers creating abstractions,\n\n1:43:49.400 --> 1:43:58.080\n but it's been able to form something that looks like, uh, a compression of the data\n\n1:43:58.080 --> 1:44:02.240\n that it's seen that looks awfully a lot like it understands what the heck it's talking\n\n1:44:02.240 --> 1:44:03.240\n about.\n\n1:44:03.240 --> 1:44:08.080\n Well, I think a lot of understanding is like, I don't mean to denigrate pattern recognition.\n\n1:44:08.080 --> 1:44:12.320\n Pattern recognition is most of understanding and it's super important and it's super hard.\n\n1:44:12.320 --> 1:44:16.640\n Um, and so like when it's demonstrating this kind of real understanding, compressing down\n\n1:44:16.640 --> 1:44:20.720\n some data, like that, that might be pattern recognition at its finest.\n\n1:44:20.720 --> 1:44:27.480\n My only point would be that like what differentiates math, I think to a large extent is that, um,\n\n1:44:27.480 --> 1:44:32.040\n the pattern recognition isn't sufficient and that the kind of patterns that you're recognizing\n\n1:44:32.040 --> 1:44:37.400\n are not like the end goals, but instead they're, they are the little bits and paths that get\n\n1:44:37.400 --> 1:44:39.520\n you to the end goal.\n\n1:44:39.520 --> 1:44:41.560\n That's certainly true for mathematics in general.\n\n1:44:41.560 --> 1:44:47.240\n It's an interesting question if that might, uh, for certain kinds of series of numbers,\n\n1:44:47.240 --> 1:44:48.360\n it might not be true.\n\n1:44:48.360 --> 1:44:53.780\n Like you might, um, because that's a basic, you know, like Taylor's like certain kinds\n\n1:44:53.780 --> 1:45:01.920\n of series, it feels like compressing the internet, uh, is, is enough to figure out because those\n\n1:45:01.920 --> 1:45:05.360\n patterns in some form appear in the text somewhere.\n\n1:45:05.360 --> 1:45:06.360\n Yeah.\n\n1:45:06.360 --> 1:45:09.120\n Well, I mean, there's, uh, there's all sorts of wonderful examples of false patterns in\n\n1:45:09.120 --> 1:45:13.320\n math where, um, one of the earliest videos I put on the channel was talking about the\n\n1:45:13.320 --> 1:45:15.640\n extent of dividing a circle up using these chords.\n\n1:45:15.640 --> 1:45:20.180\n And you see this pattern of one, two, four, eight, 16, I was like, okay, pretty easy to\n\n1:45:20.180 --> 1:45:21.180\n see what that pattern is.\n\n1:45:21.180 --> 1:45:22.180\n It's powers of two.\n\n1:45:22.180 --> 1:45:23.680\n You've seen it a million times.\n\n1:45:23.680 --> 1:45:25.800\n Um, but it's not powers of two.\n\n1:45:25.800 --> 1:45:27.760\n The next term is 31.\n\n1:45:27.760 --> 1:45:30.840\n And so it's like almost a power of two, but it's a little bit shy.\n\n1:45:30.840 --> 1:45:33.640\n And there's, there's actually a very good explanation for what's going on.\n\n1:45:33.640 --> 1:45:40.400\n Um, but I think it's a good test of whether you're thinking clearly about mechanistic\n\n1:45:40.400 --> 1:45:44.520\n explanations of things, how quickly you jump to thinking it must be powers of two because\n\n1:45:44.520 --> 1:45:49.560\n the problem itself, there's really no, no good way to, I mean, there can't be a good\n\n1:45:49.560 --> 1:45:53.920\n way to think about it as like doubling a set because ultimately it doesn't, but even before\n\n1:45:53.920 --> 1:45:58.520\n it starts to, it's not something that screams out as being a doubling phenomenon.\n\n1:45:58.520 --> 1:46:03.000\n So at best, if it did turn out to be powers of two, it would have only been so very subtly.\n\n1:46:03.000 --> 1:46:06.240\n And I think the difference between like, you know, a math student making the mistake and\n\n1:46:06.240 --> 1:46:10.280\n a mathematician who's experienced seeing that kind of pattern is that they, they'll have\n\n1:46:10.280 --> 1:46:15.440\n a sense from what the problem itself is, whether the pattern that they're observing is reasonable\n\n1:46:15.440 --> 1:46:16.940\n and how to test it.\n\n1:46:16.940 --> 1:46:23.440\n And like, uh, I w I would just be very impressed if there was any algorithm that, um, was actively\n\n1:46:23.440 --> 1:46:24.920\n accomplishing that goal.\n\n1:46:24.920 --> 1:46:25.920\n Yeah.\n\n1:46:25.920 --> 1:46:26.920\n Like a learning base algorithm.\n\n1:46:26.920 --> 1:46:27.920\n Yeah.\n\n1:46:27.920 --> 1:46:29.920\n Like a little scientist, I guess.\n\n1:46:29.920 --> 1:46:30.920\n Basically.\n\n1:46:30.920 --> 1:46:31.920\n Yeah.\n\n1:46:31.920 --> 1:46:36.840\n That's a fascinating thought because GPT three, these language models are already accomplishing\n\n1:46:36.840 --> 1:46:38.600\n way more than I've expected.\n\n1:46:38.600 --> 1:46:42.840\n So I'm learning not to doubt, but we'll get there.\n\n1:46:42.840 --> 1:46:43.840\n Yeah.\n\n1:46:43.840 --> 1:46:46.840\n I, I, I'm not saying I'd be impressed, but like surprised, like I'll be impressed, but\n\n1:46:46.840 --> 1:46:52.680\n I think we'll get there on, um, algorithms doing math like that.\n\n1:46:52.680 --> 1:47:00.520\n So one of the amazing things you've done for the world is to some degree, open sourcing\n\n1:47:00.520 --> 1:47:08.000\n the tooling that you use to make your videos with Madam, uh, this Python library.\n\n1:47:08.000 --> 1:47:11.480\n Now it's quickly evolving because I think you're inventing new things every time you\n\n1:47:11.480 --> 1:47:12.480\n make a video.\n\n1:47:12.480 --> 1:47:17.600\n In fact, I wanted, um, I've been working on playing around with something.\n\n1:47:17.600 --> 1:47:20.160\n I wanted to do like an ode to three blue on Brown.\n\n1:47:20.160 --> 1:47:22.200\n Like I love playing Hendrix.\n\n1:47:22.200 --> 1:47:27.440\n I wanted to do like a cover, you know, of a concept I wanted to visualize and use Madam.\n\n1:47:27.440 --> 1:47:31.920\n And I saw that you had like a little piece of code on like Mobia strip and I tried to\n\n1:47:31.920 --> 1:47:39.240\n do some cool things with spinning a Mobia strip, like continue, um, twisting it, I guess\n\n1:47:39.240 --> 1:47:44.640\n is the term, uh, and it was easier to, uh, it was tough.\n\n1:47:44.640 --> 1:47:45.640\n So I haven't figured it out yet.\n\n1:47:45.640 --> 1:47:50.760\n Well, so I guess the question I want to ask is so many people love it, uh, that you've\n\n1:47:50.760 --> 1:47:51.760\n put that out there.\n\n1:47:51.760 --> 1:47:54.920\n They want to, uh, do the same thing as I do with Hendrix and want to cover it.\n\n1:47:54.920 --> 1:47:58.360\n They want to explain an idea using the tool, including Russ.\n\n1:47:58.360 --> 1:48:02.420\n How would you recommend they try to, I'm very sorry.\n\n1:48:02.420 --> 1:48:11.280\n They try to go, they try to go by, uh, about it and what kind of choices should they choose\n\n1:48:11.280 --> 1:48:13.360\n to be most effective?\n\n1:48:13.360 --> 1:48:14.360\n That I can answer.\n\n1:48:14.360 --> 1:48:19.540\n So I always feel guilty if this comes up because, um, I think of it like this scrappy tool.\n\n1:48:19.540 --> 1:48:22.320\n It's like a math teacher who put together some code.\n\n1:48:22.320 --> 1:48:26.240\n People asked what it was, so they made it open source and they kept scrapping it together.\n\n1:48:26.240 --> 1:48:29.400\n And there's a lot, like a lot of things about it that make it harder to work with than it\n\n1:48:29.400 --> 1:48:33.040\n needs to be that are a function of like me not being a software engineer.\n\n1:48:33.040 --> 1:48:39.160\n Um, I, I've, I've put some work this year trying to like make it better and more flexible.\n\n1:48:39.160 --> 1:48:43.360\n Um, that is still just kind of like a work in process.\n\n1:48:43.360 --> 1:48:48.280\n Um, one thing I would love to do is just get my act together about properly integrating\n\n1:48:48.280 --> 1:48:53.420\n with what like the community wants to work with and like what stuff I work on and making\n\n1:48:53.420 --> 1:48:58.520\n that, um, not like deviate, uh, and just like actually fostering that community in a way\n\n1:48:58.520 --> 1:49:01.160\n that I've, I've been like shamefully neglectful of.\n\n1:49:01.160 --> 1:49:03.220\n So I'm just always guilty if it comes up.\n\n1:49:03.220 --> 1:49:08.080\n So let's put that guilt aside, just kind of Zen, like I'll pretend like it isn't terrible\n\n1:49:08.080 --> 1:49:09.400\n for someone like Russ.\n\n1:49:09.400 --> 1:49:14.240\n Um, I think step one is like, make sure that what you're animating should be done so programmatically\n\n1:49:14.240 --> 1:49:16.320\n because a lot of things maybe shouldn't.\n\n1:49:16.320 --> 1:49:20.960\n Um, like if you're just making a quick graph of something, uh, if it's a graphical intuition\n\n1:49:20.960 --> 1:49:26.840\n that maybe has a little motion to it, use Desmos, use grapher, use GeoGebra, use Mathematica,\n\n1:49:26.840 --> 1:49:28.640\n certain things that are like really oriented around graph.\n\n1:49:28.640 --> 1:49:29.640\n GeoGebra is kind of cool.\n\n1:49:29.640 --> 1:49:31.240\n I did super amazing.\n\n1:49:31.240 --> 1:49:33.280\n You can get very, very far with it.\n\n1:49:33.280 --> 1:49:37.680\n Um, and in a lot of ways, like it would make more sense for STEM stuff that I do to just\n\n1:49:37.680 --> 1:49:42.080\n do in GeoGebra, but I kind of have this cycle of liking to try to improve man and by doing\n\n1:49:42.080 --> 1:49:43.080\n videos and such.\n\n1:49:43.080 --> 1:49:45.760\n So, uh, do as I say, not as I do.\n\n1:49:45.760 --> 1:49:49.640\n The original like thought I had in making manum was that there's so many different ways\n\n1:49:49.640 --> 1:49:55.000\n of representing functions other than graphs, um, in particular things like transformations,\n\n1:49:55.000 --> 1:49:59.680\n like use movement over time to communicate relationships between inputs and outputs instead\n\n1:49:59.680 --> 1:50:04.520\n of like estimate direction and Y direction, um, or like vector fields or things like that.\n\n1:50:04.520 --> 1:50:08.280\n So I wanted something that was flexible enough that you didn't feel constrained into a graphical\n\n1:50:08.280 --> 1:50:09.280\n environment.\n\n1:50:09.280 --> 1:50:15.520\n Um, by graphical, I mean like graphs with like X coordinate, Y coordinate kind of stuff,\n\n1:50:15.520 --> 1:50:20.720\n but also make sure that, um, you're taking advantage of the fact that it's programmatic.\n\n1:50:20.720 --> 1:50:23.600\n You have loops, you have conditionals, you have abstraction.\n\n1:50:23.600 --> 1:50:27.560\n If any of those are like well fit for what you want to teach to, you know, have a scene\n\n1:50:27.560 --> 1:50:31.500\n type that you tweak a little bit based on parameters or to have conditional so that\n\n1:50:31.500 --> 1:50:34.880\n things can go one way or another or loops so that you can create these things of like\n\n1:50:34.880 --> 1:50:37.000\n arbitrarily increasing complexity.\n\n1:50:37.000 --> 1:50:39.680\n That's the stuff that's like meant to be animated programmatically.\n\n1:50:39.680 --> 1:50:43.720\n If it's just like writing some text on the screen or shifting around objects or something\n\n1:50:43.720 --> 1:50:48.280\n like that, um, things like that, you should probably just use keynote, right?\n\n1:50:48.280 --> 1:50:50.120\n Um, you'd be a lot simpler.\n\n1:50:50.120 --> 1:50:55.100\n So, uh, try to find a workflow that distills down that which should be programmatic into\n\n1:50:55.100 --> 1:50:58.280\n manum and that which doesn't need to be into like other domains.\n\n1:50:58.280 --> 1:51:01.240\n Again, do as I say, not as I do.\n\n1:51:01.240 --> 1:51:03.840\n I mean, Python is an integral part of it.\n\n1:51:03.840 --> 1:51:09.480\n Just for the fun of it, let me ask, uh, what, uh, what's your most and least favorite aspects\n\n1:51:09.480 --> 1:51:10.480\n of Python?\n\n1:51:10.480 --> 1:51:12.600\n Ooh, most and least.\n\n1:51:12.600 --> 1:51:18.040\n I mean, I love that it's like object oriented and functional, I guess that you can kind\n\n1:51:18.040 --> 1:51:23.960\n of like get both of those, um, uh, benefits for how you structure things.\n\n1:51:23.960 --> 1:51:26.760\n So if you would just want to quickly whip something together, the functional aspects\n\n1:51:26.760 --> 1:51:27.760\n are nice.\n\n1:51:27.760 --> 1:51:31.160\n It's your primary language, like for programmatically generating stuff.\n\n1:51:31.160 --> 1:51:32.160\n Yeah.\n\n1:51:32.160 --> 1:51:33.160\n It's home for me.\n\n1:51:33.160 --> 1:51:34.160\n It's home.\n\n1:51:34.160 --> 1:51:35.160\n Yeah.\n\n1:51:35.160 --> 1:51:36.160\n Sometimes you travel, but it's home.\n\n1:51:36.160 --> 1:51:37.160\n Got it.\n\n1:51:37.160 --> 1:51:38.160\n It's home.\n\n1:51:38.160 --> 1:51:39.360\n Uh, I mean, the biggest disadvantage is that it's slow.\n\n1:51:39.360 --> 1:51:42.840\n So when you're doing computationally intensive things, either you have to like think about\n\n1:51:42.840 --> 1:51:47.400\n it more than you should how to make it efficient or it just like takes long.\n\n1:51:47.400 --> 1:51:48.720\n Do you run into that at all?\n\n1:51:48.720 --> 1:51:49.720\n Like with your work?\n\n1:51:49.720 --> 1:51:54.840\n Well, so, uh, certainly old man is like way slower than it needs to be because of, uh,\n\n1:51:54.840 --> 1:51:58.640\n how it renders things on the backend is like kind of absurd.\n\n1:51:58.640 --> 1:52:02.760\n I've rewritten things such that it's all done with like shaders in such a way that it should\n\n1:52:02.760 --> 1:52:06.680\n be just like live and actually like interactive while you're coding it.\n\n1:52:06.680 --> 1:52:12.200\n If you want to, to have like a 3d scene, you can move around, you can, um, have, um, elements\n\n1:52:12.200 --> 1:52:14.240\n respond to where your mouse is or things.\n\n1:52:14.240 --> 1:52:17.860\n That's not something that user of a video is going to get to experience cause there's\n\n1:52:17.860 --> 1:52:19.360\n just a play button and a pause button.\n\n1:52:19.360 --> 1:52:21.280\n But while you're developing, that can be nice.\n\n1:52:21.280 --> 1:52:25.480\n Um, so it's gotten better in speed in that sense, but that's basically because the hard\n\n1:52:25.480 --> 1:52:29.840\n work is being done in the language that's not Python, but GLSL, right?\n\n1:52:29.840 --> 1:52:35.120\n Um, but yeah, there are some times when it's like a, um, there's just a lot of data that\n\n1:52:35.120 --> 1:52:40.000\n goes into the object that I want to animate that then it just like Python is slow.\n\n1:52:40.000 --> 1:52:44.640\n Well, let me ask, quickly ask, what do you think about the walrus operator, if you're\n\n1:52:44.640 --> 1:52:46.040\n familiar with it at all?\n\n1:52:46.040 --> 1:52:49.680\n The reason it's interesting, there's a new operator in Python 3.8.\n\n1:52:49.680 --> 1:52:54.760\n I find it psychologically interesting cause it, the toxicity over it led Guido to resign\n\n1:52:54.760 --> 1:52:55.760\n the step down from this.\n\n1:52:55.760 --> 1:52:56.760\n Is that actually true?\n\n1:52:56.760 --> 1:53:00.700\n Or was it like, there's a bunch of surrounding things that also, was it actually the walrus\n\n1:53:00.700 --> 1:53:02.200\n operator that, that.\n\n1:53:02.200 --> 1:53:08.320\n Well, it was, it was a text, it was an accumulation of toxicity, but that was the, the most, that\n\n1:53:08.320 --> 1:53:11.640\n was the most toxic one, like the discussion.\n\n1:53:11.640 --> 1:53:16.480\n That's the most number of Python core developers that were opposed to Guido's decision.\n\n1:53:16.480 --> 1:53:20.500\n Um, he didn't particularly, I don't think cared about it either way.\n\n1:53:20.500 --> 1:53:21.680\n He just thought it was a good idea.\n\n1:53:21.680 --> 1:53:23.580\n This is where you approve it.\n\n1:53:23.580 --> 1:53:30.000\n And like the structure of the idea of a BDFL is like you listen to everybody, hear everybody\n\n1:53:30.000 --> 1:53:31.000\n out.\n\n1:53:31.000 --> 1:53:33.400\n You make a decision and you move forward.\n\n1:53:33.400 --> 1:53:37.600\n And he didn't like the negativity that burdened him after that.\n\n1:53:37.600 --> 1:53:41.520\n People like some parts of the benevolent dictator for life mantra, but once the dictator does\n\n1:53:41.520 --> 1:53:44.840\n things different than you want, suddenly dictatorship doesn't seem so great.\n\n1:53:44.840 --> 1:53:45.840\n Yeah.\n\n1:53:45.840 --> 1:53:46.840\n I mean, they still liked it.\n\n1:53:46.840 --> 1:53:50.680\n He just couldn't because he truly is the bee in the benevolent.\n\n1:53:50.680 --> 1:53:52.520\n He's really, he really is a nice guy.\n\n1:53:52.520 --> 1:53:56.880\n He, I mean, and I think he can't, it's a lot of toxicity.\n\n1:53:56.880 --> 1:53:57.880\n It's difficult.\n\n1:53:57.880 --> 1:53:58.880\n It's a difficult job.\n\n1:53:58.880 --> 1:54:01.480\n And that's why Linus Torvalds is perhaps the way he is.\n\n1:54:01.480 --> 1:54:06.920\n You have to have a thick skin to fight off, fight off the warring masses.\n\n1:54:06.920 --> 1:54:11.380\n It's kind of surprising to me how many people can like threatened to murder each other over\n\n1:54:11.380 --> 1:54:15.360\n whether we should have braces or not, or like it's incredible.\n\n1:54:15.360 --> 1:54:16.360\n Yeah.\n\n1:54:16.360 --> 1:54:18.160\n I mean, that's my knee jerk reaction to the walrus operators.\n\n1:54:18.160 --> 1:54:20.080\n Like I don't actually care that much either way.\n\n1:54:20.080 --> 1:54:22.280\n I'm not going to get personally passionate.\n\n1:54:22.280 --> 1:54:26.440\n My initial reaction was like, yeah, this seems to make things more confusing to read.\n\n1:54:26.440 --> 1:54:29.300\n But then again, so does list comprehension until you're used to it.\n\n1:54:29.300 --> 1:54:33.880\n So like if there's a use for it, great, if not great, but like, let's just all calm down\n\n1:54:33.880 --> 1:54:37.840\n about our spaces versus tabs debates here and like, be chill.\n\n1:54:37.840 --> 1:54:38.840\n Yeah.\n\n1:54:38.840 --> 1:54:44.240\n To me, it just represents the value of great leadership, even in open source communities.\n\n1:54:44.240 --> 1:54:46.640\n Does it represent that if he stepped down as a leader?\n\n1:54:46.640 --> 1:54:48.120\n Well, he fought for it.\n\n1:54:48.120 --> 1:54:49.600\n No, he got it passed.\n\n1:54:49.600 --> 1:54:54.000\n I guess, but I guess, I could represent multiple things too.\n\n1:54:54.000 --> 1:54:59.320\n It can represent like failed dictatorships or it can, it can represent a lot of things,\n\n1:54:59.320 --> 1:55:03.120\n but to me, great leaders take risks.\n\n1:55:03.120 --> 1:55:09.140\n Even if it, even if it's a mistake at the end, like you have to make decisions.\n\n1:55:09.140 --> 1:55:11.760\n The thing is this world won't go anywhere.\n\n1:55:11.760 --> 1:55:17.320\n If you constantly, if whenever there's a divisive thing, you wait until the division is no longer\n\n1:55:17.320 --> 1:55:18.320\n there.\n\n1:55:18.320 --> 1:55:22.560\n Like that's the paralysis we experienced with like Congress and political systems.\n\n1:55:22.560 --> 1:55:28.800\n It's good to be slow when there's indecision, when there's people disagree, it's good to\n\n1:55:28.800 --> 1:55:29.880\n take your time.\n\n1:55:29.880 --> 1:55:34.020\n But like at a certain point it results in paralysis and you just have to make a decision.\n\n1:55:34.020 --> 1:55:40.040\n The background of the site, whether it's yellow, blue, or red can cause people to like go to\n\n1:55:40.040 --> 1:55:43.080\n war over each other, which I've seen this with design.\n\n1:55:43.080 --> 1:55:49.520\n People are very touch on color, color choices at the end of the day, just make a decision\n\n1:55:49.520 --> 1:55:50.520\n and go with it.\n\n1:55:50.520 --> 1:55:55.400\n And that, that's what the Walrus operator represents to me is it represents the fighter\n\n1:55:55.400 --> 1:56:01.720\n pilot instinct of like quick action is more important than, than just like hearing everybody\n\n1:56:01.720 --> 1:56:05.600\n out and really think it through it because that's going to lead to paralysis.\n\n1:56:05.600 --> 1:56:06.600\n Yeah.\n\n1:56:06.600 --> 1:56:10.800\n Like if that's the actual case that, you know, it's something where he's consciously hearing\n\n1:56:10.800 --> 1:56:16.280\n people's disagreement, disagreeing with that disagreement and saying he wants to move forward\n\n1:56:16.280 --> 1:56:21.160\n anyway, that's an admirable aspect of leadership.\n\n1:56:21.160 --> 1:56:26.520\n So we don't have much time, but I want to ask just cause it's some beautiful mathematics\n\n1:56:26.520 --> 1:56:27.520\n involved.\n\n1:56:27.520 --> 1:56:35.360\n 2020 brought us a couple of in the physics world theories of everything, Eric Weinstein\n\n1:56:35.360 --> 1:56:41.120\n kind of, I mean, it's been working for probably decades, but he put out this idea of geometric\n\n1:56:41.120 --> 1:56:46.720\n unity or started sort of publicly thinking and talking about it more, Steven Wolfram\n\n1:56:46.720 --> 1:56:53.560\n put out his physics project, which is kind of this hypergraph view of a theory of everything.\n\n1:56:53.560 --> 1:56:58.920\n Do you find interesting, beautiful things to these theories of everything?\n\n1:56:58.920 --> 1:57:04.520\n What do you think about the physics world and sort of the beautiful, interesting, insightful\n\n1:57:04.520 --> 1:57:09.600\n mathematics in that world, whether we're talking about quantum mechanics, which you touched\n\n1:57:09.600 --> 1:57:13.840\n on in a bunch of your videos a little bit, quaternions, like just the mathematics involved\n\n1:57:13.840 --> 1:57:19.360\n or the general relativity, which is more about surfaces and topology, all that stuff.\n\n1:57:19.360 --> 1:57:25.160\n Well, I think, um, as far as like popularized science is concerned, people are more interested\n\n1:57:25.160 --> 1:57:29.640\n in theories of everything than they should be like, cause the problem is whether we're\n\n1:57:29.640 --> 1:57:34.520\n talking about trying to make sense of Weinstein's lectures or Wolfram's project, or let's just\n\n1:57:34.520 --> 1:57:40.000\n say like listening to, uh, Witten talk about string theory, whatever proposed path to a\n\n1:57:40.000 --> 1:57:44.120\n theory of everything, um, you're not actually going to understand it.\n\n1:57:44.120 --> 1:57:48.120\n Some physicists will, but like, you're just not actually going to understand the substance\n\n1:57:48.120 --> 1:57:49.240\n of what they're saying.\n\n1:57:49.240 --> 1:57:53.520\n What I think is way, way more productive is, um, to let yourself get really interested\n\n1:57:53.520 --> 1:57:58.320\n in the phenomena that are still deep, but which you have a chance of understanding because\n\n1:57:58.320 --> 1:58:02.300\n the path to getting to like even understanding what questions these theories of everything\n\n1:58:02.300 --> 1:58:06.680\n are trying to answer involves like walking down that, um, I mean, I was watching a video\n\n1:58:06.680 --> 1:58:11.480\n before I came here about from Steve mold talking about, um, why sugar polarizes light in a\n\n1:58:11.480 --> 1:58:12.740\n certain way.\n\n1:58:12.740 --> 1:58:15.400\n So fascinating, like really, really interesting.\n\n1:58:15.400 --> 1:58:19.800\n It's not like this novel theory of everything type thing, but to understand what's going\n\n1:58:19.800 --> 1:58:23.480\n on there really requires digging in in depth to certain ideas.\n\n1:58:23.480 --> 1:58:27.440\n And if you let yourself think past what the video tells you about what does circularly\n\n1:58:27.440 --> 1:58:31.160\n polarized light mean and things like that, it actually would get you to a pretty good\n\n1:58:31.160 --> 1:58:36.280\n appreciation of like two state states and quantum systems, um, in a way that just trying\n\n1:58:36.280 --> 1:58:40.920\n to read about like, Oh, what's the, um, what are the hard parts about resolving quantum\n\n1:58:40.920 --> 1:58:44.400\n field theories with general relativity is never going to get you.\n\n1:58:44.400 --> 1:58:50.340\n So as far as popularizing science is concerned, like the audience should be less interested\n\n1:58:50.340 --> 1:58:52.720\n than they are in theories of everything.\n\n1:58:52.720 --> 1:58:59.360\n Um, the popularizers should be less emphatic than they are about that for like actual practicing\n\n1:58:59.360 --> 1:59:00.360\n physicists.\n\n1:59:00.360 --> 1:59:01.360\n And that might be the case.\n\n1:59:01.360 --> 1:59:06.040\n Maybe more people should think about fundamental questions, but it's difficult to create, uh,\n\n1:59:06.040 --> 1:59:09.600\n like a three blue, one brown video on the theory of everything.\n\n1:59:09.600 --> 1:59:16.040\n So basically we should really try to find the beauty in mathematics or physics by looking\n\n1:59:16.040 --> 1:59:18.440\n at concepts that are like within reach.\n\n1:59:18.440 --> 1:59:20.320\n Yeah, I think that's super important.\n\n1:59:20.320 --> 1:59:25.360\n I mean, so you see this in math too with, um, the big unsolved problems.\n\n1:59:25.360 --> 1:59:29.400\n So like the clay millennium problems, Riemann hypothesis, um, have you ever done a video\n\n1:59:29.400 --> 1:59:30.400\n on Fermat's last theorem?\n\n1:59:30.400 --> 1:59:31.720\n No, I have not yet.\n\n1:59:31.720 --> 1:59:32.720\n No.\n\n1:59:32.720 --> 1:59:34.120\n But if I did, do you know what I would do?\n\n1:59:34.120 --> 1:59:38.720\n I would talk about, um, proving Fermat's last theorem in the specific case of N equals\n\n1:59:38.720 --> 1:59:39.720\n three.\n\n1:59:39.720 --> 1:59:40.720\n Okay.\n\n1:59:40.720 --> 1:59:41.720\n Is that still accessible though?\n\n1:59:41.720 --> 1:59:42.720\n Yes.\n\n1:59:42.720 --> 1:59:43.720\n Actually barely.\n\n1:59:43.720 --> 1:59:46.160\n Um, Mathologer might be able to do like a great job on this.\n\n1:59:46.160 --> 1:59:50.480\n He does a good job of taking stuff that's barely accessible and making it, but the,\n\n1:59:50.480 --> 1:59:55.280\n the core ideas of proving it for N equals three are hard, but they do get you real ideas\n\n1:59:55.280 --> 1:59:56.960\n about algebraic number theory.\n\n1:59:56.960 --> 2:00:00.760\n And it involves looking at a number field that's, uh, it lives in the complex plane.\n\n2:00:00.760 --> 2:00:04.680\n It looks like a hexagonal lattice and you start asking questions about factoring numbers\n\n2:00:04.680 --> 2:00:06.540\n in this hexagonal lattice.\n\n2:00:06.540 --> 2:00:10.280\n So it takes a while, but I've talked about this sort of like lattice arithmetic, um,\n\n2:00:10.280 --> 2:00:15.680\n in other contexts and you can get to a okay understanding of that.\n\n2:00:15.680 --> 2:00:18.720\n And the things that make Fermat's last theorem hard are actually quite deep.\n\n2:00:18.720 --> 2:00:23.040\n Um, and so the cases that we can solve it for, it's like you can get these broad sweeps\n\n2:00:23.040 --> 2:00:28.800\n based on some hard, but like accessible, um, bits of number theory.\n\n2:00:28.800 --> 2:00:32.280\n But before you can even understand why the general case is as hard as it is, you have\n\n2:00:32.280 --> 2:00:33.960\n to walk through those.\n\n2:00:33.960 --> 2:00:38.040\n And so any other attempt to describe it would just end up being like shallow and not really\n\n2:00:38.040 --> 2:00:39.840\n productive for the viewer's time.\n\n2:00:39.840 --> 2:00:45.900\n Um, I think the same goes for, uh, most like unsolved problem type things where I think,\n\n2:00:45.900 --> 2:00:49.860\n you know, as a kid, I was actually very inspired by the twin prime conjecture, um, that like\n\n2:00:49.860 --> 2:00:52.400\n totally sucked me in as this thing that was understandable.\n\n2:00:52.400 --> 2:00:55.960\n I kind of had this dream like, Oh, maybe I'll be the one to prove the twin prime conjecture\n\n2:00:55.960 --> 2:01:00.000\n and new math that I would learn would be like viewed through this lens of like, Oh, maybe\n\n2:01:00.000 --> 2:01:01.920\n I can apply it to that in some way.\n\n2:01:01.920 --> 2:01:08.280\n But, uh, you sort of mature to a point where you realize that, uh, you should spend your\n\n2:01:08.280 --> 2:01:12.920\n brain cycles on problems that you will see resolved because then you're going to grow\n\n2:01:12.920 --> 2:01:16.420\n to see what it feels like for these things to be resolved rather than spending your brain\n\n2:01:16.420 --> 2:01:19.920\n cycles on something where it's not, it's not going to pan out.\n\n2:01:19.920 --> 2:01:24.280\n Um, and the people who do make progress towards these things like James Maynard, uh, is a\n\n2:01:24.280 --> 2:01:28.960\n great example here of like young creative mathematician who like pushes in the direction\n\n2:01:28.960 --> 2:01:33.040\n of things like the twin prime conjecture rather than hitting that head on, just see all the\n\n2:01:33.040 --> 2:01:36.520\n interesting questions that are hard for similar reasons, but become more tractable and let\n\n2:01:36.520 --> 2:01:38.480\n themselves really engage with those.\n\n2:01:38.480 --> 2:01:41.280\n Um, so I think people should get in that habit.\n\n2:01:41.280 --> 2:01:46.160\n I think the popularization of physics should encourage that habit through things like the\n\n2:01:46.160 --> 2:01:50.000\n physics of simple everyday phenomena, because it can get quite deep.\n\n2:01:50.000 --> 2:01:54.680\n And um, yeah, I think I, you know, I've, I've heard a lot of the interest that, you know,\n\n2:01:54.680 --> 2:01:58.880\n people send me messages asking to explain Weinstein's thing or asking to explain Wolfram's\n\n2:01:58.880 --> 2:01:59.880\n thing.\n\n2:01:59.880 --> 2:02:06.400\n One, I don't understand them, but more importantly, um, it's too big a bite to, you shouldn't\n\n2:02:06.400 --> 2:02:08.960\n be interested in those, right?\n\n2:02:08.960 --> 2:02:12.480\n The giant sort of a ball of interesting ideas.\n\n2:02:12.480 --> 2:02:16.600\n There's probably a million of interesting ideas in there that individually could be\n\n2:02:16.600 --> 2:02:17.600\n explored effectively.\n\n2:02:17.600 --> 2:02:20.080\n And to be clear, you should be interested in fundamental questions.\n\n2:02:20.080 --> 2:02:25.160\n I think that's a good habit to ask what the fundamentals of things are, but I think it\n\n2:02:25.160 --> 2:02:29.480\n takes a lot of steps to like, certainly you shouldn't be trying to answer that unless\n\n2:02:29.480 --> 2:02:33.520\n you actually understand quantum field theory and you actually understand general relativity.\n\n2:02:33.520 --> 2:02:37.200\n That's the cool thing about like your videos, people who haven't done mathematics, like\n\n2:02:37.200 --> 2:02:42.560\n if you really give it time, watch it a couple of times and like try to try to reason about\n\n2:02:42.560 --> 2:02:45.400\n it, you can actually understand the concept that's being explained.\n\n2:02:45.400 --> 2:02:49.980\n And it's not a coincidence that the things I'm describing aren't like the most, um, up\n\n2:02:49.980 --> 2:02:55.720\n to date, uh, progress on the Riemann hypothesis cousins or, um, like there's context in which\n\n2:02:55.720 --> 2:03:00.200\n the analog of the Riemann hypothesis has been solved in like more, uh, discrete feeling\n\n2:03:00.200 --> 2:03:02.360\n finite settings that are more well behaved.\n\n2:03:02.360 --> 2:03:05.840\n I'm not describing that because it just takes a ton to get there.\n\n2:03:05.840 --> 2:03:10.800\n And instead I think it'll be like productive to have an actual understanding of something\n\n2:03:10.800 --> 2:03:12.940\n that can, you can pack into 20 minutes.\n\n2:03:12.940 --> 2:03:15.160\n I think that's beautifully put ultimately.\n\n2:03:15.160 --> 2:03:20.320\n That's where like the most satisfying thing is when you really understand, um, yeah, really\n\n2:03:20.320 --> 2:03:25.080\n understand, build a habit of feeling what it's like to actually come to resolution.\n\n2:03:25.080 --> 2:03:26.080\n Yeah.\n\n2:03:26.080 --> 2:03:27.080\n Yeah.\n\n2:03:27.080 --> 2:03:32.120\n As opposed to, which it can also be enjoyable, but just being in awe of the fact that you\n\n2:03:32.120 --> 2:03:33.120\n don't understand anything.\n\n2:03:33.120 --> 2:03:34.120\n Yeah.\n\n2:03:34.120 --> 2:03:35.120\n That's not like, I don't know.\n\n2:03:35.120 --> 2:03:40.440\n Maybe we'll get entertainment out of that, but it's not as fulfilling as understanding\n\n2:03:40.440 --> 2:03:41.920\n you won't grow.\n\n2:03:41.920 --> 2:03:42.920\n Yeah.\n\n2:03:42.920 --> 2:03:47.560\n And, but also just the fulfilling, it really does feel good when you first don't understand\n\n2:03:47.560 --> 2:03:51.040\n something and then you do, that's a beautiful feeling.\n\n2:03:51.040 --> 2:03:57.080\n Hey, let me ask you one, uh, last, last time we got awkward and weird about, uh, a fear\n\n2:03:57.080 --> 2:04:01.600\n of mortality, which you made fun of me off, but let me ask you on the, the other absurd\n\n2:04:01.600 --> 2:04:08.000\n question is, um, what do you think is, uh, the meaning of our life of meaning of life?\n\n2:04:08.000 --> 2:04:11.160\n I'm sorry if I made fun of you about, no, you didn't.\n\n2:04:11.160 --> 2:04:12.160\n I'm just joking.\n\n2:04:12.160 --> 2:04:13.160\n It was great.\n\n2:04:13.160 --> 2:04:15.300\n I don't think life has a meaning.\n\n2:04:15.300 --> 2:04:18.560\n I think like meaning, I don't understand the question.\n\n2:04:18.560 --> 2:04:22.600\n I think meaning is something that's described to stuff that's created with purpose.\n\n2:04:22.600 --> 2:04:26.440\n There's a meaning to, uh, like this water bottle label and that someone created it with\n\n2:04:26.440 --> 2:04:27.960\n a purpose of conveying meaning.\n\n2:04:27.960 --> 2:04:31.560\n And there was like one consciousness that wanted to get its ideas into another consciousness.\n\n2:04:31.560 --> 2:04:35.640\n Um, most things don't have that property.\n\n2:04:35.640 --> 2:04:41.160\n It's a little bit like if I asked you, um, like what is the height, all right, so it's\n\n2:04:41.160 --> 2:04:42.160\n all relative.\n\n2:04:42.160 --> 2:04:43.160\n Yeah.\n\n2:04:43.160 --> 2:04:44.840\n You'd be like the height of what you can't ask.\n\n2:04:44.840 --> 2:04:46.600\n What is the height without an object?\n\n2:04:46.600 --> 2:04:50.880\n You can't ask what is the meaning of life without like an intentful consciousness, putting\n\n2:04:50.880 --> 2:04:56.400\n it like, I guess I'm revealing I'm not very religious, but you know, the mathematics of\n\n2:04:56.400 --> 2:04:58.800\n everything seems kind of beautiful.\n\n2:04:58.800 --> 2:05:05.280\n It seems like, it seems like there's some kind of structure relative to which, I mean,\n\n2:05:05.280 --> 2:05:06.880\n you could calculate the height.\n\n2:05:06.880 --> 2:05:09.840\n Well, so, but what I'm saying is I don't understand the question.\n\n2:05:09.840 --> 2:05:10.840\n What is the meaning of life in that?\n\n2:05:10.840 --> 2:05:13.680\n I think people might be asking something very real.\n\n2:05:13.680 --> 2:05:14.680\n I don't understand what they're asking.\n\n2:05:14.680 --> 2:05:16.800\n Are they asking like, why does life exist?\n\n2:05:16.800 --> 2:05:17.840\n Like how did it come about?\n\n2:05:17.840 --> 2:05:19.320\n What are the natural laws?\n\n2:05:19.320 --> 2:05:23.600\n Are they asking, um, as I'm making decisions day by day for what should I do?\n\n2:05:23.600 --> 2:05:26.240\n What is the guiding light that inspires like, what should I do?\n\n2:05:26.240 --> 2:05:27.960\n I think that's what people are kind of asking.\n\n2:05:27.960 --> 2:05:36.160\n But also like why the thing that gives you joy about education, about mathematics, what\n\n2:05:36.160 --> 2:05:37.680\n the hell is that?\n\n2:05:37.680 --> 2:05:41.840\n Like what interactions with other people, interactions with like minded people, I think\n\n2:05:41.840 --> 2:05:46.860\n is the meaning of, in that sense, bringing others joy, essentially, like in something\n\n2:05:46.860 --> 2:05:53.560\n you've created, it connects with others somehow and the same and the vice versa.\n\n2:05:53.560 --> 2:05:57.460\n I think that that is what, um, when we use the word meaning to mean like you're sort\n\n2:05:57.460 --> 2:06:01.600\n of filled with a sense of happiness and energy to create more things, like I have so much\n\n2:06:01.600 --> 2:06:06.640\n meaning taken from this, like that, yeah, that's what fuels, fuels my pump at least.\n\n2:06:06.640 --> 2:06:10.480\n So a life alone on a desert island would be kind of meaningless.\n\n2:06:10.480 --> 2:06:11.480\n Yeah.\n\n2:06:11.480 --> 2:06:13.960\n You want to be alone together with someone.\n\n2:06:13.960 --> 2:06:15.680\n I think we're all alone together.\n\n2:06:15.680 --> 2:06:18.600\n I think there's no better way to end it, Grant.\n\n2:06:18.600 --> 2:06:22.200\n You've been, first time we talked, it was amazing again, it's a huge honor that you\n\n2:06:22.200 --> 2:06:23.200\n make time for me.\n\n2:06:23.200 --> 2:06:24.200\n I appreciate talking with you.\n\n2:06:24.200 --> 2:06:25.200\n Thanks, man.\n\n2:06:25.200 --> 2:06:26.200\n Awesome.\n\n2:06:26.200 --> 2:06:27.200\n Thanks for listening.\n\n2:06:27.200 --> 2:06:29.640\n Thanks for listening to this conversation with Grant Sanderson.\n\n2:06:29.640 --> 2:06:34.840\n And thank you to our sponsors, Dollar Shave Club, DoorDash, and Cash App.\n\n2:06:34.840 --> 2:06:39.000\n Click the sponsor links in the description to get a discount and to support this podcast.\n\n2:06:39.000 --> 2:06:44.520\n If you enjoy this thing, subscribe on YouTube, review it with five stars on Apple Podcast,\n\n2:06:44.520 --> 2:06:50.800\n follow on Spotify, support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n2:06:50.800 --> 2:06:54.240\n And now let me leave you with some words from Richard Feynman.\n\n2:06:54.240 --> 2:06:59.440\n I have a friend who's an artist and has sometimes taken a view which I don't agree with very\n\n2:06:59.440 --> 2:07:00.440\n well.\n\n2:07:00.440 --> 2:07:04.960\n He'll hold up a flower and say, look how beautiful it is, and I'll agree.\n\n2:07:04.960 --> 2:07:10.800\n Then he says, I as an artist can see how beautiful this is, but you as a scientist take this\n\n2:07:10.800 --> 2:07:13.960\n all apart and it becomes a dull thing.\n\n2:07:13.960 --> 2:07:16.240\n And I think he's kind of nutty.\n\n2:07:16.240 --> 2:07:21.560\n First of all, the beauty that he sees is available to other people and to me too, I believe.\n\n2:07:21.560 --> 2:07:26.960\n Although I may not be quite as refined aesthetically as he is, I can appreciate the beauty of a\n\n2:07:26.960 --> 2:07:27.960\n flower.\n\n2:07:27.960 --> 2:07:31.160\n At the same time, I see much more about the flower than he sees.\n\n2:07:31.160 --> 2:07:37.040\n I can imagine the cells in there, the complicated actions inside, which also have a beauty.\n\n2:07:37.040 --> 2:07:40.900\n I mean, it's not just beauty at this dimension at one centimeter, there's also beauty at\n\n2:07:40.900 --> 2:07:46.280\n smaller dimensions, the inner structure, also the processes.\n\n2:07:46.280 --> 2:07:50.480\n The fact that the colors in the flower evolved in order to attract insects to pollinate it\n\n2:07:50.480 --> 2:07:52.040\n is interesting.\n\n2:07:52.040 --> 2:07:54.880\n It means that insects can see the color.\n\n2:07:54.880 --> 2:07:56.240\n It adds a question.\n\n2:07:56.240 --> 2:07:59.760\n Does this aesthetic sense also exist in the lower forms?\n\n2:07:59.760 --> 2:08:01.320\n Why is it aesthetic?\n\n2:08:01.320 --> 2:08:05.920\n All kinds of interesting questions which the science knowledge only adds to the excitement,\n\n2:08:05.920 --> 2:08:08.700\n the mystery and the awe of a flower.\n\n2:08:08.700 --> 2:08:09.700\n It only adds.\n\n2:08:09.700 --> 2:08:13.280\n I don't understand how it subtracts.\n\n2:08:13.280 --> 2:08:25.240\n Thank you for listening and hope to see you next time.\n\n"
}