{
  "title": "Ryan Schiller: Librex and the Free Exchange of Ideas on College Campuses | Lex Fridman Podcast #172",
  "id": "UOEpe17nPhE",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.520\n The following is a conversation with Ryan Schiller, creator of Librex, an anonymous\n\n00:05.520 --> 00:11.440\n discussion feed for college communities starting at first with Yale, then the Ivy Leagues, and now\n\n00:11.440 --> 00:18.560\n adding Stanford and MIT. Their mission is to give students a place to explore ideas and issues\n\n00:18.560 --> 00:24.880\n in a positive way, but with much more personal and intellectual freedom than has defined college\n\n00:24.880 --> 00:31.760\n campuses in recent history. I think this is a very difficult but worthy project. Quick thank you to\n\n00:31.760 --> 00:38.800\n our sponsors, Allform, Magic Spoon, Better Help, and Brave. Click their links to support this\n\n00:38.800 --> 00:46.160\n podcast. As a side note, let me say that Ryan is a young entrepreneur and genuine human being who\n\n00:46.160 --> 00:52.320\n quickly won me over. He's inspiring in many ways, both in the struggle he had to overcome in his\n\n00:52.320 --> 00:58.800\n personal life, but also in the fact that he did not know how to code, but saw a problem in this\n\n00:58.800 --> 01:05.600\n world, in his community, that he cared about, and for that he learned to code and built a solution\n\n01:05.600 --> 01:11.840\n in the best way he knew how. That's an important reminder for us humans. Let us not only complain\n\n01:11.840 --> 01:18.160\n about the problems in the world, let us fix them. I also have to say that there's passion in Ryan's\n\n01:18.160 --> 01:24.160\n eyes for really wanting to make a difference in the world. His story, his effort, gives me hope\n\n01:24.160 --> 01:30.400\n for the future. There is hate in this world, but I believe there's much more love, and I believe\n\n01:30.400 --> 01:36.400\n it's possible to build online platforms that connect us through our common humanity as we\n\n01:36.400 --> 01:44.320\n explore difficult, personal, even painful ideas together. This is the Lex Friedman podcast,\n\n01:44.320 --> 01:51.040\n and here is my conversation with Ryan Shiller. Let's start with the basics. What is Librex?\n\n01:51.600 --> 01:57.200\n What are its founding story and founding principles? And looking to the future,\n\n01:57.200 --> 02:02.960\n what do you hope to achieve with Librex? Sure, let me break that down. So what is Librex? Librex is\n\n02:02.960 --> 02:09.440\n an anonymous discussion feed for college campuses. It's a place where people can have important and\n\n02:09.440 --> 02:14.640\n unfettered discussions and open discourse about topics they care about, ideas that matter,\n\n02:14.640 --> 02:18.800\n and they can do all of that completely anonymously with verified members of their\n\n02:18.800 --> 02:26.480\n college community. And we exist both on each Ivy League campus, and we have an interivy community,\n\n02:26.480 --> 02:34.000\n and actually this week we just opened to MIT and Stanford. No, really? MIT? Yes! So we have\n\n02:34.000 --> 02:40.160\n MIT and Stanford communities, and I expect you to sign up for your MIT account and start posting.\n\n02:40.160 --> 02:46.080\n What are, for people who are not familiar like me actually, which are the Ivy Leagues? Sure,\n\n02:46.080 --> 02:51.440\n so we started at Yale, which is my, I don't know, can you call it alma mater? Because I haven't\n\n02:51.440 --> 02:57.280\n technically graduated. Yeah, what's that called when you're actually still there? My university?\n\n02:57.280 --> 03:02.400\n Yeah, I guess we'll just call it home. That's my home. Educational home. Started at my educational\n\n03:02.400 --> 03:08.240\n home of Yale, and then we moved to, and we could get into the story of this eventually if you'd\n\n03:08.240 --> 03:14.240\n like, and then we went to Dartmouth, and then quarantine hit. We opened to the rest of the\n\n03:14.240 --> 03:20.880\n Ivy League, and now we have, and the Ivy League, for those who don't know, is Harvard, Yale,\n\n03:20.880 --> 03:27.360\n Princeton, Dartmouth, Columbia, Cornell, Brown, and Penn. I got it all in one breath. What's the\n\n03:27.360 --> 03:34.400\n younger side of the league? Penn? No. Columbia. I can't say that on camera. We'll edit it in post.\n\n03:34.400 --> 03:40.160\n I don't know. I'll just say each of all eight of them, and then you can just like get it in.\n\n03:40.160 --> 03:44.240\n Yeah. Penn, Harvard. There's actually a really nice software that people should check out,\n\n03:44.240 --> 03:50.160\n like a service. It's using machine learning really nicely for podcast editing, where you can,\n\n03:50.160 --> 03:56.560\n it learns the voice of the speaker, and it can change the words you said. It's like some deep\n\n03:56.560 --> 04:00.960\n fake stuff. It's deep fake, but for positive applications. It's very interesting. It's like\n\n04:00.960 --> 04:05.120\n the only deep fake positive application I've seen. I have a friend who's obsessed with deep fakes.\n\n04:05.120 --> 04:10.000\n Yeah. What's great about, I think, deep fakes is that it's going to do the opposite of sort of\n\n04:10.000 --> 04:14.960\n what's happening with our culture, where everyone will have plausible deniability. Yeah, exactly. I\n\n04:14.960 --> 04:21.520\n mean, that's the hope for me is there's so many fake things out there that we're going to actually\n\n04:21.520 --> 04:29.120\n be much more skeptical, and think, and take in multiple sources, and actually like reason,\n\n04:29.120 --> 04:34.640\n like use common sense, and use like deep thinking to understand like what is true and what is not.\n\n04:34.640 --> 04:40.000\n Because, you know, we used to have like traditional sources like the New York Times, and all these\n\n04:40.000 --> 04:45.200\n kinds of publications that had a reputation. There are these institutions, and they're the source of\n\n04:45.200 --> 04:50.400\n truth. And when you no longer can trust anything as a source of truth, you start to think on your\n\n04:50.400 --> 04:55.360\n own. That gets part of the individual. That goes, that takes us way back to like where I came from,\n\n04:55.360 --> 05:00.320\n the Soviet Union, where you can't really trust any one source of news. You have to think on your own.\n\n05:00.320 --> 05:04.960\n You have to talk to your friends. Tremendous amount of intellectual autonomy, don't you think?\n\n05:04.960 --> 05:10.880\n Think about the societal consequences. Absolutely. I mean, we see so much decentralization in all\n\n05:10.880 --> 05:18.720\n aspects of our digital lives now, but this is like the decentralization of thought. Yes. You\n\n05:18.720 --> 05:25.600\n could say it's sadly, or I don't think it's sad, is decentralization of truth, where like truth is a\n\n05:25.600 --> 05:32.160\n clustering thing, where you have these like this point cloud of people just swimming around, like\n\n05:32.160 --> 05:39.280\n billions of them, and they all have certain ideas. And what's thought of as truth is almost like a\n\n05:39.280 --> 05:44.160\n clustering algorithm. When you just get a bunch of people that believe the same thing, that's truth.\n\n05:44.160 --> 05:49.680\n But there's also another truth, and there may be like multiple truths, and it's almost will be like\n\n05:49.680 --> 05:57.760\n a battle of truths. Maybe even the idea of truth will like lessen its power in society that there\n\n05:57.760 --> 06:04.400\n is such a thing as a truth. Because like the downside of saying something is true is it's almost\n\n06:04.400 --> 06:11.040\n the downside of what people like religious people call scientism, which is like once science has\n\n06:11.040 --> 06:18.000\n declared something as true, you can't no longer question it. But the reality is science is a\n\n06:18.000 --> 06:23.600\n moving mechanism. You constantly question, you constantly questioning, and maybe truth should be\n\n06:23.600 --> 06:32.960\n renamed as a process, not a final destination. The whole point is to keep questioning, keep questioning,\n\n06:32.960 --> 06:40.080\n keep discovering. Kind of like we're going backwards in time. So like back when people were\n\n06:40.080 --> 06:46.160\n sort of finding their identities and we were less globalized, right? Like people would get together\n\n06:46.160 --> 06:50.960\n and they'd get together around common value system, common morals, and a common place. And those would\n\n06:50.960 --> 06:56.080\n be sort of these clusters of their truth, right? And so we have all these different civilizations\n\n06:56.080 --> 07:01.520\n and societies across the world that created their own truths. We talk about the Jews and the\n\n07:01.520 --> 07:07.440\n Talmud and Torah. We look at Buddhist texts. We can look at all sorts of different truths and how\n\n07:07.440 --> 07:12.240\n many of them get at the same things, but many of them have different ideas or different articulations.\n\n07:12.240 --> 07:17.680\n Yeah, Harari and sapiens, it rewinds that even farther back into like caveman times. That's the\n\n07:17.680 --> 07:22.400\n thing that made us humans special, is who can develop these clusters of ideas, hold them in\n\n07:22.400 --> 07:27.520\n their minds through stories, pass them on to each other, and it grows and grows. And finally, we have\n\n07:27.520 --> 07:37.440\n Bitcoin. Which money is another belief system that has power only because we believe in it.\n\n07:37.440 --> 07:44.000\n And is that truth? I don't know, but it has power. And it's carried in the minds of millions\n\n07:44.000 --> 07:51.680\n and thereby has power. But back to Librex. So what's the founding story? What's the founding\n\n07:51.680 --> 07:58.000\n principles of Librex? Sure. So I was on campus as a freshman, and I was talking to my friends.\n\n07:58.720 --> 08:04.480\n Many of them felt like it was hard to raise your hand in class to ask a question. They really felt\n\n08:04.480 --> 08:08.320\n like even outside the classroom, it was hard to be vulnerable. And the thing you have to understand\n\n08:08.320 --> 08:13.680\n about Yale is it's not that big a place. Everyone knows someone who knows someone who knows you,\n\n08:13.680 --> 08:19.680\n basically. And people come to these schools, first of all, they're home for people, and they want to\n\n08:19.680 --> 08:23.120\n be themselves. They want to feel like they can be authentic. They want to make real friendships.\n\n08:23.120 --> 08:28.960\n And second of all, it's a place where people go for intellectual vitality to explore important\n\n08:28.960 --> 08:35.840\n ideas and to grow as thinkers. And fortunately, due to the culture, my friends expressed that\n\n08:35.840 --> 08:40.640\n it was very difficult to do that. And I felt it, too. And then I couldn't talk to my professors.\n\n08:40.640 --> 08:46.240\n And I remember I talked to one specific global affairs professor, and I was taking his class,\n\n08:46.240 --> 08:50.640\n and his area of expertise was in the Middle Eastern conflict. And I went to him and I said,\n\n08:50.640 --> 08:57.040\n Professor, we're almost finished this class. And we haven't even gotten to sort of the reason I\n\n08:57.040 --> 09:00.400\n originally wanted to take the class was to hear about your perspective on the Middle Eastern\n\n09:00.400 --> 09:04.720\n conflict. Because something I'd learned at Yale, and this is maybe the most important thing,\n\n09:04.720 --> 09:11.600\n but I'll flush it out a bit. Something I've learned at Yale is that you can learn all sorts\n\n09:11.600 --> 09:17.120\n of things from a textbook. And what you kind of go to Yale to do is to get the opinions of the\n\n09:17.120 --> 09:22.080\n experts that go beyond the textbook and to have those more in depth conversations. And so that's\n\n09:22.080 --> 09:26.160\n sort of the added value of going to a place like Yale and taking a course there as opposed to\n\n09:26.160 --> 09:29.040\n just reading a textbook. But also interact with that opinion.\n\n09:29.040 --> 09:34.960\n Exactly. To interact with that opinion, to hear it, to respond to it, to push back on it,\n\n09:34.960 --> 09:39.520\n and to have that with some great minds. And there really are great minds at Yale,\n\n09:39.520 --> 09:43.360\n don't get me wrong. It's still a place of tremendous brilliance.\n\n09:44.800 --> 09:48.960\n So I'm talking to this professor, right? And I'm like, I haven't heard your area of expertise.\n\n09:48.960 --> 09:54.080\n And I'm like, are we going to get to it? What's the deal? And this is during office hours,\n\n09:54.080 --> 09:59.680\n mind you. So we're one on one. He says, Ryan, to be honest, I used to teach this area every\n\n09:59.680 --> 10:04.080\n single year. In fact, I would do a section on it, which is like a small seminar, like breakaway\n\n10:04.080 --> 10:10.000\n from the class where he would talk to the students in small groups and explain his perspective,\n\n10:10.000 --> 10:15.600\n his research and have a real debate about it, like around a Harkness table. And he said,\n\n10:15.600 --> 10:22.800\n I used to do this. And then about two years ago, a student reported me to the school and I realized\n\n10:22.800 --> 10:28.400\n my job was at risk. And I realized the best course of action was basically just not to approach the\n\n10:28.400 --> 10:34.880\n topic. And so now I just don't even mention it. And he's like, you can say whatever you want, but\n\n10:35.760 --> 10:40.000\n I'm not going to be a part of it. And it's a real shame. It's a real loss to\n\n10:40.000 --> 10:45.920\n all of the students who I think came to the school to learn from these brilliant professors.\n\n10:45.920 --> 10:53.920\n In that context of these world experts, the problem seems to be that reporting mechanism\n\n10:54.960 --> 11:01.120\n where there's a disproportionate power to a complaint of a young student, a complaint that\n\n11:01.120 --> 11:08.880\n an idea is painful or an idea is disrespectful to, you know, or ideas creating an unsafe space.\n\n11:10.080 --> 11:15.520\n And the conclusion of that, I mean, I'm not sure what to do with that because it's a\n\n11:15.520 --> 11:23.200\n single reporting, maybe a couple, but that has more power than the idea itself. And that's\n\n11:23.200 --> 11:29.120\n strange. I don't know how to fix that in the administration except to fire everybody. So like\n\n11:29.120 --> 11:34.960\n this is to push back against this storyline that academia is somehow fundamentally broken.\n\n11:35.520 --> 11:42.320\n I think we have to separate a lot of things out. Like one is you have to look at faculty and you\n\n11:42.320 --> 11:51.280\n have to look at the administration. And like at MIT, for example, the administration does, tries\n\n11:51.280 --> 11:57.840\n to do well, but they're the ones that often lack courage. They're often the ones who are the source\n\n11:57.840 --> 12:05.120\n of the problem. When people criticize academia, and I'll just speak to myself, you know, I'm\n\n12:05.120 --> 12:11.760\n willing to take heat for this, is they really are criticizing the administration, not the faculty\n\n12:11.760 --> 12:19.600\n because the faculty oftentimes are the most brilliant, the bolder thinkers that you think.\n\n12:19.600 --> 12:25.200\n Whenever you talk about we need like the truth to be spoken, the faculty are often the ones\n\n12:25.200 --> 12:30.560\n who are in the possession of the deepest truths in their mind in that sense. And they also have\n\n12:30.560 --> 12:37.360\n the capacity to truly educate in the way that you're saying. And so it's not broken, like\n\n12:37.360 --> 12:42.800\n fundamentally, but there's stuff that like needs, that's not working that well. It needs to be fixed.\n\n12:42.800 --> 12:46.240\n You kind of took my words. That's what I thought you were going to ask me if I think the Ivy League\n\n12:46.240 --> 12:50.720\n is broken. That's totally, that's exactly it. So you don't think, yeah. So on the question,\n\n12:50.720 --> 12:55.680\n do you think the Ivy League is broken? Like what, how do you think about it? The academia in general,\n\n12:55.680 --> 13:00.960\n I suppose, but Ivy League still, I think it represents some of the best qualities of academia.\n\n13:00.960 --> 13:05.520\n What more is there to say there? I think the Ivy League is producing tremendous thinkers to this\n\n13:05.520 --> 13:11.840\n day. I think the culture has a lot that can be improved, but I have a lot of faith in the people\n\n13:11.840 --> 13:16.240\n who are in these institutions. I think, like you said, the administration, and I have to be a\n\n13:16.240 --> 13:22.640\n little careful because I've been in some of these committees and I've talked to the administration\n\n13:22.640 --> 13:27.600\n about these sorts of things. I think they have a lot of stakeholders and unfortunately it makes\n\n13:27.600 --> 13:33.200\n it difficult for them to always serve these brilliant faculty and the students in the way\n\n13:33.200 --> 13:38.960\n that they would probably like to. Yeah. Okay. So this is me speaking, right? The administration,\n\n13:38.960 --> 13:43.760\n I know the people, and they're oftentimes the faculty holding positions in these committees,\n\n13:43.760 --> 13:51.760\n right? Yes. But it's in the role of quote unquote service. They're trying to do well.\n\n13:52.880 --> 13:59.520\n They're trying to do good. But I think you could say it's the mechanism is not working,\n\n13:59.520 --> 14:10.560\n but I could also say my personal opinion is they lack courage, and one, courage, and two,\n\n14:12.080 --> 14:19.120\n grace when they walk through the fire. So courage is stepping into the fire,\n\n14:20.400 --> 14:29.040\n and grace when you walk through the fire is like maintaining that like as opposed to being rude\n\n14:29.040 --> 14:33.920\n and insensitive to the lived quote unquote experience of others or like, you know,\n\n14:33.920 --> 14:39.600\n just not eloquent at all. Like as you step in and take the courageous step of talking and saying\n\n14:39.600 --> 14:44.480\n the difficult thing, doing it well, like doing it skillfully. So both of those are important,\n\n14:44.480 --> 14:49.520\n the courage and the skill to communicate difficult ideas, and they often lack them because they\n\n14:49.520 --> 14:56.320\n weren't trained for it, I think. So you can blame the mechanisms that don't, that allow 19, 20 year\n\n14:56.320 --> 15:02.160\n old students to have more power than the entire faculty, or you could just say that the faculty\n\n15:02.160 --> 15:08.000\n need to step up and grow some guts and skill of graceful communication. And really administration.\n\n15:08.960 --> 15:13.360\n Well, yeah. And the administration. That's right. That's the administration.\n\n15:13.360 --> 15:19.440\n Because the faculty are sometimes some of the most brave outspoken people within the bounds\n\n15:19.440 --> 15:29.520\n of their career. Yeah. So that takes a, that's like the founding kind of spark of a fire that\n\n15:30.480 --> 15:35.760\n led you to then say, okay, so how can I help? Yeah. And I explored a lot. I explored a lot\n\n15:35.760 --> 15:41.360\n of options. I wrote many articles to my friends, talked to them, and I realized it sort of needed\n\n15:41.360 --> 15:48.320\n to be a cultural change. Sort of need to be bottom up, grassroots. Something, I knew the energy was\n\n15:48.320 --> 15:54.320\n there because you just look at the most recent institutional assessment from Yale. This was\n\n15:55.040 --> 15:59.840\n basically the number one thing that students, faculty, and alumni all pointed to, to the\n\n15:59.840 --> 16:05.120\n administration was cultivating more conversations on campus and more difficult conversations on\n\n16:05.120 --> 16:16.080\n campus. So the people on campus know it. And you look at a Gallup poll, 61% of students are on\n\n16:16.080 --> 16:23.280\n Ivy League campuses, afraid to speak their minds because of the campus culture. The campus culture\n\n16:23.280 --> 16:28.960\n is causing a sort of freezing effect on discourse. Can you pause on that again? So what percentage\n\n16:28.960 --> 16:35.040\n of students feel afraid to speak their mind? 61% nationally. And then you're talking about,\n\n16:35.040 --> 16:40.800\n you know, places, nothing like the Ivy League where I'd say, I'd imagine it would be even worse\n\n16:40.800 --> 16:47.840\n because of just the way that these communities kind of come about and the sorts of people who\n\n16:47.840 --> 16:53.440\n are attracted or are invited to these sorts of communities. That's nationwide that college\n\n16:53.440 --> 16:58.960\n students, and it's going up, that college students are afraid to say what they believe because of\n\n16:58.960 --> 17:05.360\n their campus climate. So it's a majority. It's not a conservative thing. It's not a liberal thing.\n\n17:05.360 --> 17:08.400\n It's a group thing. We're all feeling it. The majority of us are feeling it.\n\n17:08.400 --> 17:12.320\n And basically just, it doesn't even, you don't even necessarily\n\n17:13.120 --> 17:16.400\n need to have anything to say. You just have a fear.\n\n17:17.040 --> 17:17.600\n That's right.\n\n17:17.600 --> 17:23.520\n So when you're like teaching, you know, metaphor is a really powerful thing to explain,\n\n17:23.520 --> 17:28.240\n you know, and there's just the caution that you feel that's just horrible for humor. Now,\n\n17:28.240 --> 17:34.160\n comedians have the freedom to just talk shit, which is why I really appreciate somebody who's\n\n17:34.160 --> 17:41.600\n been a friend recently, Tim Dillon, who gives zero, pardon my French, fucks about anything,\n\n17:41.600 --> 17:46.960\n which is very liberating, very important person to just tear down the powerful.\n\n17:46.960 --> 17:52.960\n But, you know, inside the academia as an educator, as a teacher, as a professor,\n\n17:52.960 --> 17:57.680\n you don't have the same freedom. So that fear is felt, I guess, by a majority of students.\n\n17:57.680 --> 18:00.880\n And you were getting at something there too, which is that\n\n18:00.880 --> 18:04.480\n if you're afraid to speak metaphorically, if you're afraid to speak imprecisely,\n\n18:05.200 --> 18:10.160\n it can be very difficult to actually think at all and to think to the extremities of what you're\n\n18:10.160 --> 18:15.120\n capable of, because these are the mechanisms we use when we don't have quite the precise\n\n18:15.120 --> 18:20.240\n mathematical language to quite pinpoint what we're talking about yet. This is the beginning. This is\n\n18:20.240 --> 18:26.160\n the creative step that leads to new knowledge. And so that really scares me is that if I'm not\n\n18:26.160 --> 18:30.880\n allowed to sort of excavate these things, these ideas with people in the sort of messy, sloppy way\n\n18:30.880 --> 18:36.160\n that we do as humans when we're first being creative, are we going to be able to continue\n\n18:36.160 --> 18:40.400\n to innovate? Are we going to continue to be able to learn? And that's what really starts to scare me.\n\n18:41.280 --> 18:44.640\n So you've explored a bunch of different ideas. You ordered a bunch of different stuff.\n\n18:45.680 --> 18:47.360\n How did lead bricks come about?\n\n18:47.920 --> 18:53.040\n Basically, it came to me that it had to be kind of a grassroots movement and it had to be something\n\n18:53.040 --> 18:58.720\n that changed culturally. And it had to be relatively personal, people meeting people,\n\n18:58.720 --> 19:05.200\n people finding out that, no, I'm not the only one on campus who feels this way. I feel alone. And\n\n19:05.200 --> 19:10.720\n there are a lot of other people who feel alone. I believe this thing. And it's not as unpopular as\n\n19:10.720 --> 19:17.760\n I thought. Basically, creating heterodoxy of thought. And it's creating that moment where\n\n19:17.760 --> 19:23.120\n you realize that your politics are personal and that your politics are shared by a lot of people\n\n19:23.120 --> 19:30.400\n on campus. And so I just started coding it. I didn't have much coding experience, but went\n\n19:30.400 --> 19:37.920\n headfirst in and figured how hard could it be? I mean, this is really fascinating. So I talked to a\n\n19:37.920 --> 19:44.320\n lot of software engineers, AI people. Obviously, that's where my passion, my interests are.\n\n19:44.320 --> 19:50.720\n My focus has been throughout my life. The fascinating thing about your story, I think it\n\n19:50.720 --> 19:56.880\n should be truly inspiring to people that want to change the world, is that you don't have a\n\n19:56.880 --> 20:05.120\n background in programming. You don't have even maybe a technical background. So you saw a problem,\n\n20:06.160 --> 20:12.320\n you explored different ideas, and then you just decided you're going to learn how to build an app\n\n20:12.320 --> 20:22.480\n without a technical background. That's so bold. That is so beautiful, man. Can you take me through\n\n20:22.480 --> 20:29.120\n the journey of deciding to do that, of learning to program without a programming background,\n\n20:29.120 --> 20:33.680\n and building the app? Detail, how do you start?\n\n20:33.680 --> 20:42.960\n Sure. You want to buy a Mac? I'm just going to go step by step. I'll be as dumb as possible.\n\n20:42.960 --> 20:48.240\n Because it was truly leading by your feet.\n\n20:48.240 --> 20:49.680\n So you need a computer for this?\n\n20:49.680 --> 20:54.800\n Oh, yeah. I had a PC at the time, and I was Android at the time. And I realized it should\n\n20:54.800 --> 21:01.280\n be an iOS app. And so that was a decision. But I knew kids these days, they're always on their\n\n21:01.280 --> 21:08.000\n phone. And I wanted you to be able to say a passing thought in class. You're walking around,\n\n21:08.000 --> 21:11.520\n and you have a thought, and you can express it. Or you're in the dining hall, and you have your\n\n21:11.520 --> 21:14.880\n phone out, you can express it. So it was clear to me it should be an iOS app.\n\n21:14.880 --> 21:18.400\n By the way, Android is great. Definitely check it out.\n\n21:18.400 --> 21:20.880\n We also are now available on Android, but we'll get there,\n\n21:21.760 --> 21:27.920\n for the new Android users from MIT, Stanford, or the Ivy League. So back to how it happened. So I\n\n21:27.920 --> 21:34.400\n realized I need a Mac. So I went out and got a Mac. And I realized I need an iPhone for testing\n\n21:34.400 --> 21:41.600\n eventually. Got an iPhone. So those were the real robot blocks to start with. From there, I mean,\n\n21:41.600 --> 21:45.440\n there's almost too much information out there about programming. And the question is, where\n\n21:45.440 --> 21:52.640\n do you start, and what's going to be useful to you? And my first thought was I should look at some\n\n21:52.640 --> 21:58.080\n Yale classes. But it became very clear, very quickly, that that was not the right place to start.\n\n21:58.080 --> 22:01.440\n That would probably be the right place to start if I wanted to get a job at Amazon,\n\n22:01.440 --> 22:07.760\n but my goal was slightly different. And I definitely had it in mind that what I was\n\n22:07.760 --> 22:11.520\n trying to make was I'm trying to prove out an idea. I'm not trying to make a finished product.\n\n22:11.520 --> 22:18.560\n I'm just trying to get to the first step. Because I figured if I keep getting to the next step,\n\n22:18.560 --> 22:23.440\n at least I won't die now. At least things will move forward. I'll learn new things. Maybe I'll\n\n22:23.440 --> 22:27.920\n meet new people. I'll show a degree of seriousness about what I'm doing. And things will come\n\n22:27.920 --> 22:35.040\n together. And that is, as you'll see, what ends up happening. So I start with Swift. And I find\n\n22:35.040 --> 22:39.360\n this video from the Stanford professor that had a million views that was how to make, basically,\n\n22:39.360 --> 22:46.800\n Swift apps perfect. And you just like, so you got this Mac, and you go to google.com,\n\n22:46.800 --> 22:55.840\n and you type in Xcode. And then I type in on YouTube like Stanford, iOS, Swift, enter.\n\n22:57.040 --> 23:01.200\n First YouTube video has a million views. I'm like, it has to be good at Stanford has a million\n\n23:01.200 --> 23:07.520\n views. I got lucky. I mean, that turned out to be a very good video. It's basically like\n\n23:07.520 --> 23:12.160\n introductory course to Swift. Yeah. I mean, you say introductory. I think most of the people in\n\n23:12.160 --> 23:18.000\n that class probably had a much better background than I did software developers probably computer\n\n23:18.000 --> 23:23.520\n scientists. And it was slow for me. I don't think I realized it fully at the time just how far\n\n23:23.520 --> 23:27.120\n behind I was from the rest of the class because I was like, wow, it seems like people are picking\n\n23:27.120 --> 23:32.800\n this up really quickly. So it took a little longer and you know, a lot of time on Stack Overflow.\n\n23:32.800 --> 23:38.880\n But eventually I made a truly minimal viable product. The most minimal like we're talking,\n\n23:38.880 --> 23:44.560\n you know, put text on screen, add text to screen, comment on top of text, you know,\n\n23:44.560 --> 23:52.000\n make a post, make a response. And anyone with a Yale email can do this. And you plug it into\n\n23:52.720 --> 23:59.600\n a certain cloud server and you verify people's accounts. And you you're off you have to figure\n\n23:59.600 --> 24:05.760\n out how to like the whole idea of like having an account. So there's a permanence like you can\n\n24:05.760 --> 24:12.240\n create an account with an email, verify it, verify it. OK, so that that's not, you know,\n\n24:12.240 --> 24:15.520\n and that's literally how I thought about it. Right. Like, so what do I need to do? And I'm\n\n24:15.520 --> 24:21.120\n like, well, first thing I need is a login page. And I'm like, how to make a login page in Swift.\n\n24:21.920 --> 24:25.520\n I mean, it's that easy. If someone this has been done before, of course. And then the first page\n\n24:25.520 --> 24:30.400\n that pops up is probably a pretty damn good page when it wasn't that bad. It wasn't perfect. But\n\n24:30.400 --> 24:35.920\n like maybe it got me 80 percent of the way there. And then I came into some bugs and then, you know,\n\n24:35.920 --> 24:40.480\n I asked Stack Overflow a few questions and then I got a little further and then I found some more\n\n24:40.480 --> 24:43.680\n bugs. And then I'm like, maybe this isn't the right way to do. Maybe I should do it this way.\n\n24:43.680 --> 24:48.640\n And I'm sure my code isn't great, but the goal isn't to make great code. The goal wasn't to\n\n24:48.640 --> 24:53.760\n make scalable code. It was to understand, is this something my friends will use? Like,\n\n24:53.760 --> 24:58.720\n what is the reaction going to be if I put it in their hands and am I capable of making this thing?\n\n24:58.720 --> 25:04.160\n And that's awesome. And so you're focusing on the experience, like actually just really driving\n\n25:04.160 --> 25:08.560\n towards that first step, figuring out the first step and really driving towards it. Of course,\n\n25:08.560 --> 25:13.680\n you have to also figure out like this concept of like storage, like database.\n\n25:13.680 --> 25:14.640\n You know something funny?\n\n25:14.640 --> 25:15.280\n What's that?\n\n25:15.280 --> 25:19.280\n I just made the database structure with no knowledge of databases whatsoever.\n\n25:19.840 --> 25:23.360\n And I start showing it to my friends who have an experience in CS and they're like,\n\n25:23.360 --> 25:28.320\n you used to heap. That's so interesting. You're like, why did you decide to store it in this way?\n\n25:28.320 --> 25:35.200\n I'm like, bro, I don't even know what a heap is. I just did it because it works. Like I'm trying\n\n25:35.200 --> 25:39.360\n to make calls and stuff. And they're like, yeah, they're like, the hierarchy is really like,\n\n25:39.360 --> 25:40.400\n I'm like, what?\n\n25:40.400 --> 25:44.800\n Well, there's a deep profound lesson in there that I don't know how much you've interacted\n\n25:44.800 --> 25:49.760\n with computer science people since, but they tend to optimize and have these kinds of discussions.\n\n25:49.760 --> 25:55.040\n And what leads, what results is over optimization. It's like worrying, is this really the right way\n\n25:55.040 --> 26:00.080\n to do it? And then you go as opposed to doing the first thing on Stack Overflow, you go down this\n\n26:00.080 --> 26:06.640\n like rabbit hole of what's the actual proper way to do it. And then you're like, you wake up five\n\n26:06.640 --> 26:13.120\n years later working on Amazon because you've never finished the login page. Like it's kind of\n\n26:13.120 --> 26:20.880\n hilarious, but that's a really deep lesson. Like just get it done. And there's like, what's a heap,\n\n26:20.880 --> 26:27.920\n bro? Is the right, that should be a t shirt. That's really the right approach to building something\n\n26:27.920 --> 26:34.720\n that ultimately creates an experience. And then you iterate eventually. That's how the great,\n\n26:34.720 --> 26:39.200\n some of the greatest software products in this world have been built is you create it quickly\n\n26:39.760 --> 26:45.360\n and then just iterate. What was, by the way, in your mind, the thing that you were chasing as a\n\n26:45.360 --> 26:52.960\n prototype? Like what, what was the first step that it feels like something is working? Like did you\n\n26:52.960 --> 27:00.240\n see you interacting with another friend? Yeah. I think the first step was like, it's one thing to\n\n27:00.240 --> 27:04.720\n tell someone about an idea, but it's another thing to put in their hands and kind of see like the way\n\n27:04.720 --> 27:11.760\n their, their eyes kind of look. And when I'd go, I'd walk around cross campus, which is part of\n\n27:11.760 --> 27:15.520\n Yale, and I'd literally just go up to people and run up to them and be like, try this, try this,\n\n27:15.520 --> 27:19.360\n you got to try this. This is pre quarantine, by the way, of course, this would never be the same\n\n27:19.360 --> 27:22.560\n post quarantine, but like, you got to try this, you got to try this. Like, what is it? And I'd be\n\n27:22.560 --> 27:27.520\n like, and I explain it's like an anonymous discussion feed for our Yale campus. And you see\n\n27:27.520 --> 27:32.560\n their gears turning and they just, some people would be like, not interested. I'm like, fine,\n\n27:32.560 --> 27:38.160\n not your target demographic. I get it. You'll come eventually. But some people like you could see it,\n\n27:38.160 --> 27:45.280\n they got it. They're like, yes. And that's when I was like, okay, okay, there is, and you don't need,\n\n27:46.080 --> 27:53.280\n I mean, you don't need 50% of people to like it. You need what, 5%, 10% to love it. And then\n\n27:53.280 --> 28:00.240\n they'll tell 5%, 10%. Yeah, word of mouth. And you're good. Of course, the first version was\n\n28:00.240 --> 28:05.520\n very, very crappy, but seeing people trying despite all the crappiness wasn't, it was sort of enough\n\n28:05.520 --> 28:12.560\n to be the first step. And since then, all of my code has been stripped out. I now have friends\n\n28:12.560 --> 28:17.280\n who basically have told me, don't bother with the coding part. You do the rest. You just make sure\n\n28:17.280 --> 28:22.000\n that we can code because they want to code. Great. I mean, I'm not an engineer. I never intended to\n\n28:22.000 --> 28:27.280\n be an engineer. And there's a lot to do that's not engineering. But the point was just to validate\n\n28:27.280 --> 28:33.760\n the idea, so to speak. When was the moment that you felt like we've created something special?\n\n28:33.760 --> 28:43.120\n Maybe a moment where you're proud of that this is, this has the potential to actually be the very\n\n28:44.320 --> 28:51.120\n implementation of the idea that I initially had. There's so many little moments. It's like,\n\n28:51.120 --> 28:58.080\n and I bet there'll still be moments in the future that make it hard to like totally say, like. Yeah,\n\n28:58.080 --> 29:04.800\n we should say this is, this is still very early days of Librex. It's only been a year since we've\n\n29:04.800 --> 29:09.520\n had like actual, like a lot of people on the app. Yeah. About a year. Oh wow. Okay. I mean,\n\n29:09.520 --> 29:14.000\n there's some crazy moments I could talk about sort of going to Dartmouth because it's one thing to\n\n29:14.000 --> 29:20.320\n like get some traction at your school. People know you and you know, it's your school, you know,\n\n29:20.320 --> 29:25.360\n it's another thing to go to another school and where no one knows you and sign up 90% of the\n\n29:25.360 --> 29:31.440\n campus overnight. Wow. So tell me that story. You're invading another territory. It was literally\n\n29:31.440 --> 29:37.840\n like that. Did you buy it like a Dartmouth sweatshirt? Purposefully, I didn't want to fraud\n\n29:37.840 --> 29:43.520\n anyone, but I was purposefully nondescript in my clothing. Yeah. No Yale stuff, no Dartmouth stuff.\n\n29:43.520 --> 29:54.080\n Just blended. I'll go back there. So what happened was this was like March of last year. So almost,\n\n29:54.080 --> 30:00.880\n almost a year ago today. And I really wanted to see if we could go from sort of one campus to two\n\n30:00.880 --> 30:10.160\n campuses. So I didn't know anyone at Dartmouth's campus, but I kind of, I had some cold emails,\n\n30:10.160 --> 30:16.320\n some warmish emails. And I went to people and I was like, basically, can I sleep on your floor for\n\n30:16.320 --> 30:21.120\n two days during finals period? I had a lot of people who said, this is crazy. Like no one's\n\n30:21.120 --> 30:24.960\n going to, no one wants to download an app during finals period, a social app during finals period.\n\n30:26.160 --> 30:31.040\n But I emailed a few people. I was like, you know, can I sleep on your floor? And one of them\n\n30:31.040 --> 30:37.760\n was crazy enough to say, sure, come to my, come to my dorm. I have a nice floor. And he ended up,\n\n30:37.760 --> 30:42.800\n today, he's still really close. He's a really close friend. But anyway, I take a train,\n\n30:42.800 --> 30:50.160\n knowing nothing about this guy besides his first and last name. And I arrive and Dartmouth is\n\n30:50.160 --> 30:56.560\n really, really remote, way more remote than you think to the point where I'm like, he's like,\n\n30:56.560 --> 31:00.480\n he warned me. He's a really hospitable guy. He warned me like, it's going to be hard to get to\n\n31:00.480 --> 31:04.400\n campus from the train station because it's really remote. And I'm like, I'm sure it's fine. I'll\n\n31:04.400 --> 31:09.680\n just get an Uber. There are no Ubers in Hanover. What do you think this is?\n\n31:09.680 --> 31:14.800\n This is New Hampshire. So, Connecticut, I mean, Yale is pretty remote as well, no?\n\n31:14.800 --> 31:21.920\n Yeah. Yale is, well, I mean, Yale is in New Haven, which is a real city. It has Ubers. It has food.\n\n31:21.920 --> 31:26.800\n It has culture. It has a nightclub even. Like, we're talking about a real city. Like, it's not\n\n31:26.800 --> 31:32.880\n New York. It's not Philadelphia, where I'm from, but it's a city. New Hampshire is something very\n\n31:32.880 --> 31:37.840\n different. Yeah. Beautiful campus, I'm sure. Beautiful. Oh, my gosh. I could talk so much\n\n31:37.840 --> 31:42.880\n about, I was blown away by Dartmouth. I started wondering like why I didn't apply.\n\n31:42.880 --> 31:49.680\n Legitimately, between the people and the culture, it was a beautiful vacation. So,\n\n31:49.680 --> 31:54.960\n I arrived there, no Uber, but eventually I call this guy who's like the only guy who can get you\n\n31:54.960 --> 32:00.160\n to Dartmouth and it takes a couple hours, but we get there. I sleep on this guy's floor. I wake up.\n\n32:00.160 --> 32:03.760\n I ask him if there's any printing. He's like, oh, Dartmouth happens to have free printing in\n\n32:03.760 --> 32:10.640\n the copy room. I print out like 2000 posters until the guy in the copy room literally goes to me,\n\n32:10.640 --> 32:14.320\n he's like, kid, I don't know what you're doing, but you need to get out of here. I'm like,\n\n32:15.200 --> 32:20.480\n I'm going, I'm going. I found the limits. Yeah, I found the limit. I think a lot of startups\n\n32:20.480 --> 32:26.400\n about finding the limits. That's a little piece of advice. Socially, he's like, you got to get\n\n32:26.400 --> 32:34.000\n out of here. I then go to every single dorm door. I put a poster under every single dorm door,\n\n32:34.000 --> 32:40.080\n advertising the app with a QR code. I walk around campus saying hi to everyone\n\n32:40.080 --> 32:44.320\n and telling them about the app. I go from table to table in the cafeteria, introduce myself,\n\n32:44.320 --> 32:48.960\n say hi and tell them to download the app. It's an exhausting day. So many steps,\n\n32:48.960 --> 32:53.200\n so many crotching down to slip the poster under the dorm door. My legs were burning.\n\n32:54.640 --> 33:02.320\n But by the end of it, 24 hours later, I'm sitting in a bus and I'm just pressing the refresh button\n\n33:02.320 --> 33:07.600\n on the account creation panels. It's like going up by hundreds. And I'm like, oh my gosh.\n\n33:07.600 --> 33:14.400\n The word of mouth is working in a sense. I mean, certainly your initial seed is powerful.\n\n33:14.400 --> 33:15.360\n Just a piece.\n\n33:15.360 --> 33:20.320\n Yeah, but then the word of mouth is what carries it forward. And what was the explanation you gave\n\n33:20.320 --> 33:26.320\n to the app? Is anonymity a fundamental part of it? Like saying, this is a chance\n\n33:27.280 --> 33:30.960\n for you to speak your mind about your experiences on campus.\n\n33:32.160 --> 33:37.360\n Yeah, I think people get it. What I've realized is you don't need to tell people\n\n33:37.360 --> 33:39.200\n why to try it. They know.\n\n33:40.880 --> 33:42.080\n There's a hunger for this.\n\n33:42.080 --> 33:48.720\n Exactly. So all I do is I'm very factual. I said, and this is where I kind of ended up coining the\n\n33:50.480 --> 33:55.040\n line that I now used to say it because I said it so many times in those 24 hours.\n\n33:55.040 --> 33:59.760\n I just said, it's an anonymous discussion feed for Dartmouth. And they're like, yes.\n\n34:02.480 --> 34:06.320\n Like they've been waiting for it. Some people are more skeptical, but a lot of people were like,\n\n34:06.320 --> 34:11.520\n great, I'm excited to try this. I'm excited to meet people and connect. And I mean,\n\n34:11.520 --> 34:17.040\n the way Dartmouth is taken to is incredible. Everything from professors writing poems during\n\n34:17.040 --> 34:22.160\n finals period to be like, good luck in finals period. You're going to rise like a Phoenix\n\n34:22.160 --> 34:29.040\n or whatever to like, yeah, it's crazy. To I heard about two women meeting on Librex and\n\n34:29.040 --> 34:37.280\n starting a finance club at Dartmouth to significant others meeting. There was an article recently\n\n34:37.280 --> 34:41.840\n written up at Yale as well about two queer women who met on Librex and started a relationship,\n\n34:41.840 --> 34:47.600\n which was pretty, it was pretty interesting to see people throwing parties pre COVID. Yeah.\n\n34:47.600 --> 34:51.440\n It was just amazing to see how, when you allow people to be vulnerable and social,\n\n34:51.440 --> 34:54.960\n they connect. People have this natural desire to connect.\n\n34:54.960 --> 35:00.480\n Yeah. When, when you have, would have a natural desire to have a voice. And then when that voice\n\n35:01.520 --> 35:08.560\n is, is paired with freedom, that you could truly express yourself and there's something\n\n35:08.560 --> 35:14.240\n liberating about that. And in that sense, you're like, you're connecting as your true self,\n\n35:14.240 --> 35:19.040\n whatever that is. What are the most powerful conversation you've seen on the app? You mentioned\n\n35:19.040 --> 35:23.680\n like people connecting. The hard part of that, that is the sorting, you know, figuring out which\n\n35:23.680 --> 35:27.360\n one, which one am I going to put at the top? Mental sorting out. Just something that stands\n\n35:27.360 --> 35:31.600\n out to you. Sorry. I don't mean to do like the top 10 conversations ever of all time,\n\n35:31.600 --> 35:35.280\n ever on the app. I just mean like stuff that you remember that stands out to you.\n\n35:35.280 --> 35:43.040\n I remember this one really amazing comment from this. He was a Mexican international student\n\n35:43.760 --> 35:51.440\n who spoke out and this, this, this post was super edgy, but yet it got hundreds and hundreds of\n\n35:51.440 --> 35:55.040\n upvotes within the Yale community. It was a Yale community specific post. And we should point out\n\n35:55.040 --> 36:00.800\n that there's a school specific community now and there's an all Ivy community. So this was\n\n36:00.800 --> 36:05.840\n specifically in the Yale community. And this was a little while ago, but it stuck with me. This\n\n36:06.560 --> 36:13.040\n Mexican international student comes to Yale and he starts talking about his experience\n\n36:13.040 --> 36:19.120\n in the La Casa, which is the Mexican Latina X as they would say, cultural center at Yale,\n\n36:19.120 --> 36:26.720\n and how he doesn't feel welcome there because he's Roman Catholic basically and international\n\n36:26.720 --> 36:31.680\n and how he doesn't feel like he fits with their agenda. And as a result, this place that's\n\n36:31.680 --> 36:36.240\n supposed to be home for him, he feels outcasted and feels more alone than he does anywhere else\n\n36:36.240 --> 36:42.400\n on campus. That's powerful. That was powerful to me. Yeah. It's hearing someone, someone who should\n\n36:42.400 --> 36:50.240\n be feeling supported by this culture say, actually, this is not doing anything for me. Like this is\n\n36:50.240 --> 36:58.160\n not helping me. This is not where I feel at home. So what do you make of anonymity?\n\n36:59.520 --> 37:06.640\n Because it seems to be a fundamental aspect of the power of the app, right? But at the same time,\n\n37:06.640 --> 37:13.200\n anonymity on the internet, so it protects us, right? It gives us freedom to have a voice,\n\n37:14.000 --> 37:20.080\n but it can also bring out the dark sides of human nature, like trolls or people who want\n\n37:20.080 --> 37:27.680\n to be malicious, want to hurt others purely for the joy of hurting others, being cruel for fun\n\n37:28.320 --> 37:33.600\n and going to the dark places. So like, what do you make of anonymity as a fundamental feature\n\n37:33.600 --> 37:38.960\n of social interaction, like the pros and the cons? Yeah. Just to break that down a bit,\n\n37:38.960 --> 37:42.480\n I would say a lot of those same things about a place like Twitter where people are very\n\n37:42.480 --> 37:49.280\n unanonymous. Having said that, of course, there's a different sort of capacity people have when\n\n37:49.280 --> 37:55.440\n they're anonymous, right? In all different sorts of ways. So what do I make of anonymity? I think\n\n37:55.440 --> 37:59.440\n it can be incredibly liberating and allow people to be incredibly vulnerable and to connect in\n\n37:59.440 --> 38:04.240\n different ways, both on politics, and there was a lot to talk about this year regarding politics,\n\n38:04.880 --> 38:09.680\n and personally being vulnerable, talking about relationships and mental health.\n\n38:10.960 --> 38:13.760\n I think it allows people to have a community that's not performative.\n\n38:14.800 --> 38:21.440\n And of course, there's this other side where people can sometimes break rules or say things\n\n38:21.440 --> 38:25.200\n that they wouldn't otherwise say that people don't always agree with or that people might\n\n38:25.200 --> 38:31.600\n find repugnant. And to an extent, these can facilitate great conversations. And on the other\n\n38:31.600 --> 38:36.000\n hand, we have to have moderation in place, and we have to have community guidelines to make sure\n\n38:36.000 --> 38:42.480\n that the anonymity doesn't overwhelm the purpose, which is that anonymity, first of all, anonymity\n\n38:42.480 --> 38:48.560\n is a tool in Librex. It was not the purpose of Librex. It is a way that we get towards these\n\n38:48.560 --> 38:55.600\n authentic conversations given our campus climate. And second of all, I would say it's a spectrum.\n\n38:57.840 --> 39:05.680\n It's not just Librex is anonymous because Librex isn't totally anonymous. Everyone's a verified\n\n39:05.680 --> 39:11.200\n Ivy League student. You know exactly what school everyone goes to. You only have one account per\n\n39:11.200 --> 39:19.680\n person at Yale. I mean, what that amounts to is people have more of an ownership in the community\n\n39:19.680 --> 39:22.160\n and people know that they're connected and they have a common vernacular.\n\n39:23.040 --> 39:27.840\n So the anonymity is a scale and it's a tool. But you can also trust, I mean, this is the\n\n39:27.840 --> 39:32.560\n difference between Reddit anonymity, where you can easily create multiple accounts.\n\n39:33.920 --> 39:39.840\n When you have only one account per person, or at least it's very difficult to create multiple\n\n39:39.840 --> 39:45.600\n accounts, then you can trust that the anonymous person you're talking to is a human being.\n\n39:45.600 --> 39:46.640\n Not a bot.\n\n39:46.640 --> 39:53.840\n I try to be completely unanonymous now in my all public interactions. I try to be as real in every\n\n39:53.840 --> 39:58.160\n way possible, like zero gap between private me and public me.\n\n39:59.200 --> 40:04.400\n Why exactly did you, it seems like this is an intentional mission. What made you want to sort\n\n40:04.400 --> 40:09.760\n of bridge that gap between the private sphere and public sphere? Because that's unique. I know a\n\n40:09.760 --> 40:12.400\n lot of intellectuals who would make a different decision.\n\n40:13.040 --> 40:18.800\n Yeah, interesting. I had a discussion with Naval about this, actually, with a few others that\n\n40:20.080 --> 40:22.880\n have a very clear distinction between public and private.\n\n40:24.160 --> 40:27.840\n Something I'm struggling with, by the way, personally, and thinking about.\n\n40:27.840 --> 40:40.960\n So one on the very basic surface level is if you carry with yourself lies, small lies or big lies,\n\n40:41.840 --> 40:51.120\n it's extra mental effort to remember what you're supposed to say and not supposed to say.\n\n40:51.920 --> 40:57.680\n So that's on a very surface level of like, it's just easier to live life when you have\n\n40:57.680 --> 41:00.480\n the smaller the gap between the private you and the public you.\n\n41:01.760 --> 41:08.240\n And the second is, I think for me, from an engineering perspective,\n\n41:09.200 --> 41:15.920\n like if I'm dishonest with others, I will too quickly become dishonest with myself.\n\n41:16.880 --> 41:22.080\n And in so doing, I will not truly be able to think deeply about the world and come up\n\n41:22.080 --> 41:26.560\n and build revolutionary ideas. There's something about honesty that feels like\n\n41:26.560 --> 41:31.760\n it's that first principles thinking that's almost like overused as a term, but it feels like that\n\n41:31.760 --> 41:38.160\n requires radical honesty, not radical asshole and lishness, but radical honesty with yourself,\n\n41:38.160 --> 41:44.960\n with yourself. And it feels like it's difficult to be radically honest with yourself when you're\n\n41:44.960 --> 41:52.240\n being dishonest with the public. And also I have a nice feature, honestly, that in this current\n\n41:52.240 --> 41:59.440\n social context, so we can talk about race and gender and what are the other topics that are\n\n41:59.440 --> 42:00.240\n touchy?\n\n41:52.240 --> 42:03.040\n Ethnicity and nationality.\n\n42:03.040 --> 42:04.640\n All those things. I mean, like.\n\n42:04.640 --> 42:05.840\n Family structure.\n\n42:05.840 --> 42:11.840\n Maybe I'm ineloquent in the way I speak about them, but I honestly, when I look in the mirror,\n\n42:12.480 --> 42:19.440\n like I'm not deeply hateful of a particular race or even just hateful particular race.\n\n42:19.440 --> 42:36.720\n I'm sure I'm biased and I've tried to like think about those biases and so on. And also, I don't have any\n\n42:36.720 --> 42:43.680\n creepy shit in my closet. It seems like a lot of people did a lot of creepy stuff in their life.\n\n42:43.680 --> 43:12.800\n I've gotten a bit of a platform. And I think it all started when I went to this female comedian, Whitney\n\n43:12.800 --> 43:42.720\n Brown, and I was like, you know, I really value love, long term monogamy with like one person. And it's like, I\n\n43:42.720 --> 44:06.240\n really value liberating as a human being. Forget public, all that. Because then I feel like I'm on sturdy ground when I say\n\n44:06.240 --> 44:12.240\n difficult things. And at the same time, sorry, I'm ranting on this. I apologize.\n\n44:12.240 --> 44:23.920\n Like I won't be able to fake it. Like they'll see it through. Yeah. So I feel like if you're not\n\n44:23.920 --> 44:30.800\n lying about stuff, you have the freedom to truly be yourself. And the internet will figure it out.\n\n44:30.800 --> 44:35.680\n Like we'll figure who you are. People have a natural tendency to be able to tell bullshit.\n\n44:35.680 --> 44:43.760\n It makes sense from an evolutionary standpoint, right? Exactly. Like why? Why wouldn't, why, like, of all the things that we could evolve to be good at,\n\n44:45.600 --> 44:49.520\n being able to detect honesty seems like one that would be particularly valuable,\n\n44:49.520 --> 44:54.160\n especially in the sorts of societies we developed into. And then also from a selfish perspective,\n\n44:54.160 --> 45:01.360\n like a success perspective, I think there's a lot of folks that have inspired me, like Elon is one of them,\n\n45:01.360 --> 45:09.920\n that shows that there's a hunger for genuineness. Like you can build a business as a CEO and be\n\n45:09.920 --> 45:15.040\n genuine and like real and do stupid shit every once in a while, as long as it's coming from the\n\n45:15.040 --> 45:19.680\n same place of who you truly are. Like Elon is inspirational with that. And then there's a lot of\n\n45:19.680 --> 45:28.080\n other people I admire that are counter inspirations in the sense like they're very formal. They hold\n\n45:28.080 --> 45:33.920\n back a lot of themselves. And it's like, I know how brilliant those people are. And I think they're\n\n45:33.920 --> 45:41.120\n not being as effective of leaders, public faces of companies as they could be. I mean, to be honest,\n\n45:41.120 --> 45:49.520\n like not to throw shade, but I will, it's like Mark Zuckerberg is an example of that. Jack Dorsey is\n\n45:49.520 --> 45:54.000\n also a bit of an example of that. I like Jack a lot. I've talked to him a lot. I will talk to him\n\n45:54.000 --> 46:03.360\n more. I think he's a much more amazing person than he conveys through his public presentation. I think\n\n46:03.360 --> 46:08.400\n a lot of that has to do with PR and marketing people having an effect. This is difficult. I think\n\n46:08.400 --> 46:13.200\n it's really difficult. It's probably many of the same difficulties you will face as the pressures.\n\n46:14.800 --> 46:20.320\n But it's hard to know what to do. But I think as much as possible as an individual, you should try\n\n46:20.320 --> 46:28.800\n to be honest in the face of the world and the company that wants you to be more polished. And\n\n46:28.800 --> 46:33.760\n that being more polished turns you into a politician and politician eventually turns into\n\n46:33.760 --> 46:37.760\n being dishonest. Dishonest with the world and dishonest with yourself.\n\n46:37.760 --> 46:43.360\n Something I noticed, which was of the people you mentioned, those things have had ramifications\n\n46:43.360 --> 46:51.760\n in terms of letting things go too far or get out of hand. And you wonder, it's an aspect of lying,\n\n46:51.760 --> 46:57.920\n right? You say one lie goes to another lie. You push it down. It doesn't matter. You can figure\n\n46:57.920 --> 47:04.000\n it out later. You can figure it out later. Pretty soon, you've dug a pretty big hole. And I think\n\n47:04.000 --> 47:09.440\n if we look at Twitter and we look at Facebook, I think it goes without saying what sorts of holes\n\n47:09.440 --> 47:14.400\n have been dug because of, perhaps because of a lack of honesty that goes all the way up to the\n\n47:14.400 --> 47:20.640\n leaders. So yeah, there's two problems within the company. It doesn't make you as effective of a\n\n47:20.640 --> 47:28.480\n leader, I think. That's one. And two, for social media companies, I think people need to trust,\n\n47:28.480 --> 47:34.000\n like it doesn't have to be the CEO, but it has to be like, this is how humans work. We want to look\n\n47:34.000 --> 47:43.040\n to somebody we're like, I trust you. If you're going to use a social media platform, I think you\n\n47:43.040 --> 47:49.760\n have to trust the set of individuals working at the top of that social. Something I realized\n\n47:49.760 --> 47:55.920\n really quickly, one of the lessons throughout the startup was that people don't totally connect to\n\n47:55.920 --> 48:03.600\n products as much as they connect to people. And I mean, I don't know how much you've spent on\n\n48:03.600 --> 48:11.520\n Librex. You've only been here the last week, but I mean, I love the product. And one of the aspects\n\n48:11.520 --> 48:15.840\n of me loving the product is that I was super active and I've been super active throughout the\n\n48:15.840 --> 48:22.000\n entire time. And the amount of support I've received has made that very easy to do from\n\n48:22.000 --> 48:26.480\n the community and the fact that I could, I mean, so I came to Boston for this interview, right?\n\n48:26.480 --> 48:34.560\n Yeah. I came to Boston. I got off the train. It was around 5.30 PM. I checked Librex. Someone\n\n48:34.560 --> 48:38.800\n is writing, hey, I'm in Boston. Does anyone want to get dinner? 30 minutes later, I'm getting\n\n48:38.800 --> 48:45.440\n dinner with them. That's amazing. And I mean, it's incredible. First of all, as an entrepreneur,\n\n48:46.160 --> 48:52.080\n the amount of stuff I learn from these people and when they reiterate and I hear that they got the\n\n48:52.080 --> 48:57.120\n message through the product. I mean, that's incredibly validating, but also, I mean, I think\n\n48:57.120 --> 49:01.840\n it's just important to be able to put a face to a brand and especially a brand that's built on trust\n\n49:02.960 --> 49:09.440\n because fundamentally the users are trusting us with some really important discussions and some\n\n49:09.440 --> 49:13.840\n really, and a movement to some degree. It's a community and a movement.\n\n49:13.840 --> 49:20.960\n I'll tell you actually why I didn't use the app very much so far is there's something really\n\n49:20.960 --> 49:26.080\n powerful about the way it's constructed, which I felt like a bit of an outsider, because I don't\n\n49:26.080 --> 49:32.720\n know the communities. It felt like it's a really strong community around each of these places.\n\n49:34.000 --> 49:39.920\n And so I felt like I was, it made me really wish there was an MIT one. And so there's\n\n49:39.920 --> 49:45.680\n both discussions about the deep community issues within Columbia or Yale or so on,\n\n49:45.680 --> 49:52.240\n and Dartmouth, and there's also the broader community of the Ivy Leagues that people are\n\n49:52.240 --> 49:57.200\n discussing. But I could see that actually expanding more and more and more, but which is,\n\n49:57.200 --> 50:02.640\n it's a powerful coupling, which is the feeling of like this little village, this little community\n\n50:02.640 --> 50:08.480\n we're building together, but also the broader issues. So you could do both discussions.\n\n50:08.480 --> 50:16.560\n One thing that was important to me is talking about social media as a concept. I think the way\n\n50:16.560 --> 50:23.360\n people socialize is very much context dependent. So we're talking about people understanding each\n\n50:23.360 --> 50:31.440\n other through language, through English. And these languages are constructed in a very nuanced way,\n\n50:31.440 --> 50:38.960\n in a very sort of temperamental way, right? And you kind of need a similar context to be able to\n\n50:38.960 --> 50:45.520\n have productive conversations. So to me, it's really important that these groups, they share\n\n50:45.520 --> 50:51.840\n something in common, a really big lived experience, the Ivy League, or their school community. And\n\n50:51.840 --> 50:55.200\n they have a similar vocabulary, they have a similar background, they know what's happening\n\n50:55.200 --> 51:00.480\n in their community. And so having social media that is community connected to me was fundamental.\n\n51:00.480 --> 51:06.240\n Like, you talk about anonymity. To me, community is the thing that when I think about Librex,\n\n51:06.240 --> 51:12.880\n I think what makes it different. It's the fact that everyone knows what's going on. Everyone\n\n51:12.880 --> 51:18.000\n comes from a similar context and people can socialize in a way where they understand each\n\n51:18.000 --> 51:22.080\n other because they've been through, you used the word lived experience, they've been through so\n\n51:22.080 --> 51:23.920\n many of the same lived experiences.\n\n51:23.920 --> 51:32.640\n One clarification, is there an easy way, if you choose, to then connect in meat space,\n\n51:32.640 --> 51:33.680\n in physical space?\n\n51:34.480 --> 51:41.280\n So the, I guess the sort of magic of it, and I was talking to a bunch of Harvard Librexers who I\n\n51:41.280 --> 51:46.320\n met off the app while I was in Boston. And every time they told me this is my favorite part of the\n\n51:46.320 --> 51:50.640\n app, this is what I love about the app. We have this matching system, which is an anonymous direct\n\n51:50.640 --> 51:59.120\n message that you can send to any poster. So, like, I was talking to this guy who, he was really\n\n51:59.120 --> 52:04.480\n into coin collection. And he met other people who are really into coin collection through a post\n\n52:04.480 --> 52:09.200\n and what they he would make a post about coin collection. And then someone would come to him\n\n52:09.200 --> 52:13.760\n and they'd be like, and they could direct message him anonymously. And it would just show them that\n\n52:13.760 --> 52:18.960\n his it would just show him their school. And then they could just text chat, totally anonymously,\n\n52:18.960 --> 52:22.000\n direct message if he accepted the anonymous request.\n\n52:22.000 --> 52:23.760\n Do they see the usernames, right?\n\n52:23.760 --> 52:30.400\n There are no usernames on Librex. It's all just school's names. So he made this post about coin\n\n52:30.400 --> 52:34.000\n collection. And he got a direct message.\n\n52:34.000 --> 52:35.360\n Yeah, I guess so, right?\n\n52:35.360 --> 52:38.240\n No usernames.\n\n52:38.240 --> 52:39.760\n I was just looking at the text.\n\n52:39.760 --> 52:40.560\n Yeah.\n\n52:40.560 --> 52:42.400\n That's interesting. That's right.\n\n52:42.400 --> 52:44.320\n And I can tell you, I can go into why.\n\n52:44.320 --> 52:46.320\n That's really interesting.\n\n52:46.320 --> 52:47.360\n Yeah, I can go into it.\n\n52:47.360 --> 52:49.360\n So it truly is anonymous.\n\n52:49.360 --> 52:52.400\n Well, I mean, it depends on what you mean by anonymous.\n\n52:52.400 --> 52:55.600\n Exactly. It's a very different kind of anonymous.\n\n52:56.160 --> 53:01.760\n And the reason that we made that decision is because we wanted people to connect to ideas.\n\n53:02.320 --> 53:05.520\n We want people to connect to things in the moment. We don't want people to go,\n\n53:06.160 --> 53:10.880\n oh, I know this guy. He said this other thing. And we didn't want people to feel like they were at\n\n53:10.880 --> 53:15.680\n risk of being doxxed. So it's just these are small communities, right? We talked about this. Everyone\n\n53:15.680 --> 53:23.200\n knows someone who knows you. And in 2021, it would not take much to be able to figure out who someone\n\n53:23.200 --> 53:29.440\n might be just through a couple of posts. So it's both safety and about the ideas in terms of not\n\n53:29.440 --> 53:34.480\n adding usernames. Anyway, we have this anonymous direct message system where you can direct\n\n53:34.480 --> 53:41.920\n message the original poster of any post, the OP, if you're a Redditor, of any post. And that makes\n\n53:41.920 --> 53:46.720\n it really easy to meet up because once you guys are one on one, you can exchange a number. You\n\n53:46.720 --> 53:53.440\n can exchange a Snapchat. You can exchange an email. Probably not very often, but you could.\n\n53:53.440 --> 53:56.000\n And then that's how people meet up. Matching.\n\n53:56.560 --> 54:01.920\n And then a lot of people connect in this way. Let me just take a small step into the technical.\n\n54:01.920 --> 54:06.720\n I read somewhere, I don't know if it's true, that one of the reasons you were rejected from YC,\n\n54:06.720 --> 54:14.160\n Y Combinator, in the final rounds is because one of the principles is to refuse to sell user data.\n\n54:15.200 --> 54:21.680\n Can you speak to that? Why do you think it's important not to sell user data?\n\n54:24.560 --> 54:30.400\n Which draws a clear contrast between other, basically any other service on the internet.\n\n54:30.400 --> 54:37.360\n I mean, to be honest, it's quite simple. I mean, we talk about this platform. People are talking\n\n54:37.360 --> 54:44.800\n about their most intimate secrets, their political opinions. How are they feeling about what's going\n\n54:44.800 --> 54:54.080\n on in their city during the summer? How are they feeling about the political cycle and also their\n\n54:54.080 --> 55:00.000\n mental health, their relationships? These are some of the most intimate thoughts that people\n\n55:00.000 --> 55:06.480\n were having. Point blank, I don't think it was ethical to pawn them off for a profit.\n\n55:07.440 --> 55:11.840\n I didn't think it was moral. I don't think I could sleep at night if that was what I was doing,\n\n55:11.840 --> 55:19.360\n is turning these people's most intimate beliefs and secrets into a currency that I bought and sold.\n\n55:20.320 --> 55:22.480\n There's something very off about that.\n\n55:22.480 --> 55:30.000\n Yeah, I tend to believe that there is some room, so like Facebook would just take that data and\n\n55:30.000 --> 55:35.440\n sell it, right? But there's some room in transparency and giving people the choice\n\n55:35.440 --> 55:42.080\n on which parts they can, I wouldn't even see it as sell, but like share with advertisers.\n\n55:42.080 --> 55:43.280\n Are you going to give them a profit?\n\n55:44.080 --> 55:47.920\n So right, you have to monetize, you have to create an entire system, you have to rethink\n\n55:47.920 --> 55:54.960\n this whole thing, right? But as long as you give people control and are transparent and make it\n\n55:54.960 --> 55:59.520\n easy, like I think it's really difficult to delete a Facebook account or like delete all your data.\n\n55:59.520 --> 56:01.520\n I've tried, it's very difficult.\n\n56:03.280 --> 56:07.760\n So like just make it easy and trust in that if you create a great product,\n\n56:07.760 --> 56:11.840\n people are not going to do it. And if they do it, then they're not actually\n\n56:12.560 --> 56:14.800\n a deep loving member of the community. What's that?\n\n56:14.800 --> 56:23.440\n So we very quickly realized that user privacy was something that was not only a core value,\n\n56:23.440 --> 56:28.720\n but was something that users really cared about. And we added this functionality. It's just a\n\n56:28.720 --> 56:35.440\n button that says, forget me. You press it, like two clicks. It's not that hard. We just\n\n56:35.440 --> 56:40.480\n remove your email from the database. You're good.\n\n56:40.480 --> 56:47.920\n Beautiful. I think Facebook should have that. I honestly, so call me crazy, but maybe you can\n\n56:47.920 --> 56:53.200\n actually speak to this, but I don't think Facebook, well now they would, but if they\n\n56:53.200 --> 56:59.680\n did it earlier, they would lose that much money. If they allow like transparently tell people,\n\n56:59.680 --> 57:05.760\n you could just delete everything. They also explained that like in ways that's going to\n\n57:05.760 --> 57:12.400\n potentially like lessen your experience in the short term, like explain that. But then there\n\n57:12.400 --> 57:20.640\n shouldn't be like multiple clicks of a button that don't make any sense. I'm trying to hold\n\n57:20.640 --> 57:25.200\n back from ranting about Instagram because let me just say real quick, because I've been locked\n\n57:25.200 --> 57:31.760\n out of Instagram for a month. And there's a whole group inside Facebook that are like supporters of\n\n57:31.760 --> 57:39.600\n like Lex, help Lex. Free Lex? Free Lex. I wasn't blocked. It was just like a bug in the system.\n\n57:39.600 --> 57:44.960\n Somebody was hammering the API with my account. And so they kept thinking I'm a bot. Anyway,\n\n57:44.960 --> 57:49.280\n it's a bug. It happens to a lot of people, but like, first of all, I appreciate the love from\n\n57:49.280 --> 57:54.720\n all the amazing engineers in Instagram and Facebook. All of those folks, the entire mechanism\n\n57:54.720 --> 58:00.560\n though is somehow broken. I mean, I put that on the leadership, but it's also difficult to operate\n\n58:00.560 --> 58:06.080\n a large company once it scales, all those kinds of things, but it should not be that difficult\n\n58:06.080 --> 58:14.960\n to do some basic, basic things that you want to do, which is in the case of Facebook,\n\n58:15.520 --> 58:22.320\n that's verify your identity to the app. And also in the case of Facebook, in the case of Librex,\n\n58:22.320 --> 58:31.360\n like disappear if you choose. There's downsides to disappearing, but it should not be a difficult\n\n58:31.360 --> 58:40.320\n process. And yeah, I think people are waking up to that. I think there's a lot of room for an app\n\n58:40.320 --> 58:47.520\n like Librex with its foundational ideas to redefine what social media should look like.\n\n58:47.520 --> 58:53.920\n You know, and like you said, I think beautifully, anonymity is not the core value. It's just a tool\n\n58:53.920 --> 59:00.800\n you use. And who knows, maybe anonymity will not always be the tool you use. Like if you give\n\n59:00.800 --> 59:06.080\n people the choice, who knows what this evolves from the login page you initially created.\n\n59:06.080 --> 59:10.640\n The key thing is the founding principles. And again, who knows if you give people a really\n\n59:10.640 --> 59:15.920\n nice way to monetize their data, maybe there'll no longer be a thing that you say, do not sell\n\n59:15.920 --> 59:22.240\n user data. Yeah, all those kinds of things. But the basic principles should be there. And also\n\n59:22.240 --> 59:30.640\n a good, simple interface design goes a really long way. Like simplicity and elegance, which\n\n59:30.640 --> 59:32.560\n Librex currently is. Clubhouse is another app.\n\n59:32.560 --> 59:39.040\n It's gotten a lot better, by the way. I don't mean to go too deep into the history, but the...\n\n59:39.040 --> 59:41.680\n It was bad? I didn't look at the early pictures.\n\n59:41.680 --> 59:43.280\n Oh, thank goodness.\n\n59:43.280 --> 59:47.840\n I read somewhere that it was like a white screen, like with black.\n\n59:47.840 --> 59:57.760\n The up and down buttons were like these big freaking boxes. And I could go on, but it was\n\n59:57.760 --> 1:00:05.760\n my genius design skills. I almost failed art class when I was in first grade. And I think\n\n1:00:05.760 --> 1:00:10.640\n I still have similar skills to my first grade self, but it's gotten a lot better. And thanks\n\n1:00:10.640 --> 1:00:14.240\n to a lot of my friends who have sort of chipped in here and there.\n\n1:00:14.240 --> 1:00:20.720\n Oh, I love the idea of a button that just forget me. I don't know. That's really moving,\n\n1:00:20.720 --> 1:00:28.160\n actually. That's actually all people want, is they want, I think... Okay, I'll speak\n\n1:00:28.160 --> 1:00:34.800\n to my experience. I would give so much more if I could just disappear if I needed to.\n\n1:00:34.800 --> 1:00:42.240\n And I trusted the community. I trusted the founders and the principals. That's really\n\n1:00:42.240 --> 1:00:51.360\n powerful, man. The trust and ease of escape. Yeah. You've also kind of mentioned moderation,\n\n1:00:51.360 --> 1:00:58.000\n which is really interesting. So with this anonymity and this community, I don't know\n\n1:00:58.000 --> 1:01:01.200\n if you've heard of the internet, but there's trolls on the internet.\n\n1:01:01.200 --> 1:01:01.760\n So I've heard.\n\n1:01:01.760 --> 1:01:09.360\n And even if they go to Yale and Dartmouth, there's still people that probably enjoy\n\n1:01:12.000 --> 1:01:19.520\n sort of being the guerrilla warfare, counter revolutionary, and just like creating chaos\n\n1:01:19.520 --> 1:01:27.040\n in a place of love. So how do you prevent chaos and hatred breaking out in Librex?\n\n1:01:27.040 --> 1:01:33.760\n So the way I think about it is we have these principals. They're pretty simple and they're\n\n1:01:33.760 --> 1:01:38.560\n pretty easy to enforce. And then beyond the principals, we have a set of moderators,\n\n1:01:38.560 --> 1:01:42.560\n moderate from every single Ivy League school, a team of diverse moderators who enforce these\n\n1:01:42.560 --> 1:01:47.200\n principals, but not only enforce the principals, but kind of clue us in to what's happening\n\n1:01:47.200 --> 1:01:52.720\n in their community and how the real life context of their community translates to the Librex\n\n1:01:52.720 --> 1:01:59.680\n context of their community. And beyond that, we have conversation with them about the\n\n1:01:59.680 --> 1:02:03.760\n standards of the community. And we're constantly talking about what needs to be further\n\n1:02:03.760 --> 1:02:08.240\n elucidated and what needs to be tweaked. And we're in constant communication with the\n\n1:02:08.240 --> 1:02:13.520\n community. Now, if you want me to get into the principals that underlie Librex's moderation\n\n1:02:13.520 --> 1:02:14.000\n policy.\n\n1:02:14.000 --> 1:02:17.760\n Yeah, please. Maybe you can explain that there's moderators. What does that mean? How\n\n1:02:17.760 --> 1:02:20.880\n are they chosen? And what are the principals under which they operate?\n\n1:02:20.880 --> 1:02:26.560\n Sure. So how are the moderators chosen? The moderators are all volunteers. They're Librexers\n\n1:02:26.560 --> 1:02:33.840\n who reach out to me and respond to the opportunity to become moderator. And the way they're\n\n1:02:33.840 --> 1:02:39.440\n chosen is basically we want to make sure that they're in tune with their community. We want\n\n1:02:39.440 --> 1:02:43.440\n to make sure they come from diverse backgrounds and we want to make sure that they sort of\n\n1:02:43.440 --> 1:02:47.840\n understand what the community is about. And then we ask them some questions about how\n\n1:02:47.840 --> 1:02:52.560\n they would deal with certain scenarios, ones that we've had in the past and we feel strongly\n\n1:02:52.560 --> 1:02:56.000\n about. And then also ones that are a little more murky, where we want to see that they're\n\n1:02:56.000 --> 1:03:03.760\n sort of thinking about these things in a critical way. And from there, we choose a set and they\n\n1:03:03.760 --> 1:03:10.000\n have the power to take down posts. Of course, everything at the end of the day pens my\n\n1:03:10.000 --> 1:03:15.360\n review, but they can take them down and we can reinstate them if it's a problem. But\n\n1:03:15.360 --> 1:03:20.560\n they can take down posts and they can advocate for different moderation standards and different\n\n1:03:20.560 --> 1:03:21.600\n moderation policies.\n\n1:03:22.320 --> 1:03:28.960\n So for now, you're the Linus Torvalds of this community. So meaning like you're able to,\n\n1:03:29.680 --> 1:03:37.040\n like people are actually able to like email you or like text you, contact you and get\n\n1:03:37.040 --> 1:03:42.080\n a response. Like you respond to basically everybody. And then you're like really, you\n\n1:03:42.080 --> 1:03:47.600\n know, you're, you're living that live on people's floor life currently. That's not\n\n1:03:47.600 --> 1:03:54.320\n necessarily, this is the early days folks. I knew Ryan before he was a billionaire and\n\n1:03:54.320 --> 1:04:02.800\n he was cool. And then he was in a mansion making meats on his barbecue. No. Okay. But\n\n1:04:02.800 --> 1:04:12.320\n you know, how does it scale? Like what I suppose, how does it scale is the question. I\n\n1:04:12.320 --> 1:04:17.280\n mean, with Linus, I don't know if you're familiar with the Linux open source community,\n\n1:04:17.280 --> 1:04:21.520\n but he still stayed at the top for a while. It was really important. Like leadership there\n\n1:04:21.520 --> 1:04:26.240\n was really important to drive that large scale, really productive open source community.\n\n1:04:26.240 --> 1:04:32.960\n What do you see your role as Librex grows and in general, what are the mechanisms of\n\n1:04:32.960 --> 1:04:34.480\n scaling here for moderation?\n\n1:04:35.360 --> 1:04:41.520\n Where I see it, open discourse is fundamental to the purpose of the app, right? So as the,\n\n1:04:42.320 --> 1:04:49.760\n I guess you could say founder, CEO, what have you, part of my purpose has to be to enforce\n\n1:04:49.760 --> 1:04:54.080\n the vision, right? And part of the vision is open discourse. And that does come down\n\n1:04:54.080 --> 1:05:00.560\n in part to reasonable moderation and community guided reasonable moderation. So I imagine\n\n1:05:00.560 --> 1:05:05.600\n that will always be something that I'm intimately involved with to some degree. Now the\n\n1:05:05.600 --> 1:05:14.080\n degree to which the way in which that manifests, I imagine will have to change, right? And\n\n1:05:14.080 --> 1:05:19.680\n hopefully I'll be able to, just like you can hire a CTO, hopefully I'll be able to be\n\n1:05:19.680 --> 1:05:27.360\n in integrated in hiring people who understand the way that we are sort of operating and\n\n1:05:27.360 --> 1:05:32.400\n the reasonable standards of moderation. And there can be a sort of hierarchical structure.\n\n1:05:32.960 --> 1:05:38.720\n But I think when you have a product whose key purpose is to allow people to have these\n\n1:05:38.720 --> 1:05:46.720\n difficult conversations on campus that need to be had, I can never fully, I don't think\n\n1:05:46.720 --> 1:05:51.920\n I can fully ever abdicate that responsibility. I think that would be like, I mean, that would\n\n1:05:51.920 --> 1:05:57.280\n be like Bezos abdicating eCommerce, right? That's part of the job.\n\n1:05:57.280 --> 1:06:02.320\n Yeah, of course you can run companies in different ways. I think because he might have\n\n1:06:02.320 --> 1:06:05.200\n abdicated quite a bit of the details there.\n\n1:06:05.200 --> 1:06:06.240\n It's hard for me to say.\n\n1:06:06.240 --> 1:06:10.400\n Because Amazon does so many things. I think probably the better examples like Elon with\n\n1:06:10.400 --> 1:06:15.760\n rockets, he's still at the core of the engineering. He's at the core of the engineering. There's\n\n1:06:15.760 --> 1:06:20.640\n some fundamental questions. He probably does way too much of the engineering. He's the\n\n1:06:20.640 --> 1:06:28.000\n lowest level detail. But you're saying the core things that make the app work is the\n\n1:06:28.000 --> 1:06:30.000\n moderation of difficult conversations.\n\n1:06:30.000 --> 1:06:38.320\n And by the way, I'm 21 years old. Let's remind everyone of that. If this thing does scale\n\n1:06:38.320 --> 1:06:44.720\n and if this thing continues to be a positive force in a lot of people's lives, who knows\n\n1:06:44.720 --> 1:06:50.960\n what will happen in the next, what I'll learn. I'm still growing definitely as a leader,\n\n1:06:50.960 --> 1:06:56.880\n still growing as a thinker, still growing as a person. I can't pretend that I know how\n\n1:06:56.880 --> 1:07:03.520\n to run a business that is worth up to $1 billion, whatever. I can't pretend I know how to run\n\n1:07:03.520 --> 1:07:07.680\n a business that's going to have millions and millions of users. I expect that there are\n\n1:07:07.680 --> 1:07:11.840\n going to be a lot of amazing people who will teach me and that a lot of people who have\n\n1:07:11.840 --> 1:07:17.840\n already kind of stepped into my life and helped me out and taught me things. And I imagine\n\n1:07:17.840 --> 1:07:22.720\n that I'll learn so much more. I just know that moderation is always going to be important\n\n1:07:22.720 --> 1:07:28.320\n to me because I don't think Librex is Librex unless we have open discourse and moderation,\n\n1:07:28.960 --> 1:07:34.800\n reasonable, open, light touch moderation is at the heart of creating that, right?\n\n1:07:35.920 --> 1:07:40.800\n So as a creator of this kind of community in place with anonymity and difficult conversations,\n\n1:07:40.800 --> 1:07:48.160\n what do you think about this touchy three words that people have been tossing around\n\n1:07:48.160 --> 1:07:52.000\n and politicizing, I would say, but is at the core of the founding of this country, which\n\n1:07:52.000 --> 1:07:58.800\n is the freedom of speech? How do you think about the freedom of speech, this particular\n\n1:07:58.800 --> 1:08:04.720\n kind of freedom of expression? And do you think it's a fundamental human right? How\n\n1:08:04.720 --> 1:08:10.560\n do you define it to yourself when you're thinking about it? I went down, especially\n\n1:08:10.560 --> 1:08:17.360\n preparing for this conversation down a rabbit hole of like just how unclear it is philosophically\n\n1:08:17.360 --> 1:08:25.200\n what is meant by this kind of freedom. It's not as easy as people think, but it's interesting\n\n1:08:25.200 --> 1:08:30.000\n pragmatically speaking to hear how you think about it in the context of Librex.\n\n1:08:31.120 --> 1:08:37.040\n Yeah, it's a tough one, right? There's a lot there. So I come from the background of being\n\n1:08:37.040 --> 1:08:44.000\n a math major. Maybe it's important to start with that. And I found myself in the middle\n\n1:08:44.000 --> 1:08:49.520\n of this question of freedom of speech. One of the wonderful things is that the Librex\n\n1:08:49.520 --> 1:08:56.160\n community is filled with PhDs and governance majors who have taught me a ton about this\n\n1:08:56.160 --> 1:09:00.560\n sort of thing. And I'm still learning. I'm still growing. I'm still probably going to\n\n1:09:00.560 --> 1:09:08.960\n modify my perspective to some degree. Hopefully. Don't worry. I imagine I'll always support\n\n1:09:08.960 --> 1:09:16.480\n free discourse. Like learning how to speak about stuff is critical here because it's like\n\n1:09:17.600 --> 1:09:23.040\n I'm learning that this is like a minefield of conversations because the moment you say like\n\n1:09:23.040 --> 1:09:29.680\n even saying freedom of speech is a complicated concept, people will be like, oh, we spotted\n\n1:09:29.680 --> 1:09:34.880\n a communist. Like they'll say, there's nothing complicated about freedom. Freedom is freedom,\n\n1:09:34.880 --> 1:09:41.680\n bro. It is complicated. First of all, if you talk about there's different definitions of freedom of\n\n1:09:41.680 --> 1:09:45.920\n speech. If you want to go constitutionally, if you want to talk about the United States\n\n1:09:45.920 --> 1:09:52.560\n specifically and what's legal, it's actually not as exciting and not as beautiful as what\n\n1:09:52.560 --> 1:09:59.760\n people think of. It's complicated. I think there's ideals behind it that we want to see.\n\n1:09:59.760 --> 1:10:06.400\n What does that actually materialize itself in the digital world where we're trying to communicate\n\n1:10:06.400 --> 1:10:14.800\n in ways that allows for difficult conversations and also at the same time doesn't result in the\n\n1:10:14.800 --> 1:10:23.760\n silencing of voices, not through like censorship, but through like just assholes being rude.\n\n1:10:23.760 --> 1:10:24.560\n Spam.\n\n1:10:24.560 --> 1:10:27.200\n Spam. So it could be just bots.\n\n1:10:27.200 --> 1:10:27.840\n Racism.\n\n1:10:28.400 --> 1:10:29.040\n Racism.\n\n1:10:29.840 --> 1:10:39.360\n Going back to the name of the app, Librex. Libre, free. X was put onto for free exchange\n\n1:10:39.360 --> 1:10:45.680\n and the free exchange of what my purpose was to create as much inner communication of ideas,\n\n1:10:46.400 --> 1:10:53.200\n be them repugnant or otherwise as possible. And of course, to do that within legal bounds\n\n1:10:53.200 --> 1:10:58.240\n and to do that without causing anyone to be harassed or doxxed. So to keep things\n\n1:10:58.240 --> 1:11:08.160\n focused on the ideas, not the people. And then no BS crap stuff. And so to me,\n\n1:11:08.160 --> 1:11:13.840\n the easiest way to moderate around that, because as you said, figuring out what is hateful and what\n\n1:11:13.840 --> 1:11:19.040\n is hate speech is really hard, was to say no sweeping statements against core identity groups.\n\n1:11:21.120 --> 1:11:24.880\n And that seems to work on the whole pretty well to be pretty light touch.\n\n1:11:25.680 --> 1:11:27.120\n And it's hard to do though.\n\n1:11:27.120 --> 1:11:27.920\n It's difficult.\n\n1:11:27.920 --> 1:11:30.080\n We like to generalize, we humans.\n\n1:11:30.080 --> 1:11:33.680\n It's difficult, but what it comes down to is be specific.\n\n1:11:33.680 --> 1:11:37.040\n And when you think about what are sweeping statements against core identity groups,\n\n1:11:37.040 --> 1:11:42.320\n oftentimes these are sort of hackneyed subjects. These are things that have been broached and\n\n1:11:43.600 --> 1:11:48.480\n we've heard them before. They don't really lead anywhere productive. So it goes under\n\n1:11:48.480 --> 1:11:51.360\n this principle of be specific in the ideas you're discussing.\n\n1:11:52.240 --> 1:11:57.360\n So even for like positive and humorous stuff, you try to avoid generalizations.\n\n1:11:57.360 --> 1:11:58.720\n Against core identity groups.\n\n1:11:58.720 --> 1:12:01.360\n Core identity groups. Sorry, what are core identity groups?\n\n1:12:01.360 --> 1:12:02.640\n We're talking, kind of like,\n\n1:12:02.640 --> 1:12:06.080\n You know, race, religion.\n\n1:12:06.080 --> 1:12:11.520\n Okay. Got it. Even positive stuff?\n\n1:12:11.520 --> 1:12:13.280\n Well, against, negative.\n\n1:12:13.280 --> 1:12:16.320\n Oh, against. Sorry, against, against. Okay.\n\n1:12:16.960 --> 1:12:23.280\n Very, very, we've learned to be very specific. Very few words, but the community gets it, you know?\n\n1:12:23.280 --> 1:12:31.120\n Yeah, they get it. I mean, this is the thing. The trouble with rules is as the community grows,\n\n1:12:31.120 --> 1:12:33.920\n they'll figure out ways to manipulate the rules.\n\n1:12:33.920 --> 1:12:36.240\n Absolutely. It's human nature. It's creativity.\n\n1:12:36.240 --> 1:12:36.480\n Yeah.\n\n1:12:37.120 --> 1:12:38.880\n Something beautiful about it, of course.\n\n1:12:40.320 --> 1:12:41.840\n From an evolutionary perspective, yes.\n\n1:12:41.840 --> 1:12:45.360\n Yeah, the fact that people are so creative and so looking to,\n\n1:12:46.240 --> 1:12:50.640\n because people are genuinely interested in figuring out these things about social media.\n\n1:12:50.640 --> 1:12:56.640\n And so they'll 100% see like, where's the edge? And I mean, part of that's maintaining some level\n\n1:12:56.640 --> 1:13:02.400\n of vagueness in your rule set, which has its own set of questions and something we could think about.\n\n1:13:02.400 --> 1:13:06.160\n And I'm not implying I have all the answers, but there is something really interesting about people\n\n1:13:06.160 --> 1:13:11.600\n being so engaged that they're looking to figure out where are those edges and what does that mean?\n\n1:13:11.600 --> 1:13:13.040\n What does that edge mean, you know?\n\n1:13:14.080 --> 1:13:17.680\n Well, so one of the things I'm kind of thinking about,\n\n1:13:17.680 --> 1:13:22.000\n like from an individual user of Librex or an individual user of the internet,\n\n1:13:22.000 --> 1:13:27.600\n I think about like that one person that is on Reddit saying hateful stuff or positive stuff,\n\n1:13:27.600 --> 1:13:33.600\n doesn't matter, or funny stuff. One of the things I think about is the trajectory of that individual\n\n1:13:33.600 --> 1:13:40.560\n through life and how social media can help that person become the best version of themselves.\n\n1:13:41.440 --> 1:13:46.560\n I don't mean from like an Orwellian sense, like educate them properly or something.\n\n1:13:46.560 --> 1:13:52.720\n I just mean like, we're all, I believe, we're all fundamentally good. And I also believe\n\n1:13:53.760 --> 1:14:00.240\n we all have the capacity to do, to create some amazing stuff in this world,\n\n1:14:01.200 --> 1:14:06.720\n whether that's ideas or art or engineering, all those kinds of things, just to be amazing people.\n\n1:14:07.440 --> 1:14:13.520\n And I kind of think about like, you know, a lot of social media mechanisms bring out the worst\n\n1:14:13.520 --> 1:14:22.720\n in us. And I try to think like, in the long term, how can the social media or how can a website,\n\n1:14:22.720 --> 1:14:28.640\n how can a tool that you create can make the best, like you take a trajectory that makes you better,\n\n1:14:28.640 --> 1:14:32.960\n better and better and like the best version of yourself. So I think about that because like,\n\n1:14:33.760 --> 1:14:39.360\n you know, Twitter can really take you down some dark trajectories. I've seen people just not being\n\n1:14:39.360 --> 1:14:43.440\n the best version of themselves. Forget the cancel culture and all that kind of stuff. It's just like\n\n1:14:43.440 --> 1:14:49.040\n they're not developing intellectually in the way that's going to make the best version of themselves.\n\n1:14:49.040 --> 1:14:55.760\n I think Reddit, I'm not sure what I think about Reddit yet, because one positive side is all the\n\n1:14:55.760 --> 1:15:01.840\n shit posting I read. It could be just like a release valve for some stress in life. And you\n\n1:15:01.840 --> 1:15:07.200\n almost have like a parallel life where you're in meat space. You might be actually becoming\n\n1:15:07.200 --> 1:15:11.440\n successful and so on and growing and so on, but you just need some times to be angry at somebody.\n\n1:15:11.440 --> 1:15:19.120\n But I tend to not think that's possible. I think if you're shit posting, you're probably not\n\n1:15:19.120 --> 1:15:25.600\n spending your time the best way you could. I don't know. I'm torn on that. But do you think\n\n1:15:25.600 --> 1:15:31.920\n about that with Librex of creating a trajectory for the Yale, for the Dartmouth, for the students,\n\n1:15:31.920 --> 1:15:33.920\n to where they grow intellectually?\n\n1:15:33.920 --> 1:15:41.760\n One thing that I think about a lot is how do you incentivize positive content creation? How do you\n\n1:15:41.760 --> 1:15:50.640\n incentivize really intellectual content creation? It's something that, frankly, I think about every\n\n1:15:50.640 --> 1:15:58.240\n single day. And I think there are ways that... I mean, one thing that's great about humans is that\n\n1:15:58.240 --> 1:16:03.120\n they can be incentivized, right? And I think there are ways that you can incentivize people to make\n\n1:16:03.120 --> 1:16:05.840\n the right kind of content if that's your goal.\n\n1:16:06.720 --> 1:16:10.160\n So you think such mechanisms exist for such incentivization?\n\n1:16:10.160 --> 1:16:13.680\n I do. I don't want to let the cat out of the bag, so to speak.\n\n1:16:13.680 --> 1:16:16.560\n Do you have already concrete ideas in your mind?\n\n1:16:16.560 --> 1:16:20.480\n I have about three concrete ideas that I'm very, very optimistic about.\n\n1:16:22.160 --> 1:16:26.960\n You don't even need to share them. I understand totally. But the fact that you have them,\n\n1:16:26.960 --> 1:16:33.920\n that's really good. Because I feel like sometimes the downfall of the social media is that there's\n\n1:16:33.920 --> 1:16:42.720\n literally not even a thinking or a discussion about the incentivization of positive long term\n\n1:16:43.680 --> 1:16:48.320\n content creation. Twitter, I really was excited about this when they said like,\n\n1:16:48.880 --> 1:16:52.400\n when Jack has talked about creating healthy conversations.\n\n1:16:52.400 --> 1:16:57.920\n He does seem to care. I've listened to him. I mean, he has a very particular way of saying\n\n1:16:57.920 --> 1:17:01.920\n things. But you get the impression that he's someone who actually cares about these things\n\n1:17:01.920 --> 1:17:03.520\n within the limits of his power.\n\n1:17:03.520 --> 1:17:10.160\n Yeah. And that's the question, the limits of the power. Librex is growing not just in the number\n\n1:17:10.160 --> 1:17:18.480\n of communities, but also in the way you're incentivizing positive conversations, like coupled\n\n1:17:18.480 --> 1:17:22.560\n with a moderation and so on. So you think there's a lot of innovation to be had in that area?\n\n1:17:22.560 --> 1:17:27.280\n There's a tremendous amount. I think when you think about the reasons people post,\n\n1:17:27.920 --> 1:17:34.480\n fundamentally, people want to make a positive impact on their community to some degree. Now,\n\n1:17:34.480 --> 1:17:39.440\n there will always be bad actors. And part of the benefit of our moderation structure is that we\n\n1:17:39.440 --> 1:17:45.840\n can limit some of those bad actors, no bot accounts, no brigading. At the same time,\n\n1:17:45.840 --> 1:17:50.720\n the more you incentivize a certain type of behavior, the better it's going to be. And we\n\n1:17:50.720 --> 1:17:58.240\n don't see it as our role as the platform to force the community in a direction. And frankly, I don't\n\n1:17:58.240 --> 1:18:03.520\n think it would be good for anyone, the community or the conversations, if we forced a specific type\n\n1:18:03.520 --> 1:18:10.320\n of conversation. We just need to make the tools to allow people to be good and to incentivize good\n\n1:18:10.320 --> 1:18:10.880\n behavior.\n\n1:18:10.880 --> 1:18:19.600\n Yeah, I believe that. You will not need to censor if you allow people at scale to be good. The good\n\n1:18:19.600 --> 1:18:21.440\n will overpower the assholes.\n\n1:18:21.440 --> 1:18:25.120\n That's my fundamental belief. I'm very optimistic about that.\n\n1:18:26.080 --> 1:18:32.400\n But currently, Librex is small in the sense that it's a small set of communities that I believe.\n\n1:18:32.400 --> 1:18:38.400\n And you mentioned to me offline that by design, you're scaling slowly and carefully.\n\n1:18:38.400 --> 1:18:38.960\n That's right.\n\n1:18:38.960 --> 1:18:48.480\n So how does Librex scale? Is it possible? Facebook also started with a small set of communities\n\n1:18:48.480 --> 1:18:55.280\n that were schools, and then now grew to be basically the, if not one of the largest social\n\n1:18:55.280 --> 1:19:03.120\n networks in the world. Do you see Librex as potentially scaling to be beyond even college\n\n1:19:03.120 --> 1:19:06.560\n campuses, but encompassing the whole world?\n\n1:19:06.560 --> 1:19:17.440\n It's a long timeline. I'll say this. This gets back to where did Facebook go wrong?\n\n1:19:17.440 --> 1:19:24.400\n Because clearly, they did a lot right. And we can only speculate about what the objectives\n\n1:19:24.400 --> 1:19:30.160\n were of the founders of Facebook. I'm sure they've said some things, but it's always\n\n1:19:30.160 --> 1:19:36.880\n interesting to know what the mythology is versus what the truth is of the matter. So\n\n1:19:36.880 --> 1:19:42.240\n perhaps they've been very successful. I mean, they've taken over the world to some extent.\n\n1:19:43.920 --> 1:19:49.440\n At the same time, the goals of Librex are to create these positive communities and\n\n1:19:49.440 --> 1:19:54.000\n these open conversations where people can have real conversation and connection in\n\n1:19:54.000 --> 1:20:00.720\n their communities in a vulnerable and authentic way. And so to that end, which I imagine might\n\n1:20:00.720 --> 1:20:06.320\n be different than the goals of a Facebook, for example, one thing that we want to do\n\n1:20:06.320 --> 1:20:13.760\n is keep things intimate and community based. So each school is its own community. And perhaps\n\n1:20:13.760 --> 1:20:19.040\n you could have a slightly broader community. Maybe you could have a, I know the California\n\n1:20:19.040 --> 1:20:24.880\n system is an obvious one. Packed time might be an obvious one. And we can think about that. But\n\n1:20:24.880 --> 1:20:33.200\n fundamentally, the unit of community is your school or your school community. So that's one\n\n1:20:33.200 --> 1:20:38.560\n difference that I think will help us. The other thing is that we're scaling intentionally, meaning\n\n1:20:38.560 --> 1:20:44.320\n that when we expand to a school, we have moderators in place. We have moderators who understand that\n\n1:20:44.320 --> 1:20:50.720\n school's environment in a very personal level. And we're growing responsibly. We're growing as we're\n\n1:20:50.720 --> 1:20:58.960\n ready, both technologically, but also socially. But as we think we have the tools to preserve\n\n1:20:58.960 --> 1:21:02.640\n the community and to encourage the community to create the sort of content that we want them to\n\n1:21:02.640 --> 1:21:09.120\n create. And there's a lot of ways to define community. So first of all, there's geographic\n\n1:21:09.120 --> 1:21:16.240\n community as well. But the way you're kind of defining community with Yale and Dartmouth is the\n\n1:21:16.240 --> 1:21:24.640\n email, right? That's what gives you, there's a power to the email in the sense that that's how\n\n1:21:24.640 --> 1:21:32.560\n you can verify, efficiently verify yourself with being a single individual in the university. In\n\n1:21:32.560 --> 1:21:39.360\n that same way, you can verify your employment at a company, for example, like Google, Microsoft,\n\n1:21:39.360 --> 1:21:45.360\n Facebook. Do you see potentially taking on those communities? That'd be fascinating,\n\n1:21:45.920 --> 1:21:50.160\n getting like anonymous community conversations inside Google.\n\n1:21:50.960 --> 1:21:57.280\n 100% crossed my mind. To some extent, this is something where I understand the college\n\n1:21:57.280 --> 1:22:04.400\n experience. I understand the need. And I've never worked at Google. I don't know if they would hire\n\n1:22:04.400 --> 1:22:14.080\n me. Hopefully, maybe as a product manager. I think if there's a community that needs this product,\n\n1:22:14.080 --> 1:22:22.800\n and has that will, which I think, especially as Librex continues to grow and expand and change\n\n1:22:22.800 --> 1:22:27.840\n and learn. Because that's what we're doing is we're learning, right? With each community, it's not just\n\n1:22:27.840 --> 1:22:35.440\n about growing. It's about learning from each of these communities and iterating. I think it's\n\n1:22:35.440 --> 1:22:40.160\n quite likely there are going to be all sorts of communities that could use this tool to improve\n\n1:22:40.160 --> 1:22:48.400\n their culture, so to speak. So forgive me, I'm not actually that knowledgeable about the history of\n\n1:22:48.400 --> 1:22:55.280\n attempts of building social networks to solve the problem that you're solving. But I was made aware\n\n1:22:55.280 --> 1:23:05.760\n that there was an app or at least a social network called Yik Yak that had a similar kind of\n\n1:23:07.440 --> 1:23:14.720\n focus. I think the thing you've spoken about that differs between Librex and Yik Yak is that Yik Yak\n\n1:23:14.720 --> 1:23:21.520\n was defined, am I pronouncing it right even? You good? I'm good. I met the founder so I can confirm.\n\n1:23:21.520 --> 1:23:29.840\n Okay, you can confirm, cool. That it was constrained to a geographical area versus like to the actual\n\n1:23:29.840 --> 1:23:38.720\n community and that somehow had fundamental like actual differences in social dynamics that resulted.\n\n1:23:38.720 --> 1:23:45.040\n But can you speak to the history of Yik Yak? Like how does Librex differ? What lessons have you learned\n\n1:23:45.040 --> 1:23:50.160\n from that? Oh, and I should say that I guess there was controversial, I don't know, I didn't look at\n\n1:23:50.160 --> 1:23:53.840\n the details, but I'm guessing there's a bunch of racism and hate speech and all that kind of stuff\n\n1:23:53.840 --> 1:24:01.840\n that emerged on Yik Yak. Okay, so that's an example of like, okay, here's how it goes wrong when you\n\n1:24:01.840 --> 1:24:09.760\n have anonymity on college campuses. So how does Librex going to do better? Yeah, Yik Yak had a\n\n1:24:09.760 --> 1:24:14.720\n lot of problems, content problems, but the content problems go deeper than maybe what the press would\n\n1:24:14.720 --> 1:24:21.680\n reveal. There's a lot to say and part of it is parsing exactly what to talk about when it comes\n\n1:24:21.680 --> 1:24:27.440\n to Yik Yak and when you talk about startups, I mean you know this, you know startups, and you\n\n1:24:27.440 --> 1:24:32.880\n look at the postmortem, it's almost never what people think it is. And oftentimes these things\n\n1:24:32.880 --> 1:24:39.040\n are somewhat unknowable and the degree to which people seeking confirmation bias to somebody,\n\n1:24:39.040 --> 1:24:44.720\n seeking closure, look to find a singular attribute that caused the failure. It feels like the little\n\n1:24:44.720 --> 1:24:51.600\n details often make all the difference. Yes, and I think the details are so little that as humans\n\n1:24:51.600 --> 1:24:58.560\n we are not capable of parsing even what they are. But I'll tell you my perspective on it,\n\n1:24:58.560 --> 1:25:04.880\n knowing that I am also a human with biases. In this particular case, very significant biases.\n\n1:25:08.720 --> 1:25:14.960\n So I started building Librex for its own merits. At first I wasn't aware of Yik Yak, but as I started\n\n1:25:14.960 --> 1:25:20.080\n to talk to people about this platform I was building, I was made aware of Yik Yak and I\n\n1:25:20.080 --> 1:25:28.000\n built it from day one with a lot of the issues Yik Yak had in mind. So as you said, the one\n\n1:25:28.000 --> 1:25:33.680\n difference between Yik Yak is the geographical versus community based aspect. Going along with\n\n1:25:33.680 --> 1:25:39.040\n that, one thing I realized by researching social media sites is that the majority of\n\n1:25:39.920 --> 1:25:48.240\n the negative content, the content that's terrible and breaking all the rules is created by really,\n\n1:25:48.240 --> 1:25:54.800\n and the people who are not reformable, so to speak, the people who are not showing the best\n\n1:25:54.800 --> 1:26:02.960\n part of the human experience. It's a really small minority, right? I remember, I was listening to\n\n1:26:02.960 --> 1:26:08.880\n the founder of 4ChamMoot talk about this, how like one guy was able to basically destroy\n\n1:26:10.080 --> 1:26:16.160\n like large swaths of his community. Yeah, that's part of what makes it exciting for that\n\n1:26:16.160 --> 1:26:22.080\n minority is how much power they can have. So if you're predisposed to think in this way,\n\n1:26:22.080 --> 1:26:27.120\n it's exciting that you can walk into, like I mentioned the party before, you have a party\n\n1:26:27.120 --> 1:26:35.120\n of a lot of positive people and it feels, especially if you don't have much power in this\n\n1:26:35.120 --> 1:26:44.800\n world, it feels exceptionally empowering to just, to destroy like the lives of many.\n\n1:26:44.800 --> 1:26:51.680\n Yeah. And if you think this way, it's a problem. But I'm hopeful that you're right, that in most\n\n1:26:51.680 --> 1:26:56.480\n cases it's going to be a minority of people. I think it is. And that's what the research has\n\n1:26:56.480 --> 1:27:04.320\n showed. And one really powerful thing is that we can really actively control who comes in and out\n\n1:27:04.320 --> 1:27:10.080\n of our community based on the.edu verification. And we can also control who's not in our community\n\n1:27:10.080 --> 1:27:16.400\n because we have that lever where each account is associated with a.edu. So that's the first point\n\n1:27:16.400 --> 1:27:22.560\n I would point out there. Second point is controlled expansion, meaning that we have community\n\n1:27:22.560 --> 1:27:29.040\n moderation. We have this panel that allows the moderators to see all of the highly downloaded\n\n1:27:29.040 --> 1:27:34.240\n content, all of the reported content, all the flagged content and look through it and decide\n\n1:27:34.240 --> 1:27:40.720\n what they like and what's appropriate and what's not appropriate. And we have, we ping every\n\n1:27:40.720 --> 1:27:45.920\n moderator when there's a report. So things are taken down pretty quickly. And we have our\n\n1:27:45.920 --> 1:27:51.600\n standards and we have, I think above all of that, we have a mission and it's a community based\n\n1:27:51.600 --> 1:27:57.040\n mission. Yik Yak was more of a fun app and by its own admission, it was a place where people could\n\n1:27:57.040 --> 1:28:05.920\n enjoy themselves and could sort of yak. Yik Yak, chit chat. We have a bigger purpose than that,\n\n1:28:05.920 --> 1:28:11.920\n frankly. And I think that shows in the people who self select to be on that app, to be on Librex\n\n1:28:11.920 --> 1:28:18.320\n and to be on Yik Yak, respectively. The last thing I'll say is Yik Yak was very few characters. It\n\n1:28:18.320 --> 1:28:22.880\n was a Twitter esque platform. And that doesn't allow for a tremendous amount of nuance. It\n\n1:28:22.880 --> 1:28:27.680\n doesn't allow for a tremendous amount of conversation. Librex is much more long form.\n\n1:28:28.240 --> 1:28:36.160\n And so the kind of posts that you'll get on Librex can span pages. What people are starting\n\n1:28:36.160 --> 1:28:41.520\n to realize is that they can reach a lot more people at a lot more pertinent of a time a lot\n\n1:28:41.520 --> 1:28:47.440\n more quickly by posting their thoughts on Librex than if they went to their school newspaper.\n\n1:28:47.440 --> 1:28:52.800\n And I think the school newspapers might be a little worried about that. But more importantly,\n\n1:28:52.800 --> 1:28:57.520\n we're connecting people in this way where long form communication with nuance that takes into\n\n1:28:57.520 --> 1:29:03.840\n account everything that's happening in the community temporally is really available at\n\n1:29:03.840 --> 1:29:11.920\n Librex and not really communicable in 240 or 480 or whatever the number of characters the yaks were\n\n1:29:11.920 --> 1:29:19.280\n bound to. And I could talk about the history of Yik Yak if you want me to go further. They started,\n\n1:29:19.280 --> 1:29:25.440\n I think they were at 12 schools. And then spring break hit. People told their friends,\n\n1:29:25.440 --> 1:29:30.560\n look at this app. A thousand schools signed up and had active communities. They had a problem\n\n1:29:30.560 --> 1:29:36.000\n on their hands. And then the high schools come on board. I think a lot of the things you said\n\n1:29:36.000 --> 1:29:42.880\n ring true to me, but especially the vision one, which I do think having a vision in the leadership,\n\n1:29:42.880 --> 1:29:48.320\n having a mission makes all the difference in the world. That's both for the engineers that\n\n1:29:48.320 --> 1:29:54.080\n are building, like the team that's building the app, the moderation and users because they kind of,\n\n1:29:54.880 --> 1:30:02.480\n the mission carries itself through the behavior of the people on the social network.\n\n1:30:02.480 --> 1:30:08.080\n As a small tangent, let me ask you something about Parler, but it's less about Parler,\n\n1:30:08.080 --> 1:30:14.720\n more about AWS. So AWS removed Parler from his platform, you know, for whatever reasons,\n\n1:30:14.720 --> 1:30:21.600\n it doesn't really matter. But the fact that AWS would do this was really, really bothered me\n\n1:30:21.600 --> 1:30:29.440\n personally, because I saw AWS as the computing infrastructure and I always thought that part\n\n1:30:29.440 --> 1:30:34.080\n could not put a finger on its scale. And I don't know what your thoughts are. Like,\n\n1:30:34.080 --> 1:30:40.640\n were you bothered by Parler being removed from AWS? And how does that affect how you think about\n\n1:30:40.640 --> 1:30:44.800\n the computing infrastructure on which Librex is based?\n\n1:30:45.680 --> 1:30:52.160\n I was bothered not so much by Parler specifically being taken out of AWS, but more the fact that\n\n1:30:52.160 --> 1:30:59.040\n something that's like a highway, something that people rely on, that people build on top of, that\n\n1:30:59.040 --> 1:31:06.000\n people assume is going to be somewhat position agnostic, like a road that people drive on, is\n\n1:31:06.720 --> 1:31:13.520\n becoming ideologically sort of discriminatory. And of course, mind you, Amazon can do what it\n\n1:31:13.520 --> 1:31:18.720\n wants. It's a private company and I support the rights of private companies. I just, on an ethical\n\n1:31:18.720 --> 1:31:27.520\n and sort of a deep moral level, I wonder, like, at what point should a company sort of be agnostic\n\n1:31:27.520 --> 1:31:34.880\n in that regard and let developers build on top of their infrastructure? And where does that\n\n1:31:34.880 --> 1:31:36.400\n responsibility hold?\n\n1:31:36.400 --> 1:31:43.920\n Yes, it makes you hope that there's going to be, from a capitalistic sense, competitors to AWS\n\n1:31:43.920 --> 1:31:49.040\n would say, like, we're not going to put our finger on the scale. I mean, on the highway is a good\n\n1:31:49.040 --> 1:31:56.400\n sort of example. It's like if a privately owned highway said, you know, we're no longer going to\n\n1:31:56.400 --> 1:32:03.600\n allow, we're only going to allow electric vehicles. And a bunch of people in this world would be like,\n\n1:32:03.600 --> 1:32:12.480\n yes, because electric is good for the environment. And, you know, I think that's a good example.\n\n1:32:12.480 --> 1:32:20.560\n You know, yes, but then you have to consider the, like, the slippery slope nature of it, but also\n\n1:32:20.560 --> 1:32:25.920\n like the negative impact on the lives of many others and what that means for innovation and for,\n\n1:32:25.920 --> 1:32:32.640\n like, competition, again, in a capitalistic sense. So, there's some nature, there's some level to\n\n1:32:32.640 --> 1:32:40.320\n this hierarchy of our existence that we should not allow to manipulate what's built on top of it. It\n\n1:32:40.320 --> 1:32:48.640\n should be truly infrastructure. And it feels like compute is storage and compute is that layer. Like,\n\n1:32:48.640 --> 1:32:53.840\n it shouldn't be messed with. I haven't seen anybody really complain about it, like, in terms\n\n1:32:53.840 --> 1:32:59.040\n of government. And I'm not even sure government is the right mechanism through policy and regulation\n\n1:32:59.040 --> 1:33:06.160\n to step in. Because again, they do a messy job of fixing things. But I do hope there's competitors\n\n1:33:06.160 --> 1:33:12.560\n to AWS to make AWS then step up. Because I do think, you know, I'm a fan of AWS, except this.\n\n1:33:12.560 --> 1:33:13.360\n Good service.\n\n1:33:13.360 --> 1:33:15.760\n It's a good service until this.\n\n1:33:15.760 --> 1:33:18.880\n Until, yeah, until they rip out the rug.\n\n1:33:20.320 --> 1:33:26.080\n And the point is, it's not that necessarily their decision was a bad one with Parler,\n\n1:33:26.080 --> 1:33:32.640\n in particular. It's that, like, the slippery slope nature of it, but also\n\n1:33:32.640 --> 1:33:38.400\n the, it takes the good actors that are creating amazing products and makes them more fearful.\n\n1:33:38.400 --> 1:33:43.200\n And when you're more fearful, it's the same reason that anonymity is a tool that you don't create\n\n1:33:43.200 --> 1:33:47.040\n the best thing you could possibly create. When you're fearful, you don't create.\n\n1:33:47.040 --> 1:33:48.560\n That's right.\n\n1:33:48.560 --> 1:33:54.000\n I think we've kind of talked about it a little bit. But I wonder if we can kind of revisit it\n\n1:33:54.000 --> 1:34:00.400\n a little bit. I talked to a guy named Ronald Sullivan, who's a faculty at Harvard, a law\n\n1:34:00.400 --> 1:34:07.680\n professor. He was on the legal defense team. He was the lawyer for Harvey Weinstein and Aaron\n\n1:34:07.680 --> 1:34:13.440\n Hernandez for the double murder case. So he takes on these really difficult cases of unpopular\n\n1:34:13.440 --> 1:34:20.400\n figures because he believes like that's the way you test that we believe in the rule of law.\n\n1:34:20.400 --> 1:34:30.160\n But he was, there's a big protest in Harvard to get him, basically censor him and to get him to\n\n1:34:30.160 --> 1:34:36.800\n no longer be faculty dean, all those kinds of things. And it was by a minority of students, but\n\n1:34:38.160 --> 1:34:44.000\n there's a huge blowback, obviously in the public, but also inside Harvard, like that's not okay.\n\n1:34:44.000 --> 1:34:48.640\n He stands for the very principles at the founding of Harvard and at the principles of the founding\n\n1:34:48.640 --> 1:34:56.320\n of this country and the law and so on. But the basic argument is that it was about safe spaces,\n\n1:34:57.360 --> 1:35:03.760\n that it's unsafe to have somebody who is basically supporting Harvey Weinstein, right?\n\n1:35:05.760 --> 1:35:12.800\n What do you think about this whole idea of safe spaces on college campuses? Because it feels like\n\n1:35:12.800 --> 1:35:18.000\n the mission of Librex is pushing back against the idea of safe spaces.\n\n1:35:19.040 --> 1:35:23.360\n I think safe spaces are fine when they're within people's private lives, within their homes,\n\n1:35:23.920 --> 1:35:28.880\n within their religious organizations. I think the problem becomes when the institution starts\n\n1:35:28.880 --> 1:35:40.560\n encouraging or backing safe spaces because what are people being safe from? And oftentimes,\n\n1:35:40.560 --> 1:35:47.680\n it seems like there's this idea that the harm that's being attempted to be mitigated is the\n\n1:35:47.680 --> 1:35:51.360\n harm of confronting opinions you disagree with, opinions you might find repugnant.\n\n1:35:52.560 --> 1:35:58.960\n And if this is conflated with a need for safety, then that's where the idea of liberal arts\n\n1:35:58.960 --> 1:36:05.440\n education sort of dies. Of course, it's complicated and we still want to have safe\n\n1:36:05.440 --> 1:36:11.280\n intellectual environments. But the way that I hear the term safe space used today,\n\n1:36:11.840 --> 1:36:17.280\n I think it doesn't really have a place within the intellectual context.\n\n1:36:17.280 --> 1:36:23.040\n Yeah, it's funny. I mean, this is why Librex is really exciting, is it's pushing those\n\n1:36:23.040 --> 1:36:29.680\n difficult conversations. And I'd love to see, ultimately, there does seem to be an asymmetry\n\n1:36:29.680 --> 1:36:39.120\n of power that results in the concept of safe spaces and hate speech being redefined in the\n\n1:36:39.120 --> 1:36:44.000\n slippery slope kind of way where it means basically anything you want it to mean. And\n\n1:36:44.880 --> 1:36:52.160\n it basically is used to silence people, to silence people. They're like good, thoughtful experts.\n\n1:36:52.160 --> 1:37:00.640\n Also, beyond that, I would say it has not just a pragmatic purpose, which is the silencing,\n\n1:37:00.640 --> 1:37:05.360\n but also sort of an ideological purpose, which is, and a linguistic purpose, which is to\n\n1:37:05.360 --> 1:37:14.400\n conflate words with unsafety and harm and violence, which is what you kind of see on a\n\n1:37:14.400 --> 1:37:20.320\n cultural linguistic level is happening all around us right now is that this idea that words are harm\n\n1:37:20.320 --> 1:37:25.200\n is a very dangerous and slippery concept. I mean, you don't have to slip that far to see\n\n1:37:25.200 --> 1:37:30.480\n why that's a problem. Once we start making words into violence and we start criminalizing words,\n\n1:37:30.480 --> 1:37:37.680\n we get into some really authoritarian territory, things that I think, I mean, myself and my\n\n1:37:37.680 --> 1:37:42.080\n background, I don't know how much we have to go into it, but things that my ancestors\n\n1:37:42.080 --> 1:37:46.640\n certainly would be worried about. What's your background?\n\n1:37:46.640 --> 1:37:52.160\n I'm a child of Holocaust survivors and pro grom survivors, so.\n\n1:37:52.160 --> 1:37:56.560\n Yeah, I mean, me as well from different directions. I come from the Soviet Union, so\n\n1:37:56.560 --> 1:38:03.120\n there's, well, like in most of us, hate and love runs through our blood from our history.\n\n1:38:04.080 --> 1:38:07.840\n You mentioned MIT is being added to Librex. Has it already been added?\n\n1:38:07.840 --> 1:38:09.840\n Yes, it was added today.\n\n1:38:09.840 --> 1:38:16.400\n Today, okay. So let me ask you, this is exciting because I don't know what your thoughts are about\n\n1:38:16.400 --> 1:38:21.840\n this, but I'll tell you from my perspective, if you're, and a lot of MIT folks listen to this,\n\n1:38:22.480 --> 1:38:28.000\n I would love it if you joined Librex. It'd be interesting to explore conversations\n\n1:38:29.040 --> 1:38:38.000\n on several topics inside MIT, but one of the most moving that hasn't been discussed at all\n\n1:38:38.000 --> 1:38:46.240\n at all, except in little flourishes here and there, is the topic of Jeffrey Epstein.\n\n1:38:47.840 --> 1:38:57.360\n Now, there's been a huge amount of, like, impact that the connections of various faculty to Jeffrey\n\n1:38:57.360 --> 1:39:04.880\n Epstein and the various things that have been said had on MIT, but it feels like the difficult\n\n1:39:04.880 --> 1:39:11.680\n conversation haven't had been had. It's the administration trying to clean up and give a bunch\n\n1:39:11.680 --> 1:39:18.080\n of BS to try to pretend, like, let's just hide this part. Like nothing is broken, nothing to see\n\n1:39:18.080 --> 1:39:25.760\n here. Here's a bad dude that did some bad things and some faculty that kind of misbehaved a little\n\n1:39:25.760 --> 1:39:31.040\n bit because they're a little bit clueless. Let's all look the other way. Harvard did this much\n\n1:39:31.040 --> 1:39:37.520\n better, by the way. They completely, it's almost like people pretend like Harvard didn't have\n\n1:39:37.520 --> 1:39:45.280\n anything to do with Jeffrey Epstein. But I think I'd be curious to hear what those conversations\n\n1:39:45.280 --> 1:39:55.040\n are because there's conversations on the topic of like, well, obviously sort of sexual assault and\n\n1:39:55.040 --> 1:40:00.160\n disrespecting women on any kind of level within academia, but just women in general.\n\n1:40:00.160 --> 1:40:05.840\n That's an important topic to talk about, various, many sets of difficult conversations. And the\n\n1:40:05.840 --> 1:40:15.360\n other topic is, you know, funding for research. Like how are, like, what are we okay taking money\n\n1:40:15.360 --> 1:40:20.160\n from and what are we not okay taking money from? You know, there's a lot of just interesting\n\n1:40:20.160 --> 1:40:27.280\n difficult conversations to be had. I've worked with people who, you know, refuse to take money\n\n1:40:27.280 --> 1:40:32.800\n from DOD, Department of Defense, for example, because in some indirect or direct way, you're\n\n1:40:32.800 --> 1:40:37.520\n funding military industrial complex, all those kinds of things. I think with Jeffrey Epstein,\n\n1:40:37.520 --> 1:40:44.400\n it's even more stark, this contrast of like, well, what is and isn't ethical to take money from?\n\n1:40:44.960 --> 1:40:51.280\n And I just think, forget academia, I think there's just a lot of interesting, deep human\n\n1:40:51.280 --> 1:40:55.760\n discussions to be had. And they haven't been. And there's been somebody, I don't know if you're\n\n1:40:55.760 --> 1:41:02.160\n familiar with Eric Weinstein, who has been outraged by the fact that nobody's talking about Jeffrey\n\n1:41:02.160 --> 1:41:08.960\n Epstein. Nobody's having these difficult conversations. And Eric himself has had a sort of\n\n1:41:10.080 --> 1:41:16.960\n complicated journey through academia, in the sense that he's a really kind of renegade thinker in\n\n1:41:16.960 --> 1:41:21.280\n many kinds of ways. I'm not sure if you know who Eric is, by any chance. Heard the name. Okay. I\n\n1:41:21.280 --> 1:41:27.040\n actually checked out ZEV. ZEV. It was heartening for me to see that I was not the youngest person\n\n1:41:28.560 --> 1:41:31.360\n on this podcast. You're the second youngest. Second youngest.\n\n1:41:34.080 --> 1:41:45.440\n That's hilarious. But Eric, he's kind of a renegade thinker. He's a mathematical physicist\n\n1:41:45.440 --> 1:41:52.560\n with, I believe, a PhD at Harvard, and he spent some time at MIT and so on. But he speaks to the\n\n1:41:52.560 --> 1:41:58.240\n fact that there's a culture of conformity and so on. And if you're somebody who's a bit outside of\n\n1:41:58.240 --> 1:42:02.800\n the box, a bit weird, in whatever dimension of weird, that makes you actually kind of interesting\n\n1:42:03.440 --> 1:42:09.360\n that the system kind of wants to make you an outcast, wants to throw you out. And so he kind\n\n1:42:09.360 --> 1:42:14.400\n of opposes that whole idea. He's the perfect person to have conversations with in this kind\n\n1:42:14.400 --> 1:42:22.800\n of Librex kind of context of anonymity. Because I'll tell you the few conversations that came across\n\n1:42:22.800 --> 1:42:30.160\n and they were very quickly silenced. And I'm troubled by it. I'm not sure what to think of it.\n\n1:42:30.160 --> 1:42:39.200\n Is there's a few threads inside MIT, like on a mailing list, discussing Marvin Minsky. I don't\n\n1:42:39.200 --> 1:42:44.560\n know if you know who that is. He's an AI researcher. He's a seminal figure in AI before your time, but\n\n1:42:44.560 --> 1:42:50.720\n one of the most important people in the history of artificial intelligence. And there was a\n\n1:42:50.720 --> 1:43:00.880\n discussion on a thread that involved the interaction between Marvin Minsky and Jeffrey Epstein.\n\n1:43:01.600 --> 1:43:07.360\n That conversation was quickly shut down. One person was pushed out of MIT, Richard Stallman,\n\n1:43:07.360 --> 1:43:13.120\n who's one of the key figures in the, because of that, because he wanted some clarity about the\n\n1:43:13.120 --> 1:43:19.520\n situation. But he also miss, he spoke, like we mentioned earlier, without grace, right?\n\n1:43:20.800 --> 1:43:27.280\n But he was quickly punished by the administration because of a few people protesting. And just that\n\n1:43:27.280 --> 1:43:36.880\n conversation, I guess what bothered me most is it didn't continue. It didn't expand. There was no\n\n1:43:36.880 --> 1:43:44.560\n like complexity. And it was, there was a hunger that was clear behind that conversation, especially\n\n1:43:44.560 --> 1:43:49.840\n sort of for me, I'd like to understand Marvin Minsky was one of the reasons I wanted to come\n\n1:43:49.840 --> 1:43:56.400\n to MIT. He's passed away, but he's one of the key figures in the field that I deeply care about,\n\n1:43:56.400 --> 1:44:03.840\n artificial intelligence. And I thought that his name was dragged through the mud,\n\n1:44:03.840 --> 1:44:11.280\n through that situation, and without ever being like resolved. And so it's unclear to me, like,\n\n1:44:11.280 --> 1:44:18.400\n what am I supposed to think about all this? And the only way to come to a conclusion there is to\n\n1:44:18.400 --> 1:44:22.880\n keep talking. It's like the thing we started this conversation with about truth is like,\n\n1:44:24.000 --> 1:44:30.480\n is conversation. So in that sense, I'd love if people on Librex, perhaps in other places,\n\n1:44:30.480 --> 1:44:36.800\n but it seems like Librex is a nice platform to discuss Marvin Minsky, to discuss Jeffrey Epstein,\n\n1:44:36.800 --> 1:44:42.880\n to learn from it, to grow from it, to see how we can make MIT better. As I'm still one of the\n\n1:44:42.880 --> 1:44:49.040\n people, I've always dreamed of being at MIT and it was a dream come true in many ways. And I still\n\n1:44:49.040 --> 1:44:54.400\n believe that MIT is one of the most special places in this world. Like many other universities,\n\n1:44:54.400 --> 1:45:01.360\n universities in general is truly special, man. It hurts my heart when people speak poorly of\n\n1:45:01.360 --> 1:45:06.880\n academia. I understand what they mean. They're very correct, but there is much more, in my opinion,\n\n1:45:06.880 --> 1:45:12.800\n that's beautiful about academia than that's broken. I mean, I don't know if you have something to\n\n1:45:12.800 --> 1:45:18.560\n comment. It doesn't necessarily need to be about Jeffrey Epstein, but there's these difficult things\n\n1:45:18.560 --> 1:45:26.080\n that come up that test the academic community, right? That it feels like conversation is the\n\n1:45:26.080 --> 1:45:33.040\n only way to resolve it. I think people have a natural need for closure. And it's not just,\n\n1:45:33.040 --> 1:45:38.880\n I'm not as plugged into the, what academics are talking about as you would be Lux, but I even...\n\n1:45:38.880 --> 1:45:45.440\n In case these days, no respect for Minsky. Exactly. I mean, especially in the AI community,\n\n1:45:45.440 --> 1:45:53.280\n I'm not necessarily a programmer. But what I will say is that people come to Librex and\n\n1:45:53.280 --> 1:45:58.400\n we always see a huge spike in users whenever there's a tragedy on campus or something where\n\n1:45:58.400 --> 1:46:05.280\n people need closure. Recently, there was a suicide just the other day on Yale's campus,\n\n1:46:05.840 --> 1:46:13.200\n and people were just coming to pay respects and to say, rest in peace, and speak also about\n\n1:46:13.200 --> 1:46:22.080\n what might've led to an environment where people are drawn to these terrible results.\n\n1:46:23.440 --> 1:46:28.800\n So just having a conversation is important there, because it brings closure.\n\n1:46:28.800 --> 1:46:34.480\n People need the space, especially when no one wants to go out and put their head above,\n\n1:46:34.480 --> 1:46:41.520\n be the longest blade of grass on that one because of the stigma. People need to be able to speak.\n\n1:46:41.520 --> 1:46:46.320\n Yeah, that fear really bothers me, the fear that silences people. Like, were they self censor? Were\n\n1:46:46.320 --> 1:46:58.160\n they self silence? Well, you've created an amazing place. I'm kind of interested in your struggle and\n\n1:46:58.160 --> 1:47:07.680\n your journey of creating positive incentives, because it's a problem in a very different domain\n\n1:47:07.680 --> 1:47:16.960\n that I'm also interested in. So I love robotics. I love human robot interaction. And so I believe\n\n1:47:16.960 --> 1:47:21.760\n that most people are good and we can bring out the best in human nature. Social networks is a very\n\n1:47:21.760 --> 1:47:25.840\n tricky space to do that in. So I'm glad you're taking on the problem and I'm glad you have the\n\n1:47:25.840 --> 1:47:33.600\n mission that you do. I hope you succeed. But you mentioned offline that you used to be into chess.\n\n1:47:33.600 --> 1:47:37.920\n Tell me about your journey through chess. Sure. I was a very competitive tournament player growing\n\n1:47:37.920 --> 1:47:45.280\n up till about like 13. I got for the chess fans, I got to around 2000. USCF. So I was a competitive\n\n1:47:45.280 --> 1:47:53.360\n player, especially my age group. And that actually led me to poker. I was I was playing a tournament.\n\n1:47:53.360 --> 1:47:57.040\n And what happens is when you're like a very strong 13 year old and you're playing locally,\n\n1:47:57.040 --> 1:48:01.120\n if you want a good match, you're gonna end up playing a lot of adults and you're gonna end up\n\n1:48:01.120 --> 1:48:04.960\n playing if you want a good match, you're gonna end up playing a lot of adults. And I ended up\n\n1:48:04.960 --> 1:48:12.000\n playing this mid 40s guy who we played a really strong game. He actually beat me. I still I still\n\n1:48:12.000 --> 1:48:16.720\n remember the game and think I could I should have played that move instead of that one. But after\n\n1:48:16.720 --> 1:48:20.880\n after the game, we had a postmortem. It was this me I think I was 13 at the time and this 40 year\n\n1:48:20.880 --> 1:48:26.240\n old like hanging over this chessboard and looking over the moves. And even at that even at my age,\n\n1:48:26.240 --> 1:48:31.600\n that this guy was absolutely brilliant. Yes. And after after the postmortem, not only by the way,\n\n1:48:31.600 --> 1:48:36.960\n in chess, but just like in the way he articulates his thoughts, as some people are. After postmortem,\n\n1:48:36.960 --> 1:48:40.320\n I went and looked him up online, I found out that he was a World Series of Poker Champion.\n\n1:48:41.520 --> 1:48:47.120\n And his name is Bill Chen. Oh, wow. And I haven't really kept up with him, except one time there\n\n1:48:47.120 --> 1:48:53.520\n was another chess tournament when I was around 14. And I followed him into an elevator as he was\n\n1:48:53.520 --> 1:48:57.680\n leaving the chess hall, like pretending that I was going to go up just because I wanted to,\n\n1:48:57.680 --> 1:49:01.920\n I just wanted to talk to him. And I suggested a sequel or some changes that he could that I\n\n1:49:01.920 --> 1:49:05.120\n thought he could make for his book. And he was like, actually, I was thinking of doing the same\n\n1:49:05.120 --> 1:49:10.640\n thing, which is incredibly validating to my 14 year old or 15 year old self. But I really haven't\n\n1:49:10.640 --> 1:49:15.920\n kept up with him. So shout out to him. But and then that he wrote a book called the mathematics\n\n1:49:15.920 --> 1:49:21.680\n of poker that I started reading. And that, first of all, kickstarted my interest in game theory.\n\n1:49:21.680 --> 1:49:28.320\n And second of all, in poker. So it started from chess and then poker. And I started with Bitcoin\n\n1:49:28.320 --> 1:49:35.920\n poker and had a lot of success with that met a lot of amazing friends. Learned a ton about I mean,\n\n1:49:35.920 --> 1:49:41.120\n I think about entrepreneurship as well as taking risks, reasonable risks, positive expected value\n\n1:49:41.120 --> 1:49:48.960\n risks. And also just growing as a person and mathematician. And what did you say Bitcoin\n\n1:49:48.960 --> 1:49:54.080\n poker? Yeah, what's Bitcoin poker? So you have to understand I was 14 years old, right? Yes. So how\n\n1:49:54.080 --> 1:49:58.960\n is a 14 year old with wonderful parents who care about him? Yeah. And probably don't want him\n\n1:49:59.760 --> 1:50:05.600\n playing poker. Yeah. Going to start playing poker, because I wanted I wanted to challenge I love the\n\n1:50:05.600 --> 1:50:12.720\n challenge of the competition. And I realized the answer is probably Bitcoin. Because the implications\n\n1:50:12.720 --> 1:50:17.840\n of that. And they had they had these free roll tournaments, which for those who don't know what\n\n1:50:17.840 --> 1:50:22.080\n free rolls are, there's these promotional tournaments that sites put on where they'll\n\n1:50:22.080 --> 1:50:27.280\n put like a few dollars in and then 1000s of people sign up and the winners get like a dollar.\n\n1:50:27.280 --> 1:50:33.040\n And I started there and I worked my way up. And that's amazing. What's your sense about from that\n\n1:50:33.040 --> 1:50:40.880\n time to today of the growth of the cryptocurrency community? I'm actually having like four or five\n\n1:50:40.880 --> 1:50:47.840\n conversations with Bitcoin proponents, Bitcoin maximalists, and like all these I'm just having\n\n1:50:47.840 --> 1:50:53.920\n all these cryptocurrency conversations currently, because there's so many brilliant, like technically\n\n1:50:53.920 --> 1:50:58.960\n brilliant, but also financially and philosophically brilliant people in those communities. It's\n\n1:50:58.960 --> 1:51:04.640\n fascinating with the explosion of impact, like and also, if you look into the future, the possible\n\n1:51:04.640 --> 1:51:09.840\n revolutionary impact on society in general, but what's your sense about this whole growth of\n\n1:51:09.840 --> 1:51:16.560\n Bitcoin? I'm definitely less knowledgeable on the currency. Again, like programming, it was a means\n\n1:51:16.560 --> 1:51:22.080\n to an end. Yes. Right. What I will say is that there was this amazing community that grew out of\n\n1:51:22.080 --> 1:51:28.720\n it. And you'd have people who were willing to stake me or have me be their horse and they're my\n\n1:51:28.720 --> 1:51:37.280\n backer. For having never met me for literally full Bitcoin tournaments, like full Bitcoin entry fee\n\n1:51:37.280 --> 1:51:42.000\n tournaments, and I get a percentage of the profits and they get a percentage. And to have that level\n\n1:51:42.000 --> 1:51:48.640\n of community for that degree of money, I mean, it gives you hope about the potential for, you know,\n\n1:51:48.640 --> 1:51:56.160\n humans to act in mutual best interest with a degree of trust. Yeah, there's a really fascinating,\n\n1:51:56.160 --> 1:52:00.640\n strong community there. But speaking of like bringing out the best of human nature,\n\n1:52:00.640 --> 1:52:07.840\n it's a community that's currently struggling a little bit in terms of their ability to communicate\n\n1:52:07.840 --> 1:52:15.520\n in a positive, inspiring way. Like the Bitcoin folks, and we talk about this a lot. I honestly\n\n1:52:15.520 --> 1:52:22.480\n think they have a lot of love in their hearts and minds, but they just kind of naturally,\n\n1:52:22.480 --> 1:52:31.360\n naturally, because the world has been like institutions and the centralized powers have been\n\n1:52:32.160 --> 1:52:39.360\n sort of mocking and fighting them for many years that they've become sort of worn down and cynical.\n\n1:52:39.360 --> 1:52:44.560\n And so they tend to be a little bit more aggressive and negative on the internet in the\n\n1:52:44.560 --> 1:52:49.280\n way they communicate, especially on Twitter. And it's just created this whole community of\n\n1:52:49.280 --> 1:52:55.360\n of basically being derisive and mocking and trolling and all this kind of stuff.\n\n1:52:55.360 --> 1:53:00.160\n But people are trying to, you know, as the Bitcoin community grows, as the cryptocurrency community\n\n1:53:00.160 --> 1:53:05.840\n grows, they're trying to revolutionize that aspect too. So they're trying to find the positive core\n\n1:53:05.840 --> 1:53:12.800\n and grow and grow in that way. So it's fascinating because I think all of us are trying to find the\n\n1:53:12.800 --> 1:53:18.800\n positive aspects of ourselves and trying to learn how to communicate in a positive way online.\n\n1:53:18.800 --> 1:53:22.480\n It's like the internet hasn't been around. Social networks haven't been around that long. We're\n\n1:53:22.480 --> 1:53:28.080\n trying to figure this thing out. Let me ask you the ridiculous question. I don't know if you\n\n1:53:28.080 --> 1:53:33.520\n have an answer, but who is the greatest chess player of all time in your view? So since you\n\n1:53:33.520 --> 1:53:39.920\n like chess. That's how you define it. But if you're talking about raw skill, like if you put everyone\n\n1:53:39.920 --> 1:53:44.560\n across time into a torment together, Carlson would win. I don't think that's particularly\n\n1:53:44.560 --> 1:53:51.280\n controversial. Oh, you mean like with the same exact skill level? Exactly. Now if you talk about\n\n1:53:51.280 --> 1:53:58.640\n political importance, I think Bobby Fischer is, you know, he's the only one that people still,\n\n1:53:58.640 --> 1:54:02.720\n when you go to someone on the street, they know Bobby Fischer because of what he represented,\n\n1:54:02.720 --> 1:54:08.160\n right? Who do you think is more famous on the street? Garry Kasparov or Bobby Fischer?\n\n1:54:08.160 --> 1:54:12.880\n Bobby Fischer. In America, Bobby Fischer. You think so? Yes. That's interesting. I think we're\n\n1:54:12.880 --> 1:54:17.360\n gonna have to put that to the test. Yeah, maybe it's more reflective of the community that I was\n\n1:54:17.360 --> 1:54:22.720\n a part of, but yeah. Oh, so in the community you're a part of like Young Minds playing chess,\n\n1:54:22.720 --> 1:54:27.440\n Bobby Fischer was a superstar in terms of the roots. Yeah, I think so because he's American\n\n1:54:28.000 --> 1:54:35.520\n and, you know, he stood up against the big bad Russians at the time and, you know, unfortunately\n\n1:54:35.520 --> 1:54:43.520\n he had a very bad downfall. But, you know, for our geopolitical situation, he meant a lot. And then\n\n1:54:43.520 --> 1:54:49.280\n if you talk about compared to contemporaries, actually, I would say Paul Morphy was a bit of\n\n1:54:49.280 --> 1:54:55.040\n a throwback. He's one of those geniuses that was just head and shoulders above everyone else.\n\n1:54:56.320 --> 1:55:00.720\n Is there somebody that inspired your own play, like as a Young Mind? Yeah, I really liked\n\n1:55:00.720 --> 1:55:08.960\n Mikhail Tal. I think he was very aggressive, right? Yeah, very tactical. Which is funny because I\n\n1:55:10.080 --> 1:55:14.960\n found that I was better at like sort of slow methodical play than quick tactics, but I just,\n\n1:55:14.960 --> 1:55:18.480\n I mean, there's something beautiful about the creativity and that's something I always latched\n\n1:55:18.480 --> 1:55:23.600\n onto as being a creative player, being a creative person. I mean, chess doesn't really reward\n\n1:55:23.600 --> 1:55:28.640\n creativity as much as a lot of other things, especially entrepreneurial pursuits, which I\n\n1:55:28.640 --> 1:55:35.040\n think is part of the reason why I sort of grew out of it. But I always was attracted to the\n\n1:55:35.040 --> 1:55:41.440\n creativity that I did see in chess. So let me ask the flip, the other, because you said poker,\n\n1:55:41.440 --> 1:55:46.640\n is there somebody that stands out to you as could be the greatest poker player of all time? Like\n\n1:55:46.640 --> 1:55:55.360\n who do you admire? That's a more controversial one because these chess players are such like,\n\n1:55:55.360 --> 1:55:59.440\n first of all, there's more an objective standard. And second of all, there's like,\n\n1:55:59.440 --> 1:56:04.720\n they're like almost like cultural figures to me. Whereas poker players are more like live,\n\n1:56:05.280 --> 1:56:09.680\n living. They feel more like, yeah, they feel more accessible. But they also have like\n\n1:56:09.680 --> 1:56:18.160\n personalities in poker. They have vices, they have quirks, they have humor. Like,\n\n1:56:18.160 --> 1:56:23.360\n I guess we've seen videos of them because it's such a recent development. I'll say one person\n\n1:56:23.360 --> 1:56:29.360\n who I admire so much. And like, if I could like have a dinner list of people that I want to have\n\n1:56:29.360 --> 1:56:35.360\n dinner with, like maybe it'll happen now, actually. I would love to have dinner with him. Phil\n\n1:56:35.360 --> 1:56:44.160\n Galfond, who most people probably won't know. But on this podcast, but the way, first of all,\n\n1:56:44.160 --> 1:56:49.600\n he democratized poker learning in like the mathematical nitty gritty, how do you get good\n\n1:56:49.600 --> 1:56:57.120\n at poker type sense to the entire world in like an unprecedented way. He gave, he had this gift\n\n1:56:57.120 --> 1:57:01.040\n that he had learned and distilled by working with some of the greatest poker minds. And he\n\n1:57:01.040 --> 1:57:09.440\n just democratized it through his website. And I learned a ton from him. And not only that,\n\n1:57:09.440 --> 1:57:13.840\n but you just listen to him think. And it's almost like a philosophical meditation,\n\n1:57:13.840 --> 1:57:18.240\n the way that he breaks things down and thinks about these different elements and has such a\n\n1:57:18.240 --> 1:57:24.560\n holistic thought process. It's like watching a genius work. And, you know, he's also just a nice,\n\n1:57:24.560 --> 1:57:30.560\n fun, sociable guy that like, you can, you can imagine being at your dinner table. So all that\n\n1:57:30.560 --> 1:57:34.720\n combined. Which is not true for a lot of poker players, right? A lot of them are dark souls.\n\n1:57:34.720 --> 1:57:41.360\n To say the least, yes. I like, I really like the, what is he, Canadian Daniel Negrano.\n\n1:57:41.360 --> 1:57:45.760\n He's also a nice guy. He's also a nice guy, but he's also somebody who's able to express his\n\n1:57:45.760 --> 1:57:51.040\n thoughts about poker really well, but also in an entertaining way. He seems to be able to predict\n\n1:57:51.040 --> 1:57:57.040\n cards better than anybody I've ever seen. Like what. Did you watch the challenge? Which challenge?\n\n1:57:57.040 --> 1:58:03.440\n He, he lost like a million dollars recently to Doug Polk. He lost a million dollars to Doug Polk,\n\n1:58:03.440 --> 1:58:09.120\n heads up online. It's really interesting. Yeah. It's, it's awesome to watch these guys work.\n\n1:58:09.120 --> 1:58:17.600\n So I know you're 20, 21. 21. 21. So, so asking you for advice is, is a little bit funny, but,\n\n1:58:19.120 --> 1:58:25.280\n but at the same time, not because you've created a social network. You've created a startup from\n\n1:58:25.280 --> 1:58:30.800\n nothing as we talked about earlier, like without knowing how to program you've programmed. I mean,\n\n1:58:30.800 --> 1:58:34.720\n you've taken this whole journey that a lot of people I think would be really inspired by.\n\n1:58:34.720 --> 1:58:40.000\n So given that, and given the fact that 20 years from now, you probably laugh at the\n\n1:58:40.000 --> 1:58:44.720\n advice you're going to give now. Absolutely. I hope so. If I don't laugh at the advice I give now,\n\n1:58:44.720 --> 1:58:51.840\n something went desperately wrong, right? Yeah. So do you have advice for people that want to\n\n1:58:51.840 --> 1:58:58.400\n follow in your footsteps and create a startup, whether it's in a software app domain or whether\n\n1:58:58.400 --> 1:59:05.280\n it's anything else. So I'll speak specifically about social media apps. Yes. Try to keep it as\n\n1:59:05.280 --> 1:59:12.000\n narrow as possible so I can laugh as little as possible when I'm 41. And what I would say is that\n\n1:59:13.120 --> 1:59:18.240\n if you're like a 21, 22 year old, who's looking at me and being like, I want to do something like\n\n1:59:18.240 --> 1:59:25.920\n this. What I would say is you probably know better than just about anyone. And if you have a feeling\n\n1:59:25.920 --> 1:59:31.120\n in yourself that this is something that I have to do, and this is something I could imagine myself\n\n1:59:31.120 --> 1:59:35.680\n doing for the next 10 years, because if you're successful, you are going to have to do it for\n\n1:59:35.680 --> 1:59:40.800\n the next 10 years. And through the ups and the downs, through the amazing interviews with Lex,\n\n1:59:40.800 --> 1:59:47.520\n and through the not so amazing articles you might have with other people, right? And you're going to\n\n1:59:47.520 --> 1:59:51.520\n have to ride those highs and lows and you have to believe in what you're doing. But if you have that\n\n1:59:51.520 --> 1:59:58.160\n feeling, what I would say is listen to as few people as possible, because people are experts\n\n1:59:58.160 --> 2:00:04.480\n in domains. But when it comes to what's hot and what makes sense in a social context,\n\n2:00:05.920 --> 2:00:12.000\n you are the authority as a young person who's going through these things and living in your\n\n2:00:12.000 --> 2:00:21.760\n sort of milieu. And I mean, I've talked to, at this point, you know, so many experts, so many\n\n2:00:21.760 --> 2:00:29.280\n investors, VCs. You'd be amazed at the advice I've gotten. Advice I've gotten.\n\n2:00:29.280 --> 2:00:32.240\n So there's like a minefield of bad advice.\n\n2:00:32.240 --> 2:00:37.680\n That's the hardest part, I think, for young people. And it's the thing, when people, like,\n\n2:00:37.680 --> 2:00:43.200\n I help Yellies all the time who ask, like, I never turn down, when a founder asks me to have a\n\n2:00:43.200 --> 2:00:48.960\n conversation, I never turn it down. I'm always there for them. And the number one thing I worry\n\n2:00:48.960 --> 2:00:55.840\n about is that at Yale, we're taught implicitly and explicitly that you listen to the adult in the\n\n2:00:55.840 --> 2:01:02.720\n room, you listen to the person with the highest, you know, pay grade. And it's devastating, because\n\n2:01:02.720 --> 2:01:10.640\n that's how innovation dies. And, you know, yeah, it's intimidating to, like, you talk to VC who\n\n2:01:10.640 --> 2:01:16.720\n probably means worth a billion dollars, a billion dollars, and they're going to tell you, you know,\n\n2:01:16.720 --> 2:01:21.600\n all the, all the successful startups they have funders or even just a successful business owner,\n\n2:01:22.800 --> 2:01:28.480\n uh, is going to tell you some advice and it's hard psychologically to think that they might be wrong.\n\n2:01:28.480 --> 2:01:31.680\n Yeah, but you're saying that's the only way you succeed.\n\n2:01:31.680 --> 2:01:35.280\n The only way you succeed, because if they knew what they were doing, they would have built it\n\n2:01:35.280 --> 2:01:41.520\n themselves. Um, and what's especially hard is people go, oh, of course, you know,\n\n2:01:42.080 --> 2:01:45.440\n I'll listen to people's, I'll listen to their advice, but I'll know why it's wrong.\n\n2:01:46.000 --> 2:01:50.240\n And then I'll, and I'll do my own thing. And that sounds great in the abstract, but sometimes you\n\n2:01:50.240 --> 2:01:54.720\n can't always even put your finger on why they're wrong. And I think to have the conviction,\n\n2:01:54.720 --> 2:02:01.680\n to say, you're wrong and I can't tell you why, but I still think I'm right. It's a rare thing,\n\n2:02:01.680 --> 2:02:07.120\n especially at like, it's very counterintuitive. And you might even say it's hubris or arrogant,\n\n2:02:07.680 --> 2:02:12.560\n but I think it's necessary because a lot of these things are, they're not things that you can really\n\n2:02:13.760 --> 2:02:19.120\n put into words until you see them in action. Like a lot of them are kind of happy accidents.\n\n2:02:19.120 --> 2:02:25.040\n Yeah. It's been, it's been tough for me, like as a, as a person who, um, like I'm very empathetic.\n\n2:02:25.040 --> 2:02:33.200\n So I, when people tell me stuff, I kind of want to understand them. And it's been a painful process,\n\n2:02:33.200 --> 2:02:38.400\n especially people close to me, basically everything I've done, and especially in the\n\n2:02:38.400 --> 2:02:45.040\n recent few years, a lot of people close to me said not to do, you know, and, uh, like,\n\n2:02:45.040 --> 2:02:54.400\n my parents too, that's been a hard one is, is to basically acknowledge to myself that you don't know,\n\n2:02:55.440 --> 2:03:03.040\n like, you, you don't, that everything you're going to say by way of advice for me is not going to be\n\n2:03:03.040 --> 2:03:10.160\n helpful. Like, I love my parents very much, but like, they're just like, they don't get it.\n\n2:03:10.160 --> 2:03:16.480\n And, and as you put it beautifully, it's very difficult to put your finger on exactly why,\n\n2:03:17.440 --> 2:03:23.440\n because, uh, a lot of advice sounds reasonable. That's the worst kind. Yeah.\n\n2:03:25.440 --> 2:03:31.280\n Uh, if it, if it sounds really good, that just means it's an earworm. Like, that's like a song\n\n2:03:31.280 --> 2:03:35.040\n that you hear on the radio and then you're like, you're humming it in the car and it's like,\n\n2:03:35.040 --> 2:03:41.920\n it's the same thing. The more, the better it sounds, the more skeptical. Yeah. Reason is a,\n\n2:03:41.920 --> 2:03:47.920\n is a bad drug. Like, should be very careful because, like, you know, the things that seem\n\n2:03:47.920 --> 2:03:55.440\n impossible, every, every major innovation, every major business seems impossible at birth. But\n\n2:03:55.440 --> 2:03:59.760\n even not just the impossible things, I think, you know, you look at like love, for example,\n\n2:03:59.760 --> 2:04:07.760\n it's very easy to give advice, to sort of point out all the ways you can go wrong or marriage,\n\n2:04:07.760 --> 2:04:13.840\n all the divorces that people go through, all the pain of years that you go through the divorce,\n\n2:04:13.840 --> 2:04:19.280\n like the system of marriage, the marriage industrial complex, all the money that's wasted,\n\n2:04:19.280 --> 2:04:24.640\n all those kinds of things. But that advice is useless when you're in love. I guess the best\n\n2:04:24.640 --> 2:04:30.320\n the point is to just pat the person on the back and say, go get him, kid. Like, what is it? Good\n\n2:04:30.320 --> 2:04:39.200\n Will Hunting. I went to see about a girl. Yeah. That's a good movie. I love that movie. But yeah,\n\n2:04:39.200 --> 2:04:44.560\n that, that's, that took me a long time to figure out. I'm still trying to fight through it,\n\n2:04:44.560 --> 2:04:53.120\n but especially when you're young, that's hard. But, you know, it's, it's, it's, it's, it's, it's,\n\n2:04:53.120 --> 2:05:00.000\n but, uh, nothing in life is, uh, worth accomplishing is easy. So,\n\n2:05:00.000 --> 2:05:03.440\n but I think it's really interesting. You make that connection between like startup advice\n\n2:05:03.440 --> 2:05:09.040\n and like your parents, because it's the exact same sort of mechanism where when you're young,\n\n2:05:09.040 --> 2:05:14.560\n your parents are usually like, right. Right. And the experts are usually right. And, you know,\n\n2:05:14.560 --> 2:05:18.320\n if you listen to them and you, you, you follow their orders, you're going to go to a school\n\n2:05:18.320 --> 2:05:25.360\n like Yale and at a certain point stops making sense. And I've, I've seen my friends at Yale\n\n2:05:25.360 --> 2:05:28.960\n go down paths because they just continued listening to their parents that\n\n2:05:29.840 --> 2:05:32.960\n I know in their heart of hearts is not the right path for them.\n\n2:05:33.840 --> 2:05:42.320\n Yeah. You know what? That's how I see like the education system. The whole point is to guide you\n\n2:05:42.320 --> 2:05:51.600\n to a certain point in your life. And everybody's point is different. And your task is to,\n\n2:05:51.600 --> 2:05:57.040\n at that point, to have a personal revolution and create your own path. But no one tells you that.\n\n2:05:57.040 --> 2:06:00.800\n Nobody tells you that because they're, they want you to keep following the same path as they,\n\n2:06:00.800 --> 2:06:05.520\n they're leading you towards. Like they're not going to say your whole job is to eventually\n\n2:06:05.520 --> 2:06:11.520\n rebel. Yeah. That's how revolution, that's how rebellion works. You're not supposed to be told,\n\n2:06:11.520 --> 2:06:16.000\n but that is the task. They can take you just like you said, and depending who you are,\n\n2:06:16.720 --> 2:06:21.520\n they can take you really far. But at a certain point you have to rebel. That could be getting\n\n2:06:21.520 --> 2:06:25.760\n your PhD, that could be in your undergrad, that could be high school. Yeah. It could be any point.\n\n2:06:25.760 --> 2:06:30.480\n One thing that I think played a pretty pivotal role, and I've never really mentioned this,\n\n2:06:32.000 --> 2:06:37.120\n he might not even know the person about to tell you about, in sort of me actually going out and\n\n2:06:37.120 --> 2:06:45.200\n making Librex was that I was taking this graduate level math class, my sophomore year. And I met\n\n2:06:45.200 --> 2:06:53.200\n this, I met this PhD student who was also in it and had considerable citations and also startup\n\n2:06:53.200 --> 2:06:59.040\n experience. And I think he actually ended up being the CTO of a unicorn later on. I've sort of lost\n\n2:06:59.040 --> 2:07:06.640\n touch with him, but we're still Facebook friends as it is in the 21st century. So, and I was in a\n\n2:07:06.640 --> 2:07:10.240\n class and I was telling him, I really want to, I really want to make this thing, but I have no\n\n2:07:10.240 --> 2:07:18.400\n technical background. And he, this guy's a computer genius. He worked under Dan Spielman at Yale. So\n\n2:07:19.280 --> 2:07:23.360\n he's a good guy. Right. And we were doing some math together. We were doing something on\n\n2:07:23.360 --> 2:07:31.280\n discrepancy for those of you who really care about math. So combinatorics. And he just turns to me,\n\n2:07:31.280 --> 2:07:35.360\n he's like, I think you could do it. Like, what do you mean you think I could do? He's like,\n\n2:07:35.360 --> 2:07:40.320\n I think you could do it. And I was like, really? But I respected this guy so much.\n\n2:07:41.120 --> 2:07:46.480\n His name was Young Duck. Shout out to Young Duck. I respected this guy so much that I was like,\n\n2:07:46.480 --> 2:07:51.600\n if Young Duck says I can do it and Young Duck is a legit genius and he knows, and he knows me,\n\n2:07:52.160 --> 2:07:55.280\n because we were in two classes together and we'd spent a lot of time together.\n\n2:07:55.280 --> 2:07:59.120\n If he thinks I can do it, then who am I to say I can't do it?\n\n2:07:59.120 --> 2:08:05.360\n Yeah. You know, that's a lesson for mentorship is like, by the way, he has no idea probably.\n\n2:08:06.560 --> 2:08:10.720\n Well, he might not even remember that interaction, which is funny. But the point is\n\n2:08:11.760 --> 2:08:19.760\n that when a crazy young kid comes up to you with a crazy dream, you know, every once in a while,\n\n2:08:19.760 --> 2:08:25.440\n you should just pat him on the back and say, I believe in you. Like you can do it. If they look\n\n2:08:25.440 --> 2:08:31.920\n up to you, that means your words have power. And if you say, no, no, come on, be like reasonable,\n\n2:08:32.560 --> 2:08:39.040\n like, you know, finish your schoolwork kind of thing. Like that's, that's unreasonable to take\n\n2:08:39.040 --> 2:08:43.440\n that leap now. Just finish your education, blah, blah, blah, whatever, whatever the reasonable\n\n2:08:43.440 --> 2:08:50.080\n advice is every once in a while, maybe often as a mentor, you should say, you know, go see about a\n\n2:08:50.080 --> 2:08:56.400\n girl in California or whatever the equivalent is. That was my moment. That was my good will hunting\n\n2:08:56.400 --> 2:09:02.080\n moment. That's your good will hunting moment. Man, I miss Robin Williams. I was a special guy.\n\n2:09:03.520 --> 2:09:08.640\n People love it when I ask about book recommendations in general. Of course,\n\n2:09:08.640 --> 2:09:12.640\n your journey is just beginning. But is there something that jumps out to you? Technical,\n\n2:09:12.640 --> 2:09:18.240\n fiction, philosophical, sci fi, coloring books, blog posts you read somewhere\n\n2:09:18.240 --> 2:09:25.920\n that had an impact on your life? Video games. Video games that you recommend to others. Minecraft,\n\n2:09:26.720 --> 2:09:31.760\n manual. Manga. I mean, yeah, video, you could mention video games too,\n\n2:09:31.760 --> 2:09:35.040\n if there's something that jumps out to you that just had like an impact.\n\n2:09:36.800 --> 2:09:43.440\n I guess I'll say I really liked the book, The War of Art, which is a book about creative resistance\n\n2:09:43.440 --> 2:09:49.280\n and the creative struggle and what it means to be creative. And part of what I see in this\n\n2:09:49.280 --> 2:09:55.040\n conversation and what you're doing, Lex, is so much of The War of Art's idea is that you just\n\n2:09:55.040 --> 2:10:03.040\n keep writing and writing and writing until you get to the new crap. And you just roll with it,\n\n2:10:03.040 --> 2:10:07.840\n right? And that's sort of what happens when you have like three hour conversations with people is\n\n2:10:07.840 --> 2:10:14.320\n you can only have so much scripted or societally constructed stuff until you get to the real you.\n\n2:10:15.120 --> 2:10:18.960\n And you have to show up. I mean, that book is kind of painful.\n\n2:10:18.960 --> 2:10:22.480\n It's really painful. And it's not something I would recommend for every part of it,\n\n2:10:22.480 --> 2:10:27.280\n but for what it did in my life at the time. It also kind of normalized, I don't know,\n\n2:10:28.960 --> 2:10:35.520\n part of my coming of age story is part of it's about realizing that I'm a creative person and\n\n2:10:35.520 --> 2:10:41.760\n person who needs to create. That's sort of a God given thing, I think, for a lot of people.\n\n2:10:41.760 --> 2:10:46.240\n But it's something that I don't really feel like I can live without. And part of it was realizing\n\n2:10:46.240 --> 2:10:50.160\n that even within some of these more rigid structures, it's okay that I don't sort of\n\n2:10:50.880 --> 2:10:55.840\n fit in with them. And to hear about the struggles of other creatives was something for my own\n\n2:10:55.840 --> 2:11:01.360\n self esteem and my own growing up that was really important to me. So I don't think the book itself\n\n2:11:01.360 --> 2:11:06.160\n might be perfect, but for what it did for my life, it was really impactful.\n\n2:11:06.960 --> 2:11:13.440\n Yeah, I think exactly. The words may not be exactly right by way of advice, but I think\n\n2:11:13.440 --> 2:11:20.880\n the journey that a lot of creatives take by reading that book is kind of profound. He also\n\n2:11:20.880 --> 2:11:26.800\n has another one called Turning Pro, I think. I mean, he in general espouses like taking it\n\n2:11:26.800 --> 2:11:32.240\n seriously. If you have a creative mind and you want to create something special in this world,\n\n2:11:32.800 --> 2:11:38.320\n go do it. Don't show up. Look at that blank page.\n\n2:11:38.320 --> 2:11:45.600\n So many people would tell me, would encourage me either blatantly or through implicit means\n\n2:11:45.600 --> 2:11:53.680\n to basically take the Apple S seriously. It's a good signal, by the way. It's a good signal\n\n2:11:53.680 --> 2:11:58.160\n because my really close friends, the ones who have always supported me, they never said that\n\n2:11:58.160 --> 2:12:03.280\n because they got it. They understood that that was my path. And they might be skeptical. They might\n\n2:12:03.280 --> 2:12:09.120\n be like, I mean, one of my friends I remember told me, I was always taken aback about why you\n\n2:12:09.120 --> 2:12:14.640\n were so certain this would work out. And he's like, I finally got it once I saw it popping off,\n\n2:12:14.640 --> 2:12:20.720\n but before that, I just didn't get it. But he still supported me. And I think it's a really\n\n2:12:20.720 --> 2:12:27.120\n good signal. And actually just the fact of going through this process has made me socially feel so\n\n2:12:27.120 --> 2:12:31.840\n much more connected. And I've somewhat consolidated my social life to some degree, but it's so much\n\n2:12:31.840 --> 2:12:36.800\n more vulnerable, connected. And that's part of the creative process. I have to thank for that,\n\n2:12:36.800 --> 2:12:42.720\n I think. There's something that's unstoppable about the creative mind. It's right there,\n\n2:12:42.720 --> 2:12:49.360\n that fire. And I guess part of the thing that you're supposed to do is let that fire burn.\n\n2:12:49.360 --> 2:12:54.480\n In whichever direction. And it's going to hurt. It's going to hurt. Fire will hurt.\n\n2:12:55.360 --> 2:12:58.560\n But on the topic of video games, you mentioned the Stanley Parable offline.\n\n2:13:00.640 --> 2:13:04.720\n You said you played some video games. Is there a video game that you especially love that you\n\n2:13:04.720 --> 2:13:10.880\n recommend I play, for example? Yeah, I'll mention. It's actually really in keeping with what we've\n\n2:13:10.880 --> 2:13:16.560\n been talking about. It's the Beginner's Guide, which was made by the same guy, Davey Rendon,\n\n2:13:16.560 --> 2:13:22.480\n who made the Stanley Parable, which I briefly saw you. I just clicked the video and then I went to\n\n2:13:22.480 --> 2:13:32.480\n sleep. It was like 2 a.m. But I briefly saw that you were looking at. And it's a game that is\n\n2:13:32.480 --> 2:13:40.000\n better treated as art. And I think I won't claim to understand the creator, because that would be\n\n2:13:40.000 --> 2:13:48.640\n a cardinal sin to me as a creative person. But it gets to the heart of a lot of the things that\n\n2:13:49.840 --> 2:13:54.960\n we've been talking about, which is the creative mind. The game can be interpreted in a lot of\n\n2:13:54.960 --> 2:14:00.880\n ways in a feminist way. It could be interpreted as a story of friends. It could be interpreted\n\n2:14:01.520 --> 2:14:07.520\n as the story of critics versus a creative. The way I like to interpret it, and I don't want to\n\n2:14:07.520 --> 2:14:16.240\n give away too much, is the story of the creative part of your mind that creates just for the sake\n\n2:14:16.240 --> 2:14:24.560\n of creating. Meaning the part that creates for no rhyme or reason or clear meaning. It's almost\n\n2:14:24.560 --> 2:14:32.080\n ethereal. Versus the part that's, you could call it the editor. You could call it the pragmatist.\n\n2:14:32.080 --> 2:14:38.640\n You could call it the necessary force of ego in our lives. We can't totally be egoless, right?\n\n2:14:38.640 --> 2:14:45.360\n But we need to be egoless to be creative. And how that sort of internal censure, what role does it\n\n2:14:45.360 --> 2:14:50.560\n play? And how do we allow our creative minds to be creative? And yet, how do we still become useful?\n\n2:14:52.960 --> 2:14:55.760\n And it's funny that a video game could have this in.\n\n2:14:55.760 --> 2:15:02.480\n It's a fascinating tension, which reminds me about the ridiculous question that every once in a while\n\n2:15:02.480 --> 2:15:11.280\n asks about meaning and death. So, this whole ride ends. You're at the beginning of the ride,\n\n2:15:11.280 --> 2:15:17.360\n but it could end any day, actually. That's kind of the way human life works. You could die today,\n\n2:15:17.360 --> 2:15:22.000\n you could die tomorrow. Do you think about your mortality? Do you think about death?\n\n2:15:22.000 --> 2:15:29.600\n Do you meditate on it? And in that context, as the creative, but a pragmatist, too,\n\n2:15:29.600 --> 2:15:33.840\n as running a startup, what do you think is the meaning of this whole thing?\n\n2:15:35.840 --> 2:15:46.880\n Yeah, so, on mortality, right? About three years ago, four years ago now, I was excited to go to\n\n2:15:46.880 --> 2:15:53.360\n Yale. I was playing six hours of squash a day, which squash is a sport I love so much. And I was\n\n2:15:53.360 --> 2:15:58.480\n really getting a lot better. And I was even thinking I could maybe walk onto the Yale team.\n\n2:16:00.960 --> 2:16:11.280\n And I woke up one day, I felt really, really sick. I went and I decided not to go squash that day.\n\n2:16:11.280 --> 2:16:20.640\n I wanted to, I almost did. And you'll see how this story turns out. You'll decide if I made the right\n\n2:16:20.640 --> 2:16:25.840\n choice. I decided not to go squash today. And I decided to get my driver's license, or I had to\n\n2:16:25.840 --> 2:16:31.440\n get my driver's license because I wanted to get a driver's license before I went off to college,\n\n2:16:31.440 --> 2:16:35.840\n because otherwise I might never get it. And I'm going back and I successfully got my driver's\n\n2:16:35.840 --> 2:16:44.160\n license for Hashem. And I go back to my house and I decided I don't want to drive back because I\n\n2:16:44.160 --> 2:16:50.160\n just feel so sick. Like things are spinning. I have the worst headache. I come home, I run back\n\n2:16:50.160 --> 2:16:55.840\n right into my bed and feeling really sick to the point where I even like asked my mom who is a\n\n2:16:55.840 --> 2:17:00.160\n doctor, I'm like, should I go to the hospital? And she's like, you can just wait it out and\n\n2:17:00.160 --> 2:17:08.320\n she'll get better. And then, you know, and then at one point I look at my arms and they're like\n\n2:17:08.320 --> 2:17:14.240\n covered in this like red splotchy stuff. Yeah. And I'm like, mom, I think. And she's like, yeah,\n\n2:17:14.240 --> 2:17:20.160\n we have to go. And so I go there and they're like, you have scarlet fever. And they're like,\n\n2:17:20.160 --> 2:17:24.320\n there's nothing we can do. You should probably just go back home. So I go back home. Six hours\n\n2:17:24.320 --> 2:17:30.880\n later I wake up in the morning. They'd let me out at like 3 a.m. They let me, I come home in\n\n2:17:30.880 --> 2:17:37.440\n the morning and I feel this, like a spear through my chest. And I never felt anything like it. And\n\n2:17:37.440 --> 2:17:41.280\n I was, it was very disconcerting when you have a, cause we're all used to different sorts of pain,\n\n2:17:41.280 --> 2:17:46.240\n right? And that was the sort of pain I never felt before. As far as an athlete, you're used to like,\n\n2:17:46.240 --> 2:17:51.280\n you know, pain. So I told my parents and immediately we hop back in the car. We go up\n\n2:17:51.280 --> 2:17:55.600\n to the same hospital I was at six hours ago. And they initially didn't want to let me in. And I\n\n2:17:55.600 --> 2:17:58.880\n was like, I have chest pain. They're like, oh, come in. Cause they're like, you're a healthy guy,\n\n2:17:58.880 --> 2:18:02.800\n wait your turn. And I'm like, no, you don't understand. I have like a pain in my chest.\n\n2:18:02.800 --> 2:18:07.840\n And then they let me in. They start doing tests on me. They like put something like in my back,\n\n2:18:07.840 --> 2:18:12.720\n which is really scary. It's a huge needle. And I'm smiling because it's like one of the ways\n\n2:18:12.720 --> 2:18:17.280\n I reduce stress, I guess, or deal with this sort of thing and make light of it. But like,\n\n2:18:17.280 --> 2:18:22.480\n you know, that, you know, it's definitely very scary in the moment, shocking and scary.\n\n2:18:22.480 --> 2:18:28.160\n And they go and they, they do a bunch of tests and they determined that a virus like attacked\n\n2:18:28.160 --> 2:18:35.520\n my heart and I had myocarditis and pericarditis. And they said I had maybe 25 to 35% chance at\n\n2:18:35.520 --> 2:18:43.600\n one point of dying. And so I'm sitting in my, they admit me into the hospital. I'm in the bed,\n\n2:18:43.600 --> 2:18:51.680\n in my bed for about three weeks. And I'm just, I'm just standing there. And I had this moment\n\n2:18:51.680 --> 2:19:01.440\n also that I remember very specifically where I was in so much pain that like I was crying,\n\n2:19:01.440 --> 2:19:07.920\n not out of like emotional standpoint, but actually just purely out of the pain itself. Like I could\n\n2:19:07.920 --> 2:19:12.880\n feel my heart in my chest. And when I leaned back, I felt it touch my rib cage and feel horrible.\n\n2:19:12.880 --> 2:19:17.200\n So I couldn't go to sleep and lean back. I had to lean forward all throughout the night. Right.\n\n2:19:17.200 --> 2:19:21.520\n And I'm feeling my, and I'm feeling my chest. I'm feeling this terrible pain in my chest.\n\n2:19:21.520 --> 2:19:28.080\n I'm crying unstoppably. And I mean, also maybe I should mention that at the time I was someone\n\n2:19:28.080 --> 2:19:33.600\n who like refused to take in anything into my body that wasn't natural. And so a lot of the time I,\n\n2:19:33.600 --> 2:19:40.160\n I tried to be unmedicated. Eventually I didn't allow them to add a little medication to my body,\n\n2:19:40.160 --> 2:19:46.560\n but there's just so much uncertainty and pain. And the first time I had to come to terms with\n\n2:19:46.560 --> 2:19:52.080\n mortality. First of all, I think you still should have gone and played squash. I mean, come on.\n\n2:19:52.080 --> 2:19:58.640\n I mean, yeah. I thought you're serious about this. You still carry that with you sort of.\n\n2:20:01.440 --> 2:20:08.960\n There is power to realizing the ride can end. Right. Very suddenly. Very suddenly. Yeah.\n\n2:20:08.960 --> 2:20:16.720\n And painfully. And, you know, it, it has pragmatic application to like what you,\n\n2:20:16.720 --> 2:20:19.280\n to trajectories you take through life. Right.\n\n2:20:19.280 --> 2:20:27.120\n Something else that is worth noting is that I, for the next year, couldn't walk to my classes.\n\n2:20:27.840 --> 2:20:35.280\n So I get to Yale, they put me in a medical single alone, and I have to get shuttled to all my\n\n2:20:35.280 --> 2:20:39.120\n classes. I have to ask, I had to ask a few professors to even move classes so I could\n\n2:20:39.120 --> 2:20:46.080\n actually get there. I can't move my book. I can't lift my book bags. I can't, I can't walk upstairs.\n\n2:20:48.080 --> 2:20:55.440\n I spent like 12 hours a day in my dorm room, just like staring at the walls and more so. And more\n\n2:20:55.440 --> 2:21:05.520\n than that, all this, like, you, I got to watch my body, like, deteriorate and like the muscle,\n\n2:21:05.520 --> 2:21:11.680\n like fall off of it. Cause I was, I was taking these pills and they're kind of catabolic. And\n\n2:21:11.680 --> 2:21:18.960\n for an 18 year old, I mean, I think every 18 year old has feelings about their body, man or woman.\n\n2:21:18.960 --> 2:21:24.720\n And, you know, just seeing this, it's like, you're watching sort of death transpire. And it's like,\n\n2:21:24.720 --> 2:21:30.640\n and you're also very fatigued because your heart's not at peak condition. And you're thinking about\n\n2:21:30.640 --> 2:21:34.240\n the future and a lot of the things you enjoy have kind of been stripped away from you.\n\n2:21:35.520 --> 2:21:43.360\n And I took up a meditation practice, like started with like five minutes a day. At my peak, I was at\n\n2:21:43.360 --> 2:21:50.240\n like 40 minutes a day, kept it up consistently for about two years. And I started thinking about,\n\n2:21:50.240 --> 2:21:57.600\n like, what do I want to do? And like, what do I care about? And to get to your point,\n\n2:21:57.600 --> 2:22:05.440\n I think you were asking, like, how does this carry forward? Right? I think I realized that,\n\n2:22:05.440 --> 2:22:10.480\n you know, there's an end and I realized that there are things I believe and things that I believe\n\n2:22:10.480 --> 2:22:15.520\n that might not be so overtly popular, but that I truly think make the world a better place.\n\n2:22:15.520 --> 2:22:21.920\n And in spite of, and then basically, if my conditions provided, I wanted to make something\n\n2:22:21.920 --> 2:22:27.280\n that I wanted to do something that would make me feel sort of whole in that way.\n\n2:22:28.080 --> 2:22:31.920\n Yeah. I mean, that's an amazing journey to take that time and to come out on the other end.\n\n2:22:33.280 --> 2:22:37.920\n Now, man, that's amazing. I did not realize like that there was a long term struggle.\n\n2:22:37.920 --> 2:22:45.280\n I think that's in the end, if you do succeed, will have a profound positive impact because\n\n2:22:45.280 --> 2:22:53.600\n struggle is ultimately like humbling, but also empowering. So I'm glad to see that. But from the\n\n2:22:53.600 --> 2:22:58.240\n perspective of the creator of the other ridiculous question about meaning, do you think about this\n\n2:22:58.240 --> 2:23:08.800\n kind of stuff? Is that the, you know, the meaning of life for you, the meaning of life for us,\n\n2:23:08.800 --> 2:23:13.760\n descendants of apes in general? The first thing I'd like to say is that I think part of like,\n\n2:23:13.760 --> 2:23:17.680\n when we talk about the meaning of life, the part of it is the fact that we get to struggle with\n\n2:23:17.680 --> 2:23:25.200\n this question and we get to do it together for a long time. And we sometimes, I think,\n\n2:23:25.200 --> 2:23:28.800\n it's accepting that there's no meaning at all. And sometimes I think it's accepting that,\n\n2:23:29.840 --> 2:23:34.080\n or even just parsing the phrase and thinking about the meaning of life. I sometimes I'm,\n\n2:23:34.080 --> 2:23:41.120\n look, I'm very young. Again, I hope that anything I say now is going to be very different in the\n\n2:23:41.120 --> 2:23:49.040\n future because I think life has so many meanings that it'll be crazy to see what I think in 20\n\n2:23:49.040 --> 2:23:50.400\n years about the meaning of life.\n\n2:23:50.400 --> 2:23:57.040\n Yeah, rise from the future, cut them some slack.\n\n2:23:57.040 --> 2:24:05.120\n Please do. Perspective, perspective, perspective. Having said that, you know, I think part of what\n\n2:24:05.120 --> 2:24:09.040\n brings meaning to my life is things like this, where we think about these things with people\n\n2:24:09.040 --> 2:24:14.000\n who are really, really, really on the ball, and we get to connect with these people.\n\n2:24:14.800 --> 2:24:17.200\n That certainly brings meaning to my life, human connection.\n\n2:24:17.200 --> 2:24:23.600\n Yeah, this conversation is just another, like, echo of the thing you're trying to create\n\n2:24:24.240 --> 2:24:30.720\n in a digital space, right? That's the same kind of magic. From what I understand about what you're\n\n2:24:30.720 --> 2:24:36.240\n trying to create is the same reason I fell in love with the long form podcasting, like as a fan.\n\n2:24:36.240 --> 2:24:42.400\n That's why I listen to long form podcasts. Is there something deeply human and genuine\n\n2:24:42.400 --> 2:24:49.040\n about the interchange through their voice? But I do think that connection through text can be\n\n2:24:49.680 --> 2:24:55.280\n even more powerful. Like I think about letters. I still write letters to Russia. You know,\n\n2:24:55.280 --> 2:25:03.360\n there's something powerful in letters. When you put a lot of yourself in the words you say,\n\n2:25:03.360 --> 2:25:10.480\n in the words you write, that's powerful. You can really communicate, not just the actual semantic\n\n2:25:10.480 --> 2:25:18.160\n meaning of the words, but like a lot of who you are through those words and create real connection.\n\n2:25:18.160 --> 2:25:26.960\n So I hope you succeed there. And listen, Ryan, I think this is an incredible conversation. I'm\n\n2:25:26.960 --> 2:25:33.760\n glad that people like you are fighting the good fight for bringing out the best in human nature\n\n2:25:33.760 --> 2:25:40.800\n in the digital space. I think that's a battleground where the good will win, like love will win. And\n\n2:25:40.800 --> 2:25:45.680\n I'm glad you're creating technology that does just that. So thank you so much for wasting all\n\n2:25:45.680 --> 2:25:50.400\n your time for coming down. I can't wait to see what you do in the future. Thanks for talking today.\n\n2:25:50.400 --> 2:25:56.560\n Thank you for having me. Bam. How many finger guns have you gotten at the end of the podcast?\n\n2:25:56.560 --> 2:26:04.720\n Zero. Two now. Thanks for listening to this conversation with Ryan Shiller. And thank you\n\n2:26:04.720 --> 2:26:12.080\n to our sponsors, Allform, Magic Spoon, BetterHelp, and Brave. Click their links to support this\n\n2:26:12.080 --> 2:26:20.960\n podcast. And now let me leave you with some words from George Washington on March 15, 1783.\n\n2:26:20.960 --> 2:26:28.640\n If freedom of speech is taken away, then dumb and silent we may be led like sheep to the slaughter.\n\n2:26:28.640 --> 2:26:50.640\n Thank you for listening and hope to see you next time.\n\n"
}