{
  "title": "David Wolpe: Judaism | Lex Fridman Podcast #270",
  "id": "urdNsyZBqhQ",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.040\n The following is a conversation with Rabbi David Wolpe, someone who I have been a fan\n\n00:05.040 --> 00:10.240\n of for many years, for the kindness in his heart, the strength of his character, and\n\n00:10.240 --> 00:15.280\n the kind of friends he keeps and talks with, many of whom disagree with him but love him\n\n00:15.280 --> 00:20.440\n nevertheless, including the late Christopher Hitchens.\n\n00:20.440 --> 00:25.840\n I will have many conversations like these in the future about religion, about Islam,\n\n00:25.840 --> 00:31.320\n Christianity, Judaism, Hinduism, Buddhism, and others, looking to understand and celebrate\n\n00:31.320 --> 00:36.600\n the culture, the tradition, and the beauty of the people who practice these religions.\n\n00:36.600 --> 00:39.840\n I will of course not shy away from the difficult topics.\n\n00:39.840 --> 00:46.400\n I will talk both about hate and love, about war and peace.\n\n00:46.400 --> 00:50.080\n This conversation was recorded more than three weeks ago.\n\n00:50.080 --> 00:54.640\n Please allow me this time to speak on what has been on my mind.\n\n00:54.640 --> 01:00.000\n If this is not interesting to you, please skip, I totally understand.\n\n01:00.000 --> 01:04.320\n Some people asked me to say a few words on the war in Ukraine.\n\n01:04.320 --> 01:09.820\n I think my words are worth little, but perhaps let me try.\n\n01:09.820 --> 01:13.320\n I considered doing a long solo episode on this war.\n\n01:13.320 --> 01:18.120\n I tried several times, but it is too personal for now.\n\n01:18.120 --> 01:23.680\n To give you context, I've been talking to refugees, friends, loved ones, in Ukraine,\n\n01:23.680 --> 01:30.520\n in Russia, in Poland, Slovakia, Moldova, Romania, even UK, Germany, Canada, India, China, and\n\n01:30.520 --> 01:33.720\n of course the United States.\n\n01:33.720 --> 01:40.560\n Some of them crying, or angry, or confused, or scared.\n\n01:40.560 --> 01:46.060\n I'm helping as best as I can privately, and I'm hoping to help in the future by traveling\n\n01:46.060 --> 01:51.640\n to Ukraine and Russia and celebrating the humanity and the beauty of the people in this\n\n01:51.640 --> 01:53.060\n region.\n\n01:53.060 --> 01:59.640\n This was all set up both for Ukraine and Russia trips before 2022, including conversations\n\n01:59.640 --> 02:07.880\n with scientists, artists, athletes, leaders, and just, quote, regular folks, who are equally\n\n02:07.880 --> 02:10.560\n if not more fascinating to me.\n\n02:10.560 --> 02:16.400\n For now, it has become much more difficult, but I'll keep trying to find a way.\n\n02:16.400 --> 02:18.680\n I was born in the Soviet Union.\n\n02:18.680 --> 02:22.040\n My roots are both Ukrainian and Russian.\n\n02:22.040 --> 02:26.920\n From today and until the day I die, I am an American.\n\n02:26.920 --> 02:29.240\n I'm proud of all of this.\n\n02:29.240 --> 02:33.120\n I hope to keep celebrating the culture and the incredible human beings that make up these\n\n02:33.120 --> 02:36.300\n nations and humanity as a whole.\n\n02:36.300 --> 02:37.300\n We're all one people.\n\n02:37.300 --> 02:38.880\n We're in this together.\n\n02:38.880 --> 02:42.480\n That's how I feel about the people of these nations.\n\n02:42.480 --> 02:47.640\n Now let me speak about those in the seats of power.\n\n02:47.640 --> 02:53.880\n I condemn all actions of leaders who play geopolitical games on the world stage disregarding\n\n02:53.880 --> 02:59.240\n the costs paid in human suffering on the scale of millions.\n\n02:59.240 --> 03:05.200\n For this reason, I condemn Vladimir Putin's invasion of Ukraine.\n\n03:05.200 --> 03:11.680\n And I condemn many of the military interventions by the superpowers of the world, including\n\n03:11.680 --> 03:19.000\n by my country, the country I love, the United States, that after World War II has intervened\n\n03:19.000 --> 03:24.780\n in over 40 nations with many studies finding that the United States is culpable for an\n\n03:24.780 --> 03:28.480\n unfathomable number of civilian deaths.\n\n03:28.480 --> 03:35.320\n I condemn all heads of state who needlessly wage wars, watching young men and women burn\n\n03:35.320 --> 03:37.680\n in the fires they started.\n\n03:37.680 --> 03:43.360\n I don't understand how humans can be so cruel to each other, or rather I understand, but\n\n03:43.360 --> 03:47.600\n I believe in a future world where this is no longer true.\n\n03:47.600 --> 03:53.080\n Let me also say a few words of what I hope to do with this podcast.\n\n03:53.080 --> 03:56.960\n I want to explore the full complexity and beauty of human nature.\n\n03:56.960 --> 04:02.780\n I believe each of us are capable of good and evil, and I want to understand how the mind\n\n04:02.780 --> 04:08.600\n and the circumstance lead one to choose the former path or the latter.\n\n04:08.600 --> 04:13.380\n And I believe conversation is one of the best ways to work toward this understanding.\n\n04:13.380 --> 04:18.200\n For that, I think I have to not only talk to the most inspiring humans in the world,\n\n04:18.200 --> 04:20.840\n but also to the most controversial.\n\n04:20.840 --> 04:26.960\n I will speak with many people who I disagree with, politicians, activists, CEOs, heads\n\n04:26.960 --> 04:31.160\n of state, with very different opinions on the world.\n\n04:31.160 --> 04:37.040\n I will try hard to challenge their ideas without closing my mind to the depth and complexity\n\n04:37.040 --> 04:40.980\n of their perspective and their humanity.\n\n04:40.980 --> 04:46.640\n My presence in the same room with wildly different people will make it easy for the media and\n\n04:46.640 --> 04:51.920\n the internet to pick and choose clips and snapshots attacking me for being a shill for\n\n04:51.920 --> 04:54.080\n one side or the other.\n\n04:54.080 --> 04:59.360\n I can't defend this point, except to say that I'm a shill for no one, and that I\n\n04:59.360 --> 05:04.120\n hope you see the strength of my integrity, that I won't be influenced by any of them\n\n05:04.120 --> 05:08.560\n no matter how rich, powerful, or charismatic they are.\n\n05:08.560 --> 05:14.960\n Like the poem If by Roger Kipling says, if you can talk with crowds and keep your virtue,\n\n05:14.960 --> 05:20.240\n or walk with kings, nor lose the common touch, if neither foes nor loving friends can hurt\n\n05:20.240 --> 05:25.660\n you, if all men count with you, but none too much.\n\n05:25.660 --> 05:30.980\n This is a really, really important thing to me that I try to live by, that all human beings\n\n05:30.980 --> 05:32.920\n count with me the same.\n\n05:32.920 --> 05:36.920\n People have criticized me for wanting to have some of these conversations, like with Vladimir\n\n05:36.920 --> 05:43.340\n Putin and Vladimir Zelensky, and for times in the past speaking about them without the\n\n05:43.340 --> 05:45.640\n seriousness the topic deserves.\n\n05:45.640 --> 05:49.360\n For this, I would sincerely like to apologize.\n\n05:49.360 --> 05:54.200\n I'm disappointed, even ashamed, of my frequent ineloquence on these topics.\n\n05:54.200 --> 05:57.100\n I will work hard to do better.\n\n05:57.100 --> 06:02.880\n When I'm joking, it should be clear that it's a joke, and hopefully actually funny.\n\n06:02.880 --> 06:07.320\n When I'm being serious, I should speak with care and rigor.\n\n06:07.320 --> 06:11.000\n I've now done many hundreds of hours of podcast conversation.\n\n06:11.000 --> 06:15.440\n Despite my frequent failures in speaking, I hope you know where my heart is.\n\n06:15.440 --> 06:20.220\n Unfortunately, I think people will take clips of me and use them to attack me.\n\n06:20.220 --> 06:21.880\n This will happen more and more.\n\n06:21.880 --> 06:26.600\n I guess there's nothing I can do but send them my love, and in the meantime, try to\n\n06:26.600 --> 06:29.160\n be a better person and a better interviewer.\n\n06:29.160 --> 06:34.760\n Let me also say that I like humor, especially dark humor.\n\n06:34.760 --> 06:38.040\n I like being silly and not taking myself seriously.\n\n06:38.040 --> 06:44.180\n I will keep taking risks with that, all with the goal of having fun and celebrating humanity\n\n06:44.180 --> 06:46.960\n at its most absurd and most beautiful.\n\n06:46.960 --> 06:52.720\n I will occasionally dress up in strange and weird outfits to celebrate the absurdity of\n\n06:52.720 --> 06:53.720\n life.\n\n06:53.720 --> 06:57.440\n I will hang out, break bread, and joke with all kinds of people.\n\n06:57.440 --> 07:01.520\n I don't have to agree with them to laugh with them, in order to escape for a brief\n\n07:01.520 --> 07:05.480\n moment the tension, the conflict, the hatred in the world.\n\n07:05.480 --> 07:10.840\n Humor just might save this little chaotic little civilization of ours.\n\n07:10.840 --> 07:12.980\n I love the Ukrainian people.\n\n07:12.980 --> 07:15.080\n I love the Russian people.\n\n07:15.080 --> 07:21.320\n And of course, I love my fellow Americans, Californians and Midwesterners, New Yorkers\n\n07:21.320 --> 07:22.600\n and Texans.\n\n07:22.600 --> 07:23.880\n I love humans.\n\n07:23.880 --> 07:24.880\n I love life.\n\n07:24.880 --> 07:28.040\n And I want to share that love with others.\n\n07:28.040 --> 07:29.040\n With you.\n\n07:29.040 --> 07:32.040\n If I mess it up, I'm really, really sorry.\n\n07:32.040 --> 07:33.040\n I'm trying my best.\n\n07:33.040 --> 07:36.160\n I have no agenda and no one telling me what to do.\n\n07:36.160 --> 07:40.480\n I feel like the luckiest guy in the world to have all these opportunities, and I'm\n\n07:40.480 --> 07:46.560\n deeply grateful to be alive and to share that joy with other amazing people around me.\n\n07:46.560 --> 07:48.040\n Thank you for your support.\n\n07:48.040 --> 07:53.120\n For all the love you've sent my way, I will work my ass off to not disappoint you.\n\n07:53.120 --> 07:55.520\n I love you all.\n\n07:55.520 --> 07:57.600\n This is the Lex Friedman Podcast.\n\n07:57.600 --> 08:01.080\n To support it, please check out our sponsors in the description.\n\n08:01.080 --> 08:06.080\n And now, here's my conversation with David Welby.\n\n08:06.080 --> 08:07.760\n Let's start with a big question.\n\n08:07.760 --> 08:10.820\n According to Judaism, who is God?\n\n08:10.820 --> 08:17.880\n It's difficult because Judaism, like any tradition that is thousands of years old and encompasses\n\n08:17.880 --> 08:23.460\n so many different lands and languages and thinkers, it doesn't give a single answer\n\n08:23.460 --> 08:25.160\n to even simple questions.\n\n08:25.160 --> 08:28.400\n And to large questions, it certainly doesn't give a single answer.\n\n08:28.400 --> 08:33.400\n Although Judaism was responsible for introducing the monotheistic idea to the world, it doesn't\n\n08:33.400 --> 08:35.600\n mean that it's one idea.\n\n08:35.600 --> 08:43.040\n So if you take Maimonides, the greatest sage in the Jewish tradition, a medieval philosopher,\n\n08:43.040 --> 08:49.280\n he would say that God is an omnipotent, benevolent, intangible, unimaginable God.\n\n08:49.280 --> 08:53.900\n In fact, he said, you can't say what God is, only what God is not, because you have\n\n08:53.900 --> 08:59.200\n to emphasize, could talk more about that, but basically you have to emphasize the unknowability\n\n08:59.200 --> 09:00.840\n of God.\n\n09:00.840 --> 09:05.040\n You have a modern philosopher like Heschel, who says that God is a God of pathos, a God\n\n09:05.040 --> 09:12.880\n of deep feeling, which probably would make Maimonides shiver if he heard such a description.\n\n09:12.880 --> 09:19.080\n And if you look in the Bible, God is always regretting or having human emotions.\n\n09:19.080 --> 09:24.720\n So there are so many different kinds of depictions and ideas, and there is this tremendous tension\n\n09:24.720 --> 09:27.960\n between transcendence and imminence.\n\n09:27.960 --> 09:33.920\n That is, in the Jewish tradition, God is exquisitely close, God is imminent.\n\n09:33.920 --> 09:38.600\n In the Talmud's words, God is as close as your mouth is to your ear.\n\n09:38.600 --> 09:40.880\n In other words, whatever you say, God hears it.\n\n09:40.880 --> 09:45.500\n And yet at the same time, God is unfathomably distant.\n\n09:45.500 --> 09:50.420\n Sometimes when I speak to high schoolers, I will say, in the Jewish tradition, think\n\n09:50.420 --> 09:52.140\n of it this way.\n\n09:52.140 --> 09:56.500\n When you were two years old, you had no idea what it was to be a 15 year old.\n\n09:56.500 --> 10:02.280\n Not only did you not know, but you didn't know what you didn't know.\n\n10:02.280 --> 10:07.120\n We conceive of God as being more, the distance between God and human beings is far greater\n\n10:07.120 --> 10:10.080\n than the distance between a two year old and a 15 year old.\n\n10:10.080 --> 10:15.300\n So when we speak about God, we have to acknowledge how limited we really are.\n\n10:15.300 --> 10:18.240\n So okay, you laid out a lot of fascinating things on the table.\n\n10:18.240 --> 10:27.440\n So one, the nobility of God, then this idea of deep feeling, which again, can God operate\n\n10:27.440 --> 10:33.480\n in the space of feelings too, so not just the mouth and the ear of the senses, can God\n\n10:33.480 --> 10:35.480\n be known?\n\n10:35.480 --> 10:44.240\n Can God be felt by this three year old in the analogy versus the teenager?\n\n10:44.240 --> 10:49.200\n So I will take refuge in a beautiful phrase from Martin Buber, another Jewish theologian.\n\n10:49.200 --> 10:53.000\n He said, God cannot be expressed, God can only be addressed.\n\n10:53.000 --> 10:59.080\n In other words, you can speak to God, you can feel a sense of God, but can you begin\n\n10:59.080 --> 11:01.240\n to comprehend or know God?\n\n11:01.240 --> 11:02.240\n No.\n\n11:02.240 --> 11:07.800\n Yosef Kaspi, I'm pulling in a couple of early Jewish philosophers, he said, to know God,\n\n11:07.800 --> 11:08.800\n I would have to be God.\n\n11:08.800 --> 11:12.120\n But can we get close?\n\n11:12.120 --> 11:20.720\n Is it useful or is it a distraction to visualize things, to embody, to create, to attach to\n\n11:20.720 --> 11:24.800\n the stories some kind of visualizations in our mind?\n\n11:24.800 --> 11:31.520\n For example, gender, he versus she, things like this, or old man in the sky kind of feeling.\n\n11:31.520 --> 11:36.440\n So it's almost inevitable, but I think ultimately you try to transcend it.\n\n11:36.440 --> 11:43.160\n This was the great, we just read this actually in synagogue, the story of the golden calf.\n\n11:43.160 --> 11:51.800\n And the story is that human beings found it impossible to not have a visualization because\n\n11:51.800 --> 11:58.080\n they had just come from Egypt and in the world of pagan worship, everything is...\n\n11:58.080 --> 12:02.700\n It's not that pagans thought that idol was actually God, but it represented visually\n\n12:02.700 --> 12:04.560\n what God was.\n\n12:04.560 --> 12:11.120\n And along comes this idea that God is actually not capable of being visualized, which is\n\n12:11.120 --> 12:17.360\n very difficult and it stretches the bounds of human comprehension, maybe even breaks\n\n12:17.360 --> 12:18.360\n them.\n\n12:18.360 --> 12:26.120\n So would you say that the proper way to operate as a human in relation to God is humility\n\n12:26.120 --> 12:31.640\n in that you're screwed, you're not able to basically know anything, almost anything?\n\n12:31.640 --> 12:39.920\n Well, the reason that the salvation of this is that you can't, I was going to say the\n\n12:39.920 --> 12:43.360\n reason you're not screwed, but then I thought somebody might be upset at a rabbi saying\n\n12:43.360 --> 12:44.360\n that.\n\n12:44.360 --> 12:47.640\n So I didn't say it and have not said it.\n\n12:47.640 --> 12:55.240\n But the reason you're not is that you don't have to have a comprehension of God.\n\n12:55.240 --> 12:59.200\n You have to have a relationship to God and those are not the same.\n\n12:59.200 --> 13:06.600\n I mean, to draw an analogy that is not far from perfect as most analogies are, but this\n\n13:06.600 --> 13:10.480\n one especially, you have relationships with people who are mysteries to you.\n\n13:10.480 --> 13:13.500\n You're a mystery to yourself.\n\n13:13.500 --> 13:17.480\n You can live and love somebody for 50 years and they can say something that surprises\n\n13:17.480 --> 13:21.720\n you because ultimately we are trapped in here.\n\n13:21.720 --> 13:25.680\n And when a child first says I, we call that individuation.\n\n13:25.680 --> 13:33.800\n But what that really means is I now know that I am cut off from the minds of all other children\n\n13:33.800 --> 13:36.000\n and all other people.\n\n13:36.000 --> 13:45.640\n And so you have with God a more intimate relationship because you can believe that God is, you are\n\n13:45.640 --> 13:50.120\n known by God and you have a relationship to God despite the fact that you can't know\n\n13:50.120 --> 13:52.740\n God just as you can't know others.\n\n13:52.740 --> 13:57.240\n And some would say to have a good relationship, you want to be constantly surprised.\n\n13:57.240 --> 13:58.240\n Right.\n\n13:58.240 --> 13:59.240\n You don't want to know the thing.\n\n13:59.240 --> 14:02.440\n Well, the world, yes, the world that God created is constantly surprising.\n\n14:02.440 --> 14:06.640\n And by the way, the caveat to this, you know, when I had all these debates with Christopher\n\n14:06.640 --> 14:10.840\n Hitchens and he would always say that God is a greater tyrant than North Korea because\n\n14:10.840 --> 14:13.000\n it continues after your death.\n\n14:13.000 --> 14:17.560\n And the idea of being known by God is after all frightening if you think God knows what\n\n14:17.560 --> 14:22.400\n I think and so on, if your image of God is unloving.\n\n14:22.400 --> 14:23.900\n Can we jump to this?\n\n14:23.900 --> 14:28.800\n You had friendships and conversations with a lot of the fascinating figures of the past\n\n14:28.800 --> 14:36.120\n 20, 30 years of the great intellectuals, one of which perhaps one of the greats is Christopher\n\n14:36.120 --> 14:37.240\n Hitchens.\n\n14:37.240 --> 14:42.320\n What have you learned from your conversation, your friendship?\n\n14:42.320 --> 14:47.560\n So there are a lot of views he held that I really did not agree with, but he was a remarkable\n\n14:47.560 --> 14:48.560\n person.\n\n14:48.560 --> 14:49.560\n That was a good line about North Korea.\n\n14:49.560 --> 14:51.280\n He was full of incredibly good lines.\n\n14:51.280 --> 14:54.440\n Well, one of the things I learned was you can't win a debate with Christopher Hitchens.\n\n14:54.440 --> 14:59.760\n One of the reasons you can't win is because he has this British baritone and this ready\n\n14:59.760 --> 15:06.480\n wit that you can't triumph over laughter.\n\n15:06.480 --> 15:10.120\n It doesn't matter if your argument is better, if your quip is better, you win.\n\n15:10.120 --> 15:14.960\n And so I remember once we were arguing about free will and he said, well, I choose to believe\n\n15:14.960 --> 15:15.960\n in it.\n\n15:15.960 --> 15:20.080\n And everybody laughed and that was despite the fact that that's not really an argument.\n\n15:20.080 --> 15:24.320\n Or like I have free will because I don't have a choice or whatever.\n\n15:24.320 --> 15:25.320\n Exactly.\n\n15:25.320 --> 15:26.520\n And people should watch your conversation with him.\n\n15:26.520 --> 15:27.520\n It's great.\n\n15:27.520 --> 15:35.160\n I mean, it's a kind of David versus Goliath situation and you're quite masterful at using\n\n15:35.160 --> 15:37.520\n charisma and sweet talking Christopher Hitchens.\n\n15:37.520 --> 15:39.640\n I also genuinely liked him.\n\n15:39.640 --> 15:47.680\n I mean, I spent a three hour limousine ride with him from one debate to another, from\n\n15:47.680 --> 15:49.880\n LA to San Diego.\n\n15:49.880 --> 15:53.600\n And the entire time he said, we just can't talk about religion.\n\n15:53.600 --> 15:59.160\n So we talked about literature and he gave me a long lecture about scotch.\n\n15:59.160 --> 16:02.040\n He was inexhaustible.\n\n16:02.040 --> 16:06.640\n I mean, not only did he, I began, I wrote a couple of obituaries about him and one I\n\n16:06.640 --> 16:12.880\n began with the historian Keith Thomas said, there are two ways of achieving immortality\n\n16:12.880 --> 16:16.300\n by doing things worth remembering or saying things worth remembering.\n\n16:16.300 --> 16:17.960\n And by that standard, he did both.\n\n16:17.960 --> 16:21.540\n I mean, he went all around the world to all sorts of danger zones.\n\n16:21.540 --> 16:28.280\n He knew like the best bars everywhere from Kuala Lumpur, you know, to Beirut, to LA.\n\n16:28.280 --> 16:35.400\n And he could drink all night and write a 2000 word essay on the poetry of Yates and go to\n\n16:35.400 --> 16:36.400\n sleep.\n\n16:36.400 --> 16:41.320\n I remember before one of our debates in Boston, he was at the bar and he said, come have a\n\n16:41.320 --> 16:42.320\n drink.\n\n16:42.320 --> 16:44.960\n And I said, I'm not going to have a drink before I go to debate with you.\n\n16:44.960 --> 16:45.960\n What are you crazy?\n\n16:45.960 --> 16:49.520\n And he said, just have a beer, it's water.\n\n16:49.520 --> 16:59.000\n So he was, he really was a constant, inexhaustible fountain of intrigue and interest.\n\n16:59.000 --> 17:04.160\n What kind of things, if you can remember, if you can mention, if you can admit, to have\n\n17:04.160 --> 17:10.000\n him enlightening you or helping you change your mind about something in this world.\n\n17:10.000 --> 17:15.280\n So I think, unrelated to Scotch, yeah, unrelated to Scotch.\n\n17:15.280 --> 17:23.720\n He convinced me that the idea, I mean, I had my doubts about it and have my doubts about\n\n17:23.720 --> 17:27.680\n it, but he convinced me through many debates and not only he, that the idea that religion\n\n17:27.680 --> 17:36.080\n makes people better is not, it's not ipso facto wrong, but it's a much, much more complicated\n\n17:36.080 --> 17:39.760\n argument than I wished it to be.\n\n17:39.760 --> 17:47.440\n So he is, however you conceive of the term beauty, he's one of those, one of the more\n\n17:47.440 --> 17:53.340\n beautiful humans, this weird little earth produced.\n\n17:53.340 --> 18:00.460\n So how do you explain the atheism combined with such a beautiful mind?\n\n18:00.460 --> 18:07.880\n So from your perspective of a man of faith, how do you think about that?\n\n18:07.880 --> 18:17.200\n So of the atheists that I have debated, I think about all of them somewhat differently.\n\n18:17.200 --> 18:22.960\n So I think that in some deep way, for example, Sam Harris is a religious personality.\n\n18:22.960 --> 18:25.780\n I don't even think that he would, he wouldn't like the word religious, but I don't even\n\n18:25.780 --> 18:29.080\n think that he would take issue with that.\n\n18:29.080 --> 18:34.000\n I think that he would say his is a purely material based spirituality.\n\n18:34.000 --> 18:39.840\n But I mean, his orientation towards meditation and appreciation of Buddhism, there's something\n\n18:39.840 --> 18:44.320\n deeply seeking spiritual about him.\n\n18:44.320 --> 18:51.520\n With Hitchens, I honestly, and I know that some of his fans will really not like this.\n\n18:51.520 --> 18:57.280\n It's not that he was any kind of closet believer, certainly not at all, but I almost feel as\n\n18:57.280 --> 19:04.920\n though he was less a passionate arguer against religion than he was, first of all, extremely\n\n19:04.920 --> 19:08.600\n upset by the forms that religion took in this world.\n\n19:08.600 --> 19:15.120\n And then once he trained his intellectual howitzers on a target, he had so much fun\n\n19:15.120 --> 19:23.520\n inventing new arguments and attacking it that I really believe he gets carried away sometimes\n\n19:23.520 --> 19:28.940\n by his own eloquence and intellectual range.\n\n19:28.940 --> 19:34.140\n So for example, the idea that you would call a book that religion poisons everything, I\n\n19:34.140 --> 19:38.600\n think he did that deliberately provocatively so that he could defend a proposition that\n\n19:38.600 --> 19:42.560\n obviously is indefensible, that it poisons everything.\n\n19:42.560 --> 19:48.040\n So I don't know, I think he had tremendous joie de vivre.\n\n19:48.040 --> 19:49.840\n That's really what, that's what sums him up.\n\n19:49.840 --> 19:56.440\n This guy loved life in all of its manifestations and arguing against something that someone\n\n19:56.440 --> 19:58.840\n else believed was one of his greatest joys.\n\n19:58.840 --> 20:03.640\n Yeah, and of course the practical aspect of that, he just saw the powerful and he challenged\n\n20:03.640 --> 20:05.160\n them with humor and so on.\n\n20:05.160 --> 20:06.160\n Absolutely.\n\n20:06.160 --> 20:10.840\n And you know, you could argue perhaps that humor is the highest form of what humanity\n\n20:10.840 --> 20:11.840\n can achieve.\n\n20:11.840 --> 20:16.640\n Like sometimes maybe us little humans take things a little too seriously, then sometimes\n\n20:16.640 --> 20:20.600\n we need to just laugh at it all, laugh at ourselves, and that's probably the purest\n\n20:20.600 --> 20:21.600\n form of wisdom.\n\n20:21.600 --> 20:26.600\n You know, Auden, the poet, said, among the people that I like or admire, I can find no\n\n20:26.600 --> 20:29.600\n common quality, but among those I love, I can.\n\n20:29.600 --> 20:31.480\n All of them make me laugh.\n\n20:31.480 --> 20:32.480\n There you have it.\n\n20:32.480 --> 20:33.480\n Yeah.\n\n20:33.480 --> 20:38.480\n Speaking of people that make you laugh, Sam Harris, because he actually has a really great\n\n20:38.480 --> 20:39.480\n sense of humor.\n\n20:39.480 --> 20:40.480\n He does.\n\n20:40.480 --> 20:43.160\n With a very cold and monotone delivery.\n\n20:43.160 --> 20:51.080\n He's another one that you had, you're friends with, you have good conversations with.\n\n20:51.080 --> 20:54.240\n What's your fundamental disagreements and agreements with Sam?\n\n20:54.240 --> 20:58.440\n Sam believes that religion is intellectually indefensible.\n\n20:58.440 --> 21:03.240\n He really believes it, like deep in his soul.\n\n21:03.240 --> 21:11.920\n And he gets angry at the idea that a proposition should be unchallenged if it offends his sense\n\n21:11.920 --> 21:13.800\n of logic.\n\n21:13.800 --> 21:16.360\n So he cannot move on until this is dealt with.\n\n21:16.360 --> 21:17.360\n Nope.\n\n21:17.360 --> 21:23.520\n In fact, I did a podcast with Eric Weinstein, and then Sam did one.\n\n21:23.520 --> 21:28.580\n And Sam said, when I heard your podcast with David Wolpe, I learned stuff about what he\n\n21:28.580 --> 21:32.640\n thinks that I never learned in my conversations with him because I can never let him make\n\n21:32.640 --> 21:36.540\n those unfounded assertions without challenging them, and you just let them go.\n\n21:36.540 --> 21:42.720\n And I think that there was something to that was like, he finds it hard to have a conversation\n\n21:42.720 --> 21:51.500\n about religion that doesn't arouse his real ire about the harm that he thinks religion\n\n21:51.500 --> 21:52.500\n does in the world.\n\n21:52.500 --> 21:56.640\n So it's more about the implementation of religion in the world as it is versus the\n\n21:56.640 --> 21:58.540\n really fundamental...\n\n21:58.540 --> 22:03.880\n I think he also thinks it's fundamentally intellectually shoddy and disreputable.\n\n22:03.880 --> 22:04.880\n Faith.\n\n22:04.880 --> 22:05.880\n Yeah, faith.\n\n22:05.880 --> 22:07.560\n I don't know how to put this.\n\n22:07.560 --> 22:13.320\n I mean, they're both capable of separating their contempt for religion from the people\n\n22:13.320 --> 22:15.640\n that they have sitting in front of them.\n\n22:15.640 --> 22:18.000\n You mean Christopher Hitchens and Sam Harris?\n\n22:18.000 --> 22:19.000\n Yes.\n\n22:19.000 --> 22:20.000\n Both of them.\n\n22:20.000 --> 22:21.000\n Okay.\n\n22:21.000 --> 22:22.000\n So let me...\n\n22:22.000 --> 22:23.000\n You mentioned Eric Weinstein.\n\n22:23.000 --> 22:24.000\n People should listen to your conversation with Eric.\n\n22:24.000 --> 22:25.000\n It's a fascinating one.\n\n22:25.000 --> 22:26.000\n It's great.\n\n22:26.000 --> 22:27.000\n It's nonstandard.\n\n22:27.000 --> 22:30.000\n It just goes all over the place in this humor and wit.\n\n22:30.000 --> 22:31.000\n It's great.\n\n22:31.000 --> 22:36.520\n There's one interesting aspect that I also learned, perhaps not about you but about Eric,\n\n22:36.520 --> 22:37.520\n about both.\n\n22:37.520 --> 22:44.800\n But Eric has a similar thing as with Jordan Peterson, which is if you ask them, do they\n\n22:44.800 --> 22:48.080\n believe in God, I think the answer...\n\n22:48.080 --> 22:52.180\n They're not comfortable answering that question, or they might say no, but they're usually\n\n22:52.180 --> 22:54.440\n just not comfortable answering that question.\n\n22:54.440 --> 23:01.160\n But there's a kind of sense that they would like to live life, a religious life, as if\n\n23:01.160 --> 23:02.480\n God exists.\n\n23:02.480 --> 23:03.960\n I think that's exactly right.\n\n23:03.960 --> 23:08.280\n I think, first of all, Eric has a really deep appreciation of the Jewish tradition.\n\n23:08.280 --> 23:09.760\n I don't know Peterson.\n\n23:09.760 --> 23:12.720\n I've read his stuff and I've reviewed his stuff and so on.\n\n23:12.720 --> 23:19.200\n But I think that Jungians are in their very approach.\n\n23:19.200 --> 23:23.480\n They believe that myth is the way the world works.\n\n23:23.480 --> 23:29.440\n And so it's not that big a leap to God, but there's still a distance there.\n\n23:29.440 --> 23:32.820\n Is it possible to have your cake and eat it too?\n\n23:32.820 --> 23:39.560\n Is it possible to have the depth of a religious life without believing in God?\n\n23:39.560 --> 23:46.080\n How do you make sense of Eric Weinstein's devout life within the tradition?\n\n23:46.080 --> 23:51.040\n I honestly think he believes in God, but doesn't believe in God and it's oscillating like it's\n\n23:51.040 --> 23:54.200\n a quantum mechanical system of some sort.\n\n23:54.200 --> 23:56.320\n Schrodinger's God.\n\n23:56.320 --> 24:02.380\n So I think that he would probably agree with what Elie Wiesel said, that a Jew can be angry\n\n24:02.380 --> 24:07.560\n at God or be disbelieving of God, but is not allowed to be indifferent to God.\n\n24:07.560 --> 24:11.900\n And I think Eric's not indifferent to God.\n\n24:11.900 --> 24:13.760\n And it's different than Christianity.\n\n24:13.760 --> 24:22.960\n I've had this conversation many times because you can be very Jewish and have deep doubts\n\n24:22.960 --> 24:29.620\n about theological questions because Judaism isn't a religion, it's a religious family.\n\n24:29.620 --> 24:31.520\n And so you're born Jewish.\n\n24:31.520 --> 24:36.560\n Like if I said to you tomorrow, if I was Christian and I said, oh, I believe in Jesus today and\n\n24:36.560 --> 24:38.720\n then tomorrow I didn't, I'm not Christian anymore.\n\n24:38.720 --> 24:42.660\n But if tomorrow I said, oh, I don't believe all this stuff, I'm still Jewish.\n\n24:42.660 --> 24:46.720\n So it's a more complicated system.\n\n24:46.720 --> 24:54.400\n Having said that though, I think it's very hard to sustain over generations without some\n\n24:54.400 --> 24:57.840\n belief that the source of it is beyond ourselves.\n\n24:57.840 --> 25:01.280\n And in that sense, as in many others, Eric is unique.\n\n25:01.280 --> 25:10.080\n Well, he was actually making that claim that we need faith to propagate this tradition\n\n25:10.080 --> 25:12.240\n through the generations.\n\n25:12.240 --> 25:14.880\n So without that, the traditions crumble.\n\n25:14.880 --> 25:22.880\n It's a very interesting idea and very interesting argument for devout faith, which is it's a\n\n25:22.880 --> 25:25.400\n thing, it's a glue that holds a tradition together.\n\n25:25.400 --> 25:31.600\n Otherwise like traditions fall apart because you can't have the intensity of that tradition.\n\n25:31.600 --> 25:36.640\n I mean, on the other hand, you do see tradition, I mean, Thanksgiving, one of my favorite.\n\n25:36.640 --> 25:42.200\n So I would say traditions that are demanding fall apart, traditions that require Turkey\n\n25:42.200 --> 25:47.880\n might not fall apart, but traditions that make demands of you that are countercultural\n\n25:47.880 --> 25:50.520\n or are hard, they fall apart.\n\n25:50.520 --> 25:55.720\n I think I need to introduce you to some Thanksgiving dinners that are quite demanding, getting\n\n25:55.720 --> 25:56.720\n the family together.\n\n25:56.720 --> 26:02.040\n You know, there's a, first of all, I'm a vegetarian, so I'm tough to have at Thanksgiving dinner,\n\n26:02.040 --> 26:07.280\n but there's a comedian, Cathy Landsman, who one year I heard this on the radio and it\n\n26:07.280 --> 26:08.520\n stuck with me.\n\n26:08.520 --> 26:13.760\n She said that holidays are a chance to renew your resentments afresh, you know, and that's\n\n26:13.760 --> 26:15.640\n basically what people do with their families.\n\n26:15.640 --> 26:20.080\n It's like, I'm going to go home and fight with the uncle again this year.\n\n26:20.080 --> 26:25.400\n I apologize to take a dark turn, but you mentioned Elie Wiesel.\n\n26:25.400 --> 26:32.280\n I recently saw a picture of Elie Wiesel when he was in the camp, when he was liberated.\n\n26:32.280 --> 26:39.640\n For some reason that hit hard, like, you know, I've seen pictures in concentration camps\n\n26:39.640 --> 26:46.520\n of people I don't know or whose words I haven't really felt and gone through, but for some\n\n26:46.520 --> 26:54.320\n reason like here's just a normal person, like a normal body laying there, that just, that\n\n26:54.320 --> 26:55.320\n was him.\n\n26:55.320 --> 26:56.320\n I've seen it.\n\n26:56.320 --> 27:02.080\n It's a, and, and you see, you can see his face, but at the same time you see that this\n\n27:02.080 --> 27:07.720\n is an amazing, and I think what's so disturbing about it is exactly what you were saying is\n\n27:07.720 --> 27:12.860\n I've seen a thousand people like this and I know this one and I know what he became.\n\n27:12.860 --> 27:18.520\n So what about all those other people who look exactly like him who didn't make it out of\n\n27:18.520 --> 27:19.520\n the camp?\n\n27:19.520 --> 27:25.520\n I don't see his projection, but it seemed like this perhaps is also just combining with\n\n27:25.520 --> 27:32.760\n man's search for meaning is it seemed like it was a regular day for them in the picture.\n\n27:32.760 --> 27:38.020\n It didn't seem like, I mean, I'm not sure what I expect to see what suffering looks like,\n\n27:38.020 --> 27:41.400\n but it's almost like there's no celebration.\n\n27:41.400 --> 27:45.160\n I've never seen a picture of actually liberation be celebratory.\n\n27:45.160 --> 27:46.200\n It's true.\n\n27:46.200 --> 27:47.200\n It's really true.\n\n27:47.200 --> 27:53.460\n So what do you make sense, and I apologize to take a step into that moment in history.\n\n27:53.460 --> 28:03.620\n How does, how do you make sense of the Holocaust that, of Nazi Germany that such things could\n\n28:03.620 --> 28:07.700\n be committed by human beings to each other?\n\n28:07.700 --> 28:09.840\n Is it religion?\n\n28:09.840 --> 28:13.440\n Is it the thirst for power?\n\n28:13.440 --> 28:18.360\n Is it the madness of crowds somehow carrying us forward?\n\n28:18.360 --> 28:21.160\n I mean, for me it's multi causal.\n\n28:21.160 --> 28:22.720\n I don't think there's one reason.\n\n28:22.720 --> 28:27.400\n So one of the things especially there has to do with the special nature of antisemitism,\n\n28:27.400 --> 28:30.280\n which is let's put that to one side for the moment.\n\n28:30.280 --> 28:34.320\n The second is I think human beings are fundamentally split.\n\n28:34.320 --> 28:38.080\n They are mostly good except when put under certain pressures.\n\n28:38.080 --> 28:43.500\n My first explanation for hatreds is as follows, go to a playground.\n\n28:43.500 --> 28:45.560\n What happens when a new kid comes on the playground?\n\n28:45.560 --> 28:49.320\n Do the other kids say, oh, let's go share our toys with the new kid?\n\n28:49.320 --> 28:50.320\n No.\n\n28:50.320 --> 28:56.080\n They say, oh, who's that stranger and let's go get them because otherness is built into\n\n28:56.080 --> 29:03.400\n our genetic, I mean, we're tribal by nature and we see people form tribes all the time\n\n29:03.400 --> 29:06.720\n of different kinds.\n\n29:06.720 --> 29:13.440\n I asked you before if you were a chess player and when I was a kid and playing in tournaments\n\n29:13.440 --> 29:17.520\n and I didn't do it for that long and I didn't do it that well, but when I was, it was like\n\n29:17.520 --> 29:20.760\n the whole world was divided into people who could play chess and people who couldn't play\n\n29:20.760 --> 29:25.600\n chess, which is ridiculous if you think about it as though that's the way you divide the\n\n29:25.600 --> 29:26.600\n world.\n\n29:26.600 --> 29:31.600\n But we tend to do that and the Jews were always the identifiable other.\n\n29:31.600 --> 29:34.760\n There were Frenchmen and Jews, there were Russians and Jews, there were Germans and\n\n29:34.760 --> 29:40.840\n Jews and the great blessing of America is that there's no identifiable other quite that\n\n29:40.840 --> 29:49.420\n way is that there's all these minorities and no, there's not an American and a something.\n\n29:49.420 --> 29:55.240\n But once you have that identifiable other and you have a long history of blaming that\n\n29:55.240 --> 29:58.560\n identifiable other for all the ills that befall you.\n\n29:58.560 --> 30:02.560\n Of course, people still do try to form, you said America, they still try to form other,\n\n30:02.560 --> 30:07.520\n I mean, immigrant versus been here for a generation.\n\n30:07.520 --> 30:09.080\n There's so many ways to slice it.\n\n30:09.080 --> 30:11.080\n We still try to find ways.\n\n30:11.080 --> 30:15.440\n It's just more difficult in America because there's so many sub tribes, hierarchies of\n\n30:15.440 --> 30:16.880\n tribes and upon tribes.\n\n30:16.880 --> 30:17.880\n You're absolutely right.\n\n30:17.880 --> 30:23.320\n And I was moving fast because I didn't want to get bogged down in all the very difficult.\n\n30:23.320 --> 30:24.320\n It's true.\n\n30:24.320 --> 30:25.320\n I tried.\n\n30:25.320 --> 30:27.640\n You're hoping I wouldn't mention that tribalism happens in America.\n\n30:27.640 --> 30:33.120\n Skating, you know, when you're on thin ice, your safety is in your speed.\n\n30:33.120 --> 30:35.320\n So I was trying to move fast.\n\n30:35.320 --> 30:41.560\n But for most of history in Eastern Western Europe, not obviously in the, in Asia, but\n\n30:41.560 --> 30:46.440\n in Eastern Western Europe, Jews were the ones who like, they're not like us.\n\n30:46.440 --> 30:49.080\n They're clearly not like us.\n\n30:49.080 --> 30:54.480\n And so, and in addition, there was, there's a peculiar quality and I don't know, I wonder\n\n30:54.480 --> 30:56.320\n what you'll think of this explanation.\n\n30:56.320 --> 31:00.880\n There's a peculiar quality to antisemitism that is unlike any other hatred that I know\n\n31:00.880 --> 31:05.480\n of, which is Jews are both superhuman and subhuman.\n\n31:05.480 --> 31:06.480\n They're vermin.\n\n31:06.480 --> 31:10.720\n The Nazis thought of them as vermin and yet they control the world.\n\n31:10.720 --> 31:15.080\n And there was an English scholar named Hyman Maccabee who said the reason that that's\n\n31:15.080 --> 31:19.880\n so is the myth that Jews killed God.\n\n31:19.880 --> 31:24.280\n They killed Jesus and to kill a God, you have to be superhumanly evil.\n\n31:24.280 --> 31:27.520\n You can't just be bad, otherwise you can't kill a God.\n\n31:27.520 --> 31:35.280\n So there is some like supercharged evil sense that people got from that about Jews that\n\n31:35.280 --> 31:36.800\n still in here.\n\n31:36.800 --> 31:38.040\n Yeah, that's true.\n\n31:38.040 --> 31:44.000\n A lot of the way we formulate the other in terms of tribes is often they're subhuman\n\n31:44.000 --> 31:48.160\n and they're here to steal our resources, like on the playground.\n\n31:48.160 --> 31:54.040\n But to be both is a fascinating construction.\n\n31:54.040 --> 31:58.760\n Do you agree with Solzhenitsyn that all of us have the capacity for evil?\n\n31:58.760 --> 32:01.560\n A hundred percent runs through every human heart.\n\n32:01.560 --> 32:03.880\n I have no doubt about it.\n\n32:03.880 --> 32:09.960\n And I know as you probably do, but I probably know more both because of what I do and because\n\n32:09.960 --> 32:12.360\n I have lived a lot longer than you.\n\n32:12.360 --> 32:19.640\n I know a lot of religious leaders who people thought or think are above the human and they\n\n32:19.640 --> 32:21.400\n are emphatically not.\n\n32:21.400 --> 32:22.460\n They're not.\n\n32:22.460 --> 32:26.560\n Some of them have done horrible things and they've used their position to do horrible\n\n32:26.560 --> 32:28.000\n things.\n\n32:28.000 --> 32:32.200\n And it's because there is no perfect saint.\n\n32:32.200 --> 32:38.320\n There's no, you know, I mean, all through history you discover all these saintly characters\n\n32:38.320 --> 32:42.600\n that we worship, the people who actually knew them around them, some liked them and some\n\n32:42.600 --> 32:44.400\n didn't.\n\n32:44.400 --> 32:46.080\n People are complicated, all of us.\n\n32:46.080 --> 32:51.500\n And the tough thing is, the thing that's the toughest for me is it's not very always clear\n\n32:51.500 --> 32:55.840\n what is good and what is evil.\n\n32:55.840 --> 33:02.480\n Because certainly if you just look at history and it's not always propaganda, I, you know,\n\n33:02.480 --> 33:12.080\n I really believe that some part of Stalin thought he was doing good, legitimately.\n\n33:12.080 --> 33:16.760\n And it makes you ask a question of yourself.\n\n33:16.760 --> 33:20.160\n For those of us who want to do good in the world, am I actually doing good?\n\n33:20.160 --> 33:25.120\n And that's a really difficult question, like in the technology sphere, for example, in\n\n33:25.120 --> 33:30.240\n this dream of creating technology that will do some good, am I actually doing good?\n\n33:30.240 --> 33:32.640\n So I have a question about that myself.\n\n33:32.640 --> 33:33.640\n Not about Stalin.\n\n33:33.640 --> 33:35.680\n I'm sure that Stalin thought so.\n\n33:35.680 --> 33:39.600\n Stalin does not strike me from what I know of him as somebody given to a lot of self\n\n33:39.600 --> 33:40.880\n doubt.\n\n33:40.880 --> 33:46.600\n But the question with AI to me is actually, it goes back to the God question, which is,\n\n33:46.600 --> 33:53.960\n if we have an appreciation of the limitations of our own intelligence, that we know that\n\n33:53.960 --> 34:00.020\n just like we can only hear certain things and see certain colors, how much of the world\n\n34:00.020 --> 34:06.420\n is inaccessible to us because of the way our brains are constructed, how can we possibly\n\n34:06.420 --> 34:12.280\n have any confidence that we can create things that in certain ways are far more intelligent\n\n34:12.280 --> 34:19.600\n than we are and control them the way we think is best, seems to me a hubris that might end\n\n34:19.600 --> 34:21.840\n up being destructive.\n\n34:21.840 --> 34:22.840\n Definitely.\n\n34:22.840 --> 34:28.360\n Well, any sentence with the word hubris in it is going to end badly when implemented\n\n34:28.360 --> 34:30.160\n at scale.\n\n34:30.160 --> 34:32.120\n But there is also beauty.\n\n34:32.120 --> 34:37.560\n So if you approach it with humility, there is a sense, I don't want to over romanticize\n\n34:37.560 --> 34:43.280\n it, but there is a legged robot right behind you, which is hilarious.\n\n34:43.280 --> 34:51.800\n So there's a magic, I don't have kids, I would love to have kids.\n\n34:51.800 --> 34:59.600\n But there's a magic to bringing robots to life that it feels like you are a mini God,\n\n34:59.600 --> 35:04.800\n because you just breathe life into an entity that operates in this world, especially when\n\n35:04.800 --> 35:10.120\n they have legs and they move in this way, that's in the case of the four legged robots,\n\n35:10.120 --> 35:15.240\n like a dog that I think, I don't think I'm over romanticizing it.\n\n35:15.240 --> 35:17.880\n The feeling is like you would with a child.\n\n35:17.880 --> 35:21.920\n You just gave birth like, holy crap, this is a living thing.\n\n35:21.920 --> 35:24.880\n I wonder what he or she are thinking about.\n\n35:24.880 --> 35:29.600\n By the way, I'm not at all insensible to how remarkable it must feel to create that.\n\n35:29.600 --> 35:34.780\n I'm actually worried in part about how remarkable it feels to create that because to maintain\n\n35:34.780 --> 35:42.880\n humility and perspective when it's such a fantastic thing is what's difficult.\n\n35:42.880 --> 35:50.560\n And I think also because creativity is both part of what it is to be human and it's very\n\n35:50.560 --> 35:56.420\n much part of the legacy of Western civilization and the legacy of having a creator God.\n\n35:56.420 --> 36:02.120\n If you have a tradition where God is known primarily through what God creates, so the\n\n36:02.120 --> 36:06.400\n first debate I ever had since we talked about humor and God and creating, let me give you\n\n36:06.400 --> 36:09.440\n my one God creating joke.\n\n36:09.440 --> 36:14.880\n Because the first debate I ever had on religion and science was with Stephen Jay Gould and\n\n36:14.880 --> 36:18.960\n it was wonderful because he had a deep interest in religion and his interest was actually\n\n36:18.960 --> 36:22.800\n not to say religion is terrible.\n\n36:22.800 --> 36:28.520\n But I started with this joke and I think it made the debate go a little bit easier.\n\n36:28.520 --> 36:33.420\n So the time has come when human beings can do everything that God can do and a scientist\n\n36:33.420 --> 36:37.000\n looks up at heaven and says, God, look, you were great in your day and we thank you for\n\n36:37.000 --> 36:39.400\n everything you did, but now we don't need you.\n\n36:39.400 --> 36:40.560\n And God says, really, you don't need me?\n\n36:40.560 --> 36:42.440\n He says, no, we can do everything you did.\n\n36:42.440 --> 36:44.120\n God says, everything?\n\n36:44.120 --> 36:46.240\n And the human being says, yeah, we can do everything.\n\n36:46.240 --> 36:49.760\n God says, okay, can you create a human being?\n\n36:49.760 --> 36:51.760\n And the scientist goes, yeah.\n\n36:51.760 --> 36:52.760\n God says, from dirt?\n\n36:52.760 --> 36:53.760\n And the scientist goes, yeah.\n\n36:53.760 --> 36:54.760\n He says, okay, let me see.\n\n36:54.760 --> 36:58.600\n The scientist reaches down, scoops up some dirt and God says, uh, uh, uh, get your own\n\n36:58.600 --> 37:02.280\n dirt.\n\n37:02.280 --> 37:05.720\n But the idea is that a creator God impels us to create too.\n\n37:05.720 --> 37:10.840\n But let me bring up Nietzsche, who proclaimed that God is dead.\n\n37:10.840 --> 37:14.680\n Is belief in God slowly disappearing from our world, do you think?\n\n37:14.680 --> 37:18.400\n And what kind of impact does that have on society?\n\n37:18.400 --> 37:21.860\n You wrote that religion is not our enemy.\n\n37:21.860 --> 37:25.880\n Before the Western faiths captured the heart of our world, there was cruelty, carnage,\n\n37:25.880 --> 37:26.880\n and destruction.\n\n37:26.880 --> 37:31.320\n In the 20th century, when religion ceased to be a force of international politics, the\n\n37:31.320 --> 37:36.400\n scale of human slaughter was far beyond anything human beings have ever known.\n\n37:36.400 --> 37:39.520\n What is the world like when we take religion out of it?\n\n37:39.520 --> 37:41.600\n I mean, I think Nietzsche was largely right.\n\n37:41.600 --> 37:44.200\n You know, it wasn't a statement about God.\n\n37:44.200 --> 37:49.160\n It was a statement about God's presence in the world.\n\n37:49.160 --> 37:57.080\n And I think that that's largely true, that God is not a force in a lot of Western society.\n\n37:57.080 --> 38:06.920\n And I believe that if the force of nihilism has no clear counter without an idea that\n\n38:06.920 --> 38:13.000\n we're all here for a purpose and that our lives are inherently meaningful and that there's\n\n38:13.000 --> 38:17.540\n a God who wishes us to be better.\n\n38:17.540 --> 38:22.640\n So I worry a lot about it, and I think that the sort of optimism that things are just\n\n38:22.640 --> 38:28.400\n going to get better and better is what one philosopher called cut flower ethics.\n\n38:28.400 --> 38:32.780\n That is, we're still living off the morals that religion gave us, but now that they're\n\n38:32.780 --> 38:36.880\n separate from the soil that gave birth to them, I see them wilting.\n\n38:36.880 --> 38:41.480\n So this kind of optimism for the future of human civilization, you think, is in part\n\n38:41.480 --> 38:45.040\n grounded in a religious society.\n\n38:45.040 --> 38:46.240\n I really do believe that.\n\n38:46.240 --> 38:49.760\n I mean, it was religion that the Greeks look back at the golden age of the past.\n\n38:49.760 --> 38:53.000\n It was the Jews who said, no, the golden age is in the future, right?\n\n38:53.000 --> 38:54.760\n It's the Messiah.\n\n38:54.760 --> 39:00.280\n And I think that that idea that we're moving towards something better, which I really believe\n\n39:00.280 --> 39:08.800\n humanity can do and absent destroying ourselves will do, you know, I mean, I'm very excited\n\n39:08.800 --> 39:10.820\n about the technology that I won't live to see.\n\n39:10.820 --> 39:12.240\n I think it's fantastic.\n\n39:12.240 --> 39:16.160\n And that excitement is a kind of religious excitement because there's a reason to preserve\n\n39:16.160 --> 39:17.160\n this whole thing.\n\n39:17.160 --> 39:18.160\n Absolutely.\n\n39:18.160 --> 39:23.320\n Because I really think, I know this sounds absurdly anthropomorphic, but I really think\n\n39:23.320 --> 39:25.240\n God is cheering us on.\n\n39:25.240 --> 39:27.960\n I feel like this is why we're here.\n\n39:27.960 --> 39:35.000\n We're here to grow in soul and to grow each other in soul.\n\n39:35.000 --> 39:37.840\n Yeah.\n\n39:37.840 --> 39:42.880\n So what do you think the world, so if you just think of this force of nihilism that's\n\n39:42.880 --> 39:52.960\n contending with the force of faith based optimism, what do you make of the atrocities in the\n\n39:52.960 --> 39:54.480\n 20th century?\n\n39:54.480 --> 40:02.160\n Do you think at its core, it's part of human nature and has nothing to do with religion\n\n40:02.160 --> 40:03.480\n or not religion?\n\n40:03.480 --> 40:07.440\n Or do you think you can assign this kind of nihilistic view of the world?\n\n40:07.440 --> 40:12.720\n I think it has to do with a religion that doesn't make ethical demands.\n\n40:12.720 --> 40:20.600\n That is, for Stalin and for Hitler, they both had religions, in a sense, but they were religions\n\n40:20.600 --> 40:23.760\n that didn't make ethical demands for the other.\n\n40:23.760 --> 40:27.540\n I mean, 36 times the Torah talks about the stranger.\n\n40:27.540 --> 40:33.760\n The point is, it's trying to educate people away from their natural inclination towards\n\n40:33.760 --> 40:36.460\n distrusting and disliking the other.\n\n40:36.460 --> 40:40.040\n And it's a lot of work that's really difficult to do.\n\n40:40.040 --> 40:50.280\n But if you have a tribal passion and not a universal ethic, then you're in trouble.\n\n40:50.280 --> 40:54.640\n Well, the Jewish tribe is a very strong tribe.\n\n40:54.640 --> 41:00.880\n So how do you make sense of this mention of the stranger versus the power of the tribe,\n\n41:00.880 --> 41:04.920\n which is the whole point, not the point, but the mechanism of tradition propagates the\n\n41:04.920 --> 41:05.920\n tribe.\n\n41:05.920 --> 41:06.920\n So it's both.\n\n41:06.920 --> 41:10.280\n I mean, the Torah does not start with Jews.\n\n41:10.280 --> 41:12.000\n It starts with Adam and Eve.\n\n41:12.000 --> 41:16.920\n That's a way of saying, yeah, this is going to be a story about a people, but understand\n\n41:16.920 --> 41:20.780\n that prior to a kind of people, there are people.\n\n41:20.780 --> 41:24.320\n I'm a human being before I'm a Jew.\n\n41:24.320 --> 41:30.660\n And in fact, the Jewish New Year, the Muslim New Year starts with Muhammad's journey.\n\n41:30.660 --> 41:33.080\n And the Christian New Year starts with Jesus's birth.\n\n41:33.080 --> 41:38.040\n The Jewish New Year starts with the creation of the world because the idea is, yes, this\n\n41:38.040 --> 41:44.800\n is a particularist tradition, but it makes a universal statement, which is all of humanity\n\n41:44.800 --> 41:49.800\n is a child, are in the image of God, are children of God.\n\n41:49.800 --> 41:57.500\n I think that the idea of Judaism was to try to exemplify a certain way of making that\n\n41:57.500 --> 41:59.300\n statement over and over again.\n\n41:59.300 --> 42:04.520\n And I want to say one other thing about chosenness that's very name droppy, but when I tell\n\n42:04.520 --> 42:07.040\n you how I got there, it won't be as name droppy.\n\n42:07.040 --> 42:11.280\n So my brother is a professor at Emory.\n\n42:11.280 --> 42:15.520\n And so is the Dalai Lama actually teaches at Emory, although he no longer does because\n\n42:15.520 --> 42:18.520\n he's too old to go to Emory, but for many years taught at Emory.\n\n42:18.520 --> 42:23.360\n And so my brother brought us, he's the head of the bio of the ethics center at Emory.\n\n42:23.360 --> 42:24.360\n He's a bioethicist.\n\n42:24.360 --> 42:28.220\n So he brought a bunch of students to Dharamsala to meet with the Dalai Lama.\n\n42:28.220 --> 42:33.000\n So I went to India, I was on sabbatical then anyway, I met my brother there and we had\n\n42:33.000 --> 42:34.920\n a chance to meet with the Dalai Lama.\n\n42:34.920 --> 42:35.920\n Okay.\n\n42:35.920 --> 42:36.920\n That was the name drop.\n\n42:36.920 --> 42:40.080\n So we're sitting in the, before he speaks to the students, he was speaking to us, but\n\n42:40.080 --> 42:43.080\n not because I just wanted to make it clear, not because he said, oh, I got to talk to\n\n42:43.080 --> 42:44.080\n that rabbi.\n\n42:44.080 --> 42:48.560\n We just happened to be, I happened to glom along with my brother.\n\n42:48.560 --> 42:49.560\n We sit down.\n\n42:49.560 --> 42:53.200\n The first thing he says is he points at me and says, what's this about the chosen people\n\n42:53.200 --> 42:54.200\n anyway?\n\n42:54.200 --> 43:00.160\n So, and he had, by the way, he had asked that I give a lecture, which I did later to, to\n\n43:00.160 --> 43:03.880\n them, to his monks about how Jews survived in the diaspora.\n\n43:03.880 --> 43:05.400\n So it's not like he doesn't know about Judaism.\n\n43:05.400 --> 43:09.640\n He knows a lot about it, but he says to me right away with, so I said, yes, Jews believe\n\n43:09.640 --> 43:13.540\n that they were chosen for a certain mission in this world, but that doesn't mean other\n\n43:13.540 --> 43:16.000\n people weren't chosen for other sorts of things.\n\n43:16.000 --> 43:19.760\n They certainly, I mean, it seems to me that other people believe they're chosen for things\n\n43:19.760 --> 43:20.760\n too.\n\n43:20.760 --> 43:24.640\n They burst out laughing and said, yeah, we also think we're chosen.\n\n43:24.640 --> 43:25.640\n So I think it's universal.\n\n43:25.640 --> 43:34.600\n The idea is that no tribe is better than, from a Jewish perspective, you're chosen for\n\n43:34.600 --> 43:38.920\n a thing, but that doesn't make you better.\n\n43:38.920 --> 43:39.920\n No.\n\n43:39.920 --> 43:43.000\n The only place where the betters came in, honestly, if I'm going to, historically, if\n\n43:43.000 --> 43:50.240\n I'm going to be honest, was not with the idea that you, but it was when Jews were small\n\n43:50.240 --> 43:52.200\n persecuted.\n\n43:52.200 --> 43:56.080\n The way that you take this sort of psychic revenge is by saying, no, we're better than\n\n43:56.080 --> 43:59.080\n our persecutors even.\n\n43:59.080 --> 44:04.880\n But the idea is, yeah, different people have different missions, which is, I mean, like\n\n44:04.880 --> 44:08.680\n there was a Jewish philosopher, Franz Rosenzweig, who used to say, he didn't know very much\n\n44:08.680 --> 44:09.680\n about Islam.\n\n44:09.680 --> 44:14.520\n He used to say, Judaism is the sun and Christianity was the rays of the sun.\n\n44:14.520 --> 44:18.160\n Like Judaism introduced the idea of God and Christianity brought it to the world.\n\n44:18.160 --> 44:21.200\n Can you speak to this difference?\n\n44:21.200 --> 44:28.160\n What is the difference and similarities between Judaism, Christianity, and Islam?\n\n44:28.160 --> 44:30.600\n The religious family part is different.\n\n44:30.600 --> 44:38.680\n And the greatest difference, which I talked about in the Eric Weinstein podcast, is that\n\n44:38.680 --> 44:44.200\n Islam and Judaism are more similar in a lot of ways than Judaism and Christianity.\n\n44:44.200 --> 44:52.360\n And the reason that that is so is Christianity in its core is not a religion of law.\n\n44:52.360 --> 44:56.960\n The reason it's not a religion of law is because it grew up in the Roman Empire, so law was\n\n44:56.960 --> 44:57.960\n taken care of.\n\n44:57.960 --> 45:02.440\n I mean, Jesus didn't have to create civil law because you had Roman law.\n\n45:02.440 --> 45:06.520\n Muhammad and Moses created a religion in the desert where there was no law.\n\n45:06.520 --> 45:12.080\n So you have to create a religion of law, otherwise you have anarchy.\n\n45:12.080 --> 45:17.000\n And that's why in a lot of ways, there was never a separation of church and state in\n\n45:17.000 --> 45:18.200\n Islam or Judaism.\n\n45:18.200 --> 45:21.120\n That was a gift that Christianity gave the world.\n\n45:21.120 --> 45:24.540\n And it could do it because of render unto Caesar what is Caesar's.\n\n45:24.540 --> 45:26.720\n But when Moses came along, there was no Caesar.\n\n45:26.720 --> 45:29.080\n When Muhammad came along, there was no Caesar.\n\n45:29.080 --> 45:34.360\n So historically, the traditions shaped differently.\n\n45:34.360 --> 45:42.960\n But all three of them have this core, I think, the single most important statement and insight\n\n45:42.960 --> 45:48.480\n in all of human history, which is that every human being is in the image of God.\n\n45:48.480 --> 45:54.100\n And if you really believe that, that's a transformative belief.\n\n45:54.100 --> 45:59.640\n So that means you should love thy neighbor as yourself.\n\n45:59.640 --> 46:02.660\n Which comes from Leviticus, comes straight from the Torah.\n\n46:02.660 --> 46:07.400\n So I don't know if you know, I've been chatting with Omar Suleiman, I don't know if you know\n\n46:07.400 --> 46:08.400\n who that is.\n\n46:08.400 --> 46:11.000\n He's an imam in Dallas, a great guy.\n\n46:11.000 --> 46:16.120\n I enjoy his interfaith dialogues that he engages in.\n\n46:16.120 --> 46:19.880\n And do you ever do that kind of talk with Christians, with Muslims?\n\n46:19.880 --> 46:20.880\n Yes, often.\n\n46:20.880 --> 46:21.880\n Often.\n\n46:21.880 --> 46:26.840\n I mean, I do whenever I at least listen to them in the context of these kinds of conversations.\n\n46:26.840 --> 46:33.880\n There's so much love and humor and empathy and appreciation, and also ability to make\n\n46:33.880 --> 46:37.680\n fun of the quirks of the little...\n\n46:37.680 --> 46:38.680\n Of one's own.\n\n46:38.680 --> 46:41.040\n Of one's own communities.\n\n46:41.040 --> 46:46.560\n So it's not necessarily the depths or the details of the traditions, but these are communities\n\n46:46.560 --> 46:51.640\n and they're full of people and they're full of weird people, because we're all weird.\n\n46:51.640 --> 46:57.640\n And so there is very particular flavors of weirdness that emerge and they can make fun\n\n46:57.640 --> 46:59.160\n of them.\n\n46:59.160 --> 47:03.580\n And in that way, they can talk about some beautiful ideas.\n\n47:03.580 --> 47:07.280\n So I mean, I don't know, do you engage in these kinds of things?\n\n47:07.280 --> 47:09.120\n What do you learn from them?\n\n47:09.120 --> 47:12.640\n So one of the things I learned is exactly what you said, that personalities that you\n\n47:12.640 --> 47:18.120\n think are unique to your own community, in fact, they exist in all sorts of communities.\n\n47:18.120 --> 47:23.360\n And religious communities in particular draw, I think, some interesting personalities.\n\n47:23.360 --> 47:33.620\n And also that the, especially as clergy, some of the pressures that you feel are shared.\n\n47:33.620 --> 47:38.120\n And it's weird, again, it has to do with that tribal association.\n\n47:38.120 --> 47:44.240\n There's almost like there's an understanding among clergy because they have similar...\n\n47:44.240 --> 47:49.300\n And it's a strange role in the following way.\n\n47:49.300 --> 47:52.040\n It's one that you never escape.\n\n47:52.040 --> 47:58.120\n That is, you're not my lawyer at the supermarket, but you are my rabbi at the supermarket.\n\n47:58.120 --> 48:03.740\n I mean, it doesn't matter why you're there, that's not an escapable role.\n\n48:03.740 --> 48:14.200\n And every religious leader is aware of that strange assumption of stepping into something\n\n48:14.200 --> 48:16.440\n that you can never step out of.\n\n48:16.440 --> 48:24.800\n But you're also the source where people go to think about the deepest question of our\n\n48:24.800 --> 48:27.480\n lives and our universe.\n\n48:27.480 --> 48:32.600\n And so that's some heavy, when people are suffering, they look to you for answers.\n\n48:32.600 --> 48:36.120\n I mean, every privilege comes with a cost of one kind or another.\n\n48:36.120 --> 48:41.080\n The reason you get to be in that role is exactly because you get the privilege of being there\n\n48:41.080 --> 48:44.200\n at crucial moments in people's lives.\n\n48:44.200 --> 48:51.820\n I mean, the fact that I get to marry people and get to give eulogies for people and come\n\n48:51.820 --> 48:56.080\n to the hospital, it's inexpressible.\n\n48:56.080 --> 49:00.720\n I have this joke with people that I know that like when I'm sitting on the couch and it's\n\n49:00.720 --> 49:03.200\n Saturday night, I don't wanna get up and go to a wedding.\n\n49:03.200 --> 49:04.200\n I really don't.\n\n49:04.200 --> 49:07.660\n I wanna sit there and watch Netflix like everybody else.\n\n49:07.660 --> 49:14.960\n But when I'm actually doing the wedding, I always love it, always, always, always.\n\n49:14.960 --> 49:20.600\n And the reason is that I don't think, I mean, yes, people go to you for answers in calmer\n\n49:20.600 --> 49:21.600\n conversations.\n\n49:21.600 --> 49:25.040\n Like if you asked me now, like what's my theory of why God allows evil, I could give\n\n49:25.040 --> 49:28.100\n you a conversation about it.\n\n49:28.100 --> 49:32.760\n But they really go for presence and comfort, not really for answers.\n\n49:32.760 --> 49:37.440\n When someone's suffering, an answer doesn't make them unsuffer.\n\n49:37.440 --> 49:39.520\n It's just they wanna know they're not alone.\n\n49:39.520 --> 49:40.520\n Yeah.\n\n49:40.520 --> 49:45.800\n To be heard and just to feel things in silence together.\n\n49:45.800 --> 49:52.480\n In terms of weddings and marriage, what's the role of that whole, I need to take some\n\n49:52.480 --> 49:53.480\n notes here.\n\n49:53.480 --> 49:54.480\n What's...\n\n49:54.480 --> 49:55.480\n The role of a rabbi?\n\n49:55.480 --> 49:59.340\n The role of marriage in human existence.\n\n49:59.340 --> 50:05.840\n It is first of all to teach you how to care for someone unlike you, which could be anyone\n\n50:05.840 --> 50:08.720\n you marry.\n\n50:08.720 --> 50:12.960\n And I think it's to create a home and a family.\n\n50:12.960 --> 50:15.680\n So there's a commitment to it, so care for a long time.\n\n50:15.680 --> 50:16.680\n Right.\n\n50:16.680 --> 50:17.680\n Exactly.\n\n50:17.680 --> 50:21.200\n And also when couples come to me and they say, we don't need to be married because it\n\n50:21.200 --> 50:23.720\n really won't change how we think about ourselves and our relationship.\n\n50:23.720 --> 50:27.440\n I say to them, that's true, it might not, but it will change how everyone else looks\n\n50:27.440 --> 50:28.480\n at you.\n\n50:28.480 --> 50:32.240\n And because it changes how everyone else looks at you, it changes you.\n\n50:32.240 --> 50:36.040\n Because it's one thing to say, this is my partner, it's another thing to say, this is\n\n50:36.040 --> 50:37.040\n my husband.\n\n50:37.040 --> 50:42.320\n You say this is my husband, that means we've made a real commitment to this.\n\n50:42.320 --> 50:43.320\n Yeah.\n\n50:43.320 --> 50:52.920\n What do you, do you worry that there's a dissolution of that as well in terms of how, you know,\n\n50:52.920 --> 50:59.080\n as religion dissipates, like it loosens its hold on society, loosens its impact on society.\n\n50:59.080 --> 51:00.360\n Do you worry about that?\n\n51:00.360 --> 51:02.440\n I worry about it.\n\n51:02.440 --> 51:07.840\n I do think that it is possible that we're going, rather than a dissolution, we're going\n\n51:07.840 --> 51:09.560\n through a transition.\n\n51:09.560 --> 51:13.960\n That is different kinds of families and different configurations of families.\n\n51:13.960 --> 51:20.080\n That is, I see some of that, but I also do see a, it's less a dissolution of marriage\n\n51:20.080 --> 51:22.880\n than it is of the idea of commitment.\n\n51:22.880 --> 51:24.960\n And I'll give you like a simple example.\n\n51:24.960 --> 51:31.960\n When I was growing up, a player on a sports team was always on that team.\n\n51:31.960 --> 51:35.620\n And you rooted for the team because you knew the players for 20 years.\n\n51:35.620 --> 51:40.740\n Now there are very good reasons, starting with Curt Flood, why people got free agency\n\n51:40.740 --> 51:42.920\n and they can move around and it's better for the players.\n\n51:42.920 --> 51:44.280\n I understand all that.\n\n51:44.280 --> 51:48.400\n And I am not, I'm not saying, oh, they should continue.\n\n51:48.400 --> 51:56.400\n But just like people move jobs and they move sports teams and they change careers, they\n\n51:56.400 --> 51:58.640\n change partners.\n\n51:58.640 --> 52:05.840\n And there is a, there is a diminishment of the commitment to commitment that I actually\n\n52:05.840 --> 52:09.840\n think has serious societal consequences and that I am worried about.\n\n52:09.840 --> 52:10.840\n Yeah.\n\n52:10.840 --> 52:11.840\n There's a cost to that.\n\n52:11.840 --> 52:15.920\n I don't know what it is about commitment that's beautiful.\n\n52:15.920 --> 52:19.840\n Like through, because like some of the deepest friendships I have is when we've gone through\n\n52:19.840 --> 52:20.840\n some shit together.\n\n52:20.840 --> 52:21.840\n Yeah.\n\n52:21.840 --> 52:26.400\n And so like the hard times, going through hard times together, especially when the hard\n\n52:26.400 --> 52:32.680\n times are between the two of you, that, that if, I mean, that's always a risk, but if it,\n\n52:32.680 --> 52:37.320\n if you can find a way through that can bond you stronger, that's the fascinating thing\n\n52:37.320 --> 52:38.320\n about human relations.\n\n52:38.320 --> 52:39.320\n There's no question.\n\n52:39.320 --> 52:45.040\n And even if it doesn't keep you forever, you still have a connection that doesn't, that\n\n52:45.040 --> 52:46.560\n exists that.\n\n52:46.560 --> 52:48.840\n So I can give you one where you said, what is it about commitment?\n\n52:48.840 --> 52:52.000\n I'll give you one, I think beautiful answer.\n\n52:52.000 --> 52:58.480\n Someone once asked Rabbi Soloveitchik, who was a great thinker and leader in the Orthodox\n\n52:58.480 --> 53:00.200\n community in the 20th century.\n\n53:00.200 --> 53:02.120\n They said, you know, I go from religion to religion.\n\n53:02.120 --> 53:05.640\n I just take what I think is beautiful in it.\n\n53:05.640 --> 53:09.960\n And his answer was that you're treating religion like a nomad.\n\n53:09.960 --> 53:14.400\n He said, nomads go from place to place and they eat what they want and they move on.\n\n53:14.400 --> 53:16.280\n He says, farmers stay in one place.\n\n53:16.280 --> 53:19.840\n The difference is farmers make things grow.\n\n53:19.840 --> 53:23.460\n And I think that that's true also, when you think about the relationships you have, things\n\n53:23.460 --> 53:29.280\n have grown out of the relationships that you've invested in, that you farmed basically, that\n\n53:29.280 --> 53:35.320\n can't exist in fly by night relationships.\n\n53:35.320 --> 53:38.760\n Can you talk about, can we talk about the Torah?\n\n53:38.760 --> 53:39.760\n Yes.\n\n53:39.760 --> 53:40.760\n What is it?\n\n53:40.760 --> 53:46.000\n And is it the literal word of God?\n\n53:46.000 --> 53:47.000\n Easy questions.\n\n53:47.000 --> 53:48.000\n Yeah.\n\n53:48.000 --> 53:52.240\n Well, the Torah is the five books of Moses written in Hebrew.\n\n53:52.240 --> 53:57.900\n I like most, I think modern rabbis, non Orthodox or non literalist rabbis will tell you that\n\n53:57.900 --> 54:01.320\n it's a product of human beings.\n\n54:01.320 --> 54:08.400\n And I believe that they are inspired by God, but it's clear to me that it's a human product.\n\n54:08.400 --> 54:14.880\n And I think that people who study modern biblical criticism, it's really hard to study modern\n\n54:14.880 --> 54:17.960\n criticism, it gives a wrong impression.\n\n54:17.960 --> 54:23.960\n I would say modern scholarship on the Bible and not appreciate the fact that it even has\n\n54:23.960 --> 54:25.640\n levels of language.\n\n54:25.640 --> 54:32.360\n I mean, it's just like if you read today, somebody writing like Shakespeare, you would\n\n54:32.360 --> 54:36.160\n say this isn't, it's like English has developed.\n\n54:36.160 --> 54:37.160\n It's different.\n\n54:37.160 --> 54:38.440\n It's not the English we speak today.\n\n54:38.440 --> 54:42.360\n And if you study the Bible and you know Hebrew well enough, you even see that this was written\n\n54:42.360 --> 54:46.840\n over hundreds and hundreds and hundreds of years.\n\n54:46.840 --> 54:48.400\n It is a holy book.\n\n54:48.400 --> 54:56.080\n And I like the idea that it is, what you say in Hebrew is Torah is from heaven, but it's\n\n54:56.080 --> 54:57.860\n not from Sinai.\n\n54:57.860 --> 55:03.600\n So it has its origin beyond us, but it has things in it that I think, and this is one\n\n55:03.600 --> 55:11.220\n of the things that was a huge controversy at my congregation when I started to do same\n\n55:11.220 --> 55:13.280\n sex marriages.\n\n55:13.280 --> 55:19.040\n There are some people who try to argue that the Torah does not forbid them.\n\n55:19.040 --> 55:24.160\n Whether it does or not, it seems to me, we understand things that were not understood\n\n55:24.160 --> 55:27.920\n in the ancient world about gender and sexuality.\n\n55:27.920 --> 55:35.680\n And so you think that in the scripture, in the words, you can find the kind of spirit\n\n55:35.680 --> 55:38.000\n that supports the idea of gay marriage.\n\n55:38.000 --> 55:39.000\n Well, that's yes.\n\n55:39.000 --> 55:43.200\n That's my argument is that you criticize the Torah by the Torah.\n\n55:43.200 --> 55:54.240\n That is, it gives you the understanding that you use to evaluate its own claims.\n\n55:54.240 --> 55:57.640\n And I think that Judaism, by the way, has always done that because it's clear that there\n\n55:57.640 --> 56:04.520\n are things in the Torah that the rabbis changed, altered, grew, expanded, diminished.\n\n56:04.520 --> 56:07.520\n I think that's what it is to be part of a living tradition.\n\n56:07.520 --> 56:08.520\n Yeah.\n\n56:08.520 --> 56:15.280\n You wrote in your book, Why Faith Matters, quote, Walt Whitman wrote that in order for\n\n56:15.280 --> 56:18.520\n there to be a great books, there must be great readers.\n\n56:18.520 --> 56:23.160\n For a book to remain powerful throughout generations, it cannot have a single meaning.\n\n56:23.160 --> 56:26.760\n Scripture like great poetry is not reducible to other words.\n\n56:26.760 --> 56:33.480\n That is, one cannot paraphrase it and capture the totality of its meaning.\n\n56:33.480 --> 56:38.780\n So how the heck do you capture the meaning of the words in scripture?\n\n56:38.780 --> 56:41.120\n Is it an ongoing process through the centuries?\n\n56:41.120 --> 56:42.120\n Yes.\n\n56:42.120 --> 56:43.120\n Is that essentially what it is?\n\n56:43.120 --> 56:44.120\n Exactly so.\n\n56:44.120 --> 56:53.960\n It's a continual conversation of sages, scholars, readers, strugglers, seekers, mystics, visionaries,\n\n56:53.960 --> 56:55.480\n all of them making a contribution.\n\n56:55.480 --> 57:00.000\n I mean, I write a weekly Torah column for the Jerusalem Post.\n\n57:00.000 --> 57:03.400\n Now what is there left to say?\n\n57:03.400 --> 57:08.380\n But every week what I do is I start opening books and seeing what people say and it starts\n\n57:08.380 --> 57:14.240\n to percolate and you realize that you're entering this conversation that's been going on for\n\n57:14.240 --> 57:23.960\n thousands of years with remarkable minds and it's constantly fertile in new insights.\n\n57:23.960 --> 57:27.160\n So yes, that's what it is to be part of a tradition.\n\n57:27.160 --> 57:29.200\n Why do people keep writing love poems?\n\n57:29.200 --> 57:33.080\n We should have figured out love by this point already.\n\n57:33.080 --> 57:35.720\n I use the analogy sometimes of diet books.\n\n57:35.720 --> 57:42.020\n If any diet worked, there would be one book, there'd be one book and you'd be done.\n\n57:42.020 --> 57:45.720\n You mentioned this fascinating story that you were a part of.\n\n57:45.720 --> 57:48.840\n You were a part of several controversies in your life.\n\n57:48.840 --> 57:50.840\n I've had a few.\n\n57:50.840 --> 57:56.320\n For someone who walks with grace through the fire, you sure have found yourself in a lot\n\n57:56.320 --> 57:57.320\n of fires.\n\n57:57.320 --> 58:03.360\n One of them, can you tell me the story of your views on gay marriage, the underlying\n\n58:03.360 --> 58:10.660\n principles that led you to fight this battle of defending gay marriage in the Jewish community?\n\n58:10.660 --> 58:19.480\n So I'm part of a congregation that is really politically split and split not only politically\n\n58:19.480 --> 58:24.040\n but split in terms of origin.\n\n58:24.040 --> 58:27.800\n We have a lot of Jews from the Middle East, from Iran, a lot of Persian Jews, a lot of\n\n58:27.800 --> 58:34.560\n Jews from Israel, some from Mexico, from other places and many that grew up in LA.\n\n58:34.560 --> 58:37.560\n Do you have any Russian Jews, the best kind?\n\n58:37.560 --> 58:45.080\n I have a few Russian Jews, not as many as I should, but we'll work on that.\n\n58:45.080 --> 58:54.080\n What happened was increasingly I became uncomfortable with people who would come to me and say,\n\n58:54.080 --> 58:58.120\n this is the only kind of person I can love.\n\n58:58.120 --> 59:02.740\n It's not the same question as an intermarriage, as a Jew marrying a non Jew, because you could\n\n59:02.740 --> 59:03.740\n find a Jew to love.\n\n59:03.740 --> 59:08.040\n You may not have found, but you could.\n\n59:08.040 --> 59:10.000\n That's a whole separate question.\n\n59:10.000 --> 59:15.320\n But I would have men in my office primarily, a couple of women, they would say, this is\n\n59:15.320 --> 59:20.360\n the only kind of person that I can enter into an intimate relationship with.\n\n59:20.360 --> 59:26.360\n How can it be that my religion has no room for me?\n\n59:26.360 --> 59:30.500\n And that was very persuasive to me.\n\n59:30.500 --> 59:37.240\n But I knew that it was going to be explosive in my community.\n\n59:37.240 --> 59:40.340\n Then by the way, it finally happened, it was literally on the front page of the New York\n\n59:40.340 --> 59:41.340\n and the LA Times.\n\n59:41.340 --> 59:42.400\n It was that explosive.\n\n59:42.400 --> 59:46.920\n So it was not a small controversy.\n\n59:46.920 --> 59:51.680\n And so what I did was I started to teach classes.\n\n59:51.680 --> 59:56.600\n Not that many people came about homosexuality and Jewish tradition and so on.\n\n59:56.600 --> 1:00:01.320\n It's funny, much, much less about lesbianism, I'm talking about in terms of the sources\n\n1:00:01.320 --> 1:00:02.320\n and so on.\n\n1:00:02.320 --> 1:00:06.520\n It's almost always about homosexuality.\n\n1:00:06.520 --> 1:00:14.160\n So and then I got ready to send out a letter.\n\n1:00:14.160 --> 1:00:22.440\n And I said to my daughter, who at the time was maybe 10 or 11, now in her mid 20s.\n\n1:00:22.440 --> 1:00:27.880\n I said, look, honey, when you go to school tomorrow or whatever it was, I said, people\n\n1:00:27.880 --> 1:00:31.640\n might be saying bad things about your dad and I just want you to be prepared for that.\n\n1:00:31.640 --> 1:00:32.860\n She said, why?\n\n1:00:32.860 --> 1:00:38.560\n And I said, because I'm going to start marrying, I'm going to start doing same sex marriages.\n\n1:00:38.560 --> 1:00:43.180\n And she looked at me quizzically and said, what took you so long?\n\n1:00:43.180 --> 1:00:48.000\n And I thought, really her face was like I said to her, I'm going to start marrying blonde\n\n1:00:48.000 --> 1:00:49.720\n haired people to brown haired people.\n\n1:00:49.720 --> 1:00:53.360\n It's like she really did not understand why there was an issue.\n\n1:00:53.360 --> 1:00:55.680\n And I thought that's exactly why.\n\n1:00:55.680 --> 1:01:01.520\n Because I know that this is, it's generational, people are raised with it, they have a deep\n\n1:01:01.520 --> 1:01:06.160\n in there, but it's not really right.\n\n1:01:06.160 --> 1:01:07.840\n It's just not right.\n\n1:01:07.840 --> 1:01:15.900\n But if you could just look back to that journey, how difficult is it to make these decisions\n\n1:01:15.900 --> 1:01:16.900\n a principle?\n\n1:01:16.900 --> 1:01:23.280\n So because you have to think about that in order to think about such decisions you yet\n\n1:01:23.280 --> 1:01:25.640\n might still have to make in the future.\n\n1:01:25.640 --> 1:01:29.640\n And I will tell you one thing I did wrong with that and one thing I did right.\n\n1:01:29.640 --> 1:01:36.860\n The thing I did right was I waited until in the communities where people objected to it,\n\n1:01:36.860 --> 1:01:45.040\n I had enough people whose kids had come out so that I had parents of kids who'd come out\n\n1:01:45.040 --> 1:01:50.740\n to refer later on other parents to so that they wouldn't feel like they were the only\n\n1:01:50.740 --> 1:01:51.740\n ones.\n\n1:01:51.740 --> 1:01:55.200\n Because once I announced it, as I thought would happen, a bunch of kids came out and\n\n1:01:55.200 --> 1:01:59.960\n said, now that the rabbi said this, mom, dad, I want you to know I'm gay.\n\n1:01:59.960 --> 1:02:03.320\n And when the parents came to me, I could say, well, listen, you're not alone, this person\n\n1:02:03.320 --> 1:02:04.760\n also you can go to.\n\n1:02:04.760 --> 1:02:05.760\n That I did right.\n\n1:02:05.760 --> 1:02:11.000\n What I did wrong was I don't think the classes were enough and I don't think enough people\n\n1:02:11.000 --> 1:02:12.360\n were prepared.\n\n1:02:12.360 --> 1:02:18.560\n And I think part of the explosion was shock and I should have prepared even more.\n\n1:02:18.560 --> 1:02:25.040\n The words you used to talk about it, the way you thought about it, was it more scholarly\n\n1:02:25.040 --> 1:02:30.760\n in the Jewish tradition or did you go to the feeling thing?\n\n1:02:30.760 --> 1:02:31.760\n No, I went to the feeling.\n\n1:02:31.760 --> 1:02:40.680\n I said, which means respect or honor for God's creations and caring for other human beings\n\n1:02:40.680 --> 1:02:44.920\n and understanding.\n\n1:02:44.920 --> 1:02:51.880\n It wasn't scholarly because I knew that the objections were not scholarly objections.\n\n1:02:51.880 --> 1:02:59.200\n And I had many beautiful and also painful stories as a result, some of which can be\n\n1:02:59.200 --> 1:03:01.320\n told and some of which really can't.\n\n1:03:01.320 --> 1:03:10.360\n But what I tried to impress also on people was how painful it is to not be able to tell\n\n1:03:10.360 --> 1:03:13.740\n the world, even your own parents, who you are.\n\n1:03:13.740 --> 1:03:16.400\n And your sexuality is not a trivial part of who you are.\n\n1:03:16.400 --> 1:03:19.280\n I mean, it's core to people.\n\n1:03:19.280 --> 1:03:22.360\n So it's one of the reasons why I'd evoke such reactions.\n\n1:03:22.360 --> 1:03:28.040\n But I would say to them, the same reason that you're reacting so strongly tells you how\n\n1:03:28.040 --> 1:03:29.040\n strongly...\n\n1:03:29.040 --> 1:03:41.800\n Anyway, it was a very powerful experience and for that I feel good about it.\n\n1:03:41.800 --> 1:03:45.560\n Afterwards, the other thing that I, again, said to my daughter afterwards, after it all\n\n1:03:45.560 --> 1:03:50.720\n died down and after all the bad things were said, I told her the Churchill one said that\n\n1:03:50.720 --> 1:03:53.280\n it's exhilarating to be shot at without result.\n\n1:03:53.280 --> 1:03:58.440\n If you go into a battle and you make it through and you're still okay, that's good.\n\n1:03:58.440 --> 1:04:00.760\n The problem is when you're in the battle, you don't know.\n\n1:04:00.760 --> 1:04:01.960\n No, you don't know.\n\n1:04:01.960 --> 1:04:10.400\n So how did it feel like, I mean, looking back, you've been, to use the word, canceled a couple\n\n1:04:10.400 --> 1:04:11.400\n of times.\n\n1:04:11.400 --> 1:04:17.680\n But I guess when you're dealing with the most difficult of questions, just as a human being,\n\n1:04:17.680 --> 1:04:22.520\n for a community that you really deeply care about, some part of it saying that you have\n\n1:04:22.520 --> 1:04:23.520\n failed.\n\n1:04:23.520 --> 1:04:25.760\n I wasn't canceled the way...\n\n1:04:25.760 --> 1:04:32.080\n I didn't lose my job, didn't lose my home, but I hurt people that I cared about.\n\n1:04:32.080 --> 1:04:33.320\n And that was the hard...\n\n1:04:33.320 --> 1:04:39.960\n I went into this to be someone who brings people together and then I would sit there\n\n1:04:39.960 --> 1:04:46.600\n and do even now, as you're well aware with stuff that's going on now, I sit there and\n\n1:04:46.600 --> 1:04:54.440\n people are really upset at me who I either am or used to be close to.\n\n1:04:54.440 --> 1:05:00.440\n Do those people in time come around?\n\n1:05:00.440 --> 1:05:04.440\n When you look now, because those are real feelings in the moment and we can learn that\n\n1:05:04.440 --> 1:05:10.240\n about social media, people, especially during COVID, there's this intensity of feeling about\n\n1:05:10.240 --> 1:05:11.240\n stuff.\n\n1:05:11.240 --> 1:05:17.360\n And have you learned something about the passing of feeling that turns into wisdom?\n\n1:05:17.360 --> 1:05:18.680\n No question about it.\n\n1:05:18.680 --> 1:05:24.860\n The sermon I gave this Saturday was about how Moses came down the mountain, he saw the\n\n1:05:24.860 --> 1:05:27.660\n golden calf and he broke the tablets.\n\n1:05:27.660 --> 1:05:31.120\n If he'd sat with it for a little while, he probably wouldn't have broken the tablets.\n\n1:05:31.120 --> 1:05:34.440\n But the instant reaction is always anger.\n\n1:05:34.440 --> 1:05:40.160\n And in our age, unfortunately, the instant reaction gets put on social media forever\n\n1:05:40.160 --> 1:05:42.420\n and ever and ever.\n\n1:05:42.420 --> 1:05:46.640\n And by the way, once you've actually said that, it becomes harder to back down.\n\n1:05:46.640 --> 1:05:52.240\n If you keep quiet for a day or two, then you can back down because you haven't put yourself\n\n1:05:52.240 --> 1:05:53.240\n out there.\n\n1:05:53.240 --> 1:05:57.600\n But once you said, this is terrible what you did, it's harder to write and say, I'm sorry,\n\n1:05:57.600 --> 1:05:59.360\n I shouldn't have said that.\n\n1:05:59.360 --> 1:06:08.920\n Yeah, so it almost becomes, I mean, I actually, it's a really powerful statement that the\n\n1:06:08.920 --> 1:06:18.120\n downside of saying something on the internet is that it actually pulls you into this current.\n\n1:06:18.120 --> 1:06:22.440\n You both create the current and it pulls you into it, to where it's actually very hard\n\n1:06:22.440 --> 1:06:23.600\n to escape.\n\n1:06:23.600 --> 1:06:28.400\n So when two days later you feel different, there's a momentum, there's now a tribe of\n\n1:06:28.400 --> 1:06:31.380\n people that feel this way and there's a momentum with it.\n\n1:06:31.380 --> 1:06:34.720\n There's a momentum and also you don't want to betray your own tribe because then people\n\n1:06:34.720 --> 1:06:36.400\n will get upset at you.\n\n1:06:36.400 --> 1:06:42.200\n I really think that a lot of the antagonism is not so much that you don't want to give\n\n1:06:42.200 --> 1:06:45.640\n ground to the people who oppose you, it's that you don't want to break with the people\n\n1:06:45.640 --> 1:06:47.360\n who are behind you.\n\n1:06:47.360 --> 1:06:48.640\n And that's really hard.\n\n1:06:48.640 --> 1:06:54.960\n Can you tell the story of this recent controversy, the sermon you just gave?\n\n1:06:54.960 --> 1:06:56.960\n You went to the Super Bowl.\n\n1:06:56.960 --> 1:07:01.800\n I think a lot of people would relate to this because to me personally, I apologize to anybody\n\n1:07:01.800 --> 1:07:03.080\n who was hurt by this.\n\n1:07:03.080 --> 1:07:06.580\n The absurdity of it is deeply intense.\n\n1:07:06.580 --> 1:07:07.740\n So here's the story.\n\n1:07:07.740 --> 1:07:12.180\n The LA County mandates masking children in school and all of the kids in our school are\n\n1:07:12.180 --> 1:07:15.640\n masked and many of the parents are extremely upset about that.\n\n1:07:15.640 --> 1:07:19.220\n I will just leave that at that.\n\n1:07:19.220 --> 1:07:23.200\n I went to the Super Bowl, there were 70,000 people.\n\n1:07:23.200 --> 1:07:29.640\n Frank Luntz, whom we know was a wonderful guy, gave me a ticket.\n\n1:07:29.640 --> 1:07:35.080\n And so I was at the Super Bowl and I maybe saw two masks among the 70,000 people.\n\n1:07:35.080 --> 1:07:39.080\n I didn't even think about it, which was foolish on my part, no question.\n\n1:07:39.080 --> 1:07:43.200\n I took a picture of myself unmasked at the Super Bowl.\n\n1:07:43.200 --> 1:07:50.440\n And many, many people thought, oh, great, wonderful, glad you're having a good time,\n\n1:07:50.440 --> 1:07:51.440\n so on and so forth.\n\n1:07:51.440 --> 1:07:54.120\n I didn't diminish at all the many people who said that.\n\n1:07:54.120 --> 1:07:55.860\n A lot of people were livid.\n\n1:07:55.860 --> 1:07:56.860\n They were livid.\n\n1:07:56.860 --> 1:08:04.320\n And they weren't, what was instructive about it was they didn't say, nobody wrote me a\n\n1:08:04.320 --> 1:08:08.680\n private note and said, I think that this was a bad idea, you should have thought about\n\n1:08:08.680 --> 1:08:09.680\n this.\n\n1:08:09.680 --> 1:08:10.680\n No.\n\n1:08:10.680 --> 1:08:13.960\n They were, you're a hypocrite, you're a clown, you're an idiot, how could you do this?\n\n1:08:13.960 --> 1:08:15.040\n This is a disgrace.\n\n1:08:15.040 --> 1:08:16.400\n This is that kind of thing.\n\n1:08:16.400 --> 1:08:17.400\n They say that publicly.\n\n1:08:17.400 --> 1:08:18.400\n Oh, yeah.\n\n1:08:18.400 --> 1:08:22.160\n And on my Instagram, you can still see I left the remarks up because I really thought it\n\n1:08:22.160 --> 1:08:23.240\n was important.\n\n1:08:23.240 --> 1:08:28.160\n If I started, I only deleted the really vile comments because I thought that shouldn't\n\n1:08:28.160 --> 1:08:29.160\n stay up.\n\n1:08:29.160 --> 1:08:33.600\n But I left them up because I thought like people should see and I should remind myself\n\n1:08:33.600 --> 1:08:34.600\n what I did.\n\n1:08:34.600 --> 1:08:37.760\n And I didn't want to just delete the picture as though it didn't happen because it did\n\n1:08:37.760 --> 1:08:39.880\n happen and I did do it.\n\n1:08:39.880 --> 1:08:41.720\n And I felt terrible about that.\n\n1:08:41.720 --> 1:08:46.840\n And I felt terrible that I had, not about, I mean, the comments, believe me, weren't\n\n1:08:46.840 --> 1:08:47.840\n pleasant.\n\n1:08:47.840 --> 1:08:49.120\n I didn't like it.\n\n1:08:49.120 --> 1:08:50.120\n Nobody likes it.\n\n1:08:50.120 --> 1:08:53.680\n But I felt worse that I had hurt all these people that I'm close to.\n\n1:08:53.680 --> 1:08:56.840\n And I defended all these people who were really upset that their kids were wearing masks and\n\n1:08:56.840 --> 1:09:00.080\n now their kid says, why doesn't a rabbi have to wear a mask?\n\n1:09:00.080 --> 1:09:03.240\n Well, first of all, it is tough to be a rabbi.\n\n1:09:03.240 --> 1:09:11.040\n I mean, the masks to me symbolize these kinds of discussions, symbolize not necessarily\n\n1:09:11.040 --> 1:09:15.540\n the issues at hand, but the intensity of feeling and people are really struggling.\n\n1:09:15.540 --> 1:09:22.200\n People are in pain, they're lonely, the uncertainty of it, you don't know who to trust.\n\n1:09:22.200 --> 1:09:23.200\n Everything is under question.\n\n1:09:23.200 --> 1:09:28.040\n The institutions, even the scientific institutions, and there's all these conspiracy theories\n\n1:09:28.040 --> 1:09:29.040\n flying around.\n\n1:09:29.040 --> 1:09:30.360\n You don't know who to believe.\n\n1:09:30.360 --> 1:09:34.640\n And there's people just yelling at each other and politics is weaved into this whole thing\n\n1:09:34.640 --> 1:09:35.640\n in some messy way.\n\n1:09:35.640 --> 1:09:42.160\n And you're just getting, I mean, honestly, it's just like legit, simple, just frustration,\n\n1:09:42.160 --> 1:09:50.120\n going back to marriage of just hanging out with the kids and your wife, husband, just\n\n1:09:50.120 --> 1:09:54.220\n distressed, just building up over time, no release.\n\n1:09:54.220 --> 1:09:58.560\n And just people want to tell you when the rabbi is not wearing a mask, even though it's\n\n1:09:58.560 --> 1:10:03.800\n at the damn Super Bowl, maybe you want to comment on the Super Bowl part, which is awesome.\n\n1:10:03.800 --> 1:10:09.240\n But it released clearly a dam of all the kinds of feelings that you're talking about.\n\n1:10:09.240 --> 1:10:11.600\n So how do you then write a sermon?\n\n1:10:11.600 --> 1:10:18.940\n So what I did was I didn't answer on social media because I knew that I wouldn't be able\n\n1:10:18.940 --> 1:10:22.780\n to formulate it the way I wanted, and I was going to wait, and I was going to be able\n\n1:10:22.780 --> 1:10:26.600\n to give a longer, I mean, the sermon is 15 minutes, not that long.\n\n1:10:26.600 --> 1:10:33.180\n But I wanted to be able to give a longer answer as opposed to a tweet.\n\n1:10:33.180 --> 1:10:41.080\n And so I was really, I mean, I tried to make two points during the sermon, and also I published\n\n1:10:41.080 --> 1:10:43.280\n the text of it, which I never do because I never speak from a text.\n\n1:10:43.280 --> 1:10:46.420\n I always speak from either notes or not even from notes.\n\n1:10:46.420 --> 1:10:49.380\n But this time I thought it was really important that I have a text out there too so that people\n\n1:10:49.380 --> 1:10:53.320\n could actually look over it.\n\n1:10:53.320 --> 1:10:57.600\n And I just wanted to make two points, one of which was that I really feel terrible.\n\n1:10:57.600 --> 1:11:03.600\n And I did, that all these people were hurt and that there is this contradiction between\n\n1:11:03.600 --> 1:11:05.960\n the way I acted and the way they want me to act.\n\n1:11:05.960 --> 1:11:10.240\n And I also think, by the way, I didn't speak about this, but I also think that there are\n\n1:11:10.240 --> 1:11:14.100\n some people who just don't like the idea of a rabbi being at the Super Bowl.\n\n1:11:14.100 --> 1:11:17.400\n It's like you're supposed to be doing rabbi stuff.\n\n1:11:17.400 --> 1:11:19.840\n So I understand that too.\n\n1:11:19.840 --> 1:11:20.840\n But then...\n\n1:11:20.840 --> 1:11:21.840\n Yeah.\n\n1:11:21.840 --> 1:11:27.600\n But rabbi at the Super Bowl, I mean, you are also, I hate to say it, but there's a rock\n\n1:11:27.600 --> 1:11:32.220\n star nature to you talking to Christopher Hitchens, contending with ideas, inspiring\n\n1:11:32.220 --> 1:11:33.760\n so many other minds.\n\n1:11:33.760 --> 1:11:36.160\n I mean, there's an educational aspect to this.\n\n1:11:36.160 --> 1:11:37.160\n I appreciate that.\n\n1:11:37.160 --> 1:11:38.160\n It's making ideas cool.\n\n1:11:38.160 --> 1:11:40.320\n I mean, that's a very powerful...\n\n1:11:40.320 --> 1:11:42.720\n I mean, that is also the job of a rabbi.\n\n1:11:42.720 --> 1:11:45.440\n You're not just supposed to do rabbi stuff, it's to educate the spot.\n\n1:11:45.440 --> 1:11:49.200\n Yeah, but I didn't do so much of that at the game.\n\n1:11:49.200 --> 1:11:54.120\n So nonetheless.\n\n1:11:54.120 --> 1:12:00.880\n But the second part of it was I said that we have to be able to express our anger and\n\n1:12:00.880 --> 1:12:03.000\n disappointment better than this.\n\n1:12:03.000 --> 1:12:04.840\n You just have to.\n\n1:12:04.840 --> 1:12:08.960\n In part because it doesn't get you the result that you want.\n\n1:12:08.960 --> 1:12:16.840\n I mean, when you scream at someone, that's not gonna get them to realize what they did.\n\n1:12:16.840 --> 1:12:23.640\n And the most painful moment of it was this letter that I got from a Christian pastor\n\n1:12:23.640 --> 1:12:27.500\n who said, you know, I always admired the Jews so much, I can't believe they could be so\n\n1:12:27.500 --> 1:12:30.240\n cruel and especially to a rabbi.\n\n1:12:30.240 --> 1:12:36.960\n And I thought that's not how I want my congregation to be perceived in the world.\n\n1:12:36.960 --> 1:12:46.240\n And by the way, some of them were from my congregation, some many were not from my congregation.\n\n1:12:46.240 --> 1:12:51.680\n And I spoke about what you talked about, which is that I mentioned before that Moses broke\n\n1:12:51.680 --> 1:12:54.260\n those tablets coming down the mountain.\n\n1:12:54.260 --> 1:12:57.340\n And the Torah doesn't say what happened to the tablets, but the rabbis do.\n\n1:12:57.340 --> 1:13:01.520\n They say that they were carried together in the ark with the second set that was intact.\n\n1:13:01.520 --> 1:13:04.440\n And that we all have brokenness, communities and individuals.\n\n1:13:04.440 --> 1:13:10.000\n We have brokenness and especially now, and we have to learn how to give each other space\n\n1:13:10.000 --> 1:13:14.760\n to be mistaken and broken and hurt and all of that.\n\n1:13:14.760 --> 1:13:18.120\n And the cool thing when you give people that space, you feel better.\n\n1:13:18.120 --> 1:13:24.080\n I mean, you for caring for the community, it feels better when you show empathy and\n\n1:13:24.080 --> 1:13:26.440\n compassion and kindness on the internet.\n\n1:13:26.440 --> 1:13:29.080\n You'll actually feel better a week from now.\n\n1:13:29.080 --> 1:13:36.000\n You'll feel much worse if you make some kind of a negative statement of principle on the\n\n1:13:36.000 --> 1:13:37.000\n internet.\n\n1:13:37.000 --> 1:13:39.480\n It's almost just exclusively true.\n\n1:13:39.480 --> 1:13:45.140\n So if you care about feeling good, just be kind first, be empathetic first.\n\n1:13:45.140 --> 1:13:46.760\n Almost always the case.\n\n1:13:46.760 --> 1:13:48.020\n Exactly so.\n\n1:13:48.020 --> 1:13:53.460\n So it's, I mean, it settled down a lot.\n\n1:13:53.460 --> 1:14:00.840\n The most, really the single best reaction, there are people and you can, again, you can\n\n1:14:00.840 --> 1:14:04.740\n go on social media, you can see all the criticisms and so on and so forth.\n\n1:14:04.740 --> 1:14:10.300\n But the single best reaction I got was from a man who came up to me right after the sermon\n\n1:14:10.300 --> 1:14:12.760\n and said, I have four words for you.\n\n1:14:12.760 --> 1:14:20.120\n And I thought, oh no, I got to confess, I said, I said what?\n\n1:14:20.120 --> 1:14:23.920\n He said, you changed my mind.\n\n1:14:23.920 --> 1:14:25.160\n And I thought, wow.\n\n1:14:25.160 --> 1:14:30.000\n And I, I said to him, you know, that's so, it's like to take so much courage to come\n\n1:14:30.000 --> 1:14:32.040\n up to somebody and say that in front of them.\n\n1:14:32.040 --> 1:14:34.160\n And I was so grateful.\n\n1:14:34.160 --> 1:14:37.800\n And the other thing that it tells me is, look, I've been the rabbi of that congregation for\n\n1:14:37.800 --> 1:14:41.480\n 25 years and I taught 10 years before that, I've been a rabbi for a long time.\n\n1:14:41.480 --> 1:14:43.780\n I still, I still have a lot to learn.\n\n1:14:43.780 --> 1:14:48.520\n We talked a little bit about the difference between Judaism, Christianity and Islam, cause\n\n1:14:48.520 --> 1:14:56.120\n you maybe talk about the difference between the Torah, the Bible and the Koran.\n\n1:14:56.120 --> 1:15:03.240\n So there's the Hebrew Bible is actually what's called a step canon.\n\n1:15:03.240 --> 1:15:06.200\n That is there are the five books of the Torah.\n\n1:15:06.200 --> 1:15:09.040\n Then there are books of history and the prophets.\n\n1:15:09.040 --> 1:15:18.260\n So books like Samuel, Kings, Judges, and then the prophets, Isaiah, Jeremiah, Amos, Ezekiel,\n\n1:15:18.260 --> 1:15:19.560\n and so on.\n\n1:15:19.560 --> 1:15:21.880\n And then there are what are called the writings.\n\n1:15:21.880 --> 1:15:29.120\n The writings are books like Psalms, Proverbs, Job, the Migilot, which are Esther, Daniel,\n\n1:15:29.120 --> 1:15:34.360\n all of those, all of those books, Ecclesiastes.\n\n1:15:34.360 --> 1:15:40.400\n So in Hebrew, it's called the Tanakh, Torah, Neviim, Ketuvim, the Torah, the prophets and\n\n1:15:40.400 --> 1:15:41.400\n the writings.\n\n1:15:41.400 --> 1:15:43.660\n And that is the Hebrew Bible.\n\n1:15:43.660 --> 1:15:47.580\n Sometimes that's also called the Torah, just to be confusing, but really the Torah generally\n\n1:15:47.580 --> 1:15:49.880\n refers to the five books.\n\n1:15:49.880 --> 1:15:56.200\n Then there is the New Testament, which the Jews don't recognize as a sacred book.\n\n1:15:56.200 --> 1:15:59.680\n They recognize it as the book of another religion.\n\n1:15:59.680 --> 1:16:04.840\n And I sometimes say to Christians, in order for them to really grasp this, Jesus has as\n\n1:16:04.840 --> 1:16:09.860\n much religious significance to Judaism as Muhammad has to Christianity.\n\n1:16:09.860 --> 1:16:14.200\n That is Jesus, although Jewish, became the founder of another religion.\n\n1:16:14.200 --> 1:16:19.460\n And for Judaism, that's not only in as much as Christians and Jews have had a lot of interactions,\n\n1:16:19.460 --> 1:16:22.940\n but religiously, Jesus has no significance.\n\n1:16:22.940 --> 1:16:25.680\n Said many beautiful things, said some things I don't like so much.\n\n1:16:25.680 --> 1:16:26.680\n Like what?\n\n1:16:26.680 --> 1:16:27.680\n Like what?\n\n1:16:27.680 --> 1:16:28.680\n Leave your father and mother and follow me.\n\n1:16:28.680 --> 1:16:32.480\n I don't like that as a religious model.\n\n1:16:32.480 --> 1:16:38.980\n Now Christians will say that I don't understand that, but that's because Christians like Jews\n\n1:16:38.980 --> 1:16:42.120\n interpret their texts different ways at different times.\n\n1:16:42.120 --> 1:16:48.800\n So anyway, the Koran, which I know less well.\n\n1:16:48.800 --> 1:16:51.740\n I have read it, but I know it less well than I know the New Testament and certainly less\n\n1:16:51.740 --> 1:17:02.440\n well obviously than I know the Hebrew Bible, is in some ways a, parts of it are, I don't\n\n1:17:02.440 --> 1:17:06.460\n say this word, I say this word because I can't find a better descriptive word, but Muslims\n\n1:17:06.460 --> 1:17:11.320\n will not accept this, okay, is a takeoff on the Torah in some things.\n\n1:17:11.320 --> 1:17:14.540\n That is, it's the same stories as the Torah, but they're different.\n\n1:17:14.540 --> 1:17:19.300\n Now Jews will say, and I being a Jew will say this, that that's because Muhammad heard\n\n1:17:19.300 --> 1:17:24.240\n those stories from Jews and also heard Midrashim, which are rabbinic interpretations of those\n\n1:17:24.240 --> 1:17:26.700\n stories and he wrote those down.\n\n1:17:26.700 --> 1:17:30.940\n Muslims will say, no, the Jews got it wrong and Muhammad came along to correct the record\n\n1:17:30.940 --> 1:17:32.520\n and tell the real story.\n\n1:17:32.520 --> 1:17:37.680\n But they're all telling the story of the same thing.\n\n1:17:37.680 --> 1:17:43.360\n The Hebrew Bible part, the Abrahamic part, they all tell the story of the same characters,\n\n1:17:43.360 --> 1:17:49.160\n but tell them, obviously Christians accept the Hebrew Bible as sacred scripture.\n\n1:17:49.160 --> 1:17:55.680\n The Muslims retell many of the stories in the Bible.\n\n1:17:55.680 --> 1:18:00.740\n What is common to all of them is that all of them are monotheistic faiths.\n\n1:18:00.740 --> 1:18:06.160\n Now in Christianity, that's more complicated because of the Trinity, but as Christianity\n\n1:18:06.160 --> 1:18:12.040\n has developed over time, it clearly presents itself and thinks of itself and is a monotheistic\n\n1:18:12.040 --> 1:18:13.040\n faith as well.\n\n1:18:13.040 --> 1:18:17.180\n What's the role of the word in each of these religions, in the scriptures?\n\n1:18:17.180 --> 1:18:23.400\n So in terms of, so first of all, the role of oral traditions, the power of the exactness\n\n1:18:23.400 --> 1:18:28.920\n of the words in the scripture, does it differ or is it really within the communities it\n\n1:18:28.920 --> 1:18:29.920\n differs?\n\n1:18:29.920 --> 1:18:37.200\n Just because in Christianity, the words are not all the words of Jesus.\n\n1:18:37.200 --> 1:18:39.760\n They're the words of Jesus's disciples.\n\n1:18:39.760 --> 1:18:43.920\n None of the books of the New Testament were written by people who met Jesus in person.\n\n1:18:43.920 --> 1:18:49.080\n So they're different and therefore, and also we don't even know sometimes the original\n\n1:18:49.080 --> 1:18:54.900\n language of some of the things in the New Testament.\n\n1:18:54.900 --> 1:18:59.520\n In the Bible, and I understand in the Koran, but I'll speak for the Hebrew Bible, the\n\n1:18:59.520 --> 1:19:06.320\n idea is that that's Lashon HaKodesh, that's sacred language, and Hebrew, that's the language\n\n1:19:06.320 --> 1:19:10.900\n according to the tradition that God actually spoke to Moses, and therefore the exact words\n\n1:19:10.900 --> 1:19:15.000\n are infinitely interpretable and meaningful.\n\n1:19:15.000 --> 1:19:22.120\n But the words are spoken by, written by Moses, and the same with Muhammad, but from memory\n\n1:19:22.120 --> 1:19:23.120\n or no?\n\n1:19:23.120 --> 1:19:24.800\n There are different theories.\n\n1:19:24.800 --> 1:19:27.360\n I won't speak for Muhammad, you should ask.\n\n1:19:27.360 --> 1:19:31.280\n I don't want to get another religious tradition wrong.\n\n1:19:31.280 --> 1:19:35.620\n In Judaism, the words are written by Moses at God's dictation, basically.\n\n1:19:35.620 --> 1:19:36.880\n That's the traditional view.\n\n1:19:36.880 --> 1:19:40.160\n There are other views that I'm happy to go into if you want to, but basically that's\n\n1:19:40.160 --> 1:19:41.160\n the traditional view.\n\n1:19:41.160 --> 1:19:44.640\n So it's pretty close to the words of God.\n\n1:19:44.640 --> 1:19:50.840\n What makes Judaism and Christianity different is Christianity has an ideal life.\n\n1:19:50.840 --> 1:19:53.520\n Judaism doesn't have an ideal life.\n\n1:19:53.520 --> 1:19:55.580\n Judaism has an ideal book.\n\n1:19:55.580 --> 1:20:01.360\n So the holidays of Christianity are events in the life of God, God's birth, God's death\n\n1:20:01.360 --> 1:20:03.100\n and resurrection.\n\n1:20:03.100 --> 1:20:08.520\n In Judaism, the holidays are all events in the life of the people, like the liberation\n\n1:20:08.520 --> 1:20:13.720\n from slavery, or in the people's relationship to God, like Yom Kippur, which is a day of\n\n1:20:13.720 --> 1:20:15.020\n atonement.\n\n1:20:15.020 --> 1:20:19.000\n But there are no holidays in Judaism that are events in the life of God because in Judaism\n\n1:20:19.000 --> 1:20:21.480\n God doesn't have a biography.\n\n1:20:21.480 --> 1:20:24.400\n God is eternal, and God never came to earth.\n\n1:20:24.400 --> 1:20:29.000\n And those events carry with them traditions and rules that you're to follow.\n\n1:20:29.000 --> 1:20:30.000\n Yes.\n\n1:20:30.000 --> 1:20:35.960\n And you mention on one such event in Scripture, yet another time you walked through the fire,\n\n1:20:35.960 --> 1:20:38.360\n which is with Exodus.\n\n1:20:38.360 --> 1:20:41.080\n That was the first.\n\n1:20:41.080 --> 1:20:44.160\n And you never forget the first.\n\n1:20:44.160 --> 1:20:47.680\n One of several controversies.\n\n1:20:47.680 --> 1:20:53.460\n You spoke 20 years ago, 21 years ago now at Passover and said that, quote, the way the\n\n1:20:53.460 --> 1:20:59.280\n Bible describes the Exodus is not the way it happened, if it happened at all.\n\n1:20:59.280 --> 1:21:03.640\n So first of all, what is Exodus, and what really happened?\n\n1:21:03.640 --> 1:21:07.000\n Exodus is the liberation of the Jews from Egypt, and it is the central story of the\n\n1:21:07.000 --> 1:21:08.800\n Jewish tradition.\n\n1:21:08.800 --> 1:21:16.360\n And as I've said numerous times in various places, I believe that it's based on a historical\n\n1:21:16.360 --> 1:21:17.360\n kernel.\n\n1:21:17.360 --> 1:21:20.320\n I think Richard Eliot Friedman may have gotten this right in his book Exodus.\n\n1:21:20.320 --> 1:21:27.520\n It may have been the Levites who left Israel.\n\n1:21:27.520 --> 1:21:30.360\n But the Bible is not a book of history.\n\n1:21:30.360 --> 1:21:37.420\n I don't believe that there were 10 plagues and a split sea and 600,000 men, which makes\n\n1:21:37.420 --> 1:21:42.200\n about 2 million people, who actually, if there were 2 million people, would stretch all the\n\n1:21:42.200 --> 1:21:48.740\n way from Israel to Egypt alone, were liberated from Egypt.\n\n1:21:48.740 --> 1:21:53.140\n And my point in that sermon was not actually to convince people that it didn't happen.\n\n1:21:53.140 --> 1:21:59.520\n My point in that sermon was to convince people that the historicity of the Exodus is not\n\n1:21:59.520 --> 1:22:01.680\n the basis of the faith of the Jewish people.\n\n1:22:01.680 --> 1:22:03.720\n Well, what does the word historicity mean?\n\n1:22:03.720 --> 1:22:05.400\n In other words, the factuality of it.\n\n1:22:05.400 --> 1:22:06.880\n It can be true without being factual.\n\n1:22:06.880 --> 1:22:10.280\n So you're not supposed to read it as fact?\n\n1:22:10.280 --> 1:22:12.680\n Well, I don't read it as fact.\n\n1:22:12.680 --> 1:22:13.840\n I don't read it as a history book.\n\n1:22:13.840 --> 1:22:18.440\n I said, look, I was talking, again, to a congregation that had many Iranians.\n\n1:22:18.440 --> 1:22:22.720\n I said, you experienced the truth of the Exodus in your own life.\n\n1:22:22.720 --> 1:22:26.160\n There was a regime that wanted to destroy you.\n\n1:22:26.160 --> 1:22:30.640\n And you miraculously escaped before it did.\n\n1:22:30.640 --> 1:22:40.000\n And so a myth is something that may not have happened, but is always happening.\n\n1:22:40.000 --> 1:22:42.400\n And that's what I would say about the Exodus story.\n\n1:22:42.400 --> 1:22:47.080\n It's not about whether, in fact, there was a killing of the firstborn.\n\n1:22:47.080 --> 1:22:49.260\n It's about, does God deliver?\n\n1:22:49.260 --> 1:22:51.120\n Did God deliver the Jews in ancient times?\n\n1:22:51.120 --> 1:22:52.960\n Does God deliver people in modern times?\n\n1:22:52.960 --> 1:22:57.480\n And that's what the issue is.\n\n1:22:57.480 --> 1:23:02.920\n And to me, the issue of faith is much deeper than the issue of fact.\n\n1:23:02.920 --> 1:23:06.680\n I wouldn't look to the Torah for my science either.\n\n1:23:06.680 --> 1:23:15.480\n What are the limits of science in terms of, what can science not tell us that the Torah\n\n1:23:15.480 --> 1:23:17.480\n can in terms of wisdom?\n\n1:23:17.480 --> 1:23:22.280\n So the historicity, the facts of things, okay.\n\n1:23:22.280 --> 1:23:29.720\n If the Torah is much more than that, like you said, myth is not something that happened,\n\n1:23:29.720 --> 1:23:32.000\n but something that is always happening.\n\n1:23:32.000 --> 1:23:39.680\n And so presumably it's interacting with the environment of the day to generate wisdom.\n\n1:23:39.680 --> 1:23:42.080\n So you can live a life by Torah.\n\n1:23:42.080 --> 1:23:46.000\n I don't think you can live a life by biology.\n\n1:23:46.000 --> 1:23:53.080\n You can live a life that is informed by the values of the tradition of Judaism.\n\n1:23:53.080 --> 1:24:01.540\n And those values, by the way, what science does is it contributes factuality to the conversation\n\n1:24:01.540 --> 1:24:04.760\n and also changes the reality around us.\n\n1:24:04.760 --> 1:24:12.900\n So when you study Talmud on your iPhone, you're still, I mean, it changes the atmosphere in\n\n1:24:12.900 --> 1:24:20.620\n which you do it, but the wisdom and the life guidance and the connection to transcendence\n\n1:24:20.620 --> 1:24:24.440\n is something that science doesn't give.\n\n1:24:24.440 --> 1:24:31.040\n So if we now step into returning to our friend Sam Harris and step into this weird place\n\n1:24:31.040 --> 1:24:35.320\n of science, and you talked about this, where the kind of the current assumption of science\n\n1:24:35.320 --> 1:24:39.280\n is it's a materialistic one.\n\n1:24:39.280 --> 1:24:44.780\n So for me, obviously AI person, this whole mind thing is fascinating, like what the heck\n\n1:24:44.780 --> 1:24:47.040\n is going on up there?\n\n1:24:47.040 --> 1:24:49.960\n So how do you explain consciousness?\n\n1:24:49.960 --> 1:24:51.800\n How do you explain free will?\n\n1:24:51.800 --> 1:24:58.340\n Do you think, first of all, do you think we have a free will and if so, what is it?\n\n1:24:58.340 --> 1:25:05.180\n This is where we had the debate earlier that I mentioned with Hitchens where I think actually\n\n1:25:05.180 --> 1:25:11.400\n neither he nor the moderator understood what I was saying, which is I'm sure my inability\n\n1:25:11.400 --> 1:25:12.400\n to express it.\n\n1:25:12.400 --> 1:25:17.360\n But he was very focused and delivered on the humor and the wit.\n\n1:25:17.360 --> 1:25:18.360\n Yes.\n\n1:25:18.360 --> 1:25:26.120\n But what I was trying to say is if we're entirely biological creatures, if we didn't choose\n\n1:25:26.120 --> 1:25:31.720\n our genetics and we didn't choose our environment, then there is no space for free choice.\n\n1:25:31.720 --> 1:25:33.280\n I don't understand where it comes in.\n\n1:25:33.280 --> 1:25:37.120\n And I kept asking them that question but didn't get an answer because I don't think there\n\n1:25:37.120 --> 1:25:38.120\n is an answer.\n\n1:25:38.120 --> 1:25:43.520\n I think if you're a thoroughgoing materialist, free will is impossible.\n\n1:25:43.520 --> 1:25:48.720\n There could be randomness, but randomness is not free will, it's randomness.\n\n1:25:48.720 --> 1:25:56.840\n I think you need a spiritual nonmaterial belief in order to get free will and that's why I\n\n1:25:56.840 --> 1:25:57.840\n believe in free will.\n\n1:25:57.840 --> 1:26:01.400\n Yeah, you were talking about sort of, yeah, and actually the moderator totally missed\n\n1:26:01.400 --> 1:26:05.000\n your point about the glass of water and basically how, what's the difference.\n\n1:26:05.000 --> 1:26:10.680\n So do you, free will, because you could also, if it fits into the materialistic picture,\n\n1:26:10.680 --> 1:26:13.920\n it could be just a convenient, useful quirk.\n\n1:26:13.920 --> 1:26:15.320\n You would understand this better than I would.\n\n1:26:15.320 --> 1:26:20.360\n I don't understand how it could be a convenient quirk materialistic, I don't understand how\n\n1:26:20.360 --> 1:26:21.360\n to explain it.\n\n1:26:21.360 --> 1:26:25.840\n Well, no, there's, you know, if you study perception, there's all these kinds of illusions.\n\n1:26:25.840 --> 1:26:32.360\n We are, our mind plays tricks on us to make our life easier, more efficient and survive\n\n1:26:32.360 --> 1:26:34.020\n better and all those kinds of things.\n\n1:26:34.020 --> 1:26:37.360\n And so free, the feeling like we have a choice.\n\n1:26:37.360 --> 1:26:38.360\n Oh, that could be an illusion.\n\n1:26:38.360 --> 1:26:39.360\n Could be an illusion.\n\n1:26:39.360 --> 1:26:40.360\n That I understand.\n\n1:26:40.360 --> 1:26:41.360\n Right.\n\n1:26:41.360 --> 1:26:43.080\n But, but actual free choice, free will.\n\n1:26:43.080 --> 1:26:45.560\n I don't see where you get it if you're a materialist.\n\n1:26:45.560 --> 1:26:49.080\n I think you have to have a spiritual component.\n\n1:26:49.080 --> 1:26:53.120\n By the way, this, I think this is also, I think Sam would agree with this.\n\n1:26:53.120 --> 1:26:58.360\n I think he wrote about not having, not having free will.\n\n1:26:58.360 --> 1:27:05.760\n And I think if you don't have a God and you don't have a soul, that free will is a logical\n\n1:27:05.760 --> 1:27:06.760\n impossibility.\n\n1:27:06.760 --> 1:27:14.220\n But Sam, which is fascinating, it's not just that free will is an illusion, but the illusion\n\n1:27:14.220 --> 1:27:19.280\n of free will is an illusion, meaning there's not, we don't even experience anything like\n\n1:27:19.280 --> 1:27:20.280\n it.\n\n1:27:20.280 --> 1:27:21.280\n There's no illusion.\n\n1:27:21.280 --> 1:27:24.760\n We're like, it's not even honest to be talking about it.\n\n1:27:24.760 --> 1:27:29.400\n We're just, we are like the, the, the, the, the currents in the river or something that\n\n1:27:29.400 --> 1:27:30.720\n you were comparing it to the glass.\n\n1:27:30.720 --> 1:27:31.720\n We are just like that glass.\n\n1:27:31.720 --> 1:27:32.720\n Right.\n\n1:27:32.720 --> 1:27:35.400\n So I don't know what we're going on about with this whole free will thing.\n\n1:27:35.400 --> 1:27:41.960\n I mean, to you is the free will, the I that the young person is born with, is that somehow\n\n1:27:41.960 --> 1:27:43.960\n fundamental to religion?\n\n1:27:43.960 --> 1:27:46.280\n I think it's fundamental to Judaism.\n\n1:27:46.280 --> 1:27:55.160\n I think that the, the idea is that you are the custodian of your soul.\n\n1:27:55.160 --> 1:28:04.480\n And even though I grant that there's a certain over emphasis in modern society on the individuality\n\n1:28:04.480 --> 1:28:15.560\n of the soul, that is we are more interconnected than I think we're, we believe, still, yeah,\n\n1:28:15.560 --> 1:28:20.080\n the I, the idea that every human being is an image of God, that, I mean, that the human\n\n1:28:20.080 --> 1:28:22.960\n being in the Torah is, is created singly.\n\n1:28:22.960 --> 1:28:26.800\n And again, do I really believe there was an Adam and an Eve and a garden of Eden?\n\n1:28:26.800 --> 1:28:33.340\n No, not literally, but I think that it's, it expresses a deep truth about human life.\n\n1:28:33.340 --> 1:28:38.240\n And tied into this is the subject of experience of things, which we call consciousness.\n\n1:28:38.240 --> 1:28:45.960\n I mean, this is the most fascinating and inexplicable discussion.\n\n1:28:45.960 --> 1:28:50.920\n And again, this is a discussion I've had, I privileged to have with Daniel Dennett and\n\n1:28:50.920 --> 1:28:58.100\n could not make any, as you can imagine, any headway on my, but he was delightful and brilliant\n\n1:28:58.100 --> 1:29:00.520\n to talk to.\n\n1:29:00.520 --> 1:29:05.880\n I, for me, consciousness is a real thing.\n\n1:29:05.880 --> 1:29:11.760\n I don't know if it is, I mean, I kind of like the pan psych, psychists view that there's\n\n1:29:11.760 --> 1:29:18.140\n an element of consciousness in everything that that's constitutive of reality.\n\n1:29:18.140 --> 1:29:24.300\n But I don't, I'm not wedded to it, but I think that it's, it exists in different degrees\n\n1:29:24.300 --> 1:29:26.520\n in all sentient creatures.\n\n1:29:26.520 --> 1:29:31.800\n I think that anybody who has a pet knows that they have some kind of consciousness.\n\n1:29:31.800 --> 1:29:32.800\n Except cats.\n\n1:29:32.800 --> 1:29:37.200\n I'm not going to, I, since I don't have cats or dogs, I'm not going to.\n\n1:29:37.200 --> 1:29:39.360\n This is another reason people would be outraged.\n\n1:29:39.360 --> 1:29:40.360\n I said it.\n\n1:29:40.360 --> 1:29:44.240\n Well, I happen to be allergic to both, but I'm very fond of animals.\n\n1:29:44.240 --> 1:29:52.880\n The thing that so perplexes me about this and, and is the denial of the reality of consciousness\n\n1:29:52.880 --> 1:29:57.480\n from people who are fully aware that they're conscious.\n\n1:29:57.480 --> 1:30:02.880\n I don't know how you divest yourself of the most present quality of being a person in\n\n1:30:02.880 --> 1:30:07.480\n your discussions about what it is to be a person.\n\n1:30:07.480 --> 1:30:10.080\n We just don't really have a good sense of the alternative.\n\n1:30:10.080 --> 1:30:13.120\n And so you can kind of divest yourself in that way.\n\n1:30:13.120 --> 1:30:14.820\n Well, maybe everything is like this.\n\n1:30:14.820 --> 1:30:20.320\n Maybe we're trying, we're overdramatizing this whole thing and we're like every, everybody,\n\n1:30:20.320 --> 1:30:26.880\n every, it seems like every living thing, perhaps everything period thinks that it's the center\n\n1:30:26.880 --> 1:30:27.880\n of the universe.\n\n1:30:27.880 --> 1:30:28.880\n Right.\n\n1:30:28.880 --> 1:30:32.200\n And so here we are telling ourselves these dramatic, big stories about us being special\n\n1:30:32.200 --> 1:30:33.560\n and so on.\n\n1:30:33.560 --> 1:30:38.640\n And maybe we need to have a little bit more humility, both about the uncertainty and about\n\n1:30:38.640 --> 1:30:40.000\n our place in the whole.\n\n1:30:40.000 --> 1:30:44.680\n Any statement you make about something like consciousness has, I think, a sort of equal\n\n1:30:44.680 --> 1:30:46.720\n level of humility.\n\n1:30:46.720 --> 1:30:51.760\n Your saying that, you know, we don't have it is as not you Lex, but you person saying\n\n1:30:51.760 --> 1:30:55.400\n we don't have it is as intellectually arrogant as my saying we do.\n\n1:30:55.400 --> 1:31:03.300\n So I think for me, humility comes in, in admitting that we really, really have just the tiniest\n\n1:31:03.300 --> 1:31:09.960\n part of the puzzle and, and, and as you get older, at least my experience has been not\n\n1:31:09.960 --> 1:31:14.200\n that you get more answers, but that you just see a bigger puzzle.\n\n1:31:14.200 --> 1:31:19.720\n So to me, there's less, so the questions are fascinating, but there's also an engineering\n\n1:31:19.720 --> 1:31:21.360\n practical question.\n\n1:31:21.360 --> 1:31:29.360\n And perhaps I'll ask you a religious one too on this point to return back to robots.\n\n1:31:29.360 --> 1:31:35.320\n So how to engineer consciousness, or I'll just even ask you a very simple question,\n\n1:31:35.320 --> 1:31:44.920\n which is when you have robots that exhibit the capacity to suffer, I found in myself\n\n1:31:44.920 --> 1:31:49.440\n as a human, when I see that, I, I feel something.\n\n1:31:49.440 --> 1:31:54.560\n Exhibit the capacity to suffer, or they exhibit behaviors that evoke in you a sense that they\n\n1:31:54.560 --> 1:31:55.560\n are suffering.\n\n1:31:55.560 --> 1:31:57.520\n Those aren't the same things.\n\n1:31:57.520 --> 1:32:01.800\n For my, from an observation perspective, they sure as heck seem similar.\n\n1:32:01.800 --> 1:32:03.360\n You think they're feeling pain?\n\n1:32:03.360 --> 1:32:08.280\n I don't know what the, I'm observing pain.\n\n1:32:08.280 --> 1:32:09.280\n Okay.\n\n1:32:09.280 --> 1:32:14.960\n It's like when I watch a movie and there's people on screen, some, some of them are dressed\n\n1:32:14.960 --> 1:32:15.960\n like Batman.\n\n1:32:15.960 --> 1:32:19.720\n But I, but you can make the distinction.\n\n1:32:19.720 --> 1:32:26.200\n Like if I have a doll and I bend the doll over and it makes a sad face, I know that\n\n1:32:26.200 --> 1:32:31.680\n that doll is not actually in pain, even though I am observing pain.\n\n1:32:31.680 --> 1:32:33.520\n So the question, what's that?\n\n1:32:33.520 --> 1:32:42.160\n What the question is when the doll becomes able to remember things about you, David,\n\n1:32:42.160 --> 1:32:50.560\n about the experiences you shared, it is able to speak and make you feel like there's an\n\n1:32:50.560 --> 1:32:51.680\n actual relationship.\n\n1:32:51.680 --> 1:32:57.800\n So that's what I'm asking is at what point do you believe that the, and I know that this\n\n1:32:57.800 --> 1:33:01.320\n is an impossible question, but at what point do you believe that there is a consciousness\n\n1:33:01.320 --> 1:33:09.040\n in there as opposed to just an extraordinary, I mean, like when I play chess against a computer\n\n1:33:09.040 --> 1:33:16.840\n and it beats me, I'm embarrassed even though the computer doesn't, I don't think the computer\n\n1:33:16.840 --> 1:33:20.640\n is going out, you idiot, but it feels that way.\n\n1:33:20.640 --> 1:33:24.840\n But there is some part of me that says, okay, I know that this computer doesn't actually\n\n1:33:24.840 --> 1:33:26.680\n know who I am or care who I am.\n\n1:33:26.680 --> 1:33:28.960\n It just knows how to move the pieces.\n\n1:33:28.960 --> 1:33:34.160\n So at what point do you, I mean, you're giving me instances, it speaks, it does this, it\n\n1:33:34.160 --> 1:33:38.480\n does this, but at what point does that for you cross the threshold into it's actually\n\n1:33:38.480 --> 1:33:39.780\n a sentient being?\n\n1:33:39.780 --> 1:33:43.000\n I think the question is whether there is a threshold that could be crossed.\n\n1:33:43.000 --> 1:33:44.000\n Right.\n\n1:33:44.000 --> 1:33:45.000\n That's one question.\n\n1:33:45.000 --> 1:33:48.280\n And I can answer this because I think it's different from person to person, but the chess\n\n1:33:48.280 --> 1:33:54.920\n engine is not at all trying to cross that threshold.\n\n1:33:54.920 --> 1:33:56.720\n Let's just start there.\n\n1:33:56.720 --> 1:34:06.000\n And to me, the personalization, which is what's the difference, like a friend that you meet,\n\n1:34:06.000 --> 1:34:12.120\n you've shared all these memories and the way they look at you will convey in the things\n\n1:34:12.120 --> 1:34:17.200\n they say will convey that they've shared those memories with you.\n\n1:34:17.200 --> 1:34:22.600\n They'll be able to speak in a shared humor and the language, but really the memories\n\n1:34:22.600 --> 1:34:25.920\n is the big one of having gone through things together.\n\n1:34:25.920 --> 1:34:33.920\n I think I would have more and more trouble, for example, turning off a system that I've\n\n1:34:33.920 --> 1:34:40.840\n been through things with, like, and by turning off, I mean, delete all of its memory.\n\n1:34:40.840 --> 1:34:47.320\n If me and the toaster have gone through a bunch of dramatic events and that toaster\n\n1:34:47.320 --> 1:34:52.300\n remembers, there's a certain level to where like, it's just me and the toaster in this\n\n1:34:52.300 --> 1:34:54.180\n together at this point.\n\n1:34:54.180 --> 1:34:58.280\n And just to talk about sentience, I don't know, but you know.\n\n1:34:58.280 --> 1:34:59.280\n I don't know.\n\n1:34:59.280 --> 1:35:03.360\n It's according to the scripture, can't live by bread alone.\n\n1:35:03.360 --> 1:35:09.640\n But I would, I mean, I know that there's no way to determine this, but it's still about\n\n1:35:09.640 --> 1:35:11.120\n what you feel.\n\n1:35:11.120 --> 1:35:12.120\n Yes.\n\n1:35:12.120 --> 1:35:15.160\n But isn't that what human relations are also though?\n\n1:35:15.160 --> 1:35:16.160\n Yes, but.\n\n1:35:16.160 --> 1:35:18.120\n But we make each other feel.\n\n1:35:18.120 --> 1:35:23.160\n But it's true that I have the assumption that you feel somewhat like I do.\n\n1:35:23.160 --> 1:35:28.080\n I mean, obviously I don't, you know, and that could be illusion and I don't know.\n\n1:35:28.080 --> 1:35:34.240\n And I know that you don't feel exactly as I do.\n\n1:35:34.240 --> 1:35:39.480\n But I think we have a long, at least to me, we have a long way to go before the detached\n\n1:35:39.480 --> 1:35:41.240\n part of our brains.\n\n1:35:41.240 --> 1:35:45.880\n That is the objective evaluating part, as opposed to the emotive, it feels this way\n\n1:35:45.880 --> 1:35:49.800\n part, believe that that machine has consciousness.\n\n1:35:49.800 --> 1:35:55.200\n I think it's at least without arriving conclusions, it's at least possible that one day we will\n\n1:35:55.200 --> 1:36:04.760\n look back and realize that we have yet once again formed another tribe and that scripture\n\n1:36:04.760 --> 1:36:12.200\n all along had in it the ability for humans and robots to have a deep, meaningful connection.\n\n1:36:12.200 --> 1:36:17.460\n And that through the robot, the life that enters the body of another robot, what's the\n\n1:36:17.460 --> 1:36:21.120\n difference between a biological body and a mechanical one.\n\n1:36:21.120 --> 1:36:27.040\n And then we will see that the fundamental thing is about the, whatever you want to call\n\n1:36:27.040 --> 1:36:31.960\n it sentience or whatever can permeate an object.\n\n1:36:31.960 --> 1:36:34.620\n That was the thing all along.\n\n1:36:34.620 --> 1:36:36.880\n So I mean.\n\n1:36:36.880 --> 1:36:39.440\n And then you'll get canceled one more time because you will.\n\n1:36:39.440 --> 1:36:40.440\n Because I denied it.\n\n1:36:40.440 --> 1:36:41.440\n I was going to say.\n\n1:36:41.440 --> 1:36:42.440\n No, the opposite.\n\n1:36:42.440 --> 1:36:43.440\n You'll eventually.\n\n1:36:43.440 --> 1:36:44.440\n Oh, I see.\n\n1:36:44.440 --> 1:36:45.440\n Because I'll preach to the robots.\n\n1:36:45.440 --> 1:36:46.440\n I'm hoping.\n\n1:36:46.440 --> 1:36:47.440\n I'm hoping.\n\n1:36:47.440 --> 1:36:48.440\n All right.\n\n1:36:48.440 --> 1:36:55.400\n First of all, depends how quickly you do it and how much longer I have to live.\n\n1:36:55.400 --> 1:37:04.880\n I resist it tremendously, but I am also enough of a student of history to know that my instinctive\n\n1:37:04.880 --> 1:37:11.080\n resistance has nothing to do with whether it will come about.\n\n1:37:11.080 --> 1:37:13.480\n I have a hard time believing it.\n\n1:37:13.480 --> 1:37:15.920\n We'll see.\n\n1:37:15.920 --> 1:37:18.240\n Can I ask you about this?\n\n1:37:18.240 --> 1:37:19.240\n Maybe you can educate me.\n\n1:37:19.240 --> 1:37:24.000\n I tend to believe that you mentioned suffering, that there is a connection between consciousness\n\n1:37:24.000 --> 1:37:25.840\n and suffering.\n\n1:37:25.840 --> 1:37:28.420\n That suffering is a fundamental part.\n\n1:37:28.420 --> 1:37:31.600\n The capacity to suffer is the fundamental part of being human.\n\n1:37:31.600 --> 1:37:34.540\n I mean, I would look at when you're not conscious, you don't suffer.\n\n1:37:34.540 --> 1:37:37.600\n You know, we've had operations where we've been put under anesthetic.\n\n1:37:37.600 --> 1:37:39.960\n We're not conscious and we don't suffer during the operation.\n\n1:37:39.960 --> 1:37:43.600\n If we were conscious, we would.\n\n1:37:43.600 --> 1:37:48.840\n But there's also, I mean, there's a nonphysical suffering that is very much tied to consciousness.\n\n1:37:48.840 --> 1:37:55.840\n I can think of things right now that will cause me suffering, like pain that I've caused\n\n1:37:55.840 --> 1:37:59.760\n or pain that other people I care about have felt or so on.\n\n1:37:59.760 --> 1:38:04.120\n So I don't see how I think that way.\n\n1:38:04.120 --> 1:38:05.920\n I think it's equally true of joy.\n\n1:38:05.920 --> 1:38:09.120\n Joy is also a product of consciousness.\n\n1:38:09.120 --> 1:38:14.760\n All tied in in some beautiful, messy way with memory and so on that we can reexperience\n\n1:38:14.760 --> 1:38:17.840\n it when we recall the memories.\n\n1:38:17.840 --> 1:38:19.480\n But why is there suffering?\n\n1:38:19.480 --> 1:38:20.480\n You mentioned evil.\n\n1:38:20.480 --> 1:38:21.560\n Why is there evil in the world?\n\n1:38:21.560 --> 1:38:24.700\n You can tell stories about this.\n\n1:38:24.700 --> 1:38:25.700\n Why is there suffering?\n\n1:38:25.700 --> 1:38:30.520\n Why is there evil in the world if there's a God that cares for us?\n\n1:38:30.520 --> 1:38:35.960\n Let's assume for a minute that everything was a primitive robot.\n\n1:38:35.960 --> 1:38:41.200\n There would be no suffering, but there would also be no growth.\n\n1:38:41.200 --> 1:38:44.800\n And that implies choices.\n\n1:38:44.800 --> 1:38:51.520\n One of the things that I've said that I know why it hurts people, and I don't mean it quite\n\n1:38:51.520 --> 1:38:59.880\n the way, but I will say it nonetheless, is the Holocaust presents the exact same theological\n\n1:38:59.880 --> 1:39:06.160\n question as somebody who gets shot on the streets of a city in Los Angeles, which is,\n\n1:39:06.160 --> 1:39:10.640\n God, why do you allow some people to do bad things to other people?\n\n1:39:10.640 --> 1:39:14.080\n It's on an unimaginable scale, but it's the same question.\n\n1:39:14.080 --> 1:39:18.520\n And the answer has to be you either allow people to have free will or you don't.\n\n1:39:18.520 --> 1:39:24.120\n You can't say as God, I'm going to let everybody have free will, but not Nazis.\n\n1:39:24.120 --> 1:39:29.600\n Nazis don't get free will because Cambodians, they can kill each other.\n\n1:39:29.600 --> 1:39:33.440\n Fondans kill each other, but the Nazis don't get to do that.\n\n1:39:33.440 --> 1:39:39.160\n So that's one piece of the puzzle.\n\n1:39:39.160 --> 1:39:43.720\n And what makes it unfathomable is when you're actually faced with suffering, these kinds\n\n1:39:43.720 --> 1:39:45.440\n of explanations are obscene.\n\n1:39:45.440 --> 1:39:46.440\n They just are.\n\n1:39:46.440 --> 1:39:51.240\n I mean, when somebody is actually suffering, oh, the rabbi said God gave people free will,\n\n1:39:51.240 --> 1:39:53.260\n that's just awful.\n\n1:39:53.260 --> 1:39:59.500\n But there is a second piece to this also, which is that there is natural suffering,\n\n1:39:59.500 --> 1:40:06.460\n like children born with diseases or earthquakes or volcanoes or whatever.\n\n1:40:06.460 --> 1:40:12.980\n And here my argument is that in some ways, suffering has to be random in the world because\n\n1:40:12.980 --> 1:40:16.400\n when people say, why do bad things happen to good people, well, if only good things\n\n1:40:16.400 --> 1:40:21.120\n happen to good people, everybody would be good, but it would have no moral content.\n\n1:40:21.120 --> 1:40:26.040\n The only way you can be good and it have moral content is say, I know that I can live a really\n\n1:40:26.040 --> 1:40:30.240\n good life and have really terrible things happen to me nonetheless.\n\n1:40:30.240 --> 1:40:34.200\n So it feels to me like it has to be a randomly.\n\n1:40:34.200 --> 1:40:40.440\n Now that means, by the way, that I've been incredibly lucky.\n\n1:40:40.440 --> 1:40:43.080\n I don't have a good life because I was good.\n\n1:40:43.080 --> 1:40:45.880\n I have a good life because I was lucky.\n\n1:40:45.880 --> 1:40:50.680\n And that implies not that I should feel guilty about it, but that I have a tremendous responsibility\n\n1:40:50.680 --> 1:40:54.020\n as a result to other people who aren't so lucky.\n\n1:40:54.020 --> 1:40:58.240\n Tremendous responsibility to study the lessons of history, to tell the stories of those who\n\n1:40:58.240 --> 1:41:05.400\n are less lucky and to draw enough wisdom from them so that we have less cruelty and suffering\n\n1:41:05.400 --> 1:41:09.720\n in the world or have new kinds that get us to improve even more.\n\n1:41:09.720 --> 1:41:10.720\n That's right.\n\n1:41:10.720 --> 1:41:11.720\n Exactly.\n\n1:41:11.720 --> 1:41:12.720\n That we suffer better.\n\n1:41:12.720 --> 1:41:22.000\n For a lot of people, mortality is one of the very unfortunate versions of suffering, which\n\n1:41:22.000 --> 1:41:27.880\n is that the ride ends in this realm, whatever it is.\n\n1:41:27.880 --> 1:41:28.880\n What do you think of mortality?\n\n1:41:28.880 --> 1:41:31.400\n Is it something you think about?\n\n1:41:31.400 --> 1:41:33.240\n Is it something you fear?\n\n1:41:33.240 --> 1:41:37.400\n What do you think happens after we die?\n\n1:41:37.400 --> 1:41:40.560\n I don't fear it.\n\n1:41:40.560 --> 1:41:45.660\n First of all, I would say when I was in high school, I think my father actually encouraged\n\n1:41:45.660 --> 1:41:47.120\n me to read this book.\n\n1:41:47.120 --> 1:41:52.620\n I read Ernest Becker's Denial of Death, which I found and still find to be one of the most\n\n1:41:52.620 --> 1:41:56.340\n profound works I've ever come across.\n\n1:41:56.340 --> 1:42:04.880\n And he convinced me that a lot of what our society is about are ways that we avoid encountering\n\n1:42:04.880 --> 1:42:07.480\n our own mortality.\n\n1:42:07.480 --> 1:42:11.640\n Our physicality – I mean, among the points he makes – and I'm not quoting him at\n\n1:42:11.640 --> 1:42:15.880\n all directly – it's like, why does everything about our physical body make us so uncomfortable?\n\n1:42:15.880 --> 1:42:20.640\n Everything that comes out of you, other than tears, is either mildly or very disgusting.\n\n1:42:20.640 --> 1:42:21.640\n Why?\n\n1:42:21.640 --> 1:42:23.120\n Why does that have to be?\n\n1:42:23.120 --> 1:42:28.600\n Why are sex and eating and all the things that are physical surrounded with so much\n\n1:42:28.600 --> 1:42:29.600\n symbolism?\n\n1:42:29.600 --> 1:42:30.600\n I mean, what are table manners, really?\n\n1:42:30.600 --> 1:42:35.200\n They're like, we're not eating like animals because we're not eating like animals.\n\n1:42:35.200 --> 1:42:38.460\n And sex, obviously, has more symbolism around it than anything.\n\n1:42:38.460 --> 1:42:42.360\n And his answer is, anything that reminds you that you're a physical body because that's\n\n1:42:42.360 --> 1:42:43.360\n what dies.\n\n1:42:43.360 --> 1:42:44.360\n Your body dies.\n\n1:42:44.360 --> 1:42:45.360\n It decays.\n\n1:42:45.360 --> 1:42:46.360\n It dies.\n\n1:42:46.360 --> 1:42:47.360\n It gets eaten by worms.\n\n1:42:47.360 --> 1:42:49.960\n That you don't want to think about, so you deny it.\n\n1:42:49.960 --> 1:42:56.520\n I think that part of religion is a confrontation with your own mortality, but also a certain\n\n1:42:56.520 --> 1:43:01.360\n transcendence of it because the idea is something about you is eternal.\n\n1:43:01.360 --> 1:43:04.500\n What exactly I don't know.\n\n1:43:04.500 --> 1:43:07.040\n And you asked, what do I think happens after we die?\n\n1:43:07.040 --> 1:43:14.960\n So I don't know any better than anyone else does, but I'll say two things about it.\n\n1:43:14.960 --> 1:43:21.660\n One is that every image of what it's like is foolish.\n\n1:43:21.660 --> 1:43:24.960\n Mark Twain has, I think, in Letters from Earth, he says, we're going to lie on green fields\n\n1:43:24.960 --> 1:43:28.700\n and listen to harp music, which you wouldn't want to do for five minutes while you're alive,\n\n1:43:28.700 --> 1:43:32.280\n but you think you'll be happy for the rest of eternity doing it after you die.\n\n1:43:32.280 --> 1:43:33.280\n So I don't know.\n\n1:43:33.280 --> 1:43:34.380\n This world was a surprise.\n\n1:43:34.380 --> 1:43:36.160\n So why shouldn't the next world be a surprise?\n\n1:43:36.160 --> 1:43:37.920\n I have no idea.\n\n1:43:37.920 --> 1:43:45.200\n But I really like this parable that's told by a guy in a book on death and mourning by\n\n1:43:45.200 --> 1:43:49.120\n a rabbi in a book on death and mourning about twins in a womb.\n\n1:43:49.120 --> 1:43:54.880\n He says, one of them believes that there's a life outside and the other one doesn't.\n\n1:43:54.880 --> 1:43:58.860\n He says, the one who doesn't says, look, this is the only world we've ever seen, the only\n\n1:43:58.860 --> 1:43:59.860\n world we've ever known.\n\n1:43:59.860 --> 1:44:01.400\n Why do you think there's something out there?\n\n1:44:01.400 --> 1:44:05.680\n He says, now imagine the one who believes is born.\n\n1:44:05.680 --> 1:44:09.820\n Back in the womb, his brother is mourning a death, but outside, everybody's celebrating\n\n1:44:09.820 --> 1:44:10.820\n a birth.\n\n1:44:10.820 --> 1:44:13.200\n He said, and that's what it's like when you die.\n\n1:44:13.200 --> 1:44:14.360\n And I love that image.\n\n1:44:14.360 --> 1:44:16.480\n Yeah, the grass is always greener.\n\n1:44:16.480 --> 1:44:20.780\n It's the new step, but the eternity thing is an interesting one.\n\n1:44:20.780 --> 1:44:27.040\n It's yet another concept that I feel humans are fully inequipped to comprehend.\n\n1:44:27.040 --> 1:44:30.500\n Is eternity fundamental somehow to all of these discussions?\n\n1:44:30.500 --> 1:44:36.060\n I think it is, well, partly because God is supposed to be eternal and therefore it moves\n\n1:44:36.060 --> 1:44:41.560\n the mind in that direction, even though it is completely unfathomable, you know?\n\n1:44:41.560 --> 1:44:46.760\n Because sometimes I would say eternity, you said on a green field, sometimes a moment,\n\n1:44:46.760 --> 1:44:52.840\n like a truly joyful moment, feels like an eternity, the intensity of it.\n\n1:44:52.840 --> 1:44:58.600\n Maybe eternity is more about stopping time versus extending time indefinitely, and it's\n\n1:44:58.600 --> 1:45:03.320\n something that we just totally can't comprehend, us silly humans.\n\n1:45:03.320 --> 1:45:09.840\n All I would say is the older you get, the more you're struck by the fact that time does\n\n1:45:09.840 --> 1:45:13.400\n not freeze.\n\n1:45:13.400 --> 1:45:17.020\n People will sometimes say to me, you haven't aged a day.\n\n1:45:17.020 --> 1:45:22.520\n And then I'll look at an old picture of myself and I'll say, that was very kind of you, but\n\n1:45:22.520 --> 1:45:23.520\n that's not true.\n\n1:45:23.520 --> 1:45:24.520\n It's not true.\n\n1:45:24.520 --> 1:45:31.160\n So, yeah, I mean, I love the idea of seeing eternity in a grain of sand, was how Blake\n\n1:45:31.160 --> 1:45:32.160\n put it.\n\n1:45:32.160 --> 1:45:33.360\n I love that notion.\n\n1:45:33.360 --> 1:45:40.120\n But when you talk about life after death, I think that in some ways, my fundamental\n\n1:45:40.120 --> 1:45:47.000\n faith is in human beings, that this doesn't all disappear, that there's something about\n\n1:45:47.000 --> 1:45:51.200\n people that transcends this world.\n\n1:45:51.200 --> 1:45:54.920\n You mentioned Ernest Becker in high school and denial of death.\n\n1:45:54.920 --> 1:46:00.720\n Maybe you can mention if you still see truth and wisdom in some of this idea.\n\n1:46:00.720 --> 1:46:06.400\n But in general, can you go all the way back and tell some of the fascinating story of\n\n1:46:06.400 --> 1:46:08.880\n how you found faith?\n\n1:46:08.880 --> 1:46:14.680\n When I was in high school, I was a really pretty ardent atheist.\n\n1:46:14.680 --> 1:46:21.200\n And I loved Bertrand Russell, who was, for my money, with all due respect to all the\n\n1:46:21.200 --> 1:46:26.320\n very, very capable people that we've talked about earlier, he's the best atheist pound\n\n1:46:26.320 --> 1:46:32.240\n for pound that there was, and a remarkably witty and lucid writer.\n\n1:46:32.240 --> 1:46:34.040\n And I was totally in his thrall.\n\n1:46:34.040 --> 1:46:37.960\n And I would read every book by Russell I could get my hands on.\n\n1:46:37.960 --> 1:46:47.120\n And the reason that I did, I have this theory that why do adolescent boys like Mr. Spock\n\n1:46:47.120 --> 1:46:51.080\n and like Sherlock Holmes?\n\n1:46:51.080 --> 1:46:55.920\n I think it's because when you hit puberty, for a lot of us, there's so much discomfort\n\n1:46:55.920 --> 1:46:59.240\n with our bodies that we like the idea that we're just brains.\n\n1:46:59.240 --> 1:47:00.840\n I really think so.\n\n1:47:00.840 --> 1:47:02.240\n I had that experience.\n\n1:47:02.240 --> 1:47:05.240\n It's like, I want to just be a thinking machine.\n\n1:47:05.240 --> 1:47:08.080\n I don't want to be a body because my body was making me so uncomfortable.\n\n1:47:08.080 --> 1:47:12.400\n I had all these urges and inclinations that I couldn't control.\n\n1:47:12.400 --> 1:47:14.600\n So Russell was perfect.\n\n1:47:14.600 --> 1:47:20.800\n And my father, who was a rabbi, did the very wise thing of buying me some of Bertrand Russell's\n\n1:47:20.800 --> 1:47:25.340\n books, which was his way of saying, I'm not afraid of him.\n\n1:47:25.340 --> 1:47:27.400\n And actually, there was another rabbi.\n\n1:47:27.400 --> 1:47:32.760\n I was at summer camp, and I was sitting on the porch of the, I remember exactly, and\n\n1:47:32.760 --> 1:47:36.080\n I was reading Bertrand Russell, and this guy came up to me and said, what are you reading?\n\n1:47:36.080 --> 1:47:40.780\n I was maybe 16 or 17, and I said, Bertrand Russell, I was spoiling for a fight.\n\n1:47:40.780 --> 1:47:42.240\n And he said, I'm glad you're reading him.\n\n1:47:42.240 --> 1:47:43.240\n I said, really?\n\n1:47:43.240 --> 1:47:44.240\n Why?\n\n1:47:44.240 --> 1:47:45.240\n He goes, how old are you, David?\n\n1:47:45.240 --> 1:47:47.640\n And I said, whatever I was, 16, 17.\n\n1:47:47.640 --> 1:47:53.160\n He said, well, I'd rather you grow out of him than grow into him.\n\n1:47:53.160 --> 1:47:54.160\n And you know what?\n\n1:47:54.160 --> 1:48:01.200\n He was actually right because when I started to read about Russell's life, I realized\n\n1:48:01.200 --> 1:48:04.680\n that all of that rationality didn't shield him.\n\n1:48:04.680 --> 1:48:11.280\n He had an incredibly messy life, multiple marriages, endless infidelities, family members\n\n1:48:11.280 --> 1:48:14.440\n he didn't speak to who didn't speak to him, by the way, was raised by his grandparents\n\n1:48:14.440 --> 1:48:21.320\n because his parents had died, and really not a happy or, I mean, a remarkable life, but\n\n1:48:21.320 --> 1:48:23.400\n not a happy one.\n\n1:48:23.400 --> 1:48:29.120\n And so I started to believe that maybe it was possible that people who had faith were\n\n1:48:29.120 --> 1:48:38.360\n not just stupid and needed crutches, but saw something deeper than Russell did.\n\n1:48:38.360 --> 1:48:44.360\n And the more people that I met that were like that, it's funny because I always thought,\n\n1:48:44.360 --> 1:48:49.280\n okay, my father is a rabbi, that's great, but nobody else.\n\n1:48:49.280 --> 1:48:54.400\n And I think what happened to me was it was not a logical decision to come to faith.\n\n1:48:54.400 --> 1:48:56.080\n It was a sort of opening of my heart.\n\n1:48:56.080 --> 1:49:02.840\n It's like this world is way much more than my mind can capture, and I've kind of felt\n\n1:49:02.840 --> 1:49:04.440\n my way to God.\n\n1:49:04.440 --> 1:49:10.560\n And in the moments, my faith, you know, there was a rabbi named Rabbi Nachman of Bratslav,\n\n1:49:10.560 --> 1:49:13.800\n he said he was a moon man, his faith waxed and waned.\n\n1:49:13.800 --> 1:49:16.680\n So sometimes I have more, sometimes less.\n\n1:49:16.680 --> 1:49:20.920\n But in my feelinger moments is when I have more.\n\n1:49:20.920 --> 1:49:29.600\n So with your heart open, what would you say in your feelinger moments is the most beautiful\n\n1:49:29.600 --> 1:49:34.000\n part about Judaism and your faith?\n\n1:49:34.000 --> 1:49:41.560\n I think the most beautiful part about Judaism is that even though it is filled with humor\n\n1:49:41.560 --> 1:49:47.200\n and wit, it takes life and it takes the soul seriously.\n\n1:49:47.200 --> 1:49:53.220\n Everybody really believes that this matters, and that we matter, and what we do matters.\n\n1:49:53.220 --> 1:49:58.800\n And I think that that's incredibly important, and especially in a world in which young people\n\n1:49:58.800 --> 1:50:05.220\n feel so much like they don't matter, that's an unbelievably powerful message.\n\n1:50:05.220 --> 1:50:16.520\n I mean, you know, I want to say like almost to every young woman under 30 on TikTok, you\n\n1:50:16.520 --> 1:50:18.560\n don't matter because you're beautiful.\n\n1:50:18.560 --> 1:50:19.880\n That's not why you matter.\n\n1:50:19.880 --> 1:50:21.440\n I hope you know that.\n\n1:50:21.440 --> 1:50:23.900\n You matter because you have a soul.\n\n1:50:23.900 --> 1:50:28.120\n And to every young man who's like nihilistic and doesn't think and just thinks that if\n\n1:50:28.120 --> 1:50:31.340\n they make enough money, their life will be fine, I want to say the same thing, which\n\n1:50:31.340 --> 1:50:38.100\n is really that's not ultimately you matter because you're in the image of God.\n\n1:50:38.100 --> 1:50:42.040\n And Judaism really deeply, deeply believes and preaches that.\n\n1:50:42.040 --> 1:50:48.380\n And I think that that's a message that has so much to say to the world.\n\n1:50:48.380 --> 1:50:51.820\n It's like you have to take people's souls seriously.\n\n1:50:51.820 --> 1:50:56.680\n And for all of the difficulty in figuring out all these social questions and what they\n\n1:50:56.680 --> 1:51:02.400\n mean, I just don't want to dismiss people because I disagree with them politically or\n\n1:51:02.400 --> 1:51:07.080\n socially or culturally, because I think they matter.\n\n1:51:07.080 --> 1:51:16.720\n So ultimately Judaism has a wealth of meaning for a human mind.\n\n1:51:16.720 --> 1:51:18.400\n I really believe that it does.\n\n1:51:18.400 --> 1:51:21.080\n I really do.\n\n1:51:21.080 --> 1:51:27.400\n And its meaning, and I want to emphasize this, is not political.\n\n1:51:27.400 --> 1:51:31.200\n The deepest meaning of Judaism is not political.\n\n1:51:31.200 --> 1:51:33.920\n Well there is, we put politics on top of everything.\n\n1:51:33.920 --> 1:51:34.920\n Exactly.\n\n1:51:34.920 --> 1:51:36.200\n But that's why I want to emphasize it.\n\n1:51:36.200 --> 1:51:38.400\n The deepest meaning is on a soul level.\n\n1:51:38.400 --> 1:51:40.560\n It's not on a voting level.\n\n1:51:40.560 --> 1:51:44.400\n Well that combined with the humor, it's clear to me that Christopher Hitchens should have\n\n1:51:44.400 --> 1:51:45.400\n been a Jew.\n\n1:51:45.400 --> 1:51:46.400\n He was.\n\n1:51:46.400 --> 1:51:47.400\n He actually was.\n\n1:51:47.400 --> 1:51:51.000\n He discovered that in his 30s, that his mother was Jewish.\n\n1:51:51.000 --> 1:51:52.000\n That's fascinating.\n\n1:51:52.000 --> 1:51:53.000\n Yep.\n\n1:51:53.000 --> 1:51:55.480\n He actually, he has a beautiful essay about it, discovering in his 30s that his mother\n\n1:51:55.480 --> 1:51:59.040\n was Jewish, yep.\n\n1:51:59.040 --> 1:52:03.080\n So remarkably enough, he actually was Jewish.\n\n1:52:03.080 --> 1:52:06.380\n His autobiography, Hitch 22, is a great read.\n\n1:52:06.380 --> 1:52:10.440\n And I just want to say, what you discover there, I don't know if I'm giving too much\n\n1:52:10.440 --> 1:52:12.040\n away by telling the story of his life.\n\n1:52:12.040 --> 1:52:13.040\n Spoiler alert.\n\n1:52:13.040 --> 1:52:17.320\n What you discover there is that his mother ran away with a minister or a priest and they\n\n1:52:17.320 --> 1:52:20.280\n died in what seemed like was a suicide pact.\n\n1:52:20.280 --> 1:52:25.360\n And so I read it, unfortunately, after he passed away, but I would have wanted to ask\n\n1:52:25.360 --> 1:52:30.440\n him, do you think that has anything to do maybe with the hostility towards religion?\n\n1:52:30.440 --> 1:52:31.740\n We are only human.\n\n1:52:31.740 --> 1:52:35.560\n My father, I mean, both my parents, but my father, who was a rabbi, was such a wonderful,\n\n1:52:35.560 --> 1:52:36.960\n warm, and loving man.\n\n1:52:36.960 --> 1:52:42.320\n So I associate a religious figure with real goodness.\n\n1:52:42.320 --> 1:52:49.020\n And I'm sorry to return to a darker topic, but I really wanted to ask you this.\n\n1:52:49.020 --> 1:52:54.640\n For the current events, for a recent event, I mentioned Dallas.\n\n1:52:54.640 --> 1:52:59.120\n What lessons do you draw from the Dallas Synagogue hostage incident?\n\n1:52:59.120 --> 1:53:03.600\n Well, the week after that, we had active shooter training in my synagogues.\n\n1:53:03.600 --> 1:53:09.080\n And one of the things I drew was that security for synagogues is important.\n\n1:53:09.080 --> 1:53:17.640\n And the second is that the reality of antisemitism, which I had thought had waned when I first\n\n1:53:17.640 --> 1:53:23.040\n began my rabbinate, I thought it's not going to be such a big issue, it is like an evergreen\n\n1:53:23.040 --> 1:53:24.040\n issue.\n\n1:53:24.040 --> 1:53:30.080\n And Jews and all people of goodwill have to take this really seriously, because it has\n\n1:53:30.080 --> 1:53:31.680\n devastating consequences.\n\n1:53:31.680 --> 1:53:35.340\n And if the world doesn't know that, then it just hasn't been paying attention.\n\n1:53:35.340 --> 1:53:41.800\n So there's antisemitism at a scale of human to human, but there's also, like you mentioned,\n\n1:53:41.800 --> 1:53:48.760\n politics get mixed up into things, nations get mixed into things, impossible to answer.\n\n1:53:48.760 --> 1:53:56.920\n But I have to ask, what do you think about the long running saga of Israel and Palestine?\n\n1:53:56.920 --> 1:54:00.200\n Will we ever see peace in that part of the Middle East?\n\n1:54:00.200 --> 1:54:07.360\n Well, since I'm an optimist about human, look, I mean, I have many, many thoughts about it.\n\n1:54:07.360 --> 1:54:11.780\n I'm a very, very strong supporter of Israel.\n\n1:54:11.780 --> 1:54:16.340\n And I also feel really for the plight of the Palestinians.\n\n1:54:16.340 --> 1:54:26.480\n I think that this is a clash of legitimate narratives that is impossible to exactly split\n\n1:54:26.480 --> 1:54:29.080\n the difference of.\n\n1:54:29.080 --> 1:54:36.560\n However, I know that Israel has made peace with Egypt, has made peace with Jordan, has\n\n1:54:36.560 --> 1:54:39.880\n made peace now with other Arab nations.\n\n1:54:39.880 --> 1:54:44.160\n I don't believe that Israel is unwilling to make peace.\n\n1:54:44.160 --> 1:54:51.220\n And so I think that as difficult as it will be for the Palestinians to come to grips with\n\n1:54:51.220 --> 1:54:56.080\n the fact that the Jewish state is not leaving and is legitimately here, as opposed to we\n\n1:54:56.080 --> 1:55:00.260\n can't get rid of it now, but we will get rid of it one day.\n\n1:55:00.260 --> 1:55:06.820\n If that comes to be, and I believe that it will, I think not only that there would be\n\n1:55:06.820 --> 1:55:10.600\n peace, but I think that those two peoples together could probably do remarkable things\n\n1:55:10.600 --> 1:55:12.140\n in the world.\n\n1:55:12.140 --> 1:55:16.120\n Do you think the source of it is politics?\n\n1:55:16.120 --> 1:55:19.440\n Is it religious ideas?\n\n1:55:19.440 --> 1:55:23.560\n And to flip it, what is the way out?\n\n1:55:23.560 --> 1:55:26.240\n Is it geopolitics?\n\n1:55:26.240 --> 1:55:37.600\n Is it interfaith discourse and collaboration, or is it simply the human love?\n\n1:55:37.600 --> 1:55:43.960\n So I'm not sure that I could give one answer to that, but I will give a piece of an answer.\n\n1:55:43.960 --> 1:55:46.680\n Why did the Abraham Accords happen?\n\n1:55:46.680 --> 1:55:52.840\n The main reason that they happened was because economics overrode ideology.\n\n1:55:52.840 --> 1:55:57.840\n And I actually am hopeful that that's in the end what will happen, that people will\n\n1:55:57.840 --> 1:55:58.840\n say, you know what?\n\n1:55:58.840 --> 1:56:08.200\n If we have such a better life, if we put aside the ideological animosities and just created\n\n1:56:08.200 --> 1:56:11.460\n this different kind of Middle East together.\n\n1:56:11.460 --> 1:56:18.120\n I went to Dubai to watch the World Chess Championship, because I really wanted to see Magnus Carlsen\n\n1:56:18.120 --> 1:56:19.120\n play.\n\n1:56:19.120 --> 1:56:22.480\n I thought, you're alive when you have such a remarkable world champion.\n\n1:56:22.480 --> 1:56:23.480\n Go see him play.\n\n1:56:23.480 --> 1:56:28.820\n So I actually took myself to Dubai for the last couple of games, and I watched.\n\n1:56:28.820 --> 1:56:34.440\n It's not that I'm uninterested in Dubai, but I went there for the chess thing.\n\n1:56:34.440 --> 1:56:37.960\n The Expo was also on at the same time, and I saw, here's this amazing place.\n\n1:56:37.960 --> 1:56:39.160\n I came back.\n\n1:56:39.160 --> 1:56:42.080\n This guy I know who lived in Dubai for several years and works in the Middle East said to\n\n1:56:42.080 --> 1:56:43.180\n me, what did you think of it?\n\n1:56:43.180 --> 1:56:45.880\n And I said, it was nice, it was Dubai.\n\n1:56:45.880 --> 1:56:51.680\n It was very polished, very sophisticated, very clean, no crime and so on.\n\n1:56:51.680 --> 1:56:56.080\n But it was kind of like Las Vegas in the Middle East without the gambling or something like\n\n1:56:56.080 --> 1:56:57.080\n that.\n\n1:56:57.080 --> 1:57:00.920\n And he totally changed my perspective in a couple sentences.\n\n1:57:00.920 --> 1:57:04.100\n He said, I know it seems like that when you come from Los Angeles.\n\n1:57:04.100 --> 1:57:10.240\n He said, but fly there from Yemen or from Riyadh, and it is a miracle.\n\n1:57:10.240 --> 1:57:12.600\n And I thought, oh my God, you're right.\n\n1:57:12.600 --> 1:57:19.120\n It's like what human beings can do if they just put aside their ideological shackles\n\n1:57:19.120 --> 1:57:23.680\n is remarkable, and I'm hopeful that one day that'll happen.\n\n1:57:23.680 --> 1:57:26.240\n Economics allows for higher quality of life.\n\n1:57:26.240 --> 1:57:30.560\n You no longer, it's the playground analogy you said earlier.\n\n1:57:30.560 --> 1:57:38.280\n If there's more resources to play with, unfortunately, us humans are more willing to play with others.\n\n1:57:38.280 --> 1:57:39.600\n And maybe that is the solution.\n\n1:57:39.600 --> 1:57:47.320\n And maybe, I mean, for me, from a technology perspective, innovation, engineering helps\n\n1:57:47.320 --> 1:57:49.760\n make everybody's life better.\n\n1:57:49.760 --> 1:57:56.840\n And over that, once people's lives become better, they start to have more time to be\n\n1:57:56.840 --> 1:57:58.360\n empathetic and hear people out.\n\n1:57:58.360 --> 1:58:00.520\n And they have more to lose.\n\n1:58:00.520 --> 1:58:05.920\n When you have more to lose, it actually makes you, I think, countries are less willing to\n\n1:58:05.920 --> 1:58:08.840\n go to war when they have more to lose.\n\n1:58:08.840 --> 1:58:12.180\n And families want peace when it's good at home.\n\n1:58:12.180 --> 1:58:14.920\n So I think there's an element of that as well.\n\n1:58:14.920 --> 1:58:19.600\n And some of it, again, taking us back to the other aspect of our conversation is how we're\n\n1:58:19.600 --> 1:58:23.120\n conducting ourselves in conversation online and so on.\n\n1:58:23.120 --> 1:58:30.240\n Because I think, actually, I'm a big fan of the idea of social media that is a way for\n\n1:58:30.240 --> 1:58:32.440\n us to connect together.\n\n1:58:32.440 --> 1:58:36.800\n I think there's a lot of really strong ideas how to do that well.\n\n1:58:36.800 --> 1:58:44.240\n And clearly, the initial attempts that kind of just open it up wide, some of the lesser\n\n1:58:44.240 --> 1:58:50.120\n aspects of human nature can take over when combined with different forces like advertisements\n\n1:58:50.120 --> 1:58:52.360\n and virology and all those kinds of things.\n\n1:58:52.360 --> 1:58:58.560\n But overall, I love the honesty of the mess of it being presented before us on social\n\n1:58:58.560 --> 1:59:00.100\n media.\n\n1:59:00.100 --> 1:59:06.320\n Part of me, maybe because I don't participate it, like if somebody is being mean to me or\n\n1:59:06.320 --> 1:59:13.400\n being aggressive and these kinds of things, I enjoy it because it's human nature.\n\n1:59:13.400 --> 1:59:15.040\n But I enjoy it because I don't respond.\n\n1:59:15.040 --> 1:59:19.560\n I think if I responded, I would get pulled into this human nature and then it's not fun.\n\n1:59:19.560 --> 1:59:22.600\n But I love the, like I'll talk to people.\n\n1:59:22.600 --> 1:59:24.720\n In fact, I still visit Clubhouse.\n\n1:59:24.720 --> 1:59:25.720\n I don't know if you know what that is.\n\n1:59:25.720 --> 1:59:26.720\n Sure.\n\n1:59:26.720 --> 1:59:27.720\n Oh, right.\n\n1:59:27.720 --> 1:59:28.720\n That's right.\n\n1:59:28.720 --> 1:59:29.720\n Actually, when I...\n\n1:59:29.720 --> 1:59:30.720\n I think that's how we first met.\n\n1:59:30.720 --> 1:59:31.720\n Well, yeah.\n\n1:59:31.720 --> 1:59:32.720\n Well, I was such a fan boy.\n\n1:59:32.720 --> 1:59:37.200\n Actually, when I first heard you, I was like, I can't believe I get to talk to David.\n\n1:59:37.200 --> 1:59:47.600\n But the Israel Palestine topic was something that was very deeply in a heated way discussed\n\n1:59:47.600 --> 1:59:48.600\n on Clubhouse.\n\n1:59:48.600 --> 1:59:52.360\n Race relations is the thing that was really heatedly discussed.\n\n1:59:52.360 --> 1:59:55.440\n And I now go to Clubhouse to practice Russian.\n\n1:59:55.440 --> 2:00:03.420\n And there in Russian, the heated discussion is on basically any topic as meaningless or\n\n2:00:03.420 --> 2:00:06.760\n meaningful as you want in the heat of it.\n\n2:00:06.760 --> 2:00:12.360\n Just people just screaming and then calming down and going through the full process.\n\n2:00:12.360 --> 2:00:15.080\n That too is beautiful because that emotion is there.\n\n2:00:15.080 --> 2:00:21.700\n And if it is allowed to have a voice, I think ultimately it leads to healing.\n\n2:00:21.700 --> 2:00:26.720\n So that felt really healthy if you learn how to do that at scale.\n\n2:00:26.720 --> 2:00:32.040\n Social media, I wish that it were not as algorithmically biased towards conflict.\n\n2:00:32.040 --> 2:00:33.560\n I don't think that that's healthy.\n\n2:00:33.560 --> 2:00:41.500\n But I think it brings a lot of blessings into people's lives if they use it wisely.\n\n2:00:41.500 --> 2:00:45.880\n Like anything else, it can be awful.\n\n2:00:45.880 --> 2:00:51.040\n But I've connected to all sorts of people that I never would have known.\n\n2:00:51.040 --> 2:00:52.360\n And that's been wonderful.\n\n2:00:52.360 --> 2:00:57.440\n So let me ask you the big question of advice.\n\n2:00:57.440 --> 2:01:04.240\n What advice would you give to young people today that are maybe high school, college,\n\n2:01:04.240 --> 2:01:08.080\n thinking about career, thinking about life, they can be proud of.\n\n2:01:08.080 --> 2:01:13.200\n So the first thing that I would say is that life is longer than you think it is.\n\n2:01:13.200 --> 2:01:22.100\n Even though I understand the impulse to be in a rush, you will have many unfoldings.\n\n2:01:22.100 --> 2:01:24.440\n More even than people of my generation did.\n\n2:01:24.440 --> 2:01:26.280\n Unfoldings, that's such a funny word.\n\n2:01:26.280 --> 2:01:28.960\n But it feels that way.\n\n2:01:28.960 --> 2:01:35.320\n It's like different aspects of your life will come, will show you different possibilities\n\n2:01:35.320 --> 2:01:40.640\n that you don't imagine at the moment.\n\n2:01:40.640 --> 2:01:49.680\n And I think the second thing that I would say is, I know that this is a very old fashioned,\n\n2:01:49.680 --> 2:01:57.160\n but I would say to the extent that you can read, don't just, and not just on social media,\n\n2:01:57.160 --> 2:01:58.920\n read books.\n\n2:01:58.920 --> 2:02:05.480\n Learn things that will give you a broader context for your life than just today or yesterday\n\n2:02:05.480 --> 2:02:09.720\n or the day before.\n\n2:02:09.720 --> 2:02:22.560\n And I suppose the other thing that I would say is that to the extent that you can try\n\n2:02:22.560 --> 2:02:29.840\n to develop your own internal metric of both what matters and what is good, because you\n\n2:02:29.840 --> 2:02:36.440\n will be exposed to more voices than any generation in history telling you that that's good or\n\n2:02:36.440 --> 2:02:37.440\n this is good.\n\n2:02:37.440 --> 2:02:41.760\n They're called influences, influencers, but what they are is voices telling you what you\n\n2:02:41.760 --> 2:02:44.040\n should think and what you should believe.\n\n2:02:44.040 --> 2:02:51.620\n And so have some internal space where you'll be able to say, for example, I know this person\n\n2:02:51.620 --> 2:02:54.800\n is doing that and it looks great, but that's not me.\n\n2:02:54.800 --> 2:03:02.320\n You have a community of people that speak to you with a lot of passion.\n\n2:03:02.320 --> 2:03:09.120\n Do you still have that voice in your own, in the privacy of your own mind that you're\n\n2:03:09.120 --> 2:03:15.880\n able to ignore, like for a moment, just be with yourself, think what is right?\n\n2:03:15.880 --> 2:03:16.880\n Absolutely.\n\n2:03:16.880 --> 2:03:19.240\n And I think it's partly because I grew up without that.\n\n2:03:19.240 --> 2:03:24.480\n I mean, I grew up with a lot of space in my life, and so I had a chance to develop that\n\n2:03:24.480 --> 2:03:25.480\n voice.\n\n2:03:25.480 --> 2:03:28.400\n That's why I think it's harder for kids today than it was for me.\n\n2:03:28.400 --> 2:03:31.640\n I mean, I grew up when there were three channels, there was three, six and 10.\n\n2:03:31.640 --> 2:03:35.120\n There was ABC, CBS and NBC, and that was it.\n\n2:03:35.120 --> 2:03:38.800\n And you spent your evening playing board games or reading or whatever, and there was a lot\n\n2:03:38.800 --> 2:03:40.200\n of space.\n\n2:03:40.200 --> 2:03:44.120\n And we played football on the street and you went on your bike in the morning and nobody\n\n2:03:44.120 --> 2:03:49.160\n worried about you and you came home at night and everybody assumed you were fine.\n\n2:03:49.160 --> 2:03:56.320\n And so I really feel, and also I went into a religious tradition where I feel like I\n\n2:03:56.320 --> 2:04:01.120\n have the opportunity to judge myself by bigger metrics.\n\n2:04:01.120 --> 2:04:02.120\n And it's still hard.\n\n2:04:02.120 --> 2:04:06.860\n I don't want to, it's not like, oh, I wear impenetrable armor.\n\n2:04:06.860 --> 2:04:07.860\n It's still hard.\n\n2:04:07.860 --> 2:04:13.880\n So how much harder for kids today when they don't have that?\n\n2:04:13.880 --> 2:04:15.600\n You mentioned books.\n\n2:04:15.600 --> 2:04:21.880\n Is there Bertrand Russell and Denial of Death by Ernest Becker, is there books that pop\n\n2:04:21.880 --> 2:04:25.200\n into mind that had an impact on you?\n\n2:04:25.200 --> 2:04:27.800\n My favorite novel is Middlemarch.\n\n2:04:27.800 --> 2:04:28.800\n Middlemarch?\n\n2:04:28.800 --> 2:04:29.800\n Middlemarch.\n\n2:04:29.800 --> 2:04:34.600\n I was listening to a podcast, I was listening to one of your podcasts where your guest said\n\n2:04:34.600 --> 2:04:42.120\n the two greatest novels of the 19th century were Brothers Karamazov and, what was the\n\n2:04:42.120 --> 2:04:43.120\n other one he mentioned?\n\n2:04:43.120 --> 2:04:44.120\n I don't remember.\n\n2:04:44.120 --> 2:04:45.120\n Dostoevsky as well or no?\n\n2:04:45.120 --> 2:04:46.120\n I think.\n\n2:04:46.120 --> 2:04:47.120\n Was it both Dostoevsky?\n\n2:04:47.120 --> 2:04:48.120\n It might have been.\n\n2:04:48.120 --> 2:04:49.120\n I don't remember.\n\n2:04:49.120 --> 2:04:51.880\n But anyway, but I would say Middlemarch is up there.\n\n2:04:51.880 --> 2:04:57.840\n Middlemarch presents an entire world and it's written by a woman, Marianne Evans, who took\n\n2:04:57.840 --> 2:05:04.920\n the pen name George Eliot, who you feel, Virginia Woolf said it's the only English novel written\n\n2:05:04.920 --> 2:05:07.320\n for grownups.\n\n2:05:07.320 --> 2:05:12.640\n You feel the genius in her sentences, like the pressure of her intellect in her sentences.\n\n2:05:12.640 --> 2:05:14.240\n It's a wonderful, wonderful book.\n\n2:05:14.240 --> 2:05:15.540\n I love it.\n\n2:05:15.540 --> 2:05:16.800\n Pressure of her intellect.\n\n2:05:16.800 --> 2:05:20.000\n Yeah, you really do.\n\n2:05:20.000 --> 2:05:26.840\n I also love Saul Bellow, especially Herzog, but it's a very different kind of thinking\n\n2:05:26.840 --> 2:05:27.840\n person's novel.\n\n2:05:27.840 --> 2:05:32.320\n I read a lot of mysteries and a lot of other kinds of fiction and literature.\n\n2:05:32.320 --> 2:05:40.880\n But in terms of the books that most, you mentioned one of them, which is Viktor Frankl's Man's\n\n2:05:40.880 --> 2:05:43.240\n Search for Meaning.\n\n2:05:43.240 --> 2:05:45.960\n And I also really, really love Heschel's The Sabbath.\n\n2:05:45.960 --> 2:05:48.440\n I think it's a beautiful book.\n\n2:05:48.440 --> 2:05:51.680\n It's a very short book, just as Frankl's book is.\n\n2:05:51.680 --> 2:05:54.840\n What do you take from The Man's Search for Meaning?\n\n2:05:54.840 --> 2:06:05.120\n What do you take of a human being in the worst conditions, being able to non dramatically\n\n2:06:05.120 --> 2:06:10.360\n find little joys, find beauty?\n\n2:06:10.360 --> 2:06:15.240\n It's what I said before about Judaism's advice to younger people, is that it mattered.\n\n2:06:15.240 --> 2:06:20.300\n If you believe that something matters, you have enormous resilience.\n\n2:06:20.300 --> 2:06:24.380\n It's meaninglessness that is the greatest threat to a decent life.\n\n2:06:24.380 --> 2:06:30.180\n When people are deeply depressed, whether it is chemical depression or what they feel\n\n2:06:30.180 --> 2:06:34.380\n like is this is all meaningless.\n\n2:06:34.380 --> 2:06:43.320\n And meaning, now obviously chemical depression calls in part for chemical means, but meaning\n\n2:06:43.320 --> 2:06:47.660\n is the great antidote.\n\n2:06:47.660 --> 2:06:49.680\n We can talk about what kind of meaning.\n\n2:06:49.680 --> 2:06:55.440\n There are kinds of meanings that are awful, but meaning is the great antidote to a sense\n\n2:06:55.440 --> 2:07:03.800\n that life is just nihilistic and purposeless and to that destructiveness that I think is\n\n2:07:03.800 --> 2:07:04.800\n too common.\n\n2:07:04.800 --> 2:07:14.000\n Yeah, so maybe the heroic action in Nazi Germany, in the Holocaust, in the camps is the, even\n\n2:07:14.000 --> 2:07:18.200\n not the action, but just the realization that every life matters.\n\n2:07:18.200 --> 2:07:25.240\n So here's this really wonderful story that Hugo Grin, who was a rabbi in England, died,\n\n2:07:25.240 --> 2:07:29.440\n I don't know, like 15, 20 years ago, he used to tell, he grew up in Auschwitz.\n\n2:07:29.440 --> 2:07:34.280\n He was a child there and he was with his father and it was Hanukkah and you're supposed to\n\n2:07:34.280 --> 2:07:35.400\n light the candles.\n\n2:07:35.400 --> 2:07:39.800\n And his father took the margarine ration and used it as the oil to light the Hanukkah candles.\n\n2:07:39.800 --> 2:07:43.500\n And Hugo was scandalized and he said, that's our food.\n\n2:07:43.500 --> 2:07:49.080\n And his father said, what we have learned, my son, is you can live for three weeks without\n\n2:07:49.080 --> 2:07:50.080\n food.\n\n2:07:50.080 --> 2:07:54.120\n You can live for three days without water, but you can't live for three minutes without\n\n2:07:54.120 --> 2:07:56.120\n hope.\n\n2:07:56.120 --> 2:08:04.040\n Well, hope, let me ask you, you said meaning.\n\n2:08:04.040 --> 2:08:06.040\n What's the meaning of this whole thing?\n\n2:08:06.040 --> 2:08:07.600\n What's the meaning of life?\n\n2:08:07.600 --> 2:08:11.560\n You're the perfect person to ask this question, Rabbi David Wolff.\n\n2:08:11.560 --> 2:08:16.160\n I believe the meaning of life is for human beings to grow in soul.\n\n2:08:16.160 --> 2:08:17.160\n That's why we're here.\n\n2:08:17.160 --> 2:08:19.120\n And you can do that in infinite numbers of ways.\n\n2:08:19.120 --> 2:08:24.520\n But if you're supposed to return your soul like more burnished and beautiful, then you\n\n2:08:24.520 --> 2:08:25.520\n got it.\n\n2:08:25.520 --> 2:08:32.240\n I mean, it's going to have some nicks and cuts, but that's what it means to deepen and\n\n2:08:32.240 --> 2:08:33.240\n grow it.\n\n2:08:33.240 --> 2:08:38.280\n And you do that more than anything else.\n\n2:08:38.280 --> 2:08:40.120\n You do that by learning how to love.\n\n2:08:40.120 --> 2:08:43.120\n I mean, that's the principle way, I think, that you do it.\n\n2:08:43.120 --> 2:08:50.040\n You know, it's interesting because for a human, the relationship, if you're a man of faith,\n\n2:08:50.040 --> 2:08:51.040\n is with God.\n\n2:08:51.040 --> 2:08:59.840\n But it feels like love is so richly part of human society that it's not just love of God,\n\n2:08:59.840 --> 2:09:01.440\n it's love of each other.\n\n2:09:01.440 --> 2:09:02.440\n Right.\n\n2:09:02.440 --> 2:09:03.440\n Yep.\n\n2:09:03.440 --> 2:09:04.440\n There's no question about the idea.\n\n2:09:04.440 --> 2:09:10.000\n I mean, in Judaism, that was actually the great innovation of the monotheistic idea.\n\n2:09:10.000 --> 2:09:14.720\n In pagan societies, it was all about how you treated the gods.\n\n2:09:14.720 --> 2:09:17.360\n Monotheism said, no, God cares how you treat each other.\n\n2:09:17.360 --> 2:09:25.920\n So it's, in fact, the mystics use the same kind of word in Hebrew, davekut, which means\n\n2:09:25.920 --> 2:09:30.120\n clinging, that is used about Adam and Eve.\n\n2:09:30.120 --> 2:09:35.280\n It says, therefore, a man will leave his father and mother and davak with his wife.\n\n2:09:35.280 --> 2:09:36.580\n And davak means cling.\n\n2:09:36.580 --> 2:09:39.440\n So there is an analogy there, absolutely.\n\n2:09:39.440 --> 2:09:45.320\n Yeah, I kind of think of human civilization as that movie, March of the Penguins, and\n\n2:09:45.320 --> 2:09:48.160\n they're all huddling together in the cold.\n\n2:09:48.160 --> 2:09:59.120\n This is fundamentally human, this darkness all around us of uncertainty, of cruelty.\n\n2:09:59.120 --> 2:10:04.200\n It seems like everything is so fragile, and we're just kind of all huddling together for\n\n2:10:04.200 --> 2:10:05.200\n warmth.\n\n2:10:05.200 --> 2:10:06.200\n Yes.\n\n2:10:06.200 --> 2:10:09.000\n And that's all we got is each other.\n\n2:10:09.000 --> 2:10:16.680\n So we started with the big question of what is God, ended with what is meaning.\n\n2:10:16.680 --> 2:10:20.560\n Rabbi Wolpe, I've been a huge, as I've told you, huge, huge fan of yours for a long time.\n\n2:10:20.560 --> 2:10:22.960\n It's such an honor that you talked to me today.\n\n2:10:22.960 --> 2:10:23.960\n Thank you so much.\n\n2:10:23.960 --> 2:10:27.640\n I am really so happy to be here, and thank you so much for the conversation.\n\n2:10:27.640 --> 2:10:29.920\n Thanks for listening to this conversation with David Wolpe.\n\n2:10:29.920 --> 2:10:34.040\n To support this podcast, please check out our sponsors in the description.\n\n2:10:34.040 --> 2:10:38.480\n And now, let me leave you with some words from David himself.\n\n2:10:38.480 --> 2:10:43.920\n The only whole heart is a broken one, because it lets the light in.\n\n2:10:43.920 --> 2:11:10.480\n Thank you for listening, and hope to see you next time.\n\n"
}