{
  "title": "Neal Stephenson: Sci-Fi, Space, Aliens, AI, VR & the Future of Humanity | Lex Fridman Podcast #240",
  "id": "xAfdSak2fs8",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.760\n The following is a conversation with Neal Stephenson, a legendary science fiction writer\n\n00:04.760 --> 00:10.680\n exploring ideas in mathematics, science, cryptography, money, linguistics, philosophy, and virtual\n\n00:10.680 --> 00:17.140\n reality, from his early book Snow Crash to his new one called Termination Shock.\n\n00:17.140 --> 00:19.020\n He doesn't just write novels.\n\n00:19.020 --> 00:25.100\n He worked at the space company Blue Origin for many years, including technically being\n\n00:25.100 --> 00:27.180\n Blue Origin's first employee.\n\n00:27.180 --> 00:33.280\n He also was the chief futurist at the virtual reality company Magic Leap.\n\n00:33.280 --> 00:35.200\n This is the Lex Friedman Podcast.\n\n00:35.200 --> 00:38.680\n To support it, please check out our sponsors in the description.\n\n00:38.680 --> 00:43.560\n And now, here's my conversation with Neal Stephenson.\n\n00:43.560 --> 00:50.840\n You write both historical fiction, like World War II in Cryptonomicon, and science fiction,\n\n00:50.840 --> 00:53.240\n looking both into the past and the future.\n\n00:53.240 --> 00:58.280\n So let me ask, does history repeat itself, in which way does it repeat itself, in which\n\n00:58.280 --> 00:59.720\n way does it not?\n\n00:59.720 --> 01:02.760\n I'm afraid it repeats itself a lot.\n\n01:02.760 --> 01:05.920\n So I think human nature kind of is what it is.\n\n01:05.920 --> 01:12.320\n And so we tend to see similar behavior patterns emerging again and again.\n\n01:12.320 --> 01:20.120\n And so it's kind of the exception rather than the rule when something new happens.\n\n01:20.120 --> 01:25.600\n What role does technology play in the suppression or in revealing human nature?\n\n01:25.600 --> 01:33.720\n Well, the standards of living, life expectancy, all that have gotten incredibly better within\n\n01:33.720 --> 01:36.800\n the last, particularly the last hundred years.\n\n01:36.800 --> 01:44.200\n I mean, just antibiotics, modern vaccines, electrification, the internet.\n\n01:44.200 --> 01:51.600\n These are all improvements in most people's standard of living and health and longevity\n\n01:51.600 --> 01:57.440\n that exceed anything that was seen before in human history.\n\n01:57.440 --> 02:02.800\n So people are living longer, they're generally healthier, and so on.\n\n02:02.800 --> 02:09.520\n But again, we still see a lot of the same behavior patterns, some of which are not very\n\n02:09.520 --> 02:10.520\n attractive.\n\n02:10.520 --> 02:15.600\n So some of it has to do with the constraints on resources, presumably with technology you\n\n02:15.600 --> 02:17.640\n have less and less constraints on resources.\n\n02:17.640 --> 02:22.680\n So we get to maybe emphasize the better angels of our nature.\n\n02:22.680 --> 02:30.520\n And in so doing, does that not potentially fundamentally alter the sort of the experience\n\n02:30.520 --> 02:32.120\n that we have of life on earth?\n\n02:32.120 --> 02:37.940\n You know, until the last 10 or so years, I would have taken that view, I think.\n\n02:37.940 --> 02:49.000\n But you know, people will find ways to be divisive and angry if it scratches a kind\n\n02:49.000 --> 02:51.840\n of psychological itch that they have got.\n\n02:51.840 --> 02:57.640\n And we used to look at the Weimar Republic, what happened in the economic collapse of\n\n02:57.640 --> 03:09.140\n Germany prior to the rise of Hitler, World War II, and kind of explain Hitler, at least\n\n03:09.140 --> 03:17.120\n partially by just the misery that people were living in at that time.\n\n03:17.120 --> 03:18.440\n The economic collapse.\n\n03:18.440 --> 03:25.560\n Yeah, hyperinflation and unemployment and the decline in standard of living.\n\n03:25.560 --> 03:29.360\n And that sounds like a plausible explanation.\n\n03:29.360 --> 03:32.240\n But there are economic troubles now for sure.\n\n03:32.240 --> 03:36.320\n We had the bank collapse in 2008.\n\n03:36.320 --> 03:39.920\n And there's stagnation in some people's standards of living.\n\n03:39.920 --> 03:44.180\n But it's hard to explain what we've seen in this country in the last few years just strictly\n\n03:44.180 --> 03:49.440\n on the basis of people are poor and angry and sad.\n\n03:49.440 --> 03:52.180\n I think they want to be angry.\n\n03:52.180 --> 03:58.960\n So without being political in a divisive kind of way, can we talk about the lessons you\n\n03:58.960 --> 04:01.400\n can draw from World War II?\n\n04:01.400 --> 04:02.400\n Sure.\n\n04:02.400 --> 04:09.100\n This singular event in human history, it seems like, and yet, as you say, history rhymes\n\n04:09.100 --> 04:10.280\n at the very least.\n\n04:10.280 --> 04:11.280\n Yeah.\n\n04:11.280 --> 04:17.620\n Being who I am, I tend to focus on the curious technological things that happened in conjunction\n\n04:17.620 --> 04:20.160\n with that war.\n\n04:20.160 --> 04:22.720\n Which may not be where you want to go.\n\n04:22.720 --> 04:23.720\n Well, there's several things.\n\n04:23.720 --> 04:24.720\n Sorry to interrupt.\n\n04:24.720 --> 04:30.400\n So one in Cryptonomicon is more like the Alan Turing side of things, right?\n\n04:30.400 --> 04:35.240\n And then there's the outside of technology.\n\n04:35.240 --> 04:38.240\n First of all, there's the tools of war, which is a kind of technology.\n\n04:38.240 --> 04:41.840\n But then there's just like the human nature, the nature of good and evil.\n\n04:41.840 --> 04:42.840\n Yeah.\n\n04:42.840 --> 04:49.040\n Well, so one of the things that emerges from the war and from the extermination camps is\n\n04:49.040 --> 04:55.200\n that we were never allowed to have illusions anymore about human nature.\n\n04:55.200 --> 05:03.040\n So you have to learn that lesson to be an educated person, and you have to know that\n\n05:03.040 --> 05:09.160\n even in a supposedly enlightened, civilized society, people can become monsters quite\n\n05:09.160 --> 05:10.560\n easily.\n\n05:10.560 --> 05:13.520\n So that is for sure the big takeaway.\n\n05:13.520 --> 05:22.680\n Do you agree with Solzhenitsyn about the line between good and evil runs through the heart\n\n05:22.680 --> 05:23.680\n of every man?\n\n05:23.680 --> 05:24.680\n Yeah.\n\n05:24.680 --> 05:26.720\n That all of us are capable?\n\n05:26.720 --> 05:27.720\n Great line.\n\n05:27.720 --> 05:28.720\n Yeah.\n\n05:28.720 --> 05:29.720\n Of evil?\n\n05:29.720 --> 05:35.480\n I read a good chunk of the Gulag Archipelago when I was a teenager because my grandfather\n\n05:35.480 --> 05:41.040\n had it in his house because he was one of these Americans who was obsessed with the\n\n05:41.040 --> 05:49.920\n Soviet Union and the Soviet threat and wanted people to be aware of some of what had happened.\n\n05:49.920 --> 05:55.800\n And so he had those books lying around and I would read them.\n\n05:55.800 --> 06:03.440\n And it's a similar kind of parallel story to what happened in Germany during the war,\n\n06:03.440 --> 06:13.520\n this creation of this system of camps and oppression and lots of troubling behavior.\n\n06:13.520 --> 06:22.440\n To me it's a story of how fear and desperation combined with a charismatic leader can lead\n\n06:22.440 --> 06:23.920\n to evil.\n\n06:23.920 --> 06:31.760\n But it's also a story of bravery, of love, of brotherhood and sisterhood and basically\n\n06:31.760 --> 06:32.760\n survival.\n\n06:32.760 --> 06:40.520\n You have a man's search for meaning, which is the story of a man in a concentration camp\n\n06:40.520 --> 06:45.840\n basically finding beauty in life even under most extreme conditions.\n\n06:45.840 --> 06:53.600\n So to me World War II is not necessarily a bleak view of human nature.\n\n06:53.600 --> 07:02.640\n It's a little moment of evil that revealed a much bigger good in humanity.\n\n07:02.640 --> 07:08.460\n So I'm not so sure that it leads me to a pessimistic view of the world, the fact that somebody\n\n07:08.460 --> 07:14.040\n like Hitler could happen, the fact that a lot of people could follow Hitler and get\n\n07:14.040 --> 07:20.920\n excited and maybe even love the hate of the other for some moment of time.\n\n07:20.920 --> 07:28.000\n I think all of us are capable of that, but I think all of us also have a capacity for\n\n07:28.000 --> 07:29.120\n good.\n\n07:29.120 --> 07:36.360\n And I think, I don't know what you think, but I think we have a greater desire for good\n\n07:36.360 --> 07:38.000\n than evil.\n\n07:38.000 --> 07:44.600\n And it seems like that's where technology is very useful as a guide, as a helping hand.\n\n07:44.600 --> 07:45.600\n Okay.\n\n07:45.600 --> 07:48.600\n Can you give me an example maybe?\n\n07:48.600 --> 07:54.200\n So I give you examples of futuristic technologies and I can give you examples of current technologies.\n\n07:54.200 --> 08:04.640\n Current technologies, knowledge in the form of very basic knowledge, which is like Wikipedia\n\n08:04.640 --> 08:12.000\n and search the original dream of Google that I think is very much a success, which is making\n\n08:12.000 --> 08:15.240\n the world's information accessible at your fingertips.\n\n08:15.240 --> 08:24.480\n That kind of technology enables the natural, if this axiom, this assumption that people\n\n08:24.480 --> 08:31.040\n want to do good is true, then letting them discover all of the information out there,\n\n08:31.040 --> 08:36.360\n false information and true information, all of it, and let them explore that's going to\n\n08:36.360 --> 08:40.780\n lead to a better world, to better people.\n\n08:40.780 --> 08:48.360\n Fascist technologies is, I personally, I mentioned to you offline, sort of love artificial intelligence.\n\n08:48.360 --> 08:55.440\n And so AI that's an assistant, that's a guide, like a mentor to you, that you can in the\n\n08:55.440 --> 09:02.160\n way that Google searches, but smarter, where you can help send it out and say, this is\n\n09:02.160 --> 09:08.760\n the direction in which I want to grow, not authoritarian lecturing down from the algorithm\n\n09:08.760 --> 09:16.320\n of telling you this is how you should grow, but almost the opposite, where you use it\n\n09:16.320 --> 09:23.480\n as an assistant, a servant in your journey towards knowledge.\n\n09:23.480 --> 09:27.240\n That sounds like an easy thing, but it's actually from an AI perspective very difficult.\n\n09:27.240 --> 09:33.080\n I mean, this is the theme of a book I wrote called The Diamond Age, which talks about\n\n09:33.080 --> 09:35.840\n a book that essentially does that.\n\n09:35.840 --> 09:41.920\n And I've been sort of watching people try to come at the problem of building that thing\n\n09:41.920 --> 09:47.800\n from different directions for ever since the book came out, basically.\n\n09:47.800 --> 09:55.520\n And so I kind of have, although I haven't worked on it myself, I do get a sense of the\n\n09:55.520 --> 10:01.920\n level of difficulty in realizing that goal.\n\n10:01.920 --> 10:10.380\n So that book is in the 90s, so as Google is coming to be, it's essentially not Google,\n\n10:10.380 --> 10:14.600\n but the search engine, the initial search engines, which gave birth to Google essentially\n\n10:14.600 --> 10:15.600\n in contrast.\n\n10:15.600 --> 10:16.600\n Right.\n\n10:16.600 --> 10:17.600\n Yeah.\n\n10:17.600 --> 10:18.600\n Yeah.\n\n10:18.600 --> 10:24.880\n That was still in the era of Alta Vista and Ask Jeeves and multiple different search engines.\n\n10:24.880 --> 10:28.160\n And yeah, I'm pretty sure I had not heard of Google at that point.\n\n10:28.160 --> 10:30.200\n That would have been 95, 96.\n\n10:30.200 --> 10:33.360\n I think the book came out in 94.\n\n10:33.360 --> 10:39.520\n And then, of course, the social networks followed, which is another form of guidance through\n\n10:39.520 --> 10:41.080\n the space of information.\n\n10:41.080 --> 10:42.080\n Yeah.\n\n10:42.080 --> 10:48.160\n Well, what happens is that these things come along and then people find ways to game them.\n\n10:48.160 --> 10:55.620\n And so I saw an interesting thread the other day pointing out that 20 years ago, if you\n\n10:55.620 --> 11:05.280\n had Googled Pythagorean theorem, chances are you would have been taken directly to a page\n\n11:05.280 --> 11:07.560\n explaining the Pythagorean theorem.\n\n11:07.560 --> 11:10.720\n If you do it now, you're probably going to...\n\n11:10.720 --> 11:15.480\n The top hits are going to be from somebody who's got an angle, who's got a scheme, right?\n\n11:15.480 --> 11:23.440\n They're trying to sell you math tutoring or they're working some kind of marketing plan\n\n11:23.440 --> 11:25.020\n on you.\n\n11:25.020 --> 11:33.000\n So the traditional engines become actually less useful over time for their original educational\n\n11:33.000 --> 11:35.160\n purpose.\n\n11:35.160 --> 11:41.200\n That doesn't mean that they shouldn't be replaced by newer and better ones.\n\n11:41.200 --> 11:45.680\n First of all, to defend the people with the angle, right?\n\n11:45.680 --> 11:50.520\n They're trying to find business models to fund, oftentimes, which is funny you went\n\n11:50.520 --> 11:58.400\n with Pythagorean, like you went at math, those greedy bastards, but it's great.\n\n11:58.400 --> 12:01.360\n How can we monetize the Pythagorean theorem?\n\n12:01.360 --> 12:02.360\n Yeah.\n\n12:02.360 --> 12:08.320\n Well, I mean, education, right, is just to figure out like people who love math education,\n\n12:08.320 --> 12:17.280\n for example, love it purely, not purely, but very often love it for itself, for just teaching\n\n12:17.280 --> 12:18.280\n math.\n\n12:18.280 --> 12:19.280\n Yeah.\n\n12:19.280 --> 12:23.520\n Because, you know, when coming face to face with, for example, like the YouTube algorithm,\n\n12:23.520 --> 12:27.960\n they start to try to figure out, okay, how can I make money off of this?\n\n12:27.960 --> 12:36.000\n The primary goal is still that love of education, but they also want to make that love of education\n\n12:36.000 --> 12:38.320\n their full time job.\n\n12:38.320 --> 12:45.160\n But I see that sort of that dance of humanity with the algorithms as it finds this kind\n\n12:45.160 --> 12:52.200\n of local pocket of optimality, or suboptimality, whatever, it gets stuck in it.\n\n12:52.200 --> 12:54.440\n It's a pocket of some sort.\n\n12:54.440 --> 12:59.520\n But I see that pocket as way better than what we had before in the 80s, right, or the 90s\n\n12:59.520 --> 13:00.520\n before the internet.\n\n13:00.520 --> 13:06.000\n But like, and now we're now, this is also human nature, we start writing very eloquent\n\n13:06.000 --> 13:11.640\n articles about how this pocket is clearly a pocket, it's not very good, and we can imagine\n\n13:11.640 --> 13:17.280\n much better lands far beyond, but the reality is it's better than before, and now we're\n\n13:17.280 --> 13:20.280\n waiting for a new book.\n\n13:20.280 --> 13:21.280\n Yeah.\n\n13:21.280 --> 13:25.680\n And you have to wait either for lone geniuses or for some kind of momentum of a group of\n\n13:25.680 --> 13:31.520\n geniuses that just say, enough is enough, I have an idea, this is how we get out.\n\n13:31.520 --> 13:37.360\n And it's too easy to be sort of, I think, partially because you can get a lot of clicks\n\n13:37.360 --> 13:42.080\n in your articles being cynical about being in this pocket, and we are forever stuck in\n\n13:42.080 --> 13:48.800\n this pocket, and then coming up with this grandiose theory that humanity has finally,\n\n13:48.800 --> 13:54.960\n like it's collapsing, stuck forever like a prison in this pocket, but reality, it's just\n\n13:54.960 --> 14:01.920\n clickbait articles and books until one curious ant comes up with the next pocket.\n\n14:01.920 --> 14:06.700\n Yeah, tunnels through the barrier or gets enough energy to jump over the barrier.\n\n14:06.700 --> 14:12.820\n And eventually we'll be, as you've talked about, I mean, we'll colonize the solar system,\n\n14:12.820 --> 14:18.320\n and then we'll be stuck in the solar system, and then people will say, well, we're screwed\n\n14:18.320 --> 14:24.600\n because when the sun energy runs out, there's no way to get to the next solar system, and\n\n14:24.600 --> 14:25.600\n so on.\n\n14:25.600 --> 14:28.840\n It goes on until we colonize the entirety of the observable universe.\n\n14:28.840 --> 14:29.840\n Yeah.\n\n14:29.840 --> 14:33.480\n I think getting out of the solar system is going to be a hard one.\n\n14:33.480 --> 14:40.700\n So can you, you mentioned this, can you elaborate why you think, back to sort of a serious question,\n\n14:40.700 --> 14:44.020\n why do you think it's hard to get outside of our solar system?\n\n14:44.020 --> 14:46.640\n It's just an energy calculation.\n\n14:46.640 --> 14:56.340\n I mean, you can do it slowly whenever you want, but the idea of getting there in one\n\n14:56.340 --> 15:05.340\n lifetime or a few lifetimes requires huge amounts of energy to accelerate.\n\n15:05.340 --> 15:10.340\n And then as soon as you get halfway there, you need to expend an equal amount of energy\n\n15:10.340 --> 15:15.060\n to decelerate, or you'll just go shooting by.\n\n15:15.060 --> 15:18.360\n And so that means carrying a lot of energy.\n\n15:18.360 --> 15:26.740\n And there's ideas like Yuri Milner, I think, is still funding the idea to use laser propulsion\n\n15:26.740 --> 15:32.420\n to send something to another star system, a small object.\n\n15:32.420 --> 15:35.660\n But it'll have no way to slow down, as far as I know.\n\n15:35.660 --> 15:39.180\n They never talk about that part, like how do we slow down?\n\n15:39.180 --> 15:40.180\n Yeah.\n\n15:40.180 --> 15:42.980\n It's a quick flyby to take a good picture, I guess.\n\n15:42.980 --> 15:45.780\n Yeah, you better take some good pictures on your way by.\n\n15:45.780 --> 15:49.440\n So, and that's great if it happens, I'm not knocking it.\n\n15:49.440 --> 15:55.260\n But the amount of energy that's needed is just staggering, and there's other issues\n\n15:55.260 --> 16:02.740\n like just how do you maintain an ecosystem for that long in isolation?\n\n16:02.740 --> 16:05.180\n How do you prevent people from going crazy?\n\n16:05.180 --> 16:09.940\n What happens if you hit something while traveling at a significant fraction of the speed of\n\n16:09.940 --> 16:10.940\n light?\n\n16:10.940 --> 16:18.580\n So that's sort of some combination of expanding human lifespan, but also just good old fashioned,\n\n16:18.580 --> 16:20.860\n stable society on a spaceship.\n\n16:20.860 --> 16:23.460\n Yeah, yeah, the generation ship.\n\n16:23.460 --> 16:24.460\n Yeah, yeah.\n\n16:24.460 --> 16:26.700\n No, I think that's the only way.\n\n16:26.700 --> 16:31.780\n It would have to keep going for a long time.\n\n16:31.780 --> 16:38.240\n And they might get to where they're going and find a shitty solar system.\n\n16:38.240 --> 16:46.620\n We can try to do some advanced survey, but if you get there and all the planets in that\n\n16:46.620 --> 16:52.860\n solar system are just garbage planets, then it's kind of a big let down for this like\n\n16:52.860 --> 16:57.620\n thousand year voyage that you've just been on, right?\n\n16:57.620 --> 17:07.060\n So we have a pretty narrow range of parameters that we need to stay between in order to survive\n\n17:07.060 --> 17:12.660\n in terms of the gravitational field that we can deal with.\n\n17:12.660 --> 17:19.360\n So that sets a bound on the size of the planet and what we need in the way of temperature\n\n17:19.360 --> 17:21.740\n and atmosphere and so on.\n\n17:21.740 --> 17:31.180\n So when you look at all those complications, then basically building sort of exactly the\n\n17:31.180 --> 17:36.220\n environment we want out of available materials in this solar system starts to look a hell\n\n17:36.220 --> 17:39.180\n of a lot better.\n\n17:39.180 --> 17:47.340\n It's hard to make an economic argument, let's say, for making that journey.\n\n17:47.340 --> 17:51.420\n One of the things I like about the expanse is the fact that the people who are trying\n\n17:51.420 --> 17:57.420\n to build the starship to go to the other solar system are doing it for religious reasons.\n\n17:57.420 --> 18:04.220\n I think that's the only reason that you would do it because economically it just makes more\n\n18:04.220 --> 18:10.020\n sense to build rotating cylindrical space habitats and make them perfect.\n\n18:10.020 --> 18:13.260\n Well, isn't everything done for religious reasons?\n\n18:13.260 --> 18:16.580\n Like why do we exploration?\n\n18:16.580 --> 18:20.180\n Why do we go to the moon again and do the other things?\n\n18:20.180 --> 18:23.740\n What does JFK said is not because they're easy, but because they're hard.\n\n18:23.740 --> 18:25.980\n Isn't that kind of a religious reason?\n\n18:25.980 --> 18:31.100\n I knew a veteran of the Apollo program who once said that the Apollo moon landings were\n\n18:31.100 --> 18:34.380\n communism's greatest achievement.\n\n18:34.380 --> 18:40.500\n Yeah, so the conflict between nations is a kind of...\n\n18:40.500 --> 18:43.740\n Not exactly a religion, but it's what you're talking about.\n\n18:43.740 --> 18:49.940\n Well, it's a struggle for meaning and that meaning isn't found in some kind of...\n\n18:49.940 --> 18:52.220\n It's hard to find meaning in mathematics.\n\n18:52.220 --> 18:56.540\n It's found in some kind of in music and religion, whatever, art.\n\n18:56.540 --> 19:02.900\n Some people do, but those are probably not enough of them to...\n\n19:02.900 --> 19:08.600\n People that find meaning in mathematics, they usually find meaning between the lines nevertheless,\n\n19:08.600 --> 19:15.780\n not in the actual proving some kind of thing.\n\n19:15.780 --> 19:22.420\n So from a cost perspective, do you actually see a possible future where we're building\n\n19:22.420 --> 19:31.420\n these kind of generation ships and just why not launch them one a year out like wandering\n\n19:31.420 --> 19:36.280\n ants out into the galaxy?\n\n19:36.280 --> 19:38.420\n I have nothing against it.\n\n19:38.420 --> 19:46.220\n It's just, like I said, it's got the motivation to do it has to come from some kind of spiritual\n\n19:46.220 --> 19:50.180\n or kind of non tangible calculus.\n\n19:50.180 --> 19:54.940\n So from a business model perspective, you don't think there's a business model there?\n\n19:54.940 --> 19:56.500\n No, no way.\n\n19:56.500 --> 20:01.460\n One of the many fascinating things you've done in your life, you were at the very beginning,\n\n20:01.460 --> 20:08.540\n you were the person that convinced Jeff Bezos to start a spaceship company, a space company.\n\n20:08.540 --> 20:16.040\n You were there at Blue Origin for a few years in the beginning working on alternate propulsion\n\n20:16.040 --> 20:22.180\n systems and at least according to Wikipedia, alternate business models.\n\n20:22.180 --> 20:28.700\n Yeah, I mean, to go back to the first thing you said, Jeff Bezos is not a guy who required\n\n20:28.700 --> 20:31.140\n a lot of convincing.\n\n20:31.140 --> 20:36.140\n He'd been thinking about it since he was five years old and it was an inevitability.\n\n20:36.140 --> 20:50.060\n But the idea that kind of got hatched in 1999 was to just do some advanced scouting work,\n\n20:50.060 --> 20:55.340\n explore the corners of the space of possibilities.\n\n20:55.340 --> 21:03.460\n And so that was Blue Operations LLC, which was the precursor to Blue Origin.\n\n21:03.460 --> 21:08.820\n And so it was a small staff of people that did that for a few years.\n\n21:08.820 --> 21:17.100\n And I think it was about 2003, 2004 that it swung decisively towards the direction it's\n\n21:17.100 --> 21:24.580\n been following ever since, which is using basically existing aerospace technologies\n\n21:24.580 --> 21:31.020\n and models to make chemical fueled rockets for space tourism.\n\n21:31.020 --> 21:36.220\n I believe and I continue to believe that the fact that we use chemical rockets is just\n\n21:36.220 --> 21:40.860\n an accident of history that comes out of World War II.\n\n21:40.860 --> 21:48.760\n So until World War II, rockets are being built on a small scale by people like Robert Goddard.\n\n21:48.760 --> 21:55.620\n But then Hitler desperately wants to bomb London, but he can't quite reach it and the\n\n21:55.620 --> 21:58.580\n Luftwaffe has been kind of neutralized.\n\n21:58.580 --> 22:07.580\n So he decides he's going to lob warheads into it with rockets, which is a terrible misallocation\n\n22:07.580 --> 22:08.580\n of resources.\n\n22:08.580 --> 22:10.920\n It's a terrible idea.\n\n22:10.920 --> 22:17.780\n So it only could have happened in a dictatorship controlled by a lunatic.\n\n22:17.780 --> 22:20.300\n But that's the situation that existed.\n\n22:20.300 --> 22:25.420\n So they built these rockets, that's the V2.\n\n22:25.420 --> 22:32.320\n And then it's just a complete coincidence that that war ends with atomic bombs being\n\n22:32.320 --> 22:37.160\n developed in a completely separate super weapon program.\n\n22:37.160 --> 22:44.140\n And so suddenly the existence of the bombs creates a demand for rockets that didn't exist\n\n22:44.140 --> 22:50.420\n before because if you've got atomic bombs, you need a way to deliver them.\n\n22:50.420 --> 22:56.700\n You can do it with bombers, but it's a lot better to just hurl them to the other side\n\n22:56.700 --> 23:00.300\n of the world on the top of a rocket.\n\n23:00.300 --> 23:06.100\n So suddenly rockets, which had gotten a boost because of Hitler's V2 program, got a much\n\n23:06.100 --> 23:10.740\n bigger boost during the 50s and 60s.\n\n23:10.740 --> 23:15.500\n And it is a complete, you're right, for some reason I never thought of this, it is an accident\n\n23:15.500 --> 23:20.580\n of history that nuclear weapons are developed at a similar time.\n\n23:20.580 --> 23:25.100\n First of all, nuclear weapons didn't have to be developed at the same time as World\n\n23:25.100 --> 23:26.420\n War II.\n\n23:26.420 --> 23:27.420\n That's an accident in history.\n\n23:27.420 --> 23:34.060\n And then the fact, okay, so then Hitler started using rockets, that's an accident of, okay,\n\n23:34.060 --> 23:35.060\n that's fascinating.\n\n23:35.060 --> 23:38.620\n That's a fascinating set of coincidences.\n\n23:38.620 --> 23:42.580\n Yeah, which is true of a lot of technologies, by the way.\n\n23:42.580 --> 23:50.160\n By the time these rockets are kind of working, we've got hydrogen bombs that are so big and\n\n23:50.160 --> 23:54.540\n so devastating that nobody really wants to use them.\n\n23:54.540 --> 24:00.620\n But it turns out you can fit a capsule with a couple of people in it into the socket on\n\n24:00.620 --> 24:08.140\n the end of a missile that was made to hold a hydrogen bomb.\n\n24:08.140 --> 24:15.500\n So we start doing that instead as a proxy for having a war.\n\n24:15.500 --> 24:22.460\n I'd love to be in the meeting where the first guy brought that up as an idea.\n\n24:22.460 --> 24:23.460\n It's probably a Russian.\n\n24:23.460 --> 24:25.980\n Why don't we strap a person to the rocket?\n\n24:25.980 --> 24:26.980\n Yeah, yeah.\n\n24:26.980 --> 24:30.100\n Well, it probably was because they did it first, right?\n\n24:30.100 --> 24:31.100\n The Russians did it first.\n\n24:31.100 --> 24:34.340\n And they had perhaps less respect for sort of safety protocols.\n\n24:34.340 --> 24:35.340\n Could be.\n\n24:35.340 --> 24:40.180\n They were a little bit more willing to sacrifice the life of an astronaut or to risk the life\n\n24:40.180 --> 24:41.180\n of an astronaut.\n\n24:41.180 --> 24:42.180\n Could be.\n\n24:42.180 --> 24:43.180\n Yeah, yeah.\n\n24:43.180 --> 24:47.500\n This is basically the story of how through all of this competition and because of these\n\n24:47.500 --> 24:56.260\n historical accidents, trillions of R&D dollars and rubles were put into development of chemical\n\n24:56.260 --> 25:02.120\n rocket technology, which has now advanced to an incredibly high degree.\n\n25:02.120 --> 25:08.220\n But there's other ways to make things go really fast, which is all that rockets do.\n\n25:08.220 --> 25:09.340\n That's all orbit is.\n\n25:09.340 --> 25:12.620\n It's just going really fast.\n\n25:12.620 --> 25:19.620\n And because so many nerds are obsessed with space, people have been thinking about alternate\n\n25:19.620 --> 25:24.440\n schemes for as long as they've been thinking about rockets.\n\n25:24.440 --> 25:33.020\n And so one of the first things that I learned kind of trying to explore new possibilities\n\n25:33.020 --> 25:42.020\n was that I could put all of my brainpower to work and be creative as I could and invent\n\n25:42.020 --> 25:46.540\n some idea that I thought was new for making things go fast.\n\n25:46.540 --> 25:51.760\n And I would always find out that some guy in Russia or somewhere had thought the same\n\n25:51.760 --> 25:57.620\n idea up 50 years ago and figured out all the math.\n\n25:57.620 --> 26:03.940\n And so at a certain point, you give up on trying to invent completely new ideas and\n\n26:03.940 --> 26:10.100\n just go poking around trying to find those guys.\n\n26:10.100 --> 26:15.420\n So there's a number of ideas that we looked at.\n\n26:15.420 --> 26:18.540\n Some are crazier, some are less crazy.\n\n26:18.540 --> 26:23.740\n And the direction that that company eventually took was chemical rockets.\n\n26:23.740 --> 26:26.660\n Is there something you can comment on possible ideas?\n\n26:26.660 --> 26:34.380\n So first of all, you could use nuclear, so nuclear propulsion.\n\n26:34.380 --> 26:35.380\n Yeah.\n\n26:35.380 --> 26:40.860\n So that's, I mean, you've probably heard of Project Orion, which was the...\n\n26:40.860 --> 26:50.180\n Freeman Dyson and some of his collaborators had a scheme to power a large space vehicle\n\n26:50.180 --> 26:53.580\n by detonating atomic bombs behind it.\n\n26:53.580 --> 26:58.700\n And so one of the other people who was working at Blue Operations during this time was George\n\n26:58.700 --> 27:01.280\n Dyson, the son of Freeman.\n\n27:01.280 --> 27:08.220\n And so we knew all about Project Orion and he found an old film that they'd shot on a\n\n27:08.220 --> 27:16.420\n beach in La Jolla of a prototype of this that was powered by like lumps of C4.\n\n27:16.420 --> 27:21.820\n So that was an idea, but for a private company, obtaining a large number of atomic bombs was\n\n27:21.820 --> 27:23.420\n probably out of scope.\n\n27:23.420 --> 27:27.340\n So it was more of a theoretical thing.\n\n27:27.340 --> 27:38.420\n There's a conceptually similar approach using lasers that Freeman worked on with Arthur\n\n27:38.420 --> 27:44.620\n Kantrowitz and some others, where you take a pulsed laser and you fire it at a vehicle\n\n27:44.620 --> 27:47.480\n that has a block of ice on the back.\n\n27:47.480 --> 27:55.600\n And the pulse hits the ice and flashes off a layer of steam that becomes plasma.\n\n27:55.600 --> 27:58.420\n And plasma is opaque because it conducts.\n\n27:58.420 --> 28:04.380\n And so being opaque, it then absorbs all of the energy from the laser pulse and gets\n\n28:04.380 --> 28:10.060\n really hot and just pushes on the back of the block of ice.\n\n28:10.060 --> 28:14.140\n And then you wait a moment for that to dissipate and then you do it again.\n\n28:14.140 --> 28:19.140\n So it would just kind of vibrate its way.\n\n28:19.140 --> 28:23.380\n Like it sounds really violent, but Freeman said that if you were wearing like rubber\n\n28:23.380 --> 28:31.060\n sold tennis shoes standing in this vehicle, you would just feel a mild vibration.\n\n28:31.060 --> 28:35.420\n So there your source of energy is on the ground and you're getting higher specific impulse\n\n28:35.420 --> 28:39.480\n than you could get by burning chemicals.\n\n28:39.480 --> 28:47.740\n Jordan Kerr and others worked on another laser system, the late Dr. Jordan Kerr, that just\n\n28:47.740 --> 28:55.500\n would heat up a heat exchanger by many converging solid state lasers from the ground.\n\n28:55.500 --> 29:05.180\n And Kevin Parkin works on a similar scheme that just uses microwaves to do that.\n\n29:05.180 --> 29:07.420\n We looked at tall towers.\n\n29:07.420 --> 29:13.940\n I spent a while looking kind of semi seriously at giant bullwhips.\n\n29:13.940 --> 29:15.460\n What's a bullwhip?\n\n29:15.460 --> 29:19.580\n Just a whip, you have them here in Texas, right?\n\n29:19.580 --> 29:21.980\n Yeah, I understand.\n\n29:21.980 --> 29:23.940\n But how does that have to do with propulsion?\n\n29:23.940 --> 29:29.580\n If you think about it, a whip is an incredibly simple primitive object that can break the\n\n29:29.580 --> 29:31.880\n speed of sound.\n\n29:31.880 --> 29:39.860\n So it's unbelievable in a way that for thousands of years, people with no technology have been\n\n29:39.860 --> 29:49.100\n able to accelerate objects through the speed of sound just through an architectural trick.\n\n29:49.100 --> 29:58.940\n Just the physics of a moving bend of material in a medium can do this.\n\n29:58.940 --> 30:02.300\n So that's the thing I still think about from time to time.\n\n30:02.300 --> 30:10.940\n You can use the same physics to make freestanding loops of chain or other flexible materials\n\n30:10.940 --> 30:14.700\n that just kind of stand up under their own physics.\n\n30:14.700 --> 30:19.900\n I mean, it's kind of awesome to imagine.\n\n30:19.900 --> 30:28.220\n So imagine using the same kind of physics of a whip, but have at the end of it a spaceship.\n\n30:28.220 --> 30:34.220\n That would detach at the moment of maximum velocity.\n\n30:34.220 --> 30:36.900\n Why not?\n\n30:36.900 --> 30:37.900\n Why wouldn't that?\n\n30:37.900 --> 30:43.260\n So part of my motivation in studying that was to ask that question.\n\n30:43.260 --> 30:52.560\n It was more almost a symbolic way of saying, look, there's all kinds of physics we haven't\n\n30:52.560 --> 30:55.200\n explored yet.\n\n30:55.200 --> 31:01.500\n It's no more crazy than the idea of chemical rockets.\n\n31:01.500 --> 31:08.100\n It's just that more money's gone into chemical rockets, right?\n\n31:08.100 --> 31:14.440\n Can I ask you a question on propulsion that's a little bit more out there?\n\n31:14.440 --> 31:21.860\n So I don't know if you've seen quite a lot of recent articles and reports and so on about\n\n31:21.860 --> 31:26.660\n UFOs, like the Tic Tac aircraft.\n\n31:26.660 --> 31:32.740\n I keep seeing a lot of chatter about it, but I haven't gone deep into it.\n\n31:32.740 --> 31:42.420\n So the DOD released footage filmed by pilots, and there's a lot of reports about objects\n\n31:42.420 --> 31:49.620\n that moved in ways they haven't seen before that seem to defy the laws of physics if we\n\n31:49.620 --> 31:52.640\n consider the aircraft that we have today.\n\n31:52.640 --> 32:02.420\n So the reason I asked you that is because it kind of, to me, whatever the heck it is,\n\n32:02.420 --> 32:08.040\n it's inspiring for the possibilities of ideas for propulsion.\n\n32:08.040 --> 32:15.020\n If it's like secret projects from foreign nations or it's physical phenomena that we\n\n32:15.020 --> 32:20.500\n don't yet understand, like ball lightning, all those kinds of things, or if it is aliens\n\n32:20.500 --> 32:23.740\n or objects from an alien civilization.\n\n32:23.740 --> 32:28.980\n I most likely believe if it's an object from an alien civilization, it's got to be like\n\n32:28.980 --> 32:32.660\n a really dumb drone that just got lost.\n\n32:32.660 --> 32:37.100\n It's definitely not like the pinnacle of intelligence.\n\n32:37.100 --> 32:42.180\n It's like some teenager's science fair experiment.\n\n32:42.180 --> 32:47.660\n Yeah, it just flew for a few centuries out and just landed, and then we humans are all\n\n32:47.660 --> 32:51.820\n like really excited about this wild thing.\n\n32:51.820 --> 32:54.940\n I mean, what do you think about those...\n\n32:54.940 --> 32:57.420\n First of all, like the millions of reports of UFOs, right?\n\n32:57.420 --> 33:03.520\n There's some psychology there that's deeply cultural, but also the possibility of aliens\n\n33:03.520 --> 33:05.020\n having visited Earth.\n\n33:05.020 --> 33:09.420\n Yeah, I mean, I'd like to see some better pictures.\n\n33:09.420 --> 33:14.300\n For the reason I mentioned earlier, having to do with the difficulty of traveling between\n\n33:14.300 --> 33:19.460\n star systems, it's really hard for me to believe it's aliens.\n\n33:19.460 --> 33:25.600\n I just can't understand why you would go to all that trouble to transport something across\n\n33:25.600 --> 33:32.420\n light years and then do what these UFOs are allegedly doing.\n\n33:32.420 --> 33:34.040\n Like how is that interesting?\n\n33:34.040 --> 33:36.420\n How does that justify the trip?\n\n33:36.420 --> 33:45.540\n So if you travel across those kinds of distances, you would make a bigger splash.\n\n33:45.540 --> 33:51.340\n First of all, I would expect that the arrival of these things would be something we'd notice.\n\n33:51.340 --> 33:58.300\n It's got to decelerate into our solar system unless it got here really, really, really\n\n33:58.300 --> 33:59.300\n slowly.\n\n33:59.300 --> 34:04.200\n So I guess that's a possibility and just kind of snuck in.\n\n34:04.200 --> 34:08.020\n So at the end, we would detect some kind of footprint in terms of energy.\n\n34:08.020 --> 34:09.080\n You would think.\n\n34:09.080 --> 34:17.280\n So I actually think your idea of a science fair project gone bad, it makes more sense\n\n34:17.280 --> 34:23.760\n in that it would explain why if these things are alien technologies, they're just kind\n\n34:23.760 --> 34:32.300\n of hanging around our aircraft carriers for no particular reason, like not trying to communicate.\n\n34:32.300 --> 34:39.420\n Can you imagine a scenario where aliens have visited Earth or are visiting Earth and we\n\n34:39.420 --> 34:41.180\n wouldn't notice it at all?\n\n34:41.180 --> 34:42.180\n Oh, sure.\n\n34:42.180 --> 34:48.580\n I mean, if they've got technology to get here, they've probably got technology to conceal\n\n34:48.580 --> 34:50.940\n the fact that they're trying to conceal themselves.\n\n34:50.940 --> 34:56.380\n I meant more like they're not trying to conceal themselves, but we're just our cognitive capabilities\n\n34:56.380 --> 35:00.940\n are like too limited and we are not thinking big enough.\n\n35:00.940 --> 35:05.500\n We're looking for little green men, we're looking for things that operate at a time\n\n35:05.500 --> 35:10.940\n scale that's human like, you know.\n\n35:10.940 --> 35:13.260\n I love thinking about ideas like that.\n\n35:13.260 --> 35:20.080\n That's great science fiction novel fodder that the aliens are so different that we simply\n\n35:20.080 --> 35:22.540\n don't see them.\n\n35:22.540 --> 35:29.860\n Is there, in terms of language, do you think it would be difficult, not aliens visiting\n\n35:29.860 --> 35:34.140\n us but traveling to other places to find a common language?\n\n35:34.140 --> 35:41.800\n You've written about the importance of language in intelligent civilizations.\n\n35:41.800 --> 35:47.420\n How difficult is the problem to bridge the gap between aliens and humans in terms of\n\n35:47.420 --> 35:50.100\n language so we're not lost in translation?\n\n35:50.100 --> 35:54.460\n Yeah, I mean, there's different takes on that depending on how biologically similar they\n\n35:54.460 --> 35:56.540\n are to us, you know.\n\n35:56.540 --> 36:04.380\n I mean, there's a school of thought that says, basically, advanced life has to be carbon\n\n36:04.380 --> 36:07.560\n based for just reasons of chemistry.\n\n36:07.560 --> 36:14.460\n So right away, if you impose that limitation, then you're kind of assuming something that's\n\n36:14.460 --> 36:17.660\n starting to be biologically similar to us.\n\n36:17.660 --> 36:25.660\n So if they're about as big as we are and they kind of move around in space, in a physical\n\n36:25.660 --> 36:32.840\n body the way we do, then there's probably a way to solve that communication problem.\n\n36:32.840 --> 36:40.300\n If they're beings of pure energy from Star Trek or something like that, then it's a different\n\n36:40.300 --> 36:41.300\n story.\n\n36:41.300 --> 36:42.500\n Well, I love thinking about that kind of stuff too.\n\n36:42.500 --> 36:47.700\n I mean, consciousness itself may be alien.\n\n36:47.700 --> 36:55.140\n I mean, it could be, like you said, beings of pure energy.\n\n36:55.140 --> 37:01.220\n I think of life as just complex systems, and the kind of forms those complex systems can\n\n37:01.220 --> 37:06.900\n take seems to be much larger than the particular biological systems we see here on Earth.\n\n37:06.900 --> 37:11.420\n I have to ask a Twitter question about aliens.\n\n37:11.420 --> 37:12.420\n You ready?\n\n37:12.420 --> 37:13.420\n This is for Twitter.\n\n37:13.420 --> 37:14.420\n I'm ready.\n\n37:14.420 --> 37:15.700\n What would you expect from Twitter?\n\n37:15.700 --> 37:19.540\n Can humans have sex with aliens?\n\n37:19.540 --> 37:20.540\n Neil Stevenson.\n\n37:20.540 --> 37:24.540\n You could pass.\n\n37:24.540 --> 37:25.900\n I asked a language question.\n\n37:25.900 --> 37:26.900\n Can they communicate?\n\n37:26.900 --> 37:27.900\n Yeah.\n\n37:27.900 --> 37:30.980\n Can they fall in love before sex?\n\n37:30.980 --> 37:33.660\n That's how it works.\n\n37:33.660 --> 37:35.420\n So which question am I answering?\n\n37:35.420 --> 37:37.820\n The sex or the love?\n\n37:37.820 --> 37:45.300\n I mean, it depends what is more fundamental to relations across intelligent species.\n\n37:45.300 --> 37:46.300\n Yeah.\n\n37:46.300 --> 37:49.980\n I mean, sex can mean a lot of things.\n\n37:49.980 --> 37:51.980\n So I mean, if you're...\n\n37:51.980 --> 37:53.260\n Your production, right?\n\n37:53.260 --> 38:02.660\n You know, in Star Trek, in classic Star Trek, you had to really suspend your disbelief to\n\n38:02.660 --> 38:07.940\n think that Spock was half Vulcan and half human, right?\n\n38:07.940 --> 38:15.900\n Because that's just not going to work DNA wise.\n\n38:15.900 --> 38:26.820\n So if by sex, you mean reproductive sex, then I would say no, unless you go to a panspermia\n\n38:26.820 --> 38:34.980\n kind of theory, which is that, you know, humans were seeded onto the planet as part of a galactic,\n\n38:34.980 --> 38:40.100\n you know, program of some sort.\n\n38:40.100 --> 38:44.500\n And then we're just returning home, hanging out with our old relatives.\n\n38:44.500 --> 38:45.500\n Distant cousins.\n\n38:45.500 --> 38:46.500\n Yeah.\n\n38:46.500 --> 38:52.260\n But that doesn't seem, you know, it doesn't seem plausible.\n\n38:52.260 --> 39:00.620\n We know that humans had sex with Neanderthals, with Denisovans, so you could think of them\n\n39:00.620 --> 39:06.860\n as aliens that came from our planet.\n\n39:06.860 --> 39:11.780\n So that's a kind of data point, I guess.\n\n39:11.780 --> 39:19.700\n But you know, if you broaden your definition of sex to mean any kind of gratifying physical\n\n39:19.700 --> 39:21.900\n interaction then sure.\n\n39:21.900 --> 39:22.900\n Right.\n\n39:22.900 --> 39:23.900\n Dancing.\n\n39:23.900 --> 39:27.100\n And that's how we get to love.\n\n39:27.100 --> 39:28.540\n And love can take many forms.\n\n39:28.540 --> 39:30.260\n Love can certainly take many forms.\n\n39:30.260 --> 39:36.260\n I have to ask you, in terms of space, just looking at where Blue Origin is, looking at\n\n39:36.260 --> 39:43.780\n where SpaceX is today, and maybe looking out 10, 20 years out from now, are you impressed\n\n39:43.780 --> 39:44.780\n at what's happening?\n\n39:44.780 --> 39:47.460\n We just saw William Shatner go up to space.\n\n39:47.460 --> 39:51.820\n Yeah, I was just watching his video this morning before I came here.\n\n39:51.820 --> 39:52.820\n Yeah.\n\n39:52.820 --> 39:54.700\n Are you impressed at where things stand today?\n\n39:54.700 --> 39:55.700\n Yeah.\n\n39:55.700 --> 40:03.660\n I mean, SpaceX in particular has done things that are just unbelievable.\n\n40:03.660 --> 40:12.100\n And I don't think anyone was anticipating 20 years ago, let's say, when this all started,\n\n40:12.100 --> 40:19.260\n just the speed with which they'd be able to rack up these incredible achievements.\n\n40:19.260 --> 40:26.520\n If you've kind of even seen a little bit of how the sausage is made and so the difficulty\n\n40:26.520 --> 40:36.820\n of doing any kind of space travel, what they've achieved is just unbelievable.\n\n40:36.820 --> 40:40.980\n What about maybe a question about Elon Musk?\n\n40:40.980 --> 40:50.140\n Even more than Jeff Bezos, he has a very kind of ambitious vision of this project that we're\n\n40:50.140 --> 40:58.140\n on as a species, of becoming a multi planetary species and becoming that quickly, as soon\n\n40:58.140 --> 41:01.300\n as possible, landing on Mars, colonizing Mars.\n\n41:01.300 --> 41:03.100\n What do you think of that project?\n\n41:03.100 --> 41:04.100\n There's two questions to ask.\n\n41:04.100 --> 41:09.060\n First, the question is, what do you think about the project of colonizing Mars?\n\n41:09.060 --> 41:19.420\n And second, what do you think about a human being who is so unapologetically ambitious\n\n41:19.420 --> 41:23.420\n at achieving the impossible, what a lot of people would say is impossible?\n\n41:23.420 --> 41:32.580\n I think that colonizing Mars is the kind of goal that's easily stated.\n\n41:32.580 --> 41:34.340\n It's catchy.\n\n41:34.340 --> 41:41.020\n It's the kind of thing that can inspire people to get involved in a way that some other programs\n\n41:41.020 --> 41:42.020\n might not.\n\n41:42.020 --> 41:45.740\n So I think it's well chosen in that way.\n\n41:45.740 --> 41:54.260\n I have technical questions about, there's a problem of perchlorates on the surface of\n\n41:54.260 --> 41:58.060\n Mars that's going to be big trouble.\n\n41:58.060 --> 42:00.540\n And there's radiation.\n\n42:00.540 --> 42:04.060\n This is known.\n\n42:04.060 --> 42:05.460\n What about business questions?\n\n42:05.460 --> 42:12.140\n Do you think, because you mentioned sort of going outside of the solar system would best\n\n42:12.140 --> 42:15.620\n be done for religious reasons.\n\n42:15.620 --> 42:17.820\n What about colonizing Mars?\n\n42:17.820 --> 42:20.460\n Can you spin it into a business proposition?\n\n42:20.460 --> 42:27.660\n It's hard to think of a resource that's on Mars that could be brought back here cheaply\n\n42:27.660 --> 42:37.020\n enough to compete with stuff we could just dig out of the ground here or grow here.\n\n42:37.020 --> 42:42.480\n So I don't know if there is a business plan for that or if it's just strictly we're going\n\n42:42.480 --> 42:49.140\n to go there and see what happens.\n\n42:49.140 --> 42:55.860\n Maybe again we need communism to get us going, to give us a reason, a little bit of the competition.\n\n42:55.860 --> 43:02.180\n Well there's plenty of people who are sufficiently excited by the colonize Mars vision that they're\n\n43:02.180 --> 43:12.180\n willing to just go all in on it, even if there's not a business plan behind it.\n\n43:12.180 --> 43:17.540\n But I think it's well chosen.\n\n43:17.540 --> 43:23.620\n I think it's probably the only approach to take.\n\n43:23.620 --> 43:32.340\n A lot of the, when white people came to this continent and started colonizing it, there\n\n43:32.340 --> 43:35.620\n was not a lot of coherent planning.\n\n43:35.620 --> 43:40.860\n What plans they did have turned out to be terrible plans.\n\n43:40.860 --> 43:47.660\n Trying to come up with plans that extend decades into the future is a waste of time.\n\n43:47.660 --> 43:58.700\n So do it for the kind of unexplainable love of the unknown, like the journey towards exploring\n\n43:58.700 --> 44:03.100\n the unknown and just kind of keep going.\n\n44:03.100 --> 44:10.380\n You saw it with Shatner and his reaction to the flight yesterday.\n\n44:10.380 --> 44:20.060\n He, for him that trip was more than worth it just for these intangible reasons.\n\n44:20.060 --> 44:21.060\n What did he say?\n\n44:21.060 --> 44:22.180\n I haven't watched the video yet.\n\n44:22.180 --> 44:28.700\n He was trying to express, talking a lot about the moment where suddenly you kind of rise\n\n44:28.700 --> 44:37.340\n above the thin blue blanket of the atmosphere and you're up into the blackness.\n\n44:37.340 --> 44:41.060\n And that had a huge impact on him.\n\n44:41.060 --> 44:45.860\n So he was kind of, I wouldn't say groping for words because he was pretty eloquent,\n\n44:45.860 --> 44:52.980\n but he was trying to express his feelings about that in a way that is pretty gripping\n\n44:52.980 --> 44:55.980\n to watch.\n\n44:55.980 --> 45:00.660\n So you worked on this kind of stuff, we can go back 10 years ago.\n\n45:00.660 --> 45:03.980\n You wrote an essay called Innovation Starvation.\n\n45:03.980 --> 45:13.300\n You worked on this kind of idea since then, kind of looking at maybe a little bit cynically\n\n45:13.300 --> 45:19.980\n about our age today and our unwillingness to take on big risky projects.\n\n45:19.980 --> 45:23.540\n So in the face of that, what do you think of people like Elon Musk?\n\n45:23.540 --> 45:31.620\n Because to me, people like that are inspiring and gives you hope in the face of a more kind\n\n45:31.620 --> 45:36.300\n of pessimistic perspective of our age.\n\n45:36.300 --> 45:45.900\n Yeah, well he's clearly willing to tackle big ambitious projects without a lot of kind\n\n45:45.900 --> 45:52.540\n of soul searching or trying to make up his mind, right?\n\n45:52.540 --> 45:58.020\n It's just like, let's dig tunnels under cities.\n\n45:58.020 --> 45:59.020\n Go.\n\n45:59.020 --> 46:02.620\n Step one, make a joke about it on Twitter.\n\n46:02.620 --> 46:04.820\n Step two, actually do it.\n\n46:04.820 --> 46:05.820\n Yeah.\n\n46:05.820 --> 46:06.820\n Yeah.\n\n46:06.820 --> 46:09.740\n And I mean, things have slowed down quite a bit.\n\n46:09.740 --> 46:19.780\n Our ability to build things at pace is a lot less than it was, and there's reasons for\n\n46:19.780 --> 46:20.780\n that.\n\n46:20.780 --> 46:26.700\n We're more concerned with safety and environmental impacts than people were when they were building\n\n46:26.700 --> 46:32.540\n some of the great Publixworks projects of the mid 20th century.\n\n46:32.540 --> 46:36.880\n But we're at the point now where even just maintaining the stuff that we've got is such\n\n46:36.880 --> 46:45.420\n a huge project that we need to put big resources into it and good minds into it, or else we're\n\n46:45.420 --> 46:52.300\n going to be losing things that we take for granted.\n\n46:52.300 --> 46:57.020\n Do you think that there's a lot to be done in the digital space?\n\n46:57.020 --> 47:02.300\n You mentioned sort of Wikipedia and knowledge, don't you think there could be a lot of flourishing\n\n47:02.300 --> 47:06.700\n in the space of innovation, in terms of innovation in the digital space?\n\n47:06.700 --> 47:08.860\n Yeah, I mean, I'd like to see that.\n\n47:08.860 --> 47:16.880\n I think it's where a lot of the brainpower went during the last couple of generations,\n\n47:16.880 --> 47:24.700\n because people who might previously have been building rockets or other kinds of hard technologies\n\n47:24.700 --> 47:33.620\n ended up instead going into programming, computer science, which is understandable and great.\n\n47:33.620 --> 47:38.580\n We've got structural problems right now in the way social media works that are pretty\n\n47:38.580 --> 47:46.060\n severe, and so I certainly hope that we're not, 10 years from now, that we're not exactly\n\n47:46.060 --> 47:49.740\n where we are today when it comes to that stuff.\n\n47:49.740 --> 47:51.780\n We need to move on.\n\n47:51.780 --> 47:59.180\n The beautiful thing about problems is they show you how not to do things, and they give\n\n47:59.180 --> 48:07.660\n opportunity to new ideas to flourish and to beat out the ideas of the old, which is a\n\n48:07.660 --> 48:15.700\n dream for me to see new social media that beats out the ways of the old.\n\n48:15.700 --> 48:21.700\n So I tend to, you perhaps agree that it's not, that it's impossible to do social media\n\n48:21.700 --> 48:22.700\n well.\n\n48:22.700 --> 48:23.700\n Oh, not at all.\n\n48:23.700 --> 48:28.300\n I mean, I listened to your interview with Jaren a couple of weeks ago, and I know Jaren,\n\n48:28.300 --> 48:31.520\n and we've talked about this.\n\n48:31.520 --> 48:32.800\n He went hard on me.\n\n48:32.800 --> 48:35.220\n He basically said, like, it's impossible.\n\n48:35.220 --> 48:36.860\n It was very nice.\n\n48:36.860 --> 48:42.600\n Well, the last time I kind of paid attention to Jaren's thoughts on it, he was thinking\n\n48:42.600 --> 48:50.940\n in terms of that basically there should be micro payments such that if I, by clicking\n\n48:50.940 --> 49:01.020\n the like button on something, I'm essentially giving valuable intellectual property to Facebook\n\n49:01.020 --> 49:03.220\n or Twitter or whatever.\n\n49:03.220 --> 49:08.980\n It's not a very large amount of IP, but it's definitely a transfer of information that\n\n49:08.980 --> 49:12.060\n when they aggregate it is beneficial to them.\n\n49:12.060 --> 49:20.980\n So and now I do remember that he, on his interview with you, was talking about what, data unions\n\n49:20.980 --> 49:21.980\n or?\n\n49:21.980 --> 49:22.980\n Yeah.\n\n49:22.980 --> 49:28.780\n Those are a lot of interesting ideas, but for me, the biggest disagreement was in the\n\n49:28.780 --> 49:30.880\n level of cynicism.\n\n49:30.880 --> 49:36.820\n He has a distrust and cynicism towards people in Silicon Valley being able to do these kinds\n\n49:36.820 --> 49:38.140\n of things.\n\n49:38.140 --> 49:43.940\n And I'm really, okay, when you have a large crowd of people that are doing things the\n\n49:43.940 --> 49:50.860\n wrong way, you should nevertheless maintain optimism because what's important is to find\n\n49:50.860 --> 49:54.100\n the one person in that room that's going to do things the right way.\n\n49:54.100 --> 49:57.780\n Cynicism is going to completely silence out the whole room.\n\n49:57.780 --> 50:00.740\n So he was saying, I've been here a long time.\n\n50:00.740 --> 50:01.740\n Oh yeah.\n\n50:01.740 --> 50:09.060\n I've known, you know, I understand like how these folks work, they think they're gods\n\n50:09.060 --> 50:15.340\n and they know the right way to do things and they will tell you how to do those things.\n\n50:15.340 --> 50:20.460\n And that kind of hubris is going to always lead you astray when you are the one who's\n\n50:20.460 --> 50:22.820\n engineering the algorithms.\n\n50:22.820 --> 50:27.620\n And there's a lot of deep truth to that because algorithms are powerful.\n\n50:27.620 --> 50:32.820\n And many people when given power do not do the best of things.\n\n50:32.820 --> 50:38.620\n I mean, most, what is it, the old Lincoln line, if you want to test the man's character,\n\n50:38.620 --> 50:39.620\n give him power.\n\n50:39.620 --> 50:40.620\n Yeah.\n\n50:40.620 --> 50:41.620\n Yes.\n\n50:41.620 --> 50:46.100\n But that doesn't mean that some people are not able to handle the power, that some people\n\n50:46.100 --> 50:51.020\n are not able to come up with good ideas that create better social media.\n\n50:51.020 --> 50:58.060\n Yeah, I didn't interpret Jaren's statements as being entirely cynical and hopeless.\n\n50:58.060 --> 51:03.540\n He's definitely raising, you know, issues of concern.\n\n51:03.540 --> 51:07.220\n But he wouldn't be out, you know, writing the books that he's written and talking about\n\n51:07.220 --> 51:09.500\n this stuff if he didn't think there was a way.\n\n51:09.500 --> 51:11.460\n If he didn't think there was hope, yeah.\n\n51:11.460 --> 51:15.380\n And part of it, as you probably know with Jaren, he just loves a good argument.\n\n51:15.380 --> 51:16.380\n Yeah.\n\n51:16.380 --> 51:19.740\n He just loves to have a little bit of fun.\n\n51:19.740 --> 51:27.780\n Well I have to ask you about, I mean, we talked about taking all big, bold, risky ideas.\n\n51:27.780 --> 51:33.100\n So in your new book, Termination Shock, it's set here in Texas.\n\n51:33.100 --> 51:34.100\n Part of it is, yeah.\n\n51:34.100 --> 51:35.100\n Yeah.\n\n51:35.100 --> 51:36.100\n Most of it.\n\n51:36.100 --> 51:37.100\n Yeah.\n\n51:37.100 --> 51:38.100\n It's a great place to set it.\n\n51:38.100 --> 51:43.460\n So in it, the main character, TR McCooligan, a Texas billionaire oil man and truck stop\n\n51:43.460 --> 51:48.460\n magnate, decides to solve climate change, to take on climate change by himself.\n\n51:48.460 --> 51:54.580\n So this is an interesting philosophical exploration of how to solve climate change from a perspective\n\n51:54.580 --> 51:57.740\n that's perhaps different than we've been thinking about.\n\n51:57.740 --> 52:04.980\n I wouldn't use the word solve, but let's say ameliorate the temporary effects.\n\n52:04.980 --> 52:05.980\n But please.\n\n52:05.980 --> 52:06.980\n Take on.\n\n52:06.980 --> 52:07.980\n Yeah.\n\n52:07.980 --> 52:08.980\n Take on the challenge.\n\n52:08.980 --> 52:15.380\n So it's very interesting, but as, so there's a gradual nature to this process.\n\n52:15.380 --> 52:28.340\n And I mean, just like in your book, the power of innovation is something that has saved\n\n52:28.340 --> 52:30.900\n us quite a few times in history.\n\n52:30.900 --> 52:34.620\n So what role does that play in this gradual process?\n\n52:34.620 --> 52:35.620\n Right.\n\n52:35.620 --> 52:43.900\n So ultimately we don't solve the problem until we get the CO2 out of the atmosphere.\n\n52:43.900 --> 52:46.940\n But that is going to take a while.\n\n52:46.940 --> 52:49.080\n We're still adding more.\n\n52:49.080 --> 52:52.500\n We haven't even started to reduce the amount.\n\n52:52.500 --> 52:58.920\n So there's two possibilities inside to interrupt is reduce the amount that we're putting in\n\n52:58.920 --> 53:03.700\n the atmosphere and two is removing what we got in the atmosphere.\n\n53:03.700 --> 53:04.700\n We have to do both.\n\n53:04.700 --> 53:05.700\n Right.\n\n53:05.700 --> 53:11.020\n And those are two different kind of efforts in terms of like what's involved.\n\n53:11.020 --> 53:12.600\n Because it stays up there.\n\n53:12.600 --> 53:19.140\n So I think just last week, China announced that they're going to try to level off their\n\n53:19.140 --> 53:23.380\n CO2 emissions in like 2030.\n\n53:23.380 --> 53:30.500\n So 2031, they'll only put as much CO2 into the atmosphere as they did in 2030, which\n\n53:30.500 --> 53:36.820\n is still a lot of CO2 in 2060, they're saying will be net zero.\n\n53:36.820 --> 53:42.780\n So if everyone in the world does that and the PPM of CO2 in the atmosphere by then is\n\n53:42.780 --> 53:51.860\n say 450 parts per million, it'll stay at 450 parts per million until we take it out.\n\n53:51.860 --> 53:54.820\n And taking it out is hard.\n\n53:54.820 --> 53:58.340\n It's a big, it took us a long time.\n\n53:58.340 --> 54:04.260\n We had to empty out huge coal mines and oil reservoirs and burn all that stuff.\n\n54:04.260 --> 54:11.380\n We had to chop down forests and dig up peat bogs in order to create all of that CO2.\n\n54:11.380 --> 54:19.660\n And so we have to reverse all of those processes somehow in order to remove the CO2 and get\n\n54:19.660 --> 54:26.420\n it back down, hopefully into the 200 and some parts per million range where it used to be.\n\n54:26.420 --> 54:32.320\n So how about you get a single Texas billionaire to have a massive gun that blasts huge quantities\n\n54:32.320 --> 54:35.660\n of sulfur into the upper atmosphere.\n\n54:35.660 --> 54:38.320\n That's idea number one.\n\n54:38.320 --> 54:40.700\n This is called solar geoengineering.\n\n54:40.700 --> 54:46.540\n And it's a, we know that it's a possibility on a technical level because volcanoes have\n\n54:46.540 --> 54:49.060\n been doing it forever.\n\n54:49.060 --> 54:55.240\n So many times in human history, we've seen a volcanic eruption that was followed by a\n\n54:55.240 --> 54:59.120\n global cooling trend that lasted for a couple of years.\n\n54:59.120 --> 55:06.420\n And one of these things happened I think in the 60s or 70s in Indonesia and the Australians\n\n55:06.420 --> 55:11.780\n sent a plane up into the stratosphere to take some samples of the plume.\n\n55:11.780 --> 55:17.700\n And when it came back down, the windscreen of the plane had sort of a deposit on it.\n\n55:17.700 --> 55:26.260\n So one of the Australian scientists licked it and reported that it was painfully acid.\n\n55:26.260 --> 55:31.940\n So that was our first kind of clue that what was being injected into the stratosphere was\n\n55:31.940 --> 55:37.260\n sulfur dioxide.\n\n55:37.260 --> 55:43.140\n And so we know then Pinatubo came along in the 90s and did this experiment for us.\n\n55:43.140 --> 55:50.580\n So we know that sulfur in the stratosphere, it forms little spherical droplets of sulfuric\n\n55:50.580 --> 55:58.100\n acid after it combines with water and those bounce back some of the sun's rays and reduce\n\n55:58.100 --> 56:05.940\n the amount of solar energy entering the troposphere, which is where we live.\n\n56:05.940 --> 56:10.820\n So we know that it works and we also know that the stuff goes away after a couple of\n\n56:10.820 --> 56:12.380\n years.\n\n56:12.380 --> 56:14.300\n So it gradually washes out.\n\n56:14.300 --> 56:16.500\n And so it's not a permanent thing.\n\n56:16.500 --> 56:22.620\n The good news, bad news is it's not permanent.\n\n56:22.620 --> 56:28.220\n So if you don't like what's happening, you can just stop and wait a couple of years and\n\n56:28.220 --> 56:31.260\n you'll get back to where you started.\n\n56:31.260 --> 56:35.180\n The bad news if you're in favor of this kind of thing is that you have to keep doing it\n\n56:35.180 --> 56:39.960\n forever.\n\n56:39.960 --> 56:46.460\n So this guy is one of those, he's read these papers, the TR, the character in the book.\n\n56:46.460 --> 56:54.020\n He knows all this and all people who are familiar with climate science kind of know this.\n\n56:54.020 --> 56:57.100\n It's a pretty well established fact.\n\n56:57.100 --> 57:05.780\n And so he just decides he's going to take action unilaterally and do this.\n\n57:05.780 --> 57:11.220\n And so there's different ways to get the sulfur up there, but because it's Texas, he builds\n\n57:11.220 --> 57:13.460\n the biggest gun in the world.\n\n57:13.460 --> 57:18.900\n It's just six barrels pointed straight up and he begins firing shells loaded with sulfur\n\n57:18.900 --> 57:20.420\n into the stratosphere.\n\n57:20.420 --> 57:26.780\n And so the book is about not so much that as how people react to his doing that, what\n\n57:26.780 --> 57:34.020\n the political ramifications are around the world because this is an extremely controversial\n\n57:34.020 --> 57:37.820\n idea and not everyone's on board with it.\n\n57:37.820 --> 57:45.460\n And even if you are willing to consider using a technological intervention, the fact is\n\n57:45.460 --> 57:49.420\n that it's going to have different effects on different parts of the world.\n\n57:49.420 --> 57:59.060\n So some areas may suffer more negatives than positives and they're not going to be happy.\n\n57:59.060 --> 58:07.820\n So what do you think, so in his case, in TR's case, he can get around getting permission\n\n58:07.820 --> 58:10.940\n from governments.\n\n58:10.940 --> 58:19.340\n If we were to look at us facing outside of the story, us facing climate change, where\n\n58:19.340 --> 58:21.020\n do you think the solution will come from?\n\n58:21.020 --> 58:28.980\n Governments working together or from bold billionaire Texans?\n\n58:28.980 --> 58:38.420\n I'm pretty sure that this kind of intervention is never going to emerge from Western democracies.\n\n58:38.420 --> 58:42.940\n This kind of, sorry, government coordinated, which option one?\n\n58:42.940 --> 58:43.940\n Solar geoengineering.\n\n58:43.940 --> 58:44.940\n Solar geoengineering.\n\n58:44.940 --> 58:45.940\n Yeah.\n\n58:45.940 --> 58:51.740\n From a government, from a, like those are, I want to sort of the distinction, one is\n\n58:51.740 --> 58:57.460\n the idea, the technological idea you're talking about, but two is like who comes up with the\n\n58:57.460 --> 59:00.740\n idea and agrees on it, governments or individuals.\n\n59:00.740 --> 59:01.740\n Yeah.\n\n59:01.740 --> 59:07.220\n If this were to happen, I think it would be either an individual or more likely just some\n\n59:07.220 --> 59:15.700\n government somewhere that just decides it's in their interests to unilaterally do this.\n\n59:15.700 --> 59:24.240\n And you know, that's not me advocating it, it's just, it would be comparatively so cheap\n\n59:24.240 --> 59:31.660\n and easy to implement a solar geoengineering scheme that someone is probably going to do\n\n59:31.660 --> 59:34.740\n it once things get bad enough.\n\n59:34.740 --> 59:39.980\n But I don't think that governments will, or Western governments, just because they're\n\n59:39.980 --> 59:45.500\n not, well, we've seen what happened with vaccines, right?\n\n59:45.500 --> 59:54.060\n So getting people to take vaccinations or wear masks, you know, has turned out to be\n\n59:54.060 --> 59:59.500\n incredibly hard, even though it might save those people's lives.\n\n59:59.500 --> 1:00:07.140\n See, I blame, that's not Western, that's, I blame failure of leadership there, of leaders\n\n1:00:07.140 --> 1:00:13.180\n being not coming off as authentic, not being inspiring, uniting, all those kinds of things.\n\n1:00:13.180 --> 1:00:14.180\n I think that's possible.\n\n1:00:14.180 --> 1:00:20.220\n I think it's just that we've gotten, the leaders we have right now aren't the right people\n\n1:00:20.220 --> 1:00:24.860\n because we've lived through kind of a long stretch of relatively comfortable times.\n\n1:00:24.860 --> 1:00:31.020\n And it feels like unfortunate if you just look at history, that hard times made great\n\n1:00:31.020 --> 1:00:40.060\n leaders and easy times make like bureaucrats that are egotistical and greedy and not very\n\n1:00:40.060 --> 1:00:41.700\n interesting and not very bold.\n\n1:00:41.700 --> 1:00:42.700\n Yeah.\n\n1:00:42.700 --> 1:00:43.700\n No, I think that's fair.\n\n1:00:43.700 --> 1:00:48.820\n So, you know, we may be entering one of those interesting times, you know, in the Chinese\n\n1:00:48.820 --> 1:00:53.380\n curse sense, yeah.\n\n1:00:53.380 --> 1:01:00.620\n So I could be wrong, but I mean, there've been some efforts to explore solar geoengineering.\n\n1:01:00.620 --> 1:01:08.780\n There was a plan to send up some balloons, high altitude balloons to take some measurements\n\n1:01:08.780 --> 1:01:17.620\n in Scandinavia that got squashed by objections from people who lived up there who were just\n\n1:01:17.620 --> 1:01:22.500\n opposed to the whole program on principle.\n\n1:01:22.500 --> 1:01:24.860\n So we'll see a lot more of that.\n\n1:01:24.860 --> 1:01:31.380\n And it's going to be a hard program to advocate for just because I think people don't quite\n\n1:01:31.380 --> 1:01:40.020\n understand how much carbon dioxide is in the atmosphere and how far we are from even slowing\n\n1:01:40.020 --> 1:01:48.180\n down the rate that we're adding more to say nothing of bringing that number down.\n\n1:01:48.180 --> 1:01:50.580\n We're a long way out from that.\n\n1:01:50.580 --> 1:01:55.740\n Do you see in terms of portfolio of solutions, us becoming a multi planetary species as part\n\n1:01:55.740 --> 1:01:57.340\n of that?\n\n1:01:57.340 --> 1:02:05.820\n Is this also being a motivator for investing some percent of GDP into becoming a multi\n\n1:02:05.820 --> 1:02:06.820\n planetary species?\n\n1:02:06.820 --> 1:02:09.300\n And what percent should that be, you think?\n\n1:02:09.300 --> 1:02:11.500\n You know, in an indirect way, maybe.\n\n1:02:11.500 --> 1:02:16.940\n I mean, you know what people will say, which is the same argument that has been leveled\n\n1:02:16.940 --> 1:02:22.620\n against space exploration since the Apollo program, which is why don't we solve our problems\n\n1:02:22.620 --> 1:02:27.800\n here on Earth before we spend money going into space.\n\n1:02:27.800 --> 1:02:32.220\n So I've never been a believer in that argument.\n\n1:02:32.220 --> 1:02:42.900\n I think there could be a sense in which the new perspective that could be obtained by\n\n1:02:42.900 --> 1:02:49.100\n thinking about like if we're thinking about terraforming Mars, changing its atmosphere,\n\n1:02:49.100 --> 1:02:55.060\n making it more amenable to life and survival.\n\n1:02:55.060 --> 1:03:00.940\n You could see that maybe changing people's opinions about terraforming the Earth.\n\n1:03:00.940 --> 1:03:12.540\n There are some dangerous consequences to this particular idea of blasting software of geoengineering.\n\n1:03:12.540 --> 1:03:18.780\n What do you make of sort of big, bold ideas that are a double edged sword?\n\n1:03:18.780 --> 1:03:29.060\n Are all ideas like this, all big ideas like this, they have the potential to have highly\n\n1:03:29.060 --> 1:03:34.180\n beneficial consequences and a potential to have highly destructive consequences?\n\n1:03:34.180 --> 1:03:35.340\n I wouldn't say all.\n\n1:03:35.340 --> 1:03:41.460\n I think, you know, going back to what we were talking about earlier, how technology developed\n\n1:03:41.460 --> 1:03:48.240\n in the 50s and 60s, there was a period of time there when people maybe had unrealistic\n\n1:03:48.240 --> 1:03:57.420\n ideas about new technology and weren't sufficiently attentive to the possible downsides.\n\n1:03:57.420 --> 1:04:08.540\n So we got, and there's a reason why, I mean, in the mid 20th century, we saw antibiotics,\n\n1:04:08.540 --> 1:04:18.340\n we saw the polio vaccine, we saw just simple things like refrigerators in the home.\n\n1:04:18.340 --> 1:04:23.780\n My grandmother to her dying day called the refrigerator the ice box because when she\n\n1:04:23.780 --> 1:04:26.940\n grew up, it was a box with ice in it.\n\n1:04:26.940 --> 1:04:31.420\n So you see all that change and it's largely for the benefit of people.\n\n1:04:31.420 --> 1:04:37.820\n And so if somebody comes along and says, hey, we're going to build nuclear reactors to make\n\n1:04:37.820 --> 1:04:48.140\n energy or here's a new chemical called DDT that's going to kill mosquitoes, then it's\n\n1:04:48.140 --> 1:04:55.580\n easy to just buy into that and not be alert to the possible downsides.\n\n1:04:55.580 --> 1:05:02.620\n And of course, we know that the way that those early reactors were built and the way that\n\n1:05:02.620 --> 1:05:13.180\n the supply chain was built to create the fuel and deal with the waste was poorly thought\n\n1:05:13.180 --> 1:05:22.280\n out and we're still dealing with the resulting problems at places like Hanford in the state\n\n1:05:22.280 --> 1:05:23.340\n of Washington.\n\n1:05:23.340 --> 1:05:30.220\n And we know that DDT, although it did kill a lot of insects, also had terrible effects\n\n1:05:30.220 --> 1:05:32.980\n on bird populations.\n\n1:05:32.980 --> 1:05:40.460\n So the kind of backlash that happened in the 70s that is still kind of going on is to sort\n\n1:05:40.460 --> 1:05:49.900\n of assume that everything is a double edged sword and always to look for, we have to absolutely\n\n1:05:49.900 --> 1:05:57.940\n convince ourselves that the downside isn't going to come back and bite us before we can\n\n1:05:57.940 --> 1:06:00.700\n adopt any new technology.\n\n1:06:00.700 --> 1:06:09.380\n And I think the people are overly sensitized to that now.\n\n1:06:09.380 --> 1:06:16.820\n Yeah, it's funny, depending on the technology, people are a little bit too terrified of certain\n\n1:06:16.820 --> 1:06:20.380\n technologies, like artificial intelligence is one.\n\n1:06:20.380 --> 1:06:27.580\n My sense is that the things that they're afraid of aren't the things that are likely going\n\n1:06:27.580 --> 1:06:30.300\n to happen in terms of negative things.\n\n1:06:30.300 --> 1:06:36.100\n It's probably impossible to predict exactly the unintended negative consequences.\n\n1:06:36.100 --> 1:06:42.540\n But what's also interesting is for AI as an example, people don't think enough about the\n\n1:06:42.540 --> 1:06:43.540\n positive things.\n\n1:06:43.540 --> 1:06:45.540\n I mean, the same is true with social media.\n\n1:06:45.540 --> 1:06:50.220\n It's very popular now, for some reason, to talk about all the negative effects of social\n\n1:06:50.220 --> 1:06:51.220\n media.\n\n1:06:51.220 --> 1:06:59.820\n We've immediately forgotten how incredible it is to connect across the world.\n\n1:06:59.820 --> 1:07:04.300\n There's a deep loneliness within all of us, we long to connect and social media, at least\n\n1:07:04.300 --> 1:07:08.940\n in part, enables that even in its current state.\n\n1:07:08.940 --> 1:07:15.240\n And all the negative things we see with social media currently are also in part just revealing\n\n1:07:15.240 --> 1:07:16.620\n the basics of human nature.\n\n1:07:16.620 --> 1:07:20.180\n It didn't make us worse, it's just bringing it to the surface.\n\n1:07:20.180 --> 1:07:23.220\n And step one of solving a problem is bringing it to the surface.\n\n1:07:23.220 --> 1:07:31.300\n The fact that there's a division, the fact that we're easily angered and upset and all\n\n1:07:31.300 --> 1:07:35.500\n of that, the witch hunts, all those kinds of things, that's human nature and it just\n\n1:07:35.500 --> 1:07:40.880\n reveals that allowing us to now work on it, it's therapy.\n\n1:07:40.880 --> 1:07:47.940\n And so that's another example of a technology that's just, we're not considering the positive\n\n1:07:47.940 --> 1:07:51.340\n effects now and in the future enough of.\n\n1:07:51.340 --> 1:07:56.340\n I have to ask you about, there's a million things I can ask you about, but virtual reality,\n\n1:07:56.340 --> 1:07:59.940\n I gotta ask you.\n\n1:07:59.940 --> 1:08:05.900\n You've thought about virtual reality, mixed reality quite a bit.\n\n1:08:05.900 --> 1:08:11.380\n What are the interesting trajectories you see for the proliferation of virtual reality\n\n1:08:11.380 --> 1:08:13.380\n or mixed reality in the next few years?\n\n1:08:13.380 --> 1:08:19.460\n Yeah, so I was at Magic Leap for, what, five years.\n\n1:08:19.460 --> 1:08:21.540\n With the best title of all time.\n\n1:08:21.540 --> 1:08:22.540\n Oh, thanks.\n\n1:08:22.540 --> 1:08:23.540\n Chief Futurist?\n\n1:08:23.540 --> 1:08:24.540\n Yeah.\n\n1:08:24.540 --> 1:08:25.540\n Yeah.\n\n1:08:25.540 --> 1:08:32.780\n And so I sort of had a little squad of people in Seattle doing what you might call content\n\n1:08:32.780 --> 1:08:43.180\n R&D, so we're trying to make content for AR, but because it's such a new medium, it's more\n\n1:08:43.180 --> 1:08:48.620\n of an engineering R&D project almost than a creative project.\n\n1:08:48.620 --> 1:09:00.720\n So it was fascinating to see everything that goes into making an AR system that runs.\n\n1:09:00.720 --> 1:09:09.940\n So AR, an AR device, if it's really gonna do AR, needs to be running Slam in real time.\n\n1:09:09.940 --> 1:09:11.940\n And that alone is a big...\n\n1:09:11.940 --> 1:09:18.360\n So for people who don't know, first of all, virtual reality is creating an almost fully\n\n1:09:18.360 --> 1:09:21.100\n artificial world and putting you inside it.\n\n1:09:21.100 --> 1:09:29.160\n Augmented reality, AR, is taking the real world and putting stuff on top of that real\n\n1:09:29.160 --> 1:09:33.660\n world, and when you say Slam, that means in real time, the device needs to be able to\n\n1:09:33.660 --> 1:09:41.640\n sense, accurately detect everything about that world sufficiently to be able to reconstruct\n\n1:09:41.640 --> 1:09:47.200\n the 3D structure of it so you can put stuff on top of it.\n\n1:09:47.200 --> 1:09:53.100\n And doing that in real time, presumably not just real time, but in a way that creates\n\n1:09:53.100 --> 1:10:00.900\n a pleasant experience for the human perception system is, yeah, that's an engineering project.\n\n1:10:00.900 --> 1:10:01.900\n Right.\n\n1:10:01.900 --> 1:10:07.640\n Yeah, well said, and it's just one of the things that the system has to do.\n\n1:10:07.640 --> 1:10:13.460\n It's also tracking your eyes so it knows what you're looking at, how far away what you're\n\n1:10:13.460 --> 1:10:18.760\n looking at is.\n\n1:10:18.760 --> 1:10:26.060\n It's performing all those functions, and it's got to keep doing that without burning up\n\n1:10:26.060 --> 1:10:35.640\n the CPU or depleting the battery unreasonably fast, and that's just table stakes.\n\n1:10:35.640 --> 1:10:41.340\n It's just the basic functions of the operating system, and then any content that you want\n\n1:10:41.340 --> 1:10:43.960\n to add has to sit on top of that.\n\n1:10:43.960 --> 1:10:51.160\n It's got to be rendered by the optics at a sufficiently low latency that it looks real\n\n1:10:51.160 --> 1:10:52.520\n and you don't get sick.\n\n1:10:52.520 --> 1:11:02.600\n So it's an amazing thing, and a magically shipped device that can do that in 2019.\n\n1:11:02.600 --> 1:11:08.360\n And they're about to ship the ML2, but I don't know any more about that than anyone else\n\n1:11:08.360 --> 1:11:12.600\n because I don't work there anymore.\n\n1:11:12.600 --> 1:11:19.000\n Does it still, to some degree, boil down to a killer app, a content question?\n\n1:11:19.000 --> 1:11:21.560\n Like you said, it's kind of a wide open space.\n\n1:11:21.560 --> 1:11:25.320\n Nobody knows exactly what's going to be the compelling thing.\n\n1:11:25.320 --> 1:11:33.960\n So doesn't a super compelling experience of some sort alleviate some of the need for engineering\n\n1:11:33.960 --> 1:11:34.960\n perfection?\n\n1:11:34.960 --> 1:11:41.760\n Well, there's a base layer of engineering that you have to have no matter what, but\n\n1:11:41.760 --> 1:11:47.400\n you're certainly right that people, like in the early days of video games, put up with\n\n1:11:47.400 --> 1:11:53.080\n kind of low frame rate and what we would now call crappy graphics because they were having\n\n1:11:53.080 --> 1:11:56.240\n so much fun playing Doom or whatever.\n\n1:11:56.240 --> 1:11:57.240\n Even Tetris.\n\n1:11:57.240 --> 1:11:59.720\n Yeah, yeah.\n\n1:11:59.720 --> 1:12:01.620\n So for sure that's true.\n\n1:12:01.620 --> 1:12:13.600\n And so I was working on consumer facing content, there was a great team in Wellington, New\n\n1:12:13.600 --> 1:12:26.880\n Zealand that made a game called Dr. Groydbrod's Invaders that realized the potential of AR\n\n1:12:26.880 --> 1:12:33.440\n gaming in a way that I don't think anything else has before or since.\n\n1:12:33.440 --> 1:12:43.640\n And so that was definitely the strategy until, what, April 2020, which is when the company\n\n1:12:43.640 --> 1:12:53.320\n decided to pivot to commercial industrial applications instead.\n\n1:12:53.320 --> 1:13:02.120\n And I haven't seen their financial projections, but I assume they had good reasons for making\n\n1:13:02.120 --> 1:13:05.920\n that strategic decision.\n\n1:13:05.920 --> 1:13:13.040\n It just means that it's no longer necessarily targeted at just end users who want to play\n\n1:13:13.040 --> 1:13:17.080\n a game or be entertained.\n\n1:13:17.080 --> 1:13:24.080\n That to me from a dreamer, futurist perspective is heartbreaking because I don't know necessarily\n\n1:13:24.080 --> 1:13:33.960\n from in the VR space, but I see this kind of thing with robotics where to me the future\n\n1:13:33.960 --> 1:13:42.880\n of robotics is consumer facing and a lot of great roboticists, Boston Dynamics and companies\n\n1:13:42.880 --> 1:13:50.360\n like that are focused on sort of industrial applications for financial business reasons.\n\n1:13:50.360 --> 1:13:51.360\n Yeah.\n\n1:13:51.360 --> 1:13:54.000\n Now I can see the parallels for sure.\n\n1:13:54.000 --> 1:13:55.000\n We'll see.\n\n1:13:55.000 --> 1:14:00.560\n It was a fun project.\n\n1:14:00.560 --> 1:14:06.660\n We worked on an app, for example, called Baby Goats, which just populated your room with\n\n1:14:06.660 --> 1:14:07.660\n baby goats.\n\n1:14:07.660 --> 1:14:09.520\n That seemed like a killer app right there.\n\n1:14:09.520 --> 1:14:14.680\n No, we thought highly of the idea for sure.\n\n1:14:14.680 --> 1:14:22.860\n But because of the SLAM, the system knew, for example, here's a table, here's a little\n\n1:14:22.860 --> 1:14:24.280\n end table.\n\n1:14:24.280 --> 1:14:26.280\n We know the heights.\n\n1:14:26.280 --> 1:14:33.100\n We know how high our animated baby goat can jump.\n\n1:14:33.100 --> 1:14:40.000\n So our engineers had to build a system for converting the SLAM primitives into game engine\n\n1:14:40.000 --> 1:14:49.760\n objects that the AIs in the game could navigate around.\n\n1:14:49.760 --> 1:14:56.320\n And that ended up shipping as more of a dev kit or a sort of how to a sample app than\n\n1:14:56.320 --> 1:15:00.320\n as a finished consumer facing.\n\n1:15:00.320 --> 1:15:04.280\n You mean the baby goat AI?\n\n1:15:04.280 --> 1:15:10.800\n That seems to me like a world I could entertain myself for hours, just every day coming home\n\n1:15:10.800 --> 1:15:13.800\n to see baby goats.\n\n1:15:13.800 --> 1:15:14.800\n Yeah.\n\n1:15:14.800 --> 1:15:17.680\n I mean, it was an ambient kind of...\n\n1:15:17.680 --> 1:15:21.360\n It's not a thing that you would sit there and play like a video.\n\n1:15:21.360 --> 1:15:22.360\n Just life.\n\n1:15:22.360 --> 1:15:23.360\n Yeah.\n\n1:15:23.360 --> 1:15:24.360\n Yeah.\n\n1:15:24.360 --> 1:15:25.360\n But now there's baby goats.\n\n1:15:25.360 --> 1:15:29.120\n I mean, what's the purpose of having dogs and cats in your life exactly?\n\n1:15:29.120 --> 1:15:30.840\n It's kind of ambient.\n\n1:15:30.840 --> 1:15:34.780\n They're not really helping you do anything, but it's enriching your life.\n\n1:15:34.780 --> 1:15:42.440\n You can go and play fetch or something for a while if you want, but you don't have to.\n\n1:15:42.440 --> 1:15:48.160\n So we worked on that in a bigger project that was more of a storytelling in a fictional\n\n1:15:48.160 --> 1:15:50.680\n universe.\n\n1:15:50.680 --> 1:15:52.460\n The hardware is worth a look.\n\n1:15:52.460 --> 1:15:57.680\n There's still a belief, I just saw it this morning looking at Twitter, that the Magic\n\n1:15:57.680 --> 1:16:00.680\n League never shipped anything.\n\n1:16:00.680 --> 1:16:07.840\n But they've been, since 2019, you can go to their website and buy one of these devices\n\n1:16:07.840 --> 1:16:11.120\n anytime you want to spend the money.\n\n1:16:11.120 --> 1:16:12.120\n Yeah.\n\n1:16:12.120 --> 1:16:17.800\n And the new one is coming out, I think in 2022, so in a few months.\n\n1:16:17.800 --> 1:16:24.400\n What do you think, looking out 50 years from now, what wins?\n\n1:16:24.400 --> 1:16:30.600\n Virtual reality, augmented reality, or physical reality?\n\n1:16:30.600 --> 1:16:32.240\n What wins?\n\n1:16:32.240 --> 1:16:41.640\n Meaning like, what do people that have financial resources enjoy spending most of their time\n\n1:16:41.640 --> 1:16:43.280\n in?\n\n1:16:43.280 --> 1:16:49.840\n I've always been a fan of AR and it's kind of an easy answer because if you're wearing\n\n1:16:49.840 --> 1:16:56.800\n an AR device and you put a bag over your head, it becomes a VR device.\n\n1:16:56.800 --> 1:17:03.800\n If you block out what's really there, then all you're seeing is a VR.\n\n1:17:03.800 --> 1:17:11.320\n But you are, with AR, constrained to kind of operate in something that's similar to\n\n1:17:11.320 --> 1:17:12.320\n physical reality.\n\n1:17:12.320 --> 1:17:13.320\n Yeah.\n\n1:17:13.320 --> 1:17:15.760\n With VR, you can go into fantastical worlds.\n\n1:17:15.760 --> 1:17:16.760\n True.\n\n1:17:16.760 --> 1:17:17.760\n True.\n\n1:17:17.760 --> 1:17:29.080\n But there are still issues in those fantastical worlds with motion sickness.\n\n1:17:29.080 --> 1:17:37.760\n If your body is experiencing acceleration, your inner ear, that differs from what your\n\n1:17:37.760 --> 1:17:43.440\n eye thinks it's seeing, then you'll get sick, unless you're a very unusual person.\n\n1:17:43.440 --> 1:17:51.240\n So it doesn't mean you can't do it, it's just a constraint that VR designers have to learn\n\n1:17:51.240 --> 1:17:52.240\n to work with.\n\n1:17:52.240 --> 1:17:59.520\n So do you think it's possible that in the future, we're living mostly in a virtual reality\n\n1:17:59.520 --> 1:18:00.520\n world?\n\n1:18:00.520 --> 1:18:04.580\n Like, we become more and more detached from physical reality?\n\n1:18:04.580 --> 1:18:12.400\n For entertainment, maybe, for certain applications, I'm personally more, I mean, we have to make\n\n1:18:12.400 --> 1:18:17.920\n a distinction between what I would personally find interesting and what might win in the\n\n1:18:17.920 --> 1:18:18.920\n market.\n\n1:18:18.920 --> 1:18:24.040\n So maybe some people, maybe lots of people, would like to spend a huge amount of time\n\n1:18:24.040 --> 1:18:26.680\n in VR.\n\n1:18:26.680 --> 1:18:33.880\n I'm personally more interested in enhancing the experience that I have of the physical\n\n1:18:33.880 --> 1:18:37.120\n world, because the physical world's pretty cool, right?\n\n1:18:37.120 --> 1:18:42.440\n There's a lot to be said for moving around in the real world.\n\n1:18:42.440 --> 1:18:49.400\n And I ask you for you personally, to try to play devil's advocate, or to try to construct,\n\n1:18:49.400 --> 1:19:00.700\n to imagine a VR world where you and Neal Stephenson wouldn't want to stay.\n\n1:19:00.700 --> 1:19:04.640\n Not because the physical world all of a sudden became really bad, for some reason, like you're\n\n1:19:04.640 --> 1:19:06.120\n trying to escape it.\n\n1:19:06.120 --> 1:19:10.720\n Like, literally, it's just more enriching.\n\n1:19:10.720 --> 1:19:15.600\n In the same way, like, there's a glimmer in your eye when you said you enjoy the physical\n\n1:19:15.600 --> 1:19:16.600\n world.\n\n1:19:16.600 --> 1:19:21.360\n Like, double up on that glimmer for the virtual reality.\n\n1:19:21.360 --> 1:19:23.240\n Can you imagine such a world?\n\n1:19:23.240 --> 1:19:30.940\n Well, like, I'll give maybe an example that's a bridge, which is that I like making things.\n\n1:19:30.940 --> 1:19:37.860\n So I like working in a machine shop and making objects with 3D printers or machines or whatever.\n\n1:19:37.860 --> 1:19:45.160\n And so I've had to learn how to get good at using a CAD program.\n\n1:19:45.160 --> 1:19:46.880\n There's many to choose from.\n\n1:19:46.880 --> 1:19:51.160\n I use one called Fusion 360.\n\n1:19:51.160 --> 1:20:01.540\n And I can spend hours in that trying to create, imagine and create the things I want to create.\n\n1:20:01.540 --> 1:20:11.160\n And it's not virtual reality exactly, but that whole time, my whole field of view is\n\n1:20:11.160 --> 1:20:18.080\n occupied by this monitor that's showing me a window into a three dimensional space.\n\n1:20:18.080 --> 1:20:20.400\n I'm rotating things around.\n\n1:20:20.400 --> 1:20:22.960\n I'm imagining things.\n\n1:20:22.960 --> 1:20:23.960\n I'm making things.\n\n1:20:23.960 --> 1:20:31.320\n And so that is pretty close to being in virtual reality.\n\n1:20:31.320 --> 1:20:34.640\n Does that thing have to exist for you to experience true joy?\n\n1:20:34.640 --> 1:20:38.000\n Can you stay in Fusion 360 the whole time?\n\n1:20:38.000 --> 1:20:41.560\n Do you have to 3D print it and touch it?\n\n1:20:41.560 --> 1:20:44.500\n Yeah, I mean, that's my game.\n\n1:20:44.500 --> 1:20:45.920\n That's what I'm up to.\n\n1:20:45.920 --> 1:20:54.280\n But it happens that if you're building a virtual environment, if you're making a game level\n\n1:20:54.280 --> 1:21:00.000\n or creating a virtual set for a film or TV production, the thing that you're designing\n\n1:21:00.000 --> 1:21:04.560\n in the program may never physically exist.\n\n1:21:04.560 --> 1:21:11.840\n And in fact, it's preferable that it doesn't because the whole point of that is to make\n\n1:21:11.840 --> 1:21:17.940\n imaginary things that you couldn't build otherwise.\n\n1:21:17.940 --> 1:21:22.880\n So I think lots of people spend a good chunk of their working hours in something that's\n\n1:21:22.880 --> 1:21:25.840\n pretty close to VR.\n\n1:21:25.840 --> 1:21:30.360\n It's just that currently the output device happens to be a rectangular object in front\n\n1:21:30.360 --> 1:21:31.860\n of them.\n\n1:21:31.860 --> 1:21:39.040\n You could replace that with a VR headset and they'd be doing the same stuff.\n\n1:21:39.040 --> 1:21:40.040\n There's all kinds of interfaces.\n\n1:21:40.040 --> 1:21:44.080\n For example, I enjoy listening to podcasts or audiobooks, but let's say actually podcasts\n\n1:21:44.080 --> 1:21:49.080\n because there's an intimate human connection in a podcast.\n\n1:21:49.080 --> 1:21:50.080\n It's one way.\n\n1:21:50.080 --> 1:21:54.320\n But you get to learn about the person you're listening to and that's a real connection\n\n1:21:54.320 --> 1:21:55.320\n and that's just audio.\n\n1:21:55.320 --> 1:21:58.240\n For a lot of people, that's just audio.\n\n1:21:58.240 --> 1:22:05.880\n And for me, that's just audio as a fan of people and you kind of a little bit are friends\n\n1:22:05.880 --> 1:22:06.880\n with those people.\n\n1:22:06.880 --> 1:22:11.000\n Yeah, they're in your life, you're listening to them, yeah.\n\n1:22:11.000 --> 1:22:18.600\n And I mean, they're as far away from real as it gets.\n\n1:22:18.600 --> 1:22:21.040\n There's not even a visual component.\n\n1:22:21.040 --> 1:22:22.040\n It's just audio.\n\n1:22:22.040 --> 1:22:29.320\n But they're as real, like if I was on a desert island, like my imagination, like this thing\n\n1:22:29.320 --> 1:22:33.200\n works pretty good in terms of imagination.\n\n1:22:33.200 --> 1:22:40.600\n It creates a very beautiful world with just audio.\n\n1:22:40.600 --> 1:22:42.440\n Or even just reading books.\n\n1:22:42.440 --> 1:22:45.600\n Exactly, reading books.\n\n1:22:45.600 --> 1:22:51.520\n Even more so with reading books because there are certain mediums which stimulate the imagination\n\n1:22:51.520 --> 1:22:54.560\n more.\n\n1:22:54.560 --> 1:22:59.520\n When you present less, the imagination works more and that can create really enriching\n\n1:22:59.520 --> 1:23:02.160\n experiences.\n\n1:23:02.160 --> 1:23:09.600\n To me, the question is, can you do some of the amazing things that make life amazing\n\n1:23:09.600 --> 1:23:11.280\n in virtual worlds?\n\n1:23:11.280 --> 1:23:14.720\n It seems to me the answer there is obviously yes.\n\n1:23:14.720 --> 1:23:20.280\n Even if I, like you, am attached to a lot of stuff in the physical world, I think I\n\n1:23:20.280 --> 1:23:27.120\n can very readily imagine coming up with some of the same magical experiences in the virtual\n\n1:23:27.120 --> 1:23:34.520\n world where you make friends and you can fall in love, where the source of love in your\n\n1:23:34.520 --> 1:23:43.280\n life is to a much greater degree inside of a virtual world.\n\n1:23:43.280 --> 1:23:47.280\n And then love means fulfillment, that means happiness, that's the thing you look forward\n\n1:23:47.280 --> 1:23:48.280\n to.\n\n1:23:48.280 --> 1:23:53.960\n And not some kind of dopamine rush type of love, but like long lasting like friendship.\n\n1:23:53.960 --> 1:23:54.960\n Yeah, yeah.\n\n1:23:54.960 --> 1:23:55.960\n The real deal.\n\n1:23:55.960 --> 1:23:56.960\n Yeah.\n\n1:23:56.960 --> 1:24:02.280\n The question is on what is there in the way of applications, the content, and can it feed\n\n1:24:02.280 --> 1:24:04.280\n you those things?\n\n1:24:04.280 --> 1:24:11.320\n Can it give you, like in my example of using the CAD program, it gives me the ability to\n\n1:24:11.320 --> 1:24:18.320\n do something I enjoy, which is imagining things and making things in a particular way.\n\n1:24:18.320 --> 1:24:21.040\n Can we psychoanalyze you for a second?\n\n1:24:21.040 --> 1:24:22.040\n Sure.\n\n1:24:22.040 --> 1:24:23.640\n What exactly do you enjoy?\n\n1:24:23.640 --> 1:24:29.560\n Is there some component of you building the thing where you get to at least a little bit\n\n1:24:29.560 --> 1:24:32.320\n share with others?\n\n1:24:32.320 --> 1:24:37.520\n Like is there a human in the loop outside of you in that picture?\n\n1:24:37.520 --> 1:24:39.480\n Will anyone ever see it?\n\n1:24:39.480 --> 1:24:40.480\n Right.\n\n1:24:40.480 --> 1:24:48.360\n There's a source of your enjoyment because I would argue that perhaps when like the turtles\n\n1:24:48.360 --> 1:24:52.720\n all the way down, when you get to the bottom turtle, it has to do with other sharing with\n\n1:24:52.720 --> 1:24:53.720\n other humans.\n\n1:24:53.720 --> 1:24:54.720\n Yeah.\n\n1:24:54.720 --> 1:25:01.560\n And if you can then put those humans inside the VR world, then you start to...\n\n1:25:01.560 --> 1:25:02.560\n Then you can...\n\n1:25:02.560 --> 1:25:07.800\n Okay, for example, you could do it in the physical world, the 3D printing, but you share\n\n1:25:07.800 --> 1:25:12.240\n it in the virtual world and that's where the source of happiness is.\n\n1:25:12.240 --> 1:25:18.040\n I think at least speaking for myself, I'm always thinking in terms of an audience and\n\n1:25:18.040 --> 1:25:24.760\n at some level I feel like I'm doing this for someone or communicating to someone, even\n\n1:25:24.760 --> 1:25:33.600\n if there's not a specific someone in mind, it could just be an abstract theoretical someone.\n\n1:25:33.600 --> 1:25:36.960\n And it's like another app I spend a lot of time in is Mathematica.\n\n1:25:36.960 --> 1:25:37.960\n Okay.\n\n1:25:37.960 --> 1:25:38.960\n Yeah.\n\n1:25:38.960 --> 1:25:39.960\n Incredible app.\n\n1:25:39.960 --> 1:25:40.960\n Yeah.\n\n1:25:40.960 --> 1:25:41.960\n Yeah.\n\n1:25:41.960 --> 1:25:44.320\n And when I do a Mathematica notebook, if I'm trying to figure something out, I spend a\n\n1:25:44.320 --> 1:25:51.520\n lot of time typing, just my stuff is just huge blocks of text, just me thinking out\n\n1:25:51.520 --> 1:25:57.280\n loud and then some graphs and calculations and stuff.\n\n1:25:57.280 --> 1:26:06.520\n Because to me, that act of explaining things and commenting helps me understand what I'm\n\n1:26:06.520 --> 1:26:07.520\n doing.\n\n1:26:07.520 --> 1:26:12.080\n And there's kind of an audience, amorphous audience in mind.\n\n1:26:12.080 --> 1:26:13.080\n Yeah.\n\n1:26:13.080 --> 1:26:18.600\n I mean, most of this stuff nobody will ever see and yet I'm creating it as if there were\n\n1:26:18.600 --> 1:26:27.920\n an audience that might read this stuff because that's a necessary constraint that helps me\n\n1:26:27.920 --> 1:26:29.920\n do a better job.\n\n1:26:29.920 --> 1:26:36.280\n What's the, this might be a tricky question to answer, what comes to mind as a particularly\n\n1:26:36.280 --> 1:26:40.760\n beautiful thing that you're proud of that you created inside Mathematica visualization\n\n1:26:40.760 --> 1:26:47.280\n wise or something that just comes to memory if it's possible to retrieve?\n\n1:26:47.280 --> 1:26:58.080\n So the thing I've spent the most amount of time on is I got obsessed a long time ago,\n\n1:26:58.080 --> 1:27:01.680\n was trying to tile the globe with hexagons.\n\n1:27:01.680 --> 1:27:02.680\n Yes.\n\n1:27:02.680 --> 1:27:03.680\n And.\n\n1:27:03.680 --> 1:27:05.480\n An actual globe?\n\n1:27:05.480 --> 1:27:06.680\n Well, any spherical.\n\n1:27:06.680 --> 1:27:07.680\n Any spherical.\n\n1:27:07.680 --> 1:27:08.680\n Okay.\n\n1:27:08.680 --> 1:27:12.520\n But with an eye towards putting it on the earth.\n\n1:27:12.520 --> 1:27:15.440\n And so, and have it be recursive.\n\n1:27:15.440 --> 1:27:22.100\n So you can have hexagons within hexagons, which is hard because and probably a bad idea\n\n1:27:22.100 --> 1:27:28.360\n because you can't tile a hexagon with smaller hexagons.\n\n1:27:28.360 --> 1:27:30.800\n They don't, they stick out.\n\n1:27:30.800 --> 1:27:31.800\n Got it.\n\n1:27:31.800 --> 1:27:33.520\n So they're, oh, they stick out.\n\n1:27:33.520 --> 1:27:37.880\n So there's a, can you do some kind of fractal hexagon situation?\n\n1:27:37.880 --> 1:27:38.880\n Yeah.\n\n1:27:38.880 --> 1:27:39.880\n Yeah.\n\n1:27:39.880 --> 1:27:47.200\n So it's that and people who know me are always, now make fun of me for this.\n\n1:27:47.200 --> 1:27:52.520\n So they'll send me, if they see a picture with hexagons in it, they'll like send me\n\n1:27:52.520 --> 1:27:56.620\n a link to make fun of me.\n\n1:27:56.620 --> 1:27:57.620\n So as some.\n\n1:27:57.620 --> 1:28:00.280\n One of those people, Roger Penrose or.\n\n1:28:00.280 --> 1:28:03.760\n I think Roger's a little above my level.\n\n1:28:03.760 --> 1:28:08.640\n He's into hexagons as well and tiling.\n\n1:28:08.640 --> 1:28:09.640\n Yeah.\n\n1:28:09.640 --> 1:28:10.640\n Yeah.\n\n1:28:10.640 --> 1:28:15.760\n So I did a lot of that and I thought, you know, it was pretty cool, but there's some\n\n1:28:15.760 --> 1:28:19.960\n like surprisingly intractable problems that keep coming up.\n\n1:28:19.960 --> 1:28:25.960\n Like you've always got to have some pentagons.\n\n1:28:25.960 --> 1:28:31.880\n Like if you start with the icosahedron, which is equilateral triangles, which is a logical\n\n1:28:31.880 --> 1:28:42.120\n place to start, you can cover those with hexagons, but every vertex where the triangles come\n\n1:28:42.120 --> 1:28:44.800\n together is a pentagon.\n\n1:28:44.800 --> 1:28:45.800\n Has to be a pentagon.\n\n1:28:45.800 --> 1:28:46.800\n Oh, interesting.\n\n1:28:46.800 --> 1:28:49.720\n So it's all hexagons and then there's a pentagon at the intersections.\n\n1:28:49.720 --> 1:28:50.720\n Yeah.\n\n1:28:50.720 --> 1:28:51.720\n Yeah.\n\n1:28:51.720 --> 1:28:52.720\n Cool.\n\n1:28:52.720 --> 1:28:53.720\n How'd you figure that out?\n\n1:28:53.720 --> 1:28:54.720\n Is that a known fact?\n\n1:28:54.720 --> 1:28:55.720\n Well, it's just, if you look at a.\n\n1:28:55.720 --> 1:28:56.720\n Yeah.\n\n1:28:56.720 --> 1:28:57.720\n Like just by inspection.\n\n1:28:57.720 --> 1:28:58.720\n It's an obvious thing.\n\n1:28:58.720 --> 1:28:59.720\n Got it.\n\n1:28:59.720 --> 1:29:00.720\n Yeah.\n\n1:29:00.720 --> 1:29:08.360\n So any system that you come up with to do this has got to have this exceptions built\n\n1:29:08.360 --> 1:29:10.600\n into it for those 12.\n\n1:29:10.600 --> 1:29:20.480\n You could have quintillions of hexagons, but you've still got to have 12 pentagons somewhere.\n\n1:29:20.480 --> 1:29:26.920\n So I've blown a hell of a lot of time on that over the years.\n\n1:29:26.920 --> 1:29:33.040\n By the way, a lot of those kind of problems are very difficult to prove something about.\n\n1:29:33.040 --> 1:29:34.040\n Yeah.\n\n1:29:34.040 --> 1:29:35.040\n Yeah.\n\n1:29:35.040 --> 1:29:36.040\n Yeah.\n\n1:29:36.040 --> 1:29:44.960\n I think Uber did it because someone, one of my friends who knows of my interest in this\n\n1:29:44.960 --> 1:29:49.960\n and who likes to give me a hard time sent me a link.\n\n1:29:49.960 --> 1:29:56.840\n This is a couple of years ago to some code base that I think came out of Uber where they\n\n1:29:56.840 --> 1:29:59.400\n had done this.\n\n1:29:59.400 --> 1:30:04.480\n You break down the whole surface of the earth into little hexagons.\n\n1:30:04.480 --> 1:30:09.240\n So that was a real knife through the heart.\n\n1:30:09.240 --> 1:30:14.220\n But I'll probably come back to it someday.\n\n1:30:14.220 --> 1:30:19.280\n Is there something special about hexagons or are you interested in all kinds of tiling?\n\n1:30:19.280 --> 1:30:29.160\n Well, I'm interested in all kinds of tiling, but I know my limitations as a math guy.\n\n1:30:29.160 --> 1:30:34.600\n So hexagons are about my speed.\n\n1:30:34.600 --> 1:30:36.760\n Just sufficient amount of complexity.\n\n1:30:36.760 --> 1:30:37.760\n Yeah.\n\n1:30:37.760 --> 1:30:38.760\n Yeah.\n\n1:30:38.760 --> 1:30:41.960\n But no, tiling is a really interesting problem.\n\n1:30:41.960 --> 1:30:48.160\n Both two and three dimensional tiling problems are fascinating and they're one of those ancient\n\n1:30:48.160 --> 1:30:59.000\n puzzles that has attracted brainiacs for centuries.\n\n1:30:59.000 --> 1:31:03.120\n Let me ask you a little bit about AI.\n\n1:31:03.120 --> 1:31:10.640\n What are some likely interesting trajectories for the proliferation of AI in society over\n\n1:31:10.640 --> 1:31:11.640\n the next couple of decades?\n\n1:31:11.640 --> 1:31:14.080\n Do you think about this kind of stuff?\n\n1:31:14.080 --> 1:31:20.380\n I do not think about it a lot because it's a deep topic and I don't consider myself super\n\n1:31:20.380 --> 1:31:22.760\n well informed about it.\n\n1:31:22.760 --> 1:31:28.880\n And AI seems to be a term that is applied to a lot of different things.\n\n1:31:28.880 --> 1:31:36.440\n So I've messed around just a tiny little bit with neural nets, with what's it called PCA,\n\n1:31:36.440 --> 1:31:38.420\n principal component analysis.\n\n1:31:38.420 --> 1:31:48.520\n So I guess I tend to think in terms of some granular bottom up ideas rather than big picture\n\n1:31:48.520 --> 1:31:49.520\n top down.\n\n1:31:49.520 --> 1:31:50.520\n Oh God.\n\n1:31:50.520 --> 1:31:55.800\n So like very specific algorithms, like how are they going to, what problem are they going\n\n1:31:55.800 --> 1:32:01.080\n to solve in society such that it has like a lot of big ripple effects.\n\n1:32:01.080 --> 1:32:08.120\n I mean, we could talk a particular successful AI systems and success defined in different\n\n1:32:08.120 --> 1:32:09.880\n ways of recent years.\n\n1:32:09.880 --> 1:32:15.320\n So one is language models with GPT3.\n\n1:32:15.320 --> 1:32:19.840\n Most importantly, they're self supervised, meaning they don't require much supervision\n\n1:32:19.840 --> 1:32:25.960\n from humans, which means they can learn by just reading a huge amount of content created\n\n1:32:25.960 --> 1:32:26.960\n by humans.\n\n1:32:26.960 --> 1:32:30.400\n So read the internet and from that be able to generate text and do all kinds of things\n\n1:32:30.400 --> 1:32:31.840\n like that.\n\n1:32:31.840 --> 1:32:34.120\n It's possible they have a big enough neural network.\n\n1:32:34.120 --> 1:32:41.760\n It's going to be able to have conversations with humans based on just reading human language.\n\n1:32:41.760 --> 1:32:42.760\n That's an interesting idea.\n\n1:32:42.760 --> 1:32:49.520\n To me, the very interesting idea that people don't think about it as AI because they're\n\n1:32:49.520 --> 1:32:53.640\n kind of dumb currently is actual embodied robots.\n\n1:32:53.640 --> 1:33:01.920\n So robotics like Boston Dynamics have downstairs and upstairs legged robots.\n\n1:33:01.920 --> 1:33:08.700\n You know, the currently Boston Dynamics robots and most legged robots, most robots period\n\n1:33:08.700 --> 1:33:11.800\n are pretty dumb.\n\n1:33:11.800 --> 1:33:15.920\n Most of the challenges have to do with the actual, first of all, the engineering of making\n\n1:33:15.920 --> 1:33:20.760\n the thing work, getting a sensor suite that allows you to do the same thing as with Magic\n\n1:33:20.760 --> 1:33:21.760\n Leap.\n\n1:33:21.760 --> 1:33:29.360\n It's like a layer of like, where am I and what am I looking at?\n\n1:33:29.360 --> 1:33:39.920\n I don't need to deeply understand my surroundings at a level beyond of what will hurt if I run\n\n1:33:39.920 --> 1:33:40.920\n into it.\n\n1:33:40.920 --> 1:33:41.920\n Yeah, yeah.\n\n1:33:41.920 --> 1:33:43.640\n But even that is hard.\n\n1:33:43.640 --> 1:33:44.640\n That's hard.\n\n1:33:44.640 --> 1:33:51.920\n But the thing that I think people don't in the robotics space explore enough is the human\n\n1:33:51.920 --> 1:34:00.560\n robot interaction part of the picture, which is how it makes humans feel, how robots make\n\n1:34:00.560 --> 1:34:01.560\n humans feel.\n\n1:34:01.560 --> 1:34:08.720\n And I think that's going to have a very significant impact in the near future in society, which\n\n1:34:08.720 --> 1:34:17.480\n is the more you integrate AI systems of whatever form into society where humans are in contact\n\n1:34:17.480 --> 1:34:19.640\n with them regularly.\n\n1:34:19.640 --> 1:34:23.640\n So that could be embodied robotics or that could be social media algorithms.\n\n1:34:23.640 --> 1:34:26.160\n I think that has a very significant impact.\n\n1:34:26.160 --> 1:34:31.200\n And people often think like AI needs to be super smart to have an impact.\n\n1:34:31.200 --> 1:34:37.200\n I think it needs to be super integrated with society to have an impact and more and more\n\n1:34:37.200 --> 1:34:40.480\n that's happening, even if they're dumb.\n\n1:34:40.480 --> 1:34:41.480\n Yeah.\n\n1:34:41.480 --> 1:34:42.480\n Yeah.\n\n1:34:42.480 --> 1:34:52.600\n No, I mean, a lot of my exposure to robots is that I'm associated with a combat robotics\n\n1:34:52.600 --> 1:34:53.600\n team.\n\n1:34:53.600 --> 1:34:55.960\n And I've been to a few battle bots competitions.\n\n1:34:55.960 --> 1:35:01.760\n And that's not like a lot of ways that's pretty far from the kind of robotics you're talking\n\n1:35:01.760 --> 1:35:06.200\n about because these robots are remote controlled.\n\n1:35:06.200 --> 1:35:08.500\n They're not autonomous.\n\n1:35:08.500 --> 1:35:17.160\n And so they're pretty simple, but it's interesting to watch people's emotional reactions to different\n\n1:35:17.160 --> 1:35:18.160\n robots.\n\n1:35:18.160 --> 1:35:26.840\n So there was one that was in the last year's season, the 2020 season called Rusty that\n\n1:35:26.840 --> 1:35:32.920\n was just like put together out of spare parts and it looked kind of cute and it became this\n\n1:35:32.920 --> 1:35:39.080\n huge crowd favorite because you could see it was made of like salad bowls and random\n\n1:35:39.080 --> 1:35:43.360\n pieces of hardware that this guy had like scavenged from his farm.\n\n1:35:43.360 --> 1:35:49.560\n And so immediately people kind of fell in love with this one particular robot.\n\n1:35:49.560 --> 1:35:57.520\n Whereas other robots might be like the bad guy, if you think of professional wrestling,\n\n1:35:57.520 --> 1:36:00.960\n the heel and the baby face.\n\n1:36:00.960 --> 1:36:06.080\n So people do, for reasons that are hard to understand, form these emotional reactions.\n\n1:36:06.080 --> 1:36:10.860\n And we form narratives in the same way we do when we meet human beings, we tell stories\n\n1:36:10.860 --> 1:36:16.920\n about these objects and they can be intelligent and they can be biological or they can be\n\n1:36:16.920 --> 1:36:19.760\n almost close to inanimate objects.\n\n1:36:19.760 --> 1:36:21.680\n That to me is kind of fascinating.\n\n1:36:21.680 --> 1:36:29.760\n And if robots choose to lean into that, it creates an interesting world.\n\n1:36:29.760 --> 1:36:34.760\n If they start using feedback loops to make themselves cuter.\n\n1:36:34.760 --> 1:36:41.040\n Not just cuter, but everything that humans do, let's not speak harshly of robots, humans\n\n1:36:41.040 --> 1:36:42.040\n do the same thing.\n\n1:36:42.040 --> 1:36:48.260\n Oh no, I wasn't meaning it in a, but you're right, humans based on feedback will change\n\n1:36:48.260 --> 1:36:49.260\n their appearance.\n\n1:36:49.260 --> 1:36:52.360\n Yes, I do this on Instagram all the time, how do I look cuter?\n\n1:36:52.360 --> 1:36:54.880\n That's the fundamental question I ask myself.\n\n1:36:54.880 --> 1:37:02.100\n So why wouldn't a robot wanna, it's like oh wow, people really don't like the quad mount\n\n1:37:02.100 --> 1:37:08.640\n machine gun on top of my turret, maybe I should get rid of that and people would feel more\n\n1:37:08.640 --> 1:37:10.680\n at ease.\n\n1:37:10.680 --> 1:37:13.680\n Or lean into it, be proud of it.\n\n1:37:13.680 --> 1:37:20.440\n Like you won't take my gun, whatever the saying is, from my dead cold hands.\n\n1:37:20.440 --> 1:37:26.280\n I mean their personality, adding personality such that you can start to heal, you can start\n\n1:37:26.280 --> 1:37:27.840\n to weave narratives.\n\n1:37:27.840 --> 1:37:41.320\n I think that's a fascinating place where there's this feedback loop, like you said, where AI,\n\n1:37:41.320 --> 1:37:46.000\n especially when it's embodied, puts a mirror to ourselves.\n\n1:37:46.000 --> 1:37:52.840\n Just like other humans, our close friends, they kind of teach us about ourselves.\n\n1:37:52.840 --> 1:37:57.360\n We teach each other and through that process grow close.\n\n1:37:57.360 --> 1:38:06.200\n And to me it's so fascinating to expand the space of deep meaningful interactions beyond\n\n1:38:06.200 --> 1:38:10.480\n just humans.\n\n1:38:10.480 --> 1:38:18.080\n That's the opportunity I see with robots and with AI systems and that's why I don't like,\n\n1:38:18.080 --> 1:38:22.280\n my biggest problem with social media algorithms is the lack of transparency.\n\n1:38:22.280 --> 1:38:27.920\n It's not the existence of the algorithms, it's, well there's many things.\n\n1:38:27.920 --> 1:38:28.920\n One is the data.\n\n1:38:28.920 --> 1:38:33.280\n Data should be controlled by people themselves.\n\n1:38:33.280 --> 1:38:36.320\n But also the lack of transparency in how the algorithms work.\n\n1:38:36.320 --> 1:38:41.640\n You change your perception of what's real in hidden ways.\n\n1:38:41.640 --> 1:38:42.640\n In hidden ways.\n\n1:38:42.640 --> 1:38:43.640\n Yeah.\n\n1:38:43.640 --> 1:38:47.680\n Like you should be aware, just like when you take, I don't know, if you take psychedelics,\n\n1:38:47.680 --> 1:38:52.040\n you should be aware that you took the psychedelics, it shouldn't be a surprise.\n\n1:38:52.040 --> 1:38:59.440\n And second, you should become a student and a scholar and there should be research done,\n\n1:38:59.440 --> 1:39:05.920\n there should be open conversation about how your perception has changed and then you become\n\n1:39:05.920 --> 1:39:13.360\n your own guide in this world of altered perception because arguably none of it is real.\n\n1:39:13.360 --> 1:39:16.560\n You get to choose the flavor of real.\n\n1:39:16.560 --> 1:39:22.720\n I mean, this is something you explore quite a bit.\n\n1:39:22.720 --> 1:39:31.580\n Do you yourself think that there is a bottom to it where there is reality, there's a base\n\n1:39:31.580 --> 1:39:39.840\n layer of reality that physics can explore and our human perception sort of layer stuff?\n\n1:39:39.840 --> 1:39:44.920\n Is there, let's go to Plato, is there such a thing as truth?\n\n1:39:44.920 --> 1:39:48.480\n I lean towards the Platonic view of things.\n\n1:39:48.480 --> 1:39:56.640\n So I believe that mathematical objects have a reality that it's not all made up by human\n\n1:39:56.640 --> 1:39:59.180\n minds.\n\n1:39:59.180 --> 1:40:03.200\n And I don't know where that reality comes from.\n\n1:40:03.200 --> 1:40:15.800\n I can't explain it, but I do think that mathematical objects are discovered and not invented.\n\n1:40:15.800 --> 1:40:25.880\n I did a lot of, not a lot, but I did some reading of Husserl when I was writing Anathem\n\n1:40:25.880 --> 1:40:34.120\n and he's a 20th century phenomenologist and he's writing in the, he's writing at the same\n\n1:40:34.120 --> 1:40:43.040\n time as scientists are starting to understand atoms and becoming aware that when we look\n\n1:40:43.040 --> 1:40:51.400\n at this table, it's really just a slab of almost entirely vacuum and there's a very\n\n1:40:51.400 --> 1:41:00.080\n sparse arrangement of tiny, tiny little particles there occupying that space that interact with\n\n1:41:00.080 --> 1:41:07.120\n each other in such a way that our brains perceive this object.\n\n1:41:07.120 --> 1:41:20.400\n So that's kind of the beginnings of phenomenology and his stuff is pretty hard to read.\n\n1:41:20.400 --> 1:41:27.800\n You really have to take it in small bites and go a little bit at a time.\n\n1:41:27.800 --> 1:41:32.800\n But he's trying to come to grips with these kinds of questions.\n\n1:41:32.800 --> 1:41:36.160\n How did you come to grips with it?\n\n1:41:36.160 --> 1:41:38.000\n Why does this table feel solid?\n\n1:41:38.000 --> 1:41:44.080\n Well, I mean, we're an evolved system that there's, we have biological advantages in\n\n1:41:44.080 --> 1:41:46.820\n knowing where solid objects are.\n\n1:41:46.820 --> 1:41:54.540\n So we've got this system in our head that integrates our perceptions into this coherent\n\n1:41:54.540 --> 1:41:59.040\n view of things.\n\n1:41:59.040 --> 1:42:06.600\n One of the take homes that I like from Husserl is the idea of intersubjectivity and the idea\n\n1:42:06.600 --> 1:42:16.000\n that the fundamental requirement for us to stay sane is for us to share our perceptions\n\n1:42:16.000 --> 1:42:23.960\n and have them ratified by other, they don't even have to be people, but a prisoner in\n\n1:42:23.960 --> 1:42:32.440\n solitary confinement might domesticate a mouse or even insects because they perceive the\n\n1:42:32.440 --> 1:42:41.040\n same things that the prisoner perceives and so convince him that he's not just hallucinating.\n\n1:42:41.040 --> 1:42:49.320\n Yeah, there's the establish a consensus, but see, that doesn't mean any of it is real.\n\n1:42:49.320 --> 1:42:52.600\n You just establish a consensus.\n\n1:42:52.600 --> 1:43:05.080\n It could be very distant from something that's real in an engineering sense of real.\n\n1:43:05.080 --> 1:43:07.840\n Like you could build it using physics.\n\n1:43:07.840 --> 1:43:16.160\n But I think that a valuable application for an AI robot would be just to do nothing except\n\n1:43:16.160 --> 1:43:17.160\n that.\n\n1:43:17.160 --> 1:43:27.000\n It just sits there and if you hear a door slam, you might turn to see what it is.\n\n1:43:27.000 --> 1:43:34.720\n If the robot at the same time turns to look at the door slam, it's ratifying your perception.\n\n1:43:34.720 --> 1:43:42.920\n But isn't that the basis of love is when the door slams, you both look, but for deeper\n\n1:43:42.920 --> 1:43:48.960\n things, you both hear the same music and others don't.\n\n1:43:48.960 --> 1:43:52.160\n I mean, isn't that what that means?\n\n1:43:52.160 --> 1:43:53.160\n Yeah.\n\n1:43:53.160 --> 1:43:55.680\n By love, I mean depth of human connection.\n\n1:43:55.680 --> 1:43:56.680\n Yeah.\n\n1:43:56.680 --> 1:44:05.360\n Yeah, you arrive at similar reactions without having to explicitly communicate it.\n\n1:44:05.360 --> 1:44:06.360\n Yeah.\n\n1:44:06.360 --> 1:44:15.360\n But we could start with a robot that listens explicitly for the slam doors or scary sounds.\n\n1:44:15.360 --> 1:44:24.920\n I can think of an example of this is when I went to college, we'd be sitting at the\n\n1:44:24.920 --> 1:44:34.040\n cafeteria, a bunch of people eating our dinner together that we had just met, let's say.\n\n1:44:34.040 --> 1:44:41.780\n So a bunch of new people in your life and someone might make a funny remark or a not\n\n1:44:41.780 --> 1:44:48.160\n so funny remark or something would happen and you might then at that moment make eye\n\n1:44:48.160 --> 1:44:54.040\n contact with someone you didn't know at the other end of the table.\n\n1:44:54.040 --> 1:44:59.560\n In that moment, you would realize this person is reacting.\n\n1:44:59.560 --> 1:45:01.720\n This person heard what I heard.\n\n1:45:01.720 --> 1:45:04.880\n They're reacting the way I reacted.\n\n1:45:04.880 --> 1:45:10.560\n Nobody else appears to get the joke or to understand what just happened, but random\n\n1:45:10.560 --> 1:45:15.600\n stranger down there and I, we have this connection and then you build on that.\n\n1:45:15.600 --> 1:45:22.120\n So then the next time something happens, you automatically look at your new friend and\n\n1:45:22.120 --> 1:45:28.520\n they look back at you and before you know it, you're hanging out together because you\n\n1:45:28.520 --> 1:45:34.400\n know you've already established without even talking to each other that you're on the same\n\n1:45:34.400 --> 1:45:35.400\n wavelength.\n\n1:45:35.400 --> 1:45:36.400\n Yeah.\n\n1:45:36.400 --> 1:45:41.160\n It's seemingly so simple, but so powerful that establishing that you're on the same\n\n1:45:41.160 --> 1:45:43.880\n wavelength at some level.\n\n1:45:43.880 --> 1:45:48.080\n There's no reason why you and a toaster can't have that.\n\n1:45:48.080 --> 1:45:49.560\n I'm just saying.\n\n1:45:49.560 --> 1:45:52.760\n Does this smell burned to you?\n\n1:45:52.760 --> 1:45:53.760\n Exactly.\n\n1:45:53.760 --> 1:45:55.720\n I think it's burnt.\n\n1:45:55.720 --> 1:45:59.000\n If a toaster could just say that to you.\n\n1:45:59.000 --> 1:46:00.000\n Yeah.\n\n1:46:00.000 --> 1:46:01.000\n Yeah.\n\n1:46:01.000 --> 1:46:07.640\n Cryptonomicon published in 1999, set in the late 90s and involves hackers who build essentially\n\n1:46:07.640 --> 1:46:08.640\n cryptocurrency.\n\n1:46:08.640 --> 1:46:14.720\n Bitcoin white paper came out in 2008.\n\n1:46:14.720 --> 1:46:23.360\n So I have to kind of ask, from you looking at this layout of what's been happening in\n\n1:46:23.360 --> 1:46:32.120\n cryptocurrency, the evolution of this technology, how has it rolled out differently than you\n\n1:46:32.120 --> 1:46:34.280\n could have imagined in two ways?\n\n1:46:34.280 --> 1:46:42.360\n One the technology itself and two the human side of things, the human stories of the hackers\n\n1:46:42.360 --> 1:46:48.800\n and the financial folks and the powerful and the powerless, the human side of things.\n\n1:46:48.800 --> 1:46:49.800\n Yeah.\n\n1:46:49.800 --> 1:46:55.720\n Well, Cryptonomicon is pre Bitcoin, it's pre Satoshi, it's pre blockchain as you point\n\n1:46:55.720 --> 1:46:56.720\n out.\n\n1:46:56.720 --> 1:47:05.200\n So at that point I was kind of reacting to what I was seeing among people like the Bay\n\n1:47:05.200 --> 1:47:07.760\n Area Cypherpunks in Berkeley.\n\n1:47:07.760 --> 1:47:17.840\n There was a branch here in Austin as well and a lot of their thinking was based on the\n\n1:47:17.840 --> 1:47:26.200\n idea that you would have to have a physical region of the earth that was free of government\n\n1:47:26.200 --> 1:47:28.720\n interference.\n\n1:47:28.720 --> 1:47:34.580\n You couldn't achieve that freedom by purely mathematical means on the network.\n\n1:47:34.580 --> 1:47:42.680\n You actually had to have a room somewhere with servers in it that a government couldn't\n\n1:47:42.680 --> 1:47:44.880\n come and meddle with.\n\n1:47:44.880 --> 1:47:50.560\n And so a lot of ideation happened around that view of things that there were efforts to\n\n1:47:50.560 --> 1:47:53.280\n figure out jurisdictions where this might work.\n\n1:47:53.280 --> 1:47:58.860\n There was a lot of interest for a while in Anguilla, which is a Caribbean island that\n\n1:47:58.860 --> 1:48:02.360\n had some unusual jurisdictional properties.\n\n1:48:02.360 --> 1:48:09.520\n There was SeaLand, which is a platform in the North Sea.\n\n1:48:09.520 --> 1:48:14.200\n And so there was a lot of effort that went into finding these physical locations that\n\n1:48:14.200 --> 1:48:17.360\n were deemed kind of safe.\n\n1:48:17.360 --> 1:48:25.780\n And that all goes away with blockchain, it's no longer necessary.\n\n1:48:25.780 --> 1:48:32.240\n And so that really changes the picture in a lot of ways because you no longer have...\n\n1:48:32.240 --> 1:48:38.080\n From a novelist point of view, the old system was a lot more fun to work with because it\n\n1:48:38.080 --> 1:48:44.240\n gives you a situation where hackers are wandering around in strange parts of the world trying\n\n1:48:44.240 --> 1:48:46.300\n to set up server rooms.\n\n1:48:46.300 --> 1:48:48.640\n So that's a great storytelling thing.\n\n1:48:48.640 --> 1:48:54.680\n There's still a little bit of that in the modern world, but it's just there's several\n\n1:48:54.680 --> 1:48:57.720\n server rooms as opposed to one centralized one.\n\n1:48:57.720 --> 1:48:58.720\n Yeah.\n\n1:48:58.720 --> 1:49:07.640\n Whereas the new wrinkle is the need to do a lot of computation and to keep your GPUs\n\n1:49:07.640 --> 1:49:08.800\n from melting down.\n\n1:49:08.800 --> 1:49:14.420\n So people building things in Iceland or in shipping containers on the bottom of the ocean\n\n1:49:14.420 --> 1:49:16.920\n or whatever.\n\n1:49:16.920 --> 1:49:17.920\n So...\n\n1:49:17.920 --> 1:49:21.520\n But there's still governments involved and there's still from a novelist perspective\n\n1:49:21.520 --> 1:49:28.600\n interesting dynamics with big governments like China and more sort of renegade governments\n\n1:49:28.600 --> 1:49:34.960\n from all over the world trying to contend with this idea of what to do in terms of control\n\n1:49:34.960 --> 1:49:41.200\n and power over these kinds of centers that do the mining of the cryptocurrency.\n\n1:49:41.200 --> 1:49:42.200\n Yeah.\n\n1:49:42.200 --> 1:49:46.440\n So we're in a stage now that kind of goes beyond the initial...\n\n1:49:46.440 --> 1:49:47.800\n Like there was...\n\n1:49:47.800 --> 1:49:54.980\n The stuff I was describing in Cryptonomicon had a little bit of air about it of the underpants\n\n1:49:54.980 --> 1:50:03.120\n gnomes in that we're gonna build this system and then we'll make money somehow.\n\n1:50:03.120 --> 1:50:08.680\n But the intermediate step was left out.\n\n1:50:08.680 --> 1:50:11.680\n And that is...\n\n1:50:11.680 --> 1:50:19.980\n I think we're now sort of into that phase of the thing where Bitcoin, blockchain exists,\n\n1:50:19.980 --> 1:50:24.960\n people know how it works, Bitcoin and other cryptocurrencies exist.\n\n1:50:24.960 --> 1:50:28.680\n People are using them and it's sort of like, okay, what now?\n\n1:50:28.680 --> 1:50:31.840\n Where does this all lead?\n\n1:50:31.840 --> 1:50:32.840\n So...\n\n1:50:32.840 --> 1:50:35.040\n Do you have a sense of where it all leads?\n\n1:50:35.040 --> 1:50:44.200\n Like is it possible that the set of technology kind of continues to have transformational\n\n1:50:44.200 --> 1:50:52.840\n effects on not just sort of finance but who gets to have power in this world?\n\n1:50:52.840 --> 1:50:55.680\n So the decentralization of power.\n\n1:50:55.680 --> 1:50:56.920\n Big questions, right?\n\n1:50:56.920 --> 1:51:03.520\n So I guess there's a little bit of the cynic in me thinking that as soon as it becomes\n\n1:51:03.520 --> 1:51:10.080\n important enough, the existing banks and people in power are gonna sort of control it.\n\n1:51:10.080 --> 1:51:16.760\n I guess an easy answer is that maybe it won't be a big change in the end.\n\n1:51:16.760 --> 1:51:23.460\n There's a utopian strain sometimes in the way people think about this that I'm not so\n\n1:51:23.460 --> 1:51:26.360\n sure about.\n\n1:51:26.360 --> 1:51:32.960\n There is a technological aspect to Bitcoin and other cryptocurrencies that make it a\n\n1:51:32.960 --> 1:51:41.680\n little easier to pull along the utopian thread because it's harder for governments to control\n\n1:51:41.680 --> 1:51:42.680\n Bitcoin.\n\n1:51:42.680 --> 1:51:48.200\n I mean, they have much fewer options.\n\n1:51:48.200 --> 1:51:50.920\n They can ban, they can make it illegal.\n\n1:51:50.920 --> 1:51:52.360\n It's more difficult.\n\n1:51:52.360 --> 1:51:57.200\n So technology here is on the side of the powerless, the voiceless, which is a very interesting\n\n1:51:57.200 --> 1:51:58.200\n idea.\n\n1:51:58.200 --> 1:52:04.320\n Of course, yes, it does have a utopian feel to it, but we have been making progress throughout\n\n1:52:04.320 --> 1:52:05.920\n human history.\n\n1:52:05.920 --> 1:52:07.400\n Maybe this is what progress looks like.\n\n1:52:07.400 --> 1:52:12.800\n There will be the powerful and the greedy and the bureaucrats that take advantage of\n\n1:52:12.800 --> 1:52:19.240\n it, skim off the top kind of thing, but maybe this does give more power to people that haven't\n\n1:52:19.240 --> 1:52:29.200\n had power before in a good way, like distributing power and enabling sort of more greater resistance\n\n1:52:29.200 --> 1:52:36.600\n to sort of dictatorships and authoritarian regimes, that kind of thing, and also enabling\n\n1:52:36.600 --> 1:52:40.400\n all kinds of technologies built on top of it.\n\n1:52:40.400 --> 1:52:49.520\n Ultimately, when you digitize money, money is a kind of speech, or it's a kind of mechanism\n\n1:52:49.520 --> 1:52:56.320\n of how humans interact, and if you make that digital, more and more of the world moves\n\n1:52:56.320 --> 1:53:04.120\n to the digital space, and then you can finally fully live in that virtual reality with the\n\n1:53:04.120 --> 1:53:05.120\n toaster.\n\n1:53:05.120 --> 1:53:11.840\n In a lot of ways, I think in that realm of technology that the money per se is one of\n\n1:53:11.840 --> 1:53:16.480\n the less interesting things you can do with it, so I think cryptographically enforceable\n\n1:53:16.480 --> 1:53:24.120\n contracts and organizations built on those, that seems to me like it's got more potential\n\n1:53:24.120 --> 1:53:33.680\n for change just because we do already have money, and although it's an old system, it's\n\n1:53:33.680 --> 1:53:42.160\n been digitized to a large extent by the stripes and the credit card companies of the world.\n\n1:53:42.160 --> 1:53:51.000\n I also love the idea of connecting two smart contracts, connecting data, sort of making\n\n1:53:51.000 --> 1:53:58.120\n it more formal, it's like Mathematica, more structured, the integration of data, of weather\n\n1:53:58.120 --> 1:54:06.960\n data, of all kinds of data about the stuff in the world, so they can make contracts between\n\n1:54:06.960 --> 1:54:14.600\n people that's grounded in data, and that's actually getting closer to something like\n\n1:54:14.600 --> 1:54:20.560\n truth, because then you can make agreements based on actual data versus kind of perceptions\n\n1:54:20.560 --> 1:54:28.080\n of data, and if you can formalize, like distribute the power of who gets to tell the story, and\n\n1:54:28.080 --> 1:54:35.000\n that's an interesting kind of resistance against the powerful in the space of narrative.\n\n1:54:35.000 --> 1:54:42.520\n Yeah, David Brin has been saying for a while that the only way to settle arguments across\n\n1:54:42.520 --> 1:54:52.720\n the political divide is to make bets, so people can say the election was stolen, or whatever\n\n1:54:52.720 --> 1:55:02.760\n controversial position they're taking, and they'll keep saying it until you wager real\n\n1:55:02.760 --> 1:55:07.240\n money on it.\n\n1:55:07.240 --> 1:55:14.040\n So maybe there's something there, if you could kind of turn that into a, put a user interface\n\n1:55:14.040 --> 1:55:15.040\n on that.\n\n1:55:15.040 --> 1:55:25.040\n Yeah, have a stake in your divisiveness, in your arguments.\n\n1:55:25.040 --> 1:55:27.160\n Will Dogecoin take over the world?\n\n1:55:27.160 --> 1:55:28.280\n Twitter question.\n\n1:55:28.280 --> 1:55:33.880\n You know, I don't follow the different coins that much, so I don't, I mean I hear about\n\n1:55:33.880 --> 1:55:37.880\n Dogecoin and I've kind of followed the story of it.\n\n1:55:37.880 --> 1:55:47.040\n So the interesting aspect of Dogecoin is it, so in contrast to like Bitcoin and Ethereum,\n\n1:55:47.040 --> 1:55:52.880\n which are these serious implementations of cryptocurrency that seek to solve some of\n\n1:55:52.880 --> 1:55:59.080\n the problems that we're talking about with smart contracts and resist the banks and all\n\n1:55:59.080 --> 1:56:06.040\n those kinds of things, Dogecoin operates more in the space of memes and humor, while still\n\n1:56:06.040 --> 1:56:09.000\n doing some of the similar things.\n\n1:56:09.000 --> 1:56:20.040\n And it presents to the world sort of a question of whether memes, whether humor, whether narrative\n\n1:56:20.040 --> 1:56:25.040\n will go a long way in the future.\n\n1:56:25.040 --> 1:56:32.600\n Like much farther than some kind of boring old grounded technologies.\n\n1:56:32.600 --> 1:56:35.440\n Whether we'll be playing in the space of fun.\n\n1:56:35.440 --> 1:56:41.880\n Like once we've built a base of comfort and stability and like a robust system where everyone\n\n1:56:41.880 --> 1:56:50.720\n has shelter, everyone has food and the basic needs covered, are we going to then operate\n\n1:56:50.720 --> 1:56:53.880\n in the space of fun?\n\n1:56:53.880 --> 1:56:55.280\n That's what I think about Dogecoin.\n\n1:56:55.280 --> 1:57:02.300\n Because it seems like fun spreads faster than anything else.\n\n1:57:02.300 --> 1:57:06.400\n Fun of different kinds, and that could be bad fun and that could be good fun.\n\n1:57:06.400 --> 1:57:09.000\n And so it's a battle of good fun versus bad fun.\n\n1:57:09.000 --> 1:57:14.200\n It goes viral very, very quickly when you, if you post something that people find fun\n\n1:57:14.200 --> 1:57:15.200\n to.\n\n1:57:15.200 --> 1:57:16.200\n Yeah.\n\n1:57:16.200 --> 1:57:17.200\n And that's what Dogecoin represents.\n\n1:57:17.200 --> 1:57:25.160\n So there's like, so Bitcoin represents like financial, like serious financial instruments\n\n1:57:25.160 --> 1:57:27.240\n and then Dogecoin represents fun.\n\n1:57:27.240 --> 1:57:33.900\n And it's interesting to watch the battle go on on the internet to see which wins.\n\n1:57:33.900 --> 1:57:39.080\n This is also like open question to me of what is the internet?\n\n1:57:39.080 --> 1:57:43.560\n Because fun seems to prevail on the internet.\n\n1:57:43.560 --> 1:57:48.000\n And is that a fundamental property of the internet moving forward when you look a hundred\n\n1:57:48.000 --> 1:57:53.640\n years out, or is this a temporary thing that was true at the birth of the internet and\n\n1:57:53.640 --> 1:57:58.720\n it's just true for a couple of decades until it fades away and the adults take over and\n\n1:57:58.720 --> 1:57:59.720\n become serious again?\n\n1:57:59.720 --> 1:58:05.440\n Well, I think the adults took over initially and then it was later on that people started\n\n1:58:05.440 --> 1:58:10.100\n using it for fun, frivolous things like memes.\n\n1:58:10.100 --> 1:58:16.800\n And that's, I think that's pretty much unstoppable, you know, because even people who are very\n\n1:58:16.800 --> 1:58:26.080\n serious, you know, enjoy sending around a funny picture or something that amuses them.\n\n1:58:26.080 --> 1:58:27.080\n Yeah.\n\n1:58:27.080 --> 1:58:30.480\n I personally think we spoke about World War II.\n\n1:58:30.480 --> 1:58:35.960\n I think memes will save the world and prevent all future wars.\n\n1:58:35.960 --> 1:58:41.060\n You've been handwriting your work for the past 20 years since writing The Baroque Cycle.\n\n1:58:41.060 --> 1:58:44.140\n What are the pros and cons of handwriting versus typing?\n\n1:58:44.140 --> 1:58:49.340\n For me, I started it as an experiment when I started The Baroque Cycle because I had\n\n1:58:49.340 --> 1:58:54.640\n noticed that sometimes if I was stuck having a hard time getting started, if I just picked\n\n1:58:54.640 --> 1:59:00.100\n up a pen and started writing, it was easy to go.\n\n1:59:00.100 --> 1:59:04.040\n So I just decided to keep with that.\n\n1:59:04.040 --> 1:59:08.240\n If it got in my way, I didn't like it, I could always just go back to the word processor\n\n1:59:08.240 --> 1:59:09.240\n and be fine.\n\n1:59:09.240 --> 1:59:11.160\n But that never happened.\n\n1:59:11.160 --> 1:59:16.880\n So there's a certain security that comes from knowing that it's ink on paper and there's\n\n1:59:16.880 --> 1:59:28.600\n no operating system crash or software failure that can obliterate it.\n\n1:59:28.600 --> 1:59:31.880\n It's a slower output technique.\n\n1:59:31.880 --> 1:59:39.520\n And so a sentence or a paragraph spends a longer time in the buffer up here before it\n\n1:59:39.520 --> 1:59:43.800\n gets committed to paper, whereas I can type really fast.\n\n1:59:43.800 --> 1:59:48.900\n And so I can slam things out before I've really thought them through.\n\n1:59:48.900 --> 1:59:54.300\n So I think the first draft quality ends up being higher.\n\n1:59:54.300 --> 2:00:00.840\n And then editing, first draft of editing is just faster because instead of like trying\n\n2:00:00.840 --> 2:00:07.880\n to move the cursor around or whatever or hitting the backspace key, I can just draw a line\n\n2:00:07.880 --> 2:00:14.600\n through a word or a sentence or just around a whole paragraph and exit out.\n\n2:00:14.600 --> 2:00:18.880\n And in doing so, I very quickly created an edit, but I've also left behind a record of\n\n2:00:18.880 --> 2:00:22.200\n what the text was prior to the edit.\n\n2:00:22.200 --> 2:00:28.880\n Of course, all the digital versions have those quote unquote features, but their experience\n\n2:00:28.880 --> 2:00:31.280\n is different.\n\n2:00:31.280 --> 2:00:41.240\n Is there a romance to just the physical, the touch of the pen to the paper doing what has\n\n2:00:41.240 --> 2:00:43.160\n been done for centuries?\n\n2:00:43.160 --> 2:00:44.160\n I think there is.\n\n2:00:44.160 --> 2:00:50.940\n I think there's just the simplicity of it and not having any intermediary technology\n\n2:00:50.940 --> 2:01:01.840\n beyond the pen and the paper is just very simple and clean and so I've got a bunch of\n\n2:01:01.840 --> 2:01:03.960\n fountain pens.\n\n2:01:03.960 --> 2:01:10.680\n I started buying fancy paper from Italy a few years ago because I thought I would be\n\n2:01:10.680 --> 2:01:19.920\n more conservative with it, but it's still a trivial expenditure, so it doesn't really\n\n2:01:19.920 --> 2:01:24.280\n alter my habits very much.\n\n2:01:24.280 --> 2:01:30.200\n So all that said, once you do type stuff up, you use Emacs.\n\n2:01:30.200 --> 2:01:33.480\n I use Emacs, obviously the superior editor.\n\n2:01:33.480 --> 2:01:34.480\n Of course.\n\n2:01:34.480 --> 2:01:41.160\n Let me just ask the ridiculous futuristic question because Emacs has been around forever.\n\n2:01:41.160 --> 2:01:52.200\n Do you think in 100 years we will still have Emacs and Vim, or like pick a let's say 50,\n\n2:01:52.200 --> 2:01:53.200\n 100 years.\n\n2:01:53.200 --> 2:01:54.200\n Yeah, yeah, yeah.\n\n2:01:54.200 --> 2:02:00.980\n No, I mean whenever you're doing anything in Linux, you're spending a lot of time editing\n\n2:02:00.980 --> 2:02:06.960\n little config files and scripts and stuff and you need to be able to pop in and out\n\n2:02:06.960 --> 2:02:12.100\n of editing those things and it needs to work.\n\n2:02:12.100 --> 2:02:19.680\n Like even if the windowing GUI is dead and all you've got is like a command line, to\n\n2:02:19.680 --> 2:02:26.560\n get out of that problem, you might need to enter an editor and alter a file.\n\n2:02:26.560 --> 2:02:34.280\n So I think on that level, there will always have to be sort of very simple, well Emacs\n\n2:02:34.280 --> 2:02:37.060\n isn't very simple, but you know what I mean.\n\n2:02:37.060 --> 2:02:44.080\n There have to be basic editors that you can use from either the command line or a GUI\n\n2:02:44.080 --> 2:02:47.440\n just for administering systems.\n\n2:02:47.440 --> 2:02:58.580\n Now how widespread they'll be, there's a certain amount of, what's the story of the American\n\n2:02:58.580 --> 2:03:06.960\n folktale of the hammer guy who drives the railroad spikes, John Henry, trying to keep\n\n2:03:06.960 --> 2:03:12.660\n up with the steam hammer and eventually the steam hammer wins because he can't drive the\n\n2:03:12.660 --> 2:03:14.160\n spikes fast enough.\n\n2:03:14.160 --> 2:03:25.360\n So there's a sense in which Microsoft, who knows how much they've invested in code visual\n\n2:03:25.360 --> 2:03:29.880\n studio or Apple with Xcode.\n\n2:03:29.880 --> 2:03:38.200\n So they've put huge amounts of money into enhancing their IDEs and Emacs in theory can\n\n2:03:38.200 --> 2:03:47.000\n duplicate all of those features by if you just have enough Linux hackers writing Emacs\n\n2:03:47.000 --> 2:04:00.600\n Lisp macros, but at some point it's gonna be hard to maintain that level of, to keep\n\n2:04:00.600 --> 2:04:03.680\n up feature for feature.\n\n2:04:03.680 --> 2:04:09.160\n The interesting thing about Emacs just is it's lasted a long time and I think you talked\n\n2:04:09.160 --> 2:04:21.160\n about that there's a certain fads certainly in the software engineering space and it's\n\n2:04:21.160 --> 2:04:28.760\n interesting to think about technologies that sort of last for a very long time and just\n\n2:04:28.760 --> 2:04:33.440\n kind of being in the, what is it, how do they get by?\n\n2:04:33.440 --> 2:04:41.240\n It's like the cockroaches of software or the bacteria software or something like this base\n\n2:04:41.240 --> 2:04:47.520\n thing that nobody, everybody's just became reliant on and they just outlast everything\n\n2:04:47.520 --> 2:04:52.880\n else and slowly, slowly adjust with the times with a little bit of a delay, with a little\n\n2:04:52.880 --> 2:04:58.560\n bit of customization by individuals kind of that, but they're always there in the shadows\n\n2:04:58.560 --> 2:05:01.360\n and they outlast everybody else.\n\n2:05:01.360 --> 2:05:05.880\n And I wonder if that might be the story for a lot of technologies, especially in the software\n\n2:05:05.880 --> 2:05:06.880\n space.\n\n2:05:06.880 --> 2:05:14.040\n Shell scripts, all that stuff, you can't run the modern world without a bunch of shell\n\n2:05:14.040 --> 2:05:18.880\n scripts booting up machines and running things.\n\n2:05:18.880 --> 2:05:25.680\n So that is gonna be a hard thing to replace.\n\n2:05:25.680 --> 2:05:29.200\n And then tech for typesetting that you use, you said.\n\n2:05:29.200 --> 2:05:35.240\n For when I want to print it out, yeah, I just have some simple macros that I use, but then\n\n2:05:35.240 --> 2:05:42.440\n I have to, the publisher put their foot down and they want it in Word format now.\n\n2:05:42.440 --> 2:05:52.440\n So years ago I wrote some macros to convert and this time, what did I do?\n\n2:05:52.440 --> 2:05:53.440\n Copy paste?\n\n2:05:53.440 --> 2:05:57.440\n No, I use sort of regular expressions.\n\n2:05:57.440 --> 2:06:05.680\n So I was to do italics in, you put it in curly brackets and you do backslash IT and then\n\n2:06:05.680 --> 2:06:09.900\n you type what you want to type and that's how you get italics in tech.\n\n2:06:09.900 --> 2:06:16.520\n So you can create a regular expression that'll look for some text between curly brackets\n\n2:06:16.520 --> 2:06:24.800\n preceded by backslash IT and then instead convert that to italics.\n\n2:06:24.800 --> 2:06:28.240\n And Word will do that.\n\n2:06:28.240 --> 2:06:31.520\n Word if you go deep enough into its search and replace UI.\n\n2:06:31.520 --> 2:06:34.160\n You can do regular expressions.\n\n2:06:34.160 --> 2:06:35.160\n Is just regfs.\n\n2:06:35.160 --> 2:06:36.160\n Yeah.\n\n2:06:36.160 --> 2:06:38.160\n It's funny that you did that.\n\n2:06:38.160 --> 2:06:39.160\n Yeah.\n\n2:06:39.160 --> 2:06:45.840\n I mean, I'm sure there's tools that help you with that kind of thing, but the task is sufficiently\n\n2:06:45.840 --> 2:06:51.240\n simple to where you can do a much better job than anyone, anybody else's tool can.\n\n2:06:51.240 --> 2:06:52.240\n Yeah, yeah.\n\n2:06:52.240 --> 2:06:53.240\n So.\n\n2:06:53.240 --> 2:06:54.240\n That's a fascinating process.\n\n2:06:54.240 --> 2:06:55.240\n That's fine for me.\n\n2:06:55.240 --> 2:06:56.240\n Yeah.\n\n2:06:56.240 --> 2:06:58.600\n And it keeps you from messing around with formatting.\n\n2:06:58.600 --> 2:06:59.600\n Yeah.\n\n2:06:59.600 --> 2:07:06.000\n Like, Oh, what if I put this chapter heading, you know, in, you know, a sans serif font?\n\n2:07:06.000 --> 2:07:07.000\n Yeah.\n\n2:07:07.000 --> 2:07:09.400\n It's a, it's just classic wanking.\n\n2:07:09.400 --> 2:07:16.360\n And so those options are closed off in what I'm doing.\n\n2:07:16.360 --> 2:07:20.960\n Is there advice you could say, what does it take to write a great story?\n\n2:07:20.960 --> 2:07:28.080\n The power of, of good yarns, good narratives to, um, pull people in is, is, uh, incredible.\n\n2:07:28.080 --> 2:07:36.800\n And I think my sort of amateur theory is that it's an evolutionary development that if you're,\n\n2:07:36.800 --> 2:07:45.320\n um, you know, uh, uh, cave person sitting around a fire in the rift valley a million\n\n2:07:45.320 --> 2:07:57.000\n years ago, um, if you can tell the story of how you escaped from the hyenas, um, or how\n\n2:07:57.000 --> 2:08:02.480\n uncle Bob, you know, didn't escape from the hyenas, and if the people listening to you\n\n2:08:02.480 --> 2:08:09.200\n can take that in and they can build that scenario in their heads, like a kind of virtual reality\n\n2:08:09.200 --> 2:08:16.920\n and see what you're describing, then you've just conferred an incredibly important advantage\n\n2:08:16.920 --> 2:08:19.040\n on the people who've heard that story.\n\n2:08:19.040 --> 2:08:20.040\n Yeah.\n\n2:08:20.040 --> 2:08:21.040\n Right.\n\n2:08:21.040 --> 2:08:25.280\n And so they know a bunch of stuff now about how to stay alive that they could not have\n\n2:08:25.280 --> 2:08:28.400\n learned in any other way.\n\n2:08:28.400 --> 2:08:34.520\n Um, I mean, animals who don't have speech though, they might warn each other, they might\n\n2:08:34.520 --> 2:08:42.800\n make a sound that says danger, danger, um, but, uh, but as far as we know, they can't\n\n2:08:42.800 --> 2:08:44.560\n tell more complicated stories.\n\n2:08:44.560 --> 2:08:47.520\n So it's a part of us.\n\n2:08:47.520 --> 2:08:48.520\n Yeah.\n\n2:08:48.520 --> 2:08:53.360\n I, the, the, the collective intelligence seems to be one of the key characteristics of the,\n\n2:08:53.360 --> 2:09:00.180\n of homo sapiens, the ability to share ideas and hold ideas together in our minds and storytelling\n\n2:09:00.180 --> 2:09:01.860\n is the fundamental aspect of that.\n\n2:09:01.860 --> 2:09:08.440\n Maybe even language itself is more fundamental because the language is required to do the\n\n2:09:08.440 --> 2:09:11.440\n storytelling or maybe they evolve together.\n\n2:09:11.440 --> 2:09:12.680\n Maybe they co evolve.\n\n2:09:12.680 --> 2:09:13.680\n Yeah.\n\n2:09:13.680 --> 2:09:18.880\n So I think that you've got to work with that and I think, uh, sometimes it seems like in\n\n2:09:18.880 --> 2:09:27.440\n kind of, um, literary circles that having a lot of plot is a little bit frowned upon\n\n2:09:27.440 --> 2:09:35.040\n as it's pulpy or it's exploitative, but, um, for me, I don't have any compunctions whatsoever\n\n2:09:35.040 --> 2:09:36.040\n about that.\n\n2:09:36.040 --> 2:09:40.720\n I like stories that, um, are grabby and fun and exciting to read.\n\n2:09:40.720 --> 2:09:46.480\n And once you've got one of those going, once you've got a good yarn going that people will\n\n2:09:46.480 --> 2:09:52.000\n enjoy reading, then you're free to do whatever you want, uh, in the frame of that story.\n\n2:09:52.000 --> 2:09:56.400\n Um, but if you don't have that, um, then you got nothing.\n\n2:09:56.400 --> 2:10:02.800\n What about having like, uh, which you do at a technological scientific rigor, like to\n\n2:10:02.800 --> 2:10:09.400\n the, to the accuracy and as much as possible, how does that add to the, to, to Bob telling\n\n2:10:09.400 --> 2:10:12.640\n the story or telling the story about Bob or on the campfire?\n\n2:10:12.640 --> 2:10:19.520\n Well, the main thing that it does is, um, present, um, little details that you might\n\n2:10:19.520 --> 2:10:23.080\n not have come up with on your own.\n\n2:10:23.080 --> 2:10:30.880\n So if you're just sitting there freely imagining things, um, you, uh, you, your, your brain\n\n2:10:30.880 --> 2:10:36.320\n probably isn't going to serve up the wealth of details and the resulting complications\n\n2:10:36.320 --> 2:10:42.560\n and surprises that real, that the real world is constantly presenting us with.\n\n2:10:42.560 --> 2:10:49.780\n And so, um, in my case, if I'm, um, trying to write a story about, you know, some that\n\n2:10:49.780 --> 2:10:56.080\n involves some technology like a rocket or, uh, orbital maneuvers or whatever, then delving\n\n2:10:56.080 --> 2:11:02.760\n into those details eventually is going to turn up some weird unexpected, you know, thing\n\n2:11:02.760 --> 2:11:09.640\n that, uh, gives me material to work with, but also subliminally readers who see that\n\n2:11:09.640 --> 2:11:17.080\n are going to be drawn in more, uh, because they're going to, uh, to, to find that, um,\n\n2:11:17.080 --> 2:11:21.880\n oh, I didn't see that coming, you know, you know, it's got some of the complexity and\n\n2:11:21.880 --> 2:11:23.920\n surprise value of the real world.\n\n2:11:23.920 --> 2:11:24.920\n Yeah.\n\n2:11:24.920 --> 2:11:33.240\n It does something, um, uh, Alex Garland, director who did, uh, who wrote, uh, directed Ex Machina.\n\n2:11:33.240 --> 2:11:41.920\n I think about AI movies and the more care you take in making it accurate, the more compelling\n\n2:11:41.920 --> 2:11:44.320\n the story becomes somehow.\n\n2:11:44.320 --> 2:11:47.200\n I'm not, I'm not sure what that is.\n\n2:11:47.200 --> 2:11:52.960\n Um, maybe because it becomes more real to the people writing the story, maybe it just\n\n2:11:52.960 --> 2:11:54.640\n makes you a better writer.\n\n2:11:54.640 --> 2:12:00.880\n The key to any storytelling is getting the, the readers to suspend their, their disbelief.\n\n2:12:00.880 --> 2:12:05.040\n And there's all kinds of triggers and little tells that can break that.\n\n2:12:05.040 --> 2:12:06.040\n Right.\n\n2:12:06.040 --> 2:12:09.240\n Um, and once it's broken, it's really hard to get it back.\n\n2:12:09.240 --> 2:12:12.440\n Uh, you know, a lot of times that's the end.\n\n2:12:12.440 --> 2:12:15.760\n Everybody will just close the book and not pick it up.\n\n2:12:15.760 --> 2:12:22.480\n Um, I gotta ask you, you've answered this question, but I gotta ask you the most impossible\n\n2:12:22.480 --> 2:12:30.240\n question for an author to answer, but which Neal Stephenson book should one read first?\n\n2:12:30.240 --> 2:12:35.040\n So when people ask me that, I usually ask them what they like to read, right?\n\n2:12:35.040 --> 2:12:42.360\n Because, uh, I mean, there's the best known one is probably snow crash, but that's a cyber\n\n2:12:42.360 --> 2:12:43.360\n punk novel.\n\n2:12:43.360 --> 2:12:46.480\n That's at the same time, making fun of cyber punk.\n\n2:12:46.480 --> 2:12:53.800\n Um, so it's kind of got some layers to it that, uh, might not seem so funny if you don't\n\n2:12:53.800 --> 2:12:57.000\n have that, if you don't get the joke, right?\n\n2:12:57.000 --> 2:13:03.120\n So, um, there's, uh, I've written, as you point out, I've written historical novels.\n\n2:13:03.120 --> 2:13:04.560\n Some people like those.\n\n2:13:04.560 --> 2:13:06.520\n Some people prefer those.\n\n2:13:06.520 --> 2:13:12.340\n So if that's what you like, then kryptonomicon or the baroque cycle is where you would start\n\n2:13:12.340 --> 2:13:17.800\n if you like sort of techno thrillers that are set in a modern day setting, but aren't\n\n2:13:17.800 --> 2:13:25.160\n science fictiony per se, then, uh, Reamdy, um, is one of those.\n\n2:13:25.160 --> 2:13:29.440\n And termination shock, um, is, is, is definitely one of those.\n\n2:13:29.440 --> 2:13:35.920\n Um, so it just depends on, on, uh, what people like.\n\n2:13:35.920 --> 2:13:43.040\n What, what, uh, when people a long time ago recommend I read snow crash, they said, uh,\n\n2:13:43.040 --> 2:13:47.920\n it's the, it's Neil Stevenson light.\n\n2:13:47.920 --> 2:13:54.240\n It's the, uh, like if you don't want to be overwhelmed by the depth, like the rigor book,\n\n2:13:54.240 --> 2:13:57.720\n like that's a good, that's a good introduction to the man.\n\n2:13:57.720 --> 2:14:05.160\n So essentially you broke it down by topics, but if you wanted to read all of them, what's\n\n2:14:05.160 --> 2:14:10.320\n a good introduction to the, to the man, because obviously these worlds are very different.\n\n2:14:10.320 --> 2:14:12.920\n The philosophies are very different.\n\n2:14:12.920 --> 2:14:17.640\n What's a good introduction to the human?\n\n2:14:17.640 --> 2:14:23.240\n People ask the same thing of Dostoyevsky, people, it's a, it's a hard one to answer.\n\n2:14:23.240 --> 2:14:26.920\n Maybe seven eves because it's got big themes.\n\n2:14:26.920 --> 2:14:32.920\n Um, it's, you know, it's about heavy, heavy things happening to the human race.\n\n2:14:32.920 --> 2:14:39.320\n Uh, but hopefully the story is told through a cast of characters that, uh, people can\n\n2:14:39.320 --> 2:14:47.360\n relate to, you know, and it moves along, uh, so, uh, it, it does go kind of deep eventually\n\n2:14:47.360 --> 2:14:54.320\n on how rockets work and orbital mechanics and all that stuff, but, um, people were able\n\n2:14:54.320 --> 2:14:57.600\n to get through it anyway, or some people just skip over that.\n\n2:14:57.600 --> 2:14:58.600\n It's fine.\n\n2:14:58.600 --> 2:15:06.560\n You know, um, as an author, let me ask you what books had a big impact on your life that\n\n2:15:06.560 --> 2:15:07.560\n you've read.\n\n2:15:07.560 --> 2:15:14.040\n Is there any that jumped to mind that, uh, you learned from as a writer, as a philosopher,\n\n2:15:14.040 --> 2:15:17.160\n as a mathematician, as an engineer?\n\n2:15:17.160 --> 2:15:19.520\n This is one of these questions where I always blank out.\n\n2:15:19.520 --> 2:15:26.000\n And then when I'm walking out the door, I'll, I'll remember 12, so this is a random selection\n\n2:15:26.000 --> 2:15:27.680\n that doesn't represent the top.\n\n2:15:27.680 --> 2:15:34.400\n The top ones, um, well, I mentioned, you know, gulag archipelago and it's kind of a hefty\n\n2:15:34.400 --> 2:15:37.920\n and dark, but, and then it has a personal connection as well.\n\n2:15:37.920 --> 2:15:38.920\n Yeah.\n\n2:15:38.920 --> 2:15:44.040\n Just like where you found the book to the part, the time in your life, where you found\n\n2:15:44.040 --> 2:15:45.620\n it, who recommended it.\n\n2:15:45.620 --> 2:15:46.920\n That's also part of the story.\n\n2:15:46.920 --> 2:15:47.920\n Yeah.\n\n2:15:47.920 --> 2:15:54.200\n So there's definitely that there's, you know, I, I circle back to Moby Dick a lot, um, because\n\n2:15:54.200 --> 2:15:59.620\n we read it in a, uh, a really great English class I had in high school.\n\n2:15:59.620 --> 2:16:05.040\n And I came in with an oppositional stance because I thought that the teacher was going\n\n2:16:05.040 --> 2:16:11.640\n to try to talk me into having all kinds of highfalutin ideas about allegory and what\n\n2:16:11.640 --> 2:16:12.640\n does this mean?\n\n2:16:12.640 --> 2:16:13.640\n What's the symbolism?\n\n2:16:13.640 --> 2:16:20.960\n And it turned out that, uh, it turned out to be a lot more interesting and satisfying\n\n2:16:20.960 --> 2:16:21.960\n than that.\n\n2:16:21.960 --> 2:16:29.920\n Um, what was the first powerful book you remember reading that like convinced you that this\n\n2:16:29.920 --> 2:16:32.440\n form could have depth?\n\n2:16:32.440 --> 2:16:33.440\n Hmm.\n\n2:16:33.440 --> 2:16:34.440\n Was it Moby Dick?\n\n2:16:34.440 --> 2:16:35.440\n Was it like in high school?\n\n2:16:35.440 --> 2:16:39.320\n I'm trying to remember, well, Moby Dick was definitely a big one.\n\n2:16:39.320 --> 2:16:45.160\n Um, I mean, I used to read a lot of classics comics when I was, I don't know if you've\n\n2:16:45.160 --> 2:16:53.080\n seen these, it's a whole series of comic books that, um, uh, it was viral.\n\n2:16:53.080 --> 2:16:57.760\n You could, uh, in the, in the back of each comic book was an order form.\n\n2:16:57.760 --> 2:17:03.240\n You could check some boxes and fill out your address and mail it in and more would show\n\n2:17:03.240 --> 2:17:04.240\n up.\n\n2:17:04.240 --> 2:17:10.040\n And, but it was like, they would do the Count of Monte Cristo, you know, Moby Dick, you\n\n2:17:10.040 --> 2:17:17.240\n know, Robert Louis Stevenson, Robinson Crusoe, you know, all this of classic books, uh, were,\n\n2:17:17.240 --> 2:17:19.480\n they had put into comic book form.\n\n2:17:19.480 --> 2:17:21.040\n That's amazing.\n\n2:17:21.040 --> 2:17:22.040\n Yeah.\n\n2:17:22.040 --> 2:17:26.240\n Reading Moby Dick, if you're nine years old is a tall order.\n\n2:17:26.240 --> 2:17:32.080\n There's some very complicated sentences in there and a lot of digressions, but if you're\n\n2:17:32.080 --> 2:17:36.960\n just looking at the comic books, like, holy shit, look at that whale, you know?\n\n2:17:36.960 --> 2:17:43.600\n Um, and, um, and ultimately the power of the story doesn't need the complicated words.\n\n2:17:43.600 --> 2:17:47.720\n It's, it's all about the man and the, and the whale.\n\n2:17:47.720 --> 2:17:48.720\n Yeah.\n\n2:17:48.720 --> 2:17:49.720\n Yeah.\n\n2:17:49.720 --> 2:17:52.600\n So you could get kind of a grounding in a lot of classic works of literature without\n\n2:17:52.600 --> 2:17:57.560\n actually reading them, which is, you know, it's great when you're nine years old.\n\n2:17:57.560 --> 2:18:01.540\n So, so I read a lot of that stuff, uh, for sure.\n\n2:18:01.540 --> 2:18:07.240\n The annotated Sherlock Holmes, um.\n\n2:18:07.240 --> 2:18:10.360\n You mentioned David Deutsch too, as an inspiration for some of your work.\n\n2:18:10.360 --> 2:18:14.520\n I mean, you've, you've obviously didn't like really a lot of research for the books you,\n\n2:18:14.520 --> 2:18:15.520\n you do.\n\n2:18:15.520 --> 2:18:16.520\n Roger Penrose.\n\n2:18:16.520 --> 2:18:22.900\n What, uh, do you remember a book that made you want to become a writer or a moment that\n\n2:18:22.900 --> 2:18:23.900\n made you become a writer?\n\n2:18:23.900 --> 2:18:31.520\n I think like the, you know, the answer I usually give is that when I was in like fifth grade\n\n2:18:31.520 --> 2:18:40.040\n and one of my friends came to school one day, he was wearing leather shoes, like dress shoes\n\n2:18:40.040 --> 2:18:44.520\n and I hated dress shoes cause mine never fit.\n\n2:18:44.520 --> 2:18:45.880\n And so they were uncomfortable.\n\n2:18:45.880 --> 2:18:50.420\n I couldn't run, you know, they were cold, it was Iowa.\n\n2:18:50.420 --> 2:18:57.000\n So I kind of said, I remember very clearly thinking, okay, I don't like where this is\n\n2:18:57.000 --> 2:18:58.000\n going.\n\n2:18:58.000 --> 2:19:08.720\n Like, does this mean that next year all of the kids are going to be wearing leather shoes?\n\n2:19:08.720 --> 2:19:12.640\n So I need to find a job where I don't have to do that.\n\n2:19:12.640 --> 2:19:17.920\n So that was like the first time I thought about trying to find such a job, you know,\n\n2:19:17.920 --> 2:19:18.920\n being a writer.\n\n2:19:18.920 --> 2:19:24.680\n And then, and then I just read a lot of, uh, just classic science fiction short stories\n\n2:19:24.680 --> 2:19:28.480\n and started trying to write some of my own.\n\n2:19:28.480 --> 2:19:36.720\n And there were just classic young adult stories like by Heinlein and the other classic names\n\n2:19:36.720 --> 2:19:37.720\n that you think of.\n\n2:19:37.720 --> 2:19:42.160\n But the Heinlein ones stuck, have stuck with me in a way that the others didn't.\n\n2:19:42.160 --> 2:19:54.440\n What's the greatest science fiction book ever written, just removing your work from consideration?\n\n2:19:54.440 --> 2:19:56.400\n I'm loving torturing you right now.\n\n2:19:56.400 --> 2:19:58.360\n Greatest ever non Stevenson.\n\n2:19:58.360 --> 2:20:02.360\n Do we include fantasy or does it have to be science fiction?\n\n2:20:02.360 --> 2:20:05.560\n Oh, interesting fantasy.\n\n2:20:05.560 --> 2:20:07.600\n Hmm.\n\n2:20:07.600 --> 2:20:09.640\n I did not expect that twist.\n\n2:20:09.640 --> 2:20:13.680\n Uh, well, for in a weird way, they're lumped together in people's minds, right?\n\n2:20:13.680 --> 2:20:17.680\n So they are, but there, but there's also a boundary somehow.\n\n2:20:17.680 --> 2:20:18.680\n Yeah.\n\n2:20:18.680 --> 2:20:20.480\n I'm not sure what that is exactly.\n\n2:20:20.480 --> 2:20:21.480\n Nobody is.\n\n2:20:21.480 --> 2:20:22.480\n It's a mystery.\n\n2:20:22.480 --> 2:20:27.640\n So, I mean, if we do include it, then it's easily the, the Lord of the rings.\n\n2:20:27.640 --> 2:20:34.960\n But, um, I mean, greatness is a interesting quality to, uh, to try to define.\n\n2:20:34.960 --> 2:20:43.240\n Um, and for me, a lot of the, the fun and the joy of such books is, is not in what you'd\n\n2:20:43.240 --> 2:20:46.860\n call greatness, but just storytelling.\n\n2:20:46.860 --> 2:20:53.040\n So I was always a big fan of has have space suit will travel, which is a Heinlein young\n\n2:20:53.040 --> 2:20:54.040\n adult book.\n\n2:20:54.040 --> 2:20:56.480\n It's just, uh, it's just a fun, good read.\n\n2:20:56.480 --> 2:21:01.220\n Um, so, so fun is a big component.\n\n2:21:01.220 --> 2:21:02.220\n Greatness is overrated.\n\n2:21:02.220 --> 2:21:08.040\n Well, I don't know it's overrated, but it's just, you know, it's, it might be underdefined\n\n2:21:08.040 --> 2:21:10.120\n to put it that way.\n\n2:21:10.120 --> 2:21:13.920\n So how space it will travel now, I definitely have to read that one.\n\n2:21:13.920 --> 2:21:14.920\n Yeah.\n\n2:21:14.920 --> 2:21:15.920\n You mentioned Iowa.\n\n2:21:15.920 --> 2:21:20.680\n It was, uh, there a couple of times I got to spend, uh, quite a bit of time with Dan\n\n2:21:20.680 --> 2:21:30.200\n Gabel with Tom Brands who are wrestlers was, uh, is it now wrestling, martial arts, part\n\n2:21:30.200 --> 2:21:35.360\n of your life, any part of your form formation of who you are as a human being?\n\n2:21:35.360 --> 2:21:36.360\n I think so.\n\n2:21:36.360 --> 2:21:45.040\n In a, it was a late, it was a late thing for me, but growing up in Ames, um, Dan Gabel\n\n2:21:45.040 --> 2:21:47.760\n was, uh, a few years older than me.\n\n2:21:47.760 --> 2:21:54.180\n And so sometimes we would go to the arena at the university and watch wrestling meets\n\n2:21:54.180 --> 2:21:58.980\n and um, and this was before his Olympic career.\n\n2:21:58.980 --> 2:22:04.460\n So everyone knew he was the star of that team and that he was the best, but people didn't\n\n2:22:04.460 --> 2:22:07.600\n yet know he was the greatest of all time.\n\n2:22:07.600 --> 2:22:08.600\n You saw Gabe.\n\n2:22:08.600 --> 2:22:14.280\n So that was part, it's, it's funny is, uh, it feels like a small world that you would\n\n2:22:14.280 --> 2:22:20.400\n be in the same space as Dan Gabel a hundred feet away, a little dot on the mat trouncing\n\n2:22:20.400 --> 2:22:23.560\n his opponents, him and him and Chris Taylor.\n\n2:22:23.560 --> 2:22:30.680\n So the other star was this 400 pound plus guy named Chris Taylor who, uh, also went\n\n2:22:30.680 --> 2:22:32.240\n to the Olympics.\n\n2:22:32.240 --> 2:22:38.880\n So yeah, people, you know, he was, he was a no, he was a, uh, athletic hero and wrestling\n\n2:22:38.880 --> 2:22:47.240\n is there's certain States like Oklahoma, Pennsylvania, Iowa, where wrestling is the sport because\n\n2:22:47.240 --> 2:22:49.120\n those are States of small towns.\n\n2:22:49.120 --> 2:22:55.640\n And so if you're a small town is if you're like Dan Gabel, uh, and you have to be on\n\n2:22:55.640 --> 2:23:01.320\n a football team with 20 other guys who are not Dan Gabel, then no matter how good you\n\n2:23:01.320 --> 2:23:04.600\n are, your team might, might suck.\n\n2:23:04.600 --> 2:23:11.920\n Uh, but if in a solo thing, you can, you can go to the Olympics.\n\n2:23:11.920 --> 2:23:16.200\n So we did a lot of wrestling in our gym classes in school and I didn't like it.\n\n2:23:16.200 --> 2:23:22.400\n And I think partly it's just that it was so, so competitive and the people who were cared\n\n2:23:22.400 --> 2:23:26.480\n about it really cared about it a lot, you know?\n\n2:23:26.480 --> 2:23:31.300\n And so it was, it was pretty tough and I didn't think I had the right body type.\n\n2:23:31.300 --> 2:23:36.600\n But then when I was, uh, after college, I was in Iowa city for a few years when he was\n\n2:23:36.600 --> 2:23:43.720\n coaching the, that the wrestling team there and the, he won like nine championships out\n\n2:23:43.720 --> 2:23:47.380\n of 10 years, you know, during that, during that time.\n\n2:23:47.380 --> 2:23:53.720\n So he was both the greatest individual wrestler of all time and like the greatest team coach.\n\n2:23:53.720 --> 2:24:02.280\n Um, so I know I've never met him, but we've, uh, he's kind of been like in my sphere of\n\n2:24:02.280 --> 2:24:04.880\n awareness since I was, you know, kind of my whole life.\n\n2:24:04.880 --> 2:24:10.200\n And people would always tell stories about him, like I think he got arrested once for\n\n2:24:10.200 --> 2:24:15.720\n some kind of, I don't know, minor offense in Ames.\n\n2:24:15.720 --> 2:24:17.600\n And so he just basically stayed up all night.\n\n2:24:17.600 --> 2:24:23.320\n He was in this cage in the jail, just stayed up all night doing pull ups on, you know,\n\n2:24:23.320 --> 2:24:24.320\n it sounds about right.\n\n2:24:24.320 --> 2:24:25.320\n Yeah.\n\n2:24:25.320 --> 2:24:30.080\n And, uh, uh, so yeah.\n\n2:24:30.080 --> 2:24:35.980\n So has that been, I mean, I was such an interesting place in the world and wrestling is just part\n\n2:24:35.980 --> 2:24:40.520\n of that story.\n\n2:24:40.520 --> 2:24:41.960\n Is that somewhere in there?\n\n2:24:41.960 --> 2:24:44.860\n Does that resonate deeply with who you are?\n\n2:24:44.860 --> 2:24:48.960\n It was a formative thing for me growing up there for sure.\n\n2:24:48.960 --> 2:24:57.160\n It's just a, uh, you know, uh, uh, or at least used to be a very orderly place, high social\n\n2:24:57.160 --> 2:25:02.200\n capital, very minimal class differences.\n\n2:25:02.200 --> 2:25:08.760\n So like you'd have some people who would drive a Cadillac instead of a Chevy, but, uh, that\n\n2:25:08.760 --> 2:25:09.760\n was it.\n\n2:25:09.760 --> 2:25:11.400\n That was, you know, those were the rich people, right?\n\n2:25:11.400 --> 2:25:20.400\n So, um, and a college town is always a different environment like, uh, you know, Austin, uh,\n\n2:25:20.400 --> 2:25:27.400\n has some of this, um, so it was a pretty kind of utopian, uh, other than the weather and\n\n2:25:27.400 --> 2:25:33.440\n a few other things, uh, environment to, to grow up in the, the martial art I ended up\n\n2:25:33.440 --> 2:25:39.400\n doing is sword stuff, which is interesting because it uses a different feedback loop.\n\n2:25:39.400 --> 2:25:47.040\n So when you're, if you're grappling, everything is through sense of touch and your sense of\n\n2:25:47.040 --> 2:25:50.840\n touch is very old and simple, right?\n\n2:25:50.840 --> 2:25:55.840\n Like earthworms don't have, don't even have eyes, but they can tell when they're being\n\n2:25:55.840 --> 2:25:56.840\n touched, right?\n\n2:25:56.840 --> 2:25:59.480\n So it's very fast.\n\n2:25:59.480 --> 2:26:10.360\n Um, and uh, with, um, with a standoff or like boxing or some kinds of sword fighting, you're,\n\n2:26:10.360 --> 2:26:11.720\n you're not touching the other person.\n\n2:26:11.720 --> 2:26:17.200\n Most of the time, your, your, your visual system is doing something way more, it's doing\n\n2:26:17.200 --> 2:26:23.440\n slam and trying to figure out what the other person is up to.\n\n2:26:23.440 --> 2:26:28.300\n And so, um, that always felt more my speed.\n\n2:26:28.300 --> 2:26:36.040\n So in an Olympic style fencing, you're, it doesn't start really until you're crossing\n\n2:26:36.040 --> 2:26:41.320\n blades with the other person and now you're back to wrestling, you're feeling what they're\n\n2:26:41.320 --> 2:26:43.600\n doing and it's all about that.\n\n2:26:43.600 --> 2:26:50.020\n But some of the older sword arts, um, don't engage the blade that way.\n\n2:26:50.020 --> 2:26:59.440\n You stand off at range and then you make cutting attacks and, um, and, uh, and so, so those\n\n2:26:59.440 --> 2:27:07.080\n are all processed visually and I think I'm more of a slow thinker, so it works for me\n\n2:27:07.080 --> 2:27:08.080\n better.\n\n2:27:08.080 --> 2:27:13.720\n I mean, the same, it has the same, the artistry and the beauty of boxing, I suppose, just\n\n2:27:13.720 --> 2:27:18.680\n like you said, is like, there's no, there's no contact and it's all processed visually\n\n2:27:18.680 --> 2:27:24.080\n and I'm sure there's a dance of its own that, that depends on the characteristic of a sword\n\n2:27:24.080 --> 2:27:25.080\n involved.\n\n2:27:25.080 --> 2:27:26.080\n Yeah.\n\n2:27:26.080 --> 2:27:31.240\n There is a set of, of stances and, and, uh, basic reactions that you try to learn that\n\n2:27:31.240 --> 2:27:37.400\n are thought to be defensible, um, and, and safe or safer.\n\n2:27:37.400 --> 2:27:43.440\n And so it tends to be a series of short engagements where you'll, you'll close in, you'll try\n\n2:27:43.440 --> 2:27:50.960\n out your, your idea and it works or it doesn't, then you, you back off again.\n\n2:27:50.960 --> 2:27:56.360\n It's interesting to think about like human history because martial arts, okay, that's\n\n2:27:56.360 --> 2:27:57.680\n a thing.\n\n2:27:57.680 --> 2:28:07.040\n But in terms of sword fighting, just the full range of humans that existed who mastered\n\n2:28:07.040 --> 2:28:11.840\n sword fighting or sought the mastery of sword fighting, just to imagine the thousands of\n\n2:28:11.840 --> 2:28:18.480\n people who, the heights they have achieved because the stakes are so incredibly high\n\n2:28:18.480 --> 2:28:19.760\n to be good.\n\n2:28:19.760 --> 2:28:27.280\n And it's the richest, most powerful people in those societies spending whatever it takes\n\n2:28:27.280 --> 2:28:33.060\n to get the best gear and the best training because you're right, everything depends on\n\n2:28:33.060 --> 2:28:34.060\n it.\n\n2:28:34.060 --> 2:28:35.060\n And it's still life and death.\n\n2:28:35.060 --> 2:28:43.440\n I mean, that, that's fascinating, um, that, that's fascinating and we perhaps have lost\n\n2:28:43.440 --> 2:28:46.280\n that forever with greater weapons.\n\n2:28:46.280 --> 2:28:52.400\n I mean, the artistry of sword fighting when it's life and death and you go into war, you\n\n2:28:52.400 --> 2:28:54.960\n have the Miyamoto Musashi's of the world, right?\n\n2:28:54.960 --> 2:29:02.040\n The, I don't know, there's a, there's a poetry to that, that there's a mastery to that that\n\n2:29:02.040 --> 2:29:05.640\n I don't know if we could achieve with any other kind of martial art.\n\n2:29:05.640 --> 2:29:11.720\n Well the, one of the good, you were talking earlier about the, the, the good effects of\n\n2:29:11.720 --> 2:29:15.680\n the internet, social media that we sometimes overlook.\n\n2:29:15.680 --> 2:29:20.680\n And, and one of those is that, um, there were all these isolated people around the world\n\n2:29:20.680 --> 2:29:26.960\n who were interested in this, who found each other and kind of created a network of, of\n\n2:29:26.960 --> 2:29:28.960\n people who help each other learn these things.\n\n2:29:28.960 --> 2:29:35.000\n So that doesn't mean that anyone is, is up to the level of the you're talking about yet,\n\n2:29:35.000 --> 2:29:44.840\n but um, but it is happening and um, and so, um, there's a, a, a large number of old treatises,\n\n2:29:44.840 --> 2:29:50.180\n old written documents, uh, that have been dug up from libraries and, and people have\n\n2:29:50.180 --> 2:29:57.280\n been going over these and translating them from old dialects of Italian and German, um,\n\n2:29:57.280 --> 2:30:03.600\n to make sense of them and, and learning how to do these techniques with different, uh,\n\n2:30:03.600 --> 2:30:04.600\n different weapons.\n\n2:30:04.600 --> 2:30:11.960\n Um, actually there's a guy here in Austin named Damond Stith who does African, historical\n\n2:30:11.960 --> 2:30:14.120\n African martial arts.\n\n2:30:14.120 --> 2:30:22.800\n Um, also martial arts of, uh, of enslaved Africans who would learn machete fighting\n\n2:30:22.800 --> 2:30:26.200\n techniques in the Caribbean, South America.\n\n2:30:26.200 --> 2:30:28.040\n He's probably within a mile of us.\n\n2:30:28.040 --> 2:30:29.040\n He's an amazing guy.\n\n2:30:29.040 --> 2:30:30.040\n That's awesome.\n\n2:30:30.040 --> 2:30:31.040\n I'm going to look him up.\n\n2:30:31.040 --> 2:30:32.040\n Yeah.\n\n2:30:32.040 --> 2:30:34.240\n Can I ask you for advice?\n\n2:30:34.240 --> 2:30:42.040\n Can you give advice for young people, high school, college, you know, undergrads thinking\n\n2:30:42.040 --> 2:30:48.560\n about their career, thinking about life, how to live a life that you'd be proud of?\n\n2:30:48.560 --> 2:30:53.480\n You think quite a bit about like what it's required to be innovative in this world.\n\n2:30:53.480 --> 2:30:55.120\n You think quite a bit about the future.\n\n2:30:55.120 --> 2:31:00.720\n So if somebody wanted to be a person that makes a big impact from the future, what advice\n\n2:31:00.720 --> 2:31:02.840\n would you give them?\n\n2:31:02.840 --> 2:31:12.280\n I think a big part of it is finding the thing that you will do happily and, um, I don't\n\n2:31:12.280 --> 2:31:17.720\n want to say obsessively because that sounds like maybe it's pathological, but, but if\n\n2:31:17.720 --> 2:31:22.560\n you can find a thing that you'll, you know, you'll sit down, you'll start doing it and\n\n2:31:22.560 --> 2:31:27.080\n hours later you kind of snap out of it, where did the time go?\n\n2:31:27.080 --> 2:31:35.720\n Um, then, um, that's a really key discovery for anyone to make about themselves when they're\n\n2:31:35.720 --> 2:31:36.720\n young.\n\n2:31:36.720 --> 2:31:42.800\n Uh, because if you don't have that, um, it's hard to, uh, to figure out where you should\n\n2:31:42.800 --> 2:31:48.400\n put your energies, you know, and as you might have the best intentions, you might say, I,\n\n2:31:48.400 --> 2:31:56.160\n you know, I want world peace or whatever, uh, but, um, uh, at, at the end of the day,\n\n2:31:56.160 --> 2:32:01.560\n what really matters is how do you spend your time and, and are you spending it in a way\n\n2:32:01.560 --> 2:32:09.880\n that's productive, uh, and, um, uh, because it doesn't matter how smart you are or well\n\n2:32:09.880 --> 2:32:13.880\n intentioned you are unless you've figured that out.\n\n2:32:13.880 --> 2:32:18.640\n And so it's finding the thing in which you can sort of, you naturally lose yourself in.\n\n2:32:18.640 --> 2:32:25.960\n The thing is, um, at least for me, there's a lot of things like that, but I first have\n\n2:32:25.960 --> 2:32:31.140\n to overcome the initial hump of really sucking at that thing.\n\n2:32:31.140 --> 2:32:36.000\n Like the fun starts a little bit after the first hump of really sucking and then you\n\n2:32:36.000 --> 2:32:37.960\n could suck just regular.\n\n2:32:37.960 --> 2:32:38.960\n Yeah.\n\n2:32:38.960 --> 2:32:39.960\n Okay.\n\n2:32:39.960 --> 2:32:42.800\n So often people, oftentimes people can give up too early, I think.\n\n2:32:42.800 --> 2:32:48.260\n I mean, that's true with mathematics for me, it's for a lot of people is if you just give\n\n2:32:48.260 --> 2:32:54.320\n it a chance to struggle, if you give yourself time to struggle, you'll find a way, you'll\n\n2:32:54.320 --> 2:32:58.720\n find the thing within that thing that you can lose track of time with.\n\n2:32:58.720 --> 2:32:59.720\n Yeah.\n\n2:32:59.720 --> 2:33:06.200\n That's a key detail that, um, that's an important thing to add to, to what I said, which is\n\n2:33:06.200 --> 2:33:10.920\n that, uh, this might not happen the first time you do a thing.\n\n2:33:10.920 --> 2:33:17.880\n Maybe it will, but, um, uh, you might have to climb that learning curve and, um, if there's\n\n2:33:17.880 --> 2:33:24.080\n pressures in your life that are making you feel bad about that, then, um, it might prevent\n\n2:33:24.080 --> 2:33:28.760\n you from, from getting where you need to be.\n\n2:33:28.760 --> 2:33:35.800\n Um, so there's some complexity there, uh, that make, can make this kind of non obvious.\n\n2:33:35.800 --> 2:33:42.400\n Um, but, uh, that's what, that's why we need, you know, good teachers.\n\n2:33:42.400 --> 2:33:49.520\n Um, you know, another beneficial thing, uh, of the internet is YouTube and being able\n\n2:33:49.520 --> 2:33:56.360\n to learn things, how to do things on YouTube, the, the, the dude who made the YouTube video\n\n2:33:56.360 --> 2:34:03.160\n doesn't care how many times you hit pause and rewind, um, they're never going to like\n\n2:34:03.160 --> 2:34:07.320\n roll their eyes and, and be impatient with you.\n\n2:34:07.320 --> 2:34:15.760\n Um, and sometimes, uh, spending a huge amount of time on one video or one book, like making\n\n2:34:15.760 --> 2:34:21.320\n that the thing you just spent a huge amount of time on rereading, rereading, or rewatching,\n\n2:34:21.320 --> 2:34:30.160\n rewatching that, that somehow really, um, solidifies your love for that thing.\n\n2:34:30.160 --> 2:34:34.160\n And like the depth of understanding you start to gain and it's okay to stay with that.\n\n2:34:34.160 --> 2:34:39.120\n I used to think like, there's all these books out there, so like, I need to keep reading\n\n2:34:39.120 --> 2:34:40.120\n or keep reading.\n\n2:34:40.120 --> 2:34:48.480\n But then I realized, um, I think it was somewhere in college, uh, uh, where you could just spend\n\n2:34:48.480 --> 2:34:50.960\n your whole life with a single textbook.\n\n2:34:50.960 --> 2:34:55.080\n There's nothing in that textbook to really, really stay.\n\n2:34:55.080 --> 2:35:00.360\n Meisner, Thorne and Wheeler, Gravitation, you know, is, is one of those, or another one is,\n\n2:35:00.360 --> 2:35:06.160\n um, The Road to Reality by Roger Penrose, which is just incredibly deep and it starts\n\n2:35:06.160 --> 2:35:12.040\n with like two plus two equals four and it, at the end you're at the boundaries of, of\n\n2:35:12.040 --> 2:35:13.040\n physics.\n\n2:35:13.040 --> 2:35:17.600\n Uh, it's an amazing, amazing book.\n\n2:35:17.600 --> 2:35:19.720\n Let me ask you the big ridiculous question.\n\n2:35:19.720 --> 2:35:20.720\n Okay.\n\n2:35:20.720 --> 2:35:25.320\n You've pondered some big ridiculous questions in your work.\n\n2:35:25.320 --> 2:35:27.480\n What's the meaning of this whole thing?\n\n2:35:27.480 --> 2:35:28.480\n What's the meaning of life?\n\n2:35:28.480 --> 2:35:29.480\n Wow.\n\n2:35:29.480 --> 2:35:30.960\n Human life.\n\n2:35:30.960 --> 2:35:37.600\n Well, as far as I know, we're unique in the, the universe.\n\n2:35:37.600 --> 2:35:41.800\n There's no evidence that there's anything else in the universe that's as complicated\n\n2:35:41.800 --> 2:35:44.040\n as what's between our ears.\n\n2:35:44.040 --> 2:35:45.040\n Might be.\n\n2:35:45.040 --> 2:35:53.920\n I can't rule it out, but, um, so we appear to be pretty special and, um, so it's got\n\n2:35:53.920 --> 2:35:59.960\n to have something to do with that and one of the reasons I like David Deutsch, in particular\n\n2:35:59.960 --> 2:36:06.360\n his book, The Beginning of Infinity, um, is that he talks about the power of explanations\n\n2:36:06.360 --> 2:36:14.240\n and the fact that, um, most civilizations are static that they've got a set of dogmas\n\n2:36:14.240 --> 2:36:21.800\n that they arrive at somehow and they just pass those on from one, uh, generation to\n\n2:36:21.800 --> 2:36:24.520\n the next and nothing changes.\n\n2:36:24.520 --> 2:36:32.000\n But that huge changes have happened when people sort of follow whatever you want to call it,\n\n2:36:32.000 --> 2:36:38.280\n the scientific method or enlightenment, uh, there's different ways of thinking about it,\n\n2:36:38.280 --> 2:36:45.160\n but basically explanatory, it's, it's about the power of, of explanations and being able\n\n2:36:45.160 --> 2:36:52.440\n to figure out why things are the way they are and that has created changes in our, um,\n\n2:36:52.440 --> 2:36:58.620\n thinking and our way of life over the last few centuries that are explosive compared\n\n2:36:58.620 --> 2:37:05.740\n to anything that came before and David sort of verges on classifying this as like a force\n\n2:37:05.740 --> 2:37:10.760\n of nature in its potential transformative power.\n\n2:37:10.760 --> 2:37:17.720\n If we keep going, um, you know, we could, uh, you know, if we figure out how to colonize\n\n2:37:17.720 --> 2:37:25.080\n the universe like you were talking about earlier, how to spread to other star systems, um, then\n\n2:37:25.080 --> 2:37:29.520\n it is effectively a force of nature.\n\n2:37:29.520 --> 2:37:34.520\n This kind of drive to understand more and more and more, deeper and deeper and deeper\n\n2:37:34.520 --> 2:37:37.640\n and to engineer stuff so that we can understand even more.\n\n2:37:37.640 --> 2:37:38.640\n Yeah.\n\n2:37:38.640 --> 2:37:39.640\n Yeah.\n\n2:37:39.640 --> 2:37:43.960\n It's the, well, it's the old, the universe created us to understand itself.\n\n2:37:43.960 --> 2:37:46.920\n Maybe that's the, uh, the whole purpose.\n\n2:37:46.920 --> 2:37:47.920\n Yeah.\n\n2:37:47.920 --> 2:37:54.840\n It is an interesting peculiar side effect of the way we've been created is we seem to\n\n2:37:54.840 --> 2:37:56.080\n be conscious beings.\n\n2:37:56.080 --> 2:37:57.400\n We seem to have little egos.\n\n2:37:57.400 --> 2:38:01.360\n We seem to, uh, be born and die pretty quickly.\n\n2:38:01.360 --> 2:38:03.160\n There's a bunch of drama.\n\n2:38:03.160 --> 2:38:09.360\n We're all within ourselves pretty unique and we fall in love and start wars and there's\n\n2:38:09.360 --> 2:38:12.720\n hate and all the, the full interesting dynamic of it.\n\n2:38:12.720 --> 2:38:19.040\n So it's not just about the individual people, somehow like the concert that we played together.\n\n2:38:19.040 --> 2:38:20.040\n Yeah.\n\n2:38:20.040 --> 2:38:21.040\n Yeah.\n\n2:38:21.040 --> 2:38:22.040\n Yeah.\n\n2:38:22.040 --> 2:38:23.040\n So.\n\n2:38:23.040 --> 2:38:24.040\n That's kind of interesting.\n\n2:38:24.040 --> 2:38:28.200\n And there's a lot of peculiar aspects of that, that, um, I wonder if they're fundamental\n\n2:38:28.200 --> 2:38:33.560\n or just quirks of evolution, whether it's, whether it's death, whether it's love, whether\n\n2:38:33.560 --> 2:38:40.280\n all those things, I wonder if they're, um, from an engineer perspective when we're trying\n\n2:38:40.280 --> 2:38:47.560\n to create that intelligent toaster that listens for the, for the slam door and this, and the\n\n2:38:47.560 --> 2:38:54.960\n smell of burning toast, whether, uh, that toaster should be afraid of death and should\n\n2:38:54.960 --> 2:39:01.200\n fall in love just like we do, you know, you're a fascinating human being.\n\n2:39:01.200 --> 2:39:03.280\n You've impacted the lives of millions of people.\n\n2:39:03.280 --> 2:39:08.160\n It's a huge honor that you would spend your valuable time with me today.\n\n2:39:08.160 --> 2:39:09.160\n Thank you so much.\n\n2:39:09.160 --> 2:39:13.840\n Thank you for coming down to beautiful, hot Texas.\n\n2:39:13.840 --> 2:39:15.320\n And thank you for talking today.\n\n2:39:15.320 --> 2:39:19.080\n It was a pleasure and I'm glad I came and did it.\n\n2:39:19.080 --> 2:39:23.180\n Thanks for listening to this conversation with Neal Stephenson to support this podcast.\n\n2:39:23.180 --> 2:39:26.160\n Please check out our sponsors in the description.\n\n2:39:26.160 --> 2:39:31.280\n And now let me leave you with some words from Neal Stephenson himself in his novel, Snow\n\n2:39:31.280 --> 2:39:32.280\n Crash.\n\n2:39:32.280 --> 2:39:37.940\n The world is full of things more powerful than us, but if you know how to catch a ride,\n\n2:39:37.940 --> 2:39:40.240\n you can go places.\n\n2:39:40.240 --> 2:39:53.560\n Thanks for listening and hope to see you next time.\n\n"
}