{
  "title": "John Vervaeke: Meaning Crisis, Atheism, Religion & the Search for Wisdom | Lex Fridman Podcast #317",
  "id": "yImlXr5Tr8g",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.440\n The universe doesn't care about your personal narrative.\n\n00:04.440 --> 00:09.400\n You can just have met the person that is going to be the love of your life.\n\n00:09.400 --> 00:13.960\n It's the culmination of your whole project for happiness,\n\n00:13.960 --> 00:18.160\n and you step into the street and a truck hits you and you die.\n\n00:18.160 --> 00:19.360\n That's mortality.\n\n00:19.360 --> 00:22.720\n Mortality isn't just some far flung event.\n\n00:22.720 --> 00:29.320\n It's that every moment we are subject to fate in that way.\n\n00:29.320 --> 00:36.240\n So you can think of lots of little deaths you experience whenever all the projects\n\n00:36.240 --> 00:43.560\n and the plans you make come up against the fact that the universe can just roll over them.\n\n00:43.560 --> 00:46.280\n The following is a conversation with John Verweke,\n\n00:46.280 --> 00:50.200\n a psychologist and cognitive scientist at the University of Toronto.\n\n00:50.200 --> 00:55.760\n I highly recommend his lecture series called Awakening from the Meaning Crisis,\n\n00:55.760 --> 01:00.840\n which covers the history and future of humanity's search for meaning.\n\n01:00.840 --> 01:02.720\n This is the Lex Friedman podcast.\n\n01:02.720 --> 01:06.240\n To support it, please check out our sponsors in the description.\n\n01:06.240 --> 01:10.440\n And now, dear friends, here's John Verweke.\n\n01:10.440 --> 01:15.960\n You have an excellent 50 part lecture series online on the Meaning Crisis.\n\n01:15.960 --> 01:21.080\n And I think you describe in the modern times an increase in depression,\n\n01:21.080 --> 01:26.640\n loneliness, cynicism, and wait for it, bullshit.\n\n01:26.640 --> 01:30.680\n The term used technically by Harry Frankfurt and adopted by you.\n\n01:30.680 --> 01:33.840\n So let me ask, what is meaning?\n\n01:33.840 --> 01:40.200\n What are we looking for when we engage in the search for meaning?\n\n01:40.200 --> 01:43.600\n So when I'm talking about meaning, I'm talking about what's called meaning in life,\n\n01:43.600 --> 01:45.080\n not the meaning of life.\n\n01:45.080 --> 01:47.440\n That's some sort of metaphysical claim.\n\n01:47.440 --> 01:52.480\n Meaning in life are those factors that make people rate their lives as more meaningful,\n\n01:52.480 --> 01:55.920\n worth living, worth the suffering that they have to endure.\n\n01:55.920 --> 02:03.160\n And when you study that, what you see is it's a sense of connectedness,\n\n02:03.160 --> 02:07.240\n connectedness to yourself, to other people, to the world,\n\n02:07.240 --> 02:09.920\n and a particular kind of connectedness.\n\n02:09.920 --> 02:14.960\n You want to be connected to things that have a value and an existence\n\n02:14.960 --> 02:19.120\n independent of your egocentric preferences and concerns.\n\n02:19.120 --> 02:21.920\n This is why, for example, having a child is considered very meaningful,\n\n02:21.920 --> 02:26.040\n because you're connecting to something that's going to have a life and a value\n\n02:26.040 --> 02:29.000\n independent of you.\n\n02:29.000 --> 02:33.360\n Now, the question that comes up for me, well, there's two questions.\n\n02:33.360 --> 02:36.560\n One is, why is that at risk right now?\n\n02:36.560 --> 02:41.080\n And then secondly, and I think you have to answer the second question first,\n\n02:41.080 --> 02:44.040\n which is, well, yeah, but why is meaning so important?\n\n02:44.040 --> 02:46.600\n Why is this sense of connectedness so important to human beings?\n\n02:46.600 --> 02:51.040\n Why, when it is lacking, do they typically fall into depression,\n\n02:51.040 --> 02:55.120\n potentially mental illness, addiction, self destructive behavior?\n\n02:55.120 --> 02:59.480\n And so the first answer I give you is, well, it's that sense of connectedness.\n\n02:59.480 --> 03:01.160\n And people often express it metaphorically.\n\n03:01.160 --> 03:03.760\n They want to be connected to something larger than themselves.\n\n03:03.760 --> 03:05.120\n They want to matter.\n\n03:05.120 --> 03:06.640\n They don't mean it literally.\n\n03:06.640 --> 03:09.640\n I mean, if I chained you to a mountain, you wouldn't thereby say, oh,\n\n03:09.640 --> 03:12.040\n now my life is so fulfilling, right?\n\n03:12.040 --> 03:15.600\n So what they're trying to convey, they're using this metaphor to try and say,\n\n03:15.600 --> 03:17.240\n they want to be connected.\n\n03:17.240 --> 03:19.080\n They want to be connected to something real.\n\n03:19.080 --> 03:22.200\n They want to make a difference and matter to it.\n\n03:22.200 --> 03:27.480\n And one way of asking them, well, you know, what's meaningful is,\n\n03:27.480 --> 03:31.120\n tell me what you would like to continue to exist even if you weren't around\n\n03:31.120 --> 03:37.640\n anymore, and how are you connected to it, and how do you matter to it?\n\n03:37.640 --> 03:44.000\n That's one way of trying to get at what is the source of meaning for you,\n\n03:44.000 --> 03:49.920\n is if you were no longer there, you would like it to continue existing.\n\n03:49.920 --> 03:54.200\n That's not the only part of the definition probably, because there's probably many\n\n03:54.200 --> 04:01.320\n things that aren't a source of meaning for me that maybe I find beautiful\n\n04:01.320 --> 04:03.200\n that I would like to continue existing.\n\n04:03.200 --> 04:04.000\n Yes.\n\n04:04.000 --> 04:08.520\n If it contributes to your life being meaningful, you are connected to it\n\n04:08.520 --> 04:15.600\n in some way, and it matters to you, and you matter to it in that you make\n\n04:15.600 --> 04:16.840\n some difference to it.\n\n04:16.840 --> 04:20.040\n That's when it goes from being just sort of true, good, and beautiful,\n\n04:20.040 --> 04:23.120\n to being a source of meaning for you in your life.\n\n04:23.120 --> 04:27.400\n Is the meaning crisis a new thing, or has it always been with us?\n\n04:27.400 --> 04:30.120\n Is it part of the human condition in general?\n\n04:30.120 --> 04:31.600\n That's an excellent question.\n\n04:31.600 --> 04:35.160\n And part of the argument I made in Awakening from the Meaning Crisis is\n\n04:35.160 --> 04:37.640\n there's two aspects to it.\n\n04:37.640 --> 04:43.800\n One is that there are perennial problems, perennial threats to meaning.\n\n04:43.800 --> 04:47.760\n And in that sense, human beings are always vulnerable to despair.\n\n04:47.760 --> 04:52.960\n You know, the book of Ecclesiastes is, it's all vanity, it's all meaningless.\n\n04:52.960 --> 05:00.680\n But there's also historical forces that have made those perennial problems more\n\n05:00.680 --> 05:05.880\n pertinent, more pressing, more difficult for people to deal with.\n\n05:05.880 --> 05:10.880\n And so the meaning crisis is actually the intersection of perennial problems,\n\n05:10.880 --> 05:17.280\n finding existence absurd, experiencing existential anxiety, feeling alienated,\n\n05:17.280 --> 05:21.560\n and then pressing historical factors, which have to do with the loss of the\n\n05:21.560 --> 05:26.120\n resources that human beings have typically cross historically and cross\n\n05:26.120 --> 05:32.040\n culturally made use of in order to address these perennial problems.\n\n05:32.040 --> 05:39.520\n Is there something potentially deeper than just a lack of meaning that speaks\n\n05:39.520 --> 05:42.880\n to the fact that we're vulnerable to despair?\n\n05:42.880 --> 05:47.400\n You know, Ernest Becker talked about the, in his book Denial of Death,\n\n05:47.400 --> 05:52.480\n about the fear of death and being an important motivator in our life.\n\n05:52.480 --> 05:56.880\n As William James said, death is the warm at the core of the human condition.\n\n05:56.880 --> 06:06.240\n Is it possible that this kind of search for meaning is coupled or can be seen\n\n06:06.240 --> 06:15.480\n from the perspective of trying to escape the reality, the thought of one's own mortality?\n\n06:15.480 --> 06:19.040\n Yeah, Becker and the terror management theory that have come out of it,\n\n06:19.040 --> 06:26.600\n there's been some good work around sort of providing empirical support for that claim.\n\n06:26.600 --> 06:28.960\n Some of the work, not so good.\n\n06:28.960 --> 06:31.360\n So which aspects do you find convincing?\n\n06:31.360 --> 06:35.080\n Can you steel man that case and then can you argue against it?\n\n06:35.080 --> 06:42.600\n So what aspects I find convincing is that human finitude, being finite,\n\n06:42.600 --> 06:49.000\n being inherently limited is very problematic for us.\n\n06:49.000 --> 06:54.080\n Given the extensive use of the word problematic, I like that you used that word\n\n06:54.080 --> 06:57.240\n to describe one's own mortality as problematic.\n\n06:57.240 --> 07:01.760\n Because people sort of on Twitter use the word problematic when they disagree with somebody.\n\n07:01.760 --> 07:06.320\n But this, to me, seems to be the ultimate problematic aspect of the human condition\n\n07:06.320 --> 07:08.480\n is that we die and it ends.\n\n07:08.480 --> 07:14.360\n I think I'm not disagreeing with you, but I'm trying to get you to consider\n\n07:14.360 --> 07:16.760\n that your mortality is not an event in the future.\n\n07:16.760 --> 07:19.440\n It's a state you're in right now.\n\n07:19.440 --> 07:23.400\n That's what I'm trying to shift.\n\n07:23.400 --> 07:26.160\n So your mortality is just a...\n\n07:26.160 --> 07:30.280\n We talk about something that causes mortality fatal.\n\n07:30.280 --> 07:33.520\n But what we actually mean is it's full of fate.\n\n07:33.520 --> 07:36.520\n And I don't mean in the sense of things are prewritten.\n\n07:36.520 --> 07:44.400\n What I mean is the sense of the universe doesn't care about your personal narrative.\n\n07:44.400 --> 07:49.360\n You can just have met the person that is going to be the love of your life.\n\n07:49.360 --> 07:53.920\n It's the culmination of your whole project for happiness,\n\n07:53.920 --> 07:58.120\n and you step into the street and a truck hits you and you die.\n\n07:58.120 --> 07:59.320\n That's mortality.\n\n07:59.320 --> 08:02.680\n Mortality isn't just some far flung event.\n\n08:02.680 --> 08:09.280\n It's that every moment we are subject to fate in that way.\n\n08:09.280 --> 08:16.200\n So you can think of lots of little deaths you experience whenever all the projects\n\n08:16.200 --> 08:22.320\n and the plans you make come up against the fact that the universe can just roll over them.\n\n08:22.320 --> 08:28.760\n The death is the indifference of nature of the universe to your existence.\n\n08:28.760 --> 08:31.960\n And so in that sense, it is always here with us.\n\n08:31.960 --> 08:38.480\n Yeah, but you're vulnerable in so many ways other than just the ending of your biological life.\n\n08:38.480 --> 08:43.600\n Because it's interesting, if you rate what people fear most, death is not number one.\n\n08:43.600 --> 08:47.160\n They often put public speaking as number one.\n\n08:47.160 --> 08:54.120\n Because the death of status or reputation can also be a profound loss for human beings.\n\n08:54.120 --> 08:56.360\n It can drive them into despair.\n\n08:56.360 --> 09:00.360\n So as the terror management folks would say, as Ernest Becker would say,\n\n09:00.360 --> 09:06.000\n that a self report on a survey is not an accurate way to capture what is actually\n\n09:06.000 --> 09:08.360\n at the core of the motivation of a human being.\n\n09:08.360 --> 09:10.680\n That we could be terrified of death.\n\n09:10.680 --> 09:18.560\n And we, from childhood, since we realized the absurdity of the fact that the right ends,\n\n09:18.560 --> 09:26.560\n we've learned to really try to forget about it, try to construct illusions that allow us\n\n09:26.560 --> 09:32.120\n to escape momentarily or for prolonged periods of time the realization that we die.\n\n09:32.120 --> 09:37.920\n Okay, so first, I took it seriously, but now I want to say why there's some empirical work\n\n09:37.920 --> 09:39.760\n that makes me want to reconsider it.\n\n09:39.760 --> 09:45.840\n So terror management theory is you do things like you give people a list of words to read.\n\n09:45.840 --> 09:51.040\n And in those lists are words associated with death, cough, and funeral.\n\n09:51.040 --> 09:52.640\n And then you see what happens to people.\n\n09:52.640 --> 09:55.760\n And generally, they start to become more rigid in their thinking.\n\n09:55.760 --> 09:58.920\n They tend to identify with their worldview.\n\n09:58.920 --> 10:01.840\n They lose cognitive flexibility.\n\n10:01.840 --> 10:04.880\n That's if you present it to them in that third person perspective.\n\n10:04.880 --> 10:11.120\n But if you get them to go in the first person perspective and imagine that they're dying\n\n10:11.120 --> 10:17.760\n and that the people that they care about are there with them, they don't show those responses.\n\n10:17.760 --> 10:23.200\n In fact, they show us an increase in cognitive flexibility, an increase in openness.\n\n10:23.200 --> 10:27.160\n See, so I'm trying to say we might be putting the cart before the horse.\n\n10:27.160 --> 10:32.600\n It might not be death per se, but the kind of meaning that is present or absent in death\n\n10:32.600 --> 10:34.640\n that is the crucial thing for us.\n\n10:34.640 --> 10:37.400\n By the way, to push back, I don't think you took it seriously.\n\n10:37.400 --> 10:43.120\n I don't think you truly steel manned the case because you're saying that death is always\n\n10:43.120 --> 10:49.320\n present with us, yes, but isn't there a case to be made that it is one of the major motivators?\n\n10:49.320 --> 10:55.080\n Nietzsche, will to power, Freud wanting to have sex with your mother, all the different\n\n10:55.080 --> 10:58.600\n explanations of what is truly motivating us human beings.\n\n10:58.600 --> 11:06.520\n Isn't there a strong case to be made that this death thing is a really damn good, if\n\n11:06.520 --> 11:12.120\n not anything, a tool to motivate the behavior of humans?\n\n11:12.120 --> 11:18.360\n I'm not saying that the avoidance of death is not significant for human beings, but I'm\n\n11:18.360 --> 11:25.300\n proposing to you that human beings have a capacity for considering certain deaths meaningful\n\n11:25.300 --> 11:31.280\n and certain deaths meaningless, and we have lots of evidence that people are willing to\n\n11:31.280 --> 11:36.200\n sacrifice their biological existence for a death they consider meaningful.\n\n11:36.200 --> 11:40.400\n Are you personally afraid of your death if you think about it?\n\n11:40.400 --> 11:48.320\n As somebody who produces a lot of ideas, records them, writes them down, is a deep thinker,\n\n11:48.320 --> 11:55.800\n admired thinker, and as the years go on, become more and more admired, does it scare you that\n\n11:55.800 --> 11:56.800\n the ride ends?\n\n11:56.800 --> 11:57.800\n No.\n\n11:57.800 --> 12:00.600\n I mean, you have to talk to me on all my levels.\n\n12:00.600 --> 12:04.760\n I'm a biological organism, so if something's thrown at my head, I'll duck and things like\n\n12:04.760 --> 12:06.280\n that.\n\n12:06.280 --> 12:13.400\n But if you're asking me, do I long to live forever, no.\n\n12:13.400 --> 12:19.400\n In the Buddhist tradition, there are practices that are designed to make you aware of simultaneously\n\n12:19.400 --> 12:22.800\n the horror of mortality and the horror of immortality.\n\n12:22.800 --> 12:29.280\n The thought of living forever is actually horrific to me.\n\n12:29.280 --> 12:32.600\n Are those the only two options?\n\n12:32.600 --> 12:39.960\n Like when you're sitting with a loved one or watching a movie you just really love or\n\n12:39.960 --> 12:45.000\n a book you really love, you don't want it to end, you don't necessarily always flip\n\n12:45.000 --> 12:49.680\n it to the other aspect, the complete opposite of the thought experiment.\n\n12:49.680 --> 12:52.720\n What happens if the book lasts forever?\n\n12:52.720 --> 12:55.080\n There's got to be a middle ground, like the snooze button.\n\n12:55.080 --> 12:58.960\n Sure you don't want to sleep forever, but maybe press the snooze button and get an extra\n\n12:58.960 --> 13:01.040\n 15 minutes.\n\n13:01.040 --> 13:10.380\n There's surely some kind of balance, that fear seems to be a source of an intense appreciation\n\n13:10.380 --> 13:16.240\n of the moment, in part, and that's what the Stoics talked about, sort of the meditate\n\n13:16.240 --> 13:17.240\n on one's mortality.\n\n13:17.240 --> 13:18.240\n Sure.\n\n13:18.240 --> 13:26.560\n It seems to be a nice wake up call to that life is full of moments that are beautiful\n\n13:26.560 --> 13:29.160\n and then you don't get an infinite number of them.\n\n13:29.160 --> 13:34.560\n Right, and the Stoic response was not the project of trying to extend the duration of\n\n13:34.560 --> 13:42.880\n your life, but to deepen those moments so they become as satisfying as possible so that\n\n13:42.880 --> 13:46.880\n when death comes it does not strike you as any kind of calamity.\n\n13:46.880 --> 13:50.880\n Does that project ring true for your own personal feelings?\n\n13:50.880 --> 13:51.920\n I think so.\n\n13:51.920 --> 13:53.720\n Do you think about your mortality?\n\n13:53.720 --> 13:54.720\n I used to.\n\n13:54.720 --> 13:59.520\n I don't so much anymore.\n\n13:59.520 --> 14:05.400\n Part of it, as I'm older and your temporal horizon flips somewhere in your 30s or 40s,\n\n14:05.400 --> 14:09.120\n you don't live from your birth, you live towards your death.\n\n14:09.120 --> 14:13.220\n That's such a beautiful phrase, the temporal horizon flips.\n\n14:13.220 --> 14:14.900\n That's so true.\n\n14:14.900 --> 14:15.900\n That's so true.\n\n14:15.900 --> 14:18.880\n At what point is that?\n\n14:18.880 --> 14:25.840\n The point before which the world of opportunity and possibility is infinite before you.\n\n14:25.840 --> 14:27.400\n Yeah, it's like Peter Pan.\n\n14:27.400 --> 14:31.600\n There's all these golden possibilities and you fly around between them.\n\n14:31.600 --> 14:33.200\n Yes, very much.\n\n14:33.200 --> 14:39.800\n And then when it flips, you start to look for a different model, the Socratic, the Stoic\n\n14:39.800 --> 14:48.480\n model, Buddhism has also influenced me, which is more about, wait, when I look at my desires,\n\n14:48.480 --> 14:50.720\n I seem to have two meta desires.\n\n14:50.720 --> 14:56.080\n In addition to satisfying a particular desire, I want whatever satisfies my desire to be\n\n14:56.080 --> 15:03.920\n real and whatever is satisfying my desire to not cause internal conflict but bring something\n\n15:03.920 --> 15:05.560\n like peace of mind.\n\n15:05.560 --> 15:12.600\n And so I more and more move towards how can I live such that those two meta desires are\n\n15:12.600 --> 15:19.920\n a constant frame within which I'm trying to satisfy my specific desires.\n\n15:19.920 --> 15:22.080\n What do you think happens after we die?\n\n15:22.080 --> 15:28.960\n I think mind and life go away completely when we die.\n\n15:28.960 --> 15:37.600\n And I think that's actually significantly important for the kind of beings that we are.\n\n15:37.600 --> 15:44.240\n We are the kinds of beings that can come to that awareness and then we have a responsibility\n\n15:44.240 --> 15:48.440\n to decide how we're going to comport ourselves towards it.\n\n15:48.440 --> 15:52.500\n Can you linger on what that means, the mind goes away?\n\n15:52.500 --> 16:00.600\n Like when you're playing music and the last instrument is put down, the song is over.\n\n16:00.600 --> 16:02.360\n Doesn't mean the song wasn't beautiful.\n\n16:02.360 --> 16:04.480\n Doesn't mean the song wasn't complex.\n\n16:04.480 --> 16:09.600\n Doesn't mean the song didn't add to the value of the universe and its existence, but it\n\n16:09.600 --> 16:11.120\n came to an end.\n\n16:11.120 --> 16:18.680\n Is there some aspect in which some part of mind was there before the human and remains\n\n16:18.680 --> 16:20.200\n after?\n\n16:20.200 --> 16:26.320\n Something like panpsychism or is it too much for us limited cognitive beings to understand?\n\n16:26.320 --> 16:29.520\n Something like panpsychism, I take it seriously.\n\n16:29.520 --> 16:33.800\n I don't think it's a ridiculous proposal, but I think it has insoluble problems that\n\n16:33.800 --> 16:37.040\n make me doubt it.\n\n16:37.040 --> 16:45.520\n Any idea that the mind is some kind of ultimately immaterial substance also has for me just\n\n16:45.520 --> 16:46.600\n devastating problems.\n\n16:46.600 --> 16:51.960\n Those are the two kinds of framework that people usually propose in order to support\n\n16:51.960 --> 16:53.920\n some kind of idea of immortality.\n\n16:53.920 --> 16:56.320\n I find both very problematic.\n\n16:56.320 --> 17:02.160\n The fact that we participate in distributed cognition, that most of our problem solving\n\n17:02.160 --> 17:06.560\n is not done as individuals but in groups, this is something I work on, I've published\n\n17:06.560 --> 17:07.560\n on that.\n\n17:07.560 --> 17:09.600\n I think that's important.\n\n17:09.600 --> 17:15.560\n But most of the people who do work on systems of distributed cognition think that while\n\n17:15.560 --> 17:20.240\n there's such a thing as collective intelligence, there's no good evidence that there's collective\n\n17:20.240 --> 17:21.240\n consciousness.\n\n17:21.240 --> 17:25.960\n In fact, it's often called zombie agency for that reason.\n\n17:25.960 --> 17:32.200\n And so while I think it's very clear that no one person runs an airline, and there's\n\n17:32.200 --> 17:36.280\n a collective intelligence that solves that problem, I do not think that collective intelligence\n\n17:36.280 --> 17:38.840\n supports any kind of consciousness.\n\n17:38.840 --> 17:43.600\n And so therefore, I don't think the fact that I participate, which I regularly and\n\n17:43.600 --> 17:49.320\n reliably do in distributed cognition, gives me any reason to believe that that participation\n\n17:49.320 --> 17:51.280\n grounds some kind of consciousness.\n\n17:51.280 --> 17:54.640\n Okay, there's so many things to mention there.\n\n17:54.640 --> 17:59.840\n First of all, distributed cognition, maybe that's a synonym for collective intelligence.\n\n17:59.840 --> 18:08.400\n So that means a bunch of humans individually are able to think, have cognitive machines,\n\n18:08.400 --> 18:15.160\n and are somehow able to interact through the process of dialogue, as you talk about, to\n\n18:15.160 --> 18:20.320\n morph different ideas together, like this idea landscape together.\n\n18:20.320 --> 18:27.000\n It's so interesting to think about, okay, well, you do have these fascinating distributed\n\n18:27.000 --> 18:35.920\n cognition systems, but consciousness does not propagate in the same way as intelligence.\n\n18:35.920 --> 18:41.880\n But isn't there a case, if we just look at intelligence, if we look at us humans as a\n\n18:41.880 --> 18:50.280\n collection of smaller organisms, which we are, and so there's like a hierarchy of organisms,\n\n18:50.280 --> 18:57.440\n tiny ones, work together to form tiny villages that you can then start to see as individual\n\n18:57.440 --> 19:03.920\n organisms that are then also forming bigger villages and interacting different ways and\n\n19:03.920 --> 19:06.160\n function becomes more and more complex.\n\n19:06.160 --> 19:10.440\n And eventually we get to us humans to where we start to think, well, we're an individual,\n\n19:10.440 --> 19:11.720\n but really we're not.\n\n19:11.720 --> 19:18.600\n There's billions of organisms inside us, both domestic and foreign.\n\n19:18.600 --> 19:27.840\n So isn't that building up consciousnesses like turtles all the way up to us, our consciousness?\n\n19:27.840 --> 19:29.760\n Why does it have to stop with us humans?\n\n19:29.760 --> 19:38.680\n Are we the only, like, is this the phase transition when it becomes a zombie like giant hierarchical\n\n19:38.680 --> 19:44.860\n village that first like, oh, there's like a singing angels and it's consciousness is\n\n19:44.860 --> 19:47.540\n born in just us humans.\n\n19:47.540 --> 19:49.520\n Do bacteria have consciousness?\n\n19:49.520 --> 19:54.200\n Not bacteria, but maybe you could say bacteria does, but like the interesting complicated\n\n19:54.200 --> 19:57.480\n organisms that are within us have consciousness.\n\n19:57.480 --> 20:05.060\n I think it's proper to argue, and I have, that like a paramecium or bacteria has a kind\n\n20:05.060 --> 20:10.360\n of agency and even a kind of intelligence, kind of sense making ability.\n\n20:10.360 --> 20:15.880\n But I do not think that we can attribute consciousness, at least what we mean by consciousness, this\n\n20:15.880 --> 20:24.080\n kind of self awareness, this ability to introspect, et cetera, et cetera, to bacteria.\n\n20:24.080 --> 20:28.880\n Now the reason why distributed cognition doesn't have consciousness, I think is a little bit\n\n20:28.880 --> 20:31.760\n more tricky.\n\n20:31.760 --> 20:38.180\n And I think there's no reason in principle why there couldn't be a consciousness for\n\n20:38.180 --> 20:41.760\n distributed cognition, collective intelligence.\n\n20:41.760 --> 20:46.280\n In fact, many, you know, philosophers would agree with me on that point.\n\n20:46.280 --> 20:55.320\n I think it's more an issue of certain empirical facts, bandwidth, density of connection, speed\n\n20:55.320 --> 20:58.400\n of information transfer, et cetera.\n\n20:58.400 --> 21:04.040\n It's conceivable that if we got some horrible Frankensteinian neural link and we linked\n\n21:04.040 --> 21:10.840\n our brains and we had the right density and dynamics and bandwidth and speed that a group\n\n21:10.840 --> 21:12.600\n consciousness could take shape.\n\n21:12.600 --> 21:15.000\n I don't have any argument in principle against that.\n\n21:15.000 --> 21:20.880\n I'm just saying those contingent facts do not yet exist, and therefore it is implausible\n\n21:20.880 --> 21:24.240\n that consciousness exists at the level of collective intelligence.\n\n21:24.240 --> 21:26.560\n So you talk about consciousness quite a bit.\n\n21:26.560 --> 21:32.000\n So let's step back and try to sneak up to a definition.\n\n21:32.000 --> 21:33.520\n What is consciousness?\n\n21:33.520 --> 21:38.720\n For me, there are two aspects to answering that question.\n\n21:38.720 --> 21:40.920\n One is, what's the nature of consciousness?\n\n21:40.920 --> 21:46.480\n How does something like consciousness exist in an otherwise apparently nonconscious universe?\n\n21:46.480 --> 21:49.560\n And then there's a function question, which is equally important, which is, what does\n\n21:49.560 --> 21:52.200\n consciousness do?\n\n21:52.200 --> 21:57.240\n The first one is obviously, you know, problematic for most people, like, yeah, consciousness\n\n21:57.240 --> 22:02.000\n seems to be so different from the rest of the nonconscious universe.\n\n22:02.000 --> 22:07.340\n But I put it to you that the function question is also very hard, because you are clearly\n\n22:07.340 --> 22:15.360\n capable of very sophisticated, intelligent behavior without consciousness.\n\n22:15.360 --> 22:21.160\n You are turning the noises coming out of my face hole into ideas in your mind, and you\n\n22:21.160 --> 22:27.000\n have no conscious awareness of how that process is occurring.\n\n22:27.000 --> 22:29.680\n So why do we have consciousness at all?\n\n22:29.680 --> 22:31.880\n Now, here's the thing.\n\n22:31.880 --> 22:34.240\n There's an extra question you need to ask.\n\n22:34.240 --> 22:38.800\n Should we attempt to answer those questions separately, or should we attempt to answer\n\n22:38.800 --> 22:41.200\n them in an integrated fashion?\n\n22:41.200 --> 22:46.840\n I make the case that you actually have to answer them in an integrated fashion.\n\n22:46.840 --> 22:52.400\n What consciousness does, and what it is, we should be able to give it a unified answer\n\n22:52.400 --> 22:53.760\n to both of those.\n\n22:53.760 --> 23:02.120\n Can you try to elucidate the difference between what consciousness is and what it does, both\n\n23:02.120 --> 23:08.440\n of which are mysteries, as you say, state versus action?\n\n23:08.440 --> 23:13.040\n Can you try to explain the difference that's interesting, that's useful, that's important\n\n23:13.040 --> 23:14.040\n to understand?\n\n23:14.040 --> 23:18.220\n So that's putting me in a bit of a difficult position, because I actually argue that trying\n\n23:18.220 --> 23:22.680\n to answer them separately is ultimately incoherent.\n\n23:22.680 --> 23:28.800\n But what I can point to are many published articles in which only one of these problems\n\n23:28.800 --> 23:31.280\n is addressed, and the other is left unaddressed.\n\n23:31.280 --> 23:35.880\n So people will try and explain what qualia are, how they potentially emerge, without\n\n23:35.880 --> 23:41.400\n saying what do they do, what problems do they help to solve, how do they make the organism\n\n23:41.400 --> 23:42.400\n more adaptive.\n\n23:42.400 --> 23:45.600\n And then you'll have other people who will say, no, no, this is what the function of\n\n23:45.600 --> 23:50.240\n consciousness is, but I don't know, I can't tell you, I can't solve the hard problem,\n\n23:50.240 --> 23:52.520\n I don't know how qualia exist.\n\n23:52.520 --> 23:58.240\n So what I'm saying is many people treat these problems separately, although I think that's\n\n23:58.240 --> 24:02.200\n ultimately an incoherent way to approach the problem.\n\n24:02.200 --> 24:05.520\n So the hard problem is focusing on what it is.\n\n24:05.520 --> 24:06.520\n Yes.\n\n24:06.520 --> 24:10.920\n So the qualia, that it feels like something to experience a thing, that's what consciousness\n\n24:10.920 --> 24:11.920\n is.\n\n24:11.920 --> 24:18.840\n And does is more about the functional usefulness of the thing, to the whole beautiful mix of\n\n24:18.840 --> 24:24.160\n cognition and just function in everyday life.\n\n24:24.160 --> 24:34.240\n Okay, you've also said that you can do very intelligent things without consciousness.\n\n24:34.240 --> 24:35.800\n Yes, clearly.\n\n24:35.800 --> 24:38.800\n Is that obvious to you?\n\n24:38.800 --> 24:39.880\n Yes.\n\n24:39.880 --> 24:43.360\n I don't know what I'm doing to access my memory.\n\n24:43.360 --> 24:50.900\n It just comes up, and it comes up really intelligently.\n\n24:50.900 --> 24:55.600\n But the mechanisms that create consciousness could be deeply interlinked with whatever\n\n24:55.600 --> 25:00.040\n is doing the memory access, that's doing the...\n\n25:00.040 --> 25:02.840\n Oh, I think so, in fact, yes, yes.\n\n25:02.840 --> 25:08.960\n So I guess what I'm trying to say in this will probably sneak up to this question a\n\n25:08.960 --> 25:18.280\n few times, which is whether we can build machines that are conscious, or machines that are intelligent,\n\n25:18.280 --> 25:21.600\n one level intelligent or beyond, without building the consciousness.\n\n25:21.600 --> 25:26.760\n I mean, ultimately, that's one of the ways to understand what consciousness is, is to\n\n25:26.760 --> 25:28.600\n build the thing.\n\n25:28.600 --> 25:33.960\n We can either sort of from the Chomsky way, try to construct models, like he thinks about\n\n25:33.960 --> 25:37.960\n language in this way, try to construct models and theories of how the thing works, or we\n\n25:37.960 --> 25:39.960\n can just build the damn thing.\n\n25:39.960 --> 25:40.960\n Exactly.\n\n25:40.960 --> 25:45.320\n And that's a methodological principle in cognitive science.\n\n25:45.320 --> 25:53.600\n In fact, one of the things that sort of distinguishes cognitive science from other disciplines dealing\n\n25:53.600 --> 25:59.580\n with the nature of cognition in the mind is that cognitive science takes the design stance.\n\n25:59.580 --> 26:06.480\n It asks, well, could we build a machine that would not only simulate it, but serve as a\n\n26:06.480 --> 26:09.400\n bona fide explanation of the phenomenon?\n\n26:09.400 --> 26:15.440\n Do you find any efforts in cognitive science compelling in this direction?\n\n26:15.440 --> 26:21.880\n In terms of how far we are, there's, on the computational side of things, something called\n\n26:21.880 --> 26:26.620\n cognitive modeling, there's all these kinds of packages that you can construct simplified\n\n26:26.620 --> 26:32.680\n models of how the brain does things and see if complex behaviors emerge.\n\n26:32.680 --> 26:38.480\n Do you find any efforts in cognitive, or what efforts in cognitive science do you find most\n\n26:38.480 --> 26:41.300\n inspiring and productive?\n\n26:41.300 --> 26:47.860\n I think the project of trying to create AGI, artificial general intelligence, is where\n\n26:47.860 --> 26:53.400\n I place my hope of artificial intelligence being of scientific significance.\n\n26:53.400 --> 27:01.080\n This is independent of technological socioeconomic significance, which is already well established.\n\n27:01.080 --> 27:08.120\n But being able to say because of the work in AI, we now have a good theory of cognition,\n\n27:08.120 --> 27:13.920\n intelligence, perhaps consciousness, I think that's where I place my bets is in the current\n\n27:13.920 --> 27:17.340\n endeavors around artificial general intelligence.\n\n27:17.340 --> 27:25.120\n And so tackling that problem head on, which has now become central, at least to a group\n\n27:25.120 --> 27:31.800\n of cognitive scientists, is I think what needs to be done.\n\n27:31.800 --> 27:37.080\n And when you think about AGI, do you think about systems that have consciousness?\n\n27:37.080 --> 27:44.160\n Let's go back to what I think is at the core of your general intelligence.\n\n27:44.160 --> 27:49.420\n So right now, compared to even our best machines, you are a general problem solver.\n\n27:49.420 --> 27:53.280\n You can solve a wide variety of problems in a wide variety of domains.\n\n27:53.280 --> 27:56.220\n And some of our best machines have a little bit of transfer.\n\n27:56.220 --> 28:01.080\n They can learn this game and play a few other well designed rule bound games, but they couldn't\n\n28:01.080 --> 28:05.460\n learn how to swim, etc., things like that.\n\n28:05.460 --> 28:12.240\n And so what's interesting is what seems to come up, and this is some of my published\n\n28:12.240 --> 28:20.080\n work, in all these different domains of cognition across all these different problem types is\n\n28:20.080 --> 28:22.120\n a central problem.\n\n28:22.120 --> 28:26.380\n And since we do have good sort of psychometric evidence that we do have some general ability\n\n28:26.380 --> 28:32.060\n that's a significant component of our intelligence, I made an argument as to what I think that\n\n28:32.060 --> 28:35.480\n general ability is.\n\n28:35.480 --> 28:39.800\n And so it's happening right now.\n\n28:39.800 --> 28:43.760\n The amount of information in this room that you could actually pay attention to is combinatorial\n\n28:43.760 --> 28:46.180\n explosive.\n\n28:46.180 --> 28:49.520\n The amount of information you have in your memory, long term memory, and all the ways\n\n28:49.520 --> 28:54.200\n you could combine it, combinatorial explosive.\n\n28:54.200 --> 28:58.040\n The number of possibilities you can consider, also combinatorial explosive.\n\n28:58.040 --> 29:03.040\n The sequences of behavior you can generate, also combinatorial explosive.\n\n29:03.040 --> 29:06.680\n And yet somehow you're zeroing in.\n\n29:06.680 --> 29:10.320\n The right memories are coming up, the right possibilities are opening up, the right sequences\n\n29:10.320 --> 29:12.880\n of behavior, you're paying attention to the right thing.\n\n29:12.880 --> 29:20.280\n Not infallibly so, but so much so that you reliably find obvious what you should interact\n\n29:20.280 --> 29:23.280\n with in order to solve the problem at hand.\n\n29:23.280 --> 29:30.720\n That's an ability that is still not well understood within AGI.\n\n29:30.720 --> 29:35.720\n To filtering out the gigantic waterfall of data.\n\n29:35.720 --> 29:36.720\n Right.\n\n29:36.720 --> 29:37.720\n It's almost like a Zen Koan.\n\n29:37.720 --> 29:44.960\n What makes you intelligent is your ability to ignore so much information and do it in\n\n29:44.960 --> 29:53.240\n such a way that is somewhere between arbitrary guessing and algorithmic search.\n\n29:53.240 --> 30:00.280\n And to a fault sometimes of course that you, based on the models you construct, you forget,\n\n30:00.280 --> 30:03.560\n you ignore things that you should probably not ignore.\n\n30:03.560 --> 30:10.120\n And that, hopefully we can circle back to it Lux, is related to the meaning issue.\n\n30:10.120 --> 30:16.600\n Because the very processes that make us adaptively intelligent make us perennially susceptible\n\n30:16.600 --> 30:22.840\n to self deceptive, self destructive behavior because of the way we misframe the environment\n\n30:22.840 --> 30:24.400\n in fundamental ways.\n\n30:24.400 --> 30:38.200\n So to you, meaning is also connected to ideas of wisdom and truth and how we interpret and\n\n30:38.200 --> 30:42.320\n understand and interact intellectually with the environment.\n\n30:42.320 --> 30:43.320\n Yes.\n\n30:43.320 --> 30:45.120\n So what is wisdom?\n\n30:45.120 --> 30:46.920\n Why do we long for it?\n\n30:46.920 --> 30:49.000\n How do we and where do we find it?\n\n30:49.000 --> 30:50.040\n What is it?\n\n30:50.040 --> 30:56.120\n This is what you use to solve your problems, as I was just describing.\n\n30:56.120 --> 31:01.860\n Rationality is how you use your intelligence to overcome the problems of self deception\n\n31:01.860 --> 31:04.340\n that emerge when you're trying to solve your problems.\n\n31:04.340 --> 31:06.440\n So it's that meta problem.\n\n31:06.440 --> 31:12.080\n And then the issue is, do you have just one kind of knowing?\n\n31:12.080 --> 31:18.220\n I think you have multiple ways of knowing, and therefore you have multiple rationalities.\n\n31:18.220 --> 31:23.500\n And so wisdom is to coordinate those rationalities so that they are optimally constraining and\n\n31:23.500 --> 31:25.500\n affording each other.\n\n31:25.500 --> 31:30.120\n So in that way, wisdom is rationally self transcending rationality.\n\n31:30.120 --> 31:31.360\n Right.\n\n31:31.360 --> 31:40.280\n So life is a kind of process where you jump from rationality to rationality and pick up\n\n31:40.280 --> 31:44.160\n a village of rationalities along the way that then turns into wisdom.\n\n31:44.160 --> 31:46.360\n Yes, if properly coordinated.\n\n31:46.360 --> 31:47.720\n You mentioned framing.\n\n31:47.720 --> 31:48.760\n Yes.\n\n31:48.760 --> 31:52.720\n So what is framing?\n\n31:52.720 --> 31:58.680\n Is it a set of assumptions you bring to the table in how you see the world, how you reason\n\n31:58.680 --> 32:03.680\n about the world, how you understand the world?\n\n32:03.680 --> 32:06.280\n So it depends what you mean by assumptions.\n\n32:06.280 --> 32:12.920\n If by assumption you mean a proposition, representational or rule, I think that's much more downstream\n\n32:12.920 --> 32:14.640\n from relevance realization.\n\n32:14.640 --> 32:25.240\n I think relevance realization refers to, again, constraints on how you are paying attention.\n\n32:25.240 --> 32:32.760\n And so for me, talking about framing is talking about this process you're doing right now\n\n32:32.760 --> 32:35.400\n of salient landscaping.\n\n32:35.400 --> 32:37.780\n What's salient to you?\n\n32:37.780 --> 32:44.520\n And how is what's salient constantly shifting in a sort of a dynamic tapestry?\n\n32:44.520 --> 32:52.060\n And how are you shaping yourself to the way that salient landscaping is aspectualizing\n\n32:52.060 --> 32:55.960\n the world, shaping it into aspects for interaction?\n\n32:55.960 --> 33:02.640\n For me, that is a much more primordial process than any sort of beliefs we have.\n\n33:02.640 --> 33:04.860\n And here's why.\n\n33:04.860 --> 33:14.500\n If we mean by beliefs a representational proposition, then we're in this very problematic position.\n\n33:14.500 --> 33:19.200\n Because then we're trying to say that propositions are ultimately responsible for how we do relevance\n\n33:19.200 --> 33:21.320\n realization.\n\n33:21.320 --> 33:26.200\n And that's problematic because representations presuppose relevance realization.\n\n33:26.200 --> 33:30.660\n So I represent this as a cup.\n\n33:30.660 --> 33:34.840\n The number of properties it actually has, and that I even have epistemic access to,\n\n33:34.840 --> 33:36.600\n is combinatorial explosive.\n\n33:36.600 --> 33:42.480\n I select from those a subset and how they are relevant to each other insofar as they\n\n33:42.480 --> 33:43.640\n are relevant for me.\n\n33:43.640 --> 33:44.800\n This doesn't have to be a cup.\n\n33:44.800 --> 33:50.020\n I could be using it as a hat, I could use it to stand for the letter V, all kinds of\n\n33:50.020 --> 33:51.020\n different things.\n\n33:51.020 --> 33:57.200\n I could say this was the 10th billion object made in North America.\n\n33:57.200 --> 34:00.160\n Representations presuppose relevance realization.\n\n34:00.160 --> 34:06.860\n They are therefore dependent on it, which means relevance realization isn't bound to\n\n34:06.860 --> 34:09.120\n our representational structures.\n\n34:09.120 --> 34:14.720\n It can be influenced by them, but they are ultimately dependent on relevance realization.\n\n34:14.720 --> 34:17.000\n Let's define stuff.\n\n34:17.000 --> 34:18.000\n Relevance realization.\n\n34:18.000 --> 34:19.000\n Yes.\n\n34:19.000 --> 34:21.360\n What are the inputs and the outputs of this thing?\n\n34:21.360 --> 34:22.360\n What is it?\n\n34:22.360 --> 34:23.360\n What are we talking about?\n\n34:23.360 --> 34:31.840\n What we're talking about is how you are doing something very analogous to evolution.\n\n34:31.840 --> 34:38.000\n So if you think about that adaptivity isn't in the organism or in the environment, but\n\n34:38.000 --> 34:42.000\n in a dynamical relation and then what does evolution do?\n\n34:42.000 --> 34:47.000\n It creates variation and then it puts selective pressure and what that does is that changes\n\n34:47.000 --> 34:49.640\n the niche constructions that are available to a species.\n\n34:49.640 --> 34:52.020\n It changes the morphology.\n\n34:52.020 --> 34:54.040\n You also have a loop.\n\n34:54.040 --> 34:59.700\n It's your sensory motor loop and what's constantly happening is there are processes within you\n\n34:59.700 --> 35:04.720\n that are opening up variation and also processes that are putting selection on it and you're\n\n35:04.720 --> 35:07.600\n constantly evolving that sensory motor loop.\n\n35:07.600 --> 35:13.480\n So you might call your cognitive fittedness, which is how you're framing the world is constantly\n\n35:13.480 --> 35:14.480\n evolving and changing.\n\n35:14.480 --> 35:17.320\n I can give you two clear examples of that.\n\n35:17.320 --> 35:22.440\n One, your autonomic nervous system, parasympathetic and sympathetic.\n\n35:22.440 --> 35:28.560\n The sympathetic system is biased to trying to interpret as much of reality as threat\n\n35:28.560 --> 35:30.160\n or opportunity.\n\n35:30.160 --> 35:37.160\n The parasympathetic is biased to trying to interpret as much of the environment as safe\n\n35:37.160 --> 35:40.520\n and relaxing and they are constantly doing opponent processing.\n\n35:40.520 --> 35:47.000\n There's no little man in you calculating your level of arousal.\n\n35:47.000 --> 35:51.840\n There's this dynamic coupling opponent processing between them that is constantly evolving your\n\n35:51.840 --> 35:52.840\n arousal.\n\n35:52.840 --> 35:57.320\n Similarly, your attention, you have the default mode network, task network.\n\n35:57.320 --> 36:02.760\n The default mode network is putting pressure on you right now to mind wander, to go off,\n\n36:02.760 --> 36:07.980\n to drift, right, and then the task focus network is selecting out of those possibilities the\n\n36:07.980 --> 36:13.840\n ones that will survive and go into and so you are constantly evolving your attention.\n\n36:13.840 --> 36:19.380\n Okay, so there's a natural selection of ideas that a bunch of systems within you are generating\n\n36:19.380 --> 36:22.460\n and then you use the natural selection.\n\n36:22.460 --> 36:27.020\n What is the selector, the object that you're interacting with, the glass?\n\n36:27.020 --> 36:31.520\n Relevance realization, once again, you just describe how it happens.\n\n36:31.520 --> 36:32.520\n Yes.\n\n36:32.520 --> 36:34.840\n You didn't describe what the hell it is.\n\n36:34.840 --> 36:36.400\n So what's the goal?\n\n36:36.400 --> 36:37.400\n What are we talking about?\n\n36:37.400 --> 36:45.160\n So relevance realization is how you interact with things in the world to make sense of\n\n36:45.160 --> 36:48.040\n why they matter, what they mean to you, to your life.\n\n36:48.040 --> 36:51.120\n Yes, and notice the language you just used, you're starting to use the meaning in life\n\n36:51.120 --> 36:52.120\n language.\n\n36:52.120 --> 36:53.120\n Good or bad?\n\n36:53.120 --> 36:54.120\n That's good.\n\n36:54.120 --> 36:55.120\n Okay.\n\n36:55.120 --> 36:56.120\n That's good.\n\n36:56.120 --> 37:02.800\n So what does that evolution of your sensory motor loop do?\n\n37:02.800 --> 37:08.640\n It gives you, and here I'll use a term from Marlon Ponti, it gives you an optimal grip\n\n37:08.640 --> 37:11.300\n on the world.\n\n37:11.300 --> 37:14.120\n So let's use your visual attention again.\n\n37:14.120 --> 37:17.500\n Okay, here's an object.\n\n37:17.500 --> 37:20.280\n How close should I be to it?\n\n37:20.280 --> 37:21.280\n Is there a right?\n\n37:21.280 --> 37:23.280\n That's what you want to do with it.\n\n37:23.280 --> 37:24.280\n Exactly.\n\n37:24.280 --> 37:25.280\n Exactly.\n\n37:25.280 --> 37:32.200\n So you have to evolve your sensory motor loop in order to get the optimal grip that actually\n\n37:32.200 --> 37:35.800\n creates the affordance of you getting to a goal that you're trying to get to.\n\n37:35.800 --> 37:44.120\n Yeah, but you're describing physical goals of manipulating objects, so this applies,\n\n37:44.120 --> 37:49.960\n the task, the process of relevance realization is not just about getting a glass of water\n\n37:49.960 --> 37:50.960\n and taking a drink.\n\n37:50.960 --> 37:51.960\n No.\n\n37:51.960 --> 37:54.280\n It's about falling in love.\n\n37:54.280 --> 37:56.080\n Yeah, of course.\n\n37:56.080 --> 37:57.080\n What else is there?\n\n37:57.080 --> 37:58.080\n Well, there's obvious.\n\n37:58.080 --> 38:01.840\n Between those two options.\n\n38:01.840 --> 38:06.480\n I can show you how you're optimally gripping in an abstract cognitive domain.\n\n38:06.480 --> 38:07.800\n Okay?\n\n38:07.800 --> 38:13.160\n So a mammal goes by and most people will say there's a dog.\n\n38:13.160 --> 38:18.360\n Now why don't they say, they might, but typically, you know, probabilistically they'll say there's\n\n38:18.360 --> 38:19.360\n a dog.\n\n38:19.360 --> 38:23.560\n They could say there's a German Shepherd, there's a mammal, there's a living organism,\n\n38:23.560 --> 38:25.360\n there's a police dog.\n\n38:25.360 --> 38:26.360\n Why that?\n\n38:26.360 --> 38:27.360\n Why there?\n\n38:27.360 --> 38:30.760\n Why did they stop Eleanor Rush called these basic level?\n\n38:30.760 --> 38:35.200\n Well, what you find is that's an optimal grip because it's getting you the best overall\n\n38:35.200 --> 38:41.300\n balance between similarity within your category and difference between the other categories.\n\n38:41.300 --> 38:46.740\n It's allowing you to properly fit to that object in so far as you're setting yourself\n\n38:46.740 --> 38:52.680\n up to, well, I'm getting so as many of the similarities and differences I can on balance\n\n38:52.680 --> 38:56.960\n because they're in a trade off relationship that I need in order to probably interact\n\n38:56.960 --> 38:59.240\n with this mammal.\n\n38:59.240 --> 39:01.440\n That's optimal grip, not right.\n\n39:01.440 --> 39:04.560\n It's at the level of your categorization.\n\n39:04.560 --> 39:13.240\n You evolve these models of the world around you and on top of them, you do stuff like\n\n39:13.240 --> 39:16.720\n you build representations, like you said, yes.\n\n39:16.720 --> 39:19.080\n What's the salience landscape?\n\n39:19.080 --> 39:23.560\n Salience meaning attention landscape.\n\n39:23.560 --> 39:30.280\n Salience is what grabs your attention or what results from you directing your attention.\n\n39:30.280 --> 39:34.320\n I clap my hands, that's salient, it grabs your attention.\n\n39:34.320 --> 39:39.800\n Your attention is drawn to it, that's bottom up, but I can also say you left big toe and\n\n39:39.800 --> 39:42.720\n now it's salient to you because you directed your attention towards it.\n\n39:42.720 --> 39:47.440\n That's top down and again, opponent processing going on there.\n\n39:47.440 --> 39:52.120\n Whatever stands out to you, what grabs your attention, what arouses you, what triggers\n\n39:52.120 --> 39:57.320\n at least momentarily some affect towards it, that's how things are salient.\n\n39:57.320 --> 40:02.760\n What salience I would argue is, is how a lot of unconscious relevance realization makes\n\n40:02.760 --> 40:07.640\n information relevant to working memory.\n\n40:07.640 --> 40:13.360\n That's when it now becomes online for direct sensory motor interaction with the world.\n\n40:13.360 --> 40:19.320\n So you think the salience landscape, the ocean of salience extends into the subconscious\n\n40:19.320 --> 40:21.040\n mind?\n\n40:21.040 --> 40:27.520\n I think relevance does, but I think when relevance is recursively processed, relevance realization\n\n40:27.520 --> 40:35.440\n such that it passes through sort of this higher filter of working memory and has these properties\n\n40:35.440 --> 40:41.400\n of being globally accessible and globally broadcast, then it becomes the thing we call\n\n40:41.400 --> 40:42.400\n salience.\n\n40:42.400 --> 40:44.280\n And that's, that's, that's really good evidence.\n\n40:44.280 --> 40:49.400\n There's really good evidence from my colleague at UFT, University of Toronto, Lynn Hasher,\n\n40:49.400 --> 40:50.880\n that that's what working memory is.\n\n40:50.880 --> 40:52.960\n It's a higher order relevance filter.\n\n40:52.960 --> 40:57.680\n That's why things like chunking will get way more information through working memory because\n\n40:57.680 --> 41:04.280\n it's basically making, it's basically monitoring how much relevance realization has gone into\n\n41:04.280 --> 41:06.040\n this information.\n\n41:06.040 --> 41:09.240\n Usually you have to do an additional kind of recursive processing.\n\n41:09.240 --> 41:13.400\n And that tells you, by the way, when do you need consciousness?\n\n41:13.400 --> 41:18.960\n When do you need that working memory and that salience landscaping?\n\n41:18.960 --> 41:24.000\n It's when you're facing situations that are highly novel, highly complex and very ill\n\n41:24.000 --> 41:27.720\n defined that require you to engage working memory.\n\n41:27.720 --> 41:29.320\n Okay, got it.\n\n41:29.320 --> 41:34.520\n So relevance realization is in part the thing that constructs that basic level thing of\n\n41:34.520 --> 41:35.640\n a dog.\n\n41:35.640 --> 41:41.640\n When you see it, when you see a dog, you call it a dog, not a German Shepherd, not a mammal,\n\n41:41.640 --> 41:44.120\n not a biological meat bag.\n\n41:44.120 --> 41:45.720\n It's a dog.\n\n41:45.720 --> 41:46.720\n Wisdom.\n\n41:46.720 --> 41:47.720\n Yes.\n\n41:47.720 --> 41:50.060\n So what is wisdom?\n\n41:50.060 --> 41:57.600\n If we return, I think as part of that, we got to relevance realization and then wisdom\n\n41:57.600 --> 42:02.920\n is accumulation of rationalities.\n\n42:02.920 --> 42:09.240\n You described the rationality as a kind of starting from intelligence, much of puzzle\n\n42:09.240 --> 42:14.360\n solving and then rationalities like the meta problem of puzzle solving and then what wisdom\n\n42:14.360 --> 42:16.840\n is the meta, meta problem of puzzle solving?\n\n42:16.840 --> 42:23.000\n Yes, in the sense that the meta problem you have when you're solving your puzzles is that\n\n42:23.000 --> 42:25.840\n you can often fall into self deception.\n\n42:25.840 --> 42:26.840\n You can misprint.\n\n42:26.840 --> 42:27.840\n Self deception, right.\n\n42:27.840 --> 42:28.840\n Right.\n\n42:28.840 --> 42:35.440\n So knowledge overcomes ignorance, wisdom is about overcoming foolishness if what we mean\n\n42:35.440 --> 42:40.760\n by foolishness is self deceptive, self destructive behavior, which I think is a good definition\n\n42:40.760 --> 42:42.780\n of foolishness.\n\n42:42.780 --> 42:49.720\n And so what you're doing is you're doing this recursive relevance realization.\n\n42:49.720 --> 42:53.640\n You're using your intelligence to improve the use of your intelligence and then you're\n\n42:53.640 --> 42:57.520\n using your rationality to improve the use of your rationality.\n\n42:57.520 --> 43:01.360\n That's that recursive relevance realization I was talking about a few minutes ago.\n\n43:01.360 --> 43:03.260\n Think about a wise person.\n\n43:03.260 --> 43:09.800\n They come into highly often messy, ill defined, complex situations usually where there's some\n\n43:09.800 --> 43:13.080\n significant novelty and what can they do?\n\n43:13.080 --> 43:19.000\n They can zero in on what really matters, what's relevant and then they can shape themselves,\n\n43:19.000 --> 43:26.640\n salience landscaping to intervene most appropriately to that situation as they have framed it.\n\n43:26.640 --> 43:30.800\n That's what we mean by a wise person and that's how it follows out of the model I've been\n\n43:30.800 --> 43:31.800\n presenting to you.\n\n43:31.800 --> 43:37.400\n So when we say self deception, I mean part of that implies that it's intentional.\n\n43:37.400 --> 43:45.240\n Part of the mechanism of cognition, you're modifying what you should know for some purpose.\n\n43:45.240 --> 43:48.160\n Is that how you see the word self deception?\n\n43:48.160 --> 43:53.320\n No, because I belong to a group of people that think the model of self deception as\n\n43:53.320 --> 43:58.000\n lying to oneself ultimately makes no sense.\n\n43:58.000 --> 44:02.280\n Because in order to lie to you, I have to know something you don't and I have to depend\n\n44:02.280 --> 44:06.720\n on your commitment to the truth in order to modify your behavior.\n\n44:06.720 --> 44:09.840\n I don't think that's what we do to ourselves.\n\n44:09.840 --> 44:13.800\n I think, and I'm going to use it in the technical term and thank you for making space for that\n\n44:13.800 --> 44:21.900\n earlier on, I think we can bullshit ourselves, which is a very different thing than lying.\n\n44:21.900 --> 44:27.040\n So what is bullshit and how do we bullshit ourselves, technically speaking?\n\n44:27.040 --> 44:28.040\n Yeah.\n\n44:28.040 --> 44:32.480\n Frankfurt and this is inspired by Frankfurt and other people's work based on Frankfurt's\n\n44:32.480 --> 44:33.480\n work.\n\n44:33.480 --> 44:34.480\n On bullshit.\n\n44:34.480 --> 44:35.480\n Yeah.\n\n44:35.480 --> 44:36.480\n Classic essay.\n\n44:36.480 --> 44:37.480\n It's a pretty good title.\n\n44:37.480 --> 44:39.040\n I think it's one of the best things he wrote.\n\n44:39.040 --> 44:40.560\n He wrote a lot of good things.\n\n44:40.560 --> 44:42.000\n The title or the essay?\n\n44:42.000 --> 44:43.000\n The essay.\n\n44:43.000 --> 44:44.720\n The title's good too.\n\n44:44.720 --> 44:49.780\n It's always an icebreaker in certain academic settings.\n\n44:49.780 --> 44:54.360\n So let's contrast the bullshit artist from the liar.\n\n44:54.360 --> 44:59.080\n The liar depends on your commitment to the truth.\n\n44:59.080 --> 45:04.600\n The bullshit artist is actually trying to make you indifferent to the question of truth\n\n45:04.600 --> 45:11.360\n and modify your behavior by making things salient to you so that they are catchy to\n\n45:11.360 --> 45:12.840\n you.\n\n45:12.840 --> 45:21.400\n So a prototypical example of bullshit is a commercial, a television commercial.\n\n45:21.400 --> 45:29.160\n You watch these people at a bar getting some particular kind of alcohol and they're gorgeous\n\n45:29.160 --> 45:34.340\n and they're laughing and they're smiling and they're clear eyed.\n\n45:34.340 --> 45:39.820\n You know that's not true and they know you know it's not true, but here's the point.\n\n45:39.820 --> 45:45.680\n You don't care because there's gorgeous people smiling and they're happy and that's salient\n\n45:45.680 --> 45:47.640\n to you and that catches your attention.\n\n45:47.640 --> 45:53.200\n And so you know, go into a bar, you know that won't happen when you drink this alcohol,\n\n45:53.200 --> 45:54.200\n you know it.\n\n45:54.200 --> 45:55.200\n Yeah.\n\n45:55.200 --> 45:59.200\n But you buy the product because it was made salient to you.\n\n45:59.200 --> 46:03.080\n Now you can't lie to yourself, Lex.\n\n46:03.080 --> 46:06.560\n Salience can catch attention, but attention can drive salience.\n\n46:06.560 --> 46:08.120\n So this is what I can do.\n\n46:08.120 --> 46:15.080\n I can make something salient by paying attention to it and then that will tend to draw me back\n\n46:15.080 --> 46:20.080\n to it again, which, and you see what happens, which means it tends to catch my attention\n\n46:20.080 --> 46:26.160\n more so that when I go into the store, that bottle of liquor catches my attention and\n\n46:26.160 --> 46:27.160\n I buy it.\n\n46:27.160 --> 46:31.720\n And that's, why is that bullshit?\n\n46:31.720 --> 46:40.340\n Because what you're doing is being caught up in the salience of things independent from\n\n46:40.340 --> 46:44.520\n whether or not that salience is tracking reality.\n\n46:44.520 --> 46:48.340\n Is it independent or is it loosely connected?\n\n46:48.340 --> 46:53.760\n Because it's not so obvious to me when I see happy people at a bar that I don't in part\n\n46:53.760 --> 46:58.240\n believe that, well, my experience has been maybe different.\n\n46:58.240 --> 47:05.280\n Logically, I can understand, but maybe there is a bar out there where it's all happy people\n\n47:05.280 --> 47:06.280\n dancing.\n\n47:06.280 --> 47:11.400\n In fact, most of the bars I go to these days in Texas, there's pretty lots of happy people.\n\n47:11.400 --> 47:16.200\n I think you can, I mean, there's probably variation, although I think it's very the\n\n47:16.200 --> 47:17.960\n truth seeking in there.\n\n47:17.960 --> 47:22.720\n Let's say the intent is at least to try and shut off your truth seeking.\n\n47:22.720 --> 47:25.720\n It might not completely succeed, but that's the intent.\n\n47:25.720 --> 47:32.480\n At times it can completely succeed because I can give you pretty much gibberish and never\n\n47:32.480 --> 47:35.400\n let it will motivate your behavior.\n\n47:35.400 --> 47:39.440\n There's an episode from the classic Simpsons, not the modern Simpsons, the classic Simpsons\n\n47:39.440 --> 47:43.920\n where there's aliens and they're running for office in the United States.\n\n47:43.920 --> 47:47.420\n Now I'm a Canadian, so this doesn't quite work for me, but right.\n\n47:47.420 --> 47:51.880\n And this speech goes like this, my fellow Americans, when I was young, I dreamt of being\n\n47:51.880 --> 47:55.480\n a baseball, but we must move forward, not backward.\n\n47:55.480 --> 48:02.240\n Upward, not forward, twirling, twirling towards freedom and people go, and there's a rush.\n\n48:02.240 --> 48:04.040\n There's nothing there.\n\n48:04.040 --> 48:10.260\n And yet it's great satire because a lot of political speech is exactly like that.\n\n48:10.260 --> 48:11.260\n There's nothing there.\n\n48:11.260 --> 48:12.260\n Right?\n\n48:12.260 --> 48:17.800\n Well, I'm not saying all political speech, I said a lot.\n\n48:17.800 --> 48:22.900\n There's a fundamental difference between, and it's so hilarious, I remember that episode.\n\n48:22.900 --> 48:28.080\n There's a fundamental difference between that absurd sort of non secular speech and political\n\n48:28.080 --> 48:35.620\n speech because one of the things is political speech is grounded in some sense of truth.\n\n48:35.620 --> 48:44.220\n And so if that requires you talking about alternative facts and weird self destructive\n\n48:44.220 --> 48:50.680\n oxymoronic phrases, isn't that approaching pure bullshit?\n\n48:50.680 --> 49:00.920\n No, I think pure bullshit, like the vacuum is very difficult to get to, but I get the\n\n49:00.920 --> 49:01.920\n point.\n\n49:01.920 --> 49:07.520\n So what exactly is truth?\n\n49:07.520 --> 49:09.360\n Is it possible to know?\n\n49:09.360 --> 49:14.720\n I think Spinoza's right about truth, that truth is only known by its own standard, which\n\n49:14.720 --> 49:16.160\n sounds circular.\n\n49:16.160 --> 49:20.160\n There's a way in which he didn't mean that circularly, and I think this is also converges\n\n49:20.160 --> 49:21.160\n with Plato.\n\n49:21.160 --> 49:24.520\n These are two huge influences on me.\n\n49:24.520 --> 49:32.300\n I think we only know the truth retrospectively when we go through some process of self transcendence,\n\n49:32.300 --> 49:37.840\n when we move from a frame to a more encompassing frame so that we can see the limitations and\n\n49:37.840 --> 49:40.880\n the distortions of the earlier frame.\n\n49:40.880 --> 49:43.280\n You have this when you have a moment of insight.\n\n49:43.280 --> 49:47.640\n Insight is you doing, you are re realizing what is relevant.\n\n49:47.640 --> 49:55.260\n You go, oh, oh, I thought she was aggressive and angry.\n\n49:55.260 --> 49:57.640\n She's actually really afraid.\n\n49:57.640 --> 50:02.760\n I was misframing this and you change what you find relevant.\n\n50:02.760 --> 50:04.800\n You have those aha moments.\n\n50:04.800 --> 50:14.120\n So do you think it's possible to get a sense of objective reality?\n\n50:14.120 --> 50:22.680\n So is it possible to get to the ground level of something that you can call objective truth?\n\n50:22.680 --> 50:26.600\n Or are we always on shaky ground?\n\n50:26.600 --> 50:35.140\n I think those moments of transcendence can never get us to an absolute view from nowhere.\n\n50:35.140 --> 50:38.340\n And so this is Drew Hyland's notion of finite transcendence.\n\n50:38.340 --> 50:42.720\n We are capable of self transcendence, and therefore we are creatures who can actually\n\n50:42.720 --> 50:48.120\n raise the question of truth, or goodness, or beauty, because I think they all share\n\n50:48.120 --> 50:49.960\n this feature.\n\n50:49.960 --> 50:55.880\n But that doesn't mean we can transcend to a godhood, to some absolute view from nowhere\n\n50:55.880 --> 51:02.440\n that takes in all information and organizes it in a comprehensive whole.\n\n51:02.440 --> 51:10.120\n But that doesn't mean that truth is thereby rendered valueless.\n\n51:10.120 --> 51:13.840\n I think a better term is real.\n\n51:13.840 --> 51:18.560\n And real and illusory are comparative terms.\n\n51:18.560 --> 51:24.660\n You only know that something's an illusion by taking something else to be real.\n\n51:24.660 --> 51:29.760\n And so we're always in a comparative task, but that doesn't mean that we can somehow\n\n51:29.760 --> 51:37.840\n jump outside of our framing in some final manner and say, this is how it is from a God's\n\n51:37.840 --> 51:39.080\n eye point of view.\n\n51:39.080 --> 51:46.940\n So what do you think, if I may ask, of somebody like Ayn Rand and her philosophy of objectivism?\n\n51:46.940 --> 51:51.000\n So where the core principle is that reality exists independently of consciousness and\n\n51:51.000 --> 51:54.960\n that human beings have direct contact with reality through sense perception.\n\n51:54.960 --> 52:00.440\n So they have that, you do have that ability to know reality.\n\n52:00.440 --> 52:01.600\n There's two things.\n\n52:01.600 --> 52:06.960\n Knowing that there's an independent reality is not knowing that independent reality.\n\n52:06.960 --> 52:07.960\n Those are not the same thing.\n\n52:07.960 --> 52:15.120\n Yeah, but I think objectivism would probably say that our human reason is able to have\n\n52:15.120 --> 52:17.320\n contact with that.\n\n52:17.320 --> 52:24.880\n Then I would respond and say, I believe, in fact, ultimately, in a conformity theory of\n\n52:24.880 --> 52:33.200\n knowing that the deepest kind of knowing is when there's a contact, a conformity between\n\n52:33.200 --> 52:40.840\n the mind, the embodied mind and reality, and here's where I guess I'd push back on Rand.\n\n52:40.840 --> 52:47.400\n I would say you have to acknowledge partial knowledge as real knowledge, because if you\n\n52:47.400 --> 52:50.720\n don't, you're going to fall prey to Meno's paradox.\n\n52:50.720 --> 52:54.840\n Meno's paradox is, you know, it's in Plato, right?\n\n52:54.840 --> 53:00.760\n To know P. Well, if I don't know P, I'm going to go looking for it.\n\n53:00.760 --> 53:04.120\n But if I don't know P, how could I possibly recognize it when I found it?\n\n53:04.120 --> 53:05.920\n I have no way of recognizing it.\n\n53:05.920 --> 53:09.120\n I have no way of knowing that I found it.\n\n53:09.120 --> 53:13.160\n So I must know P. But if I know P, then I don't need to learn about it.\n\n53:13.160 --> 53:16.080\n I don't need to go searching.\n\n53:16.080 --> 53:18.080\n So learning doesn't exist.\n\n53:18.080 --> 53:19.760\n Knowledge is impossible.\n\n53:19.760 --> 53:25.760\n The way you break out of that paradox is saying, no, no, no, it is possible to partially know\n\n53:25.760 --> 53:26.760\n something.\n\n53:26.760 --> 53:31.600\n I can know it enough that it will guide me to recognizing it, but that's not the same\n\n53:31.600 --> 53:35.920\n as having a complete grasp of it, because I still have to search and find what I don't\n\n53:35.920 --> 53:39.280\n yet possess in my knowledge.\n\n53:39.280 --> 53:43.000\n So partial knowledge has to be real knowledge.\n\n53:43.000 --> 53:44.000\n Right.\n\n53:44.000 --> 53:45.480\n Partial knowledge is still knowledge.\n\n53:45.480 --> 53:46.480\n Yes.\n\n53:46.480 --> 53:52.800\n What do you think about somebody like Donald Hoffman, who thinks the reality is an illusion,\n\n53:52.800 --> 53:59.880\n so complete illusion, that we're given this actually really nice definition or idea that\n\n53:59.880 --> 54:05.440\n you talked about, that there's a tension between the illusory and what is real.\n\n54:05.440 --> 54:12.680\n He says that basically we've taken that and we've ran with the real to the point where\n\n54:12.680 --> 54:18.680\n the real is not at all connected to some kind of physical reality.\n\n54:18.680 --> 54:20.120\n I hope to talk to him at some point.\n\n54:20.120 --> 54:25.760\n You were supposed to talk at one point, and so I have to talk in his absence.\n\n54:25.760 --> 54:30.680\n I think that, first of all, I think saying that everything is an illusion is like saying\n\n54:30.680 --> 54:31.680\n everything is tall.\n\n54:31.680 --> 54:32.680\n It doesn't make any sense.\n\n54:32.680 --> 54:36.440\n It's a comparative term.\n\n54:36.440 --> 54:42.480\n You have to say, against this standard of realness, this is an illusion.\n\n54:42.480 --> 54:52.400\n And he uses arguments from evolution, which are problematic to me because it's like, well,\n\n54:52.400 --> 55:02.440\n you seem to be saying that evolution is true, that it really exists, and then some of our\n\n55:02.440 --> 55:08.320\n cognition and our perception has access to reality, math and presumably some science\n\n55:08.320 --> 55:10.280\n has access to reality.\n\n55:10.280 --> 55:18.280\n And then what he seems to be saying is, well, a lot of your everyday experience is illusory,\n\n55:18.280 --> 55:24.280\n but we do have some contact with reality, whereby we can make the arguments as to why\n\n55:24.280 --> 55:28.920\n most of your experience, most of your everyday experience is an illusion.\n\n55:28.920 --> 55:32.200\n But to me, that's not a novel thing.\n\n55:32.200 --> 55:33.200\n That's Descartes.\n\n55:33.200 --> 55:38.360\n That's the idea that most of our sense experience is untrustworthy, but the math is what connects\n\n55:38.360 --> 55:39.480\n us to reality.\n\n55:39.480 --> 55:41.520\n That's how he interpreted the Copernican revolution.\n\n55:41.520 --> 55:46.600\n Oh, look, we're all seeing the sun rise and move over and set, and it's all an illusion,\n\n55:46.600 --> 55:49.600\n but the math, the math gets us to the reality.\n\n55:49.600 --> 55:57.280\n Well, I think he makes a deeper point that most of cognition is just evolved and operates\n\n55:57.280 --> 55:59.560\n in the illusory world.\n\n55:59.560 --> 56:04.000\n How does he know that things like cognition and evolution exist?\n\n56:04.000 --> 56:09.560\n I think there's an important distinction between evolution and cognition, right?\n\n56:09.560 --> 56:11.720\n No, no, I'm just saying that's not the point I'm making.\n\n56:11.720 --> 56:17.440\n I'm making a point that he's claiming that there are two things that really exist.\n\n56:17.440 --> 56:19.880\n Why are they privileged?\n\n56:19.880 --> 56:26.680\n He basically says that, look, the process of evolution makes sense, right?\n\n56:26.680 --> 56:30.600\n Like it makes sense that you get complex organisms from simple organisms through the natural\n\n56:30.600 --> 56:32.320\n selection process.\n\n56:32.320 --> 56:37.320\n Whereas how you get to transfer information from generation to generation, it makes sense.\n\n56:37.320 --> 56:44.560\n And then he says that there's no requirement for the cognition to evolve in a way that\n\n56:44.560 --> 56:49.960\n it would actually perceive and have direct contact with the physical reality.\n\n56:49.960 --> 56:54.480\n Except that cognition evolved in such a way that it could perceive the truth of evolution.\n\n56:54.480 --> 56:58.160\n And you can't treat evolution like an isolated thing.\n\n56:58.160 --> 57:01.020\n Evolution depends on Darwinian theory, genetics.\n\n57:01.020 --> 57:05.320\n It depends on understanding plate tectonics, the way the environment changes.\n\n57:05.320 --> 57:08.480\n It depends on how chromosomes are structured.\n\n57:08.480 --> 57:13.520\n Actually, that's an interesting question to him, where I don't know if he actually would\n\n57:13.520 --> 57:18.360\n push back on this, is how do you know evolution is real?\n\n57:18.360 --> 57:20.000\n Yes.\n\n57:20.000 --> 57:25.760\n I think he would be open to the idea that it is part of the illusion that we constructed,\n\n57:25.760 --> 57:33.280\n that there's some, in some sense, it is connected to reality, but we don't have a clear picture\n\n57:33.280 --> 57:34.280\n of it.\n\n57:34.280 --> 57:42.120\n I mean, that's an intellectually honest statement then, if most of our cognition as thinking\n\n57:42.120 --> 57:50.880\n beings is operating at every level in an illusory world, then it makes sense that this, one\n\n57:50.880 --> 57:58.680\n of the main theories of science, that's evolution, is also a complete part of this illusory world.\n\n57:58.680 --> 57:59.680\n Right.\n\n57:59.680 --> 58:04.080\n But then what happens to the premise for his argument leading to the conclusion that cognition\n\n58:04.080 --> 58:05.080\n is illusory?\n\n58:05.080 --> 58:09.520\n I think he makes a very specific argument about evolution as an explanation of why the\n\n58:09.520 --> 58:13.520\n world is, of our cognition operating in an illusory world.\n\n58:13.520 --> 58:17.060\n But that's just one of the explanations.\n\n58:17.060 --> 58:23.880\n I think the deeper question is why do we think we have contact with reality, with physical\n\n58:23.880 --> 58:24.880\n reality?\n\n58:24.880 --> 58:34.280\n It's, we could be very well living in a virtual world constructed by our minds in a way that\n\n58:34.280 --> 58:38.960\n makes that world deeply interesting in some ways, whether it's somebody playing a video\n\n58:38.960 --> 58:46.320\n game or we're trying to, through the process of distributed cognition, construct more and\n\n58:46.320 --> 58:47.760\n more complex objects.\n\n58:47.760 --> 58:54.320\n Like why do we have to, why does it have to be connected to like physics and planets and\n\n58:54.320 --> 58:55.320\n all that kind of stuff?\n\n58:55.320 --> 58:56.320\n Okay.\n\n58:56.320 --> 59:01.160\n So if we're going to say like we're now considering it as a possibility rather than it's a conclusion\n\n59:01.160 --> 59:06.240\n based on arguments, because the arguments, again, will always rely on stipulating that\n\n59:06.240 --> 59:08.720\n there is something that is known.\n\n59:08.720 --> 59:10.960\n These are the features of cognition.\n\n59:10.960 --> 59:12.520\n Cognition is capable of illusion.\n\n59:12.520 --> 59:13.840\n That's a true statement.\n\n59:13.840 --> 59:15.960\n You're somehow in contact with the mind.\n\n59:15.960 --> 59:21.500\n Why does the mind have this privileged contact and other aspects like my body do not?\n\n59:21.500 --> 59:25.680\n So that's, but let's put that aside and now let's just consider it.\n\n59:25.680 --> 59:29.520\n Now when we put it that way, it's not an epistemic question anymore.\n\n59:29.520 --> 59:32.240\n It's an existential question and here's my reply to you.\n\n59:32.240 --> 59:34.080\n There's two possibilities.\n\n59:34.080 --> 59:41.720\n Either the illusion is one that I cannot discover, sort of, you know, the matrix on steroids\n\n59:41.720 --> 59:42.720\n or something.\n\n59:42.720 --> 59:43.720\n There's no way.\n\n59:43.720 --> 59:51.000\n Because what I do, I can't find out that it's an illusion or it's an illusion, but I can\n\n59:51.000 --> 59:54.760\n find out that it's an illusion.\n\n59:54.760 --> 59:56.840\n Those are the two possibilities.\n\n59:56.840 --> 1:00:00.800\n Nothing changes for me if those are the two possibilities, because if I could not find,\n\n1:00:00.800 --> 1:00:08.160\n possibly find out, it is irrational for me to pay any attention to that possibility.\n\n1:00:08.160 --> 1:00:11.600\n So I could keep doing the science as I'm doing it.\n\n1:00:11.600 --> 1:00:17.840\n If there's a way of finding out, science is my best bet, I believe, for finding out if\n\n1:00:17.840 --> 1:00:20.440\n it's, what's true and what's an illusion.\n\n1:00:20.440 --> 1:00:22.000\n So I keep doing what I'm doing.\n\n1:00:22.000 --> 1:00:26.600\n So it's an argument if you move it to that, that makes no existential difference to me.\n\n1:00:26.600 --> 1:00:31.400\n Oh man, that is such a deeply philosophical argument.\n\n1:00:31.400 --> 1:00:34.880\n No, no, no, no, no, no, no.\n\n1:00:34.880 --> 1:00:38.400\n Nobody's saying science doesn't work.\n\n1:00:38.400 --> 1:00:43.880\n It's an interesting question, just like before humans were able to fly, they would ask a\n\n1:00:43.880 --> 1:00:47.480\n question, can we build the machine that makes us fly?\n\n1:00:47.480 --> 1:00:51.600\n In that same way, we're asking a question to which we don't know an answer, but we may\n\n1:00:51.600 --> 1:00:58.000\n know in the future, how much of this whole thing is an illusion?\n\n1:00:58.000 --> 1:01:02.520\n And I think in a second category, the first, I forgot which one, yes, science will be able\n\n1:01:02.520 --> 1:01:04.440\n to help us discover this.\n\n1:01:04.440 --> 1:01:07.960\n Otherwise, yes, for sure, that doesn't matter.\n\n1:01:07.960 --> 1:01:13.120\n If we're living in a simulation, we can't find out at all, then it doesn't matter.\n\n1:01:13.120 --> 1:01:20.580\n But yes, the whole point is as we get deeper and deeper understanding of our mind of cognition,\n\n1:01:20.580 --> 1:01:25.220\n we might be able to discover like how much of this is a big charade constructed by our\n\n1:01:25.220 --> 1:01:28.680\n mind to keep us fed or something like that.\n\n1:01:28.680 --> 1:01:34.620\n Some weird, some weird, very simplistic explanation that it will ultimately in its simplicity\n\n1:01:34.620 --> 1:01:44.760\n be beautiful, or as we try to build robots and instill them, instill them with consciousness,\n\n1:01:44.760 --> 1:01:54.520\n with ability to feel, those kinds of things, we'll discover, well, let's just trick them\n\n1:01:54.520 --> 1:01:58.720\n into thinking they feel and have consciousness and they'll believe it.\n\n1:01:58.720 --> 1:02:01.900\n And then they'll have a deeply fulfilling and meaningful lives.\n\n1:02:01.900 --> 1:02:05.720\n And on top of that, they will interact with us in a way that will make our lives more\n\n1:02:05.720 --> 1:02:06.720\n meaningful.\n\n1:02:06.720 --> 1:02:11.160\n And then all of a sudden, it's like at the end of Animal Farm, you look at pigs and humans\n\n1:02:11.160 --> 1:02:14.920\n and you look at robots and humans and you can't tell the difference between either.\n\n1:02:14.920 --> 1:02:21.960\n And we in that way start to understand that much of this existence could be an illusion.\n\n1:02:21.960 --> 1:02:25.220\n Okay, well, I have two responses to that.\n\n1:02:25.220 --> 1:02:37.080\n First is the progress that's being made on like AGI is about making whatever the system\n\n1:02:37.080 --> 1:02:42.720\n is that's going to be the source of intelligent more and more dynamically and recursively\n\n1:02:42.720 --> 1:02:45.080\n self correcting.\n\n1:02:45.080 --> 1:02:48.920\n That's part of what's happening.\n\n1:02:48.920 --> 1:02:52.520\n Extrapolating from that, you get a system that gets better and better at self correcting,\n\n1:02:52.520 --> 1:02:59.600\n but that's exactly what I was describing before as the transformative theory of truth.\n\n1:02:59.600 --> 1:03:09.420\n The other response to that is people think of science just as sort of end proposition.\n\n1:03:09.420 --> 1:03:15.700\n Let me just use the evolutionary example again, right?\n\n1:03:15.700 --> 1:03:20.520\n If I'm gathering the evidence, I need to know a lot of geology, I need to know plate tectonics,\n\n1:03:20.520 --> 1:03:25.560\n I need to know about radioactive decay, I need to know about genetics, and then in order\n\n1:03:25.560 --> 1:03:30.160\n to measure all those things, I need to know how microscopes work, I need to know how pencils\n\n1:03:30.160 --> 1:03:36.480\n and paper work, I need to know how rulers work, I need to know how English... You can't\n\n1:03:36.480 --> 1:03:38.680\n isolate knowledge that way.\n\n1:03:38.680 --> 1:03:43.200\n And if you say, well, most of that's an illusion, then you're in a weird position of saying\n\n1:03:43.200 --> 1:03:48.360\n somehow all of these illusions get to this truth claim.\n\n1:03:48.360 --> 1:03:50.620\n I think it goes in reverse.\n\n1:03:50.620 --> 1:03:55.960\n If you think this is the truth claim, the measuring and all the things that scientists\n\n1:03:55.960 --> 1:04:01.660\n would do to gather on all the ways the theories are converging together, that also has to\n\n1:04:01.660 --> 1:04:07.920\n be fundamentally right, because it's not like Lego, it is an interwoven whole.\n\n1:04:07.920 --> 1:04:13.180\n Yes, it definitely is interwoven, but I love how I'm playing the devil advocate for the\n\n1:04:13.180 --> 1:04:14.720\n illusion world.\n\n1:04:14.720 --> 1:04:21.800\n But there's an aspect to truth that has to be consistent, deeply consistent across an\n\n1:04:21.800 --> 1:04:23.360\n entire system.\n\n1:04:23.360 --> 1:04:28.480\n But inside a video game, that same kind of consistency evolves.\n\n1:04:28.480 --> 1:04:33.560\n There's rules about interactions, there's game theoretic patterns about what's good\n\n1:04:33.560 --> 1:04:39.640\n and bad and so on, and there's sources of joy and fear and anger, and then understanding\n\n1:04:39.640 --> 1:04:44.460\n about a world, what happens in different dynamics of a video game, even simple video games.\n\n1:04:44.460 --> 1:04:52.680\n So there's no, even inside an illusion, you can have consistency and develop truths inside\n\n1:04:52.680 --> 1:04:59.400\n that illusion and iteratively evolve your truth with the illusion.\n\n1:04:59.400 --> 1:05:02.040\n Okay, but that comes back.\n\n1:05:02.040 --> 1:05:06.320\n Is that process genuinely self correcting, or are you in the simulation in which there\n\n1:05:06.320 --> 1:05:08.560\n is no possible doorway out?\n\n1:05:08.560 --> 1:05:12.920\n Because if, my argument is, if you find one or two doorways, that feeds back.\n\n1:05:12.920 --> 1:05:17.680\n In fact, you can't just say, this is the little tiny island where we have the truth.\n\n1:05:17.680 --> 1:05:18.680\n That's the point I'm making.\n\n1:05:18.680 --> 1:05:19.680\n Right.\n\n1:05:19.680 --> 1:05:24.400\n But what if you find that, I think there is doorways, if that's the case.\n\n1:05:24.400 --> 1:05:29.760\n And what if you find a doorway and you step out, but you're yet in another simulation?\n\n1:05:29.760 --> 1:05:31.860\n I mean, that's the point.\n\n1:05:31.860 --> 1:05:34.360\n That's so self correcting.\n\n1:05:34.360 --> 1:05:40.640\n When you fix the self deception, you don't know if there's other bigger self deceptions\n\n1:05:40.640 --> 1:05:41.640\n you're operating on.\n\n1:05:41.640 --> 1:05:42.640\n Of course.\n\n1:05:42.640 --> 1:05:43.640\n That makes sense.\n\n1:05:43.640 --> 1:05:44.640\n That's right.\n\n1:05:44.640 --> 1:05:49.440\n But again, we're back to when I step into the second simulation, is it, can I get the\n\n1:05:49.440 --> 1:05:51.620\n doorway out of that or right?\n\n1:05:51.620 --> 1:05:55.400\n Because if you just make the infinite regressive simulations, you basically said, I have a\n\n1:05:55.400 --> 1:05:57.280\n simulation that I can never get out of.\n\n1:05:57.280 --> 1:05:58.280\n Yeah.\n\n1:05:58.280 --> 1:06:04.400\n I think there's always a bigger pile of bullshit is the claim I'm trying to make here.\n\n1:06:04.400 --> 1:06:07.000\n Okay.\n\n1:06:07.000 --> 1:06:09.160\n Let me dance around meaning once more.\n\n1:06:09.160 --> 1:06:10.160\n Sure.\n\n1:06:10.160 --> 1:06:16.720\n I ask people on this podcast or at a bar or to imaginary people I talk to in a room when\n\n1:06:16.720 --> 1:06:22.040\n I'm all by myself, the question of the meaning of life.\n\n1:06:22.040 --> 1:06:24.900\n Do you think this is a useful question?\n\n1:06:24.900 --> 1:06:29.320\n You drew a line between meaning in life and meaning of life.\n\n1:06:29.320 --> 1:06:31.680\n Do you think this is a useful question?\n\n1:06:31.680 --> 1:06:35.720\n No, I think it's like the question, what's north of the North Pole or what time is it\n\n1:06:35.720 --> 1:06:36.720\n on the sun?\n\n1:06:36.720 --> 1:06:41.400\n It sounds like a question, but it's actually not really a question because it has a presupposition\n\n1:06:41.400 --> 1:06:45.840\n in it that I think is fundamentally flawed.\n\n1:06:45.840 --> 1:06:50.400\n If I understand what people mean by it, and it's actually often not that clear, but when\n\n1:06:50.400 --> 1:06:55.120\n they talk about the meaning of life, they are talking about there are some feature of\n\n1:06:55.120 --> 1:07:01.040\n the universe in and of itself that I have to discover and enter into a relationship\n\n1:07:01.040 --> 1:07:05.680\n with and there's in that sense, a plan for me or something.\n\n1:07:05.680 --> 1:07:09.600\n And so that's a property of the universe.\n\n1:07:09.600 --> 1:07:14.920\n That's a very deep, serious, metaphysical, ontological claim.\n\n1:07:14.920 --> 1:07:18.320\n You're claiming to know something fundamental about the structure of reality.\n\n1:07:18.320 --> 1:07:22.560\n There were times when people thought they had a worldview that legitimated it, like\n\n1:07:22.560 --> 1:07:28.600\n God is running the universe and God cares about you and there's a plan, et cetera.\n\n1:07:28.600 --> 1:07:36.080\n But I think a better way of understanding meaning is not...\n\n1:07:36.080 --> 1:07:37.080\n Meaning is like the graspability.\n\n1:07:37.080 --> 1:07:41.180\n Remember, I talked about optimal grip, it's like the graspability of that cup.\n\n1:07:41.180 --> 1:07:42.960\n Is that in me?\n\n1:07:42.960 --> 1:07:44.160\n No.\n\n1:07:44.160 --> 1:07:45.160\n Is it in the cup?\n\n1:07:45.160 --> 1:07:47.880\n No, because a fly can't grasp it.\n\n1:07:47.880 --> 1:07:51.680\n Well, graspability is in my hand, well, I can't grasp Africa.\n\n1:07:51.680 --> 1:07:58.320\n No, no, there is a real relation, fittedness between me and this cup.\n\n1:07:58.320 --> 1:08:00.480\n Same thing with the adaptivity of an organism.\n\n1:08:00.480 --> 1:08:03.400\n Is the adaptivity of a great white shark in the great white shark?\n\n1:08:03.400 --> 1:08:07.240\n Drop it in the Sahara, dies, okay?\n\n1:08:07.240 --> 1:08:14.960\n Meaning isn't in me, I think that's romantic bullshit, and it isn't in the universe, it\n\n1:08:14.960 --> 1:08:17.280\n is a proper relationship.\n\n1:08:17.280 --> 1:08:22.040\n I've coined the phrase transjective, it is the binding relationship between the subjective\n\n1:08:22.040 --> 1:08:23.340\n and the objective.\n\n1:08:23.340 --> 1:08:31.560\n And therefore, when you're asking the question about the meaning of life, you are, I think,\n\n1:08:31.560 --> 1:08:33.760\n misrepresenting the nature of meaning.\n\n1:08:33.760 --> 1:08:36.480\n Just like when you ask, what time is it on the sun?\n\n1:08:36.480 --> 1:08:40.740\n You're misrepresenting how we derive clock time.\n\n1:08:40.740 --> 1:08:45.440\n At the risk of disagreeing with a man who did 50 lectures on the meaning crisis, let\n\n1:08:45.440 --> 1:08:48.000\n me hard disagree.\n\n1:08:48.000 --> 1:08:52.720\n But I think we probably agree, but it's just like a dance, like any dialogue.\n\n1:08:52.720 --> 1:08:59.120\n I think meaning of life gets at the same kind of relationship between you and the glass\n\n1:08:59.120 --> 1:09:12.760\n of water, between whatever the forces of the universe that created the planets, the proteins,\n\n1:09:12.760 --> 1:09:21.640\n the multi cell organisms, the intelligent early humans, the beautiful human civilizations\n\n1:09:21.640 --> 1:09:26.360\n and the technologies that will overtake them.\n\n1:09:26.360 --> 1:09:39.020\n It's trying to understand the relevance realization of the Big Bang to the feeling of love you\n\n1:09:39.020 --> 1:09:42.080\n have for another human being.\n\n1:09:42.080 --> 1:09:46.500\n It's reaching for that, even though it's hopeless to understand.\n\n1:09:46.500 --> 1:09:50.420\n It's the question, the asking of the question is the reaching.\n\n1:09:50.420 --> 1:09:58.480\n Now it is, in fact, romantic bullshit, technically speaking.\n\n1:09:58.480 --> 1:10:07.700\n But it could be that romantic bullshit is actually the essence of life and the source\n\n1:10:07.700 --> 1:10:09.520\n of its deepest meaning.\n\n1:10:09.520 --> 1:10:12.620\n Well, I hope not.\n\n1:10:12.620 --> 1:10:18.760\n But technically speaking, romantic bullshit, meaning romantic in the philosophical sense,\n\n1:10:18.760 --> 1:10:19.760\n yes.\n\n1:10:19.760 --> 1:10:23.600\n I mean, what is poetry?\n\n1:10:23.600 --> 1:10:24.600\n What is music?\n\n1:10:24.600 --> 1:10:27.840\n What is the magic you feel when you hear a beautiful piece of music?\n\n1:10:27.840 --> 1:10:28.840\n What is that?\n\n1:10:28.840 --> 1:10:31.200\n Oh, but that's exactly to my point.\n\n1:10:31.200 --> 1:10:34.760\n Is music inside you or is it outside you?\n\n1:10:34.760 --> 1:10:36.080\n It's both and neither.\n\n1:10:36.080 --> 1:10:39.120\n And that's precisely why you find it so meaningful.\n\n1:10:39.120 --> 1:10:43.480\n In fact, it can be so meaningful you can regard it as sacred.\n\n1:10:43.480 --> 1:10:48.080\n What you said, I don't think, and you preface that we might not be in disagreement, right?\n\n1:10:48.080 --> 1:10:56.000\n What you said is, no, no, no, there is a way in which reality is realizing itself.\n\n1:10:56.000 --> 1:11:04.320\n And I want my relevance realization to be in the best possible relationship, the sort\n\n1:11:04.320 --> 1:11:07.000\n of meta optimal grip to what is most real.\n\n1:11:07.000 --> 1:11:08.360\n I totally agree.\n\n1:11:08.360 --> 1:11:12.100\n I totally think that's one of the things, I said this earlier, one of our meta desires\n\n1:11:12.100 --> 1:11:16.920\n is whatever is satisfying our desires is also real.\n\n1:11:16.920 --> 1:11:21.800\n I do this with my students, I'll say, you know, because romantic relationships sort\n\n1:11:21.800 --> 1:11:25.520\n of take the role of God and religion and history and culture for us right now.\n\n1:11:25.520 --> 1:11:29.280\n We put everything on them and that's why they break, right?\n\n1:11:29.280 --> 1:11:30.280\n Strong words.\n\n1:11:30.280 --> 1:11:31.820\n Got it.\n\n1:11:31.820 --> 1:11:36.660\n But I'll say to them, okay, how many of you are in really satisfying romantic relationships?\n\n1:11:36.660 --> 1:11:37.660\n Put up your hands.\n\n1:11:37.660 --> 1:11:40.240\n Then I'll say, okay, I'm now only talking to these people.\n\n1:11:40.240 --> 1:11:44.220\n Of those people, how many of you would want to know your partner's cheating on you even\n\n1:11:44.220 --> 1:11:49.140\n if it means the destruction of the relationship, 95% of them put up their hands.\n\n1:11:49.140 --> 1:11:51.300\n And I say, but why?\n\n1:11:51.300 --> 1:11:56.120\n And here's my students who are usually all sort of bitten with cynicism and postmodernism\n\n1:11:56.120 --> 1:12:01.640\n and they'll just say spontaneously, well, because it's not real, because it's not real.\n\n1:12:01.640 --> 1:12:02.640\n Right.\n\n1:12:02.640 --> 1:12:12.360\n So I think what you're pointing to is actually, you're pointing not to an objective or a\n\n1:12:12.360 --> 1:12:14.160\n subjective thing.\n\n1:12:14.160 --> 1:12:15.440\n Empiricism says it's subjective.\n\n1:12:15.440 --> 1:12:19.760\n There's some sort of, I guess, like positivism or Lockean empiricism says it's objective,\n\n1:12:19.760 --> 1:12:24.620\n but you're saying, no, no, no, there's reality realization and can I get relevance realization\n\n1:12:24.620 --> 1:12:30.060\n to be optimally gripping in the best right relationship with it?\n\n1:12:30.060 --> 1:12:33.820\n And there's good reason you can because think about it, your relevance realization isn't\n\n1:12:33.820 --> 1:12:38.140\n just representing properties of the world, it's instantiating it.\n\n1:12:38.140 --> 1:12:42.780\n There's something very similar to biological evolution, which is that the guts of life,\n\n1:12:42.780 --> 1:12:48.620\n if I'm right, running your cognition, it's not just that you have ideas, you actually\n\n1:12:48.620 --> 1:12:52.700\n instantiate, that's what I mean by conformity, the same principles.\n\n1:12:52.700 --> 1:12:55.600\n They're within and without, they don't belong to you subjectively.\n\n1:12:55.600 --> 1:12:58.380\n They're not just out there, they're both at the same time.\n\n1:12:58.380 --> 1:13:03.660\n And they help to explain how you are actually bound to the evolutionary world.\n\n1:13:03.660 --> 1:13:04.660\n Yeah.\n\n1:13:04.660 --> 1:13:07.340\n So it comes from both inside and from the outside.\n\n1:13:07.340 --> 1:13:14.100\n But there's still the question of the meaning of life, first of all, the big benefit of\n\n1:13:14.100 --> 1:13:21.200\n that question is that it shakes you out of your hamster in a wheel that is daily life,\n\n1:13:21.200 --> 1:13:26.340\n the mundane process of daily life, where you have a schedule, you wake up, you have kids,\n\n1:13:26.340 --> 1:13:30.740\n you have to take them to school, then you go to work and the da da da da da and repeats\n\n1:13:30.740 --> 1:13:35.100\n over and over and over and over and then you get increased salary and then you upgrade\n\n1:13:35.100 --> 1:13:40.060\n to home and that whole process.\n\n1:13:40.060 --> 1:13:48.500\n Asking about the meaning of life is so full of romantic bullshit that if you just allow\n\n1:13:48.500 --> 1:13:57.220\n yourself to take it seriously for a second, it forces you to pause and think, what's going\n\n1:13:57.220 --> 1:13:58.500\n on here?\n\n1:13:58.500 --> 1:14:03.420\n And then it ultimately, I think, does return to the question of meaning in those mundane\n\n1:14:03.420 --> 1:14:04.420\n things.\n\n1:14:04.420 --> 1:14:07.260\n What gives my life joy?\n\n1:14:07.260 --> 1:14:12.380\n What gives it lasting deliciousness?\n\n1:14:12.380 --> 1:14:16.740\n Where do I notice the magic and how can I have that magic return again and again?\n\n1:14:16.740 --> 1:14:17.740\n Beauty.\n\n1:14:17.740 --> 1:14:20.220\n And that ultimately what it returns to.\n\n1:14:20.220 --> 1:14:23.260\n But it's the same thing you do when you look up to the sky.\n\n1:14:23.260 --> 1:14:27.340\n You spend most of your day hurrying around looking at things on the surface, but when\n\n1:14:27.340 --> 1:14:33.060\n you look up to the sky and you see the stars, it fills you with the feeling of awe that\n\n1:14:33.060 --> 1:14:39.580\n forces you to pause and think in full context of like, what the hell is going on here?\n\n1:14:39.580 --> 1:14:50.180\n That, but also I think there is a, when you think too much about the meaning of a glass\n\n1:14:50.180 --> 1:14:56.420\n and relevance realization of a glass, you don't necessarily get at the core of what\n\n1:14:56.420 --> 1:14:58.780\n makes music beautiful.\n\n1:14:58.780 --> 1:15:02.260\n So sometimes you have to start at the biggest picture first.\n\n1:15:02.260 --> 1:15:09.540\n And I think meaning of life forces you to really go to the big bang and go to the universe\n\n1:15:09.540 --> 1:15:12.380\n and the whole thing, the origin of life.\n\n1:15:12.380 --> 1:15:19.260\n And I think sometimes you have to start there to discover the meaning in the day to day,\n\n1:15:19.260 --> 1:15:24.580\n I think, but perhaps you would disagree.\n\n1:15:24.580 --> 1:15:32.100\n In so far as the question makes you ask about the whole of your life and how much meaning\n\n1:15:32.100 --> 1:15:34.640\n is in the whole of your life.\n\n1:15:34.640 --> 1:15:40.820\n And in so far as it asks how much that is connected to reality, it's a good question.\n\n1:15:40.820 --> 1:15:47.180\n But it's a bad question in that it also makes you look for the answers in the wrong way.\n\n1:15:47.180 --> 1:15:52.260\n Now you said, and I agree with what you said, how we really answer this question is we come\n\n1:15:52.260 --> 1:15:56.900\n back to the meaning in life and we see how much that meaning in life is connected to\n\n1:15:56.900 --> 1:15:58.220\n reality.\n\n1:15:58.220 --> 1:16:00.120\n We pursue wisdom.\n\n1:16:00.120 --> 1:16:08.220\n And so for me, I don't need that question in order to provoke me into that stance.\n\n1:16:08.220 --> 1:16:11.220\n So let's return to the meaning crisis.\n\n1:16:11.220 --> 1:16:12.220\n Yes.\n\n1:16:12.220 --> 1:16:18.020\n What is the nature of the meaning crisis in modern times?\n\n1:16:18.020 --> 1:16:19.100\n What's its origin?\n\n1:16:19.100 --> 1:16:20.100\n What's its explanation?\n\n1:16:20.100 --> 1:16:25.100\n Well, remember what I said, what I argued, that the very processes that make us adaptively\n\n1:16:25.100 --> 1:16:30.140\n intelligent subject us to perennial problems of self deception, self destruction, creating\n\n1:16:30.140 --> 1:16:33.220\n bullshit for ourselves, for other people, all of that.\n\n1:16:33.220 --> 1:16:42.600\n And that can cause anxiety, existential anxiety, it can cause despair, it can cause a sense\n\n1:16:42.600 --> 1:16:45.180\n of absurdity.\n\n1:16:45.180 --> 1:16:47.940\n These are perennial problems.\n\n1:16:47.940 --> 1:16:54.660\n And across cultures and across historical periods, human beings have come up with ecologies\n\n1:16:54.660 --> 1:16:58.100\n of practices, there's no one practice, there's no panacea practice, they've come up with\n\n1:16:58.100 --> 1:17:05.300\n ecologies of practices for ameliorating that self deception and enhancing that fittedness,\n\n1:17:05.300 --> 1:17:09.380\n that connectedness that's at the core of meaning in life.\n\n1:17:09.380 --> 1:17:13.700\n That's prototypically what we call wisdom.\n\n1:17:13.700 --> 1:17:22.940\n And here's how I can show you one clear instance of the meaning crisis, is it's a wisdom famine.\n\n1:17:22.940 --> 1:17:26.780\n I do this regularly with my students.\n\n1:17:26.780 --> 1:17:28.860\n In the classroom I'll say, where do you go for information?\n\n1:17:28.860 --> 1:17:31.700\n They hold up their phone.\n\n1:17:31.700 --> 1:17:32.700\n Where do you go for knowledge?\n\n1:17:32.700 --> 1:17:36.500\n They're a little bit slower and probably because they're in my class, they'll say, well, science,\n\n1:17:36.500 --> 1:17:37.500\n the university.\n\n1:17:37.500 --> 1:17:42.220\n I'll say, where do you go for wisdom?\n\n1:17:42.220 --> 1:17:45.180\n There's a silence.\n\n1:17:45.180 --> 1:17:49.940\n Wisdom isn't optional, that's why it is perennial, cross cultural, cross historical, because\n\n1:17:49.940 --> 1:17:51.500\n of the perennial problems.\n\n1:17:51.500 --> 1:18:00.120\n But we do not have homes for ecologies of practices that fit into our scientific technological\n\n1:18:00.120 --> 1:18:03.040\n worldview so that they are considered legitimate.\n\n1:18:03.040 --> 1:18:06.900\n The fastest growing demographic group are the nones, N O N E S.\n\n1:18:06.900 --> 1:18:11.780\n They have no religious allegiance, but they are not primarily atheistic.\n\n1:18:11.780 --> 1:18:18.140\n They most frequently describe themselves with this very, this has become almost everybody\n\n1:18:18.140 --> 1:18:25.140\n now describes, I'm spiritual but not religious, which means they are trying to find a way\n\n1:18:25.140 --> 1:18:31.180\n of reducing the bullshit and enhancing the connectedness, but they don't want to turn\n\n1:18:31.180 --> 1:18:36.700\n to any of the legacy established religions by and large.\n\n1:18:36.700 --> 1:18:45.380\n Well isn't both religion and the nones, isn't wisdom a process, not a destination?\n\n1:18:45.380 --> 1:18:52.380\n So trying to find, if you're a deeply faithful religious person, you're also trying to find,\n\n1:18:52.380 --> 1:18:53.380\n right?\n\n1:18:53.380 --> 1:18:59.660\n So just because you have a place where you're looking or a set of traditions around which\n\n1:18:59.660 --> 1:19:05.180\n you're constructing the search, it's nevertheless a search.\n\n1:19:05.180 --> 1:19:12.080\n So I guess, is there a case to be made that this is just the usual human condition?\n\n1:19:12.080 --> 1:19:13.080\n How do you answer?\n\n1:19:13.080 --> 1:19:16.900\n If you asked five centuries ago, where do you look for wisdom?\n\n1:19:16.900 --> 1:19:24.340\n I mean, I suppose people would be more inclined to answer, well, the Bible or a religious\n\n1:19:24.340 --> 1:19:25.340\n text.\n\n1:19:25.340 --> 1:19:26.340\n Right.\n\n1:19:26.340 --> 1:19:32.660\n And they had a worldview that was considered not just religious, but also rational.\n\n1:19:32.660 --> 1:19:40.460\n So we now have these two things, orthogonal or often oppositional, spirituality and rationality.\n\n1:19:40.460 --> 1:19:44.940\n But if you go before a particular historical period, you look back in the Neoplatonic tradition,\n\n1:19:44.940 --> 1:19:49.820\n like before the scientific revolution, those two are not in opposition.\n\n1:19:49.820 --> 1:19:56.280\n They are deeply interwoven so that you can have a sense of legitimacy and deep realness\n\n1:19:56.280 --> 1:19:59.780\n and grounding in your practices.\n\n1:19:59.780 --> 1:20:01.120\n We don't have that anymore.\n\n1:20:01.120 --> 1:20:04.700\n And I'm not advocating for religion, neither am I an enemy of religion.\n\n1:20:04.700 --> 1:20:06.940\n I'll strengthen your case, by the way.\n\n1:20:06.940 --> 1:20:14.300\n So one of my RAs did research, and you get people who have committed themselves to cultivating\n\n1:20:14.300 --> 1:20:15.300\n wisdom.\n\n1:20:15.300 --> 1:20:19.420\n And you can look at people within religious traditions and people who are doing it in\n\n1:20:19.420 --> 1:20:21.800\n a purely secular framework.\n\n1:20:21.800 --> 1:20:28.700\n By many of the measures we use to study wisdom scientifically, the people in the religious\n\n1:20:28.700 --> 1:20:32.220\n paths do better than the secular.\n\n1:20:32.220 --> 1:20:37.140\n But here's the important point, there's no significant difference between the religious\n\n1:20:37.140 --> 1:20:38.520\n paths.\n\n1:20:38.520 --> 1:20:43.900\n So it's not like if you're following the path of Judaism, you're more likely to end up wiser\n\n1:20:43.900 --> 1:20:45.940\n than if you follow Buddhism.\n\n1:20:45.940 --> 1:20:47.180\n By the way, I don't know if that's my case.\n\n1:20:47.180 --> 1:20:50.740\n I was making the case that you don't need to have a religious affiliation to search\n\n1:20:50.740 --> 1:20:52.020\n for wisdom.\n\n1:20:52.020 --> 1:20:57.900\n It's that I thought along to the point you just made, that it doesn't matter which religious\n\n1:20:57.900 --> 1:20:59.860\n affiliation or none.\n\n1:20:59.860 --> 1:21:01.420\n But that's what I'm saying.\n\n1:21:01.420 --> 1:21:04.360\n Okay, so this is the tricky thing we're in.\n\n1:21:04.360 --> 1:21:09.740\n It does matter if you're in one, but it doesn't matter sort of the propositional creeds of\n\n1:21:09.740 --> 1:21:10.740\n that.\n\n1:21:10.740 --> 1:21:12.640\n There's something else at work.\n\n1:21:12.640 --> 1:21:18.260\n If you'll allow me this, there's a functionality to religion that we lost when we rejected\n\n1:21:18.260 --> 1:21:20.460\n all the propositional dogma.\n\n1:21:20.460 --> 1:21:24.340\n But there's a functionality there that we don't know how to recreate.\n\n1:21:24.340 --> 1:21:25.340\n Yeah.\n\n1:21:25.340 --> 1:21:26.340\n What is that?\n\n1:21:26.340 --> 1:21:27.340\n Can you try to speak to that?\n\n1:21:27.340 --> 1:21:28.340\n What is that functionality?\n\n1:21:28.340 --> 1:21:29.340\n What is that?\n\n1:21:29.340 --> 1:21:31.700\n Why is that so useful?\n\n1:21:31.700 --> 1:21:39.260\n A bunch of stories, a bunch of myths, a bunch of narratives that are drenched in deep lessons\n\n1:21:39.260 --> 1:21:43.180\n about morality and all those kinds of things.\n\n1:21:43.180 --> 1:21:47.820\n What's the functional thing there that can't be replaced without a religious text by a\n\n1:21:47.820 --> 1:21:49.700\n nonreligious text?\n\n1:21:49.700 --> 1:21:51.660\n This is, for me, the golden question.\n\n1:21:51.660 --> 1:21:52.660\n So thank you.\n\n1:21:52.660 --> 1:21:54.780\n Do you have an answer?\n\n1:21:54.780 --> 1:21:55.780\n Yeah.\n\n1:21:55.780 --> 1:21:58.860\n I think I have a significant answer.\n\n1:21:58.860 --> 1:22:02.140\n I don't think it's complete, but I think it's important.\n\n1:22:02.140 --> 1:22:10.600\n And this is to step before the Cartesian revolution and think about many different kinds of knowing.\n\n1:22:10.600 --> 1:22:15.380\n And this is now something that is prominent within what's called 4E cognitive science,\n\n1:22:15.380 --> 1:22:17.300\n the kind of cognitive science I practice.\n\n1:22:17.300 --> 1:22:22.180\n And there's a lot of converging evidence for these different ways of knowing.\n\n1:22:22.180 --> 1:22:23.500\n There's propositional knowing.\n\n1:22:23.500 --> 1:22:25.100\n This is what we are most familiar with.\n\n1:22:25.100 --> 1:22:29.740\n In fact, it almost has a tyrannical status, right?\n\n1:22:29.740 --> 1:22:33.780\n This is knowing that something is the case, like that cats are mammals and it's stored\n\n1:22:33.780 --> 1:22:40.540\n in semantic memory, and we have tests of coherence and correspondence and conviction, right?\n\n1:22:40.540 --> 1:22:41.620\n There's procedural knowing.\n\n1:22:41.620 --> 1:22:46.180\n This is knowing how to do something.\n\n1:22:46.180 --> 1:22:47.820\n Skills are not theories.\n\n1:22:47.820 --> 1:22:48.820\n They're not beliefs.\n\n1:22:48.820 --> 1:22:49.820\n They're not true or false.\n\n1:22:49.820 --> 1:22:53.100\n They engage the world or they don't.\n\n1:22:53.100 --> 1:22:58.460\n And they are stored in a different kind of memory, procedural memory.\n\n1:22:58.460 --> 1:23:02.040\n Semantic memory can be damaged without any damage to procedural memory.\n\n1:23:02.040 --> 1:23:06.060\n That's why you have the prototypical story of somebody suffering Alzheimer's and they're\n\n1:23:06.060 --> 1:23:11.240\n losing all kinds of facts, but they can still sit down and play the piano flawlessly.\n\n1:23:11.240 --> 1:23:12.900\n Same kind of argument.\n\n1:23:12.900 --> 1:23:15.380\n There's perspectival knowing.\n\n1:23:15.380 --> 1:23:20.160\n This is knowing what it's like to be you here now in this situation, in this state of mind,\n\n1:23:20.160 --> 1:23:25.860\n the whole field of your salience landscaping, what it's like to be you here now.\n\n1:23:25.860 --> 1:23:31.140\n And you have a specific kind of memory around that, episodic memory, and you have a different\n\n1:23:31.140 --> 1:23:33.200\n criterion of realness.\n\n1:23:33.200 --> 1:23:39.900\n So you can get this by my friend Dan Schiappi and I, we studied the scientists using moving\n\n1:23:39.900 --> 1:23:43.740\n the rovers around, or you can take a look at people who are doing VR.\n\n1:23:43.740 --> 1:23:49.620\n People talk about they want to really be in the game, and that makes it real.\n\n1:23:49.620 --> 1:23:51.660\n They don't mean verisimilitude.\n\n1:23:51.660 --> 1:23:58.340\n You can get that sense of being in the game with something like Tetris, which doesn't\n\n1:23:58.340 --> 1:24:03.620\n look like the real world, and you can fail to have it in a video game that has a lot\n\n1:24:03.620 --> 1:24:04.620\n of verisimilitude.\n\n1:24:04.620 --> 1:24:05.620\n It's something else.\n\n1:24:05.620 --> 1:24:09.300\n It's about, again, this kind of connectedness that we're talking about.\n\n1:24:09.300 --> 1:24:14.060\n If I may interrupt, is that connected to the hard problem of consciousness, the subject,\n\n1:24:14.060 --> 1:24:18.600\n the qualia, or is that a different, that kind of knowing, is that different from the quality\n\n1:24:18.600 --> 1:24:19.600\n of consciousness?\n\n1:24:19.600 --> 1:24:22.660\n I think it has to do with, well, I make a distinction between the adjectival and the\n\n1:24:22.660 --> 1:24:27.020\n adverbial qualia, so I think it has to do with the adverbial qualia much more than with\n\n1:24:27.020 --> 1:24:28.020\n the adjectival.\n\n1:24:28.020 --> 1:24:32.860\n So the adjectival qualia are like the greenness of green and the blueness of blue.\n\n1:24:32.860 --> 1:24:41.500\n The adverbial qualia are the hereness, the nowness, the togetherness.\n\n1:24:41.500 --> 1:24:46.180\n And I think the perspectival knowing has a lot to do with the adverbial qualia.\n\n1:24:46.180 --> 1:24:48.380\n Adjectival qualia and adverbial qualia.\n\n1:24:48.380 --> 1:24:50.660\n I'm learning so many new things today.\n\n1:24:50.660 --> 1:24:53.780\n Okay, so that's another way of knowing.\n\n1:24:53.780 --> 1:24:56.580\n Right, the perspectival, and then there's a deeper one.\n\n1:24:56.580 --> 1:25:01.860\n And this is a philosophical point, and I don't want to, we can go through the argument, but\n\n1:25:01.860 --> 1:25:05.580\n you don't have to know that you know in order to know, because if you start doing that,\n\n1:25:05.580 --> 1:25:06.580\n you get an infinite regress.\n\n1:25:06.580 --> 1:25:10.140\n There has to be kinds of knowing that doesn't mean you know that you know that.\n\n1:25:10.140 --> 1:25:11.140\n Yeah.\n\n1:25:11.140 --> 1:25:12.140\n Okay.\n\n1:25:12.140 --> 1:25:13.140\n Of course.\n\n1:25:13.140 --> 1:25:14.140\n Okay, great.\n\n1:25:14.140 --> 1:25:15.140\n Okay, good.\n\n1:25:15.140 --> 1:25:19.540\n Well, there was a lot of ink spilled over that over a 40 year period, so.\n\n1:25:19.540 --> 1:25:24.900\n My philosophers, they spill, this is what they do, they spill ink to get paid for ink\n\n1:25:24.900 --> 1:25:25.900\n spillage.\n\n1:25:25.900 --> 1:25:29.380\n So I want to talk about what I call participatory knowing.\n\n1:25:29.380 --> 1:25:36.360\n This is the idea that you and the world are co participating in things and such that real\n\n1:25:36.360 --> 1:25:38.520\n affordances exist between you.\n\n1:25:38.520 --> 1:25:44.820\n So both me and this environment are shaped by gravity, so the affordance of walking becomes\n\n1:25:44.820 --> 1:25:46.720\n available to me.\n\n1:25:46.720 --> 1:25:53.480\n Both me and a lot of this environment are shaped by my biology, and so affordances for\n\n1:25:53.480 --> 1:25:55.620\n that are here.\n\n1:25:55.620 --> 1:26:04.660\n Look at this cup, shared physics, shared sort of biological factors, my hand, I'm bipedal,\n\n1:26:04.660 --> 1:26:06.820\n also culture is shaping me and shaping this.\n\n1:26:06.820 --> 1:26:10.460\n I had to learn how to use that and treat it as a cup.\n\n1:26:10.460 --> 1:26:14.780\n So this is an agent arena relationship, right?\n\n1:26:14.780 --> 1:26:21.660\n Use identities being created in your agency, identities being created in the world as an\n\n1:26:21.660 --> 1:26:24.340\n arena so you and the world fit together.\n\n1:26:24.340 --> 1:26:29.940\n You know when that's missing, when you're really lonely, or you're homesick, or you're\n\n1:26:29.940 --> 1:26:31.420\n suffering culture shock.\n\n1:26:31.420 --> 1:26:38.780\n So this is participatory knowing, and it's the sense of, it comes with a sense of belonging.\n\n1:26:38.780 --> 1:26:40.060\n At every level.\n\n1:26:40.060 --> 1:26:43.780\n So the ability to walk is a kind of knowing.\n\n1:26:43.780 --> 1:26:44.780\n Yes.\n\n1:26:44.780 --> 1:26:45.780\n Yes.\n\n1:26:45.780 --> 1:26:52.140\n That there's a dance between the physics that enables this process and just participating\n\n1:26:52.140 --> 1:26:54.860\n in the process is the act of knowing.\n\n1:26:54.860 --> 1:26:55.860\n Right.\n\n1:26:55.860 --> 1:26:59.860\n And there's a really weird form of memory you have for this kind of knowing, it's called\n\n1:26:59.860 --> 1:27:00.860\n yourself.\n\n1:27:00.860 --> 1:27:01.860\n What?\n\n1:27:01.860 --> 1:27:02.860\n Can you elaborate?\n\n1:27:02.860 --> 1:27:10.080\n Well, you do, so we talked about how all the different other kinds of knowing had specific\n\n1:27:10.080 --> 1:27:17.020\n kinds of memory, semantic memory for propositional, procedural, episodic for perspectival.\n\n1:27:17.020 --> 1:27:23.420\n What's the kind of memory that is the coordinated storehouse of all of your agent arena relationships?\n\n1:27:23.420 --> 1:27:28.020\n All the roles you can take, all the identities you can assume, all the identities you can\n\n1:27:28.020 --> 1:27:29.020\n assign.\n\n1:27:29.020 --> 1:27:30.020\n Yeah, what's the self?\n\n1:27:30.020 --> 1:27:31.020\n Do you mean like consciousness?\n\n1:27:31.020 --> 1:27:33.580\n No, I mean your sense of self.\n\n1:27:33.580 --> 1:27:38.020\n Sense of self in this world that's not consciousness.\n\n1:27:38.020 --> 1:27:40.620\n It's like an agency or something.\n\n1:27:40.620 --> 1:27:43.340\n Right, it's an agent arena relationship.\n\n1:27:43.340 --> 1:27:50.260\n And so in an agent arena relationship, it's the sense of the agent.\n\n1:27:50.260 --> 1:27:52.880\n And that the agent belongs in that arena.\n\n1:27:52.880 --> 1:27:58.860\n Whatever the agent is, whatever the arena is, because it's probably a bunch of different\n\n1:27:58.860 --> 1:28:01.700\n framings of how you experience that.\n\n1:28:01.700 --> 1:28:04.260\n Yeah, and you do.\n\n1:28:04.260 --> 1:28:09.120\n In your identity as a self, you have all kinds of roles that are somehow contributing to\n\n1:28:09.120 --> 1:28:12.740\n that identity, but are not equivalent to that identity.\n\n1:28:12.740 --> 1:28:13.740\n Yeah.\n\n1:28:13.740 --> 1:28:20.100\n I wonder if like my two hands have different, because there's a different experience of\n\n1:28:20.100 --> 1:28:25.220\n me picking up something with my right hand and then my left hand.\n\n1:28:25.220 --> 1:28:28.060\n Are those like...\n\n1:28:28.060 --> 1:28:30.180\n That's a really cool question, Lex.\n\n1:28:30.180 --> 1:28:37.580\n They certainly feel like their own things, but that could be just anthropomorphization\n\n1:28:37.580 --> 1:28:40.060\n based on cultural narratives and so on.\n\n1:28:40.060 --> 1:28:43.540\n It could, but I think it's a legitimate empirical question because it also could be sort of\n\n1:28:43.540 --> 1:28:45.020\n Ian McGilchrist stuff.\n\n1:28:45.020 --> 1:28:50.220\n It could be you're using different hemispheres and they sort of have different agent arena\n\n1:28:50.220 --> 1:28:52.080\n relationships to the environment.\n\n1:28:52.080 --> 1:28:55.780\n This is a really important question in the cognitive science of the self.\n\n1:28:55.780 --> 1:29:00.500\n Does that hemispheric difference mean you're multiple or you actually have a singular self?\n\n1:29:00.500 --> 1:29:03.780\n So it's important to understand how many cells are there.\n\n1:29:03.780 --> 1:29:05.380\n Yes, I think so.\n\n1:29:05.380 --> 1:29:09.580\n But that's just like a quirk of evolution.\n\n1:29:09.580 --> 1:29:14.620\n Surely it can be fundamental to cognition, having multiple cells or a singular self.\n\n1:29:14.620 --> 1:29:22.620\n It depends, again, because we're getting far from the answer to the question you originally\n\n1:29:22.620 --> 1:29:23.620\n asked me.\n\n1:29:23.620 --> 1:29:25.260\n Do you want me to go back to that first or answer this one?\n\n1:29:25.260 --> 1:29:26.260\n Which question?\n\n1:29:26.260 --> 1:29:27.260\n I already forgot everything.\n\n1:29:27.260 --> 1:29:28.740\n What's the functionality of religion?\n\n1:29:28.740 --> 1:29:29.740\n Yes.\n\n1:29:29.740 --> 1:29:30.740\n Okay.\n\n1:29:30.740 --> 1:29:31.740\n Let us return.\n\n1:29:31.740 --> 1:29:32.740\n Okay.\n\n1:29:32.740 --> 1:29:33.740\n And then we can return to the self.\n\n1:29:33.740 --> 1:29:34.740\n Okay.\n\n1:29:34.740 --> 1:29:38.700\n So you said you have all these propositions and et cetera, et cetera, and they differ\n\n1:29:38.700 --> 1:29:45.060\n from the religions and they don't seem to be considered legitimate by many people.\n\n1:29:45.060 --> 1:29:51.340\n But yet there's something functioning in the religions that is transforming people and\n\n1:29:51.340 --> 1:29:52.580\n making them wiser.\n\n1:29:52.580 --> 1:29:57.980\n And I put it to you that the transformations are largely occurring at those nonpropositional\n\n1:29:57.980 --> 1:29:59.540\n levels.\n\n1:29:59.540 --> 1:30:04.060\n The procedural, the perspectival, and the participatory.\n\n1:30:04.060 --> 1:30:08.540\n And those are the ones, by the way, that are more fundamentally connected to meaning making\n\n1:30:08.540 --> 1:30:14.820\n because remember the propositions are representational and they're dependent on the nonpropositional,\n\n1:30:14.820 --> 1:30:18.660\n nonrepresentational processes of connectedness and relevance realization.\n\n1:30:18.660 --> 1:30:22.460\n So religion goes down deep to the nonpropositional and works there.\n\n1:30:22.460 --> 1:30:24.380\n That's the functionality we need to grasp.\n\n1:30:24.380 --> 1:30:30.140\n Well, you talk about tools, essentially, that humans are able to incorporate into their\n\n1:30:30.140 --> 1:30:31.140\n cognition.\n\n1:30:31.140 --> 1:30:36.940\n Psychotechnologies, like language is one, I suppose.\n\n1:30:36.940 --> 1:30:39.820\n Isn't religion then a psychotechnology?\n\n1:30:39.820 --> 1:30:43.580\n It would be, yeah, an ecology of psychotechnologies, yes.\n\n1:30:43.580 --> 1:30:49.580\n And the question is that Nietzsche ruined everything by saying God is dead.\n\n1:30:49.580 --> 1:30:52.300\n Do we have to invent the new thing?\n\n1:30:52.300 --> 1:30:57.500\n Go from the old phone, create the iPhone, invent the new psychotechnology that takes\n\n1:30:57.500 --> 1:30:59.020\n place of religion.\n\n1:30:59.020 --> 1:31:03.900\n And so when the madman in Nietzsche's text goes into the marketplace, who's he talking\n\n1:31:03.900 --> 1:31:04.900\n to?\n\n1:31:04.900 --> 1:31:06.580\n He's not talking to the believers.\n\n1:31:06.580 --> 1:31:11.700\n He's talking to the atheists and he says, do you not realize what we have done?\n\n1:31:11.700 --> 1:31:14.980\n We have taken a sponge and wiped away the sky.\n\n1:31:14.980 --> 1:31:16.420\n We are now forever falling.\n\n1:31:16.420 --> 1:31:18.120\n We are unchained from the sun.\n\n1:31:18.120 --> 1:31:20.980\n We have to become worthy of this.\n\n1:31:20.980 --> 1:31:23.740\n But Nietzsche is full of romantic bullshit, as we know.\n\n1:31:23.740 --> 1:31:24.740\n No, no, no.\n\n1:31:24.740 --> 1:31:25.740\n No, but there's a point there.\n\n1:31:25.740 --> 1:31:26.740\n Yes.\n\n1:31:26.740 --> 1:31:31.500\n The point is, right, there's one thing to rejecting the proposition.\n\n1:31:31.500 --> 1:31:37.900\n There's another project of replacing the functionality that we lost when we reject the religion.\n\n1:31:37.900 --> 1:31:47.420\n So his worry that as nihilism takes hold, you don't ever replace the thing that religion,\n\n1:31:47.420 --> 1:31:49.580\n the role that religion played in our world.\n\n1:31:49.580 --> 1:31:54.820\n It's hard to tell what he actually, because he's so multivocal.\n\n1:31:54.820 --> 1:31:57.260\n I'll speak for me rather than for Nietzsche.\n\n1:31:57.260 --> 1:32:04.140\n I think it is possible to, using the best cognitive science and respectfully exacting\n\n1:32:04.140 --> 1:32:11.020\n what we can from the best religion and philosophical traditions, because there's things like stoicism\n\n1:32:11.020 --> 1:32:16.480\n that are in the grey line between philosophy and religion, Buddhism is the same.\n\n1:32:16.480 --> 1:32:24.300\n Using that best cocci, that best exaptation, we can come up with that functionality without\n\n1:32:24.300 --> 1:32:30.740\n having to buy into the particular propositional sets of the legacy religions.\n\n1:32:30.740 --> 1:32:31.740\n That's my proposal.\n\n1:32:31.740 --> 1:32:34.140\n I call that the religion that's not a religion.\n\n1:32:34.140 --> 1:32:39.780\n So things like stoicism or modern stoicism, those things, don't you think in some sense\n\n1:32:39.780 --> 1:32:43.500\n they naturally emerge?\n\n1:32:43.500 --> 1:32:46.460\n Don't you think there's a longing for meaning?\n\n1:32:46.460 --> 1:32:52.540\n So stoicism arises during the Hellenistic period when there was a significant meaning\n\n1:32:52.540 --> 1:32:59.100\n crisis in the ancient world because of what had happened after the breakup of Alexander\n\n1:32:59.100 --> 1:33:00.540\n the Great's empire.\n\n1:33:00.540 --> 1:33:06.820\n So if you compare Aristotle to people who are living after Alexander.\n\n1:33:06.820 --> 1:33:13.140\n So Aristotle grows up in a place where everybody speaks the same language, has the same religion,\n\n1:33:13.140 --> 1:33:16.820\n his ancestors have been there for years, he knows everybody.\n\n1:33:16.820 --> 1:33:22.180\n After Alexander the Great's empire is broken up, people are now thousands of miles away\n\n1:33:22.180 --> 1:33:29.180\n from the government, they're surrounded by people because of the diasporas, they're surrounded\n\n1:33:29.180 --> 1:33:32.660\n by people that don't speak their language, don't share their religion, that's why you\n\n1:33:32.660 --> 1:33:38.100\n get all these mother religions emerging, universal mother religions like ISIS, etc.\n\n1:33:38.100 --> 1:33:43.100\n So there is what's called domicile, there's the killing of home, there's a loss of a\n\n1:33:43.100 --> 1:33:49.740\n sense of home and belonging and fittedness during the Hellenistic period and stoicism\n\n1:33:49.740 --> 1:33:52.660\n arose specifically to address that.\n\n1:33:52.660 --> 1:33:58.060\n And because it was designed to address a meaning crisis, it is no coincidence that it is coming\n\n1:33:58.060 --> 1:34:00.780\n back into prominence right now.\n\n1:34:00.780 --> 1:34:06.900\n Well there could be a lot of other variations and it feels like, I think when you speak\n\n1:34:06.900 --> 1:34:13.780\n of the meaning crisis, you're in part describing, not prescribing, you're describing something\n\n1:34:13.780 --> 1:34:14.780\n that is happening.\n\n1:34:14.780 --> 1:34:23.500\n But I would venture to say that if we just leave things be, the meaning crisis dissipates\n\n1:34:23.500 --> 1:34:30.500\n because we long to create institutions, to create collective ideas, so this distributed\n\n1:34:30.500 --> 1:34:33.900\n cognition process that give us meaning.\n\n1:34:33.900 --> 1:34:40.700\n So if religion loses power, we'll find other institutions that are sources of meaning.\n\n1:34:40.700 --> 1:34:41.700\n I don't...\n\n1:34:41.700 --> 1:34:44.300\n Is that your intuition as well?\n\n1:34:44.300 --> 1:34:48.100\n I think we are already doing that.\n\n1:34:48.100 --> 1:34:55.340\n I am involved with and do participant observation of many of these emerging communities that\n\n1:34:55.340 --> 1:35:00.660\n are creating a colleges of practice that are specifically about trying to address the meaning\n\n1:35:00.660 --> 1:35:01.660\n crisis.\n\n1:35:01.660 --> 1:35:07.180\n I just, in late July, went to Washington State and did Rafe Kelly's Evolve Move Play, Return\n\n1:35:07.180 --> 1:35:12.540\n to the Source, and wow, one of the most challenging things I've ever done.\n\n1:35:12.540 --> 1:35:13.540\n That guy is awesome, by the way.\n\n1:35:13.540 --> 1:35:17.220\n I got to interact with him a long, long time ago.\n\n1:35:17.220 --> 1:35:18.780\n He said to say hi to you, by the way.\n\n1:35:18.780 --> 1:35:19.780\n Yeah.\n\n1:35:19.780 --> 1:35:20.780\n It's from another world.\n\n1:35:20.780 --> 1:35:26.820\n It feels like a different world because I interacted with him, not directly, but...\n\n1:35:26.820 --> 1:35:27.820\n This is somebody...\n\n1:35:27.820 --> 1:35:34.540\n He can speak to what he works on, but he makes movement and play...\n\n1:35:34.540 --> 1:35:39.260\n He encourages people to make that a part of their life, like how you move about the world,\n\n1:35:39.260 --> 1:35:44.820\n whether that's as part of sort of athletic endeavors or actual just like walking around\n\n1:35:44.820 --> 1:35:47.060\n a city.\n\n1:35:47.060 --> 1:35:52.060\n And I think the reason I ran into him is because there was a lot of interest in that in the\n\n1:35:52.060 --> 1:35:56.780\n athletic world, in the grappling world, in the Brazilian jiu jitsu world, people who\n\n1:35:56.780 --> 1:36:01.380\n study movement, who make movement part of their lives to see how can we integrate play\n\n1:36:01.380 --> 1:36:08.800\n and fun and just the basic humanness that's natural to our movement.\n\n1:36:08.800 --> 1:36:11.540\n How do we integrate that into our daily practice?\n\n1:36:11.540 --> 1:36:14.980\n So this is yet another way to find meaning.\n\n1:36:14.980 --> 1:36:19.420\n I think it's actually an exemplar of what I was talking about because what's going on\n\n1:36:19.420 --> 1:36:28.420\n with Raif's integration of parkour in nature and martial arts and mindfulness practices\n\n1:36:28.420 --> 1:36:35.740\n and dialogical practices is exactly, and explicitly so by the way, he will tell you he's been\n\n1:36:35.740 --> 1:36:37.620\n very influenced by my work.\n\n1:36:37.620 --> 1:36:43.180\n He's trying to get at the nonpropositional kinds of knowing that make meaning by evolving\n\n1:36:43.180 --> 1:36:48.540\n our sensory motor loop and enhancing our relevance realization because that gives people profound\n\n1:36:48.540 --> 1:36:53.380\n improved sense of connectedness to themselves, to each other and the world.\n\n1:36:53.380 --> 1:37:00.060\n And I'll tell you, Lex, I don't want to say too specifically the final thing that people\n\n1:37:00.060 --> 1:37:03.780\n did because it's part of his secret sauce, right?\n\n1:37:03.780 --> 1:37:08.460\n But what I can say is when it was done, I said to them all, I said, as far as I can\n\n1:37:08.460 --> 1:37:10.620\n tell, none of you are religious, right?\n\n1:37:10.620 --> 1:37:15.620\n And they go, yeah, yeah, and I said, but what you just did was a religious act, wasn't it?\n\n1:37:15.620 --> 1:37:18.140\n And they all went, yeah, it was.\n\n1:37:18.140 --> 1:37:19.140\n Yeah.\n\n1:37:19.140 --> 1:37:21.420\n So that same magic was there.\n\n1:37:21.420 --> 1:37:22.420\n Yes.\n\n1:37:22.420 --> 1:37:23.980\n Bathroom break.\n\n1:37:23.980 --> 1:37:24.980\n Sure.\n\n1:37:24.980 --> 1:37:30.380\n What's your take on atheism in general?\n\n1:37:30.380 --> 1:37:38.220\n Is it closer to truth than, maybe is an atheist closer to truth than a person who believes\n\n1:37:38.220 --> 1:37:40.020\n in God?\n\n1:37:40.020 --> 1:37:45.460\n So I'm a nontheist, which means I think the shared set of presuppositions between the\n\n1:37:45.460 --> 1:37:49.700\n theist and the atheist are actually what needs to be rejected.\n\n1:37:49.700 --> 1:37:53.540\n Can you explain that further?\n\n1:37:53.540 --> 1:37:56.220\n Yes, I can.\n\n1:37:56.220 --> 1:38:03.860\n And I want to point out, by the way, that there are lots of nontheistic religious traditions.\n\n1:38:03.860 --> 1:38:07.740\n So I'm not coming up with a sort of airy fairy category.\n\n1:38:07.740 --> 1:38:08.740\n Yeah.\n\n1:38:08.740 --> 1:38:14.020\n And what's the difference in nontheism, agnosticism and atheism?\n\n1:38:14.020 --> 1:38:21.760\n So nontheists think that the theist and the atheist share a bunch of presuppositions.\n\n1:38:21.760 --> 1:38:31.020\n For example, it's that sacredness is to be understood in terms of a personal being that\n\n1:38:31.020 --> 1:38:36.140\n is, in some sense, the supreme being, and that the right relationship to that being\n\n1:38:36.140 --> 1:38:39.500\n is to have a correct set of beliefs.\n\n1:38:39.500 --> 1:38:41.660\n I reject all of those claims.\n\n1:38:41.660 --> 1:38:44.420\n So both the theist and the atheist see God.\n\n1:38:44.420 --> 1:38:46.960\n In their modern version, yes, yes.\n\n1:38:46.960 --> 1:38:53.360\n In which, do you reject it in the sense that you don't know, or do you reject it in a sense\n\n1:38:53.360 --> 1:39:02.940\n that you believe that each one of those presuppositions is likely to be not true?\n\n1:39:02.940 --> 1:39:04.480\n The latter.\n\n1:39:04.480 --> 1:39:12.020\n Both on reflection, argument, and personal experimentation and experience, I've come\n\n1:39:12.020 --> 1:39:16.460\n to the conclusion that those shared propositions are probably not true.\n\n1:39:16.460 --> 1:39:20.020\n Which one is the most troublesome to you?\n\n1:39:20.020 --> 1:39:25.800\n The personal being, the kind of accumulation of everything into one being that ultimately\n\n1:39:25.800 --> 1:39:27.840\n created stuff?\n\n1:39:27.840 --> 1:39:29.780\n So for me, there's two, and they're interlocked together.\n\n1:39:29.780 --> 1:39:31.660\n I'm not trying to dodge your question.\n\n1:39:31.660 --> 1:39:39.900\n It's that the idea that the ground of being is some kind of being, I think, is a fundamental\n\n1:39:39.900 --> 1:39:40.900\n mistake.\n\n1:39:40.900 --> 1:39:41.900\n It's void of being?\n\n1:39:41.900 --> 1:39:45.020\n No, no, no.\n\n1:39:45.020 --> 1:39:48.620\n The ground of being is some kind of being, so it's turtles all the way down.\n\n1:39:48.620 --> 1:39:50.940\n The ground of being is not itself any kind of being.\n\n1:39:50.940 --> 1:39:53.340\n Being is not a being.\n\n1:39:53.340 --> 1:40:00.220\n It is the ability for things to be, which is not the same thing as a being.\n\n1:40:00.220 --> 1:40:02.060\n Are humans beings?\n\n1:40:02.060 --> 1:40:03.060\n We are beings.\n\n1:40:03.060 --> 1:40:04.060\n This glass is a being.\n\n1:40:04.060 --> 1:40:05.820\n This table is a being.\n\n1:40:05.820 --> 1:40:13.120\n But when I ask you, how are they all in being, you don't say, by being a glass or by being\n\n1:40:13.120 --> 1:40:15.620\n a table or by being a human.\n\n1:40:15.620 --> 1:40:20.120\n You want to say, no, no, there's something underneath it all, and then you realize it\n\n1:40:20.120 --> 1:40:21.900\n can't be any thing.\n\n1:40:21.900 --> 1:40:28.020\n This is why many mystical traditions converge on the idea that the ground of being is no\n\n1:40:28.020 --> 1:40:32.700\n thingness, which is normally pronounced as nothingness.\n\n1:40:32.700 --> 1:40:40.220\n But if you put the hyphen back in, you get the original intent, no thingness.\n\n1:40:40.220 --> 1:40:46.620\n That is bound up with, okay, what I need to do in order to be in relationship with … So,\n\n1:40:46.620 --> 1:40:52.100\n it's a misconstruing of ultimate reality as a supreme being, which is a category mistake\n\n1:40:52.100 --> 1:40:58.620\n to my mind, and then my relationship to it, that sacredness is a function of belief.\n\n1:40:58.620 --> 1:41:02.860\n And I have been presenting you an argument through most of our discussion that meaning\n\n1:41:02.860 --> 1:41:07.860\n is at a deeper level than beliefs and propositions.\n\n1:41:07.860 --> 1:41:12.980\n And so, that is a misunderstanding of sacredness, because I take sacredness to be that which\n\n1:41:12.980 --> 1:41:18.260\n is most meaningful and connected to what is most real.\n\n1:41:18.260 --> 1:41:23.060\n And theists think of sacredness as what?\n\n1:41:23.060 --> 1:41:33.340\n They think of sacredness as a property of a particular being, God, and that the way\n\n1:41:33.340 --> 1:41:39.820\n that is meaningful to them is by asserting a set of propositions or beliefs.\n\n1:41:39.820 --> 1:41:45.780\n Now, I want to point out that this is what I would now call modern or common theism.\n\n1:41:45.780 --> 1:41:51.980\n You go back into the classical periods of Christianity, you get a view that's really\n\n1:41:51.980 --> 1:41:55.140\n radically different from how most people understand theism today.\n\n1:41:55.140 --> 1:42:00.500\n Okay, so let me … This is an interesting question that I usually think about in the\n\n1:42:00.500 --> 1:42:09.380\n form of mathematics, but … So, in that case, if meaning is sacred in your nontheist view,\n\n1:42:09.380 --> 1:42:14.260\n is meaning created or is it discovered?\n\n1:42:14.260 --> 1:42:20.980\n There's a Latin word that doesn't separate them called inventio, and I would say that,\n\n1:42:20.980 --> 1:42:27.340\n and before you say, oh, well, give me a chance, because you participate in it.\n\n1:42:27.340 --> 1:42:29.740\n You've experienced an insight, yes?\n\n1:42:29.740 --> 1:42:32.940\n Did you make it happen?\n\n1:42:32.940 --> 1:42:35.060\n The insight …\n\n1:42:35.060 --> 1:42:38.900\n Did you make it happen or did … Did you do … Like, can you do that?\n\n1:42:38.900 --> 1:42:39.900\n I'm going to have … I need an insight.\n\n1:42:39.900 --> 1:42:41.940\n This is what I do to make an insight.\n\n1:42:41.940 --> 1:42:42.940\n Oh, I see.\n\n1:42:42.940 --> 1:42:45.900\n Yeah, in some sense, it came from elsewhere.\n\n1:42:45.900 --> 1:42:48.980\n Right, but you didn't just passively receive it, either.\n\n1:42:48.980 --> 1:42:51.100\n You're engaged and involved in it.\n\n1:42:51.100 --> 1:42:52.360\n That's why you get … Right?\n\n1:42:52.360 --> 1:42:54.580\n So that's what I mean by you participate in it.\n\n1:42:54.580 --> 1:42:56.020\n You participate in meaning.\n\n1:42:56.020 --> 1:42:58.100\n So you do think that it's both?\n\n1:42:58.100 --> 1:42:59.100\n Yes.\n\n1:42:59.100 --> 1:43:00.100\n You do think it's both?\n\n1:43:00.100 --> 1:43:08.580\n I mean, that's not a trivial thing to understand, because a lot of time we think … When you\n\n1:43:08.580 --> 1:43:15.500\n think about a search for meaning, you think … It's like you're going through a big\n\n1:43:15.500 --> 1:43:20.260\n house and you open each door and look if it's there and so on, as if there is going to be\n\n1:43:20.260 --> 1:43:31.780\n a glowing orb that you discover, but at the same time, I'm somebody that, based on the\n\n1:43:31.780 --> 1:43:36.500\n chemistry of my brain, have been extremely fortunate to be able to discover beauty in\n\n1:43:36.500 --> 1:43:40.500\n everything, in the most mundane and boring of things.\n\n1:43:40.500 --> 1:43:46.500\n I am, as David Foster Wallace said, unboreable.\n\n1:43:46.500 --> 1:43:52.860\n I could just sit in a room, just like playing with a tennis ball or something and be excited,\n\n1:43:52.860 --> 1:43:56.660\n basically like a dog, I think, endlessly.\n\n1:43:56.660 --> 1:44:06.380\n So to me, meaning is created, because I could create meaning out of everything, but of course,\n\n1:44:06.380 --> 1:44:08.560\n it doesn't require a partner.\n\n1:44:08.560 --> 1:44:13.900\n It does require dance partners, whatever, it does require the tennis ball.\n\n1:44:13.900 --> 1:44:18.100\n But honestly, that's what a lot of people that I don't necessarily … We'll talk\n\n1:44:18.100 --> 1:44:19.100\n about it.\n\n1:44:19.100 --> 1:44:24.820\n I don't practice meditation, but people who meditate very seriously, like the entire\n\n1:44:24.820 --> 1:44:32.980\n days for months kind of thing, they talk about being able to discover meaning in just the\n\n1:44:32.980 --> 1:44:38.980\n wind or something, like they just … The breath and everything, just subtle sensory\n\n1:44:38.980 --> 1:44:45.320\n experiences give you deep fulfillment.\n\n1:44:45.320 --> 1:44:47.060\n So that's, again, it's interaction.\n\n1:44:47.060 --> 1:44:54.900\n Actually, I do want to say, because the interesting difference that you've drawn between nontheism,\n\n1:44:54.900 --> 1:45:01.420\n theism and atheism, where's the agreement or disagreement between you and Jordan Peterson\n\n1:45:01.420 --> 1:45:02.420\n on this?\n\n1:45:02.420 --> 1:45:08.580\n I want to say to Jordan about this, because you're very clear, it's kind of beautiful\n\n1:45:08.580 --> 1:45:11.500\n in the clarity in which you lay this out.\n\n1:45:11.500 --> 1:45:15.920\n I wonder if Jordan has arrived at a similar kind of clarity.\n\n1:45:15.920 --> 1:45:21.980\n Have you been able to draw any kind of lines between the way the two of you see religion?\n\n1:45:21.980 --> 1:45:22.980\n Yeah.\n\n1:45:22.980 --> 1:45:28.620\n So there was a video released, I think, like two or three weeks ago with Jordan and myself\n\n1:45:28.620 --> 1:45:29.620\n and Jonathan Paget.\n\n1:45:29.620 --> 1:45:31.020\n Oh, I haven't watched that one yet, yeah.\n\n1:45:31.020 --> 1:45:33.220\n And it's around this question, Lux.\n\n1:45:33.220 --> 1:45:39.380\n He's basically sort of making, he's putting together an argument for God.\n\n1:45:39.380 --> 1:45:40.660\n I mean, I think that's a fair way.\n\n1:45:40.660 --> 1:45:44.500\n I don't think he would object to me saying that.\n\n1:45:44.500 --> 1:45:50.900\n And Jonathan Paget is also a, well, Jonathan is a Christian, it's unclear what Jordan\n\n1:45:50.900 --> 1:45:52.620\n is.\n\n1:45:52.620 --> 1:45:56.940\n And Jonathan's work is on symbolism and different mythologies and Christianity.\n\n1:45:56.940 --> 1:46:01.820\n Yes, especially Neoplatonic Christianity, which is very important.\n\n1:46:01.820 --> 1:46:04.500\n I have a lot of respect, well, I have a lot of respect for both of them, but I have a\n\n1:46:04.500 --> 1:46:05.980\n lot of respect for Jonathan.\n\n1:46:05.980 --> 1:46:15.180\n But in my participation in that dialogue, you could see me, well, repeatedly, but I\n\n1:46:15.180 --> 1:46:19.940\n think everybody, including Jordan, thought constructively challenging sort of the attempt\n\n1:46:19.940 --> 1:46:24.000\n to build a theistic model, and I was challenging it from a nontheistic perspective.\n\n1:46:24.000 --> 1:46:32.460\n So I think we don't agree on certain sets of propositions.\n\n1:46:32.460 --> 1:46:38.460\n But there was a lot of, there was also a lot of acknowledgement, and I think genuine appreciation\n\n1:46:38.460 --> 1:46:43.060\n on his part and Jonathan's part of the arguments I was making.\n\n1:46:43.060 --> 1:46:48.980\n So they believe in maybe the presupposition of like a supreme being.\n\n1:46:48.980 --> 1:46:57.420\n Not believe, but they see the power of that particular presupposition in being a source\n\n1:46:57.420 --> 1:46:58.420\n of meaning.\n\n1:46:58.420 --> 1:47:01.380\n I think that's relatively clear for me with Jordan.\n\n1:47:01.380 --> 1:47:04.740\n Jordan's a really complex guy, so it's very hard to just like pin.\n\n1:47:04.740 --> 1:47:12.080\n To my best sort of understanding, yes, I think that's clearly the case for Jordan.\n\n1:47:12.080 --> 1:47:14.480\n It's not the case for Jonathan.\n\n1:47:14.480 --> 1:47:18.840\n Jonathan is, remember I said I was talking about modern atheism and theism?\n\n1:47:18.840 --> 1:47:26.940\n Jonathan is a guy who somehow went into icon carving and Maximus the Confessor and Eastern\n\n1:47:26.940 --> 1:47:31.700\n Orthodoxy and has come out of it at the other end as a fifth century church father that\n\n1:47:31.700 --> 1:47:38.220\n is nevertheless being, rightfully so, found to be increasingly relevant to many people.\n\n1:47:38.220 --> 1:47:40.260\n So he's deeply old school.\n\n1:47:40.260 --> 1:47:47.020\n Yeah, I think he has, he and I, especially because Neoplatonism is a nontheistic philosophical\n\n1:47:47.020 --> 1:47:52.580\n spirituality and it's a big part of Eastern Orthodoxy, he and I, I think, he would say\n\n1:47:52.580 --> 1:47:54.740\n things like, God doesn't exist.\n\n1:47:54.740 --> 1:47:55.740\n What?\n\n1:47:55.740 --> 1:47:57.380\n You're a Christian, right?\n\n1:47:57.380 --> 1:48:02.340\n And then he's being coy, but he'll say, well, God doesn't exist the way the cup exists or\n\n1:48:02.340 --> 1:48:06.300\n the table exists, the same kind of move I was making a few minutes ago.\n\n1:48:06.300 --> 1:48:08.180\n He'll say things like that.\n\n1:48:08.180 --> 1:48:15.500\n He will emphasize the no thingness of ultimate reality, the no thingness of God, because\n\n1:48:15.500 --> 1:48:22.100\n he's from that version of Christianity, what you might call classical theism, but classical\n\n1:48:22.100 --> 1:48:27.140\n theism looks a lot more like nontheism than it looks like modern theism.\n\n1:48:27.140 --> 1:48:29.140\n That's so interesting.\n\n1:48:29.140 --> 1:48:31.060\n Yeah, that's really interesting.\n\n1:48:31.060 --> 1:48:38.700\n What about, is there a line to be drawn between myth and religion in terms of its usefulness\n\n1:48:38.700 --> 1:48:42.060\n in man's search for meaning?\n\n1:48:42.060 --> 1:48:46.460\n So here's where Jordan and I are in much more, actually all three of us are in significant\n\n1:48:46.460 --> 1:48:47.460\n agreement.\n\n1:48:47.460 --> 1:48:52.100\n I said this in my series, but I want to say it again here.\n\n1:48:52.100 --> 1:48:58.460\n Myths aren't stories about things that happened in the deep past that are largely irrelevant.\n\n1:48:58.460 --> 1:49:05.620\n Myths are stories about perennial or pertinent patterns that need to be brought into awareness.\n\n1:49:05.620 --> 1:49:11.180\n And they need to be brought into an awareness, not just or primarily at the propositional\n\n1:49:11.180 --> 1:49:14.020\n level, but at those nonpropositional levels.\n\n1:49:14.020 --> 1:49:17.300\n And I think that is what good mythos does.\n\n1:49:17.300 --> 1:49:21.580\n I prefer to use the Greek word because we've now turned the English word into a synonym\n\n1:49:21.580 --> 1:49:25.620\n for a widely believed falsehood.\n\n1:49:25.620 --> 1:49:31.140\n And I don't think, again, if you go back even to the church fathers, I'm not a Christian,\n\n1:49:31.140 --> 1:49:36.740\n I'm not advocating for Christianity, but neither am I here to attack it.\n\n1:49:36.740 --> 1:49:44.340\n But when they talk about reading these stories, they think the literal interpretation is the\n\n1:49:44.340 --> 1:49:47.140\n weakest and the least important.\n\n1:49:47.140 --> 1:49:54.100\n You move to the allegorical or the symbolic, to the moral, to the spiritual, the mystical,\n\n1:49:54.100 --> 1:49:56.340\n and that's where...\n\n1:49:56.340 --> 1:50:05.220\n So they would say to you, but how is the story of Adam and Eve true for you now?\n\n1:50:05.220 --> 1:50:10.000\n And I don't mean true for you in that relativistic sense, I mean, how is it pointing to a pattern\n\n1:50:10.000 --> 1:50:12.160\n in your life right now?\n\n1:50:12.160 --> 1:50:19.740\n So there is some sense in which the telling of this mythos becomes real in connecting\n\n1:50:19.740 --> 1:50:23.940\n to the patterns that kind of captivate the public today.\n\n1:50:23.940 --> 1:50:24.940\n Sure.\n\n1:50:24.940 --> 1:50:26.420\n So you just keep telling the story.\n\n1:50:26.420 --> 1:50:31.020\n I mean, there's something about some of these stories that are just really good at being\n\n1:50:31.020 --> 1:50:34.860\n sticky to the patterns of each generation.\n\n1:50:34.860 --> 1:50:35.860\n Yes.\n\n1:50:35.860 --> 1:50:41.420\n And they'll stick to different patterns throughout time, they're just sticky in powerful ways.\n\n1:50:41.420 --> 1:50:42.420\n Yes.\n\n1:50:42.420 --> 1:50:46.900\n And so we keep returning back to them again and again and again.\n\n1:50:46.900 --> 1:50:56.940\n And it's important to see that some of these stories are recursive, they're myths about\n\n1:50:56.940 --> 1:51:04.540\n one particular set of patterns, they're myths about not just the important pattern.\n\n1:51:04.540 --> 1:51:13.340\n You get the Jordan stuff about there's heroes and myths are trying to make us understand\n\n1:51:13.340 --> 1:51:16.860\n the need for being heroic in our own lives.\n\n1:51:16.860 --> 1:51:22.100\n One of the things I like to put in counterbalance to that is the Greek also have myths of hubris,\n\n1:51:22.100 --> 1:51:25.560\n that counterbalance the heroic.\n\n1:51:25.560 --> 1:51:34.080\n But then there are myths that are not about those deeply important patterns, but they're\n\n1:51:34.080 --> 1:51:41.460\n myths about religio itself, that the way we're—religio means to bind, to connect, the way relevance\n\n1:51:41.460 --> 1:51:43.260\n realization connects us.\n\n1:51:43.260 --> 1:51:46.680\n And so the point of the myth is not notice that pattern or notice that pattern or notice\n\n1:51:46.680 --> 1:51:55.260\n that pattern, it's notice how all of these patterns are emerging and what does that say\n\n1:51:55.260 --> 1:51:57.460\n about us and reality.\n\n1:51:57.460 --> 1:52:04.580\n And those myths, those myths, I think, are genuinely profound.\n\n1:52:04.580 --> 1:52:11.160\n And how much of the myths, how much of the power of those myths is about the dialogues?\n\n1:52:11.160 --> 1:52:15.700\n You talk about this quite a bit, I think in the first conversation with Jordan, you guys,\n\n1:52:15.700 --> 1:52:20.220\n I'm not sure you've gotten really into it, you scratched the surface a little bit.\n\n1:52:20.220 --> 1:52:25.160\n But the role of, as you say, dialogue in distributed cognition.\n\n1:52:25.160 --> 1:52:26.160\n What is that?\n\n1:52:26.160 --> 1:52:31.500\n The thing we're doing right now, talking with our mouth holes, what is that?\n\n1:52:31.500 --> 1:52:34.820\n And actually, can I ask you this question?\n\n1:52:34.820 --> 1:52:43.100\n If aliens came to Earth and were observing humans, would they notice our distributed\n\n1:52:43.100 --> 1:52:47.600\n cognition first or our individual cognition first?\n\n1:52:47.600 --> 1:52:50.940\n What is the most notable thing about us humans?\n\n1:52:50.940 --> 1:52:55.860\n Is it our ability to individually do well on IQ tests or whatever?\n\n1:52:55.860 --> 1:52:59.660\n Or puzzle solve, or is it this thing we're doing together?\n\n1:52:59.660 --> 1:53:05.780\n I think most of our problem solving is done in distributed cognition.\n\n1:53:05.780 --> 1:53:09.180\n Look around, you didn't make this equipment, you didn't build this place, you didn't invent\n\n1:53:09.180 --> 1:53:12.980\n this language that we're both sharing, et cetera, et cetera.\n\n1:53:12.980 --> 1:53:19.320\n And now there's more specific and precise experimental evidence coming out.\n\n1:53:19.320 --> 1:53:25.180\n Let's take a standard task that people, reasoning task, I won't need to do the details, it's\n\n1:53:25.180 --> 1:53:27.740\n called the waste and selection task.\n\n1:53:27.740 --> 1:53:33.140\n And you give it to people, highly educated psychology students, premier universities\n\n1:53:33.140 --> 1:53:38.980\n across the world, we've been doing it since the 60s, it replicates and replicates, and\n\n1:53:38.980 --> 1:53:43.480\n only 10% of the people get it right.\n\n1:53:43.480 --> 1:53:49.000\n You put them in a group of four, and you allow them to talk to each other, the success rate\n\n1:53:49.000 --> 1:53:51.060\n goes to 80%.\n\n1:53:51.060 --> 1:53:55.980\n That's just one example of a phenomenon that's coming to the fore.\n\n1:53:55.980 --> 1:53:59.720\n By the way, do you know if a similar experiment has been done on a group of engineering students\n\n1:53:59.720 --> 1:54:01.220\n versus psychology students?\n\n1:54:01.220 --> 1:54:04.700\n Is there a major group differences in IQ between those two?\n\n1:54:04.700 --> 1:54:07.240\n Just kidding.\n\n1:54:07.240 --> 1:54:08.240\n Let's move on.\n\n1:54:08.240 --> 1:54:12.860\n All right, so there is a lot of evidence that there's power to this distributed cognition.\n\n1:54:12.860 --> 1:54:17.700\n Now what about this mechanism, this fascinating mechanism of the ants interacting with each\n\n1:54:17.700 --> 1:54:18.700\n other?\n\n1:54:18.700 --> 1:54:19.700\n The dialogue.\n\n1:54:19.700 --> 1:54:25.460\n I use the word discourse or dialogue for just people having a conversation, and this is\n\n1:54:25.460 --> 1:54:33.620\n deeply inspired by Socrates and Plato, especially the Platonic dialogues.\n\n1:54:33.620 --> 1:54:36.940\n And I'm sure we've all had this, and so give me a moment because I want to build onto something\n\n1:54:36.940 --> 1:54:37.940\n here.\n\n1:54:37.940 --> 1:54:43.860\n We've participated in conversations that took on a life of their own and took us both in\n\n1:54:43.860 --> 1:54:48.320\n directions we did not anticipate, afforded us insights that we could not have had on\n\n1:54:48.320 --> 1:54:49.320\n our own.\n\n1:54:49.320 --> 1:54:53.980\n And we don't have to have come to an agreement, but we were both moved and we were both drawn\n\n1:54:53.980 --> 1:54:59.160\n into insight, and we feel like, wow, that was one of the best moments of my life because\n\n1:54:59.160 --> 1:55:07.840\n we feel how that introduced us to a capacity for tapping into a flow state within distributed\n\n1:55:07.840 --> 1:55:15.320\n cognition that puts us into a deeper relationship with ourselves, with another person, and potentially\n\n1:55:15.320 --> 1:55:17.200\n with the world.\n\n1:55:17.200 --> 1:55:19.220\n That's what I mean by dialogos.\n\n1:55:19.220 --> 1:55:30.180\n And so for me, I think dialogos is more important... Boy, I could just... I'm sorry, I can\n\n1:55:30.180 --> 1:55:33.300\n hear Jordan and Jonathan in my head right now, but I think it's more...\n\n1:55:33.300 --> 1:55:35.260\n I hear them all the time.\n\n1:55:35.260 --> 1:55:39.960\n I just wish they would shut up in my head sometimes.\n\n1:55:39.960 --> 1:55:42.040\n So what are they saying to you in your head?\n\n1:55:42.040 --> 1:55:45.960\n What they're saying... Well, see, that's what the most recent conversation was about.\n\n1:55:45.960 --> 1:55:55.600\n I was trying to say that I don't think mythos is... I think mythos is really important.\n\n1:55:55.600 --> 1:56:01.280\n I think these kinds of narratives are really important, but I think this ability to connect\n\n1:56:01.280 --> 1:56:09.880\n together in distributed cognition, collective intelligence, and cultivate a shared flow\n\n1:56:09.880 --> 1:56:14.680\n state within that collective intelligence so it starts to ramp up perhaps towards collective\n\n1:56:14.680 --> 1:56:15.680\n wisdom.\n\n1:56:15.680 --> 1:56:21.400\n I think that's more important because I think that's the basin within which the myths and\n\n1:56:21.400 --> 1:56:25.840\n the rituals are ultimately created and when they function.\n\n1:56:25.840 --> 1:56:28.200\n A myth is like a public dream.\n\n1:56:28.200 --> 1:56:33.160\n It depends on distributed cognition, and it depends on people enacting it and getting\n\n1:56:33.160 --> 1:56:36.160\n into mutual flow states.\n\n1:56:36.160 --> 1:56:44.400\n So the highest form of dialogos of conversation is this flow state, and that it forms the\n\n1:56:44.400 --> 1:56:46.640\n foundation for myth building.\n\n1:56:46.640 --> 1:56:47.800\n I think so.\n\n1:56:47.800 --> 1:56:48.800\n I think so.\n\n1:56:48.800 --> 1:56:53.500\n So that communitas, that's Victor Turner's phrase, and he specifically linked it to flow,\n\n1:56:53.500 --> 1:57:01.920\n and I study flow scientifically, that within distributed cognition as the home, as the\n\n1:57:01.920 --> 1:57:07.600\n generator of mythos and ritual, and those are bound together as well, I think that's\n\n1:57:07.600 --> 1:57:08.600\n fundamentally correct.\n\n1:57:08.600 --> 1:57:14.720\n You know what's the cool thing here, because I'm a huge fan of podcasts and audiobooks,\n\n1:57:14.720 --> 1:57:19.280\n but podcasts in particular is relevant here, is there's a third person in this room listening\n\n1:57:19.280 --> 1:57:23.680\n now, and they're also in the flow state.\n\n1:57:23.680 --> 1:57:24.680\n Yes, yes.\n\n1:57:24.680 --> 1:57:30.120\n Like I'm close friends with a lot of podcasts, they don't know I exist.\n\n1:57:30.120 --> 1:57:34.600\n I just listen to them because I've been in so many flow states with them, and I was like,\n\n1:57:34.600 --> 1:57:36.720\n yes, yes, this is good.\n\n1:57:36.720 --> 1:57:40.360\n But they don't know I exist, but they are in conversation with me, ultimately.\n\n1:57:40.360 --> 1:57:43.200\n And think of what that's doing.\n\n1:57:43.200 --> 1:57:47.440\n You've got dialogues, and then you've got this meta dialogue like you're describing,\n\n1:57:47.440 --> 1:57:54.440\n and think about how things like podcasts and YouTube, they break down old boundaries between\n\n1:57:54.440 --> 1:57:58.240\n the private and the public, between writing and oral speech.\n\n1:57:58.240 --> 1:58:05.160\n So we have the dynamics of living oral speech, but it has the permanency of writing.\n\n1:58:05.160 --> 1:58:12.860\n We're in the midst of creating a vehicle and a medium for distributed cognition that breaks\n\n1:58:12.860 --> 1:58:18.920\n down a lot of the categories by which we organized our cognition.\n\n1:58:18.920 --> 1:58:24.340\n Because of the tools of YouTube and so on, just the network, the graph of how quickly\n\n1:58:24.340 --> 1:58:28.080\n the distributed cognition can spread is really powerful.\n\n1:58:28.080 --> 1:58:31.920\n Just a huge amount of people have listened to your lectures, I've listened to your lectures,\n\n1:58:31.920 --> 1:58:38.280\n but I've experienced them, at least in your style, there's something about your style,\n\n1:58:38.280 --> 1:58:40.840\n it felt like a conversation.\n\n1:58:40.840 --> 1:58:46.360\n It felt like at any moment I could interrupt you and say something, and I was just listening.\n\n1:58:46.360 --> 1:58:52.920\n Thank you for saying that, because I aspire to being genuinely as Socratic as I can when\n\n1:58:52.920 --> 1:58:53.920\n I'm doing this.\n\n1:58:53.920 --> 1:58:57.860\n Yeah, there was that sentence, actually, as I'm saying it now, why was that?\n\n1:58:57.860 --> 1:59:03.600\n It didn't feel like sometimes lectures are kind of, you know, you come down with the\n\n1:59:03.600 --> 1:59:07.760\n commandments and you just want to listen, but there was a sense like, I mean, I think\n\n1:59:07.760 --> 1:59:10.960\n it was the excitement that you have, like, you have to understand, and also the fact\n\n1:59:10.960 --> 1:59:16.800\n that you were kind of, I think, thinking off the top of your head sometimes, there was\n\n1:59:16.800 --> 1:59:21.800\n a, you were interrupting yourself with thoughts, you were playing with thoughts, like you're\n\n1:59:21.800 --> 1:59:27.820\n reasoning through things often, like you had, you referenced a lot of books, so surely\n\n1:59:27.820 --> 1:59:32.120\n you were extremely well prepared and you were referencing a lot of ideas, but then you were\n\n1:59:32.120 --> 1:59:34.200\n also struggling in the way to present those ideas.\n\n1:59:34.200 --> 1:59:40.780\n Yes, there was, and so the jazz, like the jazz and getting into the flow state and trying\n\n1:59:40.780 --> 1:59:47.320\n to share in a participatory and perspectival fashion the learning with the people rather\n\n1:59:47.320 --> 1:59:50.560\n than just pronouncing at them, yes.\n\n1:59:50.560 --> 1:59:52.900\n What's mindfulness?\n\n1:59:52.900 --> 1:59:55.380\n So published on that as well.\n\n1:59:55.380 --> 1:59:59.960\n And I practice, I've been practicing many forms of mindfulness and ecology of practices\n\n1:59:59.960 --> 2:00:05.800\n since 1991, so I both have practitioner's knowledge and I also study it scientifically.\n\n2:00:05.800 --> 2:00:12.060\n I think, I'm pretty sure I was the first person to academically talk about mindfulness at\n\n2:00:12.060 --> 2:00:16.040\n the University of Toronto within a classroom setting, like lecturing on it.\n\n2:00:16.040 --> 2:00:20.840\n So this is a topic that a lot of people have recently become very interested in, think\n\n2:00:20.840 --> 2:00:27.360\n about, so from that, from the early days, how do you think about what it is?\n\n2:00:27.360 --> 2:00:32.540\n I've critiqued the sort of standard definitions, being aware of the present moment without\n\n2:00:32.540 --> 2:00:37.840\n judgment and because I think they're flawed, and if you want to get into the detail of\n\n2:00:37.840 --> 2:00:43.740\n why we can, but this is how I want to explain it to you, and it also points to the fact\n\n2:00:43.740 --> 2:00:46.680\n of why you need an ecology of mindfulness practices.\n\n2:00:46.680 --> 2:00:49.320\n You shouldn't equate mindfulness with meditation.\n\n2:00:49.320 --> 2:00:50.720\n I think that's a primary mistake.\n\n2:00:50.720 --> 2:00:52.800\n When you say ecology, what do you mean, by the way?\n\n2:00:52.800 --> 2:00:54.840\n So lots of many different variants?\n\n2:00:54.840 --> 2:00:58.360\n No, so what I mean by ecology is exactly what you have in an ecology.\n\n2:00:58.360 --> 2:01:02.800\n You have a dynamical system in which there are checks and balances on each other, right?\n\n2:01:02.800 --> 2:01:07.080\n And I'll get to that with this about mindfulness, so I'll make that connection if you allow\n\n2:01:07.080 --> 2:01:08.320\n me.\n\n2:01:08.320 --> 2:01:11.440\n So we're always framing, we've been talking about that, right?\n\n2:01:11.440 --> 2:01:16.880\n And for those of you who are not on YouTube, this podcast, I wear glasses and I'm now sort\n\n2:01:16.880 --> 2:01:21.940\n of putting my fingers and thumb around the frames of my glasses.\n\n2:01:21.940 --> 2:01:28.600\n So this is my frame, and my lens is, right, and that frame, the frame holds a lens, and\n\n2:01:28.600 --> 2:01:33.720\n I'm seeing through it in both senses, beyond and by means of it.\n\n2:01:33.720 --> 2:01:36.240\n So right now, my glasses are transparent to me.\n\n2:01:36.240 --> 2:01:41.040\n I want to use that as a strong analogy for my mental framing, okay?\n\n2:01:41.040 --> 2:01:45.820\n Now this is what you do in meditation, I would argue.\n\n2:01:45.820 --> 2:01:49.840\n You step back from looking through your frame and you look at it, I'm taking my glasses\n\n2:01:49.840 --> 2:01:51.660\n off right now and I'm looking at them.\n\n2:01:51.660 --> 2:01:52.960\n Why might I do that?\n\n2:01:52.960 --> 2:01:59.560\n To see if there's something in the lenses that is distorting, causing me to, right?\n\n2:01:59.560 --> 2:02:06.600\n Now if I just did that, that could be helpful, but how do I know if I've actually corrected\n\n2:02:06.600 --> 2:02:08.080\n the change I made to my lenses?\n\n2:02:08.080 --> 2:02:09.720\n What do I need to do?\n\n2:02:09.720 --> 2:02:15.400\n I need to put my glasses on and see if I can now see more clearly and deeply than I could\n\n2:02:15.400 --> 2:02:17.300\n before.\n\n2:02:17.300 --> 2:02:21.380\n Meditation is this, stepping back and looking at.\n\n2:02:21.380 --> 2:02:25.940\n Contemplation is that looking through, and there are different kinds of practices.\n\n2:02:25.940 --> 2:02:28.920\n The fact that we treat them as synonyms is a deep mistake.\n\n2:02:28.920 --> 2:02:33.840\n The word contemplation has temple in it, in Latin contemplatio, means to look up to the\n\n2:02:33.840 --> 2:02:34.840\n sky.\n\n2:02:34.840 --> 2:02:39.220\n It's a translation of the Greek word theoria, which we get our word theory from.\n\n2:02:39.220 --> 2:02:41.860\n It's to look deeply into things.\n\n2:02:41.860 --> 2:02:47.080\n Meditation is more about having to do with reflecting upon, standing back and looking\n\n2:02:47.080 --> 2:02:48.600\n at.\n\n2:02:48.600 --> 2:02:50.580\n Mindfulness includes both.\n\n2:02:50.580 --> 2:02:57.240\n It includes your ability to break away from an inappropriate frame and the ability to\n\n2:02:57.240 --> 2:02:59.000\n make a new frame.\n\n2:02:59.000 --> 2:03:00.840\n That's what actually happens in insight.\n\n2:03:00.840 --> 2:03:08.060\n You have to both break an inappropriate frame and make, see, realize a new frame.\n\n2:03:08.060 --> 2:03:10.280\n This is why mindfulness enhances insight.\n\n2:03:10.280 --> 2:03:17.200\n Both ways, by the way, meditative practices and also contemplative practices.\n\n2:03:17.200 --> 2:03:25.800\n So mindfulness is frame awareness that can be appropriated in order to improve your capacities\n\n2:03:25.800 --> 2:03:28.440\n for insight and self regulation.\n\n2:03:28.440 --> 2:03:36.400\n Now I am inexperienced with meditation, the rigorous practice and the science of meditation,\n\n2:03:36.400 --> 2:03:44.200\n but I've talked to people who seriously as a science study psychedelics and they often\n\n2:03:44.200 --> 2:03:49.880\n talk about the really important thing is the sort of the integration back.\n\n2:03:49.880 --> 2:03:52.120\n So the contemplation step.\n\n2:03:52.120 --> 2:03:57.000\n So if you, it's not just the actual things you see on psychedelics or the actual journey\n\n2:03:57.000 --> 2:03:59.640\n of where your mind goes on psychedelics.\n\n2:03:59.640 --> 2:04:05.600\n It's also the integrating that into the new perspective that you take on life.\n\n2:04:05.600 --> 2:04:06.600\n Right.\n\n2:04:06.600 --> 2:04:07.600\n Exactly.\n\n2:04:07.600 --> 2:04:08.600\n You really nicely described.\n\n2:04:08.600 --> 2:04:13.720\n So meditation is the, in that metaphors is the psychedelic journey to a different mind\n\n2:04:13.720 --> 2:04:18.640\n state and then contemplation is the return back to reality, how you integrate that into\n\n2:04:18.640 --> 2:04:22.840\n a new world view and mindfulness is the whole process.\n\n2:04:22.840 --> 2:04:23.840\n Right.\n\n2:04:23.840 --> 2:04:30.880\n So if you just did contemplation, you could suffer from inflation and projective fantasy.\n\n2:04:30.880 --> 2:04:36.040\n If you just do meditation, you can suffer from withdrawal, spiritual bypassing, avoiding\n\n2:04:36.040 --> 2:04:37.040\n reality.\n\n2:04:37.040 --> 2:04:39.260\n They act, they need each other.\n\n2:04:39.260 --> 2:04:40.840\n You have to cycle between them.\n\n2:04:40.840 --> 2:04:45.240\n It's like what I talked about earlier, when I talked about the opponent processing within\n\n2:04:45.240 --> 2:04:49.440\n the autonomic nervous system or the opponent processing at work and attention.\n\n2:04:49.440 --> 2:04:52.680\n And that's what I mean by an ecology of practices.\n\n2:04:52.680 --> 2:04:53.680\n You need both.\n\n2:04:53.680 --> 2:04:55.480\n Neither one is a panacea.\n\n2:04:55.480 --> 2:05:00.600\n You need them in this opponent processing, acting as checks and balance on each other.\n\n2:05:00.600 --> 2:05:05.560\n Is there sort of practical advice you can give to people on how to meditate or how to\n\n2:05:05.560 --> 2:05:09.560\n be mindful in this full way?\n\n2:05:09.560 --> 2:05:10.560\n Yes.\n\n2:05:10.560 --> 2:05:12.920\n I would tell them to do at least three things.\n\n2:05:12.920 --> 2:05:16.960\n And I was, I lucked into this.\n\n2:05:16.960 --> 2:05:21.800\n When I started meditation, I went down the street and there was a place that taught Vipassana\n\n2:05:21.800 --> 2:05:26.880\n meditation, Metta contemplation and Tai Chi Chuan for flow induction.\n\n2:05:26.880 --> 2:05:32.760\n And you should get, you should have a meditative practice, you should find a contemplative\n\n2:05:32.760 --> 2:05:37.520\n practice and you should find a moving mindfulness practice, especially one that is conducive\n\n2:05:37.520 --> 2:05:42.080\n to the flow state and practice them in an integrated fashion.\n\n2:05:42.080 --> 2:05:45.800\n Can you elaborate what those practices might look like?\n\n2:05:45.800 --> 2:05:49.120\n So generally speaking.\n\n2:05:49.120 --> 2:05:52.240\n Meditative practice like Vipassana.\n\n2:05:52.240 --> 2:05:57.080\n So what's the primary thing I look through rather than look at?\n\n2:05:57.080 --> 2:05:58.520\n It's my sensations.\n\n2:05:58.520 --> 2:06:02.940\n So what I'm going to do is I'm going to focus on my sensations rather than focusing on the\n\n2:06:02.940 --> 2:06:04.680\n world through my sensations.\n\n2:06:04.680 --> 2:06:13.120\n So I'm going to follow, for example, the sensations in this area of my abdomen where my breathing\n\n2:06:13.120 --> 2:06:14.120\n is.\n\n2:06:14.120 --> 2:06:19.040\n So I can feel as my abdomen is expanding, I can feel those sensations and then I can\n\n2:06:19.040 --> 2:06:21.000\n feel the sensations as it's contracting.\n\n2:06:21.000 --> 2:06:27.760\n Now what will happen is my mind will leap back to try to look through and look at the\n\n2:06:27.760 --> 2:06:28.760\n world again.\n\n2:06:28.760 --> 2:06:29.760\n Right?\n\n2:06:29.760 --> 2:06:32.680\n I'll start thinking about, I need to do my laundry or what was that noise?\n\n2:06:32.680 --> 2:06:33.880\n And so what do I do?\n\n2:06:33.880 --> 2:06:36.440\n I don't get involved with the content.\n\n2:06:36.440 --> 2:06:43.920\n I step back and label the process with an ING word, listening, imagining, planning.\n\n2:06:43.920 --> 2:06:48.600\n And then I return my attention to the breath and I have to return my attention in the correct\n\n2:06:48.600 --> 2:06:49.600\n way.\n\n2:06:49.600 --> 2:06:52.080\n So part of your mind that jumps around in the Buddhist tradition, this is called your\n\n2:06:52.080 --> 2:06:53.080\n monkey mind.\n\n2:06:53.080 --> 2:06:56.800\n It's like a monkey leaping for branches and chattering, right?\n\n2:06:56.800 --> 2:07:01.800\n If I was trying to train that monkey mind to stay, or as Jack Kornfield said, train\n\n2:07:01.800 --> 2:07:08.880\n a puppy dog, stay puppy dog, and if it goes and I get really angry and I bring it back\n\n2:07:08.880 --> 2:07:13.600\n and I'm yelling at it, I'm going to train it to fight and fear me.\n\n2:07:13.600 --> 2:07:18.920\n But if I just indulge it, if I just feed its whims, oh, look, the puppy dog went there.\n\n2:07:18.920 --> 2:07:20.720\n Oh, now it's there.\n\n2:07:20.720 --> 2:07:21.840\n Puppy dog never learns to stay.\n\n2:07:21.840 --> 2:07:22.840\n What do I need to do?\n\n2:07:22.840 --> 2:07:25.640\n I have to neither fight it nor feed it.\n\n2:07:25.640 --> 2:07:27.080\n I have to have this centered attitude.\n\n2:07:27.080 --> 2:07:29.120\n I have to befriend it.\n\n2:07:29.120 --> 2:07:33.560\n So you step back and look at your sensations.\n\n2:07:33.560 --> 2:07:37.240\n You step back and look at your distracting processes.\n\n2:07:37.240 --> 2:07:40.720\n You return your attention to the breath and you do it with the right attitude.\n\n2:07:40.720 --> 2:07:44.240\n That's the core of a good meditative practice.\n\n2:07:44.240 --> 2:07:45.240\n Okay.\n\n2:07:45.240 --> 2:07:47.680\n Then what's a good contemplative practice?\n\n2:07:47.680 --> 2:07:56.440\n A good contemplative practice is to try and meta, it's actually apropos because we talked\n\n2:07:56.440 --> 2:08:00.400\n about that participatory knowing the way you're situated in the world.\n\n2:08:00.400 --> 2:08:06.200\n So this is a long thing because there's different interpretations of meta and I go for what's\n\n2:08:06.200 --> 2:08:10.520\n called an existential interpretation over an emotional one.\n\n2:08:10.520 --> 2:08:17.700\n So what I'm doing in meta is I'm trying to awaken in two ways.\n\n2:08:17.700 --> 2:08:24.000\n I'm trying to awaken to the fact that I am constantly assuming an identity and assigning\n\n2:08:24.000 --> 2:08:25.000\n an identity.\n\n2:08:25.000 --> 2:08:27.720\n So I'm looking at that.\n\n2:08:27.720 --> 2:08:33.360\n I'm trying to awaken to that and then I'm trying to awake from the modal confusion that\n\n2:08:33.360 --> 2:08:35.720\n I could get into around that.\n\n2:08:35.720 --> 2:08:44.680\n And so I'm looking out onto the world and I'm trying to see you in a fundamentally different\n\n2:08:44.680 --> 2:08:48.400\n way than I have before.\n\n2:08:48.400 --> 2:08:51.120\n You know, like you go to the gym and you do bicep curls.\n\n2:08:51.120 --> 2:08:52.120\n Yeah.\n\n2:08:52.120 --> 2:08:53.120\n Yes.\n\n2:08:53.120 --> 2:08:54.120\n Yes.\n\n2:08:54.120 --> 2:08:55.840\n Is it possible to reduce it to those things that, I mean, you don't need to speak to the\n\n2:08:55.840 --> 2:09:00.760\n specifics, but is there actual practice you can do or is it really personal?\n\n2:09:00.760 --> 2:09:03.200\n No, I teach people how to do the meta practice.\n\n2:09:03.200 --> 2:09:07.560\n I also teach them how to do a Neoplatonic contemplative practice, how to do a Stoic.\n\n2:09:07.560 --> 2:09:09.960\n Another one you can do is the view from above.\n\n2:09:09.960 --> 2:09:11.280\n This is classic Stoicism.\n\n2:09:11.280 --> 2:09:15.600\n I get you to imagine that you're in this room and then imagine that you're floating above\n\n2:09:15.600 --> 2:09:22.000\n the room, then above Austin, then above Texas, then above the United States, then the earth.\n\n2:09:22.000 --> 2:09:24.480\n And you have to really imagine it.\n\n2:09:24.480 --> 2:09:25.960\n Don't just think it, but really imagine.\n\n2:09:25.960 --> 2:09:32.240\n And then what you notice is as you're pulling out to a wider and wider like contemplation\n\n2:09:32.240 --> 2:09:36.720\n of reality, your sense of self and what you find relevant and important also changes.\n\n2:09:36.720 --> 2:09:40.080\n No, for all of these, there is a specific step by step methodology.\n\n2:09:40.080 --> 2:09:45.200\n Oh, so you can, so like in that one, you could just literally imagine yourself floating farther\n\n2:09:45.200 --> 2:09:46.200\n and farther out.\n\n2:09:46.200 --> 2:09:51.540\n But you have to go through the steps because the stepping matters because if you just jump,\n\n2:09:51.540 --> 2:09:52.540\n it doesn't work.\n\n2:09:52.540 --> 2:09:54.760\n Do you have any of this stuff online by the way?\n\n2:09:54.760 --> 2:10:03.840\n I do because during COVID, I decided at the advice of a good friend to do a daily course.\n\n2:10:03.840 --> 2:10:06.240\n I taught meditating with John Vervecki.\n\n2:10:06.240 --> 2:10:10.620\n I did all the way through meditation, contemplation, even some of the movement practices.\n\n2:10:10.620 --> 2:10:11.620\n That's all there.\n\n2:10:11.620 --> 2:10:12.620\n It's all available.\n\n2:10:12.620 --> 2:10:15.480\n That was largely inspired by Buddhism and Taoism.\n\n2:10:15.480 --> 2:10:18.760\n And then I went into the Western tradition and went through things like Stoicism and\n\n2:10:18.760 --> 2:10:21.680\n Neoplatonism, cultivating wisdom with John Vervecki.\n\n2:10:21.680 --> 2:10:23.920\n That's all there, all free.\n\n2:10:23.920 --> 2:10:24.920\n On your website?\n\n2:10:24.920 --> 2:10:25.920\n Yeah.\n\n2:10:25.920 --> 2:10:26.920\n It's on my YouTube channel.\n\n2:10:26.920 --> 2:10:27.920\n Yeah.\n\n2:10:27.920 --> 2:10:28.920\n On your YouTube channel.\n\n2:10:28.920 --> 2:10:29.920\n Okay.\n\n2:10:29.920 --> 2:10:30.920\n That's exciting.\n\n2:10:30.920 --> 2:10:34.460\n I mean, your Meaning Crisis lectures is just incredible.\n\n2:10:34.460 --> 2:10:38.640\n Everything around it, including the notes and the notes that people took, it's just,\n\n2:10:38.640 --> 2:10:41.800\n it created this tree of conversations.\n\n2:10:41.800 --> 2:10:45.360\n It's really, really, really well done.\n\n2:10:45.360 --> 2:10:47.480\n What about flow induction?\n\n2:10:47.480 --> 2:10:48.480\n You want to flow wisely.\n\n2:10:48.480 --> 2:10:55.280\n And first of all, you need to understand what flow is, and then you need to confront a particular\n\n2:10:55.280 --> 2:10:57.520\n issue around, a practical problem around flow.\n\n2:10:57.520 --> 2:11:02.400\n Let's go there because a lot of those words seem like synonyms to people sometimes.\n\n2:11:02.400 --> 2:11:07.000\n So the state of flow, what is it?\n\n2:11:07.000 --> 2:11:08.000\n All right.\n\n2:11:08.000 --> 2:11:11.120\n So, and he just died last year, Csikszentmihalyi.\n\n2:11:11.120 --> 2:11:13.400\n I admire him very much.\n\n2:11:13.400 --> 2:11:20.040\n We've exchanged a bunch of messages over the past few years, and he wanted to do the podcast\n\n2:11:20.040 --> 2:11:21.040\n several times.\n\n2:11:21.040 --> 2:11:22.640\n Oh, that would have been wonderful.\n\n2:11:22.640 --> 2:11:30.040\n But he said he struggled with his health, and I never knew in those situations, I deeply\n\n2:11:30.040 --> 2:11:41.800\n regret several cases like this that I had with Conway, that I should have pushed him\n\n2:11:41.800 --> 2:11:48.960\n on it because, yeah, as you get later in life, things, the simple things become more difficult,\n\n2:11:48.960 --> 2:11:54.320\n but a voice, especially one that hasn't been really heard, is important to hear.\n\n2:11:54.320 --> 2:11:57.000\n So anyway, I apologize, but yeah.\n\n2:11:57.000 --> 2:11:58.000\n No, no.\n\n2:11:58.000 --> 2:11:59.000\n I share that.\n\n2:11:59.000 --> 2:12:06.000\n I mean, I can tell you that within my area, he is important and he's famous in an academics\n\n2:12:06.000 --> 2:12:07.000\n sense.\n\n2:12:07.000 --> 2:12:08.000\n Yeah.\n\n2:12:08.000 --> 2:12:13.520\n So the flow state, two important sets of conditions, and very often people only talk about one,\n\n2:12:13.520 --> 2:12:16.560\n and that's a little bit of a misrepresentation.\n\n2:12:16.560 --> 2:12:24.080\n So the flow state is in situations in which the demand of the situation is slightly beyond\n\n2:12:24.080 --> 2:12:25.880\n your skills.\n\n2:12:25.880 --> 2:12:31.320\n So you both have to apply all the skills you can with as much sort of attention and concentration\n\n2:12:31.320 --> 2:12:36.600\n as you possibly can, and you have to actually be stretching your skills.\n\n2:12:36.600 --> 2:12:44.280\n Now, in this circumstance, people report optimal experience, optimal in two ways.\n\n2:12:44.280 --> 2:12:47.380\n Optimal in that this is one of the best experiences I've had in my life.\n\n2:12:47.380 --> 2:12:51.720\n It's distinct from pleasure, and yet it explains why people do very bizarre things like rock\n\n2:12:51.720 --> 2:12:55.040\n climbing because it's a good flow induction.\n\n2:12:55.040 --> 2:12:58.600\n But they also mean optimal in a second sense, my best performance.\n\n2:12:58.600 --> 2:13:02.880\n So it's both the best experience and the best performance.\n\n2:13:02.880 --> 2:13:09.660\n So Csikszentmihalyi also talked about the information flow conditions you need, right,\n\n2:13:09.660 --> 2:13:13.160\n in order for there to be this state of flow, and then I'll talk about what it's like to\n\n2:13:13.160 --> 2:13:14.400\n be in flow in a sec.\n\n2:13:14.400 --> 2:13:16.820\n What you need is three things.\n\n2:13:16.820 --> 2:13:18.700\n You need the information that you're getting to be clear.\n\n2:13:18.700 --> 2:13:20.760\n It can't be ambiguous or vague.\n\n2:13:20.760 --> 2:13:21.760\n Think about a rock climber.\n\n2:13:21.760 --> 2:13:26.240\n If it's ambiguous and vague, you're in trouble, right?\n\n2:13:26.240 --> 2:13:31.160\n There has to be tightly coupled feedback between what you do and how the environment responds.\n\n2:13:31.160 --> 2:13:33.560\n So when you act, there's an immediate response.\n\n2:13:33.560 --> 2:13:38.960\n There isn't a big time lag between your action and your ability to detect the response from\n\n2:13:38.960 --> 2:13:40.360\n the environment.\n\n2:13:40.360 --> 2:13:43.440\n Third, failure has to matter.\n\n2:13:43.440 --> 2:13:45.040\n Error really matters.\n\n2:13:45.040 --> 2:13:48.120\n So there should be some anxiety about failure.\n\n2:13:48.120 --> 2:13:50.160\n And failure matters.\n\n2:13:50.160 --> 2:13:51.160\n So that, yeah, because…\n\n2:13:51.160 --> 2:13:53.720\n Like to you, the person that participates.\n\n2:13:53.720 --> 2:13:55.200\n Yes, yes, yes.\n\n2:13:55.200 --> 2:14:00.600\n Now when you're in the flow state, notice how this sits on the boundary between the\n\n2:14:00.600 --> 2:14:03.000\n secular and the sacred.\n\n2:14:03.000 --> 2:14:10.760\n When you're in the flow state, people report a tremendous sense of atonement with the environment.\n\n2:14:10.760 --> 2:14:16.080\n They report a loss of a particular kind of self consciousness, that narrative, nurturing\n\n2:14:16.080 --> 2:14:19.040\n nanny in your head that, how do I look?\n\n2:14:19.040 --> 2:14:20.080\n Do people like me?\n\n2:14:20.080 --> 2:14:21.080\n How do I look?\n\n2:14:21.080 --> 2:14:22.080\n How's my hair?\n\n2:14:22.080 --> 2:14:23.080\n Do people like me?\n\n2:14:23.080 --> 2:14:24.080\n Should I have said that?\n\n2:14:24.080 --> 2:14:25.240\n That all goes away.\n\n2:14:25.240 --> 2:14:26.240\n You're free from that.\n\n2:14:26.240 --> 2:14:30.840\n You're free from the most sadistic, superego self critic you could possibly have, at least\n\n2:14:30.840 --> 2:14:32.160\n for a while.\n\n2:14:32.160 --> 2:14:34.320\n The world is vivid.\n\n2:14:34.320 --> 2:14:35.960\n It's super salient to you.\n\n2:14:35.960 --> 2:14:39.720\n There's an ongoing sense of discovery.\n\n2:14:39.720 --> 2:14:47.300\n Although often you know you're exerting a lot of metabolic effort, it feels effortless.\n\n2:14:47.300 --> 2:14:53.160\n So in the flow state when you're sparring, your hand just goes up for the block and your\n\n2:14:53.160 --> 2:14:56.200\n strike just goes through the empty space.\n\n2:14:56.200 --> 2:15:01.000\n Or if you're a goalie in hockey, I've got to mention hockey once, I'm a Canadian, right?\n\n2:15:01.000 --> 2:15:05.920\n You put out your glove hand and the puck's there, right?\n\n2:15:05.920 --> 2:15:19.600\n So there's this tremendous sense of grace, atonement, super salience, discovery and realness.\n\n2:15:19.600 --> 2:15:23.600\n People don't, when they're in the flow state, they don't go, I bet this is an illusion.\n\n2:15:23.600 --> 2:15:31.920\n The interesting question for me and my coauthors in the article we published in the Oxford\n\n2:15:31.920 --> 2:15:37.320\n Handbook of Spontaneous Thought with Arianne Harabennett and Leo Ferraro is that's a descriptive\n\n2:15:37.320 --> 2:15:39.420\n account of flow.\n\n2:15:39.420 --> 2:15:45.320\n We wanted an explanatory account, one of the causal mechanisms at work in flow.\n\n2:15:45.320 --> 2:15:51.780\n And so we actually proposed to interlocking cognitive processes.\n\n2:15:51.780 --> 2:15:56.440\n The first thing we said is, well, what's going on in flow?\n\n2:15:56.440 --> 2:15:57.440\n Well think about it.\n\n2:15:57.440 --> 2:15:59.400\n Think about the rock climber.\n\n2:15:59.400 --> 2:16:04.140\n The rock climber, and I talked about this earlier, they're constantly restructuring\n\n2:16:04.140 --> 2:16:06.980\n how they're seeing the rock face.\n\n2:16:06.980 --> 2:16:12.560\n They're constantly doing something like insight, and if they fail to do it, they impasse and\n\n2:16:12.560 --> 2:16:14.160\n that starts to get dangerous.\n\n2:16:14.160 --> 2:16:17.760\n So they've got to do an insight that primes an insight that primes an insight.\n\n2:16:17.760 --> 2:16:23.960\n So imagine the aha experience, that flash and that moment, and imagine it cascading\n\n2:16:23.960 --> 2:16:26.860\n so you're getting the extended aha.\n\n2:16:26.860 --> 2:16:28.440\n That's why things are super salient.\n\n2:16:28.440 --> 2:16:30.000\n There's a sense of discovery.\n\n2:16:30.000 --> 2:16:35.280\n There's a sense of atonement, of deep participation, of grace, but there's something else going\n\n2:16:35.280 --> 2:16:37.280\n on too.\n\n2:16:37.280 --> 2:16:43.340\n So there's a phenomenon called implicit learning, also very well replicated.\n\n2:16:43.340 --> 2:16:45.680\n It's way back in the 60s with Rieber.\n\n2:16:45.680 --> 2:16:54.160\n You can give people complex patterns, like number and letter strings, and they can learn\n\n2:16:54.160 --> 2:16:59.360\n about those patterns outside of deliberate focal awareness.\n\n2:16:59.360 --> 2:17:01.720\n That's what's called implicit learning.\n\n2:17:01.720 --> 2:17:10.680\n And what's interesting is if you try and change that task into, tell me the pattern, but explicitly\n\n2:17:10.680 --> 2:17:13.320\n try to figure it out, the performance degrades.\n\n2:17:13.320 --> 2:17:14.320\n So here's the idea.\n\n2:17:14.320 --> 2:17:19.720\n You have this adaptive capacity for implicit learning, and what it does is it results in\n\n2:17:19.720 --> 2:17:24.920\n you being able to track complex variables in a way, but you don't know how you came\n\n2:17:24.920 --> 2:17:27.280\n up with that knowledge.\n\n2:17:27.280 --> 2:17:31.120\n And this is Hogarth's proposal in educating intuition.\n\n2:17:31.120 --> 2:17:33.040\n Intuition is actually the result of implicit learning.\n\n2:17:33.040 --> 2:17:41.680\n So an example I use is how far do you stand away from somebody at a funeral?\n\n2:17:41.680 --> 2:17:43.160\n There's a lot of complex variables.\n\n2:17:43.160 --> 2:17:49.500\n There's status, closeness to the person, your relationship to them, past history, all kinds\n\n2:17:49.500 --> 2:17:55.160\n of stuff, and yet you know how to do it, and you didn't have to go to funeral school.\n\n2:17:55.160 --> 2:17:56.960\n I'm just using that as an example.\n\n2:17:56.960 --> 2:17:58.840\n So you have these powerful intuitions.\n\n2:17:58.840 --> 2:18:02.580\n Now here's Hogarth's great point.\n\n2:18:02.580 --> 2:18:06.660\n Implicit learning, remember I said before, the things that make it adaptive make us subject\n\n2:18:06.660 --> 2:18:07.840\n to self deception?\n\n2:18:07.840 --> 2:18:09.720\n Here's another example.\n\n2:18:09.720 --> 2:18:14.160\n Implicit learning is powerful at picking up on complex patterns, but it doesn't care what\n\n2:18:14.160 --> 2:18:15.840\n kind of pattern it is.\n\n2:18:15.840 --> 2:18:22.140\n It doesn't distinguish causal patterns from merely correlational patterns.\n\n2:18:22.140 --> 2:18:24.360\n So implicit learning, when we like it, it's intuition.\n\n2:18:24.360 --> 2:18:27.800\n When it's picking up on stuff that's bogus, we call it prejudice or all kinds of other\n\n2:18:27.800 --> 2:18:30.800\n names for intuition that's going wrong.\n\n2:18:30.800 --> 2:18:33.680\n Now, he said, okay, what do we do?\n\n2:18:33.680 --> 2:18:34.680\n What do we do about this?\n\n2:18:34.680 --> 2:18:36.380\n And this will get back to Flo.\n\n2:18:36.380 --> 2:18:37.380\n What do we do about this?\n\n2:18:37.380 --> 2:18:40.800\n Well, we can't try to replace implicit learning with explicit learning because we'll lose\n\n2:18:40.800 --> 2:18:42.820\n all the adaptiveness to it.\n\n2:18:42.820 --> 2:18:44.600\n So what can we do explicitly?\n\n2:18:44.600 --> 2:18:50.140\n What we can do is take care of the environment in which we're doing the implicit learning.\n\n2:18:50.140 --> 2:18:51.160\n How do we do that?\n\n2:18:51.160 --> 2:18:58.420\n We try to make sure the environment has features that help us distinguish causation from correlation.\n\n2:18:58.420 --> 2:19:02.080\n What kind of environments have we created that are good at distinguishing causation\n\n2:19:02.080 --> 2:19:04.320\n from correlation?\n\n2:19:04.320 --> 2:19:05.320\n Experimental environments.\n\n2:19:05.320 --> 2:19:07.600\n What do you do in an experiment?\n\n2:19:07.600 --> 2:19:12.480\n You make sure that the variables are clear, no confound, no ambiguity, no vagueness.\n\n2:19:12.480 --> 2:19:16.120\n You make sure there's a tight coupling between the independent and the dependent variable\n\n2:19:16.120 --> 2:19:19.040\n and your hypothesis can be falsified.\n\n2:19:19.040 --> 2:19:20.040\n Error matters.\n\n2:19:20.040 --> 2:19:21.480\n Now look at those three, Lex.\n\n2:19:21.480 --> 2:19:27.320\n Those are exactly the three conditions that you need for Flo.\n\n2:19:27.320 --> 2:19:31.700\n Clear information, tightly coupled feedback and error matters.\n\n2:19:31.700 --> 2:19:39.120\n So Flo is not only an insight cascade, improving your insight capacity, it's also a marker\n\n2:19:39.120 --> 2:19:46.800\n that you're cultivating the best kind of intuitions, the ones that fit you best to the causal\n\n2:19:46.800 --> 2:19:48.760\n patterns in your environment.\n\n2:19:48.760 --> 2:19:54.240\n But it's hard to achieve that kind of environment where there's a clear distinction between\n\n2:19:54.240 --> 2:20:01.440\n causality and correlation and it has the rigor of a scientific experiment.\n\n2:20:01.440 --> 2:20:06.660\n Fair enough and I don't think Hogarth was saying it's gonna be epistemically as rigorous\n\n2:20:06.660 --> 2:20:13.360\n as a scientific experiment, but he's saying if you structure that, it will tend to do\n\n2:20:13.360 --> 2:20:16.440\n what that scientific method does, which is find causal...\n\n2:20:16.440 --> 2:20:17.800\n Think of the rock climber.\n\n2:20:17.800 --> 2:20:18.800\n All of those things are the case.\n\n2:20:18.800 --> 2:20:20.920\n They need clear information.\n\n2:20:20.920 --> 2:20:25.760\n It's tightly coupled and error matters and they think what they're doing is very real\n\n2:20:25.760 --> 2:20:34.380\n because if they're not conforming to the real causal patterns of the rock face and the physiology\n\n2:20:34.380 --> 2:20:37.280\n of their body, they will fall.\n\n2:20:37.280 --> 2:20:43.640\n Is there something to be said about the power of discovering meaning and having this deep\n\n2:20:43.640 --> 2:20:48.480\n relationship with the moment?\n\n2:20:48.480 --> 2:20:55.200\n There's something about flow that really forgets the past and the future and is really focused\n\n2:20:55.200 --> 2:20:56.200\n on the moment.\n\n2:20:56.200 --> 2:21:00.120\n I think that's part of the phenomenology, but I think the functionality has to do with\n\n2:21:00.120 --> 2:21:07.500\n the fact that what's happening in flow is that dynamic nonpropositional connectedness\n\n2:21:07.500 --> 2:21:12.400\n that is so central to meaning is being optimized.\n\n2:21:12.400 --> 2:21:20.240\n This is why flow is a good predictor of how well you rate your life, how much well being\n\n2:21:20.240 --> 2:21:24.880\n you think you have, which of course is itself also predictive and interrelated with how\n\n2:21:24.880 --> 2:21:26.560\n meaningful you find your life.\n\n2:21:26.560 --> 2:21:31.920\n One of the things that you can do, but there's an important caveat, to increase your sense\n\n2:21:31.920 --> 2:21:36.520\n of meaning in life is to get into the flow state more frequently.\n\n2:21:36.520 --> 2:21:40.320\n That's why I said you want a moving practice that's conducive to the flow state, but there's\n\n2:21:40.320 --> 2:21:48.800\n one important caveat, which is we of course have figured out and I'm playing with words\n\n2:21:48.800 --> 2:21:54.320\n here how to game this and how to hijack it by creating things like video games.\n\n2:21:54.320 --> 2:21:59.320\n I'm not saying this is the case for all video games or this is the case for all people,\n\n2:21:59.320 --> 2:22:05.640\n but the WHO now acknowledges this as a real thing that you can get into the flow state\n\n2:22:05.640 --> 2:22:12.320\n within the video game world to the detriment of your ability to get into the flow state\n\n2:22:12.320 --> 2:22:14.040\n in the real world.\n\n2:22:14.040 --> 2:22:15.880\n What's the opposite of flow?\n\n2:22:15.880 --> 2:22:16.880\n Depression.\n\n2:22:16.880 --> 2:22:21.400\n In fact, depression has been called anti flow.\n\n2:22:21.400 --> 2:22:27.840\n So you get these people that are flowing in this non real world and they can't transfer\n\n2:22:27.840 --> 2:22:32.240\n it to the real world and it's actually costing them flow in the real world.\n\n2:22:32.240 --> 2:22:36.240\n So they tend to get, they tend to suffer depression and all kinds of things.\n\n2:22:36.240 --> 2:22:45.840\n Your ability, your habit and just skill at attaining flow in the video game world basically\n\n2:22:45.840 --> 2:22:52.800\n makes you less effective or maybe shocks you at how difficult it is to achieve flow in\n\n2:22:52.800 --> 2:22:53.800\n the physical world.\n\n2:22:53.800 --> 2:22:54.800\n Yeah.\n\n2:22:54.800 --> 2:22:55.800\n I'm not sure about that.\n\n2:22:55.800 --> 2:23:03.400\n I just, I don't want to push back against the implied challenge of transferability because\n\n2:23:03.400 --> 2:23:10.240\n there's a lot of, I have a lot of friends that play video games, a very large percent\n\n2:23:10.240 --> 2:23:20.560\n of young folks play video games and I'm hesitant to build up models of how that affects behavior.\n\n2:23:20.560 --> 2:23:22.320\n My intuition is weak there.\n\n2:23:22.320 --> 2:23:29.000\n Sometimes people that have PhDs are of a certain age that they came up when video games weren't\n\n2:23:29.000 --> 2:23:31.320\n a deep part of their life development.\n\n2:23:31.320 --> 2:23:38.400\n I would venture to say people who have developed their brain with video games being a part,\n\n2:23:38.400 --> 2:23:45.040\n a large part of that world are in some sense different humans and it's possible that they\n\n2:23:45.040 --> 2:23:47.440\n can transfer more effectively.\n\n2:23:47.440 --> 2:23:54.280\n Some of the lessons, some of the ability to attain flow from the virtual world to the\n\n2:23:54.280 --> 2:23:59.520\n physical world, they're also more, I would venture to say, resilient to the negative\n\n2:23:59.520 --> 2:24:08.280\n effects of, for example, social media or video games that have maybe the objectification\n\n2:24:08.280 --> 2:24:12.440\n or the over sexualized or violent aspect of video games.\n\n2:24:12.440 --> 2:24:15.760\n They're able to turn that off when they go to the physical world and turn it back on\n\n2:24:15.760 --> 2:24:23.040\n when they're playing the video games probably more effectively than the old timers.\n\n2:24:23.040 --> 2:24:27.280\n So I just want to say this sort of, I'm not sure, it's a really interesting question how\n\n2:24:27.280 --> 2:24:29.000\n transferable the flow state is.\n\n2:24:29.000 --> 2:24:31.960\n I don't know if you want to comment on that.\n\n2:24:31.960 --> 2:24:32.960\n I do, I do.\n\n2:24:32.960 --> 2:24:36.160\n First of all, I did qualify and I'm saying it's not the case for all video games or for\n\n2:24:36.160 --> 2:24:37.160\n all people.\n\n2:24:37.160 --> 2:24:42.120\n I'm holding out the possibility and I know this possibility because I've had students\n\n2:24:42.120 --> 2:24:48.760\n who actually suffer from this and have done work around it with me.\n\n2:24:48.760 --> 2:24:51.000\n The ability to achieve.\n\n2:24:51.000 --> 2:24:54.760\n They couldn't transfer, yeah.\n\n2:24:54.760 --> 2:24:58.840\n And then they were able to step back from that and then take up the cognitive science\n\n2:24:58.840 --> 2:25:01.600\n and write about it and work on it.\n\n2:25:01.600 --> 2:25:10.940\n Also, I'm not so sure about the resiliency claim because there seems to be mounting evidence.\n\n2:25:10.940 --> 2:25:17.640\n It's not consensus, but it's certainly not regarded as fringe, that the increase in social\n\n2:25:17.640 --> 2:25:23.840\n media is pretty strongly correlated with increase in depression, self destructive behavior,\n\n2:25:23.840 --> 2:25:24.840\n things like this.\n\n2:25:24.840 --> 2:25:26.160\n I would like to see that evidence.\n\n2:25:26.160 --> 2:25:27.160\n Sure.\n\n2:25:27.160 --> 2:25:28.160\n I can find it.\n\n2:25:28.160 --> 2:25:29.160\n No, no, no.\n\n2:25:29.160 --> 2:25:41.720\n Let me, I'm always hesitant to too eagerly kind of agree with things that I want to agree\n\n2:25:41.720 --> 2:25:42.720\n with.\n\n2:25:42.720 --> 2:25:48.720\n There's a public perception everyone seems to hate on social media.\n\n2:25:48.720 --> 2:25:56.520\n I wonder, as always with these things, does it reveal depression or does it create depression?\n\n2:25:56.520 --> 2:25:57.680\n This is always the question.\n\n2:25:57.680 --> 2:26:04.220\n It's like whenever you talk about any political or ideological movement, does it create hate\n\n2:26:04.220 --> 2:26:06.000\n or does it reveal hate?\n\n2:26:06.000 --> 2:26:09.960\n And that's a good thing to ask and you should always challenge the things that you intuitively\n\n2:26:09.960 --> 2:26:10.960\n want to believe.\n\n2:26:10.960 --> 2:26:13.960\n I agree with that.\n\n2:26:13.960 --> 2:26:15.640\n Like aliens.\n\n2:26:15.640 --> 2:26:21.280\n So one of the ways you address this, and it's not sufficient and I did say the work is preliminary,\n\n2:26:21.280 --> 2:26:28.900\n but if I can give you a plausible mechanism that's new and then that lends credence.\n\n2:26:28.900 --> 2:26:33.560\n And part of what happens is illusory social comparison.\n\n2:26:33.560 --> 2:26:34.560\n Think of Instagram.\n\n2:26:34.560 --> 2:26:39.400\n People are posting things that are not accurate representation of their life or life events.\n\n2:26:39.400 --> 2:26:46.680\n In fact, they will stage things, but the people that are looking at these, they take it often\n\n2:26:46.680 --> 2:26:56.280\n as real and so they get downward social comparison and this is like compared to how you and I\n\n2:26:56.280 --> 2:27:00.640\n probably live where we may get one or two of those events a week, they're getting them\n\n2:27:00.640 --> 2:27:02.440\n moment by moment.\n\n2:27:02.440 --> 2:27:07.600\n And so it's a plausible mechanism that why it might be driving people into a more depressed\n\n2:27:07.600 --> 2:27:08.600\n state.\n\n2:27:08.600 --> 2:27:14.120\n Okay, the flip side of that is because there's a greater, greater gap going from real world\n\n2:27:14.120 --> 2:27:19.920\n to Instagram world, you start to be able to laugh at it and realize that it's artificial.\n\n2:27:19.920 --> 2:27:26.280\n So for example, even just artificial filters, people start to realize like, there's like,\n\n2:27:26.280 --> 2:27:31.480\n it's the same kind of gap as there is between the video game world and the real world.\n\n2:27:31.480 --> 2:27:35.320\n In the video game world, you can do all kinds of wild things.\n\n2:27:35.320 --> 2:27:38.360\n Grand theft auto, you can shoot people up, you can do whatever the heck you want.\n\n2:27:38.360 --> 2:27:42.880\n In the real world, you can't and you start to develop an understanding of how to have\n\n2:27:42.880 --> 2:27:46.200\n fun in the virtual world and in the physical world.\n\n2:27:46.200 --> 2:27:50.320\n And I think it's just as a pushback, I'm not saying either is true though, those are very\n\n2:27:50.320 --> 2:27:51.760\n interesting claims.\n\n2:27:51.760 --> 2:27:58.520\n The more ridiculously out of touch Instagram becomes, the easier you can laugh it off potentially\n\n2:27:58.520 --> 2:28:00.560\n in terms of the effect it has on your psyche.\n\n2:28:00.560 --> 2:28:01.760\n I'll respond to that.\n\n2:28:01.760 --> 2:28:06.280\n But at some point, we should get back to Flo.\n\n2:28:06.280 --> 2:28:07.460\n As we engage in Flo.\n\n2:28:07.460 --> 2:28:16.280\n You laugh at the shampoo commercial and you buy the shampoo.\n\n2:28:16.280 --> 2:28:21.440\n There's a capacity for tremendous bullshitting because of the way these machines are designed\n\n2:28:21.440 --> 2:28:33.040\n to trigger salience without triggering reflective truth seeking.\n\n2:28:33.040 --> 2:28:42.240\n I'm thinking of common examples because sometimes you can laugh all the way to the bank.\n\n2:28:42.240 --> 2:28:45.560\n You can laugh and not buy the shampoo.\n\n2:28:45.560 --> 2:28:49.160\n There's many cases, so I think you have to laugh hard enough.\n\n2:28:49.160 --> 2:28:54.800\n You do have to laugh hard enough, but the advertisers get millions of dollars precisely\n\n2:28:54.800 --> 2:29:00.280\n because for many, many people, it does make you buy the shampoo and that's the concern.\n\n2:29:00.280 --> 2:29:04.800\n And maybe the machine of social media is such that it optimizes the shampoo buying.\n\n2:29:04.800 --> 2:29:05.800\n Yes.\n\n2:29:05.800 --> 2:29:13.200\n The point I was trying to make is whether or not that particular example is ultimately\n\n2:29:13.200 --> 2:29:18.840\n right, the possibility of transfer failure is a real thing.\n\n2:29:18.840 --> 2:29:22.640\n And I want to contrast that to an experience I had when I was in grad school.\n\n2:29:22.640 --> 2:29:27.160\n I had been doing Tai Chi Chuan about three or four years, very religiously, both senses\n\n2:29:27.160 --> 2:29:32.900\n of the word, like three or four hours a day and reading all the literature and I was having\n\n2:29:32.900 --> 2:29:39.880\n all the weird experiences, cold as ice, hot as lava, all that stuff and it's ooh, right?\n\n2:29:39.880 --> 2:29:45.360\n But my friends in grad school, they said to me, what's going on?\n\n2:29:45.360 --> 2:29:46.360\n You're different.\n\n2:29:46.360 --> 2:29:48.520\n And I said, what do you mean?\n\n2:29:48.520 --> 2:29:54.120\n And they said, well, you're a lot more balanced in your interactions and you're a lot more\n\n2:29:54.120 --> 2:30:01.480\n flowing and you're a lot more sort of flexible and you adjust more and I realized, oh, and\n\n2:30:01.480 --> 2:30:08.160\n this was the sort of Taoist claim around Tai Chi Chuan that it actually transfers in ways\n\n2:30:08.160 --> 2:30:10.160\n that you might not expect.\n\n2:30:10.160 --> 2:30:15.840\n You start to be able, and I've now noticed that, I now notice how I'm doing Tai Chi even\n\n2:30:15.840 --> 2:30:22.280\n in this interaction and how it can facilitate and afford and so there's a powerful transfer\n\n2:30:22.280 --> 2:30:28.800\n and that's what I meant by flow wisely, not only flow in a way that's making sure that\n\n2:30:28.800 --> 2:30:35.160\n you're distinguishing causation from correlation, which flow can do, but find how to situate\n\n2:30:35.160 --> 2:30:39.960\n it, home it so that it will percolate through your psyche and permeate through many domains\n\n2:30:39.960 --> 2:30:42.780\n of your life.\n\n2:30:42.780 --> 2:30:49.540\n Is there something you could say similar to our discussion about mindfulness and meditation\n\n2:30:49.540 --> 2:30:55.360\n and contemplation about the world that psychedelics take our mind?\n\n2:30:55.360 --> 2:31:04.840\n Where does the mind go when it's on psychedelics?\n\n2:31:04.840 --> 2:31:10.840\n I want to remind you of something you said, which is a gem.\n\n2:31:10.840 --> 2:31:16.640\n It's not so much the experience, but the degree to which it can be integrated back.\n\n2:31:16.640 --> 2:31:21.480\n So here's a proposal that comes from Woodward and others, a lot of convergence around this.\n\n2:31:21.480 --> 2:31:25.640\n Carhartt Harris is talking about it similarly in the entropic brain, but I'm not going to\n\n2:31:25.640 --> 2:31:26.640\n talk first about psychedelics.\n\n2:31:26.640 --> 2:31:31.480\n I'm going to talk about neural networks and I'm going to talk about a classic problem\n\n2:31:31.480 --> 2:31:32.480\n in neural networks.\n\n2:31:32.480 --> 2:31:37.180\n So neural networks, like us with intuition and implicit learning, are fantastic at picking\n\n2:31:37.180 --> 2:31:40.040\n up on complex patterns.\n\n2:31:40.040 --> 2:31:41.360\n Which neural networks are we talking about?\n\n2:31:41.360 --> 2:31:43.920\n I'm talking about a general, just general...\n\n2:31:43.920 --> 2:31:45.360\n Both artificial and biological?\n\n2:31:45.360 --> 2:31:46.360\n Yes.\n\n2:31:46.360 --> 2:31:47.360\n Yes.\n\n2:31:47.360 --> 2:31:52.200\n I think at this point, there is no relevant difference.\n\n2:31:52.200 --> 2:31:56.680\n So one of the classic problems because of their power is they suffer from overfitting\n\n2:31:56.680 --> 2:32:04.200\n to the data, or for those of you who are in a statistical orientation, they pick up patterns\n\n2:32:04.200 --> 2:32:09.280\n in the sample that aren't actually present in the population.\n\n2:32:09.280 --> 2:32:13.960\n And so what you do is there's various strategies.\n\n2:32:13.960 --> 2:32:19.300\n You can do dropout where you periodically turn off half of the nodes in a network.\n\n2:32:19.300 --> 2:32:22.520\n You can drop noise into the network.\n\n2:32:22.520 --> 2:32:28.400\n And what that does is it prevents overfitting to the data and allows the network to generalize\n\n2:32:28.400 --> 2:32:32.360\n more powerfully to the environment.\n\n2:32:32.360 --> 2:32:38.600\n I proposed to you that that's basically what psychedelics do.\n\n2:32:38.600 --> 2:32:39.680\n They do that.\n\n2:32:39.680 --> 2:32:44.260\n They basically do significant constraint reduction.\n\n2:32:44.260 --> 2:32:49.640\n And so you get areas of the brain talking to each other that don't normally talk to\n\n2:32:49.640 --> 2:32:53.940\n each other, areas that do talk to each other, not talking to each other, down regulation\n\n2:32:53.940 --> 2:32:58.020\n of areas that are very dominant, like the default mode network, et cetera.\n\n2:32:58.020 --> 2:33:04.140\n And what that does is exactly something strongly analogous to what's happening in dropout or\n\n2:33:04.140 --> 2:33:05.960\n putting noise into the data.\n\n2:33:05.960 --> 2:33:06.960\n It opens up.\n\n2:33:06.960 --> 2:33:11.880\n And by the way, if you give human beings an insight problem that they're trying to solve\n\n2:33:11.880 --> 2:33:16.780\n and you throw in some noise, like literally static on the screen, you can trigger an insight\n\n2:33:16.780 --> 2:33:19.420\n in them.\n\n2:33:19.420 --> 2:33:23.440\n So like literally very simplistic kind of noise to the perception system.\n\n2:33:23.440 --> 2:33:24.440\n Right.\n\n2:33:24.440 --> 2:33:27.760\n It can break it out of overfitting to the data and open you up.\n\n2:33:27.760 --> 2:33:39.880\n Now, that means, though, that just doing that in and of itself is not the answer because\n\n2:33:39.880 --> 2:33:46.580\n you also have to make sure that the system can go back to exploring that new space properly.\n\n2:33:46.580 --> 2:33:48.360\n This isn't a problem with neural networks.\n\n2:33:48.360 --> 2:33:51.940\n You turn off dropout and they just go back to being powerful neural networks, and now\n\n2:33:51.940 --> 2:33:55.360\n they explore the state space that they couldn't explore before.\n\n2:33:55.360 --> 2:34:00.520\n Human beings are a little bit more messy around this, and this is where the analogy does get\n\n2:34:00.520 --> 2:34:02.000\n a little bit strained.\n\n2:34:02.000 --> 2:34:10.740\n So they need practices that help them integrate that opening up to the new state space so\n\n2:34:10.740 --> 2:34:12.560\n they can properly integrate it.\n\n2:34:12.560 --> 2:34:21.760\n So beyond Leary's state and setting, I think you need another S. I think you need sacred.\n\n2:34:21.760 --> 2:34:29.120\n You need, psychedelics need to be practiced within a sapiential framework, a framework\n\n2:34:29.120 --> 2:34:35.340\n in which people are independently and beforehand improving their abilities to deal with self\n\n2:34:35.340 --> 2:34:38.800\n deception and afford insight and self regulate.\n\n2:34:38.800 --> 2:34:43.600\n This is, of course, the overwhelming way in which psychedelics are used by indigenous\n\n2:34:43.600 --> 2:34:44.600\n cultures.\n\n2:34:44.600 --> 2:34:53.080\n And I think if we put them into that context, then they can help the project of people self\n\n2:34:53.080 --> 2:34:56.900\n transcending, cultivating meaning and increasing wisdom.\n\n2:34:56.900 --> 2:35:03.520\n But if I think we remove them out of that context and put them in the context of commodities\n\n2:35:03.520 --> 2:35:10.840\n taken just to have certain phenomenological changes, we run certain important risks.\n\n2:35:10.840 --> 2:35:14.160\n So using the term of higher states of consciousness.\n\n2:35:14.160 --> 2:35:15.160\n Yes.\n\n2:35:15.160 --> 2:35:19.640\n Is consciousness an important part of that word?\n\n2:35:19.640 --> 2:35:22.000\n Why higher?\n\n2:35:22.000 --> 2:35:30.560\n Is it a higher state or is it a detour, a side road on the main road of consciousness?\n\n2:35:30.560 --> 2:35:32.880\n Where do we go here?\n\n2:35:32.880 --> 2:35:37.720\n I think the psychedelic state is on a continuum.\n\n2:35:37.720 --> 2:35:40.960\n There's insight and then flow is an insight cascade.\n\n2:35:40.960 --> 2:35:46.480\n There's flow and then you can have sort of psychedelic experiences, mind revealing experiences,\n\n2:35:46.480 --> 2:35:52.000\n but they overlap with mystical experiences and they aren't the same.\n\n2:35:52.000 --> 2:35:56.640\n So for example, in the Griffiths lab, they gave people psilocybin and they taught them\n\n2:35:56.640 --> 2:36:03.440\n ahead of time sort of the features of a mystical experience and only a certain proportion of\n\n2:36:03.440 --> 2:36:08.260\n the people that took the psilocybin went from a psychedelic into a mystical experience.\n\n2:36:08.260 --> 2:36:13.040\n What was interesting is the people that had the mystical experience had measurable and\n\n2:36:13.040 --> 2:36:17.020\n longstanding change to one of the big five factors of personality.\n\n2:36:17.020 --> 2:36:21.400\n They had increased openness, openness is supposed to actually go down over time and these traits\n\n2:36:21.400 --> 2:36:27.360\n aren't supposed to be that malleable and it was significantly like altered, right?\n\n2:36:27.360 --> 2:36:33.380\n But imagine if you just created more openness in a person, right?\n\n2:36:33.380 --> 2:36:36.960\n And they're now open to a lot more and they want to explore a lot more, but you don't\n\n2:36:36.960 --> 2:36:39.680\n give them the tools of discernment.\n\n2:36:39.680 --> 2:36:42.640\n That could be problematic for them in important ways.\n\n2:36:42.640 --> 2:36:44.120\n That could be very problematic.\n\n2:36:44.120 --> 2:36:53.080\n Yes, I got it, but you know, so you have to land the plane in a productive way somehow\n\n2:36:53.080 --> 2:36:57.360\n integrated back into your life and how you see the world and how you frame your perception\n\n2:36:57.360 --> 2:36:58.360\n of that world.\n\n2:36:58.360 --> 2:37:03.480\n And when people do that, that's when I call it a transformative experience.\n\n2:37:03.480 --> 2:37:06.900\n Now the higher states of consciousness are really interesting because they tend to move\n\n2:37:06.900 --> 2:37:12.400\n people from a mystical experience into a transformative experience, because what happens in these\n\n2:37:12.400 --> 2:37:15.960\n experiences is something really, really interesting.\n\n2:37:15.960 --> 2:37:19.280\n They get to a state that's ineffable, they can't put it into words, they can't describe\n\n2:37:19.280 --> 2:37:25.960\n it, but they're in this state temporarily and then they come back and they do this.\n\n2:37:25.960 --> 2:37:30.680\n They say, that was really real and this in comparison is less real.\n\n2:37:30.680 --> 2:37:35.520\n So I remember that platonic meta desire, I want to change my life myself so that I'm\n\n2:37:35.520 --> 2:37:41.120\n more in conformity with that really real, and that is really odd, Lex, because normally\n\n2:37:41.120 --> 2:37:48.200\n when we go outside of our consensus intelligibility, like a dream state, we come back from it,\n\n2:37:48.200 --> 2:37:51.520\n we say, that doesn't fit into everything, therefore it's unreal.\n\n2:37:51.520 --> 2:37:53.420\n They do the exact opposite.\n\n2:37:53.420 --> 2:37:59.840\n They come out of these states and they say, that doesn't fit into this consensus intelligibility\n\n2:37:59.840 --> 2:38:01.520\n and that means this is less real.\n\n2:38:01.520 --> 2:38:04.920\n They do the exact opposite and that fascinates me.\n\n2:38:04.920 --> 2:38:12.800\n Why do they flip our normal procedure about evaluating alternative states?\n\n2:38:12.800 --> 2:38:18.280\n The thing is those higher states of consciousness, precisely because they have that ontonormativity,\n\n2:38:18.280 --> 2:38:22.960\n the realness that demands that you make a change in your life, they serve to bridge\n\n2:38:22.960 --> 2:38:26.600\n between mystical experiences and genuine transformative experiences.\n\n2:38:26.600 --> 2:38:31.320\n So you do think seeing those as more real is productive because then you reach for them.\n\n2:38:31.320 --> 2:38:38.240\n So Jaden's done work on it, and again, all of this stuff isn't recent, so we have to\n\n2:38:38.240 --> 2:38:44.240\n take it with a grain of salt, but by a lot of objective measure, people who do this,\n\n2:38:44.240 --> 2:38:49.200\n who have these higher states of consciousness and undertake the transformative process,\n\n2:38:49.200 --> 2:38:53.920\n their lives get better, their relationships improve, their sense of self improves, their\n\n2:38:53.920 --> 2:38:59.240\n anxieties go down, depression, like all of these other measures, the needles are moved\n\n2:38:59.240 --> 2:39:03.240\n on these measures by people undergoing this transformative experience.\n\n2:39:03.240 --> 2:39:08.280\n Their lives, by many of the criteria that we judge our lives to be good, get better.\n\n2:39:08.280 --> 2:39:18.040\n I have to ask you about this fascinating distributed cognition process that leads to mass formation\n\n2:39:18.040 --> 2:39:22.120\n of ideologies that have had an impact on our world.\n\n2:39:22.120 --> 2:39:28.600\n So you spoke about the clash of the two great pseudo religious ideologies of Marxism and\n\n2:39:28.600 --> 2:39:29.600\n Nazism.\n\n2:39:29.600 --> 2:39:30.600\n Yes.\n\n2:39:30.600 --> 2:39:33.080\n Especially their clash on the Eastern Front.\n\n2:39:33.080 --> 2:39:34.880\n Battle of Kursk.\n\n2:39:34.880 --> 2:39:42.640\n Can you explain the origin of each of these, Marxism and Nazism, in a kind of way that\n\n2:39:42.640 --> 2:39:47.640\n we have been talking about the formation of ideas?\n\n2:39:47.640 --> 2:39:51.820\n Hegel is to Protestantism what Thomas Aquinas is to Catholicism.\n\n2:39:51.820 --> 2:40:01.640\n He was the philosopher who took German Protestantism and also Kant and Fichte and Schelling, and\n\n2:40:01.640 --> 2:40:07.480\n he built a philosophical system.\n\n2:40:07.480 --> 2:40:08.940\n He explicitly said this, by the way.\n\n2:40:08.940 --> 2:40:12.040\n He wanted to bridge between philosophy and religion.\n\n2:40:12.040 --> 2:40:13.240\n He explicitly said that.\n\n2:40:13.240 --> 2:40:14.800\n I'm not foisting that on him.\n\n2:40:14.800 --> 2:40:18.300\n He said it repeatedly in many different places.\n\n2:40:18.300 --> 2:40:25.800\n So he's trying to create a philosophical system that gathered to it, I think, the core mythos\n\n2:40:25.800 --> 2:40:26.800\n of Christianity.\n\n2:40:26.800 --> 2:40:33.480\n The core mythos of Christianity is this idea of a narrative structure to reality in which\n\n2:40:33.480 --> 2:40:38.860\n progress is real, in which our actions now can change the future.\n\n2:40:38.860 --> 2:40:44.600\n We can co participate with God in the creation of the future, and that future can be better.\n\n2:40:44.600 --> 2:40:49.280\n It can reach something like a utopia or the promised land or whatever.\n\n2:40:49.280 --> 2:40:52.120\n He created a philosophical system of brilliance, by the way.\n\n2:40:52.120 --> 2:40:53.280\n He's a genius.\n\n2:40:53.280 --> 2:41:00.640\n But basically what it did was it took that religious vision and gave it the air of philosophical\n\n2:41:00.640 --> 2:41:04.240\n intelligibility and respect.\n\n2:41:04.240 --> 2:41:10.080\n And then Marx takes that and says, you know that process by which the narrative is working\n\n2:41:10.080 --> 2:41:14.720\n itself out that Hegel called dialectic, I don't think it's primarily happening in ideas.\n\n2:41:14.720 --> 2:41:19.520\n I think it's happening primarily between classes within socioeconomic factors.\n\n2:41:19.520 --> 2:41:21.060\n But it's the same story.\n\n2:41:21.060 --> 2:41:27.140\n Here's this mechanism of history, it's teleological, it's going to move this way, it can move towards\n\n2:41:27.140 --> 2:41:28.140\n a utopia.\n\n2:41:28.140 --> 2:41:34.320\n We can either participate in furthering it, like participating in the work of God, or\n\n2:41:34.320 --> 2:41:37.120\n we can thwart it and be against it.\n\n2:41:37.120 --> 2:41:41.080\n And so you have a pseudo religious vision.\n\n2:41:41.080 --> 2:41:42.640\n It's all encompassing.\n\n2:41:42.640 --> 2:41:48.040\n Think about how Marxism is not just a philosophical position, it's not just an economic position.\n\n2:41:48.040 --> 2:41:56.440\n It's an entire worldview, an entire account of history, and a demanding account of what\n\n2:41:56.440 --> 2:41:58.160\n human excellence is.\n\n2:41:58.160 --> 2:42:03.480\n And it has all these things about participating, belonging, fitting to.\n\n2:42:03.480 --> 2:42:14.160\n But it's very, in Marx's case, it's very pragmatic or directly applicable to society, to where\n\n2:42:14.160 --> 2:42:18.760\n it leads to, it more naturally leads to political ideologies.\n\n2:42:18.760 --> 2:42:19.960\n It does.\n\n2:42:19.960 --> 2:42:26.400\n But I think Marx, to a very significant degree, inherits one of Hegel's main flaws.\n\n2:42:26.400 --> 2:42:32.920\n Hegel is talking about all this and he's trying to fit it into post Kantian philosophy.\n\n2:42:32.920 --> 2:42:38.000\n So for him, it's ultimately propositional, conceptual.\n\n2:42:38.000 --> 2:42:43.200\n He like everybody after Descartes is very focused on the propositional level, and he's\n\n2:42:43.200 --> 2:42:48.340\n not paying deep attention to the nonpropositional.\n\n2:42:48.340 --> 2:42:53.320\n This is why the two great critics of Hegel, Nietzsche and Kierkegaard, they're trying\n\n2:42:53.320 --> 2:42:59.360\n to put their finger on the nonpropositional, the nonconceptual, the will to power or faith\n\n2:42:59.360 --> 2:43:04.080\n in Kierkegaard, and they're trying to bring out all these other kinds of knowing as being\n\n2:43:04.080 --> 2:43:05.080\n inadequate.\n\n2:43:05.080 --> 2:43:08.560\n That's why Kierkegaard meant when he said, Hegel made a system and then he sat down beside\n\n2:43:08.560 --> 2:43:11.760\n it.\n\n2:43:11.760 --> 2:43:20.400\n And so Marxism is very much, it is activist, it's about reorganizing society, but the transformation\n\n2:43:20.400 --> 2:43:28.640\n in individuals is largely ideological, meaning it's largely about these significant propositional\n\n2:43:28.640 --> 2:43:31.560\n changes and adopting a set of beliefs.\n\n2:43:31.560 --> 2:43:37.440\n When it came in contact with the Soviet Union or with what became the Soviet Union, why\n\n2:43:37.440 --> 2:43:42.840\n do you think it had such a powerful hold on such a large number of people?\n\n2:43:42.840 --> 2:43:48.120\n Not Marxism, but implementation of Marxism in the name of communism.\n\n2:43:48.120 --> 2:43:57.200\n Because it offered people, I mean, it offered people something that typically only religions\n\n2:43:57.200 --> 2:44:05.540\n had offered, and it offered people the hope of making a new man, a new kind of human being\n\n2:44:05.540 --> 2:44:07.640\n in a new world.\n\n2:44:07.640 --> 2:44:16.400\n And when you've been living in Russia, in which things seem to be locked in a system\n\n2:44:16.400 --> 2:44:25.160\n that is crushing most people, getting the promise in the air of scientific legitimacy\n\n2:44:25.160 --> 2:44:32.360\n that we can make new human beings and a new world and in which happiness will ensue, that's\n\n2:44:32.360 --> 2:44:34.600\n an intoxicating proposal.\n\n2:44:34.600 --> 2:44:40.480\n You get sort of, like I said, you get all of the intoxication of a religious utopia,\n\n2:44:40.480 --> 2:44:47.320\n but you get all the seeming legitimacy of claiming that it's a scientific understanding\n\n2:44:47.320 --> 2:44:48.960\n of history and economics.\n\n2:44:48.960 --> 2:44:55.960\n It's very popular to criticize communism, Marxism these days, and I often put myself\n\n2:44:55.960 --> 2:45:03.520\n in the place before any of the implementations came to be, I tried to think if I would be\n\n2:45:03.520 --> 2:45:11.000\n able to predict what the implementations of Marxism and communism would result in, in\n\n2:45:11.000 --> 2:45:12.000\n the 20th century.\n\n2:45:12.000 --> 2:45:16.440\n And I'm not sure I'm smart enough to make that prediction.\n\n2:45:16.440 --> 2:45:24.920\n Because at the core of the ideas are respecting, with Marx it's very economics type theory,\n\n2:45:24.920 --> 2:45:32.880\n so it's basically respecting the value of the worker and the regular man in society\n\n2:45:32.880 --> 2:45:35.480\n for making a contribution to that society.\n\n2:45:35.480 --> 2:45:42.360\n And to me that seems like a powerful idea, and it's not clear to me how it goes wrong.\n\n2:45:42.360 --> 2:45:52.840\n In fact, it's still not clear to me why the hell would Stalin happen, or Mao happen.\n\n2:45:52.840 --> 2:45:58.120\n There's something very interesting and complex about human nature in hierarchies, about distributed\n\n2:45:58.120 --> 2:46:01.880\n cognition that results in that, and it's not trivial to understand.\n\n2:46:01.880 --> 2:46:02.880\n No, no.\n\n2:46:02.880 --> 2:46:06.520\n So, I mean, I wonder if you could put a finger on it.\n\n2:46:06.520 --> 2:46:08.760\n Why did it go so wrong?\n\n2:46:08.760 --> 2:46:17.520\n So I think, you know, what Ohana talks about in The Intellectual History of Modernity talks\n\n2:46:17.520 --> 2:46:27.760\n about the Promethean spirit, the idea, the really radical proposal.\n\n2:46:27.760 --> 2:46:33.560\n And think about how it's not so radical to us, and in that sense Marxism has succeeded.\n\n2:46:33.560 --> 2:46:38.800\n The radical proposal that you see even in the French Revolution, and don't forget the\n\n2:46:38.800 --> 2:46:46.280\n terror comes in the French Revolution too, that we can make ourselves into godlike beings.\n\n2:46:46.280 --> 2:46:53.440\n Think of the hubris in that, and think of the overconfidence to think that we so understand\n\n2:46:53.440 --> 2:46:59.960\n human nature and all of its complexities and human history, and how religion functioned,\n\n2:46:59.960 --> 2:47:04.960\n that we can just come in with a plan and make it run.\n\n2:47:04.960 --> 2:47:11.640\n To my mind, that Promethean spirit is part of why it's doomed to fail, and it's doomed\n\n2:47:11.640 --> 2:47:20.860\n to fail in a kind of terrorizing way, because the Promethean spirit really licenses you\n\n2:47:20.860 --> 2:47:25.840\n to do anything, because the ends justify the means.\n\n2:47:25.840 --> 2:47:35.240\n The ends justify the means really free you to do some of, basically, well, commit atrocities\n\n2:47:35.240 --> 2:47:36.240\n at any scale.\n\n2:47:36.240 --> 2:47:40.720\n Ground zero with Pol Pot and the Khmer Rouge, right, exactly.\n\n2:47:40.720 --> 2:47:47.840\n And you can only believe in an ends that can justify any means if you believe in a utopia,\n\n2:47:47.840 --> 2:47:52.580\n and you can only believe in the utopia if you really buy into the Promethean spirit.\n\n2:47:52.580 --> 2:47:55.380\n So is that what explains Nazism?\n\n2:47:55.380 --> 2:47:58.120\n So Nazism is part of that, too.\n\n2:47:58.120 --> 2:48:05.800\n The Promethean spirit that we can make ourselves into supermen, ubermensch, right?\n\n2:48:05.800 --> 2:48:19.160\n And Nazism is fueled very much by appropriating and twisting sort of Gnostic themes that are\n\n2:48:19.160 --> 2:48:26.700\n very prevalent, Gnosticism tends to come to the fore when people are experiencing increased\n\n2:48:26.700 --> 2:48:27.700\n meaning crisis.\n\n2:48:27.700 --> 2:48:33.760\n And don't forget, the Weimar Republic is like a meaning crisis gone crazy on all levels.\n\n2:48:33.760 --> 2:48:38.600\n Everybody's suffering domicile, everybody's home and way of life and identity and culture\n\n2:48:38.600 --> 2:48:43.240\n and relationship to religion and science, all of that, right?\n\n2:48:43.240 --> 2:48:50.360\n So Nazism comes along and offers a kind of Gnosticism, again, twisted, perverted.\n\n2:48:50.360 --> 2:48:59.840\n I'm not saying that all Gnostics are Nazis, but there is this Gnostic mythology, mythos,\n\n2:48:59.840 --> 2:49:01.800\n and it comes to the fore.\n\n2:49:01.800 --> 2:49:09.800\n I remember, and this stuck with me in undergrad, I was taking political science, and the professor\n\n2:49:09.800 --> 2:49:14.920\n extended lecture on this, and it still rings true for me, says, if you understand Nazism\n\n2:49:14.920 --> 2:49:17.880\n as just a political movement, you have misunderstood it.\n\n2:49:17.880 --> 2:49:24.800\n It is much more a religious phenomenon in many ways.\n\n2:49:24.800 --> 2:49:27.600\n Is it religious in that the loss of religion?\n\n2:49:27.600 --> 2:49:30.040\n So is it a meaning crisis?\n\n2:49:30.040 --> 2:49:39.160\n Or is it out of a meaning crisis every discovery of religion in a Promethean type of...\n\n2:49:39.160 --> 2:49:40.280\n I think it's the latter.\n\n2:49:40.280 --> 2:49:43.680\n I think there's this vacuum created.\n\n2:49:43.680 --> 2:49:48.480\n In that context, is Hitler the central religious figure?\n\n2:49:48.480 --> 2:49:49.480\n Yes.\n\n2:49:49.480 --> 2:49:56.340\n And also, did Nazi Germany create Hitler, or did Hitler create Nazi Germany?\n\n2:49:56.340 --> 2:50:02.120\n So in this distributed cognition where everyone's having a dialogue, what's the role of a charismatic\n\n2:50:02.120 --> 2:50:03.120\n leader?\n\n2:50:03.120 --> 2:50:10.240\n Is it an emergent phenomena, or do you need one of those to kind of guide the populace?\n\n2:50:10.240 --> 2:50:13.520\n I hope it's not a necessary requirement.\n\n2:50:13.520 --> 2:50:19.080\n I hope that the next Buddha can be the Sangha rather than a specific individual.\n\n2:50:19.080 --> 2:50:26.600\n But I think in that situation, Hitler's charisma allowed him to take on a mythological, in\n\n2:50:26.600 --> 2:50:29.440\n the proper sense, archetypal...\n\n2:50:29.440 --> 2:50:35.680\n He became deeply symbolic, and he instituted all kinds of rituals, all kinds of rituals,\n\n2:50:35.680 --> 2:50:38.640\n and all kinds of mythos.\n\n2:50:38.640 --> 2:50:43.840\n There's all this mythos about the master race, and there's all these rituals.\n\n2:50:43.840 --> 2:50:47.840\n The swastika is, of course, itself a religious symbol.\n\n2:50:47.840 --> 2:50:57.840\n There's all of this going on because he was tapping into the fact that when you put people\n\n2:50:57.840 --> 2:51:04.100\n into deeper and deeper meaning scarcity, they will fall back on more and more mythological\n\n2:51:04.100 --> 2:51:10.040\n ways of thinking in order to try and come up with a generative source to give them new\n\n2:51:10.040 --> 2:51:11.040\n meaning making.\n\n2:51:11.040 --> 2:51:16.280\n I should say meaning participating behavior.\n\n2:51:16.280 --> 2:51:19.220\n What is evil?\n\n2:51:19.220 --> 2:51:21.320\n Is this a word you avoid?\n\n2:51:21.320 --> 2:51:23.880\n No, I don't.\n\n2:51:23.880 --> 2:51:31.600\n Because I think part of what we're wrestling with here is resisting the Enlightenment,\n\n2:51:31.600 --> 2:51:38.180\n I mean the historical period in Europe, the idea that evil and sin can just be reduced\n\n2:51:38.180 --> 2:51:43.680\n to immorality, individual human immorality.\n\n2:51:43.680 --> 2:51:49.240\n I think there's something deeper in the idea of sin than just immoral.\n\n2:51:49.240 --> 2:51:53.080\n I think sin is a much more comprehensive category.\n\n2:51:53.080 --> 2:52:01.480\n I think sin is a failure to love wisely so that you ultimately engage in a kind of idolatry.\n\n2:52:01.480 --> 2:52:05.120\n You take something as ultimate, which is not.\n\n2:52:05.120 --> 2:52:14.080\n And that can tend to constellate these collective agents, I call them hyperagents, within distributed\n\n2:52:14.080 --> 2:52:21.520\n cognition that have a capacity to wreak havoc on the world that is not just due to a sort\n\n2:52:21.520 --> 2:52:25.680\n of a sum total of immoral decisions.\n\n2:52:25.680 --> 2:52:30.280\n This goes to Hannah Arendt's thing, and the banality of Eichmann.\n\n2:52:30.280 --> 2:52:34.500\n She was really wrestling with it, and I think she's close to something, but I think she's\n\n2:52:34.500 --> 2:52:35.500\n slightly off.\n\n2:52:35.500 --> 2:52:40.920\n Eichmann is just making a whole bunch of immoral decisions, but it doesn't seem to capture\n\n2:52:40.920 --> 2:52:46.360\n the gravity of what the Nazis did, the genocide and the warfare.\n\n2:52:46.360 --> 2:52:51.160\n And she's right, because you're not going to get just the summation of a lot of individual\n\n2:52:51.160 --> 2:52:55.920\n rather banal immoral choices adding up to what was going on.\n\n2:52:55.920 --> 2:53:03.520\n You're getting a comprehensive parasitic process within massive distributed cognition that\n\n2:53:03.520 --> 2:53:09.960\n has the power to confront the world and confront aspects of the world that individuals can't.\n\n2:53:09.960 --> 2:53:14.520\n And I think when we're talking about evil, that's what we're trying to point to.\n\n2:53:14.520 --> 2:53:18.200\n This is a point of convergence between me and Jonathan Paget.\n\n2:53:18.200 --> 2:53:19.440\n We've been talking about this.\n\n2:53:19.440 --> 2:53:21.520\n So the word sin is interesting.\n\n2:53:21.520 --> 2:53:22.520\n Yes.\n\n2:53:22.520 --> 2:53:23.520\n Are you comfortable using the word sin?\n\n2:53:23.520 --> 2:53:24.520\n I'm comfortable.\n\n2:53:24.520 --> 2:53:27.280\n Because it's so deeply rooted in religious texts.\n\n2:53:27.280 --> 2:53:28.280\n It is.\n\n2:53:28.280 --> 2:53:29.280\n It is.\n\n2:53:29.280 --> 2:53:35.320\n And in part, and I struggle around this because I was brought up as a fundamentalist Christian,\n\n2:53:35.320 --> 2:53:38.920\n and so that is still there within me.\n\n2:53:38.920 --> 2:53:41.480\n There's trauma associated with that.\n\n2:53:41.480 --> 2:53:45.880\n Probably layers of self deception mechanisms.\n\n2:53:45.880 --> 2:53:46.880\n No doubt.\n\n2:53:46.880 --> 2:53:47.880\n No doubt.\n\n2:53:47.880 --> 2:53:48.880\n That you're slowly escaping.\n\n2:53:48.880 --> 2:53:49.880\n Yes.\n\n2:53:49.880 --> 2:53:50.880\n Trying to.\n\n2:53:50.880 --> 2:53:58.320\n And trying to come into a proper respectful relationship with Christianity via a detour\n\n2:53:58.320 --> 2:54:02.000\n through Buddhism, Taoism, and pagan Neoplatonism.\n\n2:54:02.000 --> 2:54:04.120\n Trying to find a way how to love wisely.\n\n2:54:04.120 --> 2:54:05.440\n Yes, exactly.\n\n2:54:05.440 --> 2:54:14.560\n And so I think the term sin is good because somebody may not be doing something that we\n\n2:54:14.560 --> 2:54:24.760\n would prototypically call immoral, but if they're failing to love wisely, they are disconnecting\n\n2:54:24.760 --> 2:54:30.520\n themselves in some important way from the structures of reality.\n\n2:54:30.520 --> 2:54:33.880\n And I think it was Hume.\n\n2:54:33.880 --> 2:54:34.880\n I may be wrong.\n\n2:54:34.880 --> 2:54:39.320\n Hume says, you know, people don't do things because they think it's wrong.\n\n2:54:39.320 --> 2:54:42.600\n They do a lesser good in place of a greater good.\n\n2:54:42.600 --> 2:54:45.440\n And that's a different thing than being immoral.\n\n2:54:45.440 --> 2:54:48.240\n Immoral, we're saying, you're doing something that's wrong.\n\n2:54:48.240 --> 2:54:51.920\n It's like, well, no, no, you know, I'm loving my wife.\n\n2:54:51.920 --> 2:54:53.920\n That's a great thing, isn't it?\n\n2:54:53.920 --> 2:54:54.920\n Yeah.\n\n2:54:54.920 --> 2:55:00.360\n But if you love your wife at the expense of your kids, like, wow, maybe something's going\n\n2:55:00.360 --> 2:55:01.360\n awry here.\n\n2:55:01.360 --> 2:55:02.360\n Right?\n\n2:55:02.360 --> 2:55:03.360\n Well, I love my country.\n\n2:55:03.360 --> 2:55:04.360\n Great.\n\n2:55:04.360 --> 2:55:09.720\n But should you love your country at the expense of your commitment to the religion you belong\n\n2:55:09.720 --> 2:55:10.720\n to?\n\n2:55:10.720 --> 2:55:13.720\n I mean, people should wrestle with these questions.\n\n2:55:13.720 --> 2:55:17.280\n And I think sin is a failure to wrestle with these questions properly.\n\n2:55:17.280 --> 2:55:18.280\n Yeah.\n\n2:55:18.280 --> 2:55:24.960\n To be content with the choices you've made without considering, is there a greater good\n\n2:55:24.960 --> 2:55:26.360\n that could be done?\n\n2:55:26.360 --> 2:55:27.360\n Yeah.\n\n2:55:27.360 --> 2:55:32.480\n Your lecture series on The Meaning Crisis puts us in dialogue in the same way as with\n\n2:55:32.480 --> 2:55:37.640\n the podcast with a bunch of fascinating thinkers throughout history.\n\n2:55:37.640 --> 2:55:38.640\n Yes.\n\n2:55:38.640 --> 2:55:45.920\n For example, Paul Corbin, the man Carl Jung, Tillich, Barfield, is there, can you describe,\n\n2:55:45.920 --> 2:55:53.160\n this might be challenging, but one powerful idea from each that jumps to mind?\n\n2:55:53.160 --> 2:55:54.160\n Yes.\n\n2:55:54.160 --> 2:55:55.160\n Maybe Heidegger?\n\n2:55:55.160 --> 2:56:02.260\n So for Heidegger, one real powerful idea that has had a huge influence on me, he's had a\n\n2:56:02.260 --> 2:56:04.200\n huge influence on me in many ways.\n\n2:56:04.200 --> 2:56:07.280\n He's a big influence on what's called 4E Cognitive Science.\n\n2:56:07.280 --> 2:56:12.960\n And this whole idea about the nonpropositional, that was deeply afforded by Heidegger and\n\n2:56:12.960 --> 2:56:13.960\n Marla Ponti.\n\n2:56:13.960 --> 2:56:19.400\n But I guess maybe the one idea, if I had to pick one, is his critique of ontotheology,\n\n2:56:19.400 --> 2:56:24.480\n his critique of the attempt to understand being in terms of a supreme being, something\n\n2:56:24.480 --> 2:56:30.520\n like that, and how that gets us fundamentally messed up and we get disconnected from being\n\n2:56:30.520 --> 2:56:33.280\n because we are overfocused on particular beings.\n\n2:56:33.280 --> 2:56:34.920\n We're failing to love wisely.\n\n2:56:34.920 --> 2:56:39.240\n We're loving the individual things and we're not loving the ground from which they spring.\n\n2:56:39.240 --> 2:56:42.300\n Can you explain that a little more?\n\n2:56:42.300 --> 2:56:45.560\n What's the difference between the being and the supreme being and why that gets us into\n\n2:56:45.560 --> 2:56:46.560\n trouble?\n\n2:56:46.560 --> 2:56:47.560\n Okay.\n\n2:56:47.560 --> 2:56:51.460\n So, well, we talked about this before, the supreme being is a particular being, whereas\n\n2:56:51.460 --> 2:56:52.860\n being is no thing.\n\n2:56:52.860 --> 2:56:54.700\n It's not any particular kind of thing.\n\n2:56:54.700 --> 2:57:00.500\n And so if you're thinking of being as a being, you're thinking of it in a thingy way about\n\n2:57:00.500 --> 2:57:03.040\n something that is fundamentally no thingness.\n\n2:57:03.040 --> 2:57:08.380\n And so then you're disconnecting yourself from presumably ultimate reality.\n\n2:57:08.380 --> 2:57:10.560\n This takes me to Tillich.\n\n2:57:10.560 --> 2:57:18.520\n Tillich's great idea is understanding faith as ultimate concern rather than a set of propositions\n\n2:57:18.520 --> 2:57:20.520\n that you're asserting, right?\n\n2:57:20.520 --> 2:57:25.200\n So what are you ultimately concerned about?\n\n2:57:25.200 --> 2:57:31.800\n What do you want to be in right relationship to, ratio religio?\n\n2:57:31.800 --> 2:57:34.020\n And is that ultimate?\n\n2:57:34.020 --> 2:57:36.440\n Is that the ultimate reality that you conceive of?\n\n2:57:36.440 --> 2:57:38.920\n Are those two things in sync?\n\n2:57:38.920 --> 2:57:44.480\n This has had a profound influence on me and I think it's a brilliant idea.\n\n2:57:44.480 --> 2:57:49.260\n So some of the others, how do they integrate?\n\n2:57:49.260 --> 2:57:54.120\n Maybe this is Carl Jung and Freud.\n\n2:57:54.120 --> 2:57:55.320\n Which team are you on?\n\n2:57:55.320 --> 2:57:57.040\n I'm on Jung.\n\n2:57:57.040 --> 2:58:02.980\n Freud is the better writer, but Jung has, I think, a model of the psyche that is closer\n\n2:58:02.980 --> 2:58:06.000\n to where cognitive science is heading.\n\n2:58:06.000 --> 2:58:07.680\n He's more prescient.\n\n2:58:07.680 --> 2:58:09.480\n Which aspect of his model of the psyche?\n\n2:58:09.480 --> 2:58:10.480\n Directly.\n\n2:58:10.480 --> 2:58:11.560\n So Freud has a hydraulic model.\n\n2:58:11.560 --> 2:58:13.080\n The psyche is like a steam engine.\n\n2:58:13.080 --> 2:58:16.400\n Things are under pressure and there's a fluid that's moving around.\n\n2:58:16.400 --> 2:58:19.760\n It's like, like this is a record note of this.\n\n2:58:19.760 --> 2:58:21.800\n Jung has an organic model.\n\n2:58:21.800 --> 2:58:24.120\n The psyche is like a living being.\n\n2:58:24.120 --> 2:58:26.480\n It's doing all this opponent processing.\n\n2:58:26.480 --> 2:58:30.920\n It's doing all of this self transcending and growing.\n\n2:58:30.920 --> 2:58:37.120\n And I think that's a much better model of the psyche than the sort of steam engine model.\n\n2:58:37.120 --> 2:58:41.120\n What do you think about their view of the subconscious mind?\n\n2:58:41.120 --> 2:58:47.760\n What do you think their view and your own view of what's going on there in the shadow?\n\n2:58:47.760 --> 2:58:53.680\n So all bad stuff, some good stuff, any stuff at all?\n\n2:58:53.680 --> 2:59:00.240\n Well, I mean, both Freud and Jung are only talking about the psychodynamic unconscious,\n\n2:59:00.240 --> 2:59:02.520\n which is only a small part of the unconscious.\n\n2:59:02.520 --> 2:59:05.160\n Can you elaborate on the psychodynamic?\n\n2:59:05.160 --> 2:59:12.800\n They're talking about the aspects of the unconscious that have to do with your sort of ego development\n\n2:59:12.800 --> 2:59:16.960\n and how you are understanding and interpreting yourself.\n\n2:59:16.960 --> 2:59:17.960\n Yeah.\n\n2:59:17.960 --> 2:59:19.640\n What else is there?\n\n2:59:19.640 --> 2:59:23.280\n There's the unconscious that allows you to turn the noise coming out of my face hole\n\n2:59:23.280 --> 2:59:25.000\n into ideas.\n\n2:59:25.000 --> 2:59:31.200\n There's the unconscious that says, yeah, all that stuff, which is huge and powerful.\n\n2:59:31.200 --> 2:59:33.240\n And they didn't think about that.\n\n2:59:33.240 --> 2:59:37.400\n They're focused on the big romantic stuff that you have to deal with through psychotherapy,\n\n2:59:37.400 --> 2:59:38.560\n that kind of stuff.\n\n2:59:38.560 --> 2:59:39.760\n Which is relevant and important.\n\n2:59:39.760 --> 2:59:40.760\n I'm not dismissing.\n\n2:59:40.760 --> 2:59:44.080\n I'm not saying it doesn't exist, but it's certainly not all of the unconscious.\n\n2:59:44.080 --> 2:59:50.000\n A lot of work that's going on, my colleague and deep friend, Anderson Todd is about, can\n\n2:59:50.000 --> 2:59:54.160\n we take the Jungian stuff and the cognitive science stuff and can we integrate it together\n\n2:59:54.160 --> 2:59:55.440\n theoretically?\n\n2:59:55.440 --> 2:59:59.320\n And so he's working on that, exactly that project.\n\n2:59:59.320 --> 3:00:02.360\n But nevertheless, your sense is there is a subconscious.\n\n3:00:02.360 --> 3:00:03.360\n Or at least an unconscious.\n\n3:00:03.360 --> 3:00:05.200\n I like the term unconscious.\n\n3:00:05.200 --> 3:00:09.960\n And Jung continually reminded people that the unconscious is unconscious, that we're\n\n3:00:09.960 --> 3:00:11.680\n not conscious of it.\n\n3:00:11.680 --> 3:00:13.160\n And that's its fundamental property.\n\n3:00:13.160 --> 3:00:21.200\n Yeah, and then isn't the task of therapy then to bring, to make the unconscious conscious?\n\n3:00:21.200 --> 3:00:23.560\n Yeah, to a degree, right?\n\n3:00:23.560 --> 3:00:31.680\n But also, I mean, yeah, to bring consciousness where there was unconscious is part of Jung's\n\n3:00:31.680 --> 3:00:32.800\n mythos.\n\n3:00:32.800 --> 3:00:36.680\n But it's also not the thought that that can be completed.\n\n3:00:36.680 --> 3:00:41.840\n Part of why you're extending the reach of the conscious mind is it so it can enter into\n\n3:00:41.840 --> 3:00:48.360\n a more proper dialogical relationship with the self organizing system of the unconscious\n\n3:00:48.360 --> 3:00:49.360\n mind.\n\n3:00:49.360 --> 3:00:53.200\n What did they have to say about the motivations of humans?\n\n3:00:53.200 --> 3:00:59.400\n So for Freud, jokingly, I said, you know, sex, so much of our mind is developed in our\n\n3:00:59.400 --> 3:01:07.160\n young age, sexual interactions with the world or whatever, hence the thing about the edible\n\n3:01:07.160 --> 3:01:12.180\n complex and all, you know, I wanted to have sex with your mother.\n\n3:01:12.180 --> 3:01:16.320\n What do you think about their description about what motivates humans?\n\n3:01:16.320 --> 3:01:22.520\n And what do you think about the will to power from Nietzsche?\n\n3:01:22.520 --> 3:01:24.120\n Which camp are you in there?\n\n3:01:24.120 --> 3:01:27.440\n What motivates humans?\n\n3:01:27.440 --> 3:01:28.980\n Sex or power?\n\n3:01:28.980 --> 3:01:30.760\n I think Plato is right.\n\n3:01:30.760 --> 3:01:33.360\n And I think there's a connection for me.\n\n3:01:33.360 --> 3:01:36.840\n Plato's my first philosopher, Jung's my first psychologist, and Jung is very much the Plato\n\n3:01:36.840 --> 3:01:37.840\n of the psyche.\n\n3:01:37.840 --> 3:01:38.840\n You never forget your first.\n\n3:01:38.840 --> 3:01:39.840\n Yeah.\n\n3:01:39.840 --> 3:01:40.840\n You never do.\n\n3:01:40.840 --> 3:01:41.840\n You never do.\n\n3:01:41.840 --> 3:01:50.040\n And I think we have, I reject the monological mind, I reject the monophasic mind model.\n\n3:01:50.040 --> 3:01:51.720\n I think we are multi centered.\n\n3:01:51.720 --> 3:01:57.180\n I think we have different centers of motivation that operate according to different principles\n\n3:01:57.180 --> 3:02:05.760\n to satisfy different problems, and that part of the task of our humanity is to get those\n\n3:02:05.760 --> 3:02:14.320\n different centers into some internal culture by which they are optimally cooperating rather\n\n3:02:14.320 --> 3:02:18.400\n than in conflict with each other.\n\n3:02:18.400 --> 3:02:22.880\n What advice would you give to young people today?\n\n3:02:22.880 --> 3:02:25.960\n They're in high school trying to figure out what they're going to do with their life.\n\n3:02:25.960 --> 3:02:28.120\n Maybe they're in college.\n\n3:02:28.120 --> 3:02:32.720\n What advice would you give how to have a career they can be proud of or how to have a life\n\n3:02:32.720 --> 3:02:37.800\n they can be proud of?\n\n3:02:37.800 --> 3:02:48.040\n So the first thing is find an ecology of practices and a community that supports them without\n\n3:02:48.040 --> 3:02:54.800\n involving you in believing things that contravene our best understood science so that wisdom\n\n3:02:54.800 --> 3:03:02.120\n and virtue, especially how they show up in relationships, are primary to you.\n\n3:03:02.120 --> 3:03:09.500\n This will sound ridiculous, but if you take care of that, the other things you want are\n\n3:03:09.500 --> 3:03:11.000\n more likely to occur.\n\n3:03:11.000 --> 3:03:22.900\n Because what you want at when you're approaching your death is what were the relationships\n\n3:03:22.900 --> 3:03:27.480\n you cultivated to yourself, to other people, to the world, and what did you do to improve\n\n3:03:27.480 --> 3:03:33.560\n the chance of them being deep and profound relationships?\n\n3:03:33.560 --> 3:03:38.520\n That's an interesting ecology of practice, finding a place where a lot of people are\n\n3:03:38.520 --> 3:03:43.760\n doing different things that are interesting interplay with each other, but at the same\n\n3:03:43.760 --> 3:03:49.520\n time is not a cult where ideas can flourish.\n\n3:03:49.520 --> 3:03:53.600\n How the hell do you know?\n\n3:03:53.600 --> 3:03:59.120\n Because in a place where people are really excited about doing stuff, that's very ripe\n\n3:03:59.120 --> 3:04:01.040\n for cult formation.\n\n3:04:01.040 --> 3:04:05.920\n Especially if they're awash in a culture in which we have ever expanding waves of bullshit.\n\n3:04:05.920 --> 3:04:07.800\n Yes, precisely.\n\n3:04:07.800 --> 3:04:08.800\n So...\n\n3:04:08.800 --> 3:04:11.040\n Try to keep away from the bullshit is the advice.\n\n3:04:11.040 --> 3:04:12.040\n Yes.\n\n3:04:12.040 --> 3:04:16.560\n No, I mean, I take this very seriously and I was with a bunch of people in Vermont at\n\n3:04:16.560 --> 3:04:22.860\n the respond retreat, people, Rafe Kelly was there, a bunch of people who have set up ecologies\n\n3:04:22.860 --> 3:04:27.120\n of practices and created communities.\n\n3:04:27.120 --> 3:04:31.960\n And I have good reason to find all of these people trustworthy.\n\n3:04:31.960 --> 3:04:39.480\n And so we gathered together to try and generate real dialogos, flow in distributed cognition,\n\n3:04:39.480 --> 3:04:44.400\n exercise the collective intelligence, and try and address that problem, both in terms\n\n3:04:44.400 --> 3:04:51.960\n of metachurriculum that we can offer emerging communities, in terms of practices of vetting,\n\n3:04:51.960 --> 3:04:58.960\n how we will self govern the federation we're forming so that we can resist gurufication.\n\n3:04:58.960 --> 3:05:00.600\n Gurufication of people or ideas?\n\n3:05:00.600 --> 3:05:01.600\n Both.\n\n3:05:01.600 --> 3:05:02.600\n Yeah.\n\n3:05:02.600 --> 3:05:03.600\n Both.\n\n3:05:03.600 --> 3:05:04.600\n Some of us just get unlucky.\n\n3:05:04.600 --> 3:05:11.480\n Some of us get unlucky and we all at respond, we all had a tremendous sense of urgency around\n\n3:05:11.480 --> 3:05:18.040\n this, but we were trying to balance it about not being premature, but there was going to,\n\n3:05:18.040 --> 3:05:22.680\n I mean, we're going to produce a metachurriculum that's coming in months, there's going to\n\n3:05:22.680 --> 3:05:27.880\n be a scientific paper about integrating the scientific work on wisdom with this practitioner\n\n3:05:27.880 --> 3:05:34.480\n based ideas about the cultivation of wisdom, there's going to be projects about how we\n\n3:05:34.480 --> 3:05:41.880\n can create a self correcting vetting system so we can say to people, we think this ecology\n\n3:05:41.880 --> 3:05:47.160\n is legit, it's in good fellowship with all these other legit ecologies, we don't know\n\n3:05:47.160 --> 3:05:51.880\n about that one, we're hesitant about that one, it's not in good fellowship, we have\n\n3:05:51.880 --> 3:05:55.020\n concerns, here's why we have our concerns, et cetera.\n\n3:05:55.020 --> 3:05:56.940\n And you may say, well, who are you to do that?\n\n3:05:56.940 --> 3:06:00.160\n It's like nobody, but somebody's got to do it, right?\n\n3:06:00.160 --> 3:06:04.180\n And that's what it comes down to, and so we're going to give it our best effort.\n\n3:06:04.180 --> 3:06:06.520\n It's worth a try.\n\n3:06:06.520 --> 3:06:17.200\n You talked about the meaning crisis in human civilization, but in your own personal life,\n\n3:06:17.200 --> 3:06:20.600\n what has been a dark place you've ever gone in your mind?\n\n3:06:20.600 --> 3:06:24.520\n Has there been difficult times in your life where you've really struggled?\n\n3:06:24.520 --> 3:06:25.520\n Yes.\n\n3:06:25.520 --> 3:06:34.920\n So when I left fundamentalist Christianity, and for a while I was just sort of a hard\n\n3:06:34.920 --> 3:06:43.960\n bitten atheist, the problem with leaving the belief structure was that I didn't deal with\n\n3:06:43.960 --> 3:06:50.280\n all the nonpropositional things that had gotten into me, all the procedures and habits and\n\n3:06:50.280 --> 3:06:55.040\n all the perspectives and all the identities and the trauma associated with that.\n\n3:06:55.040 --> 3:07:01.720\n So I required therapy, it required years of meditation and Tai Chi, and I'm still wrestling\n\n3:07:01.720 --> 3:07:12.560\n with it, but for the first four or five years, I would... I described it like this, I called\n\n3:07:12.560 --> 3:07:13.560\n it the black burning.\n\n3:07:13.560 --> 3:07:19.960\n I felt like there was a blackness that was on fire inside of me, precisely because the\n\n3:07:19.960 --> 3:07:24.660\n religion had left a taste for the transcendent in my mouth, but it had... The food it had\n\n3:07:24.660 --> 3:07:29.760\n given me, food in square quotes, had soured in my stomach and made me nauseous, and the\n\n3:07:29.760 --> 3:07:36.500\n juxtaposition of those seemed like an irresolvable problem for me.\n\n3:07:36.500 --> 3:07:38.600\n That was a very, very dark time for me.\n\n3:07:38.600 --> 3:07:41.720\n Did it feel lonely?\n\n3:07:41.720 --> 3:07:48.860\n When it was very bad, it felt extremely lonely and deeply alienating.\n\n3:07:48.860 --> 3:07:53.680\n The universe seemed absurd, and there was also existential anxiety.\n\n3:07:53.680 --> 3:07:55.480\n I talk about these things for a reason.\n\n3:07:55.480 --> 3:07:57.880\n I don't just talk about them as things I'm pointing to.\n\n3:07:57.880 --> 3:08:04.080\n I'm talking about them as seeing in myself and in people I care, having undergone them\n\n3:08:04.080 --> 3:08:12.480\n and how they can bring you close to self destructive... I started engaging in kinds of self destructive\n\n3:08:12.480 --> 3:08:13.480\n behavior.\n\n3:08:13.480 --> 3:08:20.440\n So the meaning crisis to you is not just the thing you look outside and see many people\n\n3:08:20.440 --> 3:08:21.440\n struggling.\n\n3:08:21.440 --> 3:08:22.440\n You yourself have struggled.\n\n3:08:22.440 --> 3:08:29.920\n But that's, in fact, the narrative, is I struggled with it, thinking it was a purely personal,\n\n3:08:29.920 --> 3:08:30.920\n idiosyncratic thing.\n\n3:08:30.920 --> 3:08:35.540\n I started learning the kog sai, I started doing the tai chi and the meditation, I started\n\n3:08:35.540 --> 3:08:39.760\n doing all this Socratic philosophy.\n\n3:08:39.760 --> 3:08:47.360\n And when I started to talk about these pieces, I saw my students eyes light up, and I realized,\n\n3:08:47.360 --> 3:08:52.800\n wait, maybe this isn't just something I'm going through.\n\n3:08:52.800 --> 3:08:58.840\n And talking to them and then doing the research and expanding it out, it's like, oh, many\n\n3:08:58.840 --> 3:09:05.000\n people in a shared fashion and also in an individual lonely fashion are going through\n\n3:09:05.000 --> 3:09:06.000\n meaning crisis.\n\n3:09:06.000 --> 3:09:12.460\n Well, we talked a lot about wisdom and meaning, and you said that the goal is to love wisely.\n\n3:09:12.460 --> 3:09:14.760\n So let me ask about love.\n\n3:09:14.760 --> 3:09:18.040\n What's the role of love in the human condition?\n\n3:09:18.040 --> 3:09:19.040\n It's central.\n\n3:09:19.040 --> 3:09:23.300\n I mean, it's even central to reason and rationality.\n\n3:09:23.300 --> 3:09:30.720\n This is Plato, but Spinoza, the most logical of the rationalists.\n\n3:09:30.720 --> 3:09:36.840\n The ethics is written like Euclid's geometry, but he calls it the ethics for a reason, because\n\n3:09:36.840 --> 3:09:38.800\n he wants to talk about the blessed life.\n\n3:09:38.800 --> 3:09:40.360\n And what does he say?\n\n3:09:40.360 --> 3:09:47.260\n He says that ultimately reason needs love, because love is what brings reason out of\n\n3:09:47.260 --> 3:09:52.440\n being entrapped in the gravity well of egocentrism.\n\n3:09:52.440 --> 3:09:57.520\n And Murdoch, Iris Murdoch said, I think really beautifully, love is when you painfully realize\n\n3:09:57.520 --> 3:10:03.320\n that something other than yourself is real.\n\n3:10:03.320 --> 3:10:06.680\n Escaping the gravity well of egocentrism.\n\n3:10:06.680 --> 3:10:07.680\n Beautifully put.\n\n3:10:07.680 --> 3:10:09.040\n A beautiful way to end it.\n\n3:10:09.040 --> 3:10:11.200\n And you're a beautiful human being.\n\n3:10:11.200 --> 3:10:17.660\n Thank you for struggling in your own mind with the search for meaning and encouraging\n\n3:10:17.660 --> 3:10:19.640\n others to do the same.\n\n3:10:19.640 --> 3:10:21.920\n And ultimately to learn how to love wisely.\n\n3:10:21.920 --> 3:10:23.640\n Thank you so much for talking today.\n\n3:10:23.640 --> 3:10:24.800\n It's been a great pleasure, Lex.\n\n3:10:24.800 --> 3:10:26.160\n I really enjoyed it a lot.\n\n3:10:26.160 --> 3:10:27.160\n Thank you so much.\n\n3:10:27.160 --> 3:10:30.240\n Thanks for listening to this conversation with Jon Verweke.\n\n3:10:30.240 --> 3:10:34.720\n To support this podcast, please check out our sponsors in the description.\n\n3:10:34.720 --> 3:10:38.600\n And now let me leave you with some words from Hermann Hesse in Siddhartha.\n\n3:10:38.600 --> 3:10:43.400\n I've always believed, and I still believe, that whatever good or bad fortune may come\n\n3:10:43.400 --> 3:10:49.560\n our way, we can always give it meaning and transform it into something of value.\n\n3:10:49.560 --> 3:11:09.080\n Thank you for listening and hope to see you next time.\n\n"
}