{
  "title": "Dan Kokotov: Speech Recognition with AI and Humans | Lex Fridman Podcast #151",
  "id": "yTWa-Z1UQwU",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:05.560\n The following is a conversation with Dan Kokotov, VP of engineering at rev.ai,\n\n00:06.000 --> 00:11.520\n which is by many metrics, the best speech to text AI engine in the world.\n\n00:12.360 --> 00:16.320\n Rev in general is a company that does captioning and transcription\n\n00:16.320 --> 00:19.160\n of audio by humans and by AI.\n\n00:20.000 --> 00:23.480\n I've been using their services for a couple of years now and I'm planning\n\n00:23.480 --> 00:28.000\n to use Rev to add both captions and transcripts to some of the previous\n\n00:28.000 --> 00:32.480\n and future episodes of this podcast to make it easier for people to read\n\n00:32.480 --> 00:36.800\n through the conversation or reference various parts of the episode, since\n\n00:36.800 --> 00:39.120\n that's something that quite a few people requested.\n\n00:39.760 --> 00:44.800\n I'll probably do a separate video on that with links on the podcast website\n\n00:45.440 --> 00:48.000\n so people can provide suggestions and improvements there.\n\n00:48.400 --> 00:52.840\n Quick mention of our sponsors, Athletic Greens, All in One Nutrition Drink,\n\n00:52.840 --> 00:58.960\n Blinkist app that summarizes books, Business Wars podcast, and Cash App.\n\n00:59.600 --> 01:02.360\n So the choice is health, wisdom, or money.\n\n01:02.840 --> 01:06.880\n Choose wisely my friends, and if you wish, click the sponsor links\n\n01:06.880 --> 01:09.640\n below to get a discount and to support this podcast.\n\n01:10.320 --> 01:13.080\n As a side note, let me say that I reached out to Dan and the Rev\n\n01:13.080 --> 01:17.880\n team for a conversation because I've been using and genuinely loving\n\n01:18.120 --> 01:21.320\n their service and really curious about how it works.\n\n01:21.320 --> 01:24.840\n I previously talked to the head of Adobe research for the same reason.\n\n01:25.440 --> 01:30.040\n For me, there's a bunch of products, usually software, that comes along\n\n01:30.040 --> 01:31.640\n and just makes my life way easier.\n\n01:32.040 --> 01:37.200\n Examples are Adobe Premiere for video editing, iZotope RX for cleaning up audio,\n\n01:37.480 --> 01:43.680\n AutoHotKey on Windows for automating keyboard and mouse tasks, Emacs as an\n\n01:43.680 --> 01:46.520\n IDE for everything, including the universe itself.\n\n01:47.080 --> 01:49.080\n I can keep on going, but you get the idea.\n\n01:49.080 --> 01:52.240\n I just like talking to people who create things I'm a big fan of.\n\n01:52.760 --> 01:58.800\n That said, after doing this conversation, the folks at Rev.ai offered to sponsor\n\n01:58.800 --> 02:00.320\n this podcast in the coming months.\n\n02:01.040 --> 02:04.240\n This conversation is not sponsored by the guest.\n\n02:04.880 --> 02:08.640\n It probably goes without saying, but I should say it anyway, that you\n\n02:08.640 --> 02:11.280\n can not buy your way onto this podcast.\n\n02:11.600 --> 02:13.000\n I don't know why you would want to.\n\n02:13.720 --> 02:17.480\n I wanted to bring this up to make a specific point that no sponsor\n\n02:17.480 --> 02:21.240\n will ever influence what I do on this podcast, or to the best of\n\n02:21.240 --> 02:22.960\n my ability, influence what I think.\n\n02:23.480 --> 02:25.400\n I wasn't really thinking about this.\n\n02:25.480 --> 02:30.520\n For example, when I interviewed Jack Dorsey, who is the CEO of Square that\n\n02:30.520 --> 02:34.720\n happens to be sponsoring this podcast, but I should really make it explicit.\n\n02:34.960 --> 02:37.520\n I will never take money for bringing a guest on.\n\n02:37.920 --> 02:43.200\n Every guest on this podcast is someone I genuinely am curious to talk to or just\n\n02:43.240 --> 02:45.440\n genuinely love something they've created.\n\n02:45.440 --> 02:49.360\n As I sometimes get criticized for, I'm just a fan of people.\n\n02:49.760 --> 02:50.760\n And that's who I talk to.\n\n02:51.440 --> 02:55.640\n As I also talk about way too much, money is really never a consideration.\n\n02:56.120 --> 02:59.600\n In general, no amount of money can buy my integrity.\n\n03:00.240 --> 03:03.880\n That's true for this podcast, and that's true for anything else I do.\n\n03:05.160 --> 03:09.560\n If you enjoy this thing, subscribe on YouTube, review on the Apple podcast,\n\n03:09.760 --> 03:14.120\n follow on Spotify, support on Patreon, a podcast on YouTube, and\n\n03:14.120 --> 03:17.840\n support on Patreon, or connect with me on Twitter at Lex Friedman.\n\n03:18.280 --> 03:21.880\n And now here's my conversation with Dan Kokotov.\n\n03:23.080 --> 03:25.000\n You mentioned science fiction on the phone.\n\n03:25.600 --> 03:28.040\n So let's go with the ridiculous first.\n\n03:28.040 --> 03:31.680\n What's the greatest sci fi novel of all time in your view?\n\n03:32.360 --> 03:37.560\n And maybe what ideas do you find philosophically fascinating about it?\n\n03:37.800 --> 03:40.960\n The greatest sci fi novel of all time is Dune.\n\n03:40.960 --> 03:43.880\n And the second greatest is The Children of Dune.\n\n03:43.880 --> 03:47.080\n And the third greatest is The God Emperor of Dune.\n\n03:47.080 --> 03:50.120\n So I'm a huge fan of the whole series.\n\n03:50.120 --> 03:53.400\n I mean, it's just an incredible world that he created.\n\n03:53.720 --> 03:55.360\n And I don't know if you've read the book or not.\n\n03:55.480 --> 03:56.280\n No, I have not.\n\n03:56.280 --> 04:00.520\n It's one of my biggest regrets, especially because a new movie is coming out.\n\n04:01.480 --> 04:02.880\n Everyone's super excited about it.\n\n04:02.920 --> 04:07.600\n I used to, it's ridiculous to say, and sorry to interrupt, is that I\n\n04:07.600 --> 04:09.600\n used to play the video game.\n\n04:09.600 --> 04:10.800\n It used to be Dune.\n\n04:11.280 --> 04:13.680\n I guess you would call that real time strategy.\n\n04:13.720 --> 04:14.080\n Right.\n\n04:14.080 --> 04:15.200\n I think I remember that game.\n\n04:15.240 --> 04:16.400\n Yeah, it was kind of awesome.\n\n04:16.400 --> 04:17.400\n Nineties or something.\n\n04:17.400 --> 04:19.440\n I think I played it actually when I was in Russia.\n\n04:19.800 --> 04:21.200\n I definitely remember it.\n\n04:21.240 --> 04:22.880\n I was not in Russia anymore.\n\n04:22.880 --> 04:26.800\n I think at the time that I used to live in Russia, I think video games\n\n04:26.800 --> 04:29.080\n were about like the suspicion of Pong.\n\n04:29.080 --> 04:33.240\n I think Pong was pretty much like the greatest game I ever got to play in Russia,\n\n04:33.280 --> 04:35.200\n which was still a privilege right in that age.\n\n04:35.240 --> 04:36.480\n So you didn't get color?\n\n04:36.520 --> 04:39.120\n You didn't get like, uh, so I left Russia.\n\n04:39.120 --> 04:40.840\n I left Russia in 1991, right?\n\n04:40.840 --> 04:41.680\n Okay.\n\n04:41.680 --> 04:45.160\n So I was one of the few lucky kids because my mom was a programmer.\n\n04:45.200 --> 04:47.120\n So I would go to her work, right?\n\n04:47.120 --> 04:48.880\n I would take the, the Metro.\n\n04:49.200 --> 04:52.160\n I've got our work and play like on, I guess the equivalent of like a\n\n04:52.160 --> 04:56.120\n 286 PC, you know, nice floppy disks.\n\n04:56.160 --> 04:56.600\n Yes.\n\n04:56.880 --> 04:57.280\n So, okay.\n\n04:57.280 --> 04:59.440\n Put back to doing what you get back to doing.\n\n04:59.960 --> 05:04.200\n And by the way, the new movie I'm pretty interested in, but the\n\n05:04.200 --> 05:06.480\n skeptical, I'm a little skeptical.\n\n05:06.600 --> 05:07.200\n I'm a little skeptical.\n\n05:07.200 --> 05:08.120\n I saw the trailer.\n\n05:08.120 --> 05:09.280\n Uh, I don't know.\n\n05:09.320 --> 05:12.680\n So there's, there's a David Lynch movie doing as you may know, I'm\n\n05:12.680 --> 05:14.120\n a huge David Lynch fan, by the way.\n\n05:14.200 --> 05:20.200\n So the movie is somewhat controversial, but it's a little confusing, but it\n\n05:20.200 --> 05:24.600\n captures kind of the mood of the book better than I would say like most any\n\n05:24.600 --> 05:28.240\n adaptation and like doing so much about kind of mood and the world, right.\n\n05:28.640 --> 05:29.920\n But back to the philosophical point.\n\n05:29.920 --> 05:36.400\n So in the fourth book, God, emperor of doing, there's a sort of setting where\n\n05:36.400 --> 05:41.120\n Leto, one of the characters, he's become this weird sort of God emperor.\n\n05:41.280 --> 05:42.720\n He's turned into a gigantic worm.\n\n05:42.720 --> 05:44.800\n I mean, you kind of have to read the book to understand what that means.\n\n05:44.920 --> 05:47.120\n So the worms are involved, the worms are involved.\n\n05:47.120 --> 05:48.760\n You probably saw the worms in the trailer, right.\n\n05:49.200 --> 05:53.200\n And in the video, you kind of like merges with the swarm, um, and becomes\n\n05:53.200 --> 05:56.640\n this tyrant of the world and like oppresses the people for a long time.\n\n05:56.640 --> 05:56.840\n Right.\n\n05:56.840 --> 06:01.640\n But he has a purpose and the purpose is to kind of, uh, break through kind of\n\n06:01.640 --> 06:03.760\n a stagnation period in civilization.\n\n06:03.840 --> 06:04.120\n Right.\n\n06:04.120 --> 06:06.040\n Um, but people have gotten too comfortable, right.\n\n06:06.040 --> 06:11.720\n And so you kind of oppresses them so that they explode and like go on to\n\n06:11.720 --> 06:15.720\n colonize new worlds and kind of renew the forward momentum of humanity.\n\n06:15.720 --> 06:16.040\n Right.\n\n06:16.520 --> 06:18.520\n And so to me, that's kind of fascinating, right.\n\n06:18.520 --> 06:21.640\n You need a little bit of pressure and suffering, right.\n\n06:21.640 --> 06:25.520\n To kind of like make progress, not, not, not get too comfortable.\n\n06:28.120 --> 06:33.120\n Maybe that's a bit of a cruel philosophy to take away, but that seems to be\n\n06:33.120 --> 06:38.320\n the case, unfortunately, obviously, I'm a huge fan of, uh, suffering.\n\n06:39.040 --> 06:46.360\n So one of the reasons we're talking today is that a bunch of people requested\n\n06:46.360 --> 06:51.000\n that I do transcripts for this podcast and do captioning.\n\n06:51.280 --> 06:56.240\n I used to make all kinds of YouTube videos and I would go on up work, I\n\n06:56.240 --> 07:01.440\n think, and I would hire folks to do transcription and it was always a pain\n\n07:01.440 --> 07:06.360\n in the ass, if I'm being honest, and then I don't know how I discovered Rev.\n\n07:07.400 --> 07:13.960\n But when I did, it was this feeling of like, Holy shit, somebody figured\n\n07:13.960 --> 07:15.960\n out how to do it just really easily.\n\n07:16.760 --> 07:25.400\n I I'm, I'm such a fan of just when people take a problem and they just make it easy.\n\n07:25.840 --> 07:26.000\n Right.\n\n07:26.000 --> 07:31.280\n You know, like just, uh, there's so many, uh, there's so many,\n\n07:31.280 --> 07:35.240\n it's like, there's so many things in life that you might not even\n\n07:35.240 --> 07:37.000\n be aware of that are painful.\n\n07:37.720 --> 07:43.320\n Then Rev, you just like give the audio, give the video, you can\n\n07:43.320 --> 07:44.800\n actually give a YouTube link.\n\n07:45.920 --> 07:52.320\n And then it comes back like a day later or, uh, two days later, whatever\n\n07:52.320 --> 07:56.280\n the hell it is with the captions, you know, all in a standardized format.\n\n07:57.200 --> 08:00.280\n It was, I dunno, it was, it was, it was, it was truly a joy.\n\n08:00.280 --> 08:04.720\n So I thought I had, you know, just for the hell of it, uh, talk to you\n\n08:04.920 --> 08:07.960\n that one other product just made my soul feel good.\n\n08:08.200 --> 08:12.280\n One other product that I've used like that is, uh, for people who might\n\n08:12.280 --> 08:15.800\n be familiar is called isotope RX.\n\n08:15.840 --> 08:21.000\n It's for audio editing and like, and that's another one where it was\n\n08:21.000 --> 08:23.720\n like, you just drop it.\n\n08:24.080 --> 08:28.240\n I dropped into the audio and it just cleans everything up really nicely.\n\n08:28.240 --> 08:35.200\n All the stupid, like the mouth sounds and sometimes there's a background\n\n08:35.400 --> 08:39.000\n like sounds due to the malfunction of the equipment.\n\n08:39.000 --> 08:40.040\n It can clean that stuff up.\n\n08:40.400 --> 08:43.040\n It can, it has a general voice denoising.\n\n08:43.040 --> 08:47.400\n It has like automation capabilities where you can do batch processing\n\n08:47.400 --> 08:49.200\n and you can put a bunch of effects.\n\n08:49.600 --> 08:55.440\n I mean, it just, I dunno, everything else sucked for like voice based\n\n08:55.480 --> 08:57.800\n cleanup that I've ever used.\n\n08:57.800 --> 09:01.120\n They've used audition, Adobe audition, and he's all kinds of other things\n\n09:01.120 --> 09:04.480\n with plugins and you have to kind of figure it all out.\n\n09:04.480 --> 09:05.840\n You have to do it manually here.\n\n09:05.840 --> 09:07.160\n It's just, it just worked.\n\n09:07.520 --> 09:09.640\n So that's another one in this whole pipeline.\n\n09:09.640 --> 09:12.640\n It just brought joy to my, to my heart.\n\n09:12.640 --> 09:18.760\n Anyway, all that to say is, uh, uh, Rev put a smile to my face.\n\n09:18.760 --> 09:24.040\n So can you maybe take a step back and say, what is Rev and how does it work?\n\n09:24.560 --> 09:26.040\n And Rev or Rev.com?\n\n09:26.040 --> 09:31.240\n Rev, Rev.com, the same thing, I guess, uh, that way we do have Rev.ai now as\n\n09:31.240 --> 09:33.440\n well, which we can talk about later.\n\n09:33.760 --> 09:37.160\n Like, do you have the actual domain or is it just, uh, the actual domain,\n\n09:37.160 --> 09:40.800\n but we also use it kind of as a, as a sub brand.\n\n09:41.120 --> 09:46.040\n Oh, so we've, so we use Rev.ai to denote our ASR services, right?\n\n09:46.040 --> 09:49.640\n And Rev.com is kind of our more human and to the end user services.\n\n09:49.800 --> 09:53.400\n So it's like wordpress.com and wordpress.org, they actually have separate\n\n09:53.400 --> 09:56.640\n brands that like, I don't know if you're familiar with what those are.\n\n09:56.680 --> 10:00.360\n Yeah, they provide almost like a separate branch of a little bit.\n\n10:00.360 --> 10:04.080\n I think with that, it's like wordpress.org is kind of their open source, right?\n\n10:04.080 --> 10:07.520\n And, uh, wordpress.com is sort of their hosted commercial offering.\n\n10:07.600 --> 10:08.100\n Yes.\n\n10:08.160 --> 10:10.200\n Um, and with us, the differential is a little bit different,\n\n10:10.200 --> 10:11.680\n but maybe a similar idea.\n\n10:11.720 --> 10:12.220\n Yep.\n\n10:12.800 --> 10:12.960\n Okay.\n\n10:12.960 --> 10:13.680\n So what is Rev?\n\n10:13.760 --> 10:16.360\n Before I launch into, uh, what is Rev?\n\n10:16.360 --> 10:18.040\n I was going to say, you know, like you, you were talking about like\n\n10:18.080 --> 10:21.840\n Rev was music to your ears, your, your, your field was music to my ears.\n\n10:21.840 --> 10:27.720\n To us, the founders of Rev, because, um, Rev was kind of founded to improve\n\n10:27.720 --> 10:32.360\n on the model of Upwork that was kind of the original, um, or part of their\n\n10:32.600 --> 10:38.160\n original impetus, like our CEO, Jason, was a early employee of Upwork.\n\n10:38.200 --> 10:40.920\n So he was very familiar with their work, the company Upwork company.\n\n10:41.400 --> 10:46.360\n Um, and so he was very familiar with that model and he wanted to make the whole\n\n10:46.360 --> 10:49.600\n experience better because he knew like, when you go at that time, Upwork was\n\n10:49.600 --> 10:54.040\n primarily programmers, so the main thing they offered us, if you want to hire,\n\n10:54.040 --> 10:56.560\n you know, someone to help you code a little site, right.\n\n10:56.880 --> 11:01.280\n Um, you could go on Upwork, um, you could like browse through a list of freelancers,\n\n11:01.480 --> 11:04.720\n pick a programmer, you know, have a contract with them and have them do some\n\n11:04.720 --> 11:11.360\n work, but it was kind of a difficult experience because, uh, for the, for you,\n\n11:11.400 --> 11:13.600\n you would kind of have to browse through all these people, right.\n\n11:13.600 --> 11:18.040\n And you have to decide, okay, like, well, is this guy good as, um, or somebody\n\n11:18.040 --> 11:21.520\n else better and naturally, you know, you're going to Upwork because you're not\n\n11:21.520 --> 11:22.360\n an expert, right?\n\n11:22.600 --> 11:24.640\n If you're an expert, you probably wouldn't be like getting a programmer\n\n11:24.640 --> 11:27.280\n from Upwork, uh, so, so how can you really tell?\n\n11:27.840 --> 11:31.160\n So there's a kind of like a lot of potential regret, right?\n\n11:31.160 --> 11:34.240\n What if I choose a bad person, they're like, going to be late on the work.\n\n11:34.560 --> 11:35.720\n It's going to be a painful experience.\n\n11:36.240 --> 11:39.920\n And for the freelancer, it was also painful because, you know, half the time\n\n11:39.920 --> 11:43.640\n they spent not on actually doing the work, but kind of figuring out how can I make\n\n11:43.640 --> 11:47.520\n my profile most attractive to the buyer, right?\n\n11:47.560 --> 11:48.680\n And they're not an expert on that either.\n\n11:49.520 --> 11:52.560\n So like Grav's idea was let's remove the barrier, right?\n\n11:52.560 --> 11:56.120\n Like, let's make it simple where we'll pick a few, uh, verticals\n\n11:56.600 --> 11:58.280\n that are fairly standardizable.\n\n11:58.520 --> 12:01.760\n Now we actually started with translation, um, and then we added\n\n12:01.760 --> 12:05.200\n audio transcription a bit later and we'll just make it a website.\n\n12:05.200 --> 12:06.680\n You go give us your files.\n\n12:06.920 --> 12:11.880\n We'll give you back, uh, the results, you know, as soon as possible.\n\n12:11.880 --> 12:13.800\n You know, originally maybe it was 48 hours.\n\n12:13.800 --> 12:15.600\n Then we made it shorter and shorter and shorter.\n\n12:15.680 --> 12:17.880\n Um, yeah, there's a rush processing too.\n\n12:17.880 --> 12:22.920\n There's a rush processing now, uh, and, uh, we'll hide all the details from you.\n\n12:22.920 --> 12:23.160\n Right.\n\n12:23.520 --> 12:23.800\n Yeah.\n\n12:24.240 --> 12:27.000\n And like, that's kind of exactly what you're experiencing, right?\n\n12:27.000 --> 12:29.760\n You don't, you don't need to worry about the details of how the sausage is made.\n\n12:29.840 --> 12:30.480\n That's really cool.\n\n12:30.480 --> 12:35.160\n The, so you picked like a vertical by vertically, you mean basically a\n\n12:35.160 --> 12:36.760\n service, a service category.\n\n12:36.760 --> 12:41.600\n Why translation is Rev thinking of potentially going into other verticals\n\n12:41.600 --> 12:46.280\n in the future, or is this like the focus now is a translation transcription, like\n\n12:46.280 --> 12:52.200\n language, the focus now is, is language or, uh, speech services, generally speech\n\n12:52.200 --> 12:55.520\n to text language services, you can kind of group them however you want.\n\n12:56.000 --> 13:01.960\n Um, so, but we, uh, originally the categorization was work from home.\n\n13:01.960 --> 13:06.280\n So when, uh, work that was done by people on a computer, you know, we weren't trying\n\n13:06.280 --> 13:11.720\n to get into, you know, uh, task rabbit type of things and something that could\n\n13:11.720 --> 13:14.080\n be relatively standard, not a lot of options.\n\n13:14.080 --> 13:16.560\n So we could kind of present the simplified interface, right?\n\n13:16.800 --> 13:20.240\n So programming wasn't like a good fit because each programming\n\n13:20.240 --> 13:21.640\n project is kind of unique, right?\n\n13:21.640 --> 13:25.920\n We're looking for something that, uh, Transcription is, you know, you have five\n\n13:25.920 --> 13:27.640\n hours of idea, it's five hours of audio, right?\n\n13:27.680 --> 13:29.200\n Translation is somewhat similar.\n\n13:29.200 --> 13:33.600\n In that, you know, you can have a five page document, you know, and then you\n\n13:33.600 --> 13:37.480\n just can price it by that and then you pick the language you want and that\n\n13:37.480 --> 13:38.920\n that's mostly all that is to it.\n\n13:39.320 --> 13:40.760\n So those were a few criteria.\n\n13:40.760 --> 13:48.880\n We started with translation because we saw the need, um, and, uh, we picked up\n\n13:48.880 --> 13:52.800\n kind of a specialty of translation, um, where we would translate things like\n\n13:52.800 --> 13:58.440\n board certificates, uh, uh, immigration documents, things like that.\n\n13:58.480 --> 14:03.640\n And so they were fairly, um, even more well defined and easy to\n\n14:03.640 --> 14:04.960\n kind of tell if we did a good job.\n\n14:05.200 --> 14:07.320\n So you can literally charge per type of document.\n\n14:07.680 --> 14:10.920\n Was that, was, was that the, so what, what is it now?\n\n14:10.960 --> 14:12.600\n Is it per word or something like that?\n\n14:12.600 --> 14:16.240\n Like, how do you, like, how do you measure the effort\n\n14:16.280 --> 14:18.000\n involved in a particular thing?\n\n14:18.320 --> 14:21.080\n So now it looks like for audio translation, it's like,\n\n14:21.080 --> 14:23.400\n so now it looks a for audio transcription, right?\n\n14:23.400 --> 14:24.640\n It's a per audio minute.\n\n14:24.960 --> 14:27.960\n Well, that, that yes, for, for, for our translation, we don't really,\n\n14:28.120 --> 14:29.920\n uh, actually focus it on anymore.\n\n14:30.240 --> 14:34.920\n Uh, but you know, back when it was still a main business of Revit was per page,\n\n14:35.000 --> 14:35.240\n right.\n\n14:35.240 --> 14:38.600\n Or per word, depending on the kind of, uh, cause you can also do translation\n\n14:38.600 --> 14:40.040\n now on the audio, right?\n\n14:40.600 --> 14:40.880\n Mm hmm.\n\n14:40.880 --> 14:41.920\n So like subtitles.\n\n14:41.960 --> 14:45.040\n So it would be both, uh, transcription and translation.\n\n14:45.040 --> 14:45.360\n That's right.\n\n14:45.560 --> 14:50.280\n I wanted to test the system to see how good it is to see like how, how, uh,\n\n14:50.280 --> 14:51.720\n well, is Russian supported?\n\n14:52.680 --> 14:53.200\n I think so.\n\n14:53.240 --> 14:53.600\n Yeah.\n\n14:54.040 --> 14:55.560\n And it'd be interesting to try it out.\n\n14:55.720 --> 14:58.080\n I mean, one of the, now it's only in like the one direction, right?\n\n14:58.080 --> 15:00.760\n So you start with English and then you can have subtitles in Russian.\n\n15:00.880 --> 15:02.320\n Not really, not really the other way.\n\n15:02.800 --> 15:03.200\n Got it.\n\n15:03.200 --> 15:05.480\n Because it's, um, I'm deeply curious about this.\n\n15:05.480 --> 15:08.840\n Um, when COVID opens up a little bit, when the economy, when the\n\n15:08.840 --> 15:12.120\n world opens up a little bit, you want to build your brand in Russia?\n\n15:12.720 --> 15:13.640\n No, I don't.\n\n15:13.920 --> 15:15.720\n First of all, I'm allergic to the word brand.\n\n15:15.720 --> 15:21.720\n All right, I'm definitely not building, uh, any brands in Russia, but I'm going to\n\n15:21.720 --> 15:26.880\n Paris to talk to the translators of Dostoevsky and Tolstoy, there's this\n\n15:26.880 --> 15:28.880\n famous couple that does translation.\n\n15:29.600 --> 15:35.120\n And, you know, I'm more and more thinking of how is it possible to have a\n\n15:35.120 --> 15:37.320\n conversation with a Russian speaker?\n\n15:37.640 --> 15:42.640\n Cause I have just some number of famous Russian speakers that\n\n15:42.640 --> 15:47.560\n I'm interested in talking to, and my Russian is not strong\n\n15:47.560 --> 15:49.720\n enough to be witty and funny.\n\n15:49.720 --> 15:51.520\n I'm already an idiot in English.\n\n15:51.920 --> 15:57.360\n I'm an extra level of like awkward idiot in Russian, but I can understand it.\n\n15:57.600 --> 15:57.880\n Right.\n\n15:58.200 --> 16:04.480\n And I also like wonder how can I create a compelling English Russian\n\n16:04.480 --> 16:06.480\n experience for an English speaker?\n\n16:06.480 --> 16:11.640\n Like if I, there's a guy named Grigori Perlman, who's a mathematician who,\n\n16:11.640 --> 16:13.560\n uh, obviously doesn't speak any English.\n\n16:14.480 --> 16:20.680\n So I would probably incorporate like a Russian translator into the picture.\n\n16:21.440 --> 16:25.320\n And then it would be like a, not to use a weird term, but like a three, like a\n\n16:25.320 --> 16:32.640\n three, three person thing where it's like a dance of, like, I understand it one way.\n\n16:32.960 --> 16:37.680\n They don't understand the other way, but I'll be asking questions in English.\n\n16:38.200 --> 16:38.640\n I don't know.\n\n16:38.840 --> 16:39.800\n I don't know the right way.\n\n16:39.800 --> 16:40.400\n It's complicated.\n\n16:40.400 --> 16:43.640\n It's complicated, but I feel like it's worth the effort for certain kinds of\n\n16:43.920 --> 16:48.880\n people, one of whom I'm confident of Vladimir Putin, I'm for sure talking to.\n\n16:48.880 --> 16:50.120\n I really want to make it happen.\n\n16:50.400 --> 16:54.240\n Cause I think I could do a good job with, but the, the right, you know,\n\n16:54.240 --> 16:58.000\n understanding the fundamentals of translation is something I'm really\n\n16:58.000 --> 16:58.640\n interested in.\n\n16:58.920 --> 17:03.920\n So that's why I'm starting with, um, the actual translators of like Russian\n\n17:03.920 --> 17:06.640\n literature, because they understand the nuance and the beauty of the\n\n17:06.640 --> 17:08.880\n language and how it goes back and forth.\n\n17:08.880 --> 17:13.240\n But I also want to see, like in speech, how can we do it in real time?\n\n17:13.240 --> 17:18.120\n So that's, that's like a little bit of a baby project that I hope to push forward.\n\n17:18.240 --> 17:19.920\n But anyway, it's a challenging thing.\n\n17:19.920 --> 17:25.840\n So just to share, uh, my dad, um, actually does translation, um, not, not\n\n17:25.840 --> 17:27.800\n professional, he's a, uh, he writes poetry.\n\n17:28.160 --> 17:33.480\n That was kind of always his, uh, not a hobby, but he's, uh, he, you know, he\n\n17:33.480 --> 17:36.840\n had a job, like a day job, but his passion was always writing poetry.\n\n17:36.840 --> 17:43.080\n Uh, and then when I got to America, like he started also translating, um, first\n\n17:43.080 --> 17:45.120\n he was translating English poetry to Russia.\n\n17:45.120 --> 17:50.400\n Now he also like goes the other, uh, the other way, you kind of gain some small\n\n17:50.400 --> 17:54.840\n fame in that world anyways, because, uh, recently this poet like Lewis\n\n17:54.840 --> 17:59.080\n clock, I don't know if you know of, uh, some American poet, um, she was\n\n17:59.080 --> 18:00.760\n awarded the Nobel prize for literature.\n\n18:01.240 --> 18:05.840\n Uh, and so my dad had translated, uh, one of her books of poetry in\n\n18:05.840 --> 18:07.640\n to Russian, and he was like one of the few.\n\n18:07.640 --> 18:12.080\n So he kind of like, they asked him and gave an interview to Radiosvoboda,\n\n18:12.160 --> 18:13.000\n if you know what that is.\n\n18:13.000 --> 18:17.000\n And he kind of talked about some of the intricacies of translating poetry.\n\n18:17.000 --> 18:18.640\n So that's like an extra level of difficulty, right?\n\n18:18.640 --> 18:21.520\n Because translating poetry is even more challenging than\n\n18:21.600 --> 18:24.000\n translating just, you know, interviews.\n\n18:24.280 --> 18:28.560\n Do you remember any, any experiences and challenges to having to do the\n\n18:28.560 --> 18:32.640\n translation that, that's the God to you, like something he's talked about?\n\n18:32.640 --> 18:35.400\n I mean, a lot of it, I think is word choice, right?\n\n18:35.400 --> 18:38.120\n It's the way Russian is structured is first of all, quite different\n\n18:38.160 --> 18:40.200\n than, um, the way English is structured, right?\n\n18:40.200 --> 18:43.840\n Just there is inflections in Russian and genders, and they don't exist in English.\n\n18:43.880 --> 18:47.760\n That's just one of the reasons actually why, um, machine translation is quite\n\n18:47.760 --> 18:50.840\n difficult for English to Russian and Russian to English, because there's\n\n18:50.840 --> 18:54.560\n such different languages, but then English has like a huge number of words.\n\n18:55.240 --> 18:57.040\n Um, many more than Russian, actually, I think.\n\n18:57.040 --> 19:01.400\n So it's often difficult to find the right word to convey the same emotional\n\n19:01.400 --> 19:03.440\n meaning, yeah, Russian language.\n\n19:03.440 --> 19:04.880\n They play with words much more.\n\n19:06.240 --> 19:12.080\n So you, you're mentioning that, uh, Rev was kind of born out of, um, trying to\n\n19:12.080 --> 19:15.760\n take a vertical on the upwork and then standardize it.\n\n19:15.760 --> 19:20.960\n So we're just trying to make the, the freelancer marketplace idea better, right?\n\n19:21.000 --> 19:26.400\n Um, better for both customers and better for the freelancers themselves.\n\n19:27.080 --> 19:30.840\n Is there something else to the story of Rev finding the right word?\n\n19:30.840 --> 19:35.320\n Rev, finding Rev, like what, what did it take to bring it to actually to life?\n\n19:35.720 --> 19:37.000\n Was there any pain points?\n\n19:37.200 --> 19:39.840\n Um, plenty of, plenty of pain points.\n\n19:39.840 --> 19:43.840\n I mean, uh, as, as often the case it's with scaling it up, right?\n\n19:43.920 --> 19:47.400\n Um, and in this case, you know, the scaling is kind of scaling the,\n\n19:48.080 --> 19:49.280\n the marketplace, so to speak, right?\n\n19:49.280 --> 19:51.600\n Rev is essentially a two sided marketplace, right?\n\n19:51.600 --> 19:54.920\n Because, you know, there's the customers and then there's the reverse.\n\n19:55.360 --> 19:59.000\n Um, if there's not enough Revers, Revers are world color freelancers.\n\n19:59.000 --> 20:03.400\n So if there's not enough Revers, then customers have a bad experience, right?\n\n20:03.400 --> 20:05.680\n You know, it takes longer to get your work done.\n\n20:06.120 --> 20:09.800\n Um, things like that, you know, if there's too many done, the Revers have\n\n20:09.800 --> 20:12.880\n a bad experience because they might log on to see like what work is available\n\n20:12.880 --> 20:14.640\n and there's not very much work, right?\n\n20:15.040 --> 20:20.000\n Uh, so kind of keeping that balance, um, is, is, is a quite challenging problem.\n\n20:20.000 --> 20:22.920\n And, you know, that's, that's like a problem we've been working on for many\n\n20:22.920 --> 20:25.360\n years and we're still like refining our methods, right?\n\n20:25.360 --> 20:30.240\n If you can kind of talk to this gig economy idea, I did a bunch of different\n\n20:30.240 --> 20:33.680\n psychology experiments on mechanical Turk, for example, I've asked to do\n\n20:33.680 --> 20:37.960\n different kinds of very tricky computer vision annotation on mechanical Turk.\n\n20:37.960 --> 20:42.760\n And it's connecting, connecting people in a more systematized way.\n\n20:43.560 --> 20:50.680\n I would say, you know, between task and, and, uh, what would you call that worker\n\n20:50.760 --> 20:52.200\n is what mechanical Turk calls it.\n\n20:52.200 --> 20:58.240\n What do you think about this world of gig economies, of there being a service\n\n20:58.400 --> 21:06.280\n that connects customers to workers in a way that's like massively distributed,\n\n21:06.320 --> 21:10.080\n like potentially scaling to, it could be, it could be scaled to like\n\n21:10.080 --> 21:11.800\n tens of thousands of people, right?\n\n21:11.800 --> 21:16.200\n Is there something interesting about that world that you can speak to?\n\n21:16.520 --> 21:16.840\n Yeah.\n\n21:16.880 --> 21:20.640\n Well, we don't think of it as kind of gig economy, like to some degree,\n\n21:20.640 --> 21:22.440\n I don't like the word gig that much, right?\n\n21:22.440 --> 21:25.960\n Because to some degree it diminishes the words being done, right?\n\n21:25.960 --> 21:28.080\n It sounds kind of like almost amateurish.\n\n21:28.080 --> 21:33.760\n Well, maybe in like music industry, like gig is a standard term, but in work, it\n\n21:33.760 --> 21:41.400\n kind of sounds like, oh, it's, it's, it's frivolous, um, to us it's, um, improving\n\n21:41.400 --> 21:46.160\n the nature of working from home on your own time and on your own terms, right?\n\n21:46.160 --> 21:51.360\n And kind of taking away geographical limitations and time limitations, right?\n\n21:51.360 --> 21:56.960\n Uh, so, you know, many of our freelancers are maybe work from home moms, right?\n\n21:56.960 --> 22:01.160\n And, you know, they don't want the traditional nine to five job, but they\n\n22:01.160 --> 22:05.080\n want to make some income and rough kind of like allows them to do that and decide\n\n22:05.080 --> 22:10.920\n like exactly how much to work and when to work or by the same token, maybe someone\n\n22:10.920 --> 22:17.000\n is, you know, someone wants to live the mountain top, you know, life, right?\n\n22:17.040 --> 22:19.680\n You know, cabin in the woods, but they still want to make some money.\n\n22:20.160 --> 22:24.680\n Um, and like generally that wouldn't be compatible before, before this new world,\n\n22:25.160 --> 22:28.760\n you kind of had to choose, uh, but like with Rev, like, if you like, you don't\n\n22:28.760 --> 22:36.120\n have to choose, can you speak to like, what's the demographics like distribution?\n\n22:36.360 --> 22:38.080\n Like where do rivers live?\n\n22:38.880 --> 22:40.760\n Is there a way to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to, to,\n\n22:40.760 --> 22:46.720\n to, to, to, but you really want to teach it how to, how to run, how to track\n\n22:46.720 --> 22:50.160\n Once you're out of the bush, 들어가, things like that, you know,\n\n22:50.160 --> 23:02.220\n but like in the back of you know, like hard, but you\n\n23:02.220 --> 23:05.400\n just as you approach, there's a lot more control over you.\n\n23:05.560 --> 23:08.160\n Like you, you may be Oh, like you know, one day you might go to the\n\n23:08.160 --> 23:10.400\n For some years now, we've been doing these little meetings\n\n23:10.400 --> 23:12.280\n where the management team will go to some place\n\n23:12.280 --> 23:13.640\n and we'll try to meet Revers.\n\n23:13.640 --> 23:15.980\n And pretty much wherever we go, it's\n\n23:15.980 --> 23:19.520\n pretty easy to find a large number of Revers.\n\n23:19.520 --> 23:21.160\n The most recent one we did is in Utah.\n\n23:24.000 --> 23:25.240\n But anyway, really.\n\n23:25.240 --> 23:26.680\n Are they from all walks of life?\n\n23:26.680 --> 23:28.800\n Are these young folks, older folks?\n\n23:28.800 --> 23:30.220\n Yeah, all walks of life, really.\n\n23:30.220 --> 23:33.760\n Like I said, one category is the work from home.\n\n23:33.760 --> 23:37.040\n Students who want to make some extra income.\n\n23:37.040 --> 23:41.880\n There are some people who maybe have some social anxiety,\n\n23:41.880 --> 23:43.420\n so they don't want to be in the office.\n\n23:43.420 --> 23:45.380\n And this is one way for them to make a living.\n\n23:45.380 --> 23:47.360\n So it's really pretty wide variety.\n\n23:47.360 --> 23:49.040\n But on the flip side, for example,\n\n23:49.040 --> 23:52.840\n one Rever we were talking to was a person\n\n23:52.840 --> 23:54.600\n who had a fairly high powered career before\n\n23:54.600 --> 23:57.280\n and was kind of like taking a break.\n\n23:57.280 --> 24:00.320\n And she was almost doing this just to explore and learn\n\n24:00.320 --> 24:03.400\n about the gig economy, quote unquote.\n\n24:03.400 --> 24:06.280\n So it really is a pretty wide variety of folks.\n\n24:06.280 --> 24:09.400\n Yeah, it's kind of interesting through the captioning\n\n24:09.400 --> 24:13.080\n process for me to learn about the Revers\n\n24:13.080 --> 24:18.080\n because like some are clearly like weirdly knowledgeable\n\n24:19.840 --> 24:22.960\n about technical concepts.\n\n24:22.960 --> 24:25.280\n Like you can tell by how good they are\n\n24:25.280 --> 24:29.040\n at like capitalizing stuff, like technical terms,\n\n24:29.040 --> 24:30.840\n like a machine learning or deep learning.\n\n24:30.840 --> 24:35.440\n Like I've used Rev to annotate, to caption\n\n24:35.440 --> 24:38.000\n the deep learning lectures or machine learning lectures\n\n24:38.000 --> 24:39.880\n I did at MIT.\n\n24:39.880 --> 24:44.520\n And it's funny, like a large number of them were like,\n\n24:44.520 --> 24:45.880\n I don't know if they looked it up\n\n24:45.880 --> 24:47.280\n or were already knowledgeable,\n\n24:47.280 --> 24:50.400\n but they do a really good job at like, I don't know.\n\n24:50.400 --> 24:52.400\n They invest time into these things.\n\n24:52.400 --> 24:55.040\n They will like do research, they will Google things,\n\n24:55.040 --> 24:57.380\n you know, to kind of make sure that they got it right.\n\n24:57.380 --> 24:59.120\n But to some of them, it's like,\n\n24:59.120 --> 25:01.640\n it's actually part of the enjoyment of the work.\n\n25:01.640 --> 25:03.360\n Like they'll tell us, you know,\n\n25:03.360 --> 25:05.760\n I love doing this because I get paid\n\n25:05.760 --> 25:07.400\n to watch a documentary on something, right?\n\n25:07.400 --> 25:10.040\n And I learn something while I'm transcribing, right?\n\n25:10.040 --> 25:10.880\n Pretty cool.\n\n25:10.880 --> 25:14.680\n Yeah, so what's that captioning transcription process\n\n25:14.680 --> 25:16.160\n look like for the Revers?\n\n25:16.160 --> 25:18.960\n Can you maybe speak to that to give people a sense,\n\n25:18.960 --> 25:22.000\n like how much is automated, how much is manual?\n\n25:23.040 --> 25:25.120\n What's the actual interface look like?\n\n25:25.120 --> 25:26.320\n All that kind of stuff.\n\n25:26.320 --> 25:28.920\n Yeah, so, you know, we've invested a pretty good amount\n\n25:28.920 --> 25:33.200\n of time to give like our Revers the best tools possible.\n\n25:33.200 --> 25:34.760\n So typical day of forever,\n\n25:34.760 --> 25:37.120\n they might log into their workspace,\n\n25:37.120 --> 25:41.440\n they'll see a list of audios that need to be transcribed.\n\n25:41.440 --> 25:43.400\n And we try to give them tools to pick specifically\n\n25:43.400 --> 25:44.500\n the ones they want to do, you know?\n\n25:44.500 --> 25:47.800\n So maybe some people like to do longer audios\n\n25:47.800 --> 25:52.340\n or shorter audios, people have their preferences.\n\n25:52.340 --> 25:55.080\n Some people like to do audios in a particular subject\n\n25:55.080 --> 25:56.020\n or from a particular country.\n\n25:56.020 --> 25:59.720\n So we try to give people the tools to control,\n\n25:59.720 --> 26:01.100\n things like that.\n\n26:01.100 --> 26:04.600\n And then when they pick what they want to do,\n\n26:04.600 --> 26:07.520\n we'll launch a specialized editor that we've built\n\n26:07.520 --> 26:10.240\n to make transcription as efficient as possible.\n\n26:10.240 --> 26:12.360\n They'll start with a speech drag draft.\n\n26:12.360 --> 26:15.160\n So, you know, we have our machine learning model\n\n26:15.160 --> 26:18.560\n for automated speech recognition, they'll start with that.\n\n26:18.560 --> 26:22.780\n And then our tools are optimized to help them correct that.\n\n26:22.780 --> 26:24.880\n So it's basically a process of correction.\n\n26:26.000 --> 26:29.520\n Yeah, it depends on, you know, I would say the audio.\n\n26:29.520 --> 26:31.360\n If the audio itself is pretty good,\n\n26:31.360 --> 26:33.160\n like probably like our podcast right now\n\n26:33.160 --> 26:34.120\n would be quite good.\n\n26:34.120 --> 26:36.800\n So the ASR would do a fairly good job.\n\n26:37.840 --> 26:41.160\n But if you imagine someone recorded a lecture,\n\n26:41.160 --> 26:45.720\n you know, in the back of a auditorium, right?\n\n26:45.720 --> 26:47.340\n Where like the speaker is really far away\n\n26:47.340 --> 26:49.960\n and there's maybe a lot of cross talk and things like that,\n\n26:49.960 --> 26:52.320\n then maybe the ASR wouldn't do a good job.\n\n26:52.320 --> 26:53.720\n So the person might say like, you know what,\n\n26:53.720 --> 26:55.080\n I'm just gonna do it from scratch.\n\n26:55.080 --> 26:56.280\n Do it from scratch, yeah.\n\n26:56.280 --> 26:57.640\n So it kind of really depends.\n\n26:57.640 --> 27:00.560\n What would you say is the speed that you can possibly get?\n\n27:00.560 --> 27:02.080\n Like, what's the fastest?\n\n27:02.080 --> 27:05.200\n Can you get, is it possible to get real time or no?\n\n27:05.200 --> 27:09.120\n As you're like listening, can you write as fast as?\n\n27:09.120 --> 27:10.440\n Real time would be pretty difficult.\n\n27:10.440 --> 27:13.400\n It's actually a pretty, it's not an easy job, you know.\n\n27:13.400 --> 27:16.240\n We actually encourage everyone at the company\n\n27:16.240 --> 27:17.680\n to try to be a transcriber for a day,\n\n27:17.680 --> 27:19.040\n transcriptionist for a day.\n\n27:20.400 --> 27:24.120\n And it's way harder than you might think it is, right?\n\n27:24.120 --> 27:28.280\n Because people talk fast and people have accents\n\n27:28.280 --> 27:29.160\n and all this kind of stuff.\n\n27:29.160 --> 27:30.920\n So real time is pretty difficult.\n\n27:30.920 --> 27:32.600\n Is it possible?\n\n27:32.600 --> 27:34.800\n Like there's somebody, we're probably gonna use Rev\n\n27:34.800 --> 27:39.320\n to caption this, they're listening to this right now.\n\n27:39.320 --> 27:42.440\n What do you think is the fastest\n\n27:42.440 --> 27:44.880\n you could possibly get on this right now?\n\n27:44.880 --> 27:47.480\n I think on a good audio, maybe two to three X,\n\n27:47.480 --> 27:49.880\n I would say, real time.\n\n27:49.880 --> 27:51.680\n Meaning it takes two to three times longer\n\n27:51.680 --> 27:55.560\n than the actual audio of the podcast.\n\n27:55.560 --> 27:58.600\n This is so meta, I could just imagine the Revvers\n\n27:58.600 --> 27:59.440\n working on this right now.\n\n27:59.440 --> 28:01.040\n You're like, you're way wrong.\n\n28:01.040 --> 28:03.520\n You're way wrong, this takes way longer.\n\n28:03.520 --> 28:04.360\n But yeah, it definitely works.\n\n28:04.360 --> 28:06.440\n Or you doubted me, I could do real time.\n\n28:06.440 --> 28:08.600\n Yeah.\n\n28:08.600 --> 28:11.200\n Okay, so you mentioned ASR.\n\n28:11.200 --> 28:15.480\n Can you speak to what is ASR, automatic speech recognition?\n\n28:15.480 --> 28:19.320\n How much, like what is the gap\n\n28:19.320 --> 28:22.000\n between perfect human performance\n\n28:22.000 --> 28:26.680\n and perfect or pretty damn good ASR?\n\n28:26.680 --> 28:28.800\n Yeah, so ASR, automatic speech recognition,\n\n28:28.800 --> 28:31.800\n it's a class of machine learning problem, right?\n\n28:31.800 --> 28:34.200\n So take speech like we're talking\n\n28:34.200 --> 28:37.040\n and transform it into a sequence of words, essentially.\n\n28:37.040 --> 28:38.800\n Audio of people talking.\n\n28:38.800 --> 28:40.520\n Audio, audio to words.\n\n28:41.680 --> 28:43.600\n And there's a variety of different approaches\n\n28:43.600 --> 28:46.920\n and techniques, which we could talk about later if you want.\n\n28:46.920 --> 28:50.400\n So, we think we have pretty much the world's best ASR\n\n28:50.400 --> 28:52.600\n for this kind of speech, right?\n\n28:52.600 --> 28:55.600\n So there's different kinds of domains, right, for ASR.\n\n28:55.600 --> 28:58.800\n Like one domain might be voice assistance, right?\n\n28:58.800 --> 29:02.720\n So Siri, very different than what we're doing, right?\n\n29:02.720 --> 29:05.680\n Because Siri, there's fairly limited vocabulary.\n\n29:05.680 --> 29:08.480\n You might ask Siri to play a song\n\n29:08.480 --> 29:10.560\n or order a pizza or whatever.\n\n29:10.560 --> 29:12.360\n And it's very good at doing that.\n\n29:12.360 --> 29:14.680\n Very different from when we start talking\n\n29:14.680 --> 29:17.040\n in a very unstructured way.\n\n29:17.040 --> 29:18.760\n And Siri will also generally adapt to your voice\n\n29:18.760 --> 29:20.080\n and stuff like this.\n\n29:20.080 --> 29:22.920\n So for this kind of audio, we think we have the best.\n\n29:22.920 --> 29:27.920\n And our accuracy, right now I think it's maybe 14%\n\n29:29.360 --> 29:32.920\n word error rate on our test suite\n\n29:32.920 --> 29:33.840\n that we generally use to measure.\n\n29:33.840 --> 29:37.040\n So word error rate is like one way to measure accuracy\n\n29:37.040 --> 29:37.880\n for ASR, right?\n\n29:37.880 --> 29:39.720\n So what's 14% word error rate?\n\n29:39.720 --> 29:43.360\n So 14% means across this test suite,\n\n29:43.360 --> 29:45.960\n of a variety of different audios,\n\n29:45.960 --> 29:50.960\n it would be, it would get in some way 14% of the words wrong.\n\n29:53.600 --> 29:55.400\n 14% of the words wrong.\n\n29:55.400 --> 29:59.680\n So the way you kind of calculate it is,\n\n29:59.680 --> 30:02.960\n you might add up insertions, deletions, and substitutions,\n\n30:02.960 --> 30:03.800\n right?\n\n30:03.800 --> 30:05.960\n So insertions is like extra words.\n\n30:05.960 --> 30:07.680\n Deletions are words that we said,\n\n30:07.680 --> 30:10.840\n but weren't in the transcript, right?\n\n30:10.840 --> 30:14.200\n Substitutions is, you said Apple, but I said,\n\n30:14.200 --> 30:16.960\n but the ASR thought it was able, something like this.\n\n30:17.920 --> 30:21.640\n Human accuracy, most people think realistically,\n\n30:21.640 --> 30:25.680\n it's like 3%, 2%, word error rate would be like\n\n30:25.680 --> 30:26.840\n the max achievable.\n\n30:28.160 --> 30:29.960\n So there's still quite a gap, right?\n\n30:29.960 --> 30:33.000\n Would you say that, so YouTube, when I upload videos,\n\n30:33.000 --> 30:35.440\n often generates automatic captions.\n\n30:35.440 --> 30:38.120\n Are you sort of from a company perspective,\n\n30:38.120 --> 30:41.560\n from a company perspective, from a tech perspective,\n\n30:41.560 --> 30:44.720\n are you trying to beat YouTube, Google?\n\n30:44.720 --> 30:47.400\n It's a hell of a, Google, I mean,\n\n30:47.400 --> 30:49.720\n I don't know how seriously they take this task,\n\n30:49.720 --> 30:51.840\n but I imagine it's quite serious.\n\n30:51.840 --> 30:56.280\n And they, you know, Google is probably up there\n\n30:56.280 --> 31:01.280\n in terms of their teams on, on ASR or just NLP,\n\n31:02.080 --> 31:04.440\n natural language processing, different technologies.\n\n31:04.440 --> 31:06.680\n So do you think you can beat Google?\n\n31:06.680 --> 31:08.960\n On this kind of stuff, yeah, we think so.\n\n31:08.960 --> 31:11.560\n Google just woke up on my phone.\n\n31:11.560 --> 31:12.960\n This is hilarious, okay.\n\n31:12.960 --> 31:16.360\n Now Google is listening, sending it back to headquarters.\n\n31:17.440 --> 31:19.520\n Who are these rough people?\n\n31:19.520 --> 31:20.560\n But that's the goal?\n\n31:20.560 --> 31:23.120\n Yeah, I mean, we measure ourselves against like Google,\n\n31:23.120 --> 31:25.560\n Amazon, Microsoft, you know, some of the,\n\n31:25.560 --> 31:26.880\n some smaller competitors.\n\n31:28.280 --> 31:30.320\n And we use like our internal tests with it,\n\n31:30.320 --> 31:32.760\n we try to compose it of a pretty representative\n\n31:32.760 --> 31:36.360\n set of ideas, maybe it's some podcasts, some videos,\n\n31:36.360 --> 31:39.720\n some interviews, some lectures, things like that, right?\n\n31:39.720 --> 31:42.800\n And we beat them in our own testing.\n\n31:42.800 --> 31:45.920\n And actually Rev offers automated,\n\n31:45.920 --> 31:49.280\n like you can actually just do the automated captioning.\n\n31:49.280 --> 31:52.680\n So like, I guess it's like way cheaper, whatever it is,\n\n31:52.680 --> 31:54.160\n whatever the rates are.\n\n31:54.160 --> 31:55.000\n Yeah, yeah.\n\n31:55.000 --> 31:57.880\n So it's a, by the way, it used to be a dollar per minute\n\n31:57.880 --> 32:00.080\n for captioning and transcription,\n\n32:00.080 --> 32:02.320\n I think it's like $1.15 or something like that.\n\n32:02.320 --> 32:03.160\n $1.25.\n\n32:03.160 --> 32:08.160\n $1.25, yeah.\n\n32:08.320 --> 32:09.240\n It's pretty cool.\n\n32:09.240 --> 32:10.920\n That was the other thing that was surprising to me,\n\n32:10.920 --> 32:15.840\n it was actually like the cheapest thing you could,\n\n32:15.840 --> 32:18.440\n one of the, I mean, I don't remember it being cheaper.\n\n32:18.440 --> 32:20.960\n You could on Upwork get cheaper,\n\n32:20.960 --> 32:22.520\n but it was clear to me that this,\n\n32:22.520 --> 32:23.960\n that's gonna be really shitty.\n\n32:23.960 --> 32:24.800\n Yeah.\n\n32:24.800 --> 32:26.920\n So like, you're also competing on price.\n\n32:26.920 --> 32:29.960\n I think there were services that you can get,\n\n32:29.960 --> 32:34.200\n like similar to Rev kind of feel to it,\n\n32:34.200 --> 32:35.880\n but it wasn't as automated.\n\n32:35.880 --> 32:37.920\n Like the drag and drop, the entirety of the interface,\n\n32:37.920 --> 32:39.600\n it's like the thing we're talking about.\n\n32:39.600 --> 32:41.760\n I'm such a huge fan of like frictionless,\n\n32:41.760 --> 32:46.760\n like Amazon's single buy button, whatever.\n\n32:47.720 --> 32:48.560\n Yeah, yeah.\n\n32:48.560 --> 32:49.400\n That one click.\n\n32:49.400 --> 32:52.360\n The one click, that's genius right there.\n\n32:52.360 --> 32:54.960\n Like that is so important for services.\n\n32:54.960 --> 32:55.800\n Yeah.\n\n32:55.800 --> 33:00.480\n And simplicity and I mean, Rev is almost there.\n\n33:00.480 --> 33:04.400\n I mean, there's like some, I'm trying to think.\n\n33:04.400 --> 33:09.400\n So I think I've, I stopped using this pipeline,\n\n33:10.520 --> 33:12.480\n but Rev offers it and I like it,\n\n33:12.480 --> 33:16.240\n but it was causing me some issues on my side,\n\n33:16.240 --> 33:20.320\n which is you can connect it to like Dropbox\n\n33:20.320 --> 33:22.760\n and it generates the files in Dropbox.\n\n33:22.760 --> 33:25.840\n So like it closes the loop to where\n\n33:25.840 --> 33:29.120\n I don't have to go to Rev at all and I can download it.\n\n33:30.280 --> 33:32.720\n Sorry, I don't have to go to Rev at all\n\n33:32.720 --> 33:34.200\n and to download the files.\n\n33:34.200 --> 33:36.280\n It could just like automatically copy them.\n\n33:36.280 --> 33:39.720\n Right, you're putting your Dropbox in a day later\n\n33:39.720 --> 33:41.080\n or maybe a few hours later.\n\n33:41.080 --> 33:42.480\n Yeah, it just shows up.\n\n33:42.480 --> 33:43.600\n Just shows up, yeah.\n\n33:43.600 --> 33:46.520\n Yeah, I was trying to do it programmatically too.\n\n33:46.520 --> 33:48.920\n Is there an API interface you can,\n\n33:48.920 --> 33:51.520\n I was trying to through like through Python\n\n33:51.520 --> 33:53.440\n to download stuff automatically,\n\n33:53.440 --> 33:56.160\n but then I realized this is the programmer in me.\n\n33:56.160 --> 33:58.720\n Like, dude, you don't need to automate everything\n\n33:58.720 --> 34:01.160\n like in life, like flawlessly,\n\n34:01.160 --> 34:02.760\n because I wasn't doing enough captions\n\n34:02.760 --> 34:05.640\n to justify to myself the time investment\n\n34:05.640 --> 34:07.800\n into automating everything perfectly.\n\n34:07.800 --> 34:10.040\n Yeah, I would say if you're doing so many interviews\n\n34:10.040 --> 34:14.240\n that your biggest roadblock is clicking on the Rev download,\n\n34:14.240 --> 34:18.960\n but now you're talking about Elon Musk levels of business.\n\n34:18.960 --> 34:22.040\n But for sure, we have like a variety of ways\n\n34:22.040 --> 34:22.880\n to make it easy.\n\n34:22.880 --> 34:24.200\n You know, there's the integration.\n\n34:24.200 --> 34:26.240\n You mentioned, I think it's through a company called Zapier,\n\n34:26.240 --> 34:31.120\n which kind of can connect Dropbox to Rev and vice versa.\n\n34:31.120 --> 34:33.480\n We have an API if you want to really like customize it,\n\n34:33.480 --> 34:37.160\n you know, if you want to create the Lex Friedman,\n\n34:37.160 --> 34:40.920\n you know, CMS or whatever.\n\n34:40.920 --> 34:41.760\n For this whole thing.\n\n34:41.760 --> 34:42.600\n Okay, cool.\n\n34:42.600 --> 34:46.480\n So can you speak to the ASR a little bit more?\n\n34:46.480 --> 34:51.120\n Like, what does it take?\n\n34:51.120 --> 34:53.400\n Like approach wise, machine learning wise,\n\n34:53.400 --> 34:55.000\n how hard is this problem?\n\n34:55.000 --> 34:57.720\n How do you get to the 3% error rate?\n\n34:57.720 --> 34:59.400\n Like, what's your vision of all of this?\n\n34:59.400 --> 35:03.200\n Yeah, well, the 3% error rate is definitely,\n\n35:03.200 --> 35:05.260\n that's the grand vision.\n\n35:06.160 --> 35:08.000\n We'll see what it takes to get there.\n\n35:09.840 --> 35:13.040\n But we believe, you know, in ASR,\n\n35:13.040 --> 35:15.200\n the biggest thing is the data, right?\n\n35:15.200 --> 35:16.520\n Like, that's true of like a lot of\n\n35:16.520 --> 35:18.320\n machine learning problems today, right?\n\n35:18.320 --> 35:21.000\n The more data you have and high quality of the data,\n\n35:21.000 --> 35:22.800\n the better label the data.\n\n35:24.840 --> 35:26.480\n Yeah, that's how you get good results.\n\n35:26.480 --> 35:28.760\n And we at Rev have kind of like the best data.\n\n35:28.760 --> 35:29.760\n Like we have.\n\n35:29.760 --> 35:30.960\n Like you're literally,\n\n35:30.960 --> 35:34.000\n your business model is annotating the data.\n\n35:34.000 --> 35:36.720\n Our business model is being paid to annotate the data.\n\n35:36.720 --> 35:39.080\n Being paid to annotate the data.\n\n35:39.080 --> 35:42.000\n So it's kind of like a pretty magical flywheel.\n\n35:42.000 --> 35:42.840\n Yeah.\n\n35:42.840 --> 35:44.480\n And so we've kind of like written this flywheel\n\n35:44.480 --> 35:47.000\n to this point.\n\n35:47.000 --> 35:50.480\n And we think we're still kind of in the early stages\n\n35:50.480 --> 35:53.080\n of figuring out all the parts of the flywheel to use,\n\n35:53.080 --> 35:56.360\n you know, because we have the final transcripts\n\n35:57.560 --> 36:01.640\n and we have the audios and we train on that.\n\n36:01.640 --> 36:05.000\n But we in principle also have all the edits\n\n36:05.000 --> 36:06.440\n that the Revvers make, right?\n\n36:07.760 --> 36:08.600\n Oh, that's interesting.\n\n36:08.600 --> 36:10.520\n How can you use that as data?\n\n36:10.520 --> 36:13.280\n Yeah, that's something for us to figure out in the future.\n\n36:13.280 --> 36:15.080\n But, you know, we feel like we're only\n\n36:15.080 --> 36:16.200\n in the early stages, right?\n\n36:16.200 --> 36:17.880\n So the data is there.\n\n36:17.880 --> 36:18.720\n That'd be interesting.\n\n36:18.720 --> 36:20.720\n Like almost like a recurrent neural net\n\n36:20.720 --> 36:23.960\n for fixing transcripts.\n\n36:23.960 --> 36:28.680\n I always remember we did a segmentation annotation\n\n36:28.680 --> 36:30.200\n for driving data.\n\n36:30.200 --> 36:33.160\n So segmenting the scene, like visual data.\n\n36:33.160 --> 36:35.000\n And you can get all,\n\n36:35.000 --> 36:37.400\n so it was drawing, people were drawing polygons\n\n36:37.400 --> 36:39.960\n around different objects and so on.\n\n36:39.960 --> 36:41.720\n And it feels like it always felt like\n\n36:41.720 --> 36:45.160\n there was a lot of information in the clicking,\n\n36:45.160 --> 36:46.960\n the sequence of clicking that people do,\n\n36:46.960 --> 36:49.400\n the kind of fixing of the polygons that they do.\n\n36:50.280 --> 36:52.840\n Now there's a few papers written about\n\n36:52.840 --> 36:56.840\n how to draw polygons like with a recurrent neural nets\n\n36:57.720 --> 37:00.960\n to try to learn from the human clicking.\n\n37:00.960 --> 37:04.320\n But it was just like experimental,\n\n37:04.320 --> 37:06.600\n you know, it was one of those like CVPR type papers\n\n37:06.600 --> 37:08.920\n that people do like a really tiny data set.\n\n37:08.920 --> 37:13.040\n It didn't feel like people really tried to do it seriously.\n\n37:13.040 --> 37:16.440\n Yeah, I wonder if there's information in the fixing\n\n37:16.440 --> 37:21.440\n that provides deeper set of signal\n\n37:21.520 --> 37:24.400\n than just like the raw data.\n\n37:24.400 --> 37:26.120\n The intuition is for sure there must be, right?\n\n37:26.120 --> 37:26.960\n There must be.\n\n37:26.960 --> 37:29.640\n And in all kinds of signals and how long you took\n\n37:29.640 --> 37:32.640\n to make that edit and stuff like that.\n\n37:32.640 --> 37:34.080\n It's gonna be like up to us.\n\n37:34.080 --> 37:36.760\n That's why like the next couple of years\n\n37:36.760 --> 37:38.280\n is like super exciting for us, right?\n\n37:38.280 --> 37:40.320\n So that's what like the focus is now.\n\n37:40.320 --> 37:43.280\n You mentioned rev.ai, that's where you want to.\n\n37:43.280 --> 37:48.280\n Yeah, so rev.ai is kind of our way of bringing this ASR\n\n37:49.120 --> 37:51.520\n to the rest of the world, right?\n\n37:51.520 --> 37:55.560\n So when we started, we were human only.\n\n37:55.560 --> 37:59.160\n Then we kind of created this Temi service.\n\n37:59.160 --> 38:00.600\n I think you might've used it,\n\n38:00.600 --> 38:02.520\n which was kind of ASR for the consumer, right?\n\n38:02.520 --> 38:06.520\n So if you don't wanna pay $1.25, but you wanna pay,\n\n38:06.520 --> 38:08.040\n now it's 25 cents a minute, I think.\n\n38:08.040 --> 38:10.680\n And you get the transcript,\n\n38:10.680 --> 38:13.800\n the machine generated transcript and you get an editor\n\n38:13.800 --> 38:17.440\n and you can kind of fix it up yourself, right?\n\n38:17.440 --> 38:18.800\n Then we started using ASR\n\n38:18.800 --> 38:21.960\n for our own human transcriptionists.\n\n38:21.960 --> 38:23.400\n And then the kind of rev.ai is the final step\n\n38:23.400 --> 38:25.120\n of the journey, which is, you know,\n\n38:25.120 --> 38:27.040\n we have this amazing engine.\n\n38:27.040 --> 38:28.840\n What can people build with it, right?\n\n38:28.840 --> 38:32.320\n What kind of new applications could be enabled\n\n38:33.600 --> 38:36.320\n if you have SpeedTrack that's that accurate?\n\n38:36.320 --> 38:37.560\n Do you have ideas for this\n\n38:37.560 --> 38:39.240\n or is it just providing it as a service\n\n38:39.240 --> 38:40.640\n and seeing what people come up with?\n\n38:40.640 --> 38:41.920\n It's providing it as a service\n\n38:41.920 --> 38:43.480\n and seeing what people come up with\n\n38:43.480 --> 38:45.560\n and kind of learning from what people do with it.\n\n38:45.560 --> 38:47.160\n And we have ideas of our own as well, of course,\n\n38:47.160 --> 38:49.160\n but it's a little bit like, you know,\n\n38:49.160 --> 38:52.520\n when AWS provided the building blocks, right?\n\n38:52.520 --> 38:53.880\n And they saw what people built with it\n\n38:53.880 --> 38:56.960\n and they try to make it easier to build those things, right?\n\n38:56.960 --> 38:59.120\n And we kind of hope to do the same thing.\n\n38:59.120 --> 39:02.760\n Although AWS kind of does a shitty job of like,\n\n39:02.760 --> 39:05.000\n I'm continually surprised, like Mechanical Turk,\n\n39:05.000 --> 39:07.720\n for example, how shitty the interface is.\n\n39:07.720 --> 39:11.080\n We're talking about like Rev making me feel good.\n\n39:11.080 --> 39:14.080\n Like when I first discovered Mechanical Turk,\n\n39:15.200 --> 39:18.200\n the initial idea of it was like,\n\n39:18.200 --> 39:19.600\n it made me feel like Rev does,\n\n39:19.600 --> 39:22.760\n but then the interface is like, come on.\n\n39:22.760 --> 39:24.720\n Yeah, it's horrible.\n\n39:24.720 --> 39:27.720\n Why is it so painful?\n\n39:27.720 --> 39:32.480\n Does nobody at Amazon want to like seriously invest in it?\n\n39:32.480 --> 39:35.000\n It felt like you can make so much money\n\n39:35.000 --> 39:37.160\n if you took this effort seriously.\n\n39:37.160 --> 39:39.240\n And it feels like they have a committee\n\n39:39.240 --> 39:41.200\n of like two people just sitting back,\n\n39:41.200 --> 39:44.000\n like a meeting, they meet once a month,\n\n39:44.000 --> 39:46.520\n like what are we going to do with Mechanical Turk?\n\n39:46.520 --> 39:49.240\n It's like two websites making me feel like this,\n\n39:49.240 --> 39:53.600\n that and craiglist.org, whatever the hell it is.\n\n39:53.600 --> 39:55.960\n It feels like it's designed in the 90s.\n\n39:55.960 --> 39:59.120\n Well, Craigslist basically hasn't been updated\n\n39:59.120 --> 39:59.960\n pretty much since the guy originally built.\n\n39:59.960 --> 40:01.840\n Do you seriously think there's a team,\n\n40:01.840 --> 40:04.240\n like how big is the team working on Mechanical Turk?\n\n40:04.240 --> 40:05.080\n I don't know.\n\n40:05.080 --> 40:06.840\n There's some team, right?\n\n40:06.840 --> 40:08.360\n I feel like there isn't.\n\n40:08.360 --> 40:09.480\n I'm skeptical.\n\n40:09.480 --> 40:10.600\n Yeah.\n\n40:10.600 --> 40:14.680\n Well, if nothing else, they benefit from the other teams\n\n40:14.680 --> 40:18.400\n like moving things forward in a small way.\n\n40:18.400 --> 40:19.760\n But I know what you mean.\n\n40:19.760 --> 40:22.280\n We use Mechanical Turk for a couple of things as well.\n\n40:22.280 --> 40:23.840\n And yeah, it's painful UI.\n\n40:23.840 --> 40:25.720\n It's painful, but yeah, it works.\n\n40:25.720 --> 40:27.560\n I think most people, the thing is most people\n\n40:27.560 --> 40:29.160\n don't really use the UI, right?\n\n40:29.160 --> 40:33.600\n Like we, for example, we use it through the API, right?\n\n40:33.600 --> 40:36.120\n But even the API documentation and so on,\n\n40:36.120 --> 40:37.520\n like it's super outdated.\n\n40:37.520 --> 40:42.520\n Like I don't even know what to...\n\n40:42.840 --> 40:46.440\n I mean, the same criticism, as long as we're ranting,\n\n40:47.680 --> 40:49.960\n my same criticism goes to the APIs\n\n40:49.960 --> 40:50.920\n of most of these companies.\n\n40:50.920 --> 40:55.120\n Like Google, for example, the API for the different services\n\n40:55.120 --> 40:59.760\n is just the documentation is so shitty.\n\n40:59.760 --> 41:02.160\n Like it's not so shitty.\n\n41:02.160 --> 41:05.280\n I should actually be...\n\n41:05.280 --> 41:08.280\n I should exhibit some gratitude.\n\n41:08.280 --> 41:10.800\n Okay, let's practice some gratitude.\n\n41:10.800 --> 41:14.240\n The documentation is pretty good.\n\n41:14.240 --> 41:18.720\n Like most of the things that the API makes available\n\n41:18.720 --> 41:19.640\n is pretty good.\n\n41:19.640 --> 41:23.040\n It's just that in the sense that it's accurate,\n\n41:23.040 --> 41:27.200\n sometimes outdated, but like the degree of explanations\n\n41:27.200 --> 41:31.360\n with examples is only covering, I would say,\n\n41:31.360 --> 41:33.840\n like 50% of what's possible.\n\n41:33.840 --> 41:35.520\n And it just feels a little bit,\n\n41:35.520 --> 41:37.320\n like there's a lot of natural questions\n\n41:37.320 --> 41:41.600\n that people would wanna ask that doesn't get covered.\n\n41:41.600 --> 41:44.520\n And it feels like it's almost there.\n\n41:44.520 --> 41:46.120\n Like it's such a magical thing.\n\n41:46.120 --> 41:51.120\n Like the Maps API, YouTube API, there's a bunch of stuff.\n\n41:51.120 --> 41:54.720\n I gotta imagine it's like, there's probably some team\n\n41:54.720 --> 41:57.440\n at Google responsible for writing this documentation\n\n41:57.440 --> 42:00.240\n that's probably not the engineers, right?\n\n42:00.240 --> 42:04.360\n And probably this team is not where you wanna be.\n\n42:04.360 --> 42:05.800\n Well, it's a weird thing.\n\n42:05.800 --> 42:09.160\n I sometimes think about this for somebody\n\n42:09.160 --> 42:12.120\n who wants to also build a company.\n\n42:12.120 --> 42:14.920\n I think about this a lot.\n\n42:14.920 --> 42:19.920\n YouTube, the service is one of the most magical,\n\n42:21.560 --> 42:24.440\n like I'm so grateful that YouTube exists.\n\n42:24.440 --> 42:29.440\n And yet they seem to be quite clueless on so many things\n\n42:30.840 --> 42:33.400\n like that everybody's screaming them at.\n\n42:33.400 --> 42:37.360\n Like it feels like whatever the mechanism\n\n42:37.360 --> 42:40.080\n that you use to listen to your quote unquote customers,\n\n42:40.080 --> 42:44.800\n which is like the creators, is not very good.\n\n42:44.800 --> 42:47.880\n Like there's literally people that are like screaming why,\n\n42:47.880 --> 42:51.040\n like their new YouTube studio, for example.\n\n42:51.040 --> 42:55.160\n There's like features that were like begged for\n\n42:55.160 --> 42:56.880\n for a really long time.\n\n42:56.880 --> 43:00.160\n Like being able to upload multiple videos at the same time.\n\n43:00.160 --> 43:03.880\n That wasn't missing for a really, really long time.\n\n43:03.880 --> 43:08.000\n Now, like there's probably things that I don't know,\n\n43:08.000 --> 43:10.960\n which is maybe for that kind of huge infrastructure,\n\n43:10.960 --> 43:12.320\n it's actually very difficult to build\n\n43:12.320 --> 43:13.720\n some of these features.\n\n43:13.720 --> 43:15.520\n But the fact that that wasn't communicated\n\n43:15.520 --> 43:19.120\n and it felt like you're not being heard.\n\n43:19.120 --> 43:21.520\n Like I remember this experience for me\n\n43:21.520 --> 43:23.800\n and it's not a pleasant experience.\n\n43:23.800 --> 43:26.720\n And it feels like the company doesn't give a damn about you.\n\n43:26.720 --> 43:28.160\n And that's something to think about.\n\n43:28.160 --> 43:29.960\n I'm not sure what that is.\n\n43:29.960 --> 43:32.480\n That might have to do with just like small groups\n\n43:32.480 --> 43:35.920\n working on these small features and these specific features.\n\n43:35.920 --> 43:40.280\n And there's no overarching like dictator type of human\n\n43:40.280 --> 43:42.440\n that says like, why the hell are we neglecting\n\n43:42.440 --> 43:43.920\n like Steve Jobs type of characters?\n\n43:43.920 --> 43:48.240\n Like there's people that we need to speak\n\n43:48.240 --> 43:50.640\n to the people that like wanna love our product\n\n43:50.640 --> 43:51.680\n and they don't.\n\n43:51.680 --> 43:52.520\n Let's fix this shit.\n\n43:52.520 --> 43:54.160\n Maybe at some point you just get so fixated\n\n43:54.160 --> 43:55.120\n on the numbers, right?\n\n43:55.120 --> 43:57.200\n And it's like, well, the numbers are pretty great, right?\n\n43:57.200 --> 43:58.640\n Like people are watching,\n\n43:59.680 --> 44:01.960\n doesn't seem to be a problem, right?\n\n44:01.960 --> 44:04.080\n And you're not like the person that like build this thing,\n\n44:04.080 --> 44:04.920\n right?\n\n44:04.920 --> 44:05.840\n So you really care about it.\n\n44:05.840 --> 44:09.080\n You're just there, you came in as a product manager, right?\n\n44:09.080 --> 44:10.680\n You got hired sometime later,\n\n44:10.680 --> 44:13.520\n your mandate is like increase this number,\n\n44:13.520 --> 44:15.680\n like 10%, right?\n\n44:15.680 --> 44:16.520\n And you just.\n\n44:16.520 --> 44:17.520\n That's brilliantly put.\n\n44:17.520 --> 44:21.320\n Like if you, this is, okay, if there's a lesson in this\n\n44:21.320 --> 44:24.200\n is don't reduce your company into a metric\n\n44:24.200 --> 44:28.280\n of like how much, like you said,\n\n44:28.280 --> 44:30.800\n how much people watching the videos and so on\n\n44:30.800 --> 44:33.800\n and like convince yourself that everything is working\n\n44:33.800 --> 44:36.120\n just because the numbers are going up.\n\n44:36.120 --> 44:39.120\n There's something, you have to have a vision.\n\n44:39.120 --> 44:43.400\n You have to want people to love your stuff\n\n44:43.400 --> 44:46.120\n because love is ultimately the beginning\n\n44:46.120 --> 44:49.280\n of like a successful longterm company\n\n44:49.280 --> 44:51.320\n is that they always should love your product.\n\n44:51.320 --> 44:52.640\n You have to be like a creator\n\n44:52.640 --> 44:55.400\n and have that like creator's love for your own thing, right?\n\n44:55.400 --> 44:59.560\n Like, and you're pained by these comments, right?\n\n44:59.560 --> 45:02.480\n And probably like Apple, I think did this generally\n\n45:02.480 --> 45:03.840\n like really well.\n\n45:03.840 --> 45:06.880\n They're well known for kind of keeping teams small\n\n45:06.880 --> 45:08.200\n even when they were big, right?\n\n45:08.200 --> 45:10.400\n And, you know, he was an engineer,\n\n45:10.400 --> 45:12.680\n like there's a book, a creative selection.\n\n45:12.680 --> 45:15.440\n I don't know if you read it by a Apple engineer\n\n45:15.440 --> 45:17.280\n named Ken Koscienda.\n\n45:17.280 --> 45:18.320\n It's kind of a great book actually\n\n45:18.320 --> 45:21.440\n because unlike most of these business books where it's,\n\n45:21.440 --> 45:24.600\n you know, here's how Steve Jobs ran the company.\n\n45:24.600 --> 45:27.240\n It's more like here's how life was like for me, you know,\n\n45:27.240 --> 45:29.000\n an engineer here, the projects I worked on\n\n45:29.000 --> 45:31.720\n and here what it was like to pitch Steve Jobs, you know,\n\n45:31.720 --> 45:34.640\n on like, you know, I think it was in charge of like\n\n45:34.640 --> 45:36.840\n the keyboard and the auto correction, right?\n\n45:36.840 --> 45:39.440\n And at Apple, like Steve Jobs reviewed everything.\n\n45:39.440 --> 45:41.160\n And so he was like, this is what it was like\n\n45:41.160 --> 45:43.720\n to show my demos to Steve Jobs and, you know,\n\n45:43.720 --> 45:46.600\n to change them because like Steve Jobs didn't like how,\n\n45:46.600 --> 45:48.760\n you know, the shape of the little key was off\n\n45:48.760 --> 45:50.920\n because the rounding of the corner was like not quite right\n\n45:50.920 --> 45:51.760\n or something like this, right?\n\n45:51.760 --> 45:54.640\n He was famously a stickler for this kind of stuff.\n\n45:54.640 --> 45:55.800\n But because the teams were small,\n\n45:55.800 --> 45:56.920\n he really owned this stuff, right?\n\n45:56.920 --> 45:58.680\n So he really cared.\n\n45:58.680 --> 46:01.640\n Yeah, Elon Musk does that similar kind of thing with Tesla,\n\n46:01.640 --> 46:03.400\n which is really interesting.\n\n46:03.400 --> 46:05.880\n There's another lesson in leadership in that\n\n46:05.880 --> 46:07.640\n is to be obsessed with the details.\n\n46:07.640 --> 46:11.280\n And like, he talks to like the lowest level engineers.\n\n46:11.280 --> 46:14.600\n Okay, so we're talking about ASR\n\n46:14.600 --> 46:17.640\n and so this is basically where I was saying\n\n46:17.640 --> 46:20.360\n we're gonna take this like ultra seriously.\n\n46:20.360 --> 46:22.640\n And then what's the mission?\n\n46:22.640 --> 46:26.200\n To try to keep pushing towards the 3%.\n\n46:26.200 --> 46:30.320\n Yeah, and kind of try to build this platform\n\n46:30.320 --> 46:33.920\n where all of your, you know, all of your meetings,\n\n46:33.920 --> 46:38.440\n you know, they're as easily accessible as your notes, right?\n\n46:38.440 --> 46:41.360\n Like, so, like, imagine all the meetings\n\n46:41.360 --> 46:43.080\n a company might have, right?\n\n46:43.080 --> 46:46.280\n You know, now that I'm like no longer a programmer, right?\n\n46:46.280 --> 46:48.080\n Then I'm a quote unquote manager.\n\n46:49.160 --> 46:51.120\n That's less like my day as in meetings, right?\n\n46:51.120 --> 46:51.960\n Yeah.\n\n46:51.960 --> 46:53.800\n And, you know, pretty often I wanna like see\n\n46:53.800 --> 46:55.040\n what was said, right?\n\n46:55.040 --> 46:56.200\n Who said it, you know?\n\n46:56.200 --> 46:57.040\n What's the context?\n\n46:57.040 --> 46:59.360\n But it's generally not really something\n\n46:59.360 --> 47:00.480\n that you can easily retrieve, right?\n\n47:00.480 --> 47:03.200\n Like imagine if all of those meetings\n\n47:03.200 --> 47:05.760\n were indexed, archived, you know, you could go back,\n\n47:05.760 --> 47:08.280\n you could share a clip like really easily, right?\n\n47:08.280 --> 47:10.040\n So that might change completely.\n\n47:10.040 --> 47:11.920\n It's like everything that's said,\n\n47:11.920 --> 47:14.000\n converted to text might change completely\n\n47:14.000 --> 47:16.320\n the dynamics of what we do in this world,\n\n47:16.320 --> 47:18.160\n especially now with remote work, right?\n\n47:18.160 --> 47:19.480\n Exactly, exactly.\n\n47:19.480 --> 47:21.440\n With Zoom and so on.\n\n47:21.440 --> 47:22.760\n That's fascinating to think about.\n\n47:22.760 --> 47:25.560\n I mean, for me, I care about podcasts, right?\n\n47:25.560 --> 47:28.800\n And one of the things that was,\n\n47:30.400 --> 47:31.240\n you know, I'm torn.\n\n47:31.240 --> 47:33.600\n I know a lot of the engineers at Spotify.\n\n47:33.600 --> 47:38.600\n So I love them very much because they dream big\n\n47:39.840 --> 47:43.400\n in terms of like, they wanna empower creators.\n\n47:43.400 --> 47:45.080\n So one of my hopes was with Spotify\n\n47:45.080 --> 47:46.840\n that they would use a technology like Rev\n\n47:46.840 --> 47:51.720\n or something like that to start converting everything\n\n47:51.720 --> 47:55.200\n into text and make it indexable.\n\n47:55.200 --> 47:59.560\n Like one of the things that sucks with podcasts\n\n47:59.560 --> 48:01.800\n is like, it's hard to find stuff.\n\n48:01.800 --> 48:04.480\n Like the model is basically subscription.\n\n48:04.480 --> 48:09.480\n Like you find, it's similar to what YouTube used to be like,\n\n48:10.600 --> 48:14.240\n which is you basically find a creator that you enjoy\n\n48:14.240 --> 48:15.360\n and you subscribe to them.\n\n48:15.360 --> 48:19.720\n And like, you just kind of follow what they're doing,\n\n48:19.720 --> 48:24.320\n but the search and discovery wasn't a big part of YouTube\n\n48:24.320 --> 48:25.560\n like in the early days,\n\n48:25.560 --> 48:28.560\n but that's what currently with podcasts,\n\n48:28.560 --> 48:33.560\n like is the search and discovery is like non existent.\n\n48:33.880 --> 48:35.280\n You're basically searching for like\n\n48:35.280 --> 48:36.400\n the dumbest possible thing,\n\n48:36.400 --> 48:39.680\n which is like keywords in the titles of episodes.\n\n48:39.680 --> 48:40.520\n Yeah.\n\n48:40.520 --> 48:42.160\n Even aside from a search and discovery, like all the time.\n\n48:42.160 --> 48:44.160\n So I listened to like a number of podcasts\n\n48:44.160 --> 48:46.840\n and there's something said,\n\n48:46.840 --> 48:48.560\n and I wanna like go back to that later\n\n48:48.560 --> 48:49.800\n because I was trying to, I'm trying to remember,\n\n48:49.800 --> 48:50.640\n what do you say?\n\n48:50.640 --> 48:52.160\n Like maybe like recommended some cool product\n\n48:52.160 --> 48:53.440\n that I wanna try out.\n\n48:53.440 --> 48:54.680\n And like, it's basically impossible.\n\n48:54.680 --> 48:56.800\n Maybe like some people have pretty good show notes.\n\n48:56.800 --> 48:59.040\n So maybe you'll get lucky and you can find it, right?\n\n48:59.040 --> 49:01.600\n But I mean, if everyone had transcripts\n\n49:01.600 --> 49:05.320\n and it was all searchable, it would be so much better.\n\n49:05.320 --> 49:08.480\n I mean, that's one of the things that I wanted to,\n\n49:08.480 --> 49:11.040\n I mean, one of the reasons we're talking today\n\n49:11.040 --> 49:13.400\n is I wanted to take this quite seriously.\n\n49:13.400 --> 49:15.700\n The rough thing, I just been lazy.\n\n49:16.840 --> 49:19.480\n So, because I'm very fortunate\n\n49:19.480 --> 49:21.240\n that a lot of people support this podcast,\n\n49:21.240 --> 49:24.840\n that there's enough money now to do a transcription and so on.\n\n49:24.840 --> 49:29.840\n And it seemed clear to me, especially like CEOs\n\n49:29.960 --> 49:34.960\n and sort of like PhDs, like people write to me\n\n49:36.360 --> 49:38.320\n who are like graduate students in computer science\n\n49:38.320 --> 49:41.100\n or graduate students in whatever the heck field,\n\n49:41.100 --> 49:43.120\n it's clear that their mind,\n\n49:43.120 --> 49:44.320\n like they enjoy podcasts\n\n49:44.320 --> 49:46.120\n when they're doing laundry or whatever,\n\n49:46.120 --> 49:48.760\n but they wanna revisit the conversation\n\n49:48.760 --> 49:50.720\n in a much more rigorous way.\n\n49:50.720 --> 49:52.920\n And they really wanna transcript.\n\n49:52.920 --> 49:56.120\n Like it's clear that they want to analyze conversations.\n\n49:56.120 --> 49:58.400\n Like so many people wrote to me\n\n49:58.400 --> 50:01.080\n about a transcript for Yosha Bach conversation.\n\n50:01.080 --> 50:03.720\n I had just a bunch of conversations.\n\n50:03.720 --> 50:05.840\n And then on the Elon Musk side,\n\n50:05.840 --> 50:09.400\n like reporters, they wanna write a blog post\n\n50:09.400 --> 50:10.840\n about your conversation.\n\n50:10.840 --> 50:13.040\n So they wanna be able to pull stuff.\n\n50:13.040 --> 50:15.480\n And it's like, they're essentially doing\n\n50:15.480 --> 50:18.360\n on your conversation transcription privately.\n\n50:18.360 --> 50:21.800\n They're doing it for themselves and then starting to pick,\n\n50:21.800 --> 50:23.960\n but it's so much easier when you can actually do it\n\n50:23.960 --> 50:26.200\n as a reporter, just look at the transcript.\n\n50:26.200 --> 50:28.360\n Yeah, and you can like embed a little thing,\n\n50:28.360 --> 50:29.600\n like into your article, right?\n\n50:29.600 --> 50:31.240\n Here's what they said, you can go listen\n\n50:31.240 --> 50:33.580\n to like this clip from the section.\n\n50:33.580 --> 50:35.960\n I'm actually trying to figure out,\n\n50:35.960 --> 50:38.180\n I'll probably on the website create\n\n50:39.320 --> 50:41.440\n like a place where the transcript goes,\n\n50:41.440 --> 50:44.360\n like as a webpage so that people can reference it,\n\n50:44.360 --> 50:46.720\n like reporters can reference it and so on.\n\n50:46.720 --> 50:50.880\n I mean, most of the reporters probably want\n\n50:50.880 --> 50:54.360\n to write clickbait articles that are complete falsifying,\n\n50:54.360 --> 50:55.400\n which I'm fine with.\n\n50:55.400 --> 50:57.760\n It's the way of journalism, I don't care.\n\n50:57.760 --> 51:01.680\n Like I've had this conversation with a friend of mine,\n\n51:01.680 --> 51:03.920\n a mixed martial artist, the Ryan Hall.\n\n51:04.920 --> 51:07.120\n And we talked about, you know,\n\n51:07.120 --> 51:09.640\n as I've been reading The Rise and Fall of the Third Reich\n\n51:09.640 --> 51:13.240\n and a bunch of books on Hitler and we brought up Hitler\n\n51:13.240 --> 51:17.280\n and he made some kind of comment where like,\n\n51:17.280 --> 51:19.480\n we should be able to forgive Hitler\n\n51:19.480 --> 51:23.640\n and, you know, like we were talking about forgiveness\n\n51:23.640 --> 51:25.880\n and we're bringing that up as like the worst case\n\n51:25.880 --> 51:28.520\n possible things, like even, you know,\n\n51:28.520 --> 51:32.040\n for people who are Holocaust survivors,\n\n51:32.040 --> 51:34.660\n one of the ways to let go of the suffering\n\n51:34.660 --> 51:38.000\n they've been through is to forgive.\n\n51:38.000 --> 51:39.760\n And he brought up like Hitler as somebody\n\n51:39.760 --> 51:42.400\n that would potentially be the hardest thing\n\n51:42.400 --> 51:45.720\n to possibly forgive, but it might be a worthwhile pursuit\n\n51:45.720 --> 51:48.560\n psychologically, so on, blah, blah, blah, it doesn't matter.\n\n51:48.560 --> 51:50.860\n It was very eloquent, very powerful words.\n\n51:50.860 --> 51:53.160\n I think people should go back and listen to it.\n\n51:53.160 --> 51:54.000\n It's powerful.\n\n51:54.000 --> 51:55.680\n And then all these journalists,\n\n51:55.680 --> 52:00.000\n all these articles written about like MMA fight, UFC fight.\n\n52:00.000 --> 52:01.920\n MMA fighter loves Hitler.\n\n52:01.920 --> 52:03.680\n No, like, well, no, they didn't.\n\n52:03.680 --> 52:05.720\n They were somewhat accurate.\n\n52:05.720 --> 52:07.120\n They didn't say like loves Hitler.\n\n52:07.120 --> 52:12.120\n They said, thinks that if Hitler came back to life,\n\n52:13.280 --> 52:14.420\n we should forgive him.\n\n52:14.420 --> 52:18.520\n Like they kind of, it's kind of accurate ish,\n\n52:18.520 --> 52:23.520\n but the headline made it sound a lot worse\n\n52:23.800 --> 52:27.800\n than it was, but I'm fine with it.\n\n52:27.800 --> 52:31.640\n That's the way the world, I wanna almost make it easier\n\n52:31.640 --> 52:33.640\n for those journalists and make it easier\n\n52:33.640 --> 52:35.800\n for people who actually care about the conversation\n\n52:35.800 --> 52:37.280\n to go and look and see.\n\n52:37.280 --> 52:38.520\n Right, they can see it for themselves.\n\n52:38.520 --> 52:39.360\n For themselves.\n\n52:39.360 --> 52:41.640\n There's the headline, but now you can go.\n\n52:41.640 --> 52:42.960\n There's something about podcasts,\n\n52:42.960 --> 52:44.840\n like the audio that makes it difficult\n\n52:44.840 --> 52:49.600\n to jump to a spot and to look\n\n52:49.600 --> 52:53.240\n for that particular information.\n\n52:53.240 --> 52:57.040\n I think some of it, I'm interested in creating,\n\n52:58.520 --> 53:00.360\n like myself experimenting with stuff.\n\n53:00.360 --> 53:03.440\n So like taking rev and creating a transcript\n\n53:03.440 --> 53:05.200\n and then people can go to it.\n\n53:05.200 --> 53:09.320\n I do dream that like, I'm not in the loop anymore,\n\n53:09.320 --> 53:13.000\n that like, Spotify does it, right?\n\n53:13.000 --> 53:16.340\n Like automatically for everybody,\n\n53:16.340 --> 53:19.600\n because ultimately that one click purchase\n\n53:19.600 --> 53:21.800\n needs to be there, like, you know.\n\n53:21.800 --> 53:24.120\n Like you kind of want support from the entire ecosystem.\n\n53:24.120 --> 53:24.960\n Exactly.\n\n53:24.960 --> 53:27.960\n Like from the tool makers and the podcast creators,\n\n53:27.960 --> 53:28.800\n even clients, right?\n\n53:28.800 --> 53:33.800\n I mean, imagine if like most podcast apps,\n\n53:33.900 --> 53:35.840\n you know, if it was a standard, right?\n\n53:35.840 --> 53:38.560\n Here's how you include a transcript into a podcast, right?\n\n53:38.560 --> 53:40.920\n Like it's just an RSS feed ultimately.\n\n53:40.920 --> 53:43.520\n And actually just yesterday I saw this company\n\n53:43.520 --> 53:46.880\n called Buzzsprout, I think they're called.\n\n53:46.880 --> 53:48.320\n So they're trying to do this.\n\n53:48.320 --> 53:53.320\n They proposed a spec, an extension to their RSS format\n\n53:53.420 --> 53:58.240\n to reference transcripts in a standard way.\n\n53:58.240 --> 53:59.080\n And they're talking about like,\n\n53:59.080 --> 54:02.140\n there's one client dimension that will support it,\n\n54:02.140 --> 54:04.040\n but imagine like more clients support it, right?\n\n54:04.040 --> 54:08.280\n So any podcast, you could go and see the transcripts\n\n54:08.280 --> 54:10.480\n right in your like normal podcast app.\n\n54:10.480 --> 54:11.320\n Yeah.\n\n54:11.320 --> 54:14.180\n I mean, somebody, so I have somebody who works with me,\n\n54:15.720 --> 54:20.200\n works with helps with advertising, Matt, this awesome guy.\n\n54:20.200 --> 54:22.280\n He mentioned Buzzsprout to me, but he says,\n\n54:22.280 --> 54:24.880\n it's really annoying because they want exclusive,\n\n54:24.880 --> 54:26.280\n they want to host the podcast.\n\n54:26.280 --> 54:27.120\n Right.\n\n54:27.120 --> 54:29.240\n This is the problem with Spotify too.\n\n54:29.240 --> 54:33.920\n This is where I'd like to say, like F Spotify,\n\n54:33.920 --> 54:37.680\n there's a magic to RSS with podcasts.\n\n54:38.600 --> 54:40.320\n It can be made available to everyone.\n\n54:40.320 --> 54:42.720\n And then there's all, there's this ecosystem\n\n54:42.720 --> 54:45.000\n of different podcast players that emerge\n\n54:45.000 --> 54:47.080\n and they compete freely.\n\n54:47.080 --> 54:48.920\n And that's a beautiful thing,\n\n54:48.920 --> 54:50.400\n that that's why I go on exclusive,\n\n54:50.400 --> 54:51.960\n like Joe Rogan went exclusive.\n\n54:53.320 --> 54:54.760\n I'm not sure if you're familiar with,\n\n54:54.760 --> 54:59.560\n he went to Spotify as a huge fan of Joe Rogan.\n\n54:59.560 --> 55:01.380\n I've been kind of nervous about the whole thing,\n\n55:01.380 --> 55:05.000\n but let's see, I hope that Spotify steps up.\n\n55:05.000 --> 55:07.020\n They've added video, which was very surprising\n\n55:07.020 --> 55:07.860\n that they were able to put on.\n\n55:07.860 --> 55:10.360\n Exclusive meaning you can't subscribe\n\n55:10.360 --> 55:11.680\n to the RSS feed anymore.\n\n55:11.680 --> 55:12.680\n It's only in Spotify.\n\n55:12.680 --> 55:15.720\n For now you can until December 1st.\n\n55:15.720 --> 55:18.800\n And December 1st, it's all, everything disappears\n\n55:18.800 --> 55:20.120\n and it's Spotify only.\n\n55:21.480 --> 55:25.260\n I, you know, and Spotify gave him a hundred million dollars\n\n55:25.260 --> 55:26.100\n for that.\n\n55:26.100 --> 55:29.960\n So it's an interesting deal, but I, you know,\n\n55:29.960 --> 55:34.480\n I did some soul searching and I'm glad he's doing it.\n\n55:34.480 --> 55:38.640\n But if Spotify came to me with a hundred million dollars,\n\n55:38.640 --> 55:40.080\n I wouldn't do it.\n\n55:40.080 --> 55:42.160\n I wouldn't do, well, I have a very different relationship\n\n55:42.160 --> 55:43.000\n with money.\n\n55:43.000 --> 55:46.640\n I hate money, but I just think I believe\n\n55:46.640 --> 55:50.000\n in the pirate radio aspect of podcasting, the freedom.\n\n55:50.000 --> 55:50.840\n And that there's something about.\n\n55:50.840 --> 55:52.280\n The open source spirit.\n\n55:52.280 --> 55:54.680\n The open source spirit, it just doesn't seem right.\n\n55:54.680 --> 55:55.780\n It doesn't feel right.\n\n55:55.780 --> 55:58.480\n That said, you know, because so many people care\n\n55:58.480 --> 56:00.400\n about Joe Rogan's program,\n\n56:00.400 --> 56:02.960\n they're gonna hold Spotify's feet to the fire.\n\n56:02.960 --> 56:06.400\n Like one of the cool things with what Joe told me\n\n56:06.400 --> 56:10.440\n is the reason he likes working with Spotify\n\n56:10.440 --> 56:15.440\n is that they, they're like ride or die together, right?\n\n56:16.200 --> 56:19.160\n So they, they want him to succeed.\n\n56:19.160 --> 56:22.080\n So that's why they're not actually telling him what to do\n\n56:22.080 --> 56:23.800\n despite what people think.\n\n56:23.800 --> 56:24.980\n They, they don't tell them,\n\n56:24.980 --> 56:26.940\n they don't give them any notes on anything.\n\n56:26.940 --> 56:28.560\n They want him to succeed.\n\n56:28.560 --> 56:31.920\n And that's the cool thing about exclusivity with a platform\n\n56:31.920 --> 56:36.800\n is like, you're kind of wanting each other to succeed.\n\n56:36.800 --> 56:39.720\n And that process can actually be very fruitful.\n\n56:39.720 --> 56:43.380\n Like YouTube, it goes back to my criticism.\n\n56:44.600 --> 56:47.800\n YouTube generally, no matter how big the creator,\n\n56:47.800 --> 56:50.160\n maybe for PewDiePie, something like that,\n\n56:50.160 --> 56:51.680\n they want you to succeed.\n\n56:51.680 --> 56:53.920\n But for the most part, from all the big creators\n\n56:53.920 --> 56:57.040\n I've spoken with, Veritasium, all of those folks,\n\n56:57.040 --> 56:59.000\n you know, they get some basic assistance,\n\n56:59.000 --> 57:02.800\n but it's not like, YouTube doesn't care\n\n57:02.800 --> 57:03.840\n if you succeed or not.\n\n57:03.840 --> 57:04.680\n They have so many creators.\n\n57:04.680 --> 57:06.500\n Yeah, like a hundred other.\n\n57:06.500 --> 57:07.600\n They don't care.\n\n57:07.600 --> 57:12.600\n So, and especially with, with somebody like Joe Rogan,\n\n57:12.840 --> 57:15.080\n who YouTube sees Joe Rogan,\n\n57:15.080 --> 57:19.760\n not as a person who might revolutionize the nature of news\n\n57:19.760 --> 57:23.900\n and idea space and nuanced conversations.\n\n57:23.900 --> 57:26.280\n They see him as a potential person\n\n57:26.280 --> 57:30.240\n who has racist guests on,\n\n57:30.240 --> 57:33.520\n or like, you know, they see him as like a headache,\n\n57:33.520 --> 57:34.440\n potentially.\n\n57:34.440 --> 57:37.980\n So, you know, a lot of people talk about this.\n\n57:37.980 --> 57:40.600\n It's a hard place to be for YouTube, actually,\n\n57:40.600 --> 57:45.600\n is figuring out with the search and discovery process\n\n57:46.840 --> 57:49.040\n of how do you filter out conspiracy theories\n\n57:49.040 --> 57:53.360\n and which conspiracy theories represent dangerous untruths\n\n57:53.360 --> 57:58.080\n and which conspiracy theories are like vanilla untruths.\n\n57:58.080 --> 58:00.640\n And then even when you start having meetings\n\n58:00.640 --> 58:03.400\n and discussions about what is true or not,\n\n58:03.400 --> 58:05.080\n it starts getting weird.\n\n58:05.080 --> 58:07.800\n Yeah, it's difficult these days, right?\n\n58:07.800 --> 58:09.720\n I worry more about the other side, right?\n\n58:09.720 --> 58:13.240\n Of too much, you know, too much censorship.\n\n58:13.240 --> 58:14.660\n Well, maybe censorship is the right word.\n\n58:14.660 --> 58:17.960\n I mean, censorship is usually government censorship,\n\n58:17.960 --> 58:21.360\n but still, yeah, putting yourself in the position\n\n58:21.360 --> 58:22.920\n of arbiter for these kinds of things.\n\n58:22.920 --> 58:25.360\n It's very difficult and people think it's so easy, right?\n\n58:25.360 --> 58:27.800\n Like, cause like, well, you know, like no Nazis, right?\n\n58:27.800 --> 58:29.060\n What a simple principle.\n\n58:30.000 --> 58:32.960\n But you know, yes, I mean, no one likes Nazis,\n\n58:32.960 --> 58:35.360\n but there's like many shades of gray,\n\n58:35.360 --> 58:37.320\n like very soon after that.\n\n58:37.320 --> 58:39.640\n Yeah, and then, you know, of course everybody, you know,\n\n58:39.640 --> 58:42.200\n there's some people that call our current president a Nazi\n\n58:42.200 --> 58:45.680\n and then there's like, so you start getting a Sam Harris.\n\n58:45.680 --> 58:49.640\n I don't know if you know that is wasted, in my opinion,\n\n58:49.640 --> 58:51.640\n his conversation with Jack Dorsey.\n\n58:51.640 --> 58:54.200\n Now I'll also, I spoke with Jack before in this podcast\n\n58:54.200 --> 58:58.240\n and we'll talk again, but Sam brought up,\n\n58:58.240 --> 59:00.140\n Sam Harris does not like Donald Trump.\n\n59:01.400 --> 59:03.720\n I do listen to his podcast.\n\n59:03.720 --> 59:06.480\n I'm familiar with his views on the matter.\n\n59:06.480 --> 59:08.960\n And he asked Jack Dorsey, he's like,\n\n59:08.960 --> 59:12.280\n how can you not ban Donald Trump from Twitter?\n\n59:12.280 --> 59:15.960\n And so, you know, there's a set, you have that conversation.\n\n59:15.960 --> 59:18.240\n You have a conversation where some number,\n\n59:18.240 --> 59:20.760\n some significant number of people think\n\n59:20.760 --> 59:22.880\n that the current president of the United States\n\n59:22.880 --> 59:24.880\n should not be on your platform.\n\n59:24.880 --> 59:26.240\n And it's like, okay.\n\n59:26.240 --> 59:29.360\n So if that's even on the table as a conversation,\n\n59:29.360 --> 59:32.720\n then everything's on the table for conversation.\n\n59:32.720 --> 59:34.640\n And yeah, it's tough.\n\n59:34.640 --> 59:37.000\n I'm not sure where I land on it.\n\n59:37.000 --> 59:39.440\n I'm with you, I think that censorship is bad,\n\n59:39.440 --> 59:41.840\n but I also think the show...\n\n59:41.840 --> 59:43.960\n Ultimately, I just also think, you know,\n\n59:43.960 --> 59:46.520\n if you're the kind of person that's gonna be convinced,\n\n59:46.520 --> 59:49.420\n you know, by some YouTube video, you know,\n\n59:49.420 --> 59:53.120\n that, I don't know, our government's been taken over\n\n59:53.120 --> 59:56.080\n by aliens, it's unlikely that like, you know,\n\n59:56.080 --> 59:58.960\n you'll be returned to sanity simply because, you know,\n\n59:58.960 --> 1:00:01.980\n that video is not available on YouTube, right?\n\n1:00:01.980 --> 1:00:02.820\n Yeah, I'm with you.\n\n1:00:02.820 --> 1:00:04.520\n I tend to believe in the intelligence of people\n\n1:00:04.520 --> 1:00:06.960\n and we should trust them.\n\n1:00:06.960 --> 1:00:10.940\n But I also do think it's the responsibility of platforms\n\n1:00:10.940 --> 1:00:12.640\n to encourage more love in the world,\n\n1:00:12.640 --> 1:00:14.120\n more kindness to each other.\n\n1:00:14.120 --> 1:00:16.920\n And I don't always think that they're great\n\n1:00:16.920 --> 1:00:19.240\n at doing that particular thing.\n\n1:00:19.240 --> 1:00:24.240\n So that, there's a nice balance there.\n\n1:00:25.400 --> 1:00:28.240\n And I think philosophically, I think about that a lot.\n\n1:00:28.240 --> 1:00:32.040\n Where's the balance between free speech\n\n1:00:32.040 --> 1:00:35.000\n and like encouraging people,\n\n1:00:35.000 --> 1:00:37.880\n even though they have the freedom of speech\n\n1:00:37.880 --> 1:00:39.520\n to not be an asshole.\n\n1:00:39.520 --> 1:00:41.020\n Yeah, right.\n\n1:00:41.020 --> 1:00:42.960\n That's not a constitutional, like...\n\n1:00:44.720 --> 1:00:48.100\n So you have the right for free speech,\n\n1:00:48.100 --> 1:00:50.640\n but like, just don't be an asshole.\n\n1:00:50.640 --> 1:00:52.640\n Like you can't really put that in the constitution\n\n1:00:52.640 --> 1:00:54.160\n that the Supreme Court can't be like,\n\n1:00:54.160 --> 1:00:56.040\n eh, just don't be a dick.\n\n1:00:56.040 --> 1:00:59.520\n But I feel like platforms have a role to be like,\n\n1:00:59.520 --> 1:01:00.800\n just be nicer.\n\n1:01:00.800 --> 1:01:04.160\n Maybe do the carrot, like encourage people to be nicer\n\n1:01:04.160 --> 1:01:06.760\n as opposed to the stake of censorship.\n\n1:01:06.760 --> 1:01:11.020\n But I think it's an interesting machine learning problem.\n\n1:01:11.020 --> 1:01:11.980\n Just be nicer.\n\n1:01:12.960 --> 1:01:15.760\n Machine, yeah, machine learning for niceness.\n\n1:01:15.760 --> 1:01:16.600\n It is, I mean, that's...\n\n1:01:16.600 --> 1:01:17.880\n Responsible, yeah, I mean, it is.\n\n1:01:17.880 --> 1:01:20.080\n It is a thing, for sure.\n\n1:01:20.080 --> 1:01:22.080\n Jack Dorsey kind of talks about it\n\n1:01:22.080 --> 1:01:23.880\n as a vision for Twitter is,\n\n1:01:23.880 --> 1:01:26.760\n how do we increase the health of conversations?\n\n1:01:26.760 --> 1:01:28.060\n I don't know how seriously\n\n1:01:28.060 --> 1:01:30.720\n they're actually trying to do that though.\n\n1:01:30.720 --> 1:01:35.720\n Which is one of the reasons that I'm in part considering\n\n1:01:35.780 --> 1:01:37.240\n entering that space a little bit.\n\n1:01:37.240 --> 1:01:38.480\n It's difficult for them, right?\n\n1:01:38.480 --> 1:01:40.520\n Because, you know, it's kind of like well known\n\n1:01:40.520 --> 1:01:45.520\n that people are kind of driven by rage\n\n1:01:45.520 --> 1:01:49.400\n and you know, outrage maybe is a better word, right?\n\n1:01:49.400 --> 1:01:51.840\n Outrage drives engagement.\n\n1:01:51.840 --> 1:01:55.560\n And well, these companies are judged by engagement, right?\n\n1:01:55.560 --> 1:01:56.400\n So it's...\n\n1:01:56.400 --> 1:01:58.160\n In the short term, but this goes to the metrics thing\n\n1:01:58.160 --> 1:01:59.320\n that we were talking about earlier.\n\n1:01:59.320 --> 1:02:02.240\n I do believe, I have a fundamental belief\n\n1:02:02.240 --> 1:02:06.140\n that if you have a metric of long term happiness\n\n1:02:06.140 --> 1:02:09.520\n of your users, like not short term engagement,\n\n1:02:09.520 --> 1:02:11.440\n but long term happiness and growth\n\n1:02:11.440 --> 1:02:15.520\n and both like intellectual, emotional health of your users,\n\n1:02:15.520 --> 1:02:17.600\n you're going to make a lot more money.\n\n1:02:17.600 --> 1:02:18.840\n You're going to have long...\n\n1:02:18.840 --> 1:02:21.400\n Like you should be able to optimize for that.\n\n1:02:21.400 --> 1:02:24.280\n You don't need to necessarily optimize for engagement.\n\n1:02:24.280 --> 1:02:26.400\n And that'll be good for society too.\n\n1:02:26.400 --> 1:02:28.800\n Yeah, no, I mean, I generally agree with you,\n\n1:02:28.800 --> 1:02:32.400\n but it requires a patient person with, you know,\n\n1:02:33.320 --> 1:02:35.520\n trust from Wall Street to be able\n\n1:02:35.520 --> 1:02:36.720\n to carry out such a strategy.\n\n1:02:36.720 --> 1:02:39.240\n This is what I believe the Steve Jobs character\n\n1:02:39.240 --> 1:02:41.920\n and Elon Musk character is like,\n\n1:02:41.920 --> 1:02:45.240\n you basically have to be so good at your job.\n\n1:02:45.240 --> 1:02:46.960\n Right, you got to pass for anything.\n\n1:02:46.960 --> 1:02:48.680\n That you can hold the board\n\n1:02:48.680 --> 1:02:52.000\n and all the investors hostage by saying like,\n\n1:02:52.000 --> 1:02:56.360\n either we do it my way or I leave.\n\n1:02:56.360 --> 1:02:59.120\n And everyone is too afraid of you to leave\n\n1:02:59.120 --> 1:03:01.360\n because they believe in your vision.\n\n1:03:01.360 --> 1:03:04.280\n But that requires being really good at what you do.\n\n1:03:04.280 --> 1:03:06.680\n It requires being Steve Jobs and Elon Musk.\n\n1:03:06.680 --> 1:03:09.280\n There's kind of a reason why like a third name doesn't\n\n1:03:09.280 --> 1:03:10.840\n come immediately to mind, right?\n\n1:03:10.840 --> 1:03:12.360\n Like there's maybe a handful of other people,\n\n1:03:12.360 --> 1:03:13.440\n but it's not that many.\n\n1:03:13.440 --> 1:03:14.280\n It's not many.\n\n1:03:14.280 --> 1:03:15.480\n I mean, people say like, why are you...\n\n1:03:15.480 --> 1:03:18.320\n Like people say that I'm like a fan of Elon Musk.\n\n1:03:18.320 --> 1:03:20.960\n I'm not, I'm a fan of anybody\n\n1:03:20.960 --> 1:03:23.080\n who's like Steve Jobs and Elon Musk.\n\n1:03:23.080 --> 1:03:26.320\n And there's just not many of those folks.\n\n1:03:26.320 --> 1:03:27.640\n It's the guy that made us believe\n\n1:03:27.640 --> 1:03:31.040\n that like we can get to Mars, you know, in 10 years, right?\n\n1:03:31.040 --> 1:03:32.480\n I mean, that's kind of awesome.\n\n1:03:32.480 --> 1:03:35.280\n And it's kind of making it happen, which is like...\n\n1:03:35.280 --> 1:03:40.280\n And it's kind of gone like that kind of like spirit, right?\n\n1:03:40.480 --> 1:03:42.240\n Like from a lot of our society, right?\n\n1:03:42.240 --> 1:03:44.640\n You know, like we can get to the moon in 10 years\n\n1:03:44.640 --> 1:03:45.640\n and like we did it, right?\n\n1:03:45.640 --> 1:03:46.480\n Yeah.\n\n1:03:46.480 --> 1:03:51.480\n Especially in this time of so much kind of existential dread\n\n1:03:52.840 --> 1:03:55.440\n that people are going through because of COVID,\n\n1:03:55.440 --> 1:03:58.520\n like having rockets that just keep going out there\n\n1:03:58.520 --> 1:04:00.400\n now with humans.\n\n1:04:00.400 --> 1:04:03.200\n I don't know that it, just like you said,\n\n1:04:03.200 --> 1:04:05.520\n I mean, it gives you a reason to wake up in the morning\n\n1:04:05.520 --> 1:04:08.560\n and dream, for us engineers too.\n\n1:04:09.960 --> 1:04:13.120\n It is inspiring as hell, man.\n\n1:04:14.360 --> 1:04:17.080\n Let me ask you this, the worst possible question,\n\n1:04:17.080 --> 1:04:21.280\n which is, so you're like at the core, you're a programmer,\n\n1:04:21.280 --> 1:04:26.280\n you're an engineer, but now you made the unfortunate choice\n\n1:04:29.040 --> 1:04:30.680\n or maybe that's the way life goes\n\n1:04:30.680 --> 1:04:35.080\n of basically moving away from the low level work\n\n1:04:35.080 --> 1:04:38.080\n and becoming a manager, becoming an executive,\n\n1:04:38.080 --> 1:04:43.080\n having meetings, what's that transition been like?\n\n1:04:43.200 --> 1:04:44.040\n It's been interesting.\n\n1:04:44.040 --> 1:04:44.880\n It's been a journey.\n\n1:04:44.880 --> 1:04:46.840\n Maybe a couple of things to say about that.\n\n1:04:46.840 --> 1:04:49.280\n I mean, I got into this, right?\n\n1:04:49.280 --> 1:04:54.280\n Because as a kid, I just remember this like incredible\n\n1:04:54.440 --> 1:04:57.320\n amazement at being able to write a program, right?\n\n1:04:57.320 --> 1:05:01.200\n And something comes to life that kind of didn't exist before.\n\n1:05:01.200 --> 1:05:03.920\n I don't think you have that in like many other fields,\n\n1:05:03.920 --> 1:05:07.880\n like you have that with some other kinds of engineering,\n\n1:05:07.880 --> 1:05:09.640\n but you're maybe a little bit more limited\n\n1:05:09.640 --> 1:05:10.680\n with what you can do, right?\n\n1:05:10.680 --> 1:05:11.640\n But with a computer,\n\n1:05:11.640 --> 1:05:14.760\n you can literally imagine any kind of program, right?\n\n1:05:14.760 --> 1:05:16.960\n So it's a little bit godlike what you do\n\n1:05:16.960 --> 1:05:18.160\n like when you create it.\n\n1:05:19.200 --> 1:05:21.320\n And so, I mean, that's why I got into it.\n\n1:05:21.320 --> 1:05:23.200\n Do you remember like first program you wrote\n\n1:05:23.200 --> 1:05:25.800\n or maybe the first program that like made you fall in love\n\n1:05:25.800 --> 1:05:27.480\n with computer science?\n\n1:05:28.320 --> 1:05:29.400\n I don't know what was the first program.\n\n1:05:29.400 --> 1:05:31.840\n It's probably like trying to write one of those games\n\n1:05:31.840 --> 1:05:34.040\n and basic, you know, like emulate the snake game\n\n1:05:34.040 --> 1:05:35.400\n or whatever.\n\n1:05:35.400 --> 1:05:37.800\n I don't remember to be honest, but I enjoyed like,\n\n1:05:37.800 --> 1:05:40.000\n that's why I always loved about, you know,\n\n1:05:40.000 --> 1:05:41.800\n being a programmer, it's just the creation process.\n\n1:05:41.800 --> 1:05:43.800\n And it's a little bit different\n\n1:05:43.800 --> 1:05:46.160\n when you're not the one doing the creating.\n\n1:05:47.520 --> 1:05:50.480\n And, you know, another aspect to it I would say is,\n\n1:05:50.480 --> 1:05:52.040\n you know, when you're a programmer,\n\n1:05:52.040 --> 1:05:54.160\n when you're a individual contributor,\n\n1:05:54.160 --> 1:05:57.800\n it's kind of very easy to know when you're doing a good job,\n\n1:05:57.800 --> 1:05:58.640\n when you're not doing a good job,\n\n1:05:58.640 --> 1:05:59.480\n when you're being productive,\n\n1:05:59.480 --> 1:06:00.360\n when you're not being productive, right?\n\n1:06:00.360 --> 1:06:03.000\n You can kind of see like you trying to make something\n\n1:06:03.000 --> 1:06:05.560\n and it's like slowly coming together, right?\n\n1:06:05.560 --> 1:06:08.880\n And when you're a manager, you know, it's more diffuse,\n\n1:06:08.880 --> 1:06:09.720\n right?\n\n1:06:09.720 --> 1:06:12.760\n Like, well, you hope, you know, you're motivating your team\n\n1:06:12.760 --> 1:06:15.920\n and making them more productive and inspiring them, right?\n\n1:06:15.920 --> 1:06:18.920\n But it's not like you get some kind of like dopamine signal\n\n1:06:18.920 --> 1:06:22.440\n because you like completed X lines of code, you know, today.\n\n1:06:22.440 --> 1:06:24.040\n So kind of like you missed that dopamine rush\n\n1:06:24.040 --> 1:06:28.040\n a little bit when you first become,\n\n1:06:28.040 --> 1:06:30.440\n but then, you know, slowly you kind of see,\n\n1:06:30.440 --> 1:06:32.360\n yes, your teams are doing amazing work, right?\n\n1:06:32.360 --> 1:06:34.720\n And you can take pride in that.\n\n1:06:34.720 --> 1:06:38.240\n You can get like, what is it?\n\n1:06:38.240 --> 1:06:41.640\n Like a ripple effect of somebody else's dopamine rush.\n\n1:06:41.640 --> 1:06:44.600\n Yeah, yeah, you live off other people's dopamine.\n\n1:06:46.760 --> 1:06:50.800\n So is there pain points and challenges you had to overcome\n\n1:06:50.800 --> 1:06:54.240\n from becoming, from going to a programmer to becoming\n\n1:06:54.240 --> 1:06:55.960\n a programmer of humans?\n\n1:06:55.960 --> 1:06:57.480\n Programmer of humans.\n\n1:06:58.360 --> 1:07:00.960\n I don't know, humans are difficult to understand,\n\n1:07:00.960 --> 1:07:03.640\n you know, it's like one of those things,\n\n1:07:03.640 --> 1:07:06.720\n like trying to understand other people's motivations\n\n1:07:06.720 --> 1:07:08.200\n and what really drives them.\n\n1:07:08.200 --> 1:07:10.840\n It's difficult, maybe like never really know, right?\n\n1:07:10.840 --> 1:07:13.320\n Do you find that people are different?\n\n1:07:13.320 --> 1:07:14.160\n Yeah.\n\n1:07:14.160 --> 1:07:18.680\n Like I, one of the things, like I had a group at MIT\n\n1:07:18.680 --> 1:07:23.680\n that, you know, I found that like some people\n\n1:07:24.680 --> 1:07:29.680\n I could like scream at and criticize like hard\n\n1:07:30.080 --> 1:07:32.800\n and that made them do like much better work\n\n1:07:32.800 --> 1:07:35.160\n and really push them to their limit.\n\n1:07:35.160 --> 1:07:39.080\n And there's some people that I had to nonstop compliment\n\n1:07:39.080 --> 1:07:42.800\n because like they're so already self critical,\n\n1:07:42.800 --> 1:07:45.840\n like about everything they do that I have to be constantly\n\n1:07:45.840 --> 1:07:50.840\n like, like I cannot criticize them at all\n\n1:07:50.920 --> 1:07:52.840\n because they're already criticizing themselves\n\n1:07:52.840 --> 1:07:54.760\n and you have to kind of encourage\n\n1:07:54.760 --> 1:07:58.080\n and like celebrate their little victories.\n\n1:07:58.080 --> 1:08:00.960\n And it's kind of fascinating that like how that,\n\n1:08:00.960 --> 1:08:03.480\n the complete difference in people.\n\n1:08:03.480 --> 1:08:06.400\n Definitely people respond to different motivations\n\n1:08:06.400 --> 1:08:07.600\n and different loads of feedback\n\n1:08:07.600 --> 1:08:10.720\n and you kind of have to figure it out.\n\n1:08:10.720 --> 1:08:13.080\n It was like a pretty good book,\n\n1:08:13.080 --> 1:08:15.440\n which for some reason now the name escapes me,\n\n1:08:15.440 --> 1:08:18.800\n about management, first break all the rules.\n\n1:08:18.800 --> 1:08:19.720\n First break all the rules?\n\n1:08:19.720 --> 1:08:20.800\n First break all the rules.\n\n1:08:20.800 --> 1:08:23.880\n It's a book that we generally like ask a lot of\n\n1:08:23.880 --> 1:08:26.320\n like first time managers to read it rough.\n\n1:08:26.320 --> 1:08:28.760\n And like one of the kind of philosophies\n\n1:08:28.760 --> 1:08:31.080\n is managed by exception, right?\n\n1:08:31.080 --> 1:08:34.440\n Which is, you know, don't like have some standard template\n\n1:08:34.440 --> 1:08:36.920\n like, you know, here's how I, you know,\n\n1:08:36.920 --> 1:08:39.160\n tell this person to do this or the other thing.\n\n1:08:39.160 --> 1:08:41.240\n Here's how I get feedback, like manage by exception, right?\n\n1:08:41.240 --> 1:08:42.800\n Every person is a little bit different.\n\n1:08:42.800 --> 1:08:45.280\n You have to try to understand what drives them.\n\n1:08:45.280 --> 1:08:47.200\n And tailor it to them.\n\n1:08:47.200 --> 1:08:48.880\n Since you mentioned books,\n\n1:08:48.880 --> 1:08:50.800\n I don't know if you can answer this question,\n\n1:08:50.800 --> 1:08:53.600\n but people love it when I ask it, which is,\n\n1:08:53.600 --> 1:08:56.880\n are there books, technical fiction or philosophical\n\n1:08:56.880 --> 1:08:59.800\n that you enjoyed or had an impact on your life\n\n1:08:59.800 --> 1:09:01.320\n that you would recommend?\n\n1:09:01.320 --> 1:09:04.400\n You already mentioned Dune, like all of the Dune.\n\n1:09:04.400 --> 1:09:05.360\n All of the Dune.\n\n1:09:05.360 --> 1:09:07.080\n The second one was probably the weakest, but anyway,\n\n1:09:07.080 --> 1:09:09.760\n so yeah, all of the Dune is good.\n\n1:09:09.760 --> 1:09:13.440\n I mean, yeah, can you just slow little tangent on that?\n\n1:09:13.440 --> 1:09:16.280\n Is, how many Dune books are there?\n\n1:09:16.280 --> 1:09:18.440\n Like, do you recommend people start with the first one\n\n1:09:18.440 --> 1:09:19.880\n if that was?\n\n1:09:19.880 --> 1:09:21.040\n Yeah, you gotta have to read them all.\n\n1:09:21.040 --> 1:09:23.240\n I mean, it is a complete story, right?\n\n1:09:23.240 --> 1:09:25.440\n So you start with the first one,\n\n1:09:25.440 --> 1:09:27.520\n you gotta read all of them.\n\n1:09:27.520 --> 1:09:31.640\n So it's not like a tree, like a creation of like\n\n1:09:31.640 --> 1:09:33.880\n the universe that you should go in sequence?\n\n1:09:33.880 --> 1:09:35.200\n You should go in sequence, yeah.\n\n1:09:35.200 --> 1:09:38.000\n It's kind of a chronological storyline.\n\n1:09:38.000 --> 1:09:40.120\n There's six books in all.\n\n1:09:40.120 --> 1:09:43.720\n Then there's like many kind of books\n\n1:09:43.720 --> 1:09:47.880\n that were written by Frank Herbert's son,\n\n1:09:47.880 --> 1:09:48.840\n but those are not as good.\n\n1:09:48.840 --> 1:09:50.880\n So you don't have to bother with those.\n\n1:09:50.880 --> 1:09:51.720\n Shots fired.\n\n1:09:51.720 --> 1:09:52.920\n Shots fired.\n\n1:09:52.920 --> 1:09:53.760\n Okay.\n\n1:09:53.760 --> 1:09:56.280\n But the main sequence is good.\n\n1:09:56.280 --> 1:09:57.680\n So what are some other books?\n\n1:09:58.840 --> 1:09:59.680\n Maybe there's a few.\n\n1:09:59.680 --> 1:10:02.000\n So I don't know that like, I would say there's a book\n\n1:10:02.000 --> 1:10:05.440\n that kind of, I don't know, turned my life around\n\n1:10:05.440 --> 1:10:07.880\n or anything like that, but here's a couple\n\n1:10:07.880 --> 1:10:08.960\n that I really love.\n\n1:10:08.960 --> 1:10:13.400\n So one is Brave New World by Aldous Huxley.\n\n1:10:16.040 --> 1:10:20.160\n And it's kind of incredible how prescient he was\n\n1:10:20.160 --> 1:10:25.160\n about like what a brave new world might be like, right?\n\n1:10:25.440 --> 1:10:28.200\n You know, you kind of see genetic sorting in this book,\n\n1:10:28.200 --> 1:10:30.720\n right, where there's like these alphas and epsilons\n\n1:10:30.720 --> 1:10:34.920\n and how from like the earliest time of society,\n\n1:10:34.920 --> 1:10:36.760\n like they're sort of like, you can kind of see it\n\n1:10:36.760 --> 1:10:39.640\n in a slightly similar way today where,\n\n1:10:40.640 --> 1:10:42.720\n well, one of the problems with society is people\n\n1:10:42.720 --> 1:10:45.960\n are kind of genetically sorting a little bit, right?\n\n1:10:45.960 --> 1:10:48.960\n Like there's much less, like most marriages, right,\n\n1:10:48.960 --> 1:10:53.360\n are between people of similar kind of intellectual level\n\n1:10:53.360 --> 1:10:57.560\n or socioeconomic status, more so these days than in the past.\n\n1:10:57.560 --> 1:10:59.080\n And you kind of see some effects of it\n\n1:10:59.080 --> 1:11:03.720\n in stratifying society and kind of he illustrated\n\n1:11:03.720 --> 1:11:05.840\n what that could be like in the extreme.\n\n1:11:05.840 --> 1:11:07.920\n There's different versions of it on social media as well.\n\n1:11:07.920 --> 1:11:09.840\n It's not just like marriages and so on.\n\n1:11:09.840 --> 1:11:13.440\n Like it's genetic sorting in terms of what Dawkins called\n\n1:11:13.440 --> 1:11:17.320\n memes as ideas being put into these bins\n\n1:11:17.320 --> 1:11:20.000\n of these little echo chambers and so on.\n\n1:11:20.000 --> 1:11:21.440\n Yeah, I know, so that's the book\n\n1:11:21.440 --> 1:11:23.560\n that's I think a worthwhile read for everyone.\n\n1:11:23.560 --> 1:11:25.240\n I mean, 1984 is good, of course, as well.\n\n1:11:25.240 --> 1:11:26.520\n Like if you're talking about, you know,\n\n1:11:26.520 --> 1:11:28.200\n dystopian novels of the future.\n\n1:11:28.200 --> 1:11:30.520\n Yeah, it's a slightly different view of the future, right?\n\n1:11:30.520 --> 1:11:33.600\n But I kind of like identify with Brave New World a bit more.\n\n1:11:33.600 --> 1:11:38.040\n Yeah, speaking of not a book,\n\n1:11:38.040 --> 1:11:41.480\n but my favorite kind of dystopian science fiction\n\n1:11:41.480 --> 1:11:42.600\n is a movie called Brazil,\n\n1:11:42.600 --> 1:11:44.160\n which I don't know if you've heard of.\n\n1:11:44.160 --> 1:11:46.320\n I've heard of and I know I need to watch it,\n\n1:11:46.320 --> 1:11:50.520\n but yeah, because it's in, is it in English or no?\n\n1:11:50.520 --> 1:11:52.120\n It's an English movie, yeah.\n\n1:11:52.120 --> 1:11:55.800\n And it's a sort of like dystopian movie\n\n1:11:55.800 --> 1:11:58.640\n of authoritarian incompetence, right?\n\n1:11:58.640 --> 1:12:03.640\n It's like nothing really works very well, you know,\n\n1:12:03.640 --> 1:12:05.720\n the system is creaky, you know,\n\n1:12:05.720 --> 1:12:07.800\n but no one is kind of like willing to challenge it,\n\n1:12:07.800 --> 1:12:10.040\n you know, just things kind of ample along\n\n1:12:10.040 --> 1:12:13.680\n and kind of strikes me as like a very plausible future\n\n1:12:13.680 --> 1:12:16.840\n of like, you know, what authoritarianism might look like.\n\n1:12:16.840 --> 1:12:19.240\n It's not like this, you know,\n\n1:12:19.240 --> 1:12:21.880\n super efficient evil dictatorship of 1984.\n\n1:12:21.880 --> 1:12:25.240\n It's just kind of like this badly functioning, you know,\n\n1:12:25.240 --> 1:12:30.080\n but it's status quo, so it just goes on.\n\n1:12:30.080 --> 1:12:33.520\n Yeah, that's one funny thing that stands out to me\n\n1:12:33.520 --> 1:12:37.120\n is in whether it's authoritarian, dystopian stuff,\n\n1:12:37.120 --> 1:12:39.480\n or just basic like, you know,\n\n1:12:39.480 --> 1:12:42.400\n if you look at the movie Contagion,\n\n1:12:42.400 --> 1:12:44.480\n it seems in the movies,\n\n1:12:44.480 --> 1:12:48.120\n government is almost always exceptionally competent.\n\n1:12:49.600 --> 1:12:53.200\n Like it's like used as a storytelling tool\n\n1:12:53.200 --> 1:12:55.480\n of like extreme competence.\n\n1:12:55.480 --> 1:12:58.360\n Like, you know, you use it whether it's good or evil,\n\n1:12:58.360 --> 1:12:59.680\n but it's competent.\n\n1:12:59.680 --> 1:13:01.840\n It's very interesting to think about\n\n1:13:01.840 --> 1:13:06.440\n where much more realistically is it's incompetence\n\n1:13:06.440 --> 1:13:11.280\n and that incompetence isn't itself has consequences\n\n1:13:11.280 --> 1:13:13.200\n that are difficult to predict.\n\n1:13:13.200 --> 1:13:18.000\n Like bureaucracy has a very boring way of being evil,\n\n1:13:19.040 --> 1:13:21.400\n of just, you know, if you look at the show,\n\n1:13:21.400 --> 1:13:23.160\n HBO show at Chernobyl,\n\n1:13:23.160 --> 1:13:28.160\n it's a really good story of how bureaucracy, you know,\n\n1:13:30.200 --> 1:13:32.800\n leads to catastrophic events,\n\n1:13:32.800 --> 1:13:34.320\n but not through any kind of evil\n\n1:13:34.320 --> 1:13:36.200\n in any one particular place,\n\n1:13:36.200 --> 1:13:37.720\n but more just like the...\n\n1:13:37.720 --> 1:13:40.040\n It's just the system kind of system.\n\n1:13:40.040 --> 1:13:43.280\n Distorting information as it travels up the chain\n\n1:13:43.280 --> 1:13:46.040\n that people unwilling to take responsibility for things\n\n1:13:46.040 --> 1:13:50.960\n and just kind of like this laziness resulting in evil.\n\n1:13:50.960 --> 1:13:52.320\n There's a comedic version of this,\n\n1:13:52.320 --> 1:13:53.600\n I don't know if you've seen this movie,\n\n1:13:53.600 --> 1:13:54.960\n it's called The Death of Stalin.\n\n1:13:54.960 --> 1:13:58.080\n Yeah, I liked that.\n\n1:13:58.080 --> 1:14:00.080\n I wish it wasn't so...\n\n1:14:00.080 --> 1:14:02.360\n There's a movie called Inglourious Bastards\n\n1:14:02.360 --> 1:14:06.280\n about, you know, Hitler and so on.\n\n1:14:07.760 --> 1:14:09.640\n For some reason, those movies pissed me off.\n\n1:14:09.640 --> 1:14:11.120\n I know a lot of people love them,\n\n1:14:11.120 --> 1:14:16.120\n but like, I just feel like there's not enough good movies,\n\n1:14:16.640 --> 1:14:18.520\n even about Hitler.\n\n1:14:18.520 --> 1:14:21.400\n There's good movies about the Holocaust,\n\n1:14:21.400 --> 1:14:23.640\n but even Hitler, there's a movie called Dawnfall\n\n1:14:23.640 --> 1:14:24.480\n that people should watch.\n\n1:14:24.480 --> 1:14:26.080\n I think it's the last few days of Hitler.\n\n1:14:26.080 --> 1:14:30.440\n That's a good movie, turned into a meme, but it's good.\n\n1:14:30.440 --> 1:14:33.760\n But on Stalin, I feel like I may be wrong on this,\n\n1:14:33.760 --> 1:14:35.520\n but at least in the English speaking world,\n\n1:14:35.520 --> 1:14:38.760\n there's not good movies about the evil of Stalin.\n\n1:14:38.760 --> 1:14:39.600\n That's true.\n\n1:14:39.600 --> 1:14:40.640\n Let's try to see that.\n\n1:14:40.640 --> 1:14:43.320\n Actually, so I agree with you on Inglourious Bastard.\n\n1:14:43.320 --> 1:14:44.480\n I didn't love the movie\n\n1:14:46.000 --> 1:14:50.000\n because I felt like kind of the stylizing of it, right?\n\n1:14:50.000 --> 1:14:55.000\n The whole Tarantino kind of Tarantinoism, if you will,\n\n1:14:55.040 --> 1:14:56.080\n kind of detracted from it\n\n1:14:56.080 --> 1:14:58.400\n and made it seem like unserious a little bit.\n\n1:15:00.280 --> 1:15:02.240\n But Death of Stalin, I felt differently.\n\n1:15:02.240 --> 1:15:03.800\n Maybe it's because it's a comedy to begin with.\n\n1:15:03.800 --> 1:15:06.560\n This is not like I'm expecting seriousness,\n\n1:15:06.560 --> 1:15:10.760\n but it kind of depicted the absurdity\n\n1:15:10.760 --> 1:15:13.360\n of the whole situation in a way, right?\n\n1:15:13.360 --> 1:15:15.280\n I mean, it was funny, so maybe it does make light of it,\n\n1:15:15.280 --> 1:15:18.200\n but something goes probably like this, right?\n\n1:15:18.200 --> 1:15:20.440\n Like a bunch of kind of people,\n\n1:15:20.440 --> 1:15:22.440\n they're like, oh shit, right?\n\n1:15:22.440 --> 1:15:23.280\n You're right.\n\n1:15:23.280 --> 1:15:25.440\n But like the thing is,\n\n1:15:25.440 --> 1:15:30.440\n it was so close to like what probably was reality.\n\n1:15:32.720 --> 1:15:35.480\n It was caricaturing reality\n\n1:15:35.480 --> 1:15:39.320\n to where I think an observer might think that this is not,\n\n1:15:39.320 --> 1:15:41.560\n like they might think it's a comedy.\n\n1:15:41.560 --> 1:15:45.560\n Well, in reality, that's the absurdity\n\n1:15:45.560 --> 1:15:48.800\n of how people act with dictators.\n\n1:15:48.800 --> 1:15:53.800\n I mean, that's, I guess it was too close to reality for me.\n\n1:15:54.000 --> 1:15:57.720\n The kind of banality of like what were eventually\n\n1:15:57.720 --> 1:15:59.440\n like fairly evil acts, right?\n\n1:15:59.440 --> 1:16:02.280\n But like, yeah, they're just a bunch of people\n\n1:16:02.280 --> 1:16:03.160\n trying to survive.\n\n1:16:04.400 --> 1:16:05.440\n Cause I think there's a good,\n\n1:16:05.440 --> 1:16:07.560\n I haven't watched it yet, the good movie on,\n\n1:16:07.560 --> 1:16:12.440\n the movie on Churchill with Gary Oldman,\n\n1:16:12.440 --> 1:16:14.000\n I think it's Gary Oldman.\n\n1:16:14.000 --> 1:16:15.400\n I may be making that up.\n\n1:16:15.400 --> 1:16:16.240\n But I think he won,\n\n1:16:16.240 --> 1:16:17.960\n like he was nominated for an Oscar or something.\n\n1:16:17.960 --> 1:16:20.960\n So I like, I love these movies about these humans\n\n1:16:20.960 --> 1:16:25.960\n and Stalin, like Chernobyl made me realize the HBO show\n\n1:16:26.000 --> 1:16:28.760\n that there's not enough movies about Russia\n\n1:16:28.760 --> 1:16:33.040\n that capture that spirit.\n\n1:16:33.040 --> 1:16:35.640\n I'm sure it might be in Russian there is,\n\n1:16:35.640 --> 1:16:39.280\n but the fact that some British dude that like did comedy,\n\n1:16:39.280 --> 1:16:42.120\n I feel like he did like hangover or some shit like that.\n\n1:16:42.120 --> 1:16:43.080\n I don't know if you're familiar\n\n1:16:43.080 --> 1:16:44.400\n with the person who created Chernobyl,\n\n1:16:44.400 --> 1:16:45.720\n but he was just like some guy\n\n1:16:45.720 --> 1:16:47.320\n that doesn't know anything about Russia.\n\n1:16:47.320 --> 1:16:49.760\n And he just went in and just studied it,\n\n1:16:49.760 --> 1:16:51.880\n like did a good job of creating it\n\n1:16:51.880 --> 1:16:56.080\n and then got it so accurate, like poetically.\n\n1:16:56.080 --> 1:16:58.880\n And the facts that you need to get accurate,\n\n1:16:58.880 --> 1:17:01.120\n he got accurate, just the spirit of it\n\n1:17:01.120 --> 1:17:03.760\n down to like the bowls that pets use,\n\n1:17:03.760 --> 1:17:05.080\n just the whole feel of it.\n\n1:17:05.080 --> 1:17:05.920\n It was incredible.\n\n1:17:05.920 --> 1:17:07.480\n It was good, yeah, I saw the series.\n\n1:17:07.480 --> 1:17:08.640\n Yeah, it's incredible.\n\n1:17:08.640 --> 1:17:10.920\n It's made me wish that somebody did a good,\n\n1:17:10.920 --> 1:17:15.920\n like 1930s, like starvation that Stalin led to,\n\n1:17:17.880 --> 1:17:20.160\n like leading up to World War II\n\n1:17:20.160 --> 1:17:23.680\n and in World War II itself, like Stalingrad and so on.\n\n1:17:23.680 --> 1:17:27.520\n Like, I feel like that story needs to be told.\n\n1:17:27.520 --> 1:17:30.080\n Millions of people died.\n\n1:17:30.080 --> 1:17:32.800\n And to me, it's so much more fascinating than Hitler\n\n1:17:32.800 --> 1:17:37.560\n because Hitler is like a caricature of evil almost\n\n1:17:37.560 --> 1:17:41.800\n that it's so, especially with the Holocaust,\n\n1:17:41.800 --> 1:17:45.520\n it's so difficult to imagine that something like that\n\n1:17:45.520 --> 1:17:47.520\n is possible ever again.\n\n1:17:47.520 --> 1:17:52.520\n Stalin to me represents something that is possible.\n\n1:17:52.720 --> 1:17:56.720\n Like the so interesting, like the bureaucracy of it\n\n1:17:56.720 --> 1:18:01.200\n is so fascinating that it potentially might be happening\n\n1:18:01.200 --> 1:18:03.200\n in the world now, like that we're not aware of,\n\n1:18:03.200 --> 1:18:06.120\n like with North Korea, another one that,\n\n1:18:06.120 --> 1:18:08.240\n like there should be a good film on.\n\n1:18:08.240 --> 1:18:10.640\n And like the possible things that could be happening\n\n1:18:10.640 --> 1:18:13.080\n in China with overreach of government.\n\n1:18:13.080 --> 1:18:15.600\n I don't know, there's a lot of possibilities there.\n\n1:18:15.600 --> 1:18:16.440\n I suppose.\n\n1:18:16.440 --> 1:18:18.320\n Yeah, I wonder how much, you know,\n\n1:18:18.320 --> 1:18:20.440\n I guess the archives should be maybe more open nowadays,\n\n1:18:20.440 --> 1:18:22.960\n right, I mean, for a long time, they just, we didn't know,\n\n1:18:22.960 --> 1:18:25.920\n right, or anyways, no one in the West knew for sure.\n\n1:18:25.920 --> 1:18:27.560\n Well, there's a, I don't know if you know him,\n\n1:18:27.560 --> 1:18:29.440\n there's a guy named Stephen Kotkin.\n\n1:18:29.440 --> 1:18:33.080\n He is a historian of Stalin that I spoke to on this podcast.\n\n1:18:33.080 --> 1:18:34.760\n I'll speak to him again.\n\n1:18:34.760 --> 1:18:38.040\n The guy knows his shit on Stalin.\n\n1:18:38.040 --> 1:18:43.040\n He like read everything and it's so fascinating\n\n1:18:44.160 --> 1:18:49.160\n to talk to somebody, like he knows Stalin better\n\n1:18:50.280 --> 1:18:53.000\n than Stalin himself, it's crazy.\n\n1:18:53.000 --> 1:18:55.440\n Like you have, so he's, I think he's a Princeton,\n\n1:18:55.440 --> 1:18:58.840\n he is basically, his whole life is Stalin.\n\n1:18:58.840 --> 1:18:59.760\n Fighting Stalin.\n\n1:18:59.760 --> 1:19:00.920\n Yeah, it's great.\n\n1:19:00.920 --> 1:19:03.640\n And in that context, he also talks about\n\n1:19:03.640 --> 1:19:06.040\n and writes about Putin a little bit.\n\n1:19:06.040 --> 1:19:07.880\n I've also read at this point,\n\n1:19:07.880 --> 1:19:12.360\n I think every biography of Putin, English biography of Putin,\n\n1:19:12.360 --> 1:19:14.000\n I need to read some Russians.\n\n1:19:14.000 --> 1:19:15.400\n Obviously, I'm mentally preparing\n\n1:19:15.400 --> 1:19:17.000\n for a possible conversation with Putin.\n\n1:19:17.000 --> 1:19:19.400\n So what is your first question to Putin\n\n1:19:19.400 --> 1:19:22.480\n when you have him on the podcast?\n\n1:19:22.480 --> 1:19:26.400\n I, it's interesting you bring that up.\n\n1:19:26.400 --> 1:19:27.920\n First of all, I wouldn't tell you, but.\n\n1:19:27.920 --> 1:19:30.680\n You can't give it away now.\n\n1:19:30.680 --> 1:19:34.360\n But I actually haven't even thought about that.\n\n1:19:34.360 --> 1:19:38.760\n So my current approach, and I do this with interviews often,\n\n1:19:38.760 --> 1:19:40.160\n obviously that's a special one,\n\n1:19:40.160 --> 1:19:44.240\n but I try not to think about questions until last minute.\n\n1:19:45.120 --> 1:19:48.640\n I'm trying to sort of get into the mindset.\n\n1:19:50.000 --> 1:19:52.280\n And so that's why I'm soaking in a lot of stuff,\n\n1:19:52.280 --> 1:19:56.120\n not thinking about questions, just learning about the man.\n\n1:19:56.120 --> 1:19:59.680\n But in terms of like human to human,\n\n1:19:59.680 --> 1:20:01.360\n it's like, I would say it's,\n\n1:20:01.360 --> 1:20:03.440\n I don't know if you're a fan of mob movies,\n\n1:20:03.440 --> 1:20:07.000\n but like the mafia, which I am, like Goodfellas and so on,\n\n1:20:07.000 --> 1:20:11.960\n he's much closer to like mob morality, which is like.\n\n1:20:11.960 --> 1:20:14.000\n Mob morality, maybe, I could see that.\n\n1:20:14.000 --> 1:20:16.600\n But I like your approach anyways of this,\n\n1:20:16.600 --> 1:20:18.160\n the extreme empathy, right?\n\n1:20:18.160 --> 1:20:21.360\n It's a little bit like Hannibal, right?\n\n1:20:21.360 --> 1:20:22.960\n Like if you ever watched the show Hannibal, right?\n\n1:20:22.960 --> 1:20:27.560\n They had that guy, well, you know Hannibal of course, like.\n\n1:20:27.560 --> 1:20:30.200\n Yeah, Silence of the Lambs.\n\n1:20:30.200 --> 1:20:31.760\n But there were those TV shows as well,\n\n1:20:31.760 --> 1:20:34.040\n and they focused on this guy, Will Durant,\n\n1:20:34.040 --> 1:20:36.240\n who's a character like extreme empath, right?\n\n1:20:36.240 --> 1:20:38.120\n So in the way he like catches all these killers,\n\n1:20:38.120 --> 1:20:42.520\n as he pretty much, he can empathize with them, right?\n\n1:20:42.520 --> 1:20:44.080\n Like he can understand why they're doing\n\n1:20:44.080 --> 1:20:45.560\n the things they're doing, right?\n\n1:20:45.560 --> 1:20:48.160\n It's a pretty excruciating thing, right?\n\n1:20:48.160 --> 1:20:49.760\n Like, because you're pretty much like spending\n\n1:20:49.760 --> 1:20:52.360\n half your time in the head of evil people, right?\n\n1:20:52.360 --> 1:20:54.200\n Like, but.\n\n1:20:54.200 --> 1:20:57.040\n I mean, I definitely try to do that with others.\n\n1:20:57.040 --> 1:20:59.080\n So you should do that in moderation,\n\n1:20:59.080 --> 1:21:04.080\n but I think it's a pretty safe place, safe place to be.\n\n1:21:04.760 --> 1:21:06.480\n One of the cool things with this podcast,\n\n1:21:06.480 --> 1:21:08.760\n and I know you didn't sign up to hear me\n\n1:21:08.760 --> 1:21:10.160\n listen to this bullshit, but.\n\n1:21:10.160 --> 1:21:11.920\n That was interesting.\n\n1:21:11.920 --> 1:21:15.480\n I, and what's his name?\n\n1:21:15.480 --> 1:21:17.640\n Chris Latner, who's a Google,\n\n1:21:17.640 --> 1:21:19.120\n oh, he's not Google anymore, SciFi.\n\n1:21:19.120 --> 1:21:21.040\n He's legit, he's one of the most legit engineers\n\n1:21:21.040 --> 1:21:23.360\n I talk with, I talk with him again on this podcast.\n\n1:21:23.360 --> 1:21:27.200\n And one of the, he gives me private advice a lot.\n\n1:21:27.200 --> 1:21:31.240\n And he said for this podcast, I should like interview,\n\n1:21:31.240 --> 1:21:34.640\n like I should widen the range of people\n\n1:21:34.640 --> 1:21:38.200\n because that gives you much more freedom to do stuff.\n\n1:21:38.200 --> 1:21:41.560\n Like, so his idea, which I think I agree with Chris\n\n1:21:41.560 --> 1:21:44.040\n is that you go to the extremes.\n\n1:21:44.040 --> 1:21:46.080\n You just like cover every extreme base\n\n1:21:46.080 --> 1:21:48.200\n and then it gives you freedom to then go\n\n1:21:48.200 --> 1:21:50.440\n to the more nuanced conversations.\n\n1:21:50.440 --> 1:21:53.920\n And it's kind of, I think there's a safe place for that.\n\n1:21:53.920 --> 1:21:56.640\n There's certainly a hunger for that nuanced conversation,\n\n1:21:56.640 --> 1:22:00.400\n I think, amongst people where like on social media,\n\n1:22:00.400 --> 1:22:04.040\n you get canceled for anything slightly tense,\n\n1:22:04.040 --> 1:22:06.040\n that there's a hunger to go full.\n\n1:22:06.040 --> 1:22:08.360\n Right, you go so far to the opposite side.\n\n1:22:08.360 --> 1:22:10.720\n And that's like demystifies it a little bit, right?\n\n1:22:10.720 --> 1:22:11.560\n Yeah, that's.\n\n1:22:11.560 --> 1:22:15.080\n There is a person behind all of these things.\n\n1:22:15.080 --> 1:22:17.280\n And that's the cool thing about podcasting,\n\n1:22:17.280 --> 1:22:19.280\n like three, four hour conversations\n\n1:22:19.280 --> 1:22:24.120\n that it's very different than a clickbait journalism,\n\n1:22:24.120 --> 1:22:26.680\n it's like the opposite, that there's a hunger for that.\n\n1:22:26.680 --> 1:22:28.040\n There's a willingness for that.\n\n1:22:28.040 --> 1:22:29.440\n Yeah, especially now, I mean,\n\n1:22:29.440 --> 1:22:31.840\n how many people do you even see face to face anymore?\n\n1:22:31.840 --> 1:22:33.320\n Right, like this, you know?\n\n1:22:33.320 --> 1:22:36.080\n It's like not that many people like in my day today,\n\n1:22:36.080 --> 1:22:39.240\n aside from my own family that like I sit across.\n\n1:22:39.240 --> 1:22:41.520\n It's sad, but it's also beautiful.\n\n1:22:41.520 --> 1:22:44.200\n Like I've gotten the chance to like,\n\n1:22:44.200 --> 1:22:47.080\n like our conversation now, there's somebody,\n\n1:22:47.080 --> 1:22:50.000\n I guarantee you there's somebody in Russia\n\n1:22:50.000 --> 1:22:52.240\n listening to this now, like jogging.\n\n1:22:52.240 --> 1:22:55.280\n There's somebody who is just smoked some weed,\n\n1:22:55.280 --> 1:22:58.440\n sit back on a couch and just like enjoying.\n\n1:22:58.440 --> 1:23:00.720\n I guarantee you that we'll write in the comments right now\n\n1:23:00.720 --> 1:23:05.000\n that yes, I'm in St. Petersburg, I'm in Moscow, whatever.\n\n1:23:05.000 --> 1:23:10.000\n And we're in their head and they have a friendship with us.\n\n1:23:10.960 --> 1:23:13.280\n I'm the same way, I'm a huge fan of podcasting.\n\n1:23:14.520 --> 1:23:15.560\n It's a beautiful thing.\n\n1:23:15.560 --> 1:23:18.160\n I mean, it's a weird one way human connection.\n\n1:23:18.160 --> 1:23:22.200\n Like before I went on Joe Rogan and still,\n\n1:23:22.200 --> 1:23:24.120\n I'm just a huge fan of his.\n\n1:23:24.120 --> 1:23:25.760\n So it was like surreal.\n\n1:23:25.760 --> 1:23:28.960\n I've been friends with Joe Rogan for 10 years, but one way.\n\n1:23:28.960 --> 1:23:31.760\n Yeah, from this way, from the St. Petersburg way.\n\n1:23:31.760 --> 1:23:34.960\n Yeah, the St. Petersburg way and it's a real friendship.\n\n1:23:34.960 --> 1:23:38.760\n I mean, now it's like two way, but it's still surreal.\n\n1:23:38.760 --> 1:23:40.480\n And that's the magic of podcasting.\n\n1:23:40.480 --> 1:23:42.040\n I'm not sure what to make of it.\n\n1:23:42.040 --> 1:23:45.320\n That voice, it's not even the video part.\n\n1:23:45.320 --> 1:23:48.560\n It's the audio that's magical.\n\n1:23:48.560 --> 1:23:50.200\n I don't know what to do with it,\n\n1:23:50.200 --> 1:23:53.080\n but it's people listen to three, four hours.\n\n1:23:53.080 --> 1:23:57.440\n Yeah, we evolved over millions of years, right?\n\n1:23:57.440 --> 1:24:00.480\n To be very fine tuned to things like that, right?\n\n1:24:00.480 --> 1:24:02.520\n Oh, expressions as well, of course, right?\n\n1:24:02.520 --> 1:24:06.960\n But back in the day on the Savannah,\n\n1:24:06.960 --> 1:24:09.360\n you had to be very attuned to whether\n\n1:24:09.360 --> 1:24:11.840\n you had a good relationship with the rest of your tribe\n\n1:24:11.840 --> 1:24:13.440\n or a very bad relationship, right?\n\n1:24:13.440 --> 1:24:15.160\n Because if you had a very bad relationship,\n\n1:24:15.160 --> 1:24:17.400\n you were probably gonna be left behind\n\n1:24:17.400 --> 1:24:18.800\n and eaten by the lions.\n\n1:24:18.800 --> 1:24:22.600\n Yeah, but it's weird that the tribe is different now.\n\n1:24:22.600 --> 1:24:26.040\n Like you could have a one way connection with Joe Rogan\n\n1:24:26.040 --> 1:24:30.520\n as opposed to the tribe of your physical vicinity.\n\n1:24:30.520 --> 1:24:33.280\n But that's why it works with the podcasting,\n\n1:24:33.280 --> 1:24:35.960\n but it's the opposite of what happens on Twitter, right?\n\n1:24:35.960 --> 1:24:38.080\n Because all those nuances are removed, right?\n\n1:24:38.080 --> 1:24:40.760\n You're not connecting with the person\n\n1:24:40.760 --> 1:24:42.720\n because you don't hear the voice.\n\n1:24:42.720 --> 1:24:44.400\n You're connecting with like an abstraction, right?\n\n1:24:44.400 --> 1:24:48.400\n It's like some stream of tweets, right?\n\n1:24:48.400 --> 1:24:52.560\n And it's very easy to assign to them\n\n1:24:52.560 --> 1:24:56.720\n any kind of evil intent or dehumanize them,\n\n1:24:56.720 --> 1:24:59.120\n which it's much harder to do when it's a real voice, right?\n\n1:24:59.120 --> 1:25:02.720\n Because you realize it's a real person behind the voice.\n\n1:25:02.720 --> 1:25:05.000\n Let me try this out on you.\n\n1:25:05.000 --> 1:25:07.160\n I sometimes ask about the meaning of life.\n\n1:25:07.160 --> 1:25:12.160\n Do you, your father now, an engineer,\n\n1:25:12.320 --> 1:25:14.040\n you're building up a company.\n\n1:25:14.040 --> 1:25:16.840\n Do you ever zoom out and think like,\n\n1:25:16.840 --> 1:25:19.360\n what the hell is this whole thing for?\n\n1:25:19.360 --> 1:25:24.000\n Like why are we descended to vapes even on this planet?\n\n1:25:24.000 --> 1:25:26.120\n What's the meaning of it all?\n\n1:25:26.120 --> 1:25:28.120\n That's a pretty big question.\n\n1:25:29.320 --> 1:25:32.240\n I think I don't allow myself to think about it too often,\n\n1:25:32.240 --> 1:25:34.320\n or maybe like life doesn't allow me\n\n1:25:34.320 --> 1:25:35.800\n to think about it too often.\n\n1:25:36.720 --> 1:25:39.080\n But in some ways, I guess the meaning of life\n\n1:25:39.080 --> 1:25:44.040\n is kind of contributing to this kind of weird thing\n\n1:25:44.040 --> 1:25:45.320\n we call humanity, right?\n\n1:25:45.320 --> 1:25:47.640\n Like it's in a way, you can think of humanity\n\n1:25:47.640 --> 1:25:50.200\n as like a living and evolving organism, right?\n\n1:25:50.200 --> 1:25:52.560\n That like we all contributing in a sway way,\n\n1:25:52.560 --> 1:25:55.640\n but just by existing, by having our own unique set\n\n1:25:55.640 --> 1:25:57.320\n of desires and drives, right?\n\n1:25:58.560 --> 1:26:01.640\n And maybe that means like creating something great.\n\n1:26:01.640 --> 1:26:06.200\n And it's bringing up kids who are unique and different\n\n1:26:06.200 --> 1:26:09.680\n and seeing like, they can join what they do.\n\n1:26:09.680 --> 1:26:11.040\n But I mean, to me, that's pretty much it.\n\n1:26:11.040 --> 1:26:13.160\n I mean, if you're not a religious person, right?\n\n1:26:13.160 --> 1:26:16.400\n Which I guess I'm not, that's the meaning of life.\n\n1:26:16.400 --> 1:26:20.880\n It's in the living and in the creation.\n\n1:26:20.880 --> 1:26:22.400\n Yeah, there's something magical\n\n1:26:22.400 --> 1:26:24.160\n about that engine of creation.\n\n1:26:24.160 --> 1:26:27.240\n Like you said, programming, I would say,\n\n1:26:27.240 --> 1:26:29.400\n I mean, it's even just actually what you said\n\n1:26:29.400 --> 1:26:30.520\n with even just programs.\n\n1:26:30.520 --> 1:26:32.760\n I don't care if it's like some JavaScript thing\n\n1:26:32.760 --> 1:26:36.000\n on a button on the website.\n\n1:26:36.000 --> 1:26:38.960\n It's like magical that you brought that to life.\n\n1:26:38.960 --> 1:26:41.520\n I don't know what that is in there, but that seems,\n\n1:26:41.520 --> 1:26:46.520\n that's probably some version of like reproduction\n\n1:26:47.200 --> 1:26:49.760\n and sex, whatever that's in evolution.\n\n1:26:49.760 --> 1:26:54.760\n But like creating that HTML button has echoes\n\n1:26:55.600 --> 1:26:57.760\n of that feeling and it's magical.\n\n1:26:58.880 --> 1:27:00.640\n Right, well, I mean, if you're a religious person,\n\n1:27:00.640 --> 1:27:01.720\n maybe you could even say, all right,\n\n1:27:01.720 --> 1:27:04.360\n like we were created in God's image, right?\n\n1:27:04.360 --> 1:27:07.240\n Well, I mean, I guess part of that is the drive\n\n1:27:07.240 --> 1:27:09.200\n to create something ourselves, right?\n\n1:27:09.200 --> 1:27:11.760\n I mean, that's part of it.\n\n1:27:11.760 --> 1:27:15.800\n Yeah, that HTML button is the creation in God's image.\n\n1:27:15.800 --> 1:27:18.880\n Maybe hopefully it'll be something a little more.\n\n1:27:18.880 --> 1:27:20.960\n So dynamic, maybe some JavaScript.\n\n1:27:20.960 --> 1:27:25.400\n Yeah, maybe some JavaScript, some React and so on.\n\n1:27:25.400 --> 1:27:29.400\n But no, I mean, I think that's what differentiates us\n\n1:27:29.400 --> 1:27:32.160\n from the apes, so to speak.\n\n1:27:32.160 --> 1:27:34.240\n Yeah, we did a pretty good job.\n\n1:27:34.240 --> 1:27:36.960\n Dan, it was an honor to talk to you.\n\n1:27:36.960 --> 1:27:38.760\n Thank you so much for being part of creating\n\n1:27:38.760 --> 1:27:42.000\n one of my favorite services and products.\n\n1:27:42.000 --> 1:27:45.040\n This is actually a little bit of an experiment.\n\n1:27:45.040 --> 1:27:49.840\n Allow me to sort of fanboy over some of the things I love.\n\n1:27:49.840 --> 1:27:52.280\n So thanks for wasting your time with me today.\n\n1:27:52.280 --> 1:27:53.120\n It was really fun.\n\n1:27:53.120 --> 1:27:53.960\n Well, it was awesome.\n\n1:27:53.960 --> 1:27:55.520\n Thanks for having me on and giving me a chance\n\n1:27:55.520 --> 1:27:57.200\n to try this out.\n\n1:27:57.200 --> 1:27:58.040\n Awesome.\n\n1:27:59.360 --> 1:28:00.720\n Thanks for listening to this conversation\n\n1:28:00.720 --> 1:28:03.560\n with Dan Kokotov and thank you to our sponsors,\n\n1:28:03.560 --> 1:28:06.200\n Athletic Greens, Only One Nutrition Drink,\n\n1:28:06.200 --> 1:28:09.080\n Blinkist app that summarizes books,\n\n1:28:09.080 --> 1:28:13.040\n Business Wars podcast and Cash App.\n\n1:28:13.040 --> 1:28:16.800\n So the choice is health, wisdom or money.\n\n1:28:16.800 --> 1:28:18.320\n Choose wisely, my friends.\n\n1:28:18.320 --> 1:28:21.920\n And if you wish, click the sponsor links below\n\n1:28:21.920 --> 1:28:25.280\n to get a discount and to support this podcast.\n\n1:28:25.280 --> 1:28:27.320\n And now let me leave you with some words\n\n1:28:27.320 --> 1:28:29.840\n from Ludwig Wittgenstein.\n\n1:28:29.840 --> 1:28:33.720\n The limits of my language means the limits of my world.\n\n1:28:33.720 --> 1:29:00.720\n Thank you for listening and hope to see you next time.\n\n"
}