{
  "title": "Albert Bourla: Pfizer CEO | Lex Fridman Podcast #249",
  "id": "Z_LhPMhkEdw",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.600\n The following is a conversation with Albert Berla, CEO of Pfizer.\n\n00:04.600 --> 00:09.840\n If you'd like to skip ahead to our conversation, the timestamps as always are below.\n\n00:09.840 --> 00:15.560\n But if not, please allow me to say a few words about truth and human nature.\n\n00:15.560 --> 00:21.880\n Specifically, about two groups of people throughout history that seek to lay claim to the truth.\n\n00:21.880 --> 00:25.760\n The first group will tell you that only they possess the truth,\n\n00:25.760 --> 00:32.840\n and that the government will save you, the company will save you, the science, the authorities, the experts, the institutions will save you.\n\n00:32.840 --> 00:37.360\n The second group, too, will tell you that only they possess the truth,\n\n00:37.360 --> 00:44.520\n and that the government will hurt you, the company will hurt you, the science, the authorities, the experts, the institutions will hurt you.\n\n00:44.520 --> 00:50.680\n Both groups have the benevolent and the malevolent, their heroes and their charlatans.\n\n00:50.680 --> 00:57.720\n And I think the hard truth is that no one in this world can tell you with absolute certainty which is which.\n\n00:57.720 --> 00:59.640\n You have to use your mind.\n\n00:59.640 --> 01:03.800\n This is the burden of being human, of being free.\n\n01:03.800 --> 01:11.440\n Don't blindly follow any leader, neither the emperor nor the martyr who points out that the emperor has no clothes.\n\n01:11.440 --> 01:14.720\n And then there's the lessons of history.\n\n01:14.720 --> 01:19.400\n Vaccines have saved hundreds of millions of lives in the past century,\n\n01:19.400 --> 01:23.320\n and in general, the advance of medicine has saved billions of lives.\n\n01:23.320 --> 01:28.320\n If you ignore the power of science, you're not being honest with the lessons of history.\n\n01:28.320 --> 01:33.040\n And if you ignore the corrupting nature of power and money within institutions,\n\n01:33.040 --> 01:39.840\n including governments and companies that led to the suffering and death of hundreds of millions in the past century,\n\n01:39.840 --> 01:45.040\n you are once again not being honest with the lessons of history.\n\n01:45.040 --> 01:52.080\n I announced that I will be having this conversation with Albert Burla, Pfizer CEO, and a lot of people wrote to me.\n\n01:52.080 --> 01:59.920\n I would like to say that I was and am and always will be listening and learning with an open mind from everyone.\n\n01:59.920 --> 02:08.720\n My own opinion, worth little as it is, is that the development of the COVID vaccines is one of the greatest accomplishments of science in recent history.\n\n02:08.720 --> 02:13.080\n For the rest, from safety and efficacy to policy and economics,\n\n02:13.080 --> 02:18.240\n I stand humbled before a complicated world full of fear and anger.\n\n02:18.240 --> 02:24.800\n A small number of malicious people from all walks of life will use that fear and anger to divide us,\n\n02:24.800 --> 02:29.120\n because the division makes them money and gives them power.\n\n02:29.120 --> 02:31.280\n I took two shots of the Pfizer vaccine.\n\n02:31.280 --> 02:32.840\n This was my decision.\n\n02:32.840 --> 02:39.200\n I don't ever want to force this on anyone, and I certainly don't want to dismiss your concerns or worse,\n\n02:39.200 --> 02:43.120\n you as a person if you choose not to get vaccinated.\n\n02:43.120 --> 02:47.920\n I can assure you one thing, in this conversation, and in any conversation,\n\n02:47.920 --> 02:52.520\n the choice of questions I ask and words I say is mine and mine alone.\n\n02:52.520 --> 03:00.320\n When my words fall short, as they often do, it is only because of the limitations of my mind and of my speaking ability.\n\n03:00.320 --> 03:03.200\n It is not due to pressure or fear.\n\n03:03.200 --> 03:05.200\n I'm not afraid of anyone.\n\n03:05.200 --> 03:09.000\n I cannot be bought by anyone with money, power, or fame.\n\n03:09.000 --> 03:13.520\n I hope to prove this to you and to myself in the coming years.\n\n03:13.520 --> 03:19.160\n This life is short, and to me, without integrity, it is not worth living.\n\n03:19.160 --> 03:22.720\n People sometimes talk down to me, call me naive.\n\n03:22.720 --> 03:26.760\n Perhaps they are right, but it is who I am.\n\n03:26.760 --> 03:32.480\n I think this life, this world, this, our human civilization is beautiful.\n\n03:32.480 --> 03:37.560\n And as Dostoevsky said, beauty will save the world.\n\n03:37.560 --> 03:43.800\n This is the Lex Friedman Podcast, and here's my conversation with Albert Borla.\n\n03:43.800 --> 03:50.880\n The development of the COVID 19 vaccine was one of the greatest accomplishments of science in recent history.\n\n03:50.880 --> 03:54.360\n No matter what, this should give people hope for the future.\n\n03:54.360 --> 03:57.640\n And yet, it is more of a source of division.\n\n03:57.640 --> 04:02.560\n I hope we can discuss both the inspiring and the difficult ideas in this conversation\n\n04:02.560 --> 04:06.440\n so that we can do our small part in healing this division.\n\n04:06.440 --> 04:07.720\n I hope so.\n\n04:07.720 --> 04:10.080\n Take me through the day of November 8th, 2020,\n\n04:10.080 --> 04:14.880\n when the Pfizer team were waiting for the results of the phase three clinical trials.\n\n04:14.880 --> 04:20.440\n We had assembled in a very small office that we are having in Connecticut, very few people.\n\n04:20.440 --> 04:22.320\n There were five, I think.\n\n04:22.320 --> 04:28.640\n And in another place, what we call the Data Monitoring Committee,\n\n04:28.640 --> 04:32.240\n which is a group of experts, independent experts, they're on Pfizer,\n\n04:32.240 --> 04:36.920\n we're going to have the opportunity to unblind the data\n\n04:36.920 --> 04:44.160\n and then tell us if the study needs to continue or if it is successful or if it fails.\n\n04:44.160 --> 04:45.920\n And we were waiting for their call.\n\n04:45.920 --> 04:49.600\n So the call came a little bit later than what we expected,\n\n04:49.600 --> 04:55.160\n which created a lot of anxiety to all of us, but came around, I think, two o clock.\n\n04:55.160 --> 04:57.600\n You're just sitting there waiting? What were you feeling?\n\n04:57.600 --> 05:04.480\n Sitting there waiting and teasing one another, drinking coffee, making jokes.\n\n05:04.480 --> 05:11.360\n So how did you feel like when you heard the results, the successful results?\n\n05:11.360 --> 05:16.080\n Free, liberated, happy.\n\n05:16.080 --> 05:23.280\n Like if a huge weight that was on my shoulders was lifted.\n\n05:23.280 --> 05:27.840\n I heard you said, I love you to the team.\n\n05:27.840 --> 05:33.000\n I did. This is how we speak in Mediterranean.\n\n05:33.000 --> 05:35.400\n Listen, maybe it's the Russian thing too.\n\n05:35.400 --> 05:41.200\n I love love, so I appreciate that kind of celebration.\n\n05:41.200 --> 05:43.560\n So looking back from that moment to before,\n\n05:43.560 --> 05:48.040\n how much did it cost to develop the Pfizer BioNTech vaccine?\n\n05:48.040 --> 05:51.680\n What was it like making the decision to make that investment\n\n05:51.680 --> 05:56.200\n when the risk is very high and you don't know if it's going to be successful?\n\n05:56.200 --> 05:58.120\n You know, we do a lot of that anyway.\n\n05:58.120 --> 06:00.800\n This is what we do in our daily work.\n\n06:00.800 --> 06:02.880\n We are putting money.\n\n06:02.880 --> 06:05.840\n We are investing in research, which is highly risky.\n\n06:05.840 --> 06:09.240\n The difference in that case was that we didn't risk at all.\n\n06:09.240 --> 06:10.880\n We put it all in.\n\n06:10.880 --> 06:15.640\n We put everything in one go so that we don't lose time.\n\n06:15.640 --> 06:17.600\n Usually, we will spend 50 millions.\n\n06:17.600 --> 06:20.400\n And then if that goes well, then we will spend another 50.\n\n06:20.400 --> 06:22.240\n And then if it goes well, then 100.\n\n06:22.240 --> 06:28.720\n Here, we put all together a little bit more than $2 billion, $2.3 billion.\n\n06:28.720 --> 06:33.680\n And it was a significant decision.\n\n06:33.680 --> 06:38.120\n But it was a very easy decision to make in the context of what\n\n06:38.120 --> 06:39.680\n we were living at that time.\n\n06:39.680 --> 06:41.080\n It was a pandemic.\n\n06:41.080 --> 06:42.080\n People were scared.\n\n06:42.080 --> 06:42.960\n We were scared.\n\n06:42.960 --> 06:46.440\n We didn't know how tomorrow would look like.\n\n06:46.440 --> 06:49.120\n We were living unprecedented situations.\n\n06:49.120 --> 06:54.280\n And we knew that we have capabilities that may help.\n\n06:54.280 --> 06:57.600\n So there was not a second question or choice.\n\n06:57.600 --> 06:59.120\n We go all in.\n\n06:59.120 --> 07:02.160\n When you make decisions like that, you're\n\n07:02.160 --> 07:08.000\n the CEO of a company that needs to make money\n\n07:08.000 --> 07:12.680\n and that hopes to do a lot of good in the world.\n\n07:12.680 --> 07:17.360\n How much of both of those things are part of the calculation?\n\n07:17.360 --> 07:21.560\n So when you said it was an obvious choice,\n\n07:21.560 --> 07:25.840\n I think you've said a bunch of things of the kind of saying\n\n07:25.840 --> 07:31.320\n we need to go all in, sort of very boldly diving in.\n\n07:31.320 --> 07:37.240\n How much was that the world is facing uncertainty and fear\n\n07:37.240 --> 07:40.960\n and potentially destructive pandemic in the early days,\n\n07:40.960 --> 07:43.440\n just when you're seeing the full uncertainty before us,\n\n07:43.440 --> 07:45.240\n don't know how it's going to unroll?\n\n07:45.240 --> 07:48.320\n And how much of it is this may also\n\n07:48.320 --> 07:51.000\n be a good financial decision to take this risk?\n\n07:51.000 --> 07:53.240\n Yeah, I think about it all the time.\n\n07:53.240 --> 07:56.880\n And I know very well that if you focus too much on making money,\n\n07:56.880 --> 07:58.440\n you will never make.\n\n07:58.440 --> 08:02.760\n You should focus in what is the real value driver.\n\n08:02.760 --> 08:07.080\n And the real value driver, it is to make breakthroughs\n\n08:07.080 --> 08:08.880\n that change patients lives.\n\n08:08.880 --> 08:11.360\n If you don't do that, you will never make money.\n\n08:11.360 --> 08:13.320\n If you do that, don't worry.\n\n08:13.320 --> 08:16.440\n Things will fall into place, and also money will follow.\n\n08:16.440 --> 08:18.600\n But the mentality of the company is\n\n08:18.600 --> 08:19.920\n to be how to help the patient.\n\n08:19.920 --> 08:23.160\n And that's what the management was that the shareholders want,\n\n08:23.160 --> 08:26.360\n because that's the only way that we can create value.\n\n08:26.360 --> 08:28.240\n In this particular case, we're not\n\n08:28.240 --> 08:31.120\n thinking at all about what are we\n\n08:31.120 --> 08:34.760\n going to make when we sell it or if we don't sell it.\n\n08:34.760 --> 08:37.680\n Because what we were focusing 100%\n\n08:37.680 --> 08:40.520\n was how to bring a solution to the world that\n\n08:40.520 --> 08:44.400\n will help all of us change the fear that\n\n08:44.400 --> 08:46.440\n was bringing hope to the world.\n\n08:46.440 --> 08:49.760\n And as always, when you do that, you\n\n08:49.760 --> 08:53.400\n will have good returns as well.\n\n08:53.400 --> 08:55.840\n On a philosophical level, on a human level,\n\n08:55.840 --> 08:58.520\n do you ever worry that the pressure\n\n08:58.520 --> 09:01.400\n to cover the costs that were invested,\n\n09:01.400 --> 09:05.080\n to develop a new drug, to develop this vaccine,\n\n09:05.080 --> 09:08.560\n harms your ability to conduct unbiased studies?\n\n09:08.560 --> 09:12.840\n Not at all, because the studies are highly regulated.\n\n09:12.840 --> 09:15.720\n Everybody knows what regulators, and when\n\n09:15.720 --> 09:20.560\n I say regulators, FDA, European authorities, UK authorities,\n\n09:20.560 --> 09:22.800\n Israeli authorities, Japanese authorities, Canadian\n\n09:22.800 --> 09:27.360\n authorities, want to see how the study needs to be conducted\n\n09:27.360 --> 09:30.200\n and what exactly they need to see to approve it or not.\n\n09:30.200 --> 09:34.400\n So clearly, everybody takes into consideration\n\n09:34.400 --> 09:35.840\n how much money I'm going to invest\n\n09:35.840 --> 09:38.960\n and what is the chances that I'm going to lose them.\n\n09:38.960 --> 09:42.680\n But what you can do is to change the rules of the game\n\n09:42.680 --> 09:44.680\n so that you won't lose the money.\n\n09:44.680 --> 09:47.960\n There are very well established methodologies\n\n09:47.960 --> 09:50.960\n that would say with very high precision\n\n09:50.960 --> 09:54.800\n if your medicine is effective, if your medicine is safe.\n\n09:54.800 --> 09:57.320\n And those are there for all and are\n\n09:57.320 --> 09:59.720\n playing with the same rules.\n\n09:59.720 --> 10:02.000\n Do you have an intuition about why\n\n10:02.000 --> 10:07.480\n is the FDA trying to get 75 years to release the Pfizer\n\n10:07.480 --> 10:08.040\n data?\n\n10:08.040 --> 10:10.160\n They're trying to request that it will not\n\n10:10.160 --> 10:12.400\n be released for 75 years.\n\n10:12.400 --> 10:16.120\n And then maybe the broader version of that question\n\n10:16.120 --> 10:18.720\n is do you think people should have\n\n10:18.720 --> 10:22.760\n sort of full transparency and immediate access to the data,\n\n10:22.760 --> 10:27.240\n immediate on the scale of weeks, not years?\n\n10:27.240 --> 10:30.240\n I think the relations with regulators,\n\n10:30.240 --> 10:32.120\n they have been always very transparent.\n\n10:32.120 --> 10:35.320\n And there are a lot of laws that they\n\n10:35.320 --> 10:40.320\n are forcing regulators and companies\n\n10:40.320 --> 10:44.720\n to put out their interactions and what exactly was discussed.\n\n10:44.720 --> 10:50.000\n Now, to go into specific details of some discussions,\n\n10:50.000 --> 10:52.120\n I don't know what is the reason that FDA\n\n10:52.120 --> 10:53.680\n wants to take the time.\n\n10:53.680 --> 10:56.760\n And I'm sure they have very good reasons.\n\n10:56.760 --> 10:59.760\n Well, let me just say my side of it.\n\n10:59.760 --> 11:01.720\n It doesn't look like a good reason.\n\n11:01.720 --> 11:04.920\n It looks like maybe it's because I come from the Soviet Union.\n\n11:04.920 --> 11:06.880\n Now, this is not you saying this.\n\n11:06.880 --> 11:10.200\n This is me saying this.\n\n11:10.200 --> 11:11.880\n There seems to be a bureaucracy that\n\n11:11.880 --> 11:13.400\n gets in the way of transparency.\n\n11:13.400 --> 11:15.280\n That's always the challenge with government.\n\n11:15.280 --> 11:17.960\n So government is very good at setting rules and making\n\n11:17.960 --> 11:21.360\n sure there's oversight of companies and people and so on.\n\n11:21.360 --> 11:24.120\n But they create, they slow things down,\n\n11:24.120 --> 11:26.240\n which is a feature and a bug.\n\n11:26.240 --> 11:29.120\n And in this case, they slow down so much.\n\n11:29.120 --> 11:31.680\n I think the reason they set it at 75 years\n\n11:31.680 --> 11:34.440\n is because they set a rate of being\n\n11:34.440 --> 11:37.360\n able to only review 500 pages of data a day\n\n11:37.360 --> 11:38.640\n or something like that.\n\n11:38.640 --> 11:41.360\n And that's a very kind of bureaucratic thing,\n\n11:41.360 --> 11:44.840\n where in reality, you could just show the data.\n\n11:44.840 --> 11:47.480\n And it's not like something is being hidden.\n\n11:47.480 --> 11:50.200\n But in the battle to win people's trust,\n\n11:50.200 --> 11:52.240\n to inspire them with science, it feels\n\n11:52.240 --> 11:55.080\n like transparency is one of the most beautiful things, one\n\n11:55.080 --> 11:57.640\n of the most powerful things that the FDA has.\n\n11:57.640 --> 12:01.320\n FDA has the potential to be one of the great institutions\n\n12:01.320 --> 12:02.400\n of our country.\n\n12:02.400 --> 12:06.600\n And this is one example that it feels, to me, like a failure.\n\n12:06.600 --> 12:08.440\n So in your perspective, you're saying,\n\n12:08.440 --> 12:10.200\n I'm sure they have a good reason.\n\n12:10.200 --> 12:13.360\n So to you, the FDA is this black box\n\n12:13.360 --> 12:17.400\n that you submit things to once they approve.\n\n12:17.400 --> 12:20.080\n You know that those are the rules.\n\n12:20.080 --> 12:21.120\n It's approved.\n\n12:21.120 --> 12:21.880\n That's it.\n\n12:21.880 --> 12:24.360\n But this is not a black box.\n\n12:24.360 --> 12:28.080\n We know very well what is the process.\n\n12:28.080 --> 12:30.920\n Everybody knows very well what are the processes.\n\n12:30.920 --> 12:35.720\n The review process also, it is very detailed.\n\n12:35.720 --> 12:38.320\n They have scientists of very, very high caliber.\n\n12:38.320 --> 12:40.360\n Not every regulator in the world,\n\n12:40.360 --> 12:45.000\n but the Europeans, the BRIDs, the FDA clearly,\n\n12:45.000 --> 12:47.080\n they have very, very high caliber of scientists\n\n12:47.080 --> 12:50.040\n that they are going into a lot of details.\n\n12:50.040 --> 12:55.040\n And also, basically everything for a study\n\n12:55.520 --> 13:00.040\n is really released by law in the specifications\n\n13:00.040 --> 13:02.560\n of the product, but it's a very detailed document\n\n13:02.560 --> 13:05.280\n that it is issued and has basically the essence\n\n13:05.280 --> 13:06.840\n of everything that was discussed.\n\n13:06.840 --> 13:10.520\n I don't know about specific documents\n\n13:10.520 --> 13:12.440\n if take them time to release,\n\n13:12.440 --> 13:15.960\n but clearly this is not a black box type of process.\n\n13:15.960 --> 13:19.120\n A lot of this stuff is how do you effectively communicate\n\n13:19.120 --> 13:22.520\n to the world about the incredible science that's been done,\n\n13:22.520 --> 13:24.640\n about the processes that were followed.\n\n13:24.640 --> 13:25.640\n I agree with you.\n\n13:25.640 --> 13:29.520\n And then sometimes it's just in eloquence in communication.\n\n13:29.520 --> 13:31.360\n It's not that there's a failure process.\n\n13:31.360 --> 13:34.400\n It's in eloquence of communication and silence.\n\n13:34.400 --> 13:37.120\n Silence in the moment when clearly a lot of people\n\n13:37.120 --> 13:40.120\n are bothered and have questions.\n\n13:40.120 --> 13:44.720\n This is when you speak out and you explain exactly why\n\n13:44.720 --> 13:48.960\n as opposed to letting the sort of distrust build up\n\n13:48.960 --> 13:51.800\n and linger because the result is there's a very large\n\n13:51.800 --> 13:54.140\n percentage of the population that just,\n\n13:56.340 --> 14:01.260\n I mean, it divides people and science suffers, I think.\n\n14:01.260 --> 14:04.700\n And also the effectiveness of solutions suffers\n\n14:04.700 --> 14:06.440\n like the vaccine and so on.\n\n14:08.560 --> 14:10.480\n I asked a few folks I know\n\n14:10.480 --> 14:12.680\n if they had challenging questions for you.\n\n14:12.680 --> 14:17.120\n I'm sure many of them answered your call.\n\n14:17.120 --> 14:21.160\n Yeah, many friendly folks out there.\n\n14:21.160 --> 14:24.800\n By the way, I'm sweating not because this is a difficult\n\n14:24.800 --> 14:27.020\n conversation, it is, but it's also hot in here\n\n14:27.020 --> 14:27.860\n for the record.\n\n14:29.600 --> 14:33.160\n So one of the folks is Mr. Jordan Peterson.\n\n14:33.160 --> 14:35.400\n I don't know if you know who that is.\n\n14:35.400 --> 14:38.280\n He's a psychologist and intellectual and author.\n\n14:38.280 --> 14:40.760\n He suggested to me that I raised the concern\n\n14:40.760 --> 14:42.740\n that there's a close working relationship\n\n14:42.740 --> 14:45.720\n between Pfizer, FDA, and CDC.\n\n14:45.720 --> 14:47.640\n So we talked about FDA.\n\n14:48.840 --> 14:52.680\n Do you worry that this affects both positive and negative\n\n14:53.560 --> 14:56.560\n Pfizer's chances of getting drugs approved?\n\n14:56.560 --> 14:59.480\n The fact that there's people that worked at the FDA\n\n14:59.480 --> 15:01.780\n that now work at Pfizer, Pfizer, FDA,\n\n15:01.780 --> 15:04.080\n that there's a kind of pipeline.\n\n15:04.080 --> 15:08.560\n Does this worry you that it affects your ability\n\n15:08.560 --> 15:11.760\n to do great, unbiased work?\n\n15:11.760 --> 15:16.600\n I have zero doubts that this is not affecting at all\n\n15:16.600 --> 15:21.100\n their ability to be unbiased and regulate.\n\n15:21.100 --> 15:24.200\n And in order to, for the system also reinforces that\n\n15:24.200 --> 15:27.840\n by creating significant time barriers.\n\n15:27.840 --> 15:30.760\n If someone moves from an industry to FDA,\n\n15:30.760 --> 15:34.600\n she won't be able to deal with topics for a period of time.\n\n15:34.600 --> 15:36.480\n And then for even an enhanced period of time\n\n15:36.480 --> 15:38.480\n with topics that are related with a company\n\n15:38.480 --> 15:40.840\n he or she may come from.\n\n15:40.840 --> 15:45.840\n I think these regulators, they are really very strict.\n\n15:46.960 --> 15:48.360\n Rightly so.\n\n15:48.360 --> 15:51.240\n If anything, I feel sometimes that maybe they should\n\n15:52.160 --> 15:55.000\n be a little bit more open minded,\n\n15:55.000 --> 15:57.400\n particularly when it comes to new technologies,\n\n15:57.400 --> 16:00.880\n rather than trying to judge and implement the same\n\n16:00.880 --> 16:03.520\n framework of variation of new technologies to all.\n\n16:03.520 --> 16:07.280\n They are always as regulators in the conservative side.\n\n16:07.280 --> 16:11.640\n But always, always, they are unbiased\n\n16:11.640 --> 16:13.680\n and they are trying the best.\n\n16:13.680 --> 16:15.960\n And it's not only one or two people.\n\n16:15.960 --> 16:19.080\n They have processes to make sure that there are self checks\n\n16:19.080 --> 16:21.320\n and balances within the agencies,\n\n16:21.320 --> 16:23.840\n both in CDC and in the FDA.\n\n16:23.840 --> 16:26.520\n Difficult decisions, they bring external experts\n\n16:26.520 --> 16:27.900\n that they should express.\n\n16:27.900 --> 16:30.080\n Easy decisions, they are internal experts\n\n16:30.080 --> 16:31.300\n that they are debating a lot.\n\n16:31.300 --> 16:33.520\n And if there are disagreements, they elevate them.\n\n16:33.520 --> 16:38.520\n So I think we are lucky to have good regulators.\n\n16:39.100 --> 16:42.560\n I think I agree with what you said before,\n\n16:42.560 --> 16:46.540\n as with all governmental agencies, there is bureaucracy.\n\n16:46.540 --> 16:49.760\n And the bureaucracy needs to be addressed.\n\n16:49.760 --> 16:54.640\n And by saying bureaucracy is not relaxing the bar.\n\n16:54.640 --> 16:56.640\n The bar needs to remain high.\n\n16:56.640 --> 17:01.640\n But focusing on what matters rather than on the detail.\n\n17:04.440 --> 17:08.960\n So you don't, I've been reading quite a bit about history.\n\n17:08.960 --> 17:12.240\n You don't worry about human nature and corruption\n\n17:12.240 --> 17:13.480\n that can seep in.\n\n17:13.480 --> 17:15.120\n You're saying institutionally,\n\n17:15.120 --> 17:16.840\n there's protections against this.\n\n17:16.840 --> 17:21.240\n I think there is always the fear of corruption,\n\n17:21.240 --> 17:24.060\n particularly when you speak about public servants.\n\n17:24.060 --> 17:28.680\n But clearly the risk is very different country by country.\n\n17:28.680 --> 17:31.960\n And speaking about agencies by agencies,\n\n17:31.960 --> 17:34.400\n I think the regulatory agencies\n\n17:34.400 --> 17:37.020\n have a very good track record in history\n\n17:37.020 --> 17:40.040\n of the US, of Europe, of England,\n\n17:40.040 --> 17:43.200\n of very, very good track record of integrity.\n\n17:44.720 --> 17:46.240\n It's something I think about.\n\n17:46.240 --> 17:47.900\n So I grew up in the Soviet Union\n\n17:47.900 --> 17:52.900\n and I need to perhaps introspect this a little bit.\n\n17:52.900 --> 17:56.900\n But when I was growing up, ethically,\n\n17:56.900 --> 17:59.500\n there was a sense that bribery\n\n17:59.500 --> 18:01.640\n is the only way you can get stuff done.\n\n18:01.640 --> 18:04.020\n That was the system of the time.\n\n18:04.020 --> 18:06.740\n Like you get pulled over by a police officer.\n\n18:06.740 --> 18:09.140\n Like obviously you need to bribe them.\n\n18:09.140 --> 18:11.460\n I mean, it was like the way of life.\n\n18:11.460 --> 18:14.460\n And then so coming to this country was beautiful\n\n18:14.460 --> 18:16.980\n to see that the rule of law has so much power.\n\n18:16.980 --> 18:21.820\n And ultimately the rule of law when enacted,\n\n18:21.820 --> 18:26.660\n when it holds up, it gives people freedom\n\n18:26.660 --> 18:28.540\n to do the best work of their lives.\n\n18:28.540 --> 18:30.660\n But there's still human nature.\n\n18:30.660 --> 18:32.300\n And that worries me a lot here.\n\n18:32.300 --> 18:34.480\n And again, it goes back to the perception,\n\n18:34.480 --> 18:36.780\n the communication, when there's people\n\n18:36.780 --> 18:41.780\n that have worked at Pfizer and an FDA, at the CDC,\n\n18:41.860 --> 18:42.940\n you look at their resume,\n\n18:42.940 --> 18:46.700\n they have those things on their resume, it worries people.\n\n18:46.700 --> 18:50.100\n Are these great leaders that we are supposed\n\n18:50.100 --> 18:54.620\n to see as authorities, are they playing a game on us?\n\n18:54.620 --> 18:58.260\n I would say that I recognize what you said\n\n18:58.260 --> 19:00.540\n about what happened in, or what,\n\n19:00.540 --> 19:02.700\n I'm sure that what you described\n\n19:02.700 --> 19:05.300\n in the country that you're coming from,\n\n19:05.300 --> 19:07.620\n it was how you experienced it.\n\n19:07.620 --> 19:09.300\n And I know that there are other countries\n\n19:09.300 --> 19:13.300\n that you need to do these things to do your job.\n\n19:13.300 --> 19:17.800\n I don't think it's the case in this country,\n\n19:17.800 --> 19:19.620\n particularly when it comes to those agencies\n\n19:19.620 --> 19:20.860\n that you mentioned.\n\n19:20.860 --> 19:23.780\n I think they have a very high track record.\n\n19:23.780 --> 19:26.700\n And also, I don't think that there are a lot of people\n\n19:26.700 --> 19:29.020\n that they are worried about it or doubt it.\n\n19:29.020 --> 19:31.900\n I'm sure, like everywhere, there will be a minority,\n\n19:31.900 --> 19:34.180\n but the vast majority of the Americans,\n\n19:34.180 --> 19:35.620\n the vast majority of the Europeans,\n\n19:35.620 --> 19:37.300\n the vast majority of the Brits,\n\n19:37.300 --> 19:39.380\n the vast majority of the Israelis,\n\n19:39.380 --> 19:44.380\n they trust what FDA or EMA or CDC or MHRA will say.\n\n19:44.380 --> 19:46.260\n MHRA will say.\n\n19:48.100 --> 19:50.060\n Still, there's currently a distrust\n\n19:50.060 --> 19:51.620\n of big pharma in the public.\n\n19:51.620 --> 19:54.420\n Maybe this is something I'd love to hear your comment on.\n\n19:55.700 --> 19:57.980\n There's distrust of science when it's tangled up\n\n19:57.980 --> 20:00.240\n with corporations and government institutions,\n\n20:00.240 --> 20:01.440\n like we've talked about.\n\n20:02.580 --> 20:06.380\n But they have to be entangled to achieve scale,\n\n20:07.220 --> 20:09.340\n oversight, and to achieve the kind of scale\n\n20:09.340 --> 20:11.340\n that Pfizer's been able to accomplish.\n\n20:11.340 --> 20:16.340\n So, how can Pfizer regain the public trust?\n\n20:16.660 --> 20:19.060\n How can you regain the public trust, do you think?\n\n20:19.060 --> 20:21.820\n Not regain, but sort of take steps\n\n20:21.820 --> 20:24.340\n to increase the public trust.\n\n20:24.340 --> 20:29.340\n Reputation is something that you can lose in buckets,\n\n20:29.860 --> 20:31.780\n but you can earn it back in drops.\n\n20:32.660 --> 20:36.100\n And once you've lost it,\n\n20:36.100 --> 20:40.380\n you are going to take a lot of effort to bring it back.\n\n20:40.380 --> 20:42.500\n And the pharmaceutical industry lost it.\n\n20:42.500 --> 20:45.380\n It's clear that the reputation of the industry\n\n20:45.380 --> 20:50.060\n in the last decade was on the lowest\n\n20:50.060 --> 20:52.500\n that we have seen ever.\n\n20:52.500 --> 20:56.740\n And there are many reasons for that,\n\n20:56.740 --> 20:59.540\n but clearly there are reasons that are related also\n\n20:59.540 --> 21:01.980\n with the behavior of the industry.\n\n21:01.980 --> 21:04.740\n That needed to change, and I'm hopeful\n\n21:04.740 --> 21:08.340\n that very few will disagree\n\n21:08.340 --> 21:11.180\n that the industry is a very different industry right now.\n\n21:12.340 --> 21:16.260\n That being said, I truly believe\n\n21:16.260 --> 21:20.860\n that if there is one lesson that stands out\n\n21:20.860 --> 21:23.940\n from the many lessons that we learned during COVID,\n\n21:23.940 --> 21:27.500\n is the power of science in the hands of the private sector.\n\n21:29.060 --> 21:32.420\n I think it was the private sector\n\n21:32.420 --> 21:36.420\n that came with solutions with diagnostic tests\n\n21:36.420 --> 21:39.900\n when we didn't have, solutions with respirators\n\n21:39.900 --> 21:43.340\n when we didn't have, solutions with treatments,\n\n21:43.340 --> 21:44.580\n solutions with vaccines.\n\n21:45.500 --> 21:50.500\n And I think that demonstrated very clearly to the world\n\n21:50.740 --> 21:55.740\n the value of thriving life sciences sector,\n\n21:56.860 --> 21:59.060\n private life sciences sector to society.\n\n22:00.420 --> 22:04.540\n That also affected very positively the reputation,\n\n22:04.540 --> 22:06.980\n both of the sector and of Pfizer.\n\n22:08.140 --> 22:11.500\n I'm not going to make the mistake to consider given.\n\n22:11.500 --> 22:13.380\n I'm not going to make the mistake\n\n22:13.380 --> 22:17.660\n that because our reputation is high, that will remain so.\n\n22:17.660 --> 22:19.940\n We need to earn it every day.\n\n22:19.940 --> 22:22.140\n Every day with everything we do,\n\n22:22.140 --> 22:25.060\n with everything we say, with the way we behave.\n\n22:25.060 --> 22:28.100\n And I hope that we'll rise to this occasion\n\n22:28.100 --> 22:29.100\n and we will do that.\n\n22:30.060 --> 22:32.380\n You've been at Pfizer for 28 years.\n\n22:32.380 --> 22:33.780\n Time flies when you're having fun.\n\n22:33.780 --> 22:37.700\n And you've become CEO in 2019.\n\n22:37.700 --> 22:41.940\n It is a company you love, a company you believe in.\n\n22:41.940 --> 22:43.620\n It's a company that has developed drugs\n\n22:43.620 --> 22:46.220\n that has helped millions of people.\n\n22:46.220 --> 22:48.740\n So let me ask yet another hard question\n\n22:50.060 --> 22:51.740\n on this topic of reputation.\n\n22:51.740 --> 22:54.180\n In 2009, Pfizer pleaded guilty\n\n22:54.180 --> 22:57.620\n to the illegal marketing of arthritis drug Bextra\n\n22:57.620 --> 23:01.420\n and agreed to a $2.3 billion settlement.\n\n23:01.420 --> 23:04.860\n How do you make sense of the fact that this happened\n\n23:04.860 --> 23:07.900\n to a company you love and that you believe in?\n\n23:07.900 --> 23:12.300\n Yes, the Bextra case in 2009\n\n23:12.300 --> 23:15.380\n was related to things that happened in 2003.\n\n23:16.340 --> 23:17.980\n And the things that happened in 2003\n\n23:17.980 --> 23:21.620\n were things that basically several of our reps\n\n23:21.620 --> 23:24.180\n did off label promotion.\n\n23:24.180 --> 23:27.300\n So they spoke with the physicians\n\n23:27.300 --> 23:31.300\n about off label use of the product, and they shouldn't.\n\n23:31.300 --> 23:32.660\n Can you clarify it?\n\n23:32.660 --> 23:35.700\n So off label are things that the FDA didn't approve,\n\n23:35.700 --> 23:37.060\n extra stuff.\n\n23:37.060 --> 23:39.380\n You basically say this drug does extra stuff\n\n23:39.380 --> 23:40.820\n that the FDA never approved.\n\n23:40.820 --> 23:43.420\n Correct, and this is something that it is allowed\n\n23:43.420 --> 23:45.420\n when physicians are speaking to physicians,\n\n23:45.420 --> 23:48.140\n but it is not allowed for the pharmaceutical companies\n\n23:48.140 --> 23:50.300\n to refer to these studies,\n\n23:50.300 --> 23:53.100\n because usually our studies that are happening off label.\n\n23:53.100 --> 23:57.460\n And apparently several of our reps in 2003, they did it.\n\n23:57.460 --> 24:02.460\n And we had to settle in 2009,\n\n24:02.580 --> 24:05.220\n and we paid a very big fine, as you said.\n\n24:05.220 --> 24:08.580\n The fine was related not to the severity of the conduct,\n\n24:08.580 --> 24:10.300\n but the size of the revenues.\n\n24:10.300 --> 24:13.420\n So the fines are, if Bextra was a small product,\n\n24:13.420 --> 24:14.500\n we would get a small fine.\n\n24:14.500 --> 24:15.980\n Bextra was a very big product,\n\n24:15.980 --> 24:17.740\n and we got a very large fine.\n\n24:17.740 --> 24:20.700\n Very bad, what happened in 2003.\n\n24:21.580 --> 24:26.580\n I don't think that these things happened since then.\n\n24:26.580 --> 24:29.980\n We have a stellar record from 2009 until now\n\n24:29.980 --> 24:34.980\n of complying with every single regulation and rule.\n\n24:34.980 --> 24:37.420\n We have internal processes to make sure\n\n24:37.420 --> 24:39.660\n that these are not happening by individuals\n\n24:39.660 --> 24:41.900\n that may have an interest.\n\n24:41.900 --> 24:43.660\n For example, to get a promotion,\n\n24:43.660 --> 24:45.300\n they may try and do things\n\n24:45.300 --> 24:47.140\n that are not the right things.\n\n24:47.140 --> 24:52.140\n And we have, more importantly, a culture in this company\n\n24:52.540 --> 24:56.460\n that really sets aside people that they think differently.\n\n24:56.460 --> 25:00.140\n So I didn't like what happened in 2003,\n\n25:01.700 --> 25:03.660\n but I believe a lot has changed\n\n25:03.660 --> 25:06.740\n in the 20 years that followed, or almost 20 years.\n\n25:07.620 --> 25:09.500\n So you're developing drugs,\n\n25:09.500 --> 25:12.460\n you're developing solutions to help millions of people,\n\n25:12.460 --> 25:13.860\n but there's risk involved.\n\n25:14.740 --> 25:18.940\n And so there will be lawsuits heading back your way\n\n25:18.940 --> 25:23.940\n because there's a lot of lawyers in the world, partially.\n\n25:27.540 --> 25:29.900\n How do you put that into the calculation\n\n25:29.900 --> 25:32.900\n of how you try to do good in the world?\n\n25:35.740 --> 25:38.180\n That some of the cost is the lawsuits.\n\n25:38.180 --> 25:41.980\n How do you not fall victim to thinking\n\n25:41.980 --> 25:44.660\n that it's just the cost of doing business,\n\n25:44.660 --> 25:46.980\n and that some of the lawsuits might actually represent\n\n25:46.980 --> 25:49.780\n real pain that people are going through?\n\n25:49.780 --> 25:52.500\n No, I think that we try always to do the right thing.\n\n25:52.500 --> 25:56.860\n And that's, as I said, very well embedded into our culture.\n\n25:56.860 --> 25:59.100\n If you don't do the right thing,\n\n25:59.100 --> 26:03.140\n sooner or later, you will pay for it, one way or another.\n\n26:03.140 --> 26:05.380\n And right now, for us doing the right thing,\n\n26:05.380 --> 26:09.980\n it is being able to find innovations to issues\n\n26:09.980 --> 26:14.740\n that are real, diseases that they do not have\n\n26:14.740 --> 26:17.860\n good coverage, good treatments right now.\n\n26:17.860 --> 26:20.340\n We try to find treatments that significantly\n\n26:21.420 --> 26:24.980\n surpass the current standards of care.\n\n26:26.020 --> 26:29.460\n And we try not only to comply with what regulators\n\n26:29.460 --> 26:31.420\n are asking us to do, this is what you need to do\n\n26:31.420 --> 26:34.900\n to prove the safety or the efficacy, but exceed them.\n\n26:34.900 --> 26:37.380\n No matter what we do on that,\n\n26:37.380 --> 26:39.540\n I'm sure that people will find opportunity\n\n26:39.540 --> 26:42.740\n because, as you said, there are a lot of lawyers to sue us.\n\n26:42.740 --> 26:44.460\n But we believe in the justice system\n\n26:44.460 --> 26:47.540\n and we believe that eventually,\n\n26:47.540 --> 26:49.820\n if you are doing the right thing,\n\n26:49.820 --> 26:53.140\n you will be on the right side of the history.\n\n26:53.140 --> 26:55.060\n I'm really glad you say that because\n\n26:57.900 --> 27:01.020\n focusing on doing the right thing, no matter the money,\n\n27:01.020 --> 27:03.820\n I believe is the best way to make money.\n\n27:03.820 --> 27:04.900\n That's exactly what I said.\n\n27:04.900 --> 27:08.620\n And also, in another way, in other realms,\n\n27:08.620 --> 27:10.180\n creating a product that people love\n\n27:10.180 --> 27:11.780\n is the best way to make money.\n\n27:11.780 --> 27:15.180\n So focusing on the core of the thing\n\n27:15.180 --> 27:16.700\n that makes people feel good,\n\n27:16.700 --> 27:18.500\n that brings value to people's lives.\n\n27:19.700 --> 27:22.220\n So I'm now in Austin, Texas.\n\n27:23.340 --> 27:27.220\n My good friend, Joe Rogan, he's been highlighting to me\n\n27:27.220 --> 27:31.100\n this aggressive marketing on mainstream media channels\n\n27:31.100 --> 27:32.340\n by Pfizer.\n\n27:32.340 --> 27:35.340\n So let me ask a general marketing question.\n\n27:35.340 --> 27:37.420\n Do you see this as a conflict of interest?\n\n27:37.420 --> 27:40.580\n Is it my bias, the reporting of news?\n\n27:40.580 --> 27:44.340\n That a lot of us, a lot of people, me included,\n\n27:44.340 --> 27:47.900\n look to these mainstream channels of news\n\n27:47.900 --> 27:49.300\n for kind of authority of like,\n\n27:49.300 --> 27:51.580\n what the heck's going on in the world?\n\n27:51.580 --> 27:54.420\n And if Pfizer is sponsoring\n\n27:56.940 --> 27:58.740\n many of these shows,\n\n28:00.260 --> 28:03.420\n there's a worry, it may be a perception thing,\n\n28:03.420 --> 28:05.060\n but there's also a natural worry\n\n28:05.060 --> 28:07.180\n that it would influence what they're talking about\n\n28:07.180 --> 28:09.020\n because they're afraid of losing the sponsorship.\n\n28:09.020 --> 28:12.940\n It's subtle, but at scale, it might have a serious impact.\n\n28:12.940 --> 28:14.980\n Do you worry about this?\n\n28:14.980 --> 28:17.980\n I think people could go one way or another\n\n28:17.980 --> 28:21.380\n because of multiple reasons.\n\n28:21.380 --> 28:23.020\n From our perspective,\n\n28:24.620 --> 28:28.820\n I don't think we have aggressive marketing.\n\n28:28.820 --> 28:31.180\n What we do, we go on TV\n\n28:31.180 --> 28:35.140\n and we are having ads about our products\n\n28:35.140 --> 28:38.300\n and they're highly regulated.\n\n28:38.300 --> 28:40.900\n I think it is the right of people to know,\n\n28:40.900 --> 28:43.740\n to learn that if there is a product like that.\n\n28:43.740 --> 28:47.260\n It's very clearly that we cannot say things\n\n28:47.260 --> 28:49.620\n that they are off label, that have not been approved.\n\n28:49.620 --> 28:52.580\n We need to have, every time we go on TV, as you know,\n\n28:52.580 --> 28:55.740\n FDA is forcing us to say also the bad things\n\n28:55.740 --> 28:57.380\n that can happen for a medicine.\n\n28:57.380 --> 29:01.340\n Sometimes that takes more time than the good things.\n\n29:01.340 --> 29:04.660\n And I don't think that we are doing aggressive marketing.\n\n29:04.660 --> 29:08.420\n Now, people could be influenced\n\n29:08.420 --> 29:10.700\n and can be biased in the podcasts\n\n29:10.700 --> 29:14.340\n or the other type of media activities that they have\n\n29:14.340 --> 29:17.460\n for multiple different reasons.\n\n29:17.460 --> 29:19.980\n Yeah, I know, but it's still, it's pressure.\n\n29:19.980 --> 29:20.820\n It's human nature.\n\n29:20.820 --> 29:24.460\n I mean, one of it is perception, but I worry about too.\n\n29:24.460 --> 29:26.540\n I think I have a ton of sponsors for this podcast,\n\n29:26.540 --> 29:30.340\n for example, and none of them ever asked me to anything.\n\n29:30.340 --> 29:31.820\n They're just, you know,\n\n29:31.820 --> 29:34.900\n I think likely that kind of pressure's not happening\n\n29:34.900 --> 29:39.460\n for Pfizer, but there's implied pressure sometimes.\n\n29:39.460 --> 29:43.140\n And I worry about that a lot because, you know,\n\n29:43.140 --> 29:48.140\n I look at academia, like I look for the good in people.\n\n29:48.380 --> 29:50.180\n I tend to believe most people are good\n\n29:50.180 --> 29:54.780\n or have the capacity to be good and desire to be good.\n\n29:54.780 --> 30:01.780\n When I came to MIT, I was a little bit disappointed,\n\n30:01.860 --> 30:03.220\n maybe heartbroken.\n\n30:05.860 --> 30:07.220\n How much pressure?\n\n30:09.820 --> 30:12.700\n I think unjustified pressure people felt\n\n30:12.700 --> 30:16.060\n from financial constraints, especially at MIT\n\n30:16.060 --> 30:17.940\n when there's, I think, a lot of money.\n\n30:19.260 --> 30:22.700\n People still felt constraints and they weren't,\n\n30:22.700 --> 30:24.500\n it wasn't bringing out the best in them.\n\n30:24.500 --> 30:25.660\n They weren't supporting each other.\n\n30:25.660 --> 30:26.940\n They weren't loving each other,\n\n30:26.940 --> 30:30.060\n like celebrating each other's successes.\n\n30:30.060 --> 30:32.020\n I don't want to blame money on everything,\n\n30:32.020 --> 30:35.460\n money constraints, but when you have sponsors,\n\n30:35.460 --> 30:38.180\n it just, I personally worry\n\n30:38.180 --> 30:41.380\n that it doesn't bring the best out of people.\n\n30:41.380 --> 30:44.820\n And so I feel like I want to put some responsibility\n\n30:44.820 --> 30:49.460\n on sponsors and great big companies like Pfizer\n\n30:49.460 --> 30:54.460\n to kind of not get in the way of the best of human nature,\n\n30:56.700 --> 31:01.700\n whether it's sponsoring podcasts, mainstream media,\n\n31:02.020 --> 31:05.140\n like, I don't know, athletes, whatever.\n\n31:05.140 --> 31:08.020\n You need to know that we are so, so careful\n\n31:08.020 --> 31:09.220\n with sponsorships.\n\n31:09.220 --> 31:12.100\n First of all, we have very few, very, very few.\n\n31:12.100 --> 31:14.660\n We have a team that for every single one,\n\n31:14.660 --> 31:16.820\n could be $2,000.\n\n31:16.820 --> 31:19.260\n They will try to see if there is a conflict of interest\n\n31:19.260 --> 31:20.420\n in the way we do it.\n\n31:20.420 --> 31:25.420\n And also what is the reputation of the persons\n\n31:25.420 --> 31:27.860\n or the programs that we are sponsoring?\n\n31:27.860 --> 31:32.540\n So I don't think, our friend, I think was from Texas.\n\n31:32.540 --> 31:33.460\n Yes. Yeah.\n\n31:33.460 --> 31:34.900\n I don't. Joe Rogan, yes.\n\n31:34.900 --> 31:35.740\n Yes.\n\n31:35.740 --> 31:37.780\n I don't think he got it right\n\n31:37.780 --> 31:40.380\n that we do those type of things.\n\n31:41.340 --> 31:42.180\n We don't.\n\n31:42.180 --> 31:44.620\n Oh, in terms of like having a negative effect on.\n\n31:44.620 --> 31:46.580\n Not even having aggressive sponsorships.\n\n31:46.580 --> 31:48.060\n We have very few.\n\n31:48.060 --> 31:49.900\n Yeah, when you clip them all together.\n\n31:49.900 --> 31:51.460\n And most of the sponsorships that we have,\n\n31:51.460 --> 31:55.340\n it is more on patient related organizations\n\n31:55.340 --> 31:58.860\n rather than we are very careful not to sponsor other things\n\n31:58.860 --> 32:02.300\n that can be perceived, not even influenced,\n\n32:02.300 --> 32:03.740\n but perceived that we may influence.\n\n32:03.740 --> 32:05.340\n So we are very, very careful on that.\n\n32:05.340 --> 32:07.460\n This is not the case with us.\n\n32:07.460 --> 32:11.920\n So with the incredibly fast development of the vaccine,\n\n32:13.340 --> 32:16.820\n could you tell me the story from the engineering\n\n32:16.820 --> 32:19.300\n to the science, to the human story\n\n32:19.300 --> 32:21.820\n of how you could do it so fast?\n\n32:22.680 --> 32:26.380\n By November, you even had the ambition to do it by October.\n\n32:26.380 --> 32:28.540\n It was in the initial days.\n\n32:28.540 --> 32:31.140\n How do you. Eight days later.\n\n32:31.140 --> 32:33.500\n In that time, how do you show\n\n32:33.500 --> 32:35.660\n that the vaccine is safe and effective\n\n32:36.860 --> 32:38.820\n given that I think previous vaccines\n\n32:38.820 --> 32:40.260\n have taken years to do that?\n\n32:40.260 --> 32:43.220\n Yeah, the vaccines take years to do that.\n\n32:43.220 --> 32:47.660\n And the time that it takes, it is basically\n\n32:48.900 --> 32:50.980\n the vast majority of the time to conduct\n\n32:50.980 --> 32:53.180\n the final phase three study,\n\n32:53.180 --> 32:55.460\n that is the confirmatory study.\n\n32:55.460 --> 32:57.140\n And you do that because the phase three study\n\n32:57.140 --> 33:00.660\n costs a lot of money, in our case, cost almost a billion.\n\n33:00.660 --> 33:03.780\n So you don't want to go and risk a billion\n\n33:03.780 --> 33:08.700\n in blinded data normally before you do a lot of experiments\n\n33:08.700 --> 33:10.900\n to make sure that the product that you're putting\n\n33:10.900 --> 33:13.540\n in the phase three is the right one.\n\n33:13.540 --> 33:15.060\n We didn't have that time.\n\n33:15.060 --> 33:17.500\n So we risked all the money.\n\n33:17.500 --> 33:21.740\n So we went into, we condensed all the time\n\n33:21.740 --> 33:23.100\n towards this phase three.\n\n33:23.100 --> 33:27.140\n But the phase three study had to follow all the rules\n\n33:27.140 --> 33:31.580\n that any study follows when we do this trial.\n\n33:31.580 --> 33:34.820\n Could you just briefly describe the basics\n\n33:34.820 --> 33:37.860\n of what is phase one, what is phase two, what is phase three?\n\n33:37.860 --> 33:39.940\n Let's say that there are so many phases\n\n33:39.940 --> 33:42.500\n when you try first of all to find\n\n33:42.500 --> 33:43.620\n what is the right vaccine.\n\n33:43.620 --> 33:45.980\n We tried from 20 different vaccines,\n\n33:45.980 --> 33:47.740\n we nailed down to four.\n\n33:47.740 --> 33:50.380\n And for those four, we selected eventually two\n\n33:50.380 --> 33:52.340\n and then eventually one.\n\n33:52.340 --> 33:55.380\n Once you have those selections,\n\n33:55.380 --> 33:57.140\n what is the dose you're going to use?\n\n33:57.140 --> 33:59.980\n And then we tried multiple different doses\n\n33:59.980 --> 34:02.460\n to see which one we think is the best.\n\n34:02.460 --> 34:05.180\n What does trying entail in those early days?\n\n34:05.180 --> 34:10.180\n You go first of all with smaller doses in humans.\n\n34:11.380 --> 34:13.980\n And then after you have done a lot of experiments\n\n34:13.980 --> 34:17.340\n in animals so that you can feel that it is safe enough\n\n34:17.340 --> 34:20.500\n to go to humans and then go with very low dose.\n\n34:20.500 --> 34:22.180\n And then you gradually increase the dose\n\n34:22.180 --> 34:24.820\n and then you monitor those humans to make sure\n\n34:24.820 --> 34:28.340\n that there are not any, let's say reactogenicity\n\n34:28.340 --> 34:29.740\n to what you are giving them.\n\n34:29.740 --> 34:32.060\n At the same time, you start to measure what it's doing\n\n34:32.060 --> 34:34.500\n in terms of immune responses.\n\n34:34.500 --> 34:36.140\n So you do that with multiple vaccines\n\n34:36.140 --> 34:37.780\n and you do that with multiple doses\n\n34:37.780 --> 34:40.540\n and you do that with multiple ages of people,\n\n34:40.540 --> 34:42.500\n young people, old people.\n\n34:42.500 --> 34:47.060\n And eventually from the 20 vaccines to multiple doses,\n\n34:47.060 --> 34:49.980\n to multiple schedules, is it after three weeks\n\n34:49.980 --> 34:51.980\n the second dose or is it after four weeks\n\n34:51.980 --> 34:53.820\n or after six months?\n\n34:53.820 --> 34:58.820\n All of that will inform you that I think this is the vaccine,\n\n34:59.620 --> 35:02.420\n this is the dose, this is the scheme\n\n35:02.420 --> 35:05.540\n that I believe will give me the best results.\n\n35:05.540 --> 35:06.540\n And when you have that,\n\n35:06.540 --> 35:09.900\n then you go to do what we call the phase three.\n\n35:09.900 --> 35:14.180\n This is a very big study with thousands of people\n\n35:14.180 --> 35:17.420\n where you use the vaccine that you think is the right one\n\n35:17.420 --> 35:19.660\n and a placebo.\n\n35:19.660 --> 35:22.540\n The placebo and the vaccine, they look identical.\n\n35:22.540 --> 35:26.620\n Nobody knows if is injected a placebo or a vaccine.\n\n35:26.620 --> 35:29.220\n The physician that makes the injection,\n\n35:29.220 --> 35:32.300\n the doctor doesn't know if he's injecting placebo\n\n35:32.300 --> 35:35.380\n or vaccine, he knows a barcode.\n\n35:35.380 --> 35:36.540\n Only the computer knows.\n\n35:37.420 --> 35:39.900\n In order to go into this computer, there are keys\n\n35:39.900 --> 35:41.420\n and there are at least two people\n\n35:41.420 --> 35:42.860\n that needs to put their keys\n\n35:42.860 --> 35:44.980\n so that someone can see the data.\n\n35:44.980 --> 35:48.380\n And those people, they have legal obligations\n\n35:48.380 --> 35:49.900\n never to do that, right?\n\n35:49.900 --> 35:52.260\n So before a certain point.\n\n35:52.260 --> 35:53.980\n So all of that is blind.\n\n35:53.980 --> 35:58.260\n The idea is that when you go into this study,\n\n35:58.260 --> 36:00.700\n you need to make sure that you are going with the right one.\n\n36:00.700 --> 36:02.820\n That's why it takes so much time.\n\n36:02.820 --> 36:04.460\n But the study is the study.\n\n36:04.460 --> 36:07.380\n You need to have a significant number of people\n\n36:07.380 --> 36:09.140\n that will give the two\n\n36:09.140 --> 36:10.980\n and then you let them live their lives.\n\n36:10.980 --> 36:13.460\n And then you see how many of them will get the disease.\n\n36:13.460 --> 36:16.140\n And then you see if there are differences\n\n36:16.140 --> 36:19.100\n in percentage of infections for the vaccinated\n\n36:19.100 --> 36:20.540\n compared to the non vaccinated.\n\n36:20.540 --> 36:22.500\n At the same time, you're monitoring all of them\n\n36:22.500 --> 36:25.260\n to see if there are differences in the safety profile.\n\n36:25.260 --> 36:27.220\n If those that go to placebo have the same,\n\n36:27.220 --> 36:31.020\n let's say, heart attacks with those that they didn't.\n\n36:31.020 --> 36:33.340\n They got the vaccine because heart attacks will happen\n\n36:33.340 --> 36:37.700\n if you have 50,000 people because it's part of life.\n\n36:37.700 --> 36:40.580\n These are the, all these processes are very, very,\n\n36:40.580 --> 36:43.820\n very well established and since years.\n\n36:43.820 --> 36:46.020\n What we did the last one was exactly the same\n\n36:46.020 --> 36:47.140\n as we did always.\n\n36:47.140 --> 36:49.300\n We just didn't lose time.\n\n36:49.300 --> 36:51.780\n We didn't, we're not careful with money.\n\n36:51.780 --> 36:57.260\n Instead of recruiting 50,000 people over a year,\n\n36:57.260 --> 37:01.860\n because we had let's say 30 hospitals doing the recruitment,\n\n37:01.860 --> 37:04.380\n we went with 150 hospitals doing the recruitment.\n\n37:04.380 --> 37:05.820\n That cost a lot of money.\n\n37:05.820 --> 37:07.980\n But instead of recruiting them in a year,\n\n37:07.980 --> 37:10.100\n we recruited them in three, four months.\n\n37:10.100 --> 37:15.220\n So I did this type of things by taking return on investment,\n\n37:15.220 --> 37:17.300\n taking costs out of the equation\n\n37:17.300 --> 37:19.220\n and we were able to achieve this result.\n\n37:19.220 --> 37:22.500\n But it's not the process, believe me.\n\n37:22.500 --> 37:25.220\n It is the heart of the people.\n\n37:25.220 --> 37:29.460\n People don't know what they can and what they cannot do.\n\n37:29.460 --> 37:32.500\n And if anything, they have a serious tendency\n\n37:32.500 --> 37:35.300\n to underestimate what they can do.\n\n37:35.300 --> 37:38.340\n And always, when you ask them something\n\n37:38.340 --> 37:40.660\n that is seemingly impossible,\n\n37:40.660 --> 37:44.540\n they will think out of the box to be able to deliver.\n\n37:44.540 --> 37:45.900\n We discussed about the timing.\n\n37:45.900 --> 37:48.940\n Instead of eight years, we then asked them to do it\n\n37:48.940 --> 37:52.740\n in six, we asked them to do it in eight months.\n\n37:52.740 --> 37:57.660\n Our normal manufacturing yearly production of Pfizer\n\n37:57.660 --> 38:00.220\n was 200 million doses of vaccines every year.\n\n38:00.220 --> 38:03.020\n That's what we are doing in the last 10 years.\n\n38:03.020 --> 38:06.380\n We didn't ask them to make 300 million doses for a new vaccine.\n\n38:06.380 --> 38:11.060\n We asked them to make 3 billion doses for a new vaccine.\n\n38:11.060 --> 38:13.740\n The discovery phase of a new molecule,\n\n38:13.740 --> 38:16.740\n like the treatment that we have now, the pill against COVID,\n\n38:16.740 --> 38:18.300\n takes four years.\n\n38:18.300 --> 38:19.660\n We didn't ask them to do it in three.\n\n38:19.660 --> 38:20.980\n We asked them to do it in four months,\n\n38:20.980 --> 38:22.580\n which is what they did.\n\n38:22.580 --> 38:25.860\n When you are setting this type of goals,\n\n38:25.860 --> 38:29.140\n they know immediately, they cannot just think\n\n38:29.140 --> 38:30.340\n within the box.\n\n38:30.340 --> 38:32.660\n And immediately, this is where the human ingenuity\n\n38:32.660 --> 38:34.380\n and the heart comes.\n\n38:34.380 --> 38:36.420\n And this is how they surprised all of us.\n\n38:37.500 --> 38:40.020\n So there's incredible science and engineering\n\n38:40.020 --> 38:40.860\n going on here.\n\n38:40.860 --> 38:43.260\n This is an incredible thing. Absolutely.\n\n38:43.260 --> 38:45.180\n This is what's bothering me,\n\n38:45.180 --> 38:50.180\n that the conversation in public is often not about that.\n\n38:52.180 --> 38:53.500\n It's about politics, unfortunately.\n\n38:53.500 --> 38:54.340\n Politics.\n\n38:54.340 --> 38:56.860\n So I spent the day with Elon Musk yesterday.\n\n38:57.700 --> 38:59.340\n He works with rockets.\n\n39:00.500 --> 39:02.460\n Similar situation as with Pfizer,\n\n39:02.460 --> 39:04.580\n in the sense that there's NASA\n\n39:04.580 --> 39:07.060\n and then there's this private company.\n\n39:07.060 --> 39:11.460\n And that's a source of incredible inspiration to people.\n\n39:11.460 --> 39:15.820\n No politics, very little politics.\n\n39:15.820 --> 39:18.780\n So this is part of the thing I'm trying to,\n\n39:18.780 --> 39:22.380\n I'm hoping to do our little part in this conversation\n\n39:22.380 --> 39:25.700\n to help untangle a little bit,\n\n39:25.700 --> 39:30.420\n just reveal the beauty and the power of the thing\n\n39:30.420 --> 39:32.260\n that was done here, especially with the vaccine,\n\n39:32.260 --> 39:33.500\n but other things that are being done\n\n39:33.500 --> 39:35.180\n with the antiviral drug.\n\n39:37.860 --> 39:39.940\n Let me just kind of linger on the safety.\n\n39:39.940 --> 39:42.580\n What can you say?\n\n39:42.580 --> 39:45.900\n There's a lot of people that are concerned\n\n39:45.900 --> 39:49.100\n that the Pfizer vaccine, by the way,\n\n39:49.100 --> 39:52.540\n of which I took two shots, no booster yet,\n\n39:54.660 --> 39:55.740\n is unsafe.\n\n39:56.740 --> 39:59.980\n What do you say to people that say that?\n\n39:59.980 --> 40:03.300\n No, they should not fear something like that.\n\n40:03.300 --> 40:04.620\n It's completely wrong.\n\n40:04.620 --> 40:09.500\n There is no medical product in the history of humanity\n\n40:09.500 --> 40:12.700\n that have been tested as much as this vaccine.\n\n40:12.700 --> 40:16.940\n Has been administered to hundreds of millions of people.\n\n40:16.940 --> 40:19.980\n And because of the importance of COVID,\n\n40:19.980 --> 40:24.260\n they have been scrutinized, those people, constantly.\n\n40:24.260 --> 40:27.140\n Right now, healthcare authorities are looking\n\n40:27.140 --> 40:30.380\n for every single signal around the world\n\n40:30.380 --> 40:31.500\n of people that they got the vaccine\n\n40:31.500 --> 40:34.460\n and try to see if it is vaccine related or not.\n\n40:34.460 --> 40:36.980\n There are electronic medical records\n\n40:36.980 --> 40:40.620\n that will tell us when and what happened\n\n40:40.620 --> 40:43.540\n to a person when he did got the vaccine.\n\n40:43.540 --> 40:48.540\n And we know now, we have so high certainty\n\n40:49.100 --> 40:54.100\n that it is so safe, exactly as the data sheet says\n\n40:56.340 --> 40:59.180\n about this vaccine, more than any other product.\n\n40:59.180 --> 41:01.500\n They should not be afraid of something like that.\n\n41:01.500 --> 41:06.380\n And they should not listen to information\n\n41:06.380 --> 41:09.340\n that it is misinformation, that it is spread on purpose.\n\n41:10.460 --> 41:13.900\n Well, I don't like the word misinformation\n\n41:13.900 --> 41:18.900\n because, you know, again, back to the Soviet Union,\n\n41:21.220 --> 41:24.820\n anyone who opposes the state is spreading misinformation.\n\n41:24.820 --> 41:27.460\n So you can basically call anything misinformation.\n\n41:27.460 --> 41:29.900\n That's the unfortunate times we live in,\n\n41:29.900 --> 41:34.060\n is you can call anyone, you can basically call anybody\n\n41:34.060 --> 41:37.260\n a liar and say, I'm the sole possessor of the truth.\n\n41:37.260 --> 41:40.100\n And just no offense to me, just because you wear a tie,\n\n41:40.100 --> 41:43.100\n it doesn't mean you're any more likely to be\n\n41:43.100 --> 41:45.660\n in the possession of the truth than anyone else.\n\n41:45.660 --> 41:46.500\n So.\n\n41:46.500 --> 41:48.220\n I wouldn't disagree with that at all.\n\n41:48.220 --> 41:49.060\n I don't think that.\n\n41:49.060 --> 41:50.500\n That's somebody who's not wearing a tie.\n\n41:50.500 --> 41:52.300\n And as you can, people can see\n\n41:52.300 --> 41:54.500\n that I'm not wearing a tie and you are.\n\n41:54.500 --> 41:58.820\n But it's not about being able,\n\n41:58.820 --> 42:03.820\n those that they have the power to impose on the others,\n\n42:04.380 --> 42:09.380\n the stigma that what you're saying is misinformation.\n\n42:09.700 --> 42:12.220\n But there are a few things that as society\n\n42:12.220 --> 42:15.500\n we have accomplished and science is one of them.\n\n42:15.500 --> 42:20.500\n And data is, and analytics of data is another one.\n\n42:21.380 --> 42:26.380\n And to say that something which is highly scientific\n\n42:26.380 --> 42:29.040\n by people that they are not scientists.\n\n42:31.300 --> 42:35.520\n I think that it is not what you're describing,\n\n42:35.520 --> 42:37.500\n what used to happen in Soviet Union\n\n42:37.500 --> 42:42.300\n or in any other autocratic regime in the world right now.\n\n42:42.300 --> 42:47.300\n But I definitely do think that the scientists,\n\n42:47.540 --> 42:49.900\n the public science communicators I've listened to\n\n42:49.900 --> 42:52.380\n over COVID have really disappointed me\n\n42:52.380 --> 42:56.780\n because they have not spoken with empathy.\n\n42:56.780 --> 42:58.760\n They haven't sufficiently in my view\n\n42:58.760 --> 43:02.140\n have put their ego aside and really listened to people.\n\n43:02.140 --> 43:03.980\n Yes, people that don't have a PhD,\n\n43:03.980 --> 43:06.320\n people who have not really,\n\n43:07.860 --> 43:10.460\n maybe not even taken like a biology course in college\n\n43:10.460 --> 43:11.340\n or something like that.\n\n43:11.340 --> 43:16.340\n But still they have children, they worry, they fear.\n\n43:17.340 --> 43:19.000\n They don't know who to trust.\n\n43:19.000 --> 43:23.740\n They don't know if they should listen to the CEO of Pfizer\n\n43:23.740 --> 43:26.060\n who might have other incentives in mind,\n\n43:26.060 --> 43:29.060\n who might just care about money and nothing else.\n\n43:29.060 --> 43:32.580\n And so they just use common sense and they ask questions.\n\n43:32.580 --> 43:35.180\n And I think to them talking down to them\n\n43:35.180 --> 43:36.780\n as if they're not intelligent and so on\n\n43:36.780 --> 43:39.520\n is something scientists have done\n\n43:39.520 --> 43:40.660\n almost like rolled their eyes.\n\n43:40.660 --> 43:42.900\n And that disappoints me because I think\n\n43:42.900 --> 43:46.180\n that's kind of what is the source of division.\n\n43:46.180 --> 43:47.500\n Humility is a virtue.\n\n43:47.500 --> 43:48.340\n Yes.\n\n43:48.340 --> 43:51.580\n And the fact that you are educated\n\n43:51.580 --> 43:56.060\n doesn't mean that you are having either humility or empathy\n\n43:56.060 --> 43:58.680\n or you have good human qualities.\n\n43:58.680 --> 44:03.340\n This was never and will never be a metric\n\n44:03.340 --> 44:05.220\n of judging this type of virtues.\n\n44:06.420 --> 44:09.500\n Those that they do this, they're wrong.\n\n44:09.500 --> 44:13.900\n And actually they are not doing good service\n\n44:13.900 --> 44:15.900\n to the public health because they're undermining.\n\n44:15.900 --> 44:17.100\n People are not stupid.\n\n44:17.100 --> 44:21.300\n They see if you're not be respecting them\n\n44:21.300 --> 44:23.980\n and if you're not respecting their need to learn\n\n44:23.980 --> 44:25.220\n because that affects their health,\n\n44:25.220 --> 44:27.100\n the health of the mother, of the kids.\n\n44:27.100 --> 44:31.540\n So I fully agree with you that we should be very patient\n\n44:31.540 --> 44:36.080\n to explain again and again and again what is happening.\n\n44:36.080 --> 44:37.900\n And the vast majority of the people\n\n44:37.900 --> 44:39.740\n that they don't get vaccinations right now\n\n44:39.740 --> 44:41.140\n is because they're afraid.\n\n44:41.140 --> 44:42.540\n It's not for any other reason.\n\n44:42.540 --> 44:44.920\n It's not that they have an agenda.\n\n44:44.920 --> 44:48.820\n What I'm saying it is there is a small number of people\n\n44:48.820 --> 44:52.780\n that they have made business for them\n\n44:52.780 --> 44:56.820\n to profit from this anxiety.\n\n44:56.820 --> 44:58.020\n I'll give you an example.\n\n44:59.340 --> 45:00.900\n I have been arrested by FBI.\n\n45:00.900 --> 45:03.620\n This is what someone wrote.\n\n45:03.620 --> 45:05.460\n I read it, I laughed.\n\n45:05.460 --> 45:08.900\n I mean, okay, this is where they take it.\n\n45:08.900 --> 45:11.200\n There was a reason why they wrote it that.\n\n45:11.200 --> 45:13.060\n The Pfizer CEO was arrested by the FBI\n\n45:13.060 --> 45:15.200\n because they want to create doubts\n\n45:15.200 --> 45:18.020\n in the minds of the people that they're afraid\n\n45:18.020 --> 45:19.680\n and say, look, if the FBI arrested him,\n\n45:19.680 --> 45:21.460\n likely I will not do the vaccine.\n\n45:21.460 --> 45:22.900\n But I laughed.\n\n45:22.900 --> 45:27.900\n A week later, the wife of the Pfizer CEO died.\n\n45:29.700 --> 45:32.340\n There is a picture in this website of my wife.\n\n45:34.060 --> 45:36.900\n Someone sends to me, now I'm pissed.\n\n45:36.900 --> 45:38.540\n I'm not laughing.\n\n45:38.540 --> 45:41.020\n I tried to find my kids to tell them,\n\n45:41.020 --> 45:42.820\n if you read something, mom is fine.\n\n45:42.820 --> 45:44.140\n Don't worry.\n\n45:44.140 --> 45:49.140\n Then I remember that she has very old parents back in Greece.\n\n45:49.380 --> 45:51.340\n We start calling them to making sure\n\n45:51.340 --> 45:53.080\n because so you know that that will be picked up\n\n45:53.080 --> 45:56.100\n by Greek newspapers and they will publish it, okay?\n\n45:56.100 --> 45:58.380\n They are those people that wrote these things.\n\n45:58.380 --> 46:01.060\n They know very well that my wife didn't die\n\n46:01.060 --> 46:04.860\n and died because she was vaccinated, right?\n\n46:04.860 --> 46:09.860\n So this is the narratives that they are on purpose forming\n\n46:09.860 --> 46:14.860\n to profit from the stress and the anxiety of good people.\n\n46:18.540 --> 46:20.500\n And that's something I have to kind of,\n\n46:20.500 --> 46:23.540\n people that listen to this, that kind of doubt institutions,\n\n46:24.720 --> 46:29.220\n I do also want to say that there's quite a few folks\n\n46:29.220 --> 46:34.220\n who realize they can make money from saying,\n\n46:35.460 --> 46:37.860\n the man is lying to you.\n\n46:37.860 --> 46:40.300\n The government is lying to you.\n\n46:40.300 --> 46:42.460\n It's all corrupt.\n\n46:42.460 --> 46:43.880\n It's all a scam.\n\n46:44.740 --> 46:46.280\n Big pharma is lying to you.\n\n46:46.280 --> 46:48.360\n They're manipulating you.\n\n46:48.360 --> 46:51.700\n I'm surprised at how much money can be made with that.\n\n46:51.700 --> 46:52.700\n And it's sad.\n\n46:52.700 --> 46:56.580\n So you have to, just as people use their common sense\n\n46:56.580 --> 47:00.420\n to be skeptical when listening to politicians\n\n47:00.420 --> 47:03.340\n and powerful figures, they should be skeptical\n\n47:03.340 --> 47:06.980\n to also when listening to sort of the conspiracy theorists\n\n47:06.980 --> 47:08.740\n or not even the conspiracy theorists,\n\n47:08.740 --> 47:11.780\n but people who raise questions about institutions.\n\n47:11.780 --> 47:16.460\n Think on your own, think critically with an open mind\n\n47:16.460 --> 47:19.660\n that everyone can be manipulating you,\n\n47:19.660 --> 47:22.780\n but also everybody has the capacity to do good.\n\n47:22.780 --> 47:26.220\n And I think science in its pure form,\n\n47:26.220 --> 47:31.220\n not when entangled with institutions is a beautiful thing.\n\n47:31.220 --> 47:33.180\n And in the hands of many companies,\n\n47:33.180 --> 47:35.320\n it is a beautiful thing at scale.\n\n47:35.320 --> 47:39.520\n Still, you have a lot of incentive\n\n47:39.520 --> 47:42.720\n as having created the vaccine at Pfizer,\n\n47:42.720 --> 47:47.720\n this incredible technology to sing it praises.\n\n47:49.680 --> 47:53.700\n So there's a kind of, you know, people are skeptical,\n\n47:53.700 --> 47:55.840\n like how much do we trust,\n\n47:55.840 --> 48:00.760\n how excited Albert is about this vaccine.\n\n48:00.760 --> 48:04.640\n So for example, I mean, not to do a Shakespearean analysis\n\n48:04.640 --> 48:07.200\n of your Twitter, but I think he tweeted something\n\n48:07.200 --> 48:11.760\n about a study with a 100% efficacy of the vaccine\n\n48:11.760 --> 48:14.640\n or in stopping and transmission or something like that.\n\n48:15.840 --> 48:20.840\n Do you regret sort of being like over representing\n\n48:23.520 --> 48:24.880\n the effectiveness of the vaccine,\n\n48:24.880 --> 48:27.600\n technically saying correct things,\n\n48:27.600 --> 48:32.600\n but just kind of like highlighting the super positive things\n\n48:32.600 --> 48:36.320\n that may be misinterpreted, you know, saying 100%?\n\n48:36.320 --> 48:38.320\n No, I never said something 100%.\n\n48:38.320 --> 48:41.440\n Every time I speak, if a number is 100%,\n\n48:41.440 --> 48:44.520\n I rush to say that in biology, there is nothing 100%\n\n48:44.520 --> 48:45.680\n because always there will be\n\n48:45.680 --> 48:47.520\n when you go to the millions, okay?\n\n48:47.520 --> 48:50.120\n There were in the study things that were 100%,\n\n48:50.120 --> 48:52.720\n for example, deaths or in South Africa.\n\n48:52.720 --> 48:56.480\n When we tried, there was 100% efficacy.\n\n48:56.480 --> 48:58.140\n Clearly, it's more numbers.\n\n48:58.140 --> 49:00.880\n When the numbers will become much bigger,\n\n49:00.880 --> 49:04.840\n the 100% will not hold, but will be 95, 96.\n\n49:04.840 --> 49:07.280\n So still the direction of this is the point.\n\n49:07.280 --> 49:11.440\n So I'm very, very careful what I tweet.\n\n49:11.440 --> 49:15.640\n And in addition to how careful I am,\n\n49:15.640 --> 49:18.160\n I have people that they are looking at\n\n49:18.160 --> 49:20.440\n and they're having second or third opinions\n\n49:20.440 --> 49:22.480\n to make sure that we don't put, why?\n\n49:22.480 --> 49:24.880\n Because I know that people are listening to me right now,\n\n49:24.880 --> 49:27.760\n everything I say, and I want to make sure\n\n49:27.760 --> 49:32.680\n that they continue not only being clear\n\n49:32.680 --> 49:36.000\n as to what I want to say, so there are no misunderstandings,\n\n49:36.000 --> 49:38.600\n but also I maintain the trust of the people.\n\n49:38.600 --> 49:43.140\n I don't think that someone who only cherry picks information\n\n49:43.140 --> 49:45.920\n and only emphasizes positive things,\n\n49:45.920 --> 49:48.400\n it's someone that is the one to be trusted.\n\n49:48.400 --> 49:51.120\n And I want me and Pfizer to be trusted.\n\n49:52.080 --> 49:55.680\n So many felt the vaccine was presented as a cure\n\n49:55.680 --> 49:58.800\n that wouldn't require regular booster shots.\n\n49:58.800 --> 50:00.980\n Was that something you believed early on?\n\n50:00.980 --> 50:02.940\n Did you always believe that many regular shots\n\n50:02.940 --> 50:04.280\n would be required?\n\n50:04.280 --> 50:05.840\n And maybe in a bigger picture,\n\n50:05.840 --> 50:10.200\n how many do you think this will, for the Pfizer vaccine,\n\n50:10.200 --> 50:13.160\n is it something you see that's taking a booster shot\n\n50:13.160 --> 50:15.160\n regularly, like annually?\n\n50:15.160 --> 50:17.960\n Yes, in the beginning when we had the first months\n\n50:17.960 --> 50:20.000\n with the vaccine, people would ask me,\n\n50:20.000 --> 50:20.940\n do we need another one?\n\n50:20.940 --> 50:22.520\n And I said, we don't know.\n\n50:22.520 --> 50:24.280\n I was very clear about it.\n\n50:24.280 --> 50:27.080\n Then around April, May, I start seeing the first data\n\n50:27.080 --> 50:31.760\n and I made statements that I think we will need a booster\n\n50:31.760 --> 50:34.880\n around eight to 12 months after the second dose.\n\n50:34.880 --> 50:37.440\n And then after that, annually vaccinations,\n\n50:37.440 --> 50:39.000\n this is what I said,\n\n50:39.000 --> 50:41.380\n believe is one of the most likely scenarios.\n\n50:42.520 --> 50:44.400\n And it was based on the data that I had,\n\n50:44.400 --> 50:46.200\n but then Delta came.\n\n50:46.200 --> 50:48.960\n And because I always making the caveat\n\n50:48.960 --> 50:52.880\n that with absent a new variant with everything we know.\n\n50:52.880 --> 50:55.520\n With Delta, it was proven that we need the booster\n\n50:55.520 --> 50:58.120\n to move to the three, to the six months.\n\n50:58.120 --> 51:00.680\n And this is what happened.\n\n51:00.680 --> 51:05.440\n And I still said, I think the booster is a six months.\n\n51:05.440 --> 51:08.900\n And then I think it will be an annual revaccination likely.\n\n51:08.900 --> 51:10.840\n We have to monitor to see the data,\n\n51:10.840 --> 51:12.880\n but this is the likely scenario.\n\n51:12.880 --> 51:15.060\n Now we have Omicron.\n\n51:15.060 --> 51:19.040\n And Omicron says that two doses might be challenging.\n\n51:19.040 --> 51:22.760\n We don't know exactly yet, but three doses work.\n\n51:22.760 --> 51:26.200\n So clearly a lot of countries already started moving now\n\n51:26.200 --> 51:29.760\n the third dose, not from six months to three.\n\n51:29.760 --> 51:33.160\n So that they will reduce the period\n\n51:33.160 --> 51:38.160\n that people will not be protected with the third dose.\n\n51:39.840 --> 51:44.680\n I don't know with Omicron if how long this will last.\n\n51:44.680 --> 51:47.080\n And frankly, I don't know if we will need a new vaccine\n\n51:47.080 --> 51:51.120\n tailor made to Omicron based on everything we know so far.\n\n51:51.120 --> 51:53.240\n We are monitoring and we will know way more\n\n51:53.240 --> 51:54.720\n in the weeks to come.\n\n51:54.720 --> 51:58.200\n If there is a need for a new vaccine, we will have it.\n\n51:58.200 --> 52:00.640\n And if there is a need for mass production\n\n52:00.640 --> 52:04.160\n of this new vaccine, I can also feel very comfortable\n\n52:04.160 --> 52:06.680\n that we will not lose any of our capacity\n\n52:06.680 --> 52:08.080\n that we have developed.\n\n52:08.080 --> 52:12.560\n Right now we are running at 1 billion almost approximately\n\n52:12.560 --> 52:15.800\n doses per quarter, four per year.\n\n52:15.800 --> 52:18.860\n And if we have to switch and have half of that\n\n52:18.860 --> 52:20.120\n in the new, half of that in the old,\n\n52:20.120 --> 52:22.040\n we will do still 4 billion doses.\n\n52:22.040 --> 52:26.280\n So I think the world should feel very, very comfortable\n\n52:26.280 --> 52:30.000\n that if there is a need, we will be ahead of the virus.\n\n52:30.000 --> 52:33.200\n Yeah, you did, you delivered or produced 3 billion\n\n52:33.200 --> 52:35.480\n this year vaccines and you're on track\n\n52:35.480 --> 52:37.560\n to do 4 billion next year.\n\n52:37.560 --> 52:41.680\n I mean, if we had a lot more time,\n\n52:41.680 --> 52:43.360\n we would talk about how the heck you achieve\n\n52:43.360 --> 52:46.120\n that kind of scale, it's truly incredible.\n\n52:46.120 --> 52:48.320\n Let me ask the policy question.\n\n52:48.320 --> 52:51.120\n What are your feelings about vaccine mandates\n\n52:52.040 --> 52:56.480\n in terms of, do you think the most effective way\n\n52:56.480 --> 53:00.320\n to vaccinate the population is to acquire it?\n\n53:00.320 --> 53:04.840\n Or do you go with the American way\n\n53:04.840 --> 53:07.480\n and give people the freedom to choose?\n\n53:07.480 --> 53:12.080\n I think it is a very difficult topic\n\n53:12.080 --> 53:15.120\n and a very difficult decision for whoever needs to make it.\n\n53:15.120 --> 53:16.680\n And clearly it's not me.\n\n53:16.680 --> 53:19.040\n It is the public health officials of every country\n\n53:19.040 --> 53:21.280\n that they have to make this decision.\n\n53:21.280 --> 53:24.720\n I have to make the decision for Pfizer employees.\n\n53:24.720 --> 53:29.720\n And I had to balance the fear of those that they work,\n\n53:31.920 --> 53:35.040\n that they want to feel that the others are vaccinated\n\n53:35.040 --> 53:36.720\n and the fear of those that they don't want\n\n53:36.720 --> 53:38.040\n to get the vaccine.\n\n53:38.040 --> 53:40.640\n And eventually I came to the decision\n\n53:40.640 --> 53:42.920\n that we will mandate it at Pfizer.\n\n53:42.920 --> 53:44.960\n We are flexible, we are giving exceptions,\n\n53:44.960 --> 53:47.960\n of course for health, maybe some religions,\n\n53:47.960 --> 53:51.160\n but we decided to mandate it.\n\n53:51.160 --> 53:54.960\n Now, at Pfizer, when we did this decision,\n\n53:54.960 --> 53:57.280\n we were at 90% vaccination rates\n\n53:57.280 --> 53:59.640\n when we said we are going to mandate it.\n\n53:59.640 --> 54:02.840\n And that took it up to 96.\n\n54:03.800 --> 54:05.480\n It works, right?\n\n54:06.440 --> 54:10.200\n This 10% was never going to move, I felt.\n\n54:10.200 --> 54:12.680\n Because no matter what, you have a small number of people\n\n54:12.680 --> 54:14.600\n that really are scared.\n\n54:14.600 --> 54:17.320\n And they don't feel comfortable to do it, okay?\n\n54:17.320 --> 54:20.440\n It worked in our case, we took it to 96%.\n\n54:20.440 --> 54:22.240\n I'm happy for those people.\n\n54:22.240 --> 54:25.480\n A lot will not disease and some will not die\n\n54:25.480 --> 54:26.600\n of those people.\n\n54:26.600 --> 54:29.880\n But it's not me to say, because the debate,\n\n54:31.000 --> 54:32.680\n it's serious debate.\n\n54:32.680 --> 54:34.520\n And there are a lot of pros and cons\n\n54:34.520 --> 54:35.760\n if you need to push people,\n\n54:35.760 --> 54:38.440\n if you need to give them the freedom.\n\n54:38.440 --> 54:42.600\n And it comes with the territory.\n\n54:42.600 --> 54:45.440\n If you are elected to run a country,\n\n54:45.440 --> 54:47.680\n you should be ready to make difficult decisions.\n\n54:47.680 --> 54:49.120\n And no matter what decision you make,\n\n54:49.120 --> 54:50.720\n there will be fake stories written about you\n\n54:50.720 --> 54:51.760\n as we talked about.\n\n54:51.760 --> 54:53.840\n You will not be able to please everyone.\n\n54:53.840 --> 54:54.680\n Yes.\n\n54:55.920 --> 54:57.920\n Well, let me just say that I think,\n\n54:57.920 --> 54:59.640\n again, coming from the Soviet Union,\n\n54:59.640 --> 55:01.960\n I think at the public level, at the federal level,\n\n55:01.960 --> 55:06.760\n mandates is a really bad idea.\n\n55:06.760 --> 55:09.880\n Even if it's good for the health of the populace,\n\n55:10.760 --> 55:12.280\n there's something about preserving the freedom\n\n55:12.280 --> 55:14.560\n is really powerful about this country.\n\n55:14.560 --> 55:17.000\n Like doing the hard work of convincing people\n\n55:17.000 --> 55:20.440\n to get vaccinated, to choose to get vaccinated\n\n55:20.440 --> 55:23.520\n if they want, but still have the freedom not to.\n\n55:23.520 --> 55:25.720\n That's a really powerful freedom.\n\n55:25.720 --> 55:28.400\n To me, it's super lazy to mandate.\n\n55:28.400 --> 55:31.080\n People should understand the science\n\n55:31.080 --> 55:32.720\n and want to get vaccinated.\n\n55:38.480 --> 55:41.520\n Do you think children need to get vaccinated?\n\n55:41.520 --> 55:42.360\n I do.\n\n55:42.360 --> 55:44.560\n I do think that they need to get vaccinated.\n\n55:44.560 --> 55:47.800\n So age ranges five to 16.\n\n55:48.840 --> 55:50.800\n There's a lot of parents\n\n55:53.400 --> 55:56.160\n that fear for the wellbeing of their children.\n\n55:56.160 --> 55:57.920\n Can you empathize with those parents?\n\n55:57.920 --> 56:01.080\n Can you steel man their arguments\n\n56:01.080 --> 56:04.120\n against the vaccine for their children?\n\n56:04.120 --> 56:06.120\n You know, because people know who I am.\n\n56:06.120 --> 56:12.560\n I had the opportunity to interact with parents\n\n56:12.560 --> 56:15.280\n before that was, let's say, approved.\n\n56:15.280 --> 56:18.800\n And there were so many, way more,\n\n56:18.800 --> 56:21.720\n that I had a lot of empathy\n\n56:21.720 --> 56:24.080\n because they were afraid for their kids\n\n56:24.080 --> 56:26.720\n because they didn't have a vaccine.\n\n56:26.720 --> 56:30.240\n And they were the ones that were speaking at that time.\n\n56:30.240 --> 56:31.120\n Bring me vaccine.\n\n56:31.120 --> 56:32.720\n When are you going to bring me a vaccine?\n\n56:32.720 --> 56:33.800\n I really fear.\n\n56:33.800 --> 56:35.400\n I feel that this is unfair,\n\n56:35.400 --> 56:36.640\n but I am protected.\n\n56:36.640 --> 56:38.440\n My husband is protected.\n\n56:38.440 --> 56:39.720\n My old son is protected.\n\n56:39.720 --> 56:41.760\n And my little sweetheart,\n\n56:41.760 --> 56:44.440\n because she's below the age, is not protected.\n\n56:45.600 --> 56:47.440\n Now that we have the vaccines,\n\n56:47.440 --> 56:50.600\n I'm sure that those that they are afraid of the vaccine,\n\n56:50.600 --> 56:51.680\n not of the disease,\n\n56:51.680 --> 56:54.440\n which are smaller number, admittedly.\n\n56:54.440 --> 56:57.480\n Also, they will have, if they're afraid of them,\n\n56:57.480 --> 57:00.080\n I'm sure that they will afraid even more about their kids\n\n57:00.080 --> 57:02.240\n because they love, I would say,\n\n57:02.240 --> 57:04.040\n more than they love themselves.\n\n57:04.040 --> 57:06.400\n So it's going to be this situation.\n\n57:06.400 --> 57:08.800\n And again, the same.\n\n57:08.800 --> 57:12.200\n How can you do to demonstrate, to convince people,\n\n57:12.200 --> 57:14.000\n to win the minds and the hearts of the people\n\n57:14.000 --> 57:15.240\n that this is the right thing to do?\n\n57:15.240 --> 57:16.720\n What do you think about that calculation?\n\n57:16.720 --> 57:19.480\n Because the risk for kids is very low.\n\n57:19.480 --> 57:20.840\n Kids do die.\n\n57:20.840 --> 57:22.880\n Kids do go to the hospital from COVID.\n\n57:22.880 --> 57:23.840\n Yes.\n\n57:23.840 --> 57:25.600\n But the rate is very low.\n\n57:25.600 --> 57:30.000\n The rate is lower, but kids, they do die.\n\n57:30.000 --> 57:32.600\n And how can you say that I'm not going to,\n\n57:32.600 --> 57:34.520\n I'm not going to protect a kid\n\n57:34.520 --> 57:36.960\n for something that it is likely to happen?\n\n57:36.960 --> 57:38.400\n And it is not only that.\n\n57:38.400 --> 57:39.800\n What happens in the school\n\n57:39.800 --> 57:42.600\n when they stop the education process\n\n57:42.600 --> 57:44.840\n because a kid got the disease\n\n57:44.840 --> 57:48.320\n and they don't have vaccines so that they can control.\n\n57:48.320 --> 57:50.720\n It is such a big disruption\n\n57:50.720 --> 57:55.720\n and such a big risk for the health of the kids\n\n57:58.160 --> 57:59.720\n that it shouldn't be a debate.\n\n57:59.720 --> 58:03.920\n Look, how many kids are having polio right now?\n\n58:06.000 --> 58:08.480\n Way fewer number than those\n\n58:08.480 --> 58:11.480\n that they're having COVID in the hospital.\n\n58:11.480 --> 58:13.280\n But everybody's getting the vaccine.\n\n58:14.920 --> 58:17.160\n Well, polio was deadlier for kids.\n\n58:17.160 --> 58:18.280\n But it's not now.\n\n58:18.280 --> 58:20.520\n So why a kid to do it now?\n\n58:21.960 --> 58:23.600\n Because it needs to be protected.\n\n58:23.600 --> 58:26.040\n Well, the unique thing about the COVID vaccine\n\n58:26.040 --> 58:28.240\n is a new type of technology too.\n\n58:28.240 --> 58:30.800\n So there's an extra concern.\n\n58:30.800 --> 58:33.440\n Choosing to vaccinate a child,\n\n58:33.440 --> 58:36.560\n you're making a choice that can potentially hurt them.\n\n58:37.760 --> 58:39.480\n That's the way parents that are hesitant\n\n58:39.480 --> 58:41.680\n about the vaccine think.\n\n58:41.680 --> 58:46.680\n I think choosing to vaccinate children makes a choice\n\n58:47.040 --> 58:49.320\n so that something could not potentially hurt them,\n\n58:49.320 --> 58:50.280\n which is the disease.\n\n58:50.280 --> 58:54.000\n That's why we are doing vaccinations since ever.\n\n58:54.000 --> 58:57.360\n I know that there are people\n\n58:57.360 --> 59:00.360\n that they're concerned for themselves and for their kids.\n\n59:00.360 --> 59:05.360\n What I know it is that I'm a scientist and I'm a parent.\n\n59:05.720 --> 59:09.160\n And I am telling you that vaccines\n\n59:09.160 --> 59:10.440\n is a very good thing for kids.\n\n59:10.440 --> 59:12.520\n And thank God we were able to develop.\n\n59:14.720 --> 59:16.960\n So we've talked quite a bit about the vaccine,\n\n59:16.960 --> 59:18.480\n but there's an incredible new technology\n\n59:18.480 --> 59:20.120\n that Pfizer is developing\n\n59:20.120 --> 59:24.000\n with the PaxLovid antiviral for COVID.\n\n59:24.000 --> 59:26.320\n Where does that stand?\n\n59:26.320 --> 59:28.640\n How does that work?\n\n59:28.640 --> 59:33.440\n And how are you able to develop it in four months?\n\n59:33.440 --> 59:36.400\n Like you said, and all of that in just a few minutes.\n\n59:37.440 --> 59:39.320\n First of all, what this is about,\n\n59:39.320 --> 59:41.920\n this is a real game changer.\n\n59:41.920 --> 59:44.120\n This is a course of treatment\n\n59:44.120 --> 59:47.080\n that you get only if you get the disease, you get COVID.\n\n59:48.280 --> 59:51.960\n Then what happens is that you will take for five days,\n\n59:51.960 --> 59:56.600\n pills day and night, and twice a day for five days.\n\n59:56.600 --> 59:59.040\n And instead of 10 people from those that disease\n\n59:59.040 --> 1:00:01.400\n to go to hospital, only one will go.\n\n1:00:02.440 --> 1:00:06.080\n This is an end with all the caveats\n\n1:00:06.080 --> 1:00:08.440\n that the numbers are small, no one died.\n\n1:00:08.440 --> 1:00:11.280\n It was 100% efficacy on deaths.\n\n1:00:11.280 --> 1:00:14.760\n Of course, I'm sure that in real world,\n\n1:00:14.760 --> 1:00:16.080\n when the numbers are getting very high,\n\n1:00:16.080 --> 1:00:18.760\n we may have 99 instead of 100.\n\n1:00:18.760 --> 1:00:23.240\n But these are spectacular results\n\n1:00:23.240 --> 1:00:25.880\n for something that you can take home and stay home.\n\n1:00:25.880 --> 1:00:29.120\n The biggest problem right now in Europe, in the US,\n\n1:00:29.120 --> 1:00:30.320\n when we have surges,\n\n1:00:30.320 --> 1:00:34.200\n every time that we have a surge of COVID,\n\n1:00:34.200 --> 1:00:36.880\n it is that the ICUs are full,\n\n1:00:36.880 --> 1:00:39.240\n the hospitals are paralyzed,\n\n1:00:39.240 --> 1:00:41.920\n they have to postpone elective surgeries,\n\n1:00:41.920 --> 1:00:43.440\n they have to postpone other operations\n\n1:00:43.440 --> 1:00:46.960\n because they don't have the capacity because of that.\n\n1:00:46.960 --> 1:00:50.520\n Keeping people out of the hospitals, home,\n\n1:00:50.520 --> 1:00:54.680\n keeping people without dying,\n\n1:00:55.800 --> 1:00:57.800\n it is something that I didn't have before.\n\n1:00:59.200 --> 1:01:02.760\n And this is a significant, significant game changer.\n\n1:01:03.880 --> 1:01:08.120\n I have to ask a controversial, difficult question.\n\n1:01:08.120 --> 1:01:11.720\n What are your thoughts about ivermectin?\n\n1:01:11.720 --> 1:01:14.160\n Has it sufficiently been studied?\n\n1:01:14.160 --> 1:01:17.200\n Has Pfizer considered it in its, like I said,\n\n1:01:17.200 --> 1:01:19.360\n incredible development of the antiviral\n\n1:01:20.400 --> 1:01:22.920\n as a comparator or that kind of thing?\n\n1:01:22.920 --> 1:01:25.000\n Just investigate it in general.\n\n1:01:25.000 --> 1:01:26.840\n The reason I bring it up,\n\n1:01:26.840 --> 1:01:30.400\n because I've read quite a few criticisms of people.\n\n1:01:30.400 --> 1:01:31.560\n There's been some comparisons\n\n1:01:31.560 --> 1:01:33.400\n of paxilovir to the ivermectin,\n\n1:01:33.400 --> 1:01:36.200\n and I think people should look up.\n\n1:01:36.200 --> 1:01:39.480\n There is Dr. John Campbell that describes that comparison\n\n1:01:39.480 --> 1:01:40.440\n and makes that claim,\n\n1:01:40.440 --> 1:01:42.800\n and there's quite a lot of people that debunk\n\n1:01:42.800 --> 1:01:44.520\n or argue against that.\n\n1:01:44.520 --> 1:01:46.240\n You can do your own research,\n\n1:01:46.240 --> 1:01:48.920\n but there is a lot of people that kind of see\n\n1:01:48.920 --> 1:01:52.400\n this free drug without patents on it\n\n1:01:52.400 --> 1:01:54.280\n and say this could be the savior.\n\n1:01:54.280 --> 1:01:57.160\n So can you just speak to that comparison?\n\n1:01:57.160 --> 1:01:58.160\n It's not the first time.\n\n1:01:58.160 --> 1:02:00.600\n If you remember, there were other compounds\n\n1:02:00.600 --> 1:02:05.600\n that were claimed that they are the solution to COVID,\n\n1:02:08.320 --> 1:02:12.560\n and clearly they were proving that they're not.\n\n1:02:12.560 --> 1:02:13.960\n There are compounds that are solutions\n\n1:02:13.960 --> 1:02:15.400\n and compounds that are not.\n\n1:02:15.400 --> 1:02:19.080\n I, as a scientist, and I discuss with our scientists,\n\n1:02:19.080 --> 1:02:24.080\n they don't see any reason why a medicine like ivermectin,\n\n1:02:24.520 --> 1:02:25.800\n which is a parasitic site,\n\n1:02:25.800 --> 1:02:28.640\n to be able to act on COVID,\n\n1:02:28.640 --> 1:02:31.680\n and so they don't see that there's any connection,\n\n1:02:31.680 --> 1:02:34.840\n and they haven't seen any paper\n\n1:02:34.840 --> 1:02:37.920\n that describes someone that used it that had any results.\n\n1:02:37.920 --> 1:02:40.840\n I'm sure that there will be some people that will claim,\n\n1:02:40.840 --> 1:02:43.000\n because people are claiming anything,\n\n1:02:43.000 --> 1:02:46.760\n but I don't think that there was any paper\n\n1:02:46.760 --> 1:02:49.240\n in any peer review magazine,\n\n1:02:49.240 --> 1:02:52.920\n any reliable scientific magazine, to support this claim.\n\n1:02:52.920 --> 1:02:56.680\n So we are focusing on saving people's lives.\n\n1:02:56.680 --> 1:03:01.680\n We are not focusing on craziness.\n\n1:03:02.080 --> 1:03:06.560\n Well, to push back, there is quite a lot of papers,\n\n1:03:06.560 --> 1:03:08.000\n but the studies are small,\n\n1:03:08.000 --> 1:03:10.320\n so there's no conclusive evidence, and that's the point.\n\n1:03:10.320 --> 1:03:12.920\n I haven't seen any that it is reliable.\n\n1:03:12.920 --> 1:03:16.840\n I don't know where are these, small or big, reliable.\n\n1:03:16.840 --> 1:03:18.300\n I haven't seen any.\n\n1:03:18.300 --> 1:03:21.400\n Well, some of the big ones have been retracted,\n\n1:03:21.400 --> 1:03:24.040\n which means they weren't legitimate.\n\n1:03:24.040 --> 1:03:24.860\n Yes.\n\n1:03:24.860 --> 1:03:25.700\n Yeah, so?\n\n1:03:27.000 --> 1:03:29.160\n This is definitely something that people need to look into,\n\n1:03:29.160 --> 1:03:31.880\n the people that kind of question\n\n1:03:31.880 --> 1:03:33.280\n are the effectiveness of ivermectin,\n\n1:03:33.280 --> 1:03:35.600\n definitely something to think about,\n\n1:03:35.600 --> 1:03:37.600\n and I think it's the reason that past public.\n\n1:03:37.600 --> 1:03:39.200\n It was chloroquine alone before.\n\n1:03:39.200 --> 1:03:40.320\n Yes.\n\n1:03:40.320 --> 1:03:41.440\n For God's sake.\n\n1:03:41.440 --> 1:03:42.280\n That's why PaxLovid.\n\n1:03:42.280 --> 1:03:44.180\n How many people died because of that?\n\n1:03:45.640 --> 1:03:48.580\n Yeah, this is the dangerous thing.\n\n1:03:48.580 --> 1:03:49.840\n This is the sad thing.\n\n1:03:51.720 --> 1:03:53.760\n PaxLovid has been studying thousands of people\n\n1:03:53.760 --> 1:03:58.200\n and will be under the scrutiny, not only of regulators,\n\n1:03:58.200 --> 1:04:00.960\n but as we will go into the implementation,\n\n1:04:00.960 --> 1:04:02.600\n as it happened in many countries,\n\n1:04:02.600 --> 1:04:04.880\n they will monitor to see what's happened.\n\n1:04:04.880 --> 1:04:07.800\n Let's say that whatever we do, once it is out there,\n\n1:04:07.800 --> 1:04:10.640\n within a few weeks, they will know all hospitals,\n\n1:04:10.640 --> 1:04:13.840\n if it works or not, because they will see the statistics.\n\n1:04:13.840 --> 1:04:18.360\n We've gone through one of the more difficult periods\n\n1:04:19.320 --> 1:04:21.760\n in recent human history over the past two years,\n\n1:04:21.760 --> 1:04:23.240\n like as a society.\n\n1:04:23.240 --> 1:04:26.340\n What gives you hope about the future\n\n1:04:26.340 --> 1:04:28.120\n for our human civilization?\n\n1:04:29.480 --> 1:04:31.720\n You look into the next few years.\n\n1:04:31.720 --> 1:04:34.080\n I think the human ingenuity.\n\n1:04:34.080 --> 1:04:36.920\n I think although there is,\n\n1:04:36.920 --> 1:04:39.160\n the world always is progressing,\n\n1:04:39.160 --> 1:04:40.400\n although there are a lot of things\n\n1:04:40.400 --> 1:04:44.640\n that need to be fixed in the society of 2020.\n\n1:04:45.960 --> 1:04:49.800\n The society of 2020 is better at large\n\n1:04:49.800 --> 1:04:53.160\n than things 50 years back, 100 years back,\n\n1:04:53.160 --> 1:04:56.360\n in all different aspects, from poverty,\n\n1:04:56.360 --> 1:05:00.880\n for human rights, from science,\n\n1:05:00.880 --> 1:05:03.440\n from quality of life, from any aspect.\n\n1:05:03.440 --> 1:05:08.440\n I am positive that humans can create\n\n1:05:09.240 --> 1:05:11.240\n and always create a better future\n\n1:05:11.240 --> 1:05:12.560\n and will continue doing so.\n\n1:05:14.560 --> 1:05:17.800\n You have helped save the lives of millions of people,\n\n1:05:17.800 --> 1:05:20.080\n helped improve the quality of their lives,\n\n1:05:20.080 --> 1:05:24.240\n but you yourself are just one biological organism\n\n1:05:24.240 --> 1:05:26.120\n with an expiration date.\n\n1:05:26.120 --> 1:05:28.200\n Do you ponder your mortality?\n\n1:05:28.200 --> 1:05:30.440\n Do you think about your death?\n\n1:05:30.440 --> 1:05:32.400\n Are you afraid of death?\n\n1:05:32.400 --> 1:05:34.240\n That's a very interesting question.\n\n1:05:34.240 --> 1:05:37.160\n I was discussing with a lot of people\n\n1:05:37.160 --> 1:05:40.080\n that I was fearless of death, I couldn't care less,\n\n1:05:40.080 --> 1:05:41.940\n when I was young.\n\n1:05:41.940 --> 1:05:46.320\n The first time that I start feeling\n\n1:05:46.320 --> 1:05:49.960\n that I want to be around was when I had kids.\n\n1:05:49.960 --> 1:05:52.120\n And then I started feeling that,\n\n1:05:52.120 --> 1:05:56.400\n oh gosh, I hope I will be around to see their wedding.\n\n1:05:56.400 --> 1:05:59.720\n I hope they will be around to see their children.\n\n1:05:59.720 --> 1:06:02.640\n So if there is something that scares me,\n\n1:06:02.640 --> 1:06:05.560\n the possibility I will not be part of their lives anymore\n\n1:06:05.560 --> 1:06:06.760\n and I will not be watching.\n\n1:06:06.760 --> 1:06:09.000\n I hope there is life upstairs,\n\n1:06:09.000 --> 1:06:11.720\n so I will be able to watch them from there.\n\n1:06:11.720 --> 1:06:14.020\n From upstairs, get a nice overview.\n\n1:06:15.720 --> 1:06:17.720\n Let me ask the big ridiculous question.\n\n1:06:19.320 --> 1:06:22.960\n And you only have two minutes or less to answer it.\n\n1:06:22.960 --> 1:06:24.320\n What is the meaning of life?\n\n1:06:24.320 --> 1:06:26.020\n What's the meaning of this whole thing?\n\n1:06:26.020 --> 1:06:29.000\n You said ingenuity is the thing that gives you hope.\n\n1:06:29.000 --> 1:06:31.320\n We seem to be all busy trying to help each other,\n\n1:06:31.320 --> 1:06:33.040\n trying to build a better world.\n\n1:06:33.040 --> 1:06:34.160\n Why are we doing that?\n\n1:06:34.160 --> 1:06:38.680\n I would repeat something that Steve Jobs has said.\n\n1:06:38.680 --> 1:06:41.520\n Death is life's biggest invention.\n\n1:06:42.720 --> 1:06:46.320\n It eliminates the old and gives place to the new.\n\n1:06:47.480 --> 1:06:50.600\n Life is all about moving forward.\n\n1:06:51.520 --> 1:06:56.520\n Life is all about creating new things.\n\n1:06:56.520 --> 1:07:00.120\n And maybe everyone is a contributor,\n\n1:07:00.120 --> 1:07:01.600\n but no one is the owner.\n\n1:07:03.000 --> 1:07:05.200\n And always creating something new.\n\n1:07:05.200 --> 1:07:06.320\n Always.\n\n1:07:06.320 --> 1:07:08.080\n Adding something beautiful into the world,\n\n1:07:08.080 --> 1:07:09.440\n maybe a little bit of love.\n\n1:07:10.480 --> 1:07:11.700\n Hopefully.\n\n1:07:11.700 --> 1:07:12.840\n Albert, thank you so much.\n\n1:07:12.840 --> 1:07:15.680\n It's a huge honor that you go through\n\n1:07:15.680 --> 1:07:18.200\n some of these difficult questions with me today\n\n1:07:18.200 --> 1:07:20.840\n and that you give your extremely valuable time\n\n1:07:20.840 --> 1:07:21.840\n for this conversation.\n\n1:07:21.840 --> 1:07:23.000\n Thank you so much for talking today.\n\n1:07:23.000 --> 1:07:25.520\n Thank you for your interest and I'm happy,\n\n1:07:25.520 --> 1:07:26.640\n as I was telling you before,\n\n1:07:26.640 --> 1:07:31.640\n but I can brag with my kids that I was in your podcast\n\n1:07:31.680 --> 1:07:33.320\n because you are their hero.\n\n1:07:33.320 --> 1:07:34.160\n You made it.\n\n1:07:34.160 --> 1:07:35.680\n I made it.\n\n1:07:35.680 --> 1:07:36.520\n Thank you.\n\n1:07:36.520 --> 1:07:37.680\n Thank you.\n\n1:07:37.680 --> 1:07:40.600\n Thanks for listening to this conversation with Albert Burla.\n\n1:07:40.600 --> 1:07:41.880\n To support this podcast,\n\n1:07:41.880 --> 1:07:44.440\n please check out our sponsors in the description.\n\n1:07:44.440 --> 1:07:48.400\n And now, let me leave you with some words from Oscar Wilde.\n\n1:07:48.400 --> 1:07:52.320\n The truth is rarely pure and never simple.\n\n1:07:52.320 --> 1:07:55.480\n Thank you for listening and hope to see you next time.\n\n"
}