{
  "title": "Silvio Micali: Cryptocurrency, Blockchain, Algorand, Bitcoin & Ethereum | Lex Fridman Podcast #168",
  "id": "zNdhgOk4-fE",
  "transcript": "WEBVTT\n\n00:00.000 --> 00:04.800\n The following is a conversation with Silvio McCauley, a computer scientist at MIT,\n\n00:04.800 --> 00:10.320\n winner of the Turing Award, and one of the leading minds in the fields of cryptography,\n\n00:10.320 --> 00:16.320\n information security, game theory, and most recently, cryptocurrency and the theoretical\n\n00:16.320 --> 00:23.600\n foundations of a fully decentralized, secure, and scalable blockchain at Algorand, a company\n\n00:23.600 --> 00:28.480\n of cryptographers, engineers, and mathematicians that he founded in 2017.\n\n00:28.480 --> 00:35.360\n Quick mention of our sponsors. Athletic Greens Nutrition Drink, the Information In Depth Tech\n\n00:35.360 --> 00:42.480\n Journalism website, Four Sigmatic Mushroom Coffee, and BetterHelp Online Therapy. Click the sponsor\n\n00:42.480 --> 00:47.280\n links to get a discount and to support this podcast. As a side note, let me say that I will\n\n00:47.280 --> 00:53.280\n be having many conversations this year on the topic of cryptocurrency. I'm reading and thinking\n\n00:53.280 --> 00:59.520\n and thinking a lot on this topic. I just recently finished reading The Bitcoin Standard, a book I\n\n00:59.520 --> 01:04.960\n highly recommend. As always, with this podcast, I'm approaching it with an open mind, with\n\n01:04.960 --> 01:12.480\n compassion, with as little ego as possible, and yes, with love. I hope you go along with me on\n\n01:12.480 --> 01:20.160\n this journey and don't judge me too harshly on any likely missteps. As usual, I will play devil's\n\n01:20.160 --> 01:27.840\n advocate. I will, on purpose, sometimes ask simple, even dumb questions, all to try and explore the\n\n01:27.840 --> 01:33.840\n space of ideas here with as much grace as I can muster. I have no financial interests here. I\n\n01:33.840 --> 01:39.680\n only have a simple curiosity and a love for knowledge, especially about a set of technologies\n\n01:39.680 --> 01:45.680\n that may very well transform the fabric of human civilization. If you enjoy this thing,\n\n01:45.680 --> 01:51.520\n subscribe on YouTube, review it on Apple Podcasts, follow on Spotify, support it on Patreon, or\n\n01:51.520 --> 01:58.080\n connect with me on Twitter at Lex Friedman. And now here's my conversation with Silvio McCauley.\n\n01:59.200 --> 02:05.520\n Let's start with the big and the basic question. What is a blockchain? And why is it interesting?\n\n02:05.520 --> 02:11.920\n Why is it fascinating? Why is it powerful? All right. So a blockchain, think of it, is really\n\n02:11.920 --> 02:19.600\n a common database distributed. Think about it as a ledger in which everybody can write an entry\n\n02:19.600 --> 02:26.640\n in a page. You can write, I can write, and everybody can read, and you have a guarantee\n\n02:26.640 --> 02:32.000\n that everybody has the same copy of the ledger that is in front of you. So whatever you see on\n\n02:32.000 --> 02:40.560\n page seven, anyone else sees on page seven. So what is extraordinary about this is this common\n\n02:40.560 --> 02:48.160\n knowledge thing that I think is really a first for humanity. I mean, if you look at communication,\n\n02:48.880 --> 02:57.520\n like right now, you can communicate very quickly images, photos, but do you have a certainty that\n\n02:57.520 --> 03:02.880\n whatever you have received has been received by everybody else? Not really. And so there's a\n\n03:02.880 --> 03:09.280\n commonality of knowledge and the certainty that everybody can write, nobody has been prevented\n\n03:09.280 --> 03:14.320\n from writing whatever they want. Nobody can erase. Nobody can tear a page of a ledger.\n\n03:14.320 --> 03:20.960\n Nobody can swap page. Nobody can change anything. And that is immutable common record is\n\n03:21.920 --> 03:27.920\n extremely powerful. And there's something fundamental that is decentralized about it.\n\n03:27.920 --> 03:33.600\n So at least in spirit, some degree against maybe a resistance to centralization.\n\n03:33.600 --> 03:41.520\n Absolutely. If it is not decentralized, how can it be common knowledge? If only one person or a\n\n03:41.520 --> 03:47.680\n few people have a ledger, you don't have a ledger, you have to ask, you know, what is on page seven?\n\n03:47.680 --> 03:52.400\n And how do you know that whatever they tell you is on page seven, they tell the same thing to\n\n03:52.400 --> 04:02.000\n everybody else. And so this commonality is extremely powerful. Just to give you an example,\n\n04:02.000 --> 04:08.080\n assume that you do an auction, okay? You have worked very hard, you build a building,\n\n04:08.880 --> 04:14.800\n and now you want to auction it off. Makes sense because you want to auction worldwide,\n\n04:14.800 --> 04:18.720\n better yet, you want to tokenize the building and sell it in all in parcels.\n\n04:20.320 --> 04:26.400\n Now, everybody sees the bids. And you know that everybody sees the bids. You and I see the same\n\n04:26.400 --> 04:32.000\n bids, and so does everybody else. So you know that a fair price has reached, and you know who owns\n\n04:32.000 --> 04:39.440\n what and who has spent how much. And if you do it instead of, otherwise, in a centralized system,\n\n04:39.440 --> 04:46.400\n I put a bid saying, oh, congratulations, Alex, you won, and your price is $12,570. How do you know?\n\n04:47.840 --> 04:56.000\n So if instead of this common knowledge is a very powerful tool for humanity.\n\n04:56.000 --> 05:00.320\n So we return to it from a bunch of different perspectives, including like a technical\n\n05:00.320 --> 05:09.040\n perspective. But you often talk about blockchain and some of these concepts of decentralization,\n\n05:09.040 --> 05:16.960\n scalability, security, all those kinds of things. But one of the most maybe impactful, exciting\n\n05:17.760 --> 05:25.280\n things that leverage the blockchain, this kind of ledger idea of common knowledge is cryptocurrency.\n\n05:25.280 --> 05:31.440\n So in the financial space. So is there, can you say in the same kind of basic way,\n\n05:31.440 --> 05:36.320\n what is cryptocurrency in the context of this common knowledge and in the context of the blockchain?\n\n05:37.040 --> 05:44.320\n Great. Cryptocurrency is a currency that is on such a ledger. So imagine that on the ledger,\n\n05:45.280 --> 05:52.000\n initially, you know that somehow, say you and I are the only owner, each one, let's give it\n\n05:52.000 --> 06:01.040\n ourselves a billion each of whatever this unit. Then I start writing on the ledger,\n\n06:01.040 --> 06:08.240\n I give 100 of these units to my sister, I give this much to my aunt. And then now,\n\n06:08.240 --> 06:13.440\n because it's written on the ledger and everybody can see, my sister can give 57 of these units\n\n06:13.440 --> 06:19.520\n that she received from me to somebody else. And that is money. And that is money because\n\n06:19.520 --> 06:26.400\n you can see that somebody who tenders your payment has really the money there. You don't\n\n06:26.400 --> 06:31.280\n have any more of a doubt when you want to sell an item. If I write you a check, is the check covered?\n\n06:33.680 --> 06:38.800\n Or do I have the money at the moment of a transaction? You really see because the ledger\n\n06:38.800 --> 06:44.560\n is always updated. What you see is what I see, what the merchant sees. You know that the money,\n\n06:44.560 --> 06:52.640\n the money is the most powerful money system there is because it is totally transparent. And so you\n\n06:52.640 --> 06:58.000\n know that you have been paid, and you know that the money is there, you have not to second guess\n\n06:58.000 --> 07:04.000\n anything else. So the common knowledge applied there is you're basically mimicking the same kind\n\n07:04.000 --> 07:10.320\n of thing you would get in the physical space, which is if you give 100 bucks or 100 of that\n\n07:10.320 --> 07:18.480\n thing, whatever of that cryptocurrency to your sister, the actual transfer is as real as you\n\n07:18.480 --> 07:28.880\n giving like a basket of apples to your sister. So in the case in the physical space, the common\n\n07:28.880 --> 07:35.280\n knowledge is in the physics of the atoms. And then it's digital space, the common knowledge\n\n07:35.280 --> 07:43.440\n is in this ledger. And so that transfer holds the same kind of power, but now it's operating\n\n07:43.440 --> 07:52.000\n in the digital space. Again, I apologize for a set of ridiculous questions, but you mentioned\n\n07:52.960 --> 08:00.320\n cryptocurrencies and money. What is money? Why do we have money? Do you think about this\n\n08:00.320 --> 08:08.720\n kind of from this high philosophical level at times of this tool, this idea that we humans\n\n08:08.720 --> 08:13.120\n have all kind of came up with and seem to be using effectively to do stuff?\n\n08:15.360 --> 08:22.720\n Money is a social construct, okay, in my opinion. And this has been somehow people always felt\n\n08:22.720 --> 08:30.400\n that somehow money is a way to allow us to transact, even though we want different things. So\n\n08:30.400 --> 08:39.760\n I have two sheep, and then you have one cow, and I want the cow, but you are looking for\n\n08:39.760 --> 08:44.880\n blankets instead, you know, so to have money is really simplifies this. But at the end of\n\n08:44.880 --> 08:49.600\n it, that's why a bit was invented. And you started with gold, you started with\n\n08:49.600 --> 08:56.080\n the coinage, then you started with the check. But at the end of the day, money is essentially\n\n08:56.080 --> 09:01.680\n a social construct because you know that what you receive, you can actually spend with somebody\n\n09:01.680 --> 09:08.880\n else. And so there is a kind of a social pact and social belief that you have. At the end of the day,\n\n09:09.600 --> 09:17.920\n even barter requires these beliefs that other people are going to accept\n\n09:17.920 --> 09:24.480\n the quote unquote currency you offer them. Because if I'm a mason, and you ask me to build a wall\n\n09:25.600 --> 09:31.760\n in your field, and I did, and you, in exchange, you give me a thousand sheep,\n\n09:32.480 --> 09:37.440\n what am I going to do? Eat them all? No, I have to feed them. And if I don't feed them, they die,\n\n09:37.440 --> 09:45.120\n and my value is zero. So in receiving this livestock, I must believe that somebody else\n\n09:45.120 --> 09:53.200\n will accept them in return for something else. So money is a social belief, social shared belief\n\n09:53.200 --> 09:58.960\n system that makes people transact. That's fascinating. I didn't even think about that,\n\n09:58.960 --> 10:06.800\n that you're actually, you have a deep like network of beliefs about how society operates.\n\n10:06.800 --> 10:12.240\n So the value is assigned even to sheep, based on that everyone will continue operating how they\n\n10:12.240 --> 10:19.680\n were previously operating. Somebody will feed the sheep. I didn't even think about that. That's\n\n10:19.680 --> 10:26.480\n fascinating. So that directly transfers to the space of money and then to the space of digital\n\n10:26.480 --> 10:33.600\n money, cryptocurrency. Okay. Does it bother you sort of intellectually when this money that is\n\n10:33.600 --> 10:40.400\n a social construct is not directly tied to physical goods like gold, for example?\n\n10:40.400 --> 10:49.280\n Not at all, because after all, gold has some industrial value. Nobody delights it. It's a\n\n10:49.280 --> 10:55.760\n metal. It doesn't oxidate. It has some good things about it. But does this industrial value\n\n10:55.760 --> 11:01.920\n really represent the value to which it now is traded? No. So gold is another way to express\n\n11:01.920 --> 11:07.200\n our belief. I give you an ounce of gold, you treat it like, oh, somebody else will want this\n\n11:07.200 --> 11:14.480\n for doing something else. So it is really this notion of this. Money is a mental construct,\n\n11:14.480 --> 11:21.200\n is really, and is shared, is a social construct, I really believe. And so some people feel that\n\n11:21.200 --> 11:28.960\n it's physical, so therefore gold exists. Then, as you know now, countries, most sophisticated\n\n11:30.160 --> 11:35.360\n country right now, they print their own money and you believe that they are not going to\n\n11:35.360 --> 11:42.560\n exaggerate it with inflation. Not everybody believes it, but at least they are not going\n\n11:42.560 --> 11:49.680\n to exaggerate it blatantly. And therefore you receive it because you know that somebody else\n\n11:49.680 --> 11:54.080\n will accept it, will have faith in the currency and so on and so forth. But whether it's gold,\n\n11:54.080 --> 11:59.600\n whether it's livestock, whatever it is, money is really a shared belief.\n\n11:59.600 --> 12:07.200\n So there is something, you know, and I've been reading more and more about different cryptocurrencies.\n\n12:07.200 --> 12:14.880\n There is a kind of belief that the scarcity of a particular resource like Bitcoin has a\n\n12:14.880 --> 12:23.040\n limited amount and it's tied to physical, you know, to proof of work. So it's tied to physical\n\n12:23.040 --> 12:28.880\n reality in terms of how much you can mine effectively and so on. That that's an\n\n12:28.880 --> 12:34.880\n important feature of money. Do you think that's an important feature to be a part of whatever\n\n12:34.880 --> 12:40.800\n the money is? That is certainly a very useful part. So at some point in time, you know,\n\n12:40.800 --> 12:46.320\n assume that money is something that all of a sudden we say, daisies are money, are the currency.\n\n12:46.880 --> 12:52.480\n Then, you know, I offer you 10 daisies in payment of whatever goods and services you want to\n\n12:52.480 --> 12:59.520\n provide. But at the end of the day, if you know that you can cultivate it and generate them at\n\n12:59.520 --> 13:07.440\n will, then perhaps, you know, you should not accept my payment. Here is a bouquet of daisies.\n\n13:08.320 --> 13:14.400\n So you need some kind of a scarcity. The inability to create it suddenly out of nothing\n\n13:14.400 --> 13:24.560\n is unimportant. And it's not an intrinsic necessity, but it's much easier to accept\n\n13:24.560 --> 13:30.480\n once you know that there is a fixed number of units of whatever currency there is and therefore\n\n13:30.480 --> 13:37.040\n you can mentally understand I'm getting, you know, this much of this piece of a pie and therefore\n\n13:37.040 --> 13:43.600\n I consider myself paid. I understand what I'm receiving. You described the goals of a blockchain.\n\n13:43.600 --> 13:48.720\n You have a nice presentation on this as scalability, security, and decentralization.\n\n13:49.680 --> 13:54.960\n And you challenged the blockchain trilemma that claims you can only have two of the three.\n\n13:55.600 --> 14:02.000\n So let's talk about each. What is scalability in the context of blockchain and cryptocurrency?\n\n14:02.000 --> 14:09.760\n What does scalability mean? So remember, we said that the blockchain is a ledger and each page\n\n14:09.760 --> 14:16.320\n receives a, gets some transaction and everybody can write in these pages of the ledger. Nobody\n\n14:16.320 --> 14:21.760\n can be stopped from writing and everybody can read them. Okay. Scalability means how fast can\n\n14:21.760 --> 14:28.640\n you write? Just imagine that you can write an entry in this special shared ledger once every\n\n14:28.640 --> 14:32.800\n hour. Well, you know, what are you going to do if you have no one transaction of an hour,\n\n14:33.440 --> 14:38.880\n the world doesn't go around. So you need to have scalability means here that you can\n\n14:38.880 --> 14:47.040\n then somehow write a lot of transaction and then you can read them and everybody can validate them.\n\n14:47.040 --> 14:54.080\n And that is the speed and the number of transactions per second and the fact that\n\n14:54.080 --> 15:01.040\n they are shared. So you want to have this speed not only in writing, but in sharing and\n\n15:01.040 --> 15:09.120\n in inspection for validity. This is scalability. The world is big. The world wants to interact,\n\n15:09.120 --> 15:13.520\n the people want to interact with each other and you better be prepared to have a ledger\n\n15:13.520 --> 15:17.520\n in which you can write lots and lots and lots of transactions in this special way very,\n\n15:17.520 --> 15:22.800\n very, very quickly. So maybe from a more mathematical perspective or can we say\n\n15:22.800 --> 15:27.760\n something about how much scalability is needed for a world that is big?\n\n15:27.760 --> 15:36.400\n Well, it really depends how many transactions you want, but remember that I think right now\n\n15:36.400 --> 15:45.120\n yet to go into at least 1000s of transactions per second, even if you look at credit cards,\n\n15:46.480 --> 15:54.320\n we are going to go from an average of 1600 to peaks of 20,000 or 40,000, something like this.\n\n15:54.320 --> 16:01.200\n But remember, it's not only a question of a transaction per se, but the value is that the\n\n16:01.200 --> 16:08.400\n transaction is actually being shared and visible to everybody and the certainty that that is the\n\n16:08.400 --> 16:15.600\n case. I can print on my own printer way more transactions, but nobody has the time to see\n\n16:15.600 --> 16:22.480\n or to inspect. That doesn't count. So you want scalability at this common knowledge level.\n\n16:22.480 --> 16:28.320\n That is the challenge. I also meant from a perspective of like a complexity analysis.\n\n16:28.320 --> 16:35.200\n So when you get more and more people involved, doesn't need to scale in some kind of way that\n\n16:38.240 --> 16:41.760\n do you like to see certain kind of properties in order to say something is scalable?\n\n16:42.560 --> 16:48.320\n Oh, absolutely. I took a little bit implicitly that the people transacting are actually very\n\n16:48.320 --> 16:54.080\n different. So if there is a two people who can do thousands of transactions per second with each\n\n16:54.080 --> 16:58.320\n other, this is not so interesting. What do we really need is to say there are billions of\n\n16:58.320 --> 17:03.760\n people at any point in time, you know, thousands and thousands of them want to transact with each\n\n17:03.760 --> 17:12.160\n other and you want to support to that. So Algorand, it solves, so that's the company,\n\n17:12.160 --> 17:17.280\n the team of cryptographers and mathematicians, engineers, so on, that challenged the blockchain\n\n17:17.280 --> 17:24.800\n trilemma. So let's break it down in terms of achieving scalability. How do we achieve scalability\n\n17:25.600 --> 17:31.120\n in the space of blockchain, in the space of cryptocurrency? Okay. So scalability, security,\n\n17:31.680 --> 17:36.480\n remember, and decentralization, right? So that's what they want. What's the best way to approach?\n\n17:36.480 --> 17:41.520\n Can we break it down? Let's start with scalability and think about how do we achieve it? Well,\n\n17:41.520 --> 17:48.560\n to achieve it one at a time is perhaps easy, even security. If nobody transacts,\n\n17:48.560 --> 17:56.160\n nobody loses money. So that is secure, but it's not scalable. So let me tell you, I'm a cryptographer,\n\n17:56.160 --> 18:04.240\n so I try to fight the bad guys. And what you want is that the vesselager that we discussed before\n\n18:04.240 --> 18:12.080\n cannot be tampered with. So you must think of it as a special link that nobody can erase. Then\n\n18:12.080 --> 18:22.320\n it has to be, everybody should be able to read and not to alter the pages or the content of the pages.\n\n18:22.320 --> 18:28.640\n That's okay. But you know what? That is actually easy cryptographically. Easy cryptographically\n\n18:28.640 --> 18:35.120\n means you can use tools invented 50 years ago, which in cryptographic time is prehistory, okay?\n\n18:35.120 --> 18:42.320\n We cavemen working around and solve the problem in cryptography land. But there is really a\n\n18:42.320 --> 18:46.720\n fundamental problem, which is really almost a social, seems a political problem, is to say,\n\n18:48.480 --> 18:58.080\n who the hell chooses or publishes the next page of the ledger? I mean, that is really the challenge.\n\n18:58.080 --> 19:03.120\n This ledger, you can always add a page because more and more transaction had to be written on\n\n19:03.120 --> 19:08.880\n there. And somebody has to assemble this transaction, put them on a page and add the\n\n19:08.880 --> 19:14.640\n next page. Who is the somebody who chooses the page and adds it on? Who can be trusted to do it?\n\n19:14.640 --> 19:19.680\n Exactly. Assume it is me for what I'm being, not that I want to volunteer for the job, but\n\n19:20.320 --> 19:25.520\n then I would have more power than any absolute monarch in history, because I would have a\n\n19:25.520 --> 19:32.080\n tremendous power to say, these are the transactions that the entire world should see. And whatever I\n\n19:32.080 --> 19:38.960\n don't write, this transaction will never see the light of day. I mean, no one had any such a power\n\n19:38.960 --> 19:47.200\n in history. So it's very important to do that. And that is the quintessential problem in a blockchain.\n\n19:47.200 --> 19:52.000\n And people have thought about it to say, it's not me, it's not you. But for instance,\n\n19:52.000 --> 19:57.200\n in proof of work, what people say is, okay, it's not me, it's not you, you know what it is?\n\n19:58.000 --> 20:04.320\n We make a very difficult, we invented a cryptographic puzzle, very hard to solve.\n\n20:04.320 --> 20:10.800\n The first one to solve it has the right to add one page to the ledger on behalf of everybody else.\n\n20:12.240 --> 20:19.120\n That now seems okay, because sometimes I solve a puzzle before you do, sometimes you solve\n\n20:19.120 --> 20:22.640\n before I do, or before somebody else solves it, it's okay.\n\n20:22.640 --> 20:28.320\n And presumably, the effort you put in is somehow correlated with how much trust\n\n20:29.520 --> 20:32.640\n you should be given to add to the ledger.\n\n20:33.440 --> 20:38.400\n Yeah, so somehow you want to make sure that you need to work because you want to prevent,\n\n20:39.360 --> 20:46.080\n you want to make sure that you get one solution every 10 minutes, say, like in a particular\n\n20:46.080 --> 20:51.600\n example of Bitcoin, so that it is very rare that two pages are added at the same time.\n\n20:51.600 --> 20:58.560\n Because if I solve a puzzle at the same time you do, it could happen that if it happens once or\n\n20:58.560 --> 21:06.000\n twice, we can survive it. But if it happens every other page is a double page, then which of the two\n\n21:06.000 --> 21:13.040\n is the real page, it becomes a problem. So that's why in Bitcoin, it is important to have a substantial\n\n21:13.040 --> 21:19.680\n amount of work so that no matter how many people try on Earth to solve a puzzle, you have one\n\n21:19.680 --> 21:26.080\n solution out of how many people are trying every 10 minutes. So that you have, you distance these\n\n21:26.080 --> 21:31.600\n pages, and you have the time to propagate through the network a solution and the page attached to\n\n21:31.600 --> 21:38.000\n it. And therefore, there is one page at a time that is added. And you say, well, why don't we\n\n21:38.000 --> 21:46.160\n do it? We have a solution. Well, first of all, a page every 10 minutes is not fast enough. It's a\n\n21:46.160 --> 21:53.280\n question of scalability. And second of all, to ensure that no matter how many people try, you\n\n21:53.280 --> 22:00.720\n get one page every 10 minutes, one solution to the riddle every 10 minutes. This means that the riddle\n\n22:00.720 --> 22:09.040\n becomes very, very hard. And to have a chance to solve it within 10 minutes, you must have such an\n\n22:09.040 --> 22:15.040\n expensive apparatus in terms of specialized computers, not one, not two, but thousands and\n\n22:15.040 --> 22:20.320\n thousands of them. And they produce tons of heat, okay? They dissipate heat like maniac. And then\n\n22:20.320 --> 22:26.400\n you have to refrigerate them too. And so then now you have air conditioning galore to add to the\n\n22:26.400 --> 22:33.680\n thing. It becomes so expensive that fewer and fewer and fewer people can actually compete in\n\n22:33.680 --> 22:46.000\n order to add to the page. And the problem becomes so crucial that in Bitcoin, depending on which\n\n22:46.000 --> 22:51.760\n day of the week you look at it, you are going to have two or three mining pools that are really\n\n22:51.760 --> 22:58.480\n the ones that are capable of controlling the chain. So you're saying that's almost like\n\n22:58.480 --> 23:07.520\n at least a centralization. Right. It started being decentralized, but the expenses became\n\n23:07.520 --> 23:11.600\n higher and higher and higher. When the cost becomes higher and higher, fewer and fewer\n\n23:11.600 --> 23:19.760\n people can afford them. And then it becomes de facto centralized, right? Yeah. And a different\n\n23:19.760 --> 23:26.160\n type of approach is instead, for instance, a delegated proof of stake, which is also\n\n23:26.880 --> 23:34.480\n very easy to explain, essentially boils down to say, well, look at these 21 people, say, okay?\n\n23:35.600 --> 23:40.960\n Don't they look honest? Yes, they do. In fact, I believe that they're going to remain honest\n\n23:40.960 --> 23:46.000\n for the foreseeable future. So why don't we do ourselves a favor? Let's entrust them\n\n23:46.000 --> 23:54.000\n to add the page on behalf of all of us to the ledger. Okay. Okay. But now we are going to say,\n\n23:54.000 --> 23:59.840\n is this centralized or decentralized? Well, 21 is better than one, but to say is very little.\n\n23:59.840 --> 24:04.720\n So if you look at when people rebelled to centralize power, I don't know, the French\n\n24:04.720 --> 24:11.600\n revolutions, okay? There was a monarch and the nobles. Were there 21 nobles? No, there were\n\n24:11.600 --> 24:18.240\n thousands of them, but there were millions and millions of disempowered citizens. So one is\n\n24:18.240 --> 24:23.760\n centralized, 21 is also centralized, right? So that's delegated proof of stake. Delegated. It's\n\n24:23.760 --> 24:29.760\n kind of like representative democracy, I guess. Yes, which is good. It's working great, right?\n\n24:29.760 --> 24:39.440\n It's working great. Well, it's better than the single monarch, right? There's problems.\n\n24:39.440 --> 24:49.440\n There are problems. And so we were looking for a different, when thinking about Algorand,\n\n24:49.440 --> 24:56.640\n for a different approach. And so we have an approach that is really, really decentralized\n\n24:56.640 --> 25:04.560\n because essentially it works as follows. You have a bunch of tokens, right? These are the tokens\n\n25:04.560 --> 25:12.080\n that have equal power. And you have say 10 billions of tokens distributed to the entire\n\n25:12.080 --> 25:21.280\n world. And the owners, each token has a chance to add the ledger, equal probability to everybody\n\n25:21.280 --> 25:29.760\n else. In fact, actually, if you want, here is how it works. So think about by some magic\n\n25:29.760 --> 25:35.360\n cryptographic process, which is not magic, it's mathematics, but think of it as magic. Assume that\n\n25:36.240 --> 25:43.920\n you select a thousand tokens and so sometimes a random, okay? And you have a guarantee that the\n\n25:43.920 --> 25:51.680\n random selected. And then the owners of these 1000 tokens somehow agree on the next page,\n\n25:51.680 --> 25:59.680\n they all sign it, and that is the next page. Okay? So it is clear that nobody has the power\n\n25:59.680 --> 26:09.280\n but in a while, one of your tokens is selected and you are in charge of this committee to select\n\n26:09.280 --> 26:16.560\n the next page. But this goes around very quickly. So, and if you look at this, the equation really\n\n26:16.560 --> 26:23.760\n is that it's not really centralized. And because for agreeing on the same page, it is important\n\n26:23.760 --> 26:31.440\n that the 1000 tokens that you randomly selected are in honest ends, the majority of them.\n\n26:32.160 --> 26:37.920\n So which, if the majority of the tokens are in honest ends, that is essentially true because\n\n26:37.920 --> 26:44.560\n if the majority of the tokens are in honest ends, if you select, say 90% of the people are,\n\n26:46.000 --> 26:51.040\n 90% of the tokens are in honest ends. So can you randomly select a thousand,\n\n26:51.040 --> 26:58.160\n in this thousand you find the 501 tokens in bad ends. Very, very improbable.\n\n26:58.160 --> 27:05.680\n So basically, when a large fraction of people are honest, then you can use randomness as a powerful\n\n27:05.680 --> 27:13.120\n tool to get decentralization. So what does honesty mean? And now we're into the social\n\n27:13.120 --> 27:23.040\n side of things, which is how do we know that like the fraction, a large fraction of people\n\n27:23.040 --> 27:28.000\n or participating parties are honest? That is an excellent question. So by the way,\n\n27:28.000 --> 27:33.360\n first of all, we should realize that the same thing is for every other system. When you look\n\n27:33.360 --> 27:41.040\n at proof of work, you rely that the majority of the mining power is in honest ends. When you look\n\n27:41.040 --> 27:47.920\n at delegated proof of stake, you rely that the majority of these 21 people are honest. What is\n\n27:47.920 --> 27:54.960\n the difference? The difference is that in these other systems, you should say the whole economy\n\n27:54.960 --> 28:04.400\n is secure if the majority of this small piece of economy are honest. And that is a big question.\n\n28:04.400 --> 28:12.960\n But instead, in Algorand, in our approach, we say the whole economy is secure if the majority\n\n28:12.960 --> 28:18.640\n of the economy is honest. In other words, who can subvert Algorand is not a majority of a small\n\n28:18.640 --> 28:24.400\n group, but is a majority of the token holders had to conspire with each other in order to sink the\n\n28:24.400 --> 28:29.600\n very economy for which they own the majority of. That I think it is a bit harder to...\n\n28:29.600 --> 28:36.000\n Like a self destructive majority, essentially. And you're also making me realize that basically\n\n28:36.800 --> 28:43.520\n every system that we have in the world today assumes that the majority of participants is\n\n28:43.520 --> 28:50.400\n honest. Yes. The only difference is the majority of whom. And in some cases, the majority of a club\n\n28:51.040 --> 28:53.600\n and in our case is the majority of the whole system.\n\n28:53.600 --> 29:02.400\n The whole system. Okay. So that's... So through that kind of random sampling,\n\n29:02.400 --> 29:09.520\n you can achieve decentralization. You can achieve... So the scalability, I understand.\n\n29:10.080 --> 29:16.160\n And then the security that you're referring to, basically the security comes from the fact that\n\n29:16.160 --> 29:23.120\n the sample selected would likely include honest people. So it's very difficult to... So by the way,\n\n29:23.120 --> 29:30.240\n the security, as you mentioned, you're referring to is basically security against dishonesty,\n\n29:31.360 --> 29:37.280\n right? Or manipulation or whatever. Yes. Yes. So essentially when what you're going to do is to\n\n29:37.280 --> 29:42.320\n the following and say, well, Silvio, I understood what you're saying, but somebody has to randomly\n\n29:42.320 --> 29:46.560\n randomly selected these tokens, then I believe you. So then who does this random selection?\n\n29:46.560 --> 29:52.000\n That's a good point. And in Algorand, we do something a little bit unorthodox.\n\n29:52.800 --> 30:00.480\n Essentially is the token choose themselves at random. And you say, if you think about it,\n\n30:00.480 --> 30:05.200\n that seems to be a terrible idea. Because if you want to say, choose yourself at random,\n\n30:05.200 --> 30:11.360\n and whoever chooses himself is a thousand people committee, you choose the page for the rest of us.\n\n30:11.360 --> 30:16.240\n Mm hmm. And because if I'm a bad person, I'm going to select myself over and over again,\n\n30:16.240 --> 30:22.080\n because I want to be part of the committee every single time. But not so fast. So what do we do\n\n30:22.640 --> 30:26.240\n in Algorand? What does it mean that I select myself? That each one of us,\n\n30:26.960 --> 30:34.080\n in the privacy of our own computer, actually a laptop, what you do is that you execute your own\n\n30:34.080 --> 30:42.480\n individual lottery. And think about that you pull a lever of a slot machine, you can only pull the\n\n30:42.480 --> 30:48.560\n lever once, not until you win, not enough times until you win. And when you pull the lever, case\n\n30:48.560 --> 30:54.640\n one, either you win, in such a case, you have a winning ticket. Or you lose, you don't get any\n\n30:54.640 --> 31:00.480\n winning ticket. So if you don't have a winning ticket, you can say anything you want about the\n\n31:00.480 --> 31:07.760\n next page in the ledger, nobody pays attention. But if you ever win a ticket, people say, Oh,\n\n31:07.760 --> 31:12.720\n wow, this is one of the 1000 winning tickets, we better pay attention to what he or she says.\n\n31:13.280 --> 31:20.400\n And that's how it works. And the lottery is a cryptographic lottery, which means that even if I\n\n31:20.400 --> 31:27.040\n am an entire nation, extremely powerful, with incredible computing powers, I don't have the\n\n31:27.040 --> 31:33.920\n ability to improve even minimally my probability of one of my token winning the lottery. And\n\n31:33.920 --> 31:41.200\n that's how it happens. So everybody pulls the lever, the 1000 random winners say, Oh, here is\n\n31:41.200 --> 31:46.800\n my winning ticket. And here is my opinion up or down about the block. These are the ones that\n\n31:46.800 --> 31:53.440\n count. And if you think about it, while this is distributed, because there is, in the case of\n\n31:53.440 --> 31:59.120\n Algon, there is 10 billion tokens and you selected 1000 of them more distributed than this, you\n\n31:59.120 --> 32:06.480\n cannot get. And then why is this scalable? Because what do you have to do? Okay, you have to do the\n\n32:06.480 --> 32:13.280\n lottery. How long the lottery takes? It takes actually one microsecond. Whether you have one\n\n32:13.280 --> 32:19.520\n token or two tokens or a billion tokens is always one microsecond of computation, which is very\n\n32:19.520 --> 32:26.160\n fast. We don't hit the planet with a microsecond of computation. And finally, why is this secure?\n\n32:27.120 --> 32:35.600\n Because even if I were a very evil and very, very powerful individual, I'm so powerful that I can\n\n32:35.600 --> 32:42.880\n corrupt anybody I want instantaneously in the world, whom would I want to corrupt? The people\n\n32:42.880 --> 32:49.360\n in the committee so that I can choose the page of the ledger. But I do have a problem. I do not\n\n32:49.360 --> 32:55.840\n know whom I should corrupt. Should I corrupt this lady in Shanghai, this other guy in Paris?\n\n32:56.400 --> 33:00.640\n Because I don't know. The winners are random, so I don't know whom I should corrupt.\n\n33:01.360 --> 33:06.640\n But once the winner comes forward and says, here is my winning ticket, and you propagate\n\n33:06.640 --> 33:11.360\n your winning ticket across the network, together with your opinion about the block,\n\n33:11.920 --> 33:18.480\n now I know who they are. For sure, I can corrupt all 1000 of them given to my incredible powers.\n\n33:18.480 --> 33:25.040\n But so what? Whatever they said, they already said, and their winning tickets and their opinions\n\n33:25.040 --> 33:31.200\n are virally propagated across the network. And I do not have the power, no more than the US\n\n33:31.200 --> 33:37.120\n government or any government has the power, to put back in the bottle a message virally\n\n33:37.120 --> 33:44.560\n propagated by WikiLeaks. So everything you just described is kind of is fascinating,\n\n33:44.560 --> 33:50.080\n a set of ideas. And, you know, online I've been reading quite a bit, and people are really excited\n\n33:50.080 --> 33:58.560\n about the set of ideas. Nevertheless, it is not the dominating technology today. So Bitcoin,\n\n33:58.560 --> 34:05.920\n in terms of cryptocurrency, is the most popular cryptocurrency, and then Ethereum, and so on.\n\n34:05.920 --> 34:09.920\n So it's useful to kind of comment. We already talked about proof of work a little bit.\n\n34:09.920 --> 34:15.840\n But what, in your sense, does Bitcoin get right? And where is it lacking?\n\n34:16.560 --> 34:22.000\n Okay, so the first thing that Bitcoin got right is to understand that there was the need\n\n34:22.800 --> 34:29.840\n of a cryptocurrency. And that, in my opinion, they deserve all the success because they said\n\n34:29.840 --> 34:34.400\n the time is right for this idea. Because very often, it's not enough to be right here to be\n\n34:34.400 --> 34:40.720\n right at the right time. And somebody got it right there. So hat off to Bitcoin for that.\n\n34:42.640 --> 34:52.800\n And so what they got right is that it is hard to subvert and change the ledger, to cancel a\n\n34:52.800 --> 35:00.160\n transaction. It's not impossible. That is very hard. What they did not get right is somehow that\n\n35:00.160 --> 35:07.680\n it is a great store of value, currency wise. But money is not only a question that you store it\n\n35:07.680 --> 35:13.760\n and you put under the mattress. Money wants to be transacted. And the transaction bitcoins are very\n\n35:13.760 --> 35:19.920\n little. So if you want to store value, everybody needs a store of value. Might as well use Bitcoin.\n\n35:19.920 --> 35:27.360\n I mean, it's the plan. But if you don't look at that for a moment, at least it's a great store\n\n35:27.360 --> 35:32.480\n of value. And everybody needs a store of value. But most of the time, we want to transact. We\n\n35:32.480 --> 35:38.080\n want to interact. We don't put the money under the mattress. So we wanted to embed. They didn't get\n\n35:38.080 --> 35:44.960\n it right. That is too slow to transact. Too few transactions. There's a scalability issue.\n\n35:45.520 --> 35:52.720\n Is it possible to build stuff on top of Bitcoin that sort of fixes the scalability? I mean,\n\n35:52.720 --> 35:58.480\n this is the thing you look at. There's a bunch of technologies that kind of hit the right\n\n36:00.240 --> 36:07.200\n need at the right time and they have flaws, but we kind of build infrastructures on top of them\n\n36:07.200 --> 36:14.880\n over time to fix it as opposed to getting it right from the beginning. Or is it difficult to do?\n\n36:14.880 --> 36:21.120\n Well, that is difficult to do. So you're talking to somebody that when I decided to throw my heart\n\n36:21.120 --> 36:27.680\n in the arena and I decided, first of all, as I said before, I much admire my predecessors. I\n\n36:27.680 --> 36:36.000\n mean, they got it right, a lot of things. And I really admire for that. But I had a choice to\n\n36:36.000 --> 36:41.120\n make. Either I patch something that has holes all over the place or I start from scratch. I decided\n\n36:41.120 --> 36:46.640\n to start from scratch because sometimes it's a better way. So what about Ethereum, which looks\n\n36:46.640 --> 36:52.320\n like proof of stake and a lot of different innovative ideas that kind of improve or seek\n\n36:52.320 --> 36:57.200\n to improve on some of the flaws of Bitcoin. Ethereum made another great idea. So they\n\n36:57.200 --> 37:05.760\n figured out that money and payments are important as they are. They are only the first level, the\n\n37:05.760 --> 37:12.480\n first stepping stone. The next level are smart contracts. And they were at the vision to say\n\n37:12.480 --> 37:20.640\n the people will need smart contract, which allow me and you to somehow to transact securely without\n\n37:20.640 --> 37:26.080\n being shopped around by a trusted third party, by a mediator. By the way, because mediators are hard\n\n37:26.080 --> 37:32.960\n to find. And in fact, maybe even impossible to find if you live in Thailand and I live in New\n\n37:32.960 --> 37:39.280\n Zealand, maybe we don't have a common person that we know and trust. And even if we find them,\n\n37:39.280 --> 37:48.560\n guess what? They want to be paid. So much so that 6% of the world GDP goes into financial friction,\n\n37:48.560 --> 37:52.880\n which is essentially third party. So the head of right of the world needed that.\n\n37:53.920 --> 38:04.400\n But again, the scalability is not there. And the system of smart contracts in Ethereum is slow\n\n38:04.400 --> 38:12.720\n and expensive. And I believe that is not enough to satisfy the appetite and the need that we have\n\n38:12.720 --> 38:19.040\n for smart contracts. Well, what do you make of just as a small sort of aside in human history,\n\n38:19.040 --> 38:24.560\n perhaps it's a big one is NFT, the non fungible tokens. Do you find those interesting technically,\n\n38:24.560 --> 38:32.800\n or is it more interesting on the social side of things? Well, both. I think NFTs are actually\n\n38:32.800 --> 38:46.000\n great. So you are an artist to create a song or it could be a piece of art. He has many unique\n\n38:46.000 --> 38:54.560\n representations of a unique piece where there is an artifact of something dreamed up by you and\n\n38:55.360 --> 39:01.280\n has unique representations that now you can trade. And the important part is that now you have this\n\n39:01.280 --> 39:10.640\n is not only the NFTs themselves, but the ability to trade them quickly, fast, securely, knowing\n\n39:11.520 --> 39:18.400\n who owns which rights. And that gives a totally new opportunity for content creators to be\n\n39:18.400 --> 39:25.040\n remunerated for what they do. But ultimately, you still have to have that scalability, security\n\n39:25.040 --> 39:33.680\n and decentralization to make it, you know, to make it work for bigger and bigger applications.\n\n39:33.680 --> 39:37.680\n Correct. Yeah. Yeah. I still wonder what kind of applications are yet to be\n\n39:38.800 --> 39:44.880\n like enabled by it because so much. The interesting thing about NFTs, you know,\n\n39:44.880 --> 39:51.760\n if you look outside of art is just like money, you can start playing with different social\n\n39:51.760 --> 40:01.920\n constructs, is you can start playing with the ideas. You can start playing with even like\n\n40:01.920 --> 40:10.320\n investing. Somebody was talking about almost creating an economy out of like creative people\n\n40:10.320 --> 40:15.520\n or influencers. Like if you start a YouTube channel or something like that, you can invest\n\n40:15.520 --> 40:21.680\n in that person and you can start trading their creations. And then almost like create a market\n\n40:22.240 --> 40:29.440\n out of people's ideas, out of people's creations, out of the people themselves that generate those\n\n40:29.440 --> 40:33.200\n creations. And there's a lot of interesting possibilities of what you can do with that.\n\n40:33.200 --> 40:40.880\n I mean, it seems ridiculous, but you're basically creating a hierarchy of value, maybe artificial\n\n40:40.880 --> 40:47.680\n in the digital world and are trading that. But in so doing are inspiring people to create.\n\n40:48.880 --> 40:55.600\n So maybe as a sort of our economy gets better and better and better where actual work in the\n\n40:55.600 --> 41:01.760\n physical space becomes less and less in terms of its importance, maybe we'll completely be operating\n\n41:01.760 --> 41:09.120\n in the digital space where these kinds of economies have more and more power. And then\n\n41:09.120 --> 41:15.600\n you have to have this kind of blockchains to the scalability, security, and decentralization.\n\n41:15.600 --> 41:22.400\n And then decentralization is of course the tricky one because people in power start to get nervous.\n\n41:23.200 --> 41:29.600\n Absolutely. Once in power, you're always nervous that you'll be supplanted by somebody else.\n\n41:29.600 --> 41:34.880\n But this is your job. Congratulations, you got the job, the top job, and now everybody wants it.\n\n41:34.880 --> 41:41.600\n Well, what is your sense about our time and the future hope about the decentralization\n\n41:42.560 --> 41:50.800\n of power? Do you think that's something that we can actually achieve given that power corrupts\n\n41:50.800 --> 41:56.000\n and absolute power corrupts absolutely, and it's so wonderful to be absolutely powerful?\n\n41:57.520 --> 42:02.720\n Well, good question. So first of all, I believe that by the way, there is a\n\n42:02.720 --> 42:09.040\n complex question, Lex, and like all the rest of your questions.\n\n42:10.720 --> 42:12.160\n I'm so very sorry.\n\n42:13.920 --> 42:18.800\n It's okay. I am enjoying it. So there are two things. First of all,\n\n42:19.360 --> 42:24.560\n power has been centralized for a variety of reasons. When you want to get it, it's easier\n\n42:24.560 --> 42:32.400\n for somebody, even a single person, to grab power. But there is also some kind of a technology,\n\n42:33.360 --> 42:40.480\n lack thereof, that justified having power. Because in a society in which even communication,\n\n42:40.480 --> 42:46.960\n never mind blockchain, which is common knowledge, but even simple unilateral communication is hard,\n\n42:46.960 --> 42:59.680\n it is much easier to say, you do as I say. So there is a little bit of a technology barrier.\n\n42:59.680 --> 43:04.720\n But I think that now to get to this common knowledge, it is a totally different story.\n\n43:04.720 --> 43:09.840\n Now we have finally the technology for doing this. So that is one part. But I really believe\n\n43:09.840 --> 43:18.960\n that by having a distributed system, you have actually a much more stable and durable system.\n\n43:19.840 --> 43:24.720\n Because not only for corruption, but even for things that go astray, and given a long enough\n\n43:24.720 --> 43:33.680\n time by a strange version of Murphy's law, whatever goes wrong, goes wrong. And if the\n\n43:33.680 --> 43:43.520\n power is diffused, you actually are much more stable. If you look at any complex living being,\n\n43:43.520 --> 43:49.760\n it's distributed. I mean, I don't have somebody who says, okay, tell Silvio now it's time to eat.\n\n43:50.560 --> 43:54.400\n You have millions of cells in your body. You have billions of bacteria.\n\n43:54.400 --> 43:59.840\n Exactly. Help me in the guts. We are in a soup that somehow keeps us alive.\n\n43:59.840 --> 44:09.200\n So strange enough, however, when we design systems, we design them centralized. We ourselves\n\n44:09.200 --> 44:15.760\n are distributed beings. And when we plan to say, okay, I want to create an architecture,\n\n44:15.760 --> 44:24.320\n how about I make a pyramid, I put this on the top and the power flows down. And so again,\n\n44:24.320 --> 44:29.200\n it's a little bit perhaps of a technology problem. But now the technology is there.\n\n44:29.200 --> 44:36.080\n So that is a big challenge to rethink how we want to organize power in a very large system and\n\n44:37.840 --> 44:42.800\n distribute a system, in my opinion, much more resilient. Let's put it this way. There was\n\n44:45.920 --> 44:53.680\n Italian compatriots, Machiavelli, who looked at the time, there was a bunch of small state\n\n44:53.680 --> 44:58.560\n democratic Republic of Florence and Venice and the other thing. And there was the Ottoman Empire\n\n44:58.560 --> 45:04.160\n that at the time was an empire and the Sultan was very centralized. And he made a political\n\n45:04.160 --> 45:09.840\n observation that goes roughly to say, whenever you have such a centralized thing, it's very hard\n\n45:09.840 --> 45:16.960\n to overtake that former government is centralized. But if you get it, it's so easy to keep\n\n45:17.840 --> 45:26.400\n the population. While instead these other things are much more resilient. When the power is\n\n45:26.400 --> 45:33.280\n distributed, it's going to be lasting for a much longer time. And ultimately maybe the human spirit\n\n45:33.280 --> 45:36.960\n wants that kind of resilience, wants that kind of distribution. It's just that we didn't have\n\n45:36.960 --> 45:41.440\n technology throughout history. Machiavelli didn't have the computer, the internet.\n\n45:43.040 --> 45:48.720\n That is certainly part of a reason. Yes. You've written an interesting blog post. If we\n\n45:48.720 --> 45:56.960\n just take a step out of the realm of bits and into the realm of governance, you wrote a blog\n\n45:56.960 --> 46:03.120\n post about making Algorand governance decentralized. Can you explain what that means, the philosophy\n\n46:03.120 --> 46:09.600\n behind that? How you decentralized basically all aspects of this kind of system?\n\n46:09.600 --> 46:20.480\n Let's start with the philosophy. I really believe that nothing fixed lasts very long.\n\n46:21.760 --> 46:30.240\n So I really believe that life is about intelligent adaptation. Things change, and we have to be\n\n46:30.240 --> 46:42.400\n nimble and adjust to change. When I see a lot of a crypto project, I'm actually very proud to say\n\n46:42.400 --> 46:50.400\n it's fixed in stone. Code is law. Law is code. I verify the code. It will never change. You go,\n\n46:50.400 --> 46:56.320\n wow. When I'm saying this is a recipe to me of disaster, not immediately, but soon. Just imagine\n\n46:56.320 --> 47:04.880\n you take an ocean liner, and you want to go, I don't know, from Lisbon to New York, and you set\n\n47:04.880 --> 47:15.200\n a course, iceberg, no iceberg, tempest, no tempest. It doesn't matter. You need a teal. You need to\n\n47:15.200 --> 47:25.920\n correct. You need to adjust. By the way, you would design Algorand with the idea that the code was\n\n47:25.920 --> 47:32.880\n evolving as the needs. Of course, there is a system in which every time there is an adjustment,\n\n47:32.880 --> 47:39.920\n you must have essentially a vote that right now is orchestrated at 90% of the stake. They say,\n\n47:39.920 --> 47:45.680\n okay, we are ready. We agree on the next version, and we pick up this version. So we are able to\n\n47:45.680 --> 47:51.840\n evolve without losing too many components left and right. But I think without evolving, any system\n\n47:51.840 --> 47:59.760\n essentially becomes aesthetic and is going to shrivel and die sooner or later. That is needed.\n\n48:01.200 --> 48:06.960\n What you want to do on the blockchain, you have a perfect platform in which you can log\n\n48:08.480 --> 48:14.080\n your wishes, your votes, your things, so that you have a guarantee that whatever vote you express\n\n48:14.080 --> 48:20.480\n is actually seen by everybody else. Everybody sees really the outcome, call it a referendum,\n\n48:20.480 --> 48:27.280\n of a change. And Vete is, in my opinion, a system that wants to live long as to adapt.\n\n48:28.640 --> 48:33.040\n There is an interesting question about leaders. I've talked to Vitalik Buterin. I'll probably\n\n48:33.040 --> 48:40.720\n talk to him again soon. He's one of the leaders, maybe one of the faces of the Ethereum project.\n\n48:40.720 --> 48:47.760\n And it's interesting. You have Satoshi Nakamoto, who's the face of Bitcoin, I guess. But he's\n\n48:47.760 --> 48:56.800\n faceless. He, she, they. It does seem like in our whatever it is, maybe it's 20th century,\n\n48:57.360 --> 49:04.400\n maybe it's Machiavellian thinking, but we seek leaders. Leaders have value. Linus Torvalds,\n\n49:04.400 --> 49:14.240\n the leader of Linux, the open source development a lot. It's not that the leadership is sort of\n\n49:14.240 --> 49:24.400\n dogmatic, but it's inspiring. And it's also powerful in that through leaders, we propagate\n\n49:24.400 --> 49:30.080\n the vision. Like the vision of the project is more stable. Maybe not the details, but the vision.\n\n49:30.640 --> 49:36.640\n And so do you think there's value to, because there's a tension between decentralization\n\n49:36.640 --> 49:41.760\n and leadership, like in visionaries. What do you make of that tension?\n\n49:41.760 --> 49:46.240\n SL. Okay. So I really believe that, that's another great question. I think of it,\n\n49:47.680 --> 49:52.720\n I really believe in the power of emotions. I think the emotion are of a creative impulse\n\n49:52.720 --> 49:59.760\n of everybody else. And therefore it's very easy for a leader to be a physical person, a real\n\n49:59.760 --> 50:07.040\n being, and that interprets our emotions. And by the way, these emotions have to resonate.\n\n50:07.040 --> 50:13.200\n And what is good is that the more intimate our emotions are, the more universal they are,\n\n50:13.200 --> 50:19.360\n paradoxically. The more personal, the more everybody else somehow magically agrees and\n\n50:19.360 --> 50:25.600\n feels a bit of the same. And it's very important to have a leader in the initial phase that\n\n50:26.480 --> 50:31.520\n generates out of nothing something. That is important leadership. But then the true tested\n\n50:31.520 --> 50:37.680\n leadership is to disappear after you lead the community. So in my opinion, the quintessential\n\n50:37.680 --> 50:48.000\n leader according to my vision is George Washington. He served for one term, he served for another\n\n50:48.000 --> 50:54.080\n term, and then all of a sudden he retired and became a private citizen. And two hundred and\n\n50:54.080 --> 51:00.640\n change years later, we still are, with some defects, but we have done a lot of things right.\n\n51:00.640 --> 51:04.640\n And we have been able to evolve. That to me is success in leadership.\n\n51:05.280 --> 51:10.800\n While instead you contrast our experiment with a lot of our experiment. I've done so much so well\n\n51:10.800 --> 51:16.080\n that I want another four years. And why shouldn't I be only a four and I have another eight?\n\n51:16.640 --> 51:21.920\n Why should it be another eight? Give me 16 and I will fix all your problems. And then is the type,\n\n51:21.920 --> 51:29.200\n in my opinion, of failed leadership. Leadership ought to be really lead, ignite, and disappear.\n\n51:29.200 --> 51:34.800\n And if you don't disappear, the system is going to die with you. It is not a good idea for everybody\n\n51:34.800 --> 51:40.080\n else. So we've been talking a little bit about cryptocurrency, but is there spaces where\n\n51:40.720 --> 51:45.680\n this kind of blockchain ideas that you're describing, which I find fascinating,\n\n51:47.040 --> 51:52.320\n do you think they can revolutionize some other aspects of our world that's not just money?\n\n51:52.320 --> 51:59.920\n A lot of things are going to be revolutionized is independent of finance. By the way,\n\n51:59.920 --> 52:07.600\n I really believe that finance is an incredible form of freedom. I mean,\n\n52:07.600 --> 52:11.760\n if I'm free to do everything I want, but I don't have the means to do anything, that's a bad idea.\n\n52:11.760 --> 52:18.720\n So I really think financial freedom is very, very important. But you just can say that against\n\n52:18.720 --> 52:24.080\n you know, censorship, you write something on the chain and now nobody can take it out.\n\n52:24.080 --> 52:35.120\n That is a very important way to express our view. And then the transparency that you give,\n\n52:35.120 --> 52:41.520\n because everybody can see what's happening on the blockchain. So transparency is not money.\n\n52:41.520 --> 52:49.520\n But I believe that transparency actually is a very important ingredient also of finance. Let's put\n\n52:49.520 --> 52:57.760\n this way, as much as I'm enthusiastic about blockchain and decentralized finance, and we have\n\n52:57.760 --> 53:03.280\n actually our expression, we're creating this future five, because as much as we want to do,\n\n53:03.280 --> 53:11.680\n we must agree that the first guarantee of financial growth and prosperity are really\n\n53:11.680 --> 53:16.720\n the legal system, the courts. Because we may not think about them and say, oh, the courts\n\n53:16.720 --> 53:22.640\n are a bunch of boring lawyers. But without them, I'm saying there is no certainty. There is no\n\n53:24.160 --> 53:29.600\n notion of equality. There is no notion that you can resolve your disputes thing. That's\n\n53:29.600 --> 53:35.040\n what thrives commerce and things. And so what I really believe that the blockchain actually\n\n53:35.040 --> 53:41.440\n makes a lot of this trust essentially automatic, but make it impossible to cheat in very way. You\n\n53:41.440 --> 53:49.040\n don't even need to go to court if nobody can change the ledger. So essentially it's a way of\n\n53:50.880 --> 53:55.680\n you cannot solve an illegal system that reduces to a blockchain. But what I'm saying, a big chunk\n\n53:55.680 --> 54:01.920\n of it can actually be guaranteed. And there is no reason why technology should be antagonistic\n\n54:03.680 --> 54:09.120\n to legal scholarship. It could be actually coexisting and one should start to doing the\n\n54:09.120 --> 54:15.280\n interest things that the technology alone cannot do. And then you go from there. But I think that\n\n54:16.160 --> 54:23.920\n essentially blockchain can affect all kinds of our behavior.\n\n54:23.920 --> 54:30.400\n Yeah. So in some sense, the transparency, the required transparency ensures honesty,\n\n54:30.400 --> 54:34.320\n prevents corruption. So there's a lot of systems that could use that. And the legal system is one\n\n54:34.320 --> 54:40.880\n of them. There's a little bit of attention that I wonder if you can speak to where this kind of\n\n54:40.880 --> 54:49.440\n transparency, there's a tension with privacy. Is it possible to achieve privacy if wanted\n\n54:49.440 --> 54:55.440\n on a blockchain? Do you have ideas about different technologies that can do that? People have been\n\n54:55.440 --> 55:04.000\n playing with different ideas. So absolutely. The answer is yes. And by the way, I'm a cryptographer.\n\n55:04.000 --> 55:13.200\n Right. Okay. So I really believe in privacy and I believe in and I've devoted a big chunk of my\n\n55:13.200 --> 55:20.320\n life to guarantee privacy, even when it seems almost impossible to have it. And it is possible\n\n55:20.320 --> 55:28.560\n to have it also in the blockchain too. However, I believe in timing as well. And I believe that\n\n55:28.560 --> 55:41.200\n the people have the right to understand their system they live in. And right now people can\n\n55:41.200 --> 55:50.560\n understand the blockchain to be something that cannot be altered and is transparent. And that\n\n55:50.560 --> 55:59.520\n is good enough. And there is a pseudo privacy for the fact that who knows if this public key belongs\n\n55:59.520 --> 56:05.440\n to me or to you. And I can, when I want to change my money from one public key, I split it to other\n\n56:05.440 --> 56:09.520\n public keys, going to figure out which one is Silvio or all of them are Silvio or only one of\n\n56:09.520 --> 56:15.600\n Silvio. Who knows? So you get some vanilla privacy, not the one I could talk. And I think it's good\n\n56:15.600 --> 56:21.680\n enough because, and it's important for now that we absorb this stage. Because in the next stage,\n\n56:21.680 --> 56:27.040\n we must understand the privacy tool rather than taking on faith. When the public starts saying,\n\n56:27.040 --> 56:31.120\n I believe in the scientists and whatever they say, I swear by them. And therefore,\n\n56:31.120 --> 56:35.520\n the term is private is private and nobody understands it very well. We need a much more\n\n56:35.520 --> 56:44.400\n educated about the tools we are using. And so I look forward to deploying more and more privacy\n\n56:44.400 --> 56:53.680\n on the blockchain, but we are not, I will not rush to it until the people understand and are behind\n\n56:53.680 --> 56:59.760\n whatever we have right now. So you build privacy on top of the power of the blockchain. You have\n\n56:59.760 --> 57:06.320\n to first understand the power of the blockchain. Yes. So Algorand is like one of the most exciting,\n\n57:06.320 --> 57:11.520\n technically at least from my perspective, technologies, ideas in this whole space.\n\n57:12.160 --> 57:16.960\n What's the future of Algorand look like? Is it possible for it to dominate the world?\n\n57:17.760 --> 57:26.320\n Let's put it this way. I certainly working very hard with a great team to give the best blockchain\n\n57:26.320 --> 57:34.640\n that one can demand and enjoy. And they said, I really believe that there is going to be,\n\n57:35.680 --> 57:42.080\n it's not a winner takes them all. So it's going to be a few blockchains and each one is going to\n\n57:42.080 --> 57:49.600\n have its own brand and it's going to be great at something. And sometimes it's scalability,\n\n57:49.600 --> 57:56.320\n sometimes it's your views, sometimes it's a thing. And it's important to have a dialogue between\n\n57:56.320 --> 58:01.440\n these things. And I'm sure, and I'm working very hard to make sure that Algorand is one of them,\n\n58:01.440 --> 58:11.920\n but I don't believe that it's even desirable to have a winner takes all because we need to express\n\n58:11.920 --> 58:16.400\n different things. But the important thing is going to have enough interoperability with\n\n58:16.400 --> 58:23.520\n various systems so that you can transfer your assets where you have the best tool to service\n\n58:23.520 --> 58:28.560\n them, whatever your needs are at the time. So there's an idea, I don't know, they call\n\n58:28.560 --> 58:35.600\n themselves Bitcoin maximalists, which is essentially the bet that the philosophy that\n\n58:36.400 --> 58:42.560\n Bitcoin will eat the world. So you're talking about, it's good to have variety.\n\n58:42.560 --> 58:50.640\n Their claim is it's good to have the best technology dominate the medium of exchange,\n\n58:50.640 --> 58:57.040\n the medium of store of value, the money, the digital currency space.\n\n58:58.160 --> 59:01.840\n What's your sense of the positives and the negatives of that?\n\n59:03.360 --> 59:12.400\n So I feel people are smart and it's going to be very hard for anybody to win. And because\n\n59:12.400 --> 59:19.840\n people want more and more things. There is an Italian saying that translates well, I think.\n\n59:20.640 --> 59:27.040\n It goes, the appetite grows while eating. I think you understand what he means. So I say,\n\n59:27.040 --> 59:33.520\n I'm not hungry. Okay, food. Let me try this. So we want more and more and more. And when you find\n\n59:33.520 --> 59:39.360\n something like Bitcoin, which are already very good things to say, but it does something very\n\n59:39.360 --> 59:47.680\n well, but it's a static, I mean, store of value. Yes, I think it's a great way for the rest. You\n\n59:47.680 --> 59:53.920\n know, it would be a sad world if the world in which we are so anchoring down, so defensive\n\n59:53.920 --> 59:59.840\n that we want to store value and hide it under the mattress. I long for a world in which is open.\n\n59:59.840 --> 1:00:05.600\n People want to transact, interact with each other. And therefore, when you want to store value,\n\n1:00:05.600 --> 1:00:12.320\n one, perhaps one chain, where you want to have to transact, maybe is another. I'm not saying that,\n\n1:00:12.320 --> 1:00:17.200\n you know, one chain cannot be store of value or another thing, but I really believe,\n\n1:00:19.120 --> 1:00:25.120\n I believe in the ingenuity of people and in the innovation that is intrinsic to the human nature.\n\n1:00:25.120 --> 1:00:28.880\n We want always different things. So how can it be something invented,\n\n1:00:28.880 --> 1:00:33.200\n whatever it is decades ago, is going to fulfill the needs of our future generations.\n\n1:00:33.200 --> 1:00:43.200\n I'm not going to fulfill my needs, let alone my kids or their kids. We are going to have a\n\n1:00:43.200 --> 1:00:50.240\n different world and things will evolve. So you believe that life, intelligent life,\n\n1:00:50.240 --> 1:00:58.800\n is ultimately about adaptability and evolving. So static loses in the end.\n\n1:00:58.800 --> 1:01:05.680\n Yes. Let me ask the, well, first the ridiculous question. Do you have any\n\n1:01:05.680 --> 1:01:10.880\n clue who Satoshi Nakamoto is? Is that even an interesting question?\n\n1:01:12.560 --> 1:01:19.920\n Well, your questions are very interesting. So, and I think, so I would say, first of all,\n\n1:01:19.920 --> 1:01:25.360\n it's not me. Okay. And I can prove it because, you know, if I were Satoshi Nakamoto, I would\n\n1:01:25.360 --> 1:01:31.680\n have not found an algorithm. It takes a totally different principle to approach to the system.\n\n1:01:31.680 --> 1:01:36.800\n But the other thing, who is Satoshi Nakamoto? You know what the right answer is? It's not him\n\n1:01:36.800 --> 1:01:46.080\n or her or them. Satoshi Nakamoto is Bitcoin. Because to me, it's such a coherent proof of\n\n1:01:46.080 --> 1:01:52.640\n work that at the end, the creator and the creation identify themselves. So you say,\n\n1:01:52.640 --> 1:01:57.280\n okay, I understand Michelangelo. Okay. He did the Sistine Chapel. Fine. He did the\n\n1:01:57.280 --> 1:02:04.480\n St. Peter's Dome. Fine. He did the Moses of the Pieta statue. Fine. But besides this,\n\n1:02:04.480 --> 1:02:10.160\n who was Michelangelo? That's the wrong question. It's his own work. That is Michelangelo.\n\n1:02:10.160 --> 1:02:18.640\n So I think that when you look at the Bitcoin is a piece of work that as it defects, yes,\n\n1:02:18.640 --> 1:02:26.160\n like anything human, but it was captivated the imaginations of millions of people as subverted\n\n1:02:26.160 --> 1:02:34.720\n the status quo. And I'm saying, you know, whoever this person of people are, he's living in this\n\n1:02:34.720 --> 1:02:43.360\n piece of work. I mean, it is Bitcoin. The idea of the work is bigger. We forget that sometimes.\n\n1:02:43.360 --> 1:02:49.200\n It's something about our biology likes to see a face and attach a face to the idea when really\n\n1:02:49.200 --> 1:02:54.320\n the idea is the thing we love. The idea is the thing that impact the idea is the thing that\n\n1:02:54.320 --> 1:03:00.080\n ultimately we, you know, Steve Jobs or somebody like that, we associate with the Mac or the iPhone\n\n1:03:00.080 --> 1:03:05.920\n with just everything he did at Apple. Apple, actually the company is Steve Jobs. Steve Jobs,\n\n1:03:05.920 --> 1:03:13.520\n the man is a pales in comparison to the creation. Correct. And the sense of aesthetics that has\n\n1:03:13.520 --> 1:03:19.680\n brought to the daily lives and very often aesthetic wins in the long, in the long,\n\n1:03:19.680 --> 1:03:25.440\n in the long game. And these are very elegant design product. And when you say, Oh,\n\n1:03:25.440 --> 1:03:31.360\n elegance, very few people care about it. Apparently millions and millions and millions\n\n1:03:31.360 --> 1:03:36.320\n and millions of people do because we are attacked by beauty and these are beautifully designed\n\n1:03:36.320 --> 1:03:44.400\n products. And, and, and, you know, and they've in addition to ever the technological aspect\n\n1:03:44.400 --> 1:03:50.400\n of the other thing. And I think, yes, that is, yeah, as the Stajewski said, beauty will save\n\n1:03:50.400 --> 1:03:57.760\n the world. So I'm, I'm with you on that one. Right. It currently seems like cryptocurrency,\n\n1:03:57.760 --> 1:04:07.120\n all these different technologies are gathering a lot of excitement, not just in our discourse,\n\n1:04:07.120 --> 1:04:13.600\n but in their like scale of financial impact. A lot of companies are starting to invest in Bitcoin.\n\n1:04:14.640 --> 1:04:25.760\n Do you think that the main method of store value and exchange of value, basically money will soon\n\n1:04:25.760 --> 1:04:28.640\n or at some point in the century will become cryptocurrency?\n\n1:04:29.840 --> 1:04:36.240\n Yes. So mind you, as I said, that the notion of cryptocurrency, like any other fundamental human\n\n1:04:36.240 --> 1:04:44.960\n notion has to evolve, but yes. So I think of it, uh, he has a lot of momentum behind it.\n\n1:04:45.520 --> 1:04:55.120\n Um, it's not only static as a visa programmable money as a smart contract. It allows a peer to\n\n1:04:55.120 --> 1:05:01.520\n peer interaction among people who don't even know each other. Right. Uh, and they don't even,\n\n1:05:01.520 --> 1:05:06.400\n therefore I cannot even trust each other just because they never saw each other.\n\n1:05:06.400 --> 1:05:12.400\n So I think it's so powerful that, uh, uh, is going to do this said again,\n\n1:05:13.680 --> 1:05:20.080\n a particular cryptocurrency should develop and cryptocurrency will all develop. But the answer\n\n1:05:20.080 --> 1:05:28.000\n is yes, we are going towards a much more, uh, unless we have a society, a sudden crisis for\n\n1:05:28.000 --> 1:05:34.080\n different reasons, which nobody hopes there's always an asteroid. There's always something,\n\n1:05:34.080 --> 1:05:38.640\n uh, nuclear war and all the existential crisis that we kind of think about,\n\n1:05:38.640 --> 1:05:44.560\n including artificial intelligence. Uh, okay. It's funny. You mentioned that, um,\n\n1:05:44.560 --> 1:05:50.400\n um, Michelangelo and Steve jobs, you know, set of ideas represents the person's work.\n\n1:05:50.400 --> 1:05:55.440\n So we talked about Algorand, which is a super interesting set of technologies, but,\n\n1:05:56.240 --> 1:06:05.520\n you know, he did also win the touring award. You have a bunch of, you have a bunch of ideas that\n\n1:06:05.520 --> 1:06:12.800\n are, you know, seminal ideas. So can we talk about cryptography for a little bit? What is the most\n\n1:06:12.800 --> 1:06:19.520\n beautiful idea in cryptography or computer science or mathematics in general asking somebody who has\n\n1:06:19.520 --> 1:06:26.400\n explored the depths of all? Well, there are a few contenders\n\n1:06:29.920 --> 1:06:38.880\n and, uh, either your work or, uh, or other words, uh, let's leave my work aside and, uh, and, uh,\n\n1:06:38.880 --> 1:06:49.120\n so, but one powerful idea and is, uh, both an old idea in some sense and a very, very modern one.\n\n1:06:49.120 --> 1:06:57.520\n And, uh, in my opinion is this idea of a one way function. So a function that easy to evaluate.\n\n1:06:57.520 --> 1:07:06.480\n So given X, you can compute F of X easily, but given F of X is very hard to go back to X. Okay.\n\n1:07:06.480 --> 1:07:17.120\n Think like breaking a glass, easy. Reconstruct the glass harder. Frying an egg, easy. From the\n\n1:07:17.120 --> 1:07:23.920\n fried egg to go back to the original egg, harder. If you want to be extreme, killing a living being,\n\n1:07:24.560 --> 1:07:31.840\n unfortunately, easy. The other way around, very hard. And so the fact that the notion of a function,\n\n1:07:31.840 --> 1:07:37.520\n whichever a recipe that is in front of your eyes to transform an X into F of X,\n\n1:07:37.520 --> 1:07:43.200\n and then from F of X, even though you see the recipe to transform it, you cannot go back to X.\n\n1:07:43.760 --> 1:07:53.440\n That in my opinion is one of the most elegant and momentous notions that there are. And it is a\n\n1:07:53.440 --> 1:07:58.960\n computational notion because of the difficulties in a computational sense. And it's a mathematical\n\n1:07:58.960 --> 1:08:05.360\n notion because we were talking about function. And it's so fruitful because that is actually\n\n1:08:05.360 --> 1:08:10.320\n the foundation of all cryptography. And let me tell you, it's an old notion\n\n1:08:11.600 --> 1:08:19.600\n because very often in any mythology that we think of, the most powerful gods or goddesses are the\n\n1:08:19.600 --> 1:08:27.040\n ones of X and the opposite of X, the gods of love and death. And when you take opposites,\n\n1:08:27.040 --> 1:08:32.960\n they don't just erase one another, you create something way more powerful. And this one,\n\n1:08:32.960 --> 1:08:40.480\n the function is extremely powerful because essentially becomes something that is easy\n\n1:08:40.480 --> 1:08:48.400\n for the good guys and hard for the bad guys. So for instance, in pseudo random number generation,\n\n1:08:49.280 --> 1:08:54.880\n the easy part of the function corresponds, you want to generate bits very quickly. And hard is\n\n1:08:54.880 --> 1:09:02.160\n predicting what the next bit is. It doesn't look the same. One is X f of X going from X f of X to\n\n1:09:02.160 --> 1:09:12.080\n X. What does it do? Predicting bits. By a magic of reductions in mathematical apparatus, this simple\n\n1:09:12.080 --> 1:09:18.240\n function morphs itself into pseudo random generation. This simple function morphs itself in\n\n1:09:18.240 --> 1:09:23.920\n digital signature scheme in which digitally signing should be easy and forging should be\n\n1:09:23.920 --> 1:09:28.800\n and forging should be hard. Again, a digital signature is not going from X to f of X,\n\n1:09:29.840 --> 1:09:37.440\n but the magic and the richness of this notion is that it is so powerful that it morphs in all\n\n1:09:37.440 --> 1:09:44.720\n kinds of incredible constructs. And in both these two opposites coexist, the easy and the hard,\n\n1:09:44.720 --> 1:09:52.160\n and in my opinion is a very, very elegant notion. That simple notion ties together cryptography,\n\n1:09:52.160 --> 1:09:59.520\n and like you said, pseudo random number generation. You have work on pseudo random functions.\n\n1:10:00.080 --> 1:10:08.240\n What are those? What's the difference in those and the generators, the pseudo random number\n\n1:10:08.240 --> 1:10:16.000\n generators? How do they work? Let's go back to pseudo random number generation. First of all,\n\n1:10:16.000 --> 1:10:19.600\n people think that the pseudo random number generation generates a random number. Not true,\n\n1:10:19.600 --> 1:10:28.320\n because I don't believe that from nothing you can get something. So nothing from nothing.\n\n1:10:29.680 --> 1:10:34.080\n But randomness, you cannot create it out of nothing, but what you could do\n\n1:10:35.120 --> 1:10:41.840\n is that it can be expanded. In other words, if you give me somehow 300 random bits,\n\n1:10:41.840 --> 1:10:48.560\n truly random bits, then I can give you 300,000, 300 million, 300 trillions, 300 quadrillions,\n\n1:10:48.560 --> 1:10:55.840\n as many as you want random bits, so that even though I tell you the recipe by which I produce\n\n1:10:55.840 --> 1:11:02.320\n these bits, but I don't tell you the initial 300 random numbers, I keep them secret, and you see\n\n1:11:02.320 --> 1:11:09.200\n all the bits I produced so far, if you were to bet, given all the bits produced so far,\n\n1:11:09.200 --> 1:11:15.120\n what is the next bit in my sequence? Better than 50, 50. Of course, 50, 50, anybody can guess.\n\n1:11:15.120 --> 1:11:23.200\n But to be inferring something, you have to be a bit better. Then the effort to do this extra bit\n\n1:11:23.200 --> 1:11:29.360\n is so enormous that is de facto random. So that is a pseudo random generator, are these\n\n1:11:29.360 --> 1:11:37.200\n expanders of secret randomness, which goes extremely fast. Okay, that said, what is that?\n\n1:11:37.200 --> 1:11:43.600\n Expanders of secret randomness, beautifully put. Okay, so every time somebody, if you're a\n\n1:11:43.600 --> 1:11:49.120\n programmer, is using a function that's not called pseudo random, it's called random usually,\n\n1:11:49.120 --> 1:11:54.320\n you know, these programming languages, and it's generating different, that's essentially\n\n1:11:54.320 --> 1:12:00.480\n expanding the secret randomness. But they should. In the past, actually, most of the library,\n\n1:12:00.480 --> 1:12:07.920\n they used something pre modern cryptography, unfortunately. They would be better served\n\n1:12:07.920 --> 1:12:17.040\n with 300 real seed random number, and then expand them properly, as we know now.\n\n1:12:18.400 --> 1:12:25.520\n But that has been a very old idea. In fact, one of the best philosophers have debated\n\n1:12:27.360 --> 1:12:31.680\n whether the world was deterministic or probabilistic. Very big questions, right?\n\n1:12:32.240 --> 1:12:33.520\n Does God play dice?\n\n1:12:33.520 --> 1:12:40.720\n Exactly. Einstein says it does, it doesn't. But in fact, now we have a language that even\n\n1:12:40.720 --> 1:12:45.280\n at the Albert time was not around, but it was this complex theory of modern\n\n1:12:45.280 --> 1:12:52.480\n complexity based cryptography. And now we know that if the universe has 300 random bits,\n\n1:12:53.040 --> 1:12:58.000\n whether where is random or probabilistic or deterministic, it doesn't matter,\n\n1:12:58.000 --> 1:13:04.560\n because you can expand this initial seed of randomness forever in which all the experiments\n\n1:13:04.560 --> 1:13:08.720\n you could do, all the inferences you could do, all the things you could do, they are,\n\n1:13:08.720 --> 1:13:13.680\n you are not be able to distinguish them from truly random. So if you are not able to distinguish\n\n1:13:14.320 --> 1:13:21.120\n truly random from this super duper pseudo randomness, are they really different things?\n\n1:13:22.480 --> 1:13:27.200\n So many to become really philosophical. So for things to be different, but I don't have\n\n1:13:27.200 --> 1:13:32.480\n in my lifetime, in the lifetime of the universe, any method to set them aside,\n\n1:13:32.480 --> 1:13:38.480\n well, I should be intellectually honest, say, well, pseudo random in this special\n\n1:13:38.480 --> 1:13:40.400\n fraction is as good as random.\n\n1:13:41.040 --> 1:13:46.560\n Do you think true randomness is possible? And what does that mean?\n\n1:13:48.160 --> 1:13:52.320\n So practically speaking, exactly as you said, if you're being honest,\n\n1:13:52.320 --> 1:13:57.680\n that the pseudo randomness approaches true randomness pretty quickly.\n\n1:13:58.800 --> 1:14:03.840\n But is it, maybe this is a philosophical question. Is there such a thing as true randomness?\n\n1:14:05.760 --> 1:14:13.680\n Well, the answer is actually maybe, but if it exists, most probably it's expensive to get.\n\n1:14:14.800 --> 1:14:19.040\n And in any case, if I give you one of mine,\n\n1:14:19.040 --> 1:14:26.560\n you will never tell them apart by any other shape, no matter how much you work on it.\n\n1:14:26.560 --> 1:14:32.640\n So in some sense, if it exists or not, it really is a quote philosophical sense in the\n\n1:14:33.600 --> 1:14:38.240\n colloquial way to say that we cannot somehow pin it down.\n\n1:14:38.240 --> 1:14:43.360\n Do you ever, again, just to stay unphilosophical for a bit, for a brief moment,\n\n1:14:43.360 --> 1:14:52.640\n do you ever think about free will and whether that exists because ultimately free will sort of\n\n1:14:52.640 --> 1:14:59.680\n is this experience that we have, like we're making choices, even though it appears that,\n\n1:15:00.240 --> 1:15:05.520\n you know, the world is deterministic at the core. I mean, that's against the debate,\n\n1:15:05.520 --> 1:15:13.520\n but if it is in fact deterministic at the lowest possible level, at the physics level,\n\n1:15:14.560 --> 1:15:20.240\n how do you make, if it is deterministic, how do you make sense of the difference between the\n\n1:15:20.240 --> 1:15:24.640\n experience of us feeling like we're making a choice and the whole thing being deterministic?\n\n1:15:25.200 --> 1:15:30.640\n So first of all, let me give you a gut reaction to the question. And the gut reaction is that\n\n1:15:30.640 --> 1:15:39.920\n it is important that we believe that there exists free will. And second of all, almost\n\n1:15:41.360 --> 1:15:48.960\n by weird logic, if we believe it exists, then it does exist. Okay. So it's very important for our\n\n1:15:48.960 --> 1:15:55.840\n social apparatus, for our sense of ourselves that it exists. And the moment in which, you know,\n\n1:15:55.840 --> 1:16:02.080\n we so want to, we almost conjure it up in existence. But again, I really feel that if\n\n1:16:02.080 --> 1:16:11.280\n you look at some point, the space of free will seems to shrink. We realize how more and more,\n\n1:16:11.280 --> 1:16:17.680\n how much of our, say, genetic apparatus dictates who we are, why we prefer certain things than\n\n1:16:17.680 --> 1:16:23.760\n others, right, and why we react to noises of music. We really prefer poetry and everything\n\n1:16:23.760 --> 1:16:31.040\n else. We may explain even all this. But at the end of the day, whether it exists in a\n\n1:16:31.040 --> 1:16:38.720\n philosophical sense or not, it's like randomness. If pseudo random is as good as random vis a vis\n\n1:16:38.720 --> 1:16:42.560\n lifetime of the universe, our experience, then it doesn't really matter.\n\n1:16:42.560 --> 1:16:48.400\n Yeah. So, you know, we're talking about randomness. I wonder if I can weave in\n\n1:16:48.400 --> 1:16:55.280\n quantum mechanics for a brief moment. There's a, you know, a lot of advancements on the quantum\n\n1:16:55.280 --> 1:17:02.640\n computing side. So leveraging quantum mechanics to perform a new kind of computation, and there's\n\n1:17:02.640 --> 1:17:08.880\n concern of that being a threat to a lot of the basic assumptions that underlie cryptography.\n\n1:17:10.000 --> 1:17:16.800\n What do you think? Do you think quantum computing will challenge a lot of cryptography? Will\n\n1:17:16.800 --> 1:17:20.640\n cryptography be able to defend all those kinds of things?\n\n1:17:20.640 --> 1:17:25.440\n Okay, great. So first of all, for the record, and not because I think it matters, but it's\n\n1:17:25.440 --> 1:17:32.400\n important to set the record, there are people who continue to contend that quantum mechanics exist,\n\n1:17:32.400 --> 1:17:37.840\n but that's nothing to do with computing. It's not going to accelerate it, at least, you know,\n\n1:17:37.840 --> 1:17:45.600\n very basic, you know, hard computation. That is a belief that you cannot take it out. I'm a little\n\n1:17:45.600 --> 1:17:52.320\n bit more agnostic about it, but I really believe, going back to whatever I said about the one way\n\n1:17:52.320 --> 1:17:58.960\n function. So one way function, what is it? That is a cryptography. So does quantum computing\n\n1:17:58.960 --> 1:18:04.160\n challenge the one way function? Essentially, you can boil it down to does quantum computing\n\n1:18:04.160 --> 1:18:08.720\n challenge the one way function. What is one way function? Easy in one direction, hard in the other.\n\n1:18:09.360 --> 1:18:16.560\n Okay, but if quantum computing exists, when you define what it is easy, it's not easy by a classical\n\n1:18:16.560 --> 1:18:22.640\n computer and hard by a classical computer, but easy for a quantum computer, that's a bad idea.\n\n1:18:22.640 --> 1:18:30.720\n But once easy means it should be easy for a quantum and hard for also quantum. Then you can\n\n1:18:30.720 --> 1:18:36.720\n see that you are, yes, it's a challenge, but you have hope because you can absorb if one computing\n\n1:18:36.720 --> 1:18:44.000\n really realizes and becomes available according to the promises, then you can use them also for the\n\n1:18:44.000 --> 1:18:50.720\n easy part. And once you use it from the easy part, the choices that you have a one way function,\n\n1:18:50.720 --> 1:18:57.680\n they multiply. So, okay, so they particularly candidates of one way function, they not only\n\n1:18:57.680 --> 1:19:06.080\n candidates of one way function, they not be one way anymore, but quantum one way function may\n\n1:19:06.080 --> 1:19:18.480\n continue to exist. And so I really believe that for life to be meaningful, this one way function\n\n1:19:18.480 --> 1:19:28.240\n had to exist. Because just imagine that anything that is becomes easy to do. I mean, what kind of\n\n1:19:28.240 --> 1:19:35.120\n life is it? I mean, so you need that. And if something is hard, but it's so hard to generate,\n\n1:19:35.120 --> 1:19:39.920\n you'll never find something which is hard for you. You want to that there is abundance,\n\n1:19:39.920 --> 1:19:44.960\n that is easy to produce hard problem. That's my opinion is why life is interesting,\n\n1:19:44.960 --> 1:19:54.080\n because pop up really, really speed. So in some sense, I almost think that I do hope they exist\n\n1:19:54.080 --> 1:19:59.440\n if they don't exist, somehow life is way less interesting than it actually is.\n\n1:19:59.440 --> 1:20:05.920\n Yeah, it does. That's funny. It does seem like the one way function is fundamental to all of life,\n\n1:20:05.920 --> 1:20:12.720\n which is the emergence of the complexity that we see around us seem to require the one way function.\n\n1:20:12.720 --> 1:20:18.960\n I don't know if you play with cellular automata. That's just another formulation of.\n\n1:20:18.960 --> 1:20:22.000\n I know, but it's very simple.\n\n1:20:22.000 --> 1:20:28.640\n It's almost a very simple illustration of starting out with simple rules in one way,\n\n1:20:29.280 --> 1:20:34.080\n being able to generate incredible amounts of complexity. But then you ask the question,\n\n1:20:34.080 --> 1:20:44.160\n can I reverse that? And it's just surprising how difficult it is to reverse that. It's surprising,\n\n1:20:44.160 --> 1:20:52.240\n even in constrained situations, it's very difficult to prove anything that it almost,\n\n1:20:52.240 --> 1:20:58.160\n I mean, the sad thing about it. Well, I don't know if it's sad, but it seems like we don't\n\n1:20:58.160 --> 1:21:04.960\n even have the mathematical tools to reverse engineer stuff. I don't know if they exist or not,\n\n1:21:04.960 --> 1:21:08.640\n but in the space of cellular automata, where you start with something simple and you create\n\n1:21:08.640 --> 1:21:14.000\n something incredibly complex, can you take something, a small picture of that complex\n\n1:21:14.000 --> 1:21:19.520\n and reverse engineer? That's kind of what we're doing as scientists here. You're seeing the result\n\n1:21:19.520 --> 1:21:24.400\n of the complexity and you're trying to come up with some universal law that generate all of this.\n\n1:21:24.400 --> 1:21:29.280\n What is the theory of everything? What are the basic physics laws that generated this whole\n\n1:21:29.280 --> 1:21:35.120\n thing? And there's a hope that you should be able to do that, but it gets, it's difficult.\n\n1:21:35.120 --> 1:21:40.560\n Yeah. But there is also some poetry on the fact that it's difficult because it gives us some\n\n1:21:40.560 --> 1:21:48.000\n mystery to life, without which, I mean, it's not so fun. Life is no business fun.\n\n1:21:48.000 --> 1:21:52.720\n Can we talk about interactive proofs a little bit and zero knowledge proofs? What are those?\n\n1:21:52.720 --> 1:21:55.200\n What are those? How do they work?\n\n1:21:55.200 --> 1:22:06.560\n So interactive proof actually is a modern realization and conceptualization of something\n\n1:22:06.560 --> 1:22:12.880\n that we knew was true, that is easy to go to lecture. In fact, that's my motivation.\n\n1:22:12.880 --> 1:22:17.520\n We invented schools to go to lecture. We don't say, oh, I'm the minister of education. I published\n\n1:22:17.520 --> 1:22:24.880\n this book. You read it. This is book for this year, this book for this year. We spend a lot\n\n1:22:24.880 --> 1:22:31.600\n of our treasury in educating our kids and in person, educating, go to class, interact with\n\n1:22:31.600 --> 1:22:37.920\n teacher, on the blackboard and chalk on my time. Now we can have a whiteboard and presumably you're\n\n1:22:37.920 --> 1:22:46.240\n going to have actually this magic pens and a display instead. But the idea is that interactively\n\n1:22:46.240 --> 1:22:53.280\n you can convey truth much more efficiently. We knew this psychologically. It's better to\n\n1:22:53.280 --> 1:23:00.320\n hear an explanation than just to belabor some paper. Same thing. So interactive proofs is a\n\n1:23:00.320 --> 1:23:06.320\n way to do the following. Rather than doing some complicated, very long papers and possibly\n\n1:23:06.320 --> 1:23:12.720\n infinitely long proofs, exponentially long proofs, you say the following. If this theorem is true,\n\n1:23:12.720 --> 1:23:18.560\n there is a game that is associated to the theorem. If the theorem is true, this game,\n\n1:23:19.840 --> 1:23:25.680\n I have a winning strategy that I can win half of the time, no matter what you do.\n\n1:23:26.640 --> 1:23:30.240\n So then you say, well, is the theorem true? You believe me. Why should I believe you? Okay,\n\n1:23:30.240 --> 1:23:38.000\n let's play. If I prove that I have a strategy and I win the first time and I win the second time,\n\n1:23:38.000 --> 1:23:45.440\n then I lose a third time. But I win more than half of the time, or I win, say, all the time\n\n1:23:45.440 --> 1:23:50.080\n if the theorem is true, and at least at most half of the time if the theorem is false, you\n\n1:23:50.080 --> 1:23:59.520\n statistically get convinced. You can verify this quickly. And therefore, when the game typically\n\n1:23:59.520 --> 1:24:06.480\n is extremely fast, so you generate a miniature game in which if the theorem is true, I win all\n\n1:24:06.480 --> 1:24:12.480\n the time, and if the theorem is false, I can win at most half of the time. And if I win, win, win,\n\n1:24:12.480 --> 1:24:16.640\n win, win, win, win, win, you can deduce either the theorem is true, which most probably is my\n\n1:24:16.640 --> 1:24:25.760\n case of the week, or I've been very, very unlucky because it's like if I had 100 coin tosses and I\n\n1:24:25.760 --> 1:24:33.520\n got 100 heads. Very improbable. So that is a way. And so this transformation from the formal\n\n1:24:33.520 --> 1:24:41.520\n statement of a proof into a game that can be quickly played, and you can draw statistics\n\n1:24:41.520 --> 1:24:50.400\n how many times you win, is one of a big conquest of modern complexity theory. And in fact,\n\n1:24:50.400 --> 1:24:57.040\n actually has highlighted the notion of a proof as it really gives us a new insight of what to\n\n1:24:57.040 --> 1:25:05.760\n be true means and what truth is and what proofs are. So these are legitimately proofs. So what\n\n1:25:05.760 --> 1:25:17.200\n kind of mysteries can it allow us to unlock and prove? You said truth. So what does it allow us?\n\n1:25:17.200 --> 1:25:24.160\n What kind of truth does that allow us to arrive at? So it enlarges the realm of what is provable\n\n1:25:24.160 --> 1:25:29.840\n because in some sense of the classical way of proving things was extremely\n\n1:25:31.280 --> 1:25:34.720\n inefficient from the verifier point of view. Yes.\n\n1:25:34.720 --> 1:25:41.680\n Right. And so therefore, there is so much proof that you can take. But in this way,\n\n1:25:41.680 --> 1:25:49.920\n you can actually very quickly, in minutes, verify something that is the correctness of an assertion\n\n1:25:49.920 --> 1:25:56.720\n that otherwise would have taken a lifetime to belabor and check all the passages of a very,\n\n1:25:56.720 --> 1:26:02.560\n very, very long proof. And you better check all of them because if you don't check one line,\n\n1:26:02.560 --> 1:26:08.240\n an error can be in that line. And so you have to go linearly through all the stuff rather than\n\n1:26:08.240 --> 1:26:13.920\n bypass this. So you enlarge a tremendous amount what the proof is. And in addition,\n\n1:26:13.920 --> 1:26:20.080\n once you have the idea that essentially a proof system is something that\n\n1:26:22.000 --> 1:26:28.880\n allows me to convince you of a true statement, but does not allow me to convince you of a false\n\n1:26:28.880 --> 1:26:35.920\n statement, and that at the end is proof. Proof can be beautiful, should be elegant,\n\n1:26:35.920 --> 1:26:43.840\n but at the end is true or false. It is possible to prove the truth and it should be impossible\n\n1:26:43.840 --> 1:26:49.760\n or statistically extremely hard to prove something false. And if you do this, you can prove way,\n\n1:26:49.760 --> 1:26:56.720\n way more once you understand this. And on top of it, we got some insight like in this zero\n\n1:26:56.720 --> 1:27:04.320\n knowledge proofs that is in something which you took for granted where the same knowledge\n\n1:27:04.320 --> 1:27:11.920\n and verification are actually separate concepts. So you can verify that an assertion is correct\n\n1:27:11.920 --> 1:27:18.320\n without having any idea why this is so. And so people failed to say, if you want to verify\n\n1:27:18.320 --> 1:27:22.320\n something, you have to have the proof. Once you have the proof, you know why it's true,\n\n1:27:22.320 --> 1:27:33.120\n you have the proof itself. So somehow you can totally differentiate knowledge and verification\n\n1:27:33.120 --> 1:27:37.280\n validity. So totally, you can decide if something is true and still have no idea.\n\n1:27:37.280 --> 1:27:38.880\n Is there a good example in your mind?\n\n1:27:38.880 --> 1:27:47.600\n Oh, actually, you know, at the beginning, we labored to find the first zero knowledge proof.\n\n1:27:47.600 --> 1:27:53.280\n Then we found a second, then we found a third. And then a few years later, actually, we proved\n\n1:27:53.280 --> 1:28:01.760\n a theorem which essentially says every theorem, no matter what about, can be explained in a zero\n\n1:28:01.760 --> 1:28:10.640\n knowledge way. So it's not a class of theorem, but all theorems. And it's a very powerful thing. So\n\n1:28:10.640 --> 1:28:18.000\n we were really, for thousands of years, bought this identity between knowledge and verification\n\n1:28:18.000 --> 1:28:23.600\n had to be hand in hand together, and for no reason at all. I mean, we had to develop a\n\n1:28:23.600 --> 1:28:28.880\n way of technology. As you know, I'm very big on technology because it makes us more human\n\n1:28:28.880 --> 1:28:37.200\n and make us understand more things than before. And I think that's a good thing.\n\n1:28:37.760 --> 1:28:43.600\n So this interactive proof process, there's power in games.\n\n1:28:43.600 --> 1:28:43.840\n Yes.\n\n1:28:43.840 --> 1:28:49.200\n And you've recently gotten into, recently, I'm not sure you can correct me, mechanism design.\n\n1:28:50.000 --> 1:28:50.240\n Yeah.\n\n1:28:50.240 --> 1:28:58.720\n So first of all, maybe you can explain what mechanism design is and the fascinating\n\n1:28:58.720 --> 1:29:02.480\n space of playing with games and designing games.\n\n1:29:03.200 --> 1:29:10.480\n Mechanism design is that you want a certain behavior to arise. If you want to organize\n\n1:29:11.680 --> 1:29:17.200\n a societal structure or something, you want to have some orderly behavior to arise because\n\n1:29:17.200 --> 1:29:26.240\n it is important for your goals. But you know that people, they don't care what my goals are.\n\n1:29:26.240 --> 1:29:32.960\n They care about maximizing their utility. So put it crassly, making money. The more money,\n\n1:29:32.960 --> 1:29:36.320\n the better, so to speak. I'm exaggerating.\n\n1:29:36.320 --> 1:29:39.280\n Self interest in whatever way then.\n\n1:29:39.280 --> 1:29:48.640\n So what you want to do is, ideally, what you want to do is to design a game so that\n\n1:29:48.640 --> 1:29:56.880\n while people play it, so to maximize their self interest, they achieve the social goal\n\n1:29:56.880 --> 1:30:03.760\n and behavior that I want. That is really the best type of thing. And it is a very\n\n1:30:03.760 --> 1:30:18.560\n hard science and art to design these games. And it challenges us to actually come up with\n\n1:30:18.560 --> 1:30:24.880\n solution concepts for a way to analyzing the games that need to be broader. And I think\n\n1:30:25.760 --> 1:30:32.320\n game theory has developed a bunch of very compelling ways to analyze the game,\n\n1:30:32.320 --> 1:30:37.920\n that if the game has the best property, you can have a pretty good guarantee that it's going to\n\n1:30:37.920 --> 1:30:45.360\n be played in a given way. But as it turns out, and not surprisingly, these tools have a range\n\n1:30:45.360 --> 1:30:50.080\n of action like anything else. All these so called the technical resolution concept,\n\n1:30:50.080 --> 1:30:54.880\n the way to analyze the game, like dominant strategy equilibrium, if something comes to mind,\n\n1:30:54.880 --> 1:31:02.720\n would be very meaningful. But as a limited power, in some sense, the games that can be\n\n1:31:03.600 --> 1:31:05.680\n admit to such a way to be analyzed.\n\n1:31:05.680 --> 1:31:09.920\n There's a very specific kind of games and the rules are set, the constraints are set,\n\n1:31:09.920 --> 1:31:11.840\n the utilities are all set.\n\n1:31:11.840 --> 1:31:19.040\n Yes. So if you want to reason, if there is a way, say, that you can analyze a restricted\n\n1:31:19.040 --> 1:31:26.240\n class of games this way, but most games don't fall into this restricted class, then what do I do?\n\n1:31:26.240 --> 1:31:35.280\n When you need to enlarge a way what a rational player can do. So for instance, in my opinion,\n\n1:31:35.280 --> 1:31:44.080\n at least in some of my, I played with this for a few years, and I was doing some exoteric things,\n\n1:31:44.080 --> 1:31:50.640\n I'm sure, in the space that was not exactly mainstream. And then I changed my interest in\n\n1:31:51.360 --> 1:31:58.000\n blockchain. But what I'm saying for a while I was doing. So for instance, to me, is a way in which\n\n1:31:58.000 --> 1:32:04.720\n I design the game, and you don't have the best move for you. The best move is the move that is\n\n1:32:04.720 --> 1:32:08.800\n best for you, no matter what the other players are doing. Sometimes a game doesn't have that,\n\n1:32:08.800 --> 1:32:15.280\n okay, it's too much to ask. But I can design the game such that given the option in front of you\n\n1:32:15.280 --> 1:32:20.560\n say, oh, these are really stupid for me, take them aside. But these, these are not stupid.\n\n1:32:21.200 --> 1:32:27.760\n So if you design the game so that in any combination of non stupid things that the player\n\n1:32:27.760 --> 1:32:36.320\n can do, I achieve what I want, I'm done. I don't care to find the very unique equilibrium. I don't\n\n1:32:36.320 --> 1:32:41.360\n give a damn. I want to say, well, as long as you don't do stupid things, and nobody else does\n\n1:32:41.360 --> 1:32:48.640\n stupid things, good social things outcome arise, I should be equally happy. And so I really believe\n\n1:32:48.640 --> 1:33:01.360\n that this type of analysis is possible and has a bigger radius. So it reaches more games, more\n\n1:33:01.360 --> 1:33:07.920\n classes or games. And after that, we have to enlarge it again. And it's going to be, we're\n\n1:33:07.920 --> 1:33:15.520\n going to have fun because human behavior can be conceptualized in many ways. And it's a long game.\n\n1:33:16.240 --> 1:33:20.480\n It's a long game. Do you have favorite games that you're looking at now? I mean, I suppose\n\n1:33:20.480 --> 1:33:26.800\n your work with blockchain and Algorand is a kind of game that you're basically this mechanism\n\n1:33:26.800 --> 1:33:34.720\n design, design the game such that it's scalable, secure and decentralized, right? Yes. And very\n\n1:33:34.720 --> 1:33:43.840\n often you have to say, and you must also design so that the incentives are, and tell you the truth,\n\n1:33:43.840 --> 1:33:51.280\n whatever little I learned from my venture in mechanism design is that incentives are very\n\n1:33:51.280 --> 1:33:59.040\n hard to design because people are very complex creatures. And so somehow the way we design\n\n1:33:59.040 --> 1:34:08.000\n Algorand is a totally different way, essentially with no incentives, essentially. But technically\n\n1:34:08.000 --> 1:34:16.560\n speaking, there is a notion that is actually believable, right? So that to say people want\n\n1:34:16.560 --> 1:34:23.920\n to maximize their utility. Yes. Up to a point. Let me tell you. Assume that if you are honest,\n\n1:34:25.040 --> 1:34:30.720\n you make a hundred bucks. But if you are dishonest, no matter how dishonest you are,\n\n1:34:30.720 --> 1:34:35.840\n you can only make a hundred bucks and one cent. What are you going to be? I'm saying,\n\n1:34:35.840 --> 1:34:42.080\n you know what? Technically speaking, even that one cent, nobody bothers and say,\n\n1:34:42.080 --> 1:34:46.640\n how much am I going to make by honest? A hundred. If I'm devious and if I'm a criminal,\n\n1:34:46.640 --> 1:34:51.280\n 100 bucks and one cent, you know, I might as well be honest. Okay. So that essentially is called,\n\n1:34:51.280 --> 1:35:00.160\n you know, Epsilon utility equilibrium, but I think it's good. And that's what we design\n\n1:35:00.160 --> 1:35:07.600\n essentially means that, you know, having no incentives is actually a good thing because\n\n1:35:07.600 --> 1:35:13.280\n prevent people from reasoning, how else are you going to gain the system? But why can we achieve\n\n1:35:13.280 --> 1:35:18.640\n an algorithm to have no incentives and in Bitcoin instead, you have to pay the miners because they\n\n1:35:18.640 --> 1:35:26.080\n do a tremendous amount of work. Because if you have to do a lot of work, then you demand to be\n\n1:35:26.080 --> 1:35:31.360\n paid accordingly. Because you, right? But if I'm going to say you have to add two and two equal\n\n1:35:31.360 --> 1:35:35.600\n to four, how much you want me to pay for this? If you don't give me this, I don't add the two\n\n1:35:35.600 --> 1:35:40.240\n and two. I would say you can add two and two in your sleep. You don't need to be paid to add the\n\n1:35:40.240 --> 1:35:46.320\n two and two. So the idea is that if we make the system so efficient, so that generating the next\n\n1:35:46.320 --> 1:35:52.640\n block is so damn simple, it doesn't hit the universe, let alone my computer, let alone\n\n1:35:52.640 --> 1:35:59.360\n take some microsecond of computation, I might as well not being received incentives for doing that\n\n1:35:59.360 --> 1:36:03.680\n and try to incentivize some other part of the system, but not to the main consensus,\n\n1:36:03.680 --> 1:36:06.800\n which is a mechanism for generating and adding block to the chain.\n\n1:36:08.800 --> 1:36:15.600\n Since you're Italian, Sicilian, I also heard rumors that you are a connoisseur of food.\n\n1:36:19.280 --> 1:36:25.360\n If I said today's the last day you get to be alive, you shouldn't have trusted me.\n\n1:36:26.160 --> 1:36:29.760\n You never know with a Russian whether you're going to make it out or not. Well, if you had\n\n1:36:29.760 --> 1:36:36.240\n one last meal, you can travel somewhere in the world. Either you make it or somebody else makes\n\n1:36:36.240 --> 1:36:44.320\n it. What's that going to look like? All right. If it's one last meal, I must say in this era of\n\n1:36:44.320 --> 1:36:56.000\n COVID, I have not been able to see my mom. My mom was a fantastic chef and had this very\n\n1:36:56.000 --> 1:37:00.880\n traditional food. As you know, the very traditional food are great for a reason,\n\n1:37:00.880 --> 1:37:08.160\n because they survived hundreds of years of culinary innovation. There is one very laborious\n\n1:37:08.160 --> 1:37:16.160\n thing, which is, you heard the name, which is parmigiana, but to do it is a piece of\n\n1:37:16.160 --> 1:37:22.160\n art. So many hours that only my mom could do it. If we have one last meal, I want a parmigiana.\n\n1:37:22.160 --> 1:37:30.960\n Okay. What's the laborious process? Is it the ingredients? Is it the actual process?\n\n1:37:31.600 --> 1:37:34.640\n Is it the atmosphere and the humans involved?\n\n1:37:36.080 --> 1:37:45.200\n The latter. The ingredient like in any other, in the Italian cuisine, believes in very few\n\n1:37:45.200 --> 1:37:55.520\n ingredients. If you take say quintessential Italian recipe, spaghetti pesto. Pesto is olive oil,\n\n1:37:56.240 --> 1:38:06.880\n very good extra virgin olive oil, basil, pine nuts, pepper, clove of garlic, not too much,\n\n1:38:06.880 --> 1:38:15.360\n otherwise you overpower everything. And then to do either two schools of thought, parmesan or pecorino\n\n1:38:15.360 --> 1:38:22.320\n or a mix of the two. I mentioned six ingredients. That is typical Italian. I understand that there\n\n1:38:22.320 --> 1:38:26.960\n are other cuisines, for instance, a French cuisine, which is extremely sophisticated\n\n1:38:26.960 --> 1:38:33.360\n and extremely combinatorial, or some Chinese cuisine, which has a lot of many more ingredients\n\n1:38:33.360 --> 1:38:40.000\n than this. And yet the art is to put them together a lot of things. In Italy is really the striving\n\n1:38:40.000 --> 1:38:45.840\n for simplicity, yet to find few ingredients, but the right ingredients to create something.\n\n1:38:45.840 --> 1:38:54.000\n So in parmigiana, the ingredients are eggplants, tomatoes, basil, but how to put them together\n\n1:38:54.000 --> 1:39:04.560\n and the process is an act of love, labor and love. You can spend the entire day,\n\n1:39:04.560 --> 1:39:09.040\n I'm not exaggerating, but the entire morning for sure to do it properly.\n\n1:39:09.920 --> 1:39:14.800\n Yeah, as a Japanese cuisine too, there's a mastery to the simplicity with the sushi. I don't know\n\n1:39:14.800 --> 1:39:19.280\n if you've seen Giorgio's of sushi, but there's a mastery to that that's propagated through the\n\n1:39:19.280 --> 1:39:25.360\n generations. It's fascinating. You know, people love it when I ask about books. I don't know\n\n1:39:26.080 --> 1:39:32.960\n if books, whether fiction, nonfiction, technical or completely non technical had an impact on your\n\n1:39:32.960 --> 1:39:37.360\n life throughout. If there's anything you would recommend or even just mention as something that\n\n1:39:37.360 --> 1:39:45.280\n gave you an insight or moved you in some way. So, okay. So I don't know if I can comment because\n\n1:39:45.280 --> 1:39:50.480\n in some sense you almost had to be Italian or to be such a scholar, but being Italian,\n\n1:39:51.120 --> 1:39:59.520\n one thing that really impressed me tremendously is the Divine Comedy. It is a medieval poem,\n\n1:39:59.520 --> 1:40:07.280\n a very long poem divided in three parts, hell, purgatory and paradise. Okay. And that is the\n\n1:40:07.280 --> 1:40:19.200\n non trivial story of a middle man gets into a crisis, personal crisis. And then out of this\n\n1:40:19.200 --> 1:40:27.600\n crisis he purifies, makes a catastrophe, purifies himself more and more and more until he's become\n\n1:40:28.480 --> 1:40:35.280\n capable of actually meeting God. Okay. And that is actually a complex story. So you have to get\n\n1:40:35.280 --> 1:40:43.760\n some very sophisticated language, maybe Latin at that point. We are talking about 1200s Italy,\n\n1:40:45.920 --> 1:40:52.800\n in Florence. And this guy instead, he chose his own dialect, not spoken outside his own immediate\n\n1:40:52.800 --> 1:41:01.920\n circle, a Florentine dialect. Actually, Dante really made Italian, Italian. How can you express\n\n1:41:01.920 --> 1:41:10.240\n such a sophisticated thing? And then the point is that these words that nobody actually knew\n\n1:41:10.240 --> 1:41:16.080\n because they were essentially dialect and plus a bunch of very intricate rhymes in which they had\n\n1:41:16.080 --> 1:41:23.440\n to rhyme with things. And it turns out that by getting meaning from the things that rhyme,\n\n1:41:23.440 --> 1:41:29.680\n you essentially guess what the word means and you invent Italian and you communicate\n\n1:41:29.680 --> 1:41:35.200\n it by almost osmosis what you want. It's a miracle of communication. In a dialect,\n\n1:41:35.200 --> 1:41:40.320\n a very poor language, very unsophisticated to express very sophisticated situation.\n\n1:41:41.600 --> 1:41:50.480\n I love it. People love it, Italians and not Italian. But what I got of it is that very often\n\n1:41:52.080 --> 1:41:58.000\n limitations are our strength. Because if you limit yourself at a very poor language,\n\n1:41:58.000 --> 1:42:04.080\n somehow you get out of it and you achieve even better form of communication using a hyper\n\n1:42:04.080 --> 1:42:08.640\n sophisticated literary language with lots of resonance from the prior books so that you can\n\n1:42:08.640 --> 1:42:13.280\n actually instantaneously quote. He couldn't quote anything because nothing was written in Italian\n\n1:42:13.280 --> 1:42:21.840\n before him. So I really felt that limitations are our strength. And I think that rather than\n\n1:42:21.840 --> 1:42:29.600\n complaining about the limitations, we should embrace them because if we embrace our limitation,\n\n1:42:29.600 --> 1:42:36.000\n limited as we are, we find very creative solutions that people with less limitation we have,\n\n1:42:36.960 --> 1:42:41.760\n we would not even think about it. So limitations are kind of superpower if you choose to see it\n\n1:42:41.760 --> 1:42:49.440\n that way. Since you speak both languages, is there something that's lost in translation to you? Is\n\n1:42:49.440 --> 1:42:55.120\n there something you can express in Italian that you can't in English and vice versa maybe? Is\n\n1:42:55.120 --> 1:43:00.240\n there something you could say to the musicality of the language? I mean, I've been to Italy a few\n\n1:43:00.240 --> 1:43:09.360\n times and I'm not sure if it's the actual words, but the people are certainly very, there's body\n\n1:43:09.360 --> 1:43:16.720\n language too. There's just the whole being is language. So I don't know if you miss some of that\n\n1:43:16.720 --> 1:43:25.360\n when you're speaking English in this country. Yes. In fact, actually, certainly I miss it.\n\n1:43:25.360 --> 1:43:33.040\n And somehow it was a sacrifice that I made consciously by the time I arrived. I knew that\n\n1:43:33.040 --> 1:43:40.720\n this, I was not going to express myself at that level. And it was actually a sacrifice because\n\n1:43:40.720 --> 1:43:47.360\n given to you also your mother tongue is Russian. So you know that you can be very expressive in\n\n1:43:47.360 --> 1:43:53.520\n your mother tongue and not very expressive in a new tongue, a new language. And then what people\n\n1:43:53.520 --> 1:43:58.880\n think of you in the new language, because when the precise of expression of things, it generates,\n\n1:43:59.840 --> 1:44:08.720\n it shows elegance or it shows knowledge or it shows as a census or it shows as a caste or\n\n1:44:08.720 --> 1:44:12.160\n education, whatever it is. So all of a sudden I found myself on the bottom.\n\n1:44:14.560 --> 1:44:22.720\n So I had to fight all my way up, back up. But what I'm saying, their limitations are actually\n\n1:44:22.720 --> 1:44:30.000\n our strength. In fact, it's a trick to limit yourself to exceed. And there are examples in\n\n1:44:30.000 --> 1:44:38.640\n history. If you think about Hernan Cortes, he goes to invade Mexico. He has what, a few hundred\n\n1:44:38.640 --> 1:44:44.560\n people with him and he has a hundred thousand people in arms on the other side. First thing he\n\n1:44:44.560 --> 1:44:53.520\n does, he limits himself. He sinks his own ship. There is no return. And at that point he actually\n\n1:44:53.520 --> 1:45:01.040\n manages. That's really profound. I actually, first of all, this inspiring to me, I feel like I have\n\n1:45:01.040 --> 1:45:07.200\n quite a few limitations, but more practically on the Russian side, I'm going to try to do a couple\n\n1:45:07.200 --> 1:45:13.280\n of really big and really tough interviews in Russian. Once COVID lifts a little bit, I'm\n\n1:45:13.280 --> 1:45:21.280\n traveling to Russia and I'll keep your advice in mind that the limitations is a kind of superpower.\n\n1:45:21.280 --> 1:45:28.480\n We should use it to our advantage because you do feel less, like you're not able to convey\n\n1:45:28.480 --> 1:45:34.720\n your wisdom in the Russian language. Cause I moved here when I was 13. So you don't,\n\n1:45:35.920 --> 1:45:40.480\n the parts of life you live under a certain language are the parts of life you're able\n\n1:45:40.480 --> 1:45:48.160\n to communicate. I became a thoughtful, deeply thoughtful human in English.\n\n1:45:48.160 --> 1:45:56.400\n But the pain from World War II, the music of the people that was instilled with me in Russian.\n\n1:45:56.400 --> 1:46:01.600\n So I can carry both of those and there's limitations in both. I can't say philosophically\n\n1:46:01.600 --> 1:46:08.160\n profound stuff in Russian, but I can't in English express like that melancholy feeling\n\n1:46:08.160 --> 1:46:11.840\n of like the people. And so combining those two, I'll somehow.\n\n1:46:11.840 --> 1:46:18.880\n Oh, beautifully said. Thanks for sharing. This is great. Yes. I totally understand you. Yes.\n\n1:46:18.880 --> 1:46:24.960\n You've accomplished some incredible things in the space of science, in the space of\n\n1:46:26.160 --> 1:46:32.560\n technology, in the space of theory and engineering. Do you have advice for somebody young,\n\n1:46:33.120 --> 1:46:37.840\n an undergraduate student, somebody in high school or anyone who just feels young\n\n1:46:37.840 --> 1:46:43.120\n about life or about career, about making their way in this world?\n\n1:46:43.920 --> 1:46:50.480\n So I was telling before that I believe in emotion and my thing is to be true to your\n\n1:46:51.360 --> 1:46:58.480\n own emotion. And that I think that if you do that, you're doing well because it's a life well spent\n\n1:46:59.200 --> 1:47:05.840\n and you are going never tire because you want to solve all these emotional knots that\n\n1:47:05.840 --> 1:47:13.360\n always intrigued you from the beginning. And I really believe that to live meaningfully,\n\n1:47:13.360 --> 1:47:20.320\n creatively, and yet to live your emotional life. So I really believe that whether you're a scientist\n\n1:47:20.320 --> 1:47:25.360\n or an artist even more, but a scientist, I think of them as artists as well. If you are a human\n\n1:47:25.360 --> 1:47:31.840\n being, so you are really to live fully your emotions and to the extent possible, sometimes\n\n1:47:31.840 --> 1:47:39.520\n emotions can be overbearing and my advice is try to express them with more and more confident.\n\n1:47:39.520 --> 1:47:45.200\n Sometimes it's hard, but you are going to be much more fulfilled than by suppressing them.\n\n1:47:45.840 --> 1:47:49.120\n What about love? One of the big ones. What role does that play?\n\n1:47:50.400 --> 1:47:58.720\n That's the bigger part of emotions. It's a scary thing. It's a lot of vulnerability that comes\n\n1:47:58.720 --> 1:48:10.400\n with love, but there is also so much energy and power and love in all senses and in the traditional\n\n1:48:10.400 --> 1:48:19.040\n sense, but also in the sense of a broader sense for humanity, this feeling, this compassion that\n\n1:48:20.000 --> 1:48:28.560\n makes us one with other people and the suffering of other people. All of this is very scary stuff,\n\n1:48:28.560 --> 1:48:37.280\n but it's really the fabric of life. Well, the sad thing is it really hurts to lose it.\n\n1:48:38.320 --> 1:48:43.040\n Yes, that's why the vulnerability comes with it. That's the thing about emotion is\n\n1:48:43.840 --> 1:48:51.440\n the up and the down and the down seems to come always with up, but the up only comes with the\n\n1:48:51.440 --> 1:49:01.680\n down. Let me ask you about the ultimate down, which is unfortunately we humans are mortal\n\n1:49:02.640 --> 1:49:10.240\n or appear to be for the most part. Do you think about your own mortality? Do you fear death?\n\n1:49:11.200 --> 1:49:19.840\n I hope so. Without death, there is no life. At least there is no meaningful life. Death is\n\n1:49:19.840 --> 1:49:26.480\n actually in some sense our ultimate motivator to live a beautiful and meaningful life. I myself\n\n1:49:26.480 --> 1:49:33.760\n felt as a young man that unless I got something that I wanted to do, I don't know why I got this\n\n1:49:33.760 --> 1:49:39.760\n idea of something to say. If I'm not able to say, I would suicide. Maybe it was a way to motivate\n\n1:49:39.760 --> 1:49:44.720\n myself, but you don't need to motivate it because in some sense, unfortunately, death is there.\n\n1:49:44.720 --> 1:49:55.280\n So you better get up and do your thing because that is the best motivation to live fully.\n\n1:49:56.160 --> 1:49:59.040\n Well, what do you hope your legacy is?\n\n1:50:05.360 --> 1:50:06.720\n You mentioned you have two kids.\n\n1:50:06.720 --> 1:50:20.560\n Yes. I really feel that on one side is my biological legacy and that is my two kids\n\n1:50:21.840 --> 1:50:31.840\n and their kids, hopefully. That is one side. The other thing is this common enterprise,\n\n1:50:31.840 --> 1:50:41.440\n which is society. I really feel that my legacy would be better by providing security and privacy.\n\n1:50:42.400 --> 1:50:48.720\n Actually, for me, it's metaphorical to say I want to give you the ability to interact more and take\n\n1:50:48.720 --> 1:50:55.280\n more risks and reach out more for more people as difficult and dangerous as it may seem.\n\n1:50:55.280 --> 1:51:02.400\n But my whole scientific work is about to guarantee privacy and give you the security\n\n1:51:02.400 --> 1:51:08.400\n of interaction. Not only in a transaction, like it would be a blockchain transaction, but\n\n1:51:09.040 --> 1:51:17.280\n that is really one of the hardcore of my emotional problems. I think that these are\n\n1:51:17.280 --> 1:51:22.800\n the problems I want to tackle. Ultimately, privacy and security is freedom.\n\n1:51:22.800 --> 1:51:28.800\n Freedom is at the core of this. It's dangerous. It's like the emotion thing,\n\n1:51:30.400 --> 1:51:34.080\n but ultimately, that's how we create all the beautiful things around us. Do you think there's\n\n1:51:34.080 --> 1:51:42.000\n meaning to it all, this life, except the urgency that death provides and us anxious\n\n1:51:43.600 --> 1:51:48.800\n beings create cool stuff along the way? Is there a deeper meaning? If it is, what is it?\n\n1:51:48.800 --> 1:51:53.200\n Well, meaning of life. Actually, there are three meanings of life.\n\n1:51:53.760 --> 1:51:54.320\n Great.\n\n1:51:54.320 --> 1:52:00.480\n That's great. One, to seek. Two, to seek. And three, to seek.\n\n1:52:01.040 --> 1:52:04.640\n To seek what? Or is there no answer to that?\n\n1:52:04.640 --> 1:52:10.880\n There's no answer to that. I really think that the journey is more important than the destination,\n\n1:52:10.880 --> 1:52:19.840\n whatever that be. I think that is a journey and is, in my opinion, at the end of the day,\n\n1:52:19.840 --> 1:52:29.120\n I must admit, meaningful in itself. We must admit that maybe whatever your destination might be,\n\n1:52:30.240 --> 1:52:37.920\n at the end, we may never get there, but hell was a great ride towards it.\n\n1:52:37.920 --> 1:52:43.680\n Well, I don't think there's a better way to end this, Silvio. Thank you for wasting your extremely\n\n1:52:43.680 --> 1:52:50.240\n valuable time with me today, joining on this journey of seeking something together. We found\n\n1:52:50.240 --> 1:52:54.800\n nothing, but it was very fun. I really enjoyed it. Thank you so much for talking to us.\n\n1:52:54.800 --> 1:52:59.120\n Thank you, Alex. It's been really special for me to be interviewed by you.\n\n1:53:00.240 --> 1:53:03.280\n Thank you for listening to this conversation with Silvio McCauley,\n\n1:53:03.280 --> 1:53:09.840\n and thank you to our sponsors, Athletic Greens Nutrition Drink, the Information In Depth\n\n1:53:09.840 --> 1:53:16.880\n Tech Journalism website, Four Sigmatic Mushroom Coffee, and BetterHelp Online Therapy. Click the\n\n1:53:16.880 --> 1:53:22.240\n sponsor links to get a discount and to support this podcast. And now, let me leave you with\n\n1:53:22.240 --> 1:53:28.240\n some words from Henry David Thoreau. Wealth is the ability to fully experience life.\n\n1:53:28.240 --> 1:53:34.960\n Thank you for listening, and hope to see you next time.\n\n"
}